{
  "url": "https://seranking.com/blog/keyword-research/",
  "slug": "keyword-research",
  "title": "Tips and Trends to Doing Proper Keyword Research",
  "description": "What is keyword research and how to do it right. Check out this step-by-step guide to learn how to piece together a list of keywords to target on your site.",
  "content": "Blog / Keywords & Content / How to do keyword research for your websiteHow to do keyword research for your website Written by Andrew Zarudnyi Reviewed by Anastasia Kotsiubynska Feb 25, 2021 47 min read Doing keyword research, or collecting a list of keywords to target on your website, is one of the first steps in website promotion. In a nutshell, to improve website visibility, you need to analyze search queries on your site’s topic and select the best ones to target. Keyword research and the subsequent creation of a list of target keywords involves collecting every possible option people use when addressing search engines in a specific niche, breaking them down into thematic clusters, and filtering out unnecessary ones. A solid list of target keywords helps you better understand potential clients, create an optimal site structure, and develop an effective strategy for SEO, Google advertising and other marketing channels. Basically, we’ll focus on the process of collecting search queries and using them to drive targeted traffic to a site. Let’s jump in! Why you need to do keyword research Keyword research plays a crucial role in SEO, Google advertising, social media marketing and other digital marketing channels where the system is aimed at finding and putting forward relevant products, services, or information upon user request. Studying the psychology behind niche searches and expanding your website’s list of target keywords as much as possible allows you to create a website with optimized content that sells and provides value. Here’s a list of cases when you can use search queries collected during keyword research: Creating and improving site structure Understanding target audience interests (user intent) Searching for useful content ideas Writing titles, descriptions, h1-h6 headings Optimizing images Selecting anchor texts for internal and external links Creating a keyword list for SERP rank tracking Targeting contextual and banner advertising Setting up chat bots, providing answers to user questions But if you want your site’s target keyword list to deliver the right results, you have to: a) fill it with the right keywords b) organize it in a certain way, and c) put it to work. Here are several common issues associated with the incorrect use of search queries in a website’s keyword list: 1. There are a lot of left out, untargeted keywords that drive traffic to competitor pages.2. Other pages of the website come up in search instead of the keyword-optimized page.3. Keyword cannibalization sees different pages of the same website competing for a single search query. So don’t think that you can just blindly target all of the keywords from your niche and get the desired results. You have to target the right keywords. We cover the essentials of keyword research in our Academy’s SEO Basics Course. Make sure to check it out and dive into the essential techniques for finding the right keywords. The number of search queries in a typical keyword list I want to make it clear that there are no generally accepted standards as to how many keywords and key phrases you should find during keyword research and ultimately include in your website’s list of targeted keywords. The volume of the keyword list depends on the breadth of the site’s offering, the geography of the market, the popularity of the topic, the depth of the used semantics, as well as a number of other factors. For example, the keyword list of an online store that sells popular products will include several categories. And websites that focus on selling little-known or highly specialized products will most often assemble their keyword list piece by piece, expanding it only when there’s a specific need. Now, before a long list of targeted keywords is cleaned or optimized, there’s a really good chance it contains a vast number of high-volume search queries that are irrelevant or are too complicated to get top SERP spots, as well as key phrases that practically never get searched for. A big part of such keywords usually turns out to be ineffective in terms of driving traffic and conversions. Taking this into account, we can conclude that it’s the potential of keywords and not their quantity that plays a primary role in SEO. Semantic SEO: focusing on quality over quantity Let me make this perfectly clear—search engines try to provide users with the most relevant results to their search queries. So, if a web page uses the right keywords, it has a better chance of ranking higher in search. However, the keywords on the page do not actually have to exactly match the user-submitted request because search engines also take into account synonyms and words that are close in meaning. This is referred to as semantic SEO which is the process of building more meaning into the words you use in your content, and creating content aimed to satisfy the user intent. Analyzing search terms makes it possible to delve deeper into a niche, better understand a potential client, use the experience of competitors, and build a high-quality site structure. The wider the range of target keywords, the more traffic they can drive to the site. How search engine algorithms work In recent years, search engines have started to understand user queries and page context much better. Since search queries are becoming more detailed and are moving closer to colloquial speech, the popularity of voice search is growing. In turn, search engine algorithms use associations and synonyms embedded in the machine learning system to better determine the search intent and ultimately provide more relevant results. Google’s BERT algorithm uses artificial intelligence to process natural language and recognize search queries, including long-tail keywords and even complete sentences. As far as analyzing website content goes, the new SMITH algorithm plans to take things a step further. If BERT aims to recognize words in the context of small text chunks, the SMITH algo will parse the entire text. A new method for ranking passages appeared back in 2020: it is based on the processing of long pieces of text, breaking them down into thematic segments (passages), and determining the fragment that best matches the search query. As a result, relevant text fragments started to appear in the search results, and its most relevant parts are now highlighted in the brief page content description. So, taking into account constant search engine algorithm developments, websites that want to solidify their position on the map definitely need to focus on a wide range of keywords. How to do keyword research Doing keyword research to ultimately put together a list of target keywords for a website is a complex process that includes analyzing the site’s niche, topic and structure, working with special software tools, and manually editing the collected list of search queries. There are two basic principles to doing keyword research: Collecting the maximum number of keywords and filtering them Handpicking keywords from the very beginning and then subsequently expanding the list 3 steps to piecing together a keyword list Doing keyword research, or creating a list of target search queries, can be divided into three distinct steps. Decide how you want to compile the keyword list. There are several strategies you can use to put together a list of target keywords. Each one is used depending on whether the website already has a structure or is only being developed, how well it’s optimized, what its keyword rankings are, and so on. Do keyword research using special tools. Software solutions that allow you to conduct keyword research make it possible to cover a lot of ground and collect the maximum number of search queries and search engine suggestions. For optimum results, you’ll need to choose your best SEO keyword research tool that goes beyond the basics and, among others, enables you to analyze the keywords of competitors too. Refine your website’s list of target keywords. Transforming a scrambled cloud of topically related search queries into a functioning list of targeted keywords is a process that includes two stages: Removing irrelevant keywords from the list Bucketing keywords into groups By the way, you can also exclude keywords from your list during the research. Note that you should distribute keywords across your site’s URLs only once you’ve grouped them into thematically related buckets. In the following sections, we will take a closer look at all the stages of building a keyword list. Approaches to doing keyword research Let’s check out several standard ways of creating a list of target keywords. Depending on your specific case, you can use one of the approaches below or develop your own individual strategy. First approach: Structuring a new site based on its keywords Research the market niche/product family/client brief. Determine a list of seed keywords. Collect the maximum number of search queries for each seed keyword. Get a list of the top 20 search queries that direct competitors rank for. Remove all duplicates and junk search queries (given that you have a list of negative keywords). Group keywords automatically via SE Ranking. Do a final keyword list cleanup. Break the site structure down into sections, categories, pages based on keyword groups. Second approach: Doing keyword research for a ready-made site structure Analyze the site’s structure and sections. Define a list of seed keywords. Get a list of the top 20 search queries that direct competitors rank for. Collect the maximum number of relevant keywords for search queries from step 2 and 3. Remove all duplicates and junk search queries. Distribute collected keywords across existing categories and pages. Third approach: Updating a site’s keyword list Analyze the site’s existing list of targeted keywords. Look for weak points and vulnerabilities: collect topically relevant keywords, study search engine suggestions, analyze competitors to identify missing keywords. Create a list of missing keywords and distribute them across sections, categories, pages. We reached out to several experts in the field to find out if they think it’s better to collect a lot of keywords and then get rid of irrelevant ones or to collect only relevant keywords at the risk of missing interesting search queries. Here’s what they had to share: Joe Williams, founder of Joe Wills, said: I start by getting clear on the topic I am researching. From there, I tend to focus mainly on keywords that are relevant to the topic, but I’ll brainstorm an extensive list of keywords and not worry too much about search volumes. I can cut off lower volume search volumes later. That way, hopefully, novel or interesting keywords are still caught in the net. SEO guru Omi Sido stated that: I wish I could only collect relevant keywords as this is going to save me lots of time and money. In reality, I normally collect lots and lots of keywords and once I’ve decided on the most efficient terms that I’ll be targeting I would just get rid of all irrelevant keywords. As I’ve mentioned earlier I am also interested in the profit-generating potential of the keywords I am choosing. Having a high search volume is good but most of the frequently-searched-for keywords are purely informational. While they attract a lot of visitors to the site they may not necessarily bring revenue. Most of the time this is not good for the business and subsequently, this is not good for my salary. How to collect search queries for your keyword list Whenever you decide to create and/or expand your site’s keyword list, you will have to use special software solutions. For convenience reasons, it’s best to create a single table from the lists of all collected search queries. Let’s find out what you can do to net as many keywords as possible and not miss a single one. Search for possible keyword variations Think about what people type into the search box to find products/services in your niche. Besides the obvious keyword options, phrases, synonyms, and slang expressions that are similar in meaning are often searched for as well. Below, you’ll find a list of all the different ways you can do keyword research for your site. Define the seed keyword For example, a company provides construction services. The main search queries (or seed keywords) in this niche will be “repair”, “construction services”, and “renovation work” to name a few. Each product/service category has its own basic semantics, usually consisting of high-volume keywords. Find all queries related to high-volume keywords You can always take the most relevant high-volume search queries on a specific topic, look for other keywords in search engines that contain the same root, and find out what their monthly search volume is. For example, the seed keyword “repair services” corresponds to “London repair services”, “repair services price” as well as many other useful key phrases. Expand the keyword list by combining queries Your keyword list can be expanded with the help of the semantic matrix, which involves searching for search queries by using qualifying words, such as: Names of goods, service categories Name of brand, online store, company Commercial words: “buy”, “order”, “price” and so on Model descriptions, technical characteristics of goods You can use special tools to find the best combinations of high-volume search queries that include “buy”, “price”, a brand name, a city, and other words. Note: Check the search volume of keywords that were generated automatically. Only promising search queries should be added to your site’s list of target keywords. Find synonyms, abbreviations, and other search options Here are some not-so-obvious search queries that you should consider during keyword research: Word forms and synonyms of services and goods (“order a translation”, “translation services”, “translation agency”) Abbreviations Slang and colloquial terms typical for a niche Transliterated terms Grammar mistakes that aren’t fixed automatically (“smartphone in a camera”) Find search engine suggestions In addition to qualifying words like “buy” or a brand name, the search query could have a “tail” that provides even more details for the search. I’m referring to long-tail keywords that can drive quality traffic to a website. A search query that includes a lot of words after the head term (aka the tail) like “buy a folding white sofa from a manufacturer” or “buy a sofa for a small room in Baltimore” provide far more information than the phrase “buy a sofa”. When asked how often he uses search engine suggestions, Joe Williams said: Most days for personal use. But from a keyword research perspective, probably monthly. Omi Sido confirmed the importance of suggestions, saying: The easiest way to find semantic keywords for any topic is to use Google Suggest so this ‘tool’ would be my starting point for almost every topic research. By the way, have you noticed how detailed and long-tailed those keywords suggestions typically are in Google? And knowing that they are based on real searches done through the search giant they would be the first keywords to add to a keyword list. You could, for example, find combinations of long-tail keywords by analyzing search engine suggestions. Some tools can even provide you with a ready-made list of search engine suggestions. To get the full picture, it’s also worth analyzing search queries on YouTube, Quora, forums, and other sources. Analyze competitors Being aware of and targeting the keywords that your competitors rank for will help increase the search visibility of your own website both in organic and paid search. To discover effective keywords targeted by competitor sites, you must first identify niche/topic leaders. For new sites: study the niche and its main keywords to understand which sites are ranking for them. For existing sites: find semantically related websites by using special services that identify sites that rank for keywords similar to the ones targeted by your site. Once you have a list of the top direct competitors, determine the search queries they rank for. Upon analysis, you could discover keywords that you’re not targeting as well as those that are more effective at driving traffic. You should definitely add such keywords to your site’s list. These processes are actually automated in special SEO services, which enables you to get more accurate data and save time. How often you need to do keyword research As you can see, conducting keyword research to put together a list of target keywords is a rather laborious and time-consuming process. For this reason, you can’t help but wonder how often you should expand it. Well, it all really depends on the niche. Some websites will require you to do some expansion work every month, while others will do just fine if you update their keyword list once a year. Joe Williams had this to say on the subject: It’s clear Google is shifting more towards a semantic web and semantic search. So, I always start a new SEO project by looking for the connections between big topics and their subtopics whenever developing a content plan for a client. I’ll revise or expand this plan every six to twelve months. Omi Sido said: First, let me clarify something: the term semantic SEO means different things to different people. Personally, I see semantic SEO as entity-based SEO where the optimisation is done around topics instead of individual key phrases. But to answer your question: a semantic keyword database is the most effective way to manage keywords for organic (and paid) search marketing campaigns so I would try and build one for almost every client. The way I see it the keywords in a privately built database come from the real search queries used by actual visitors to a company website and as an SEO I am 100% sure which keywords are driving traffic and conversions so I don’t have to rely on relative volume estimates given by public tools. Keyword research tools Special tools can help you automate and speed up the keyword research process. Let’s take a look at some of the best ones the market has to offer. Doing keyword research from scratch In order to find search queries via special tools, all you have to do is enter a word or a phrase into the search bar, and as a result, the system will display similar search queries. Such services provide information on each keyword’s search volume—the number of times a search query is looked for on search engines a month. Now, to assess the demand for products or services based on the search volume of their seed keywords, you need to define the search region that interests you. Note that a keyword’s search volume is also influenced by the search engine’s popularity in the selected country as well as the keyword’s seasonality. Below, you will find popular tools that can help you obtain keyword stats. Keyword Planner This tool collects statistics on every search query entered into Google and can be accessed from your Google Ads account. 2. Keyword Research from SE Ranking The main advantage of this tool is that it provides detailed statistics on the analyzed keyword and on search queries similar to it. For each keyword, the tool generates a list of similar search queries, relevant phrases, and search engine suggestions. Plus, it indicates their search volume. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze The keyword difficulty score will help you understand how competitive each organic keyword SERP is, and the cost per click will help you assess the level of competition in ad campaigns. The Bulk Keyword Analysis option allows you to check several keywords at the same time, which gives a huge boost to the entire process. Here, keywords are added in the form of a table or entered manually into a special field: Find out more about how this tool can help you by checking out our video. Expanding your keyword list If you need to expand your list of target keywords, you will most likely have to use the combination method. Keyword combinations with the terms “buy”, “delivery”, the name of the city, and other clarifications can be conveniently generated through online services. Here’s an example of what a part of the semantic matrix looks like in an Excel table: Next, for each combination obtained as a result of multiplying keywords, you need to select an additional list of phrases. Doing so will help you further expand your keyword list in the process. Similar automated services include WordStream’s Keyword Tool, Key-Collector, Keyword Tool, and others. To get even more search query options, you should use search engine suggestions and other ways of finding long-tail keywords. Let’s take a look at some of the main ones. Google Trends When entering a keyword into Google Trends, besides seeing the dynamics of its popularity, you can also get a list of “Related queries.” 2. SE Ranking In addition to getting a detailed report on a specific search query in the Keyword Suggestion tool, you also get a list of search engine suggestions that can be downloaded in the form of a table. 3. Other methods Special services for keyword research aren’t your only option. You can also use Google Search, analyze discussion forums, and other similar websites. Google Search When Googling something, 9 times out of 10 you will see the People also search for or People also ask blocks. This is one of the first places to go to to look for more keywords to add to your site’s list of target keywords. Topical forums, review sites, Q&A platforms Studying such sites will help you find out what non-obvious problems and needs your target audience has, and as a result, you’ll be able to add the corresponding keywords to your site’s keyword list. Besides specialized communities, potential customers ask questions on Reddit, Quora, Yahoo! Answers, and other discussion sites. Borrowing keyword ideas from competitors SE Ranking’s Competitive Research tool will help you get a list of search queries that other companies target to drive traffic to their sites. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze Here’s what you have to do: Identify your site’s top competitors Access the Competitive Research tool, enter the URL of your website into the search box, and select a country you do most of your business in. Once all the data gets pulled up, you’ll get a report that contains a list of sites you’re going up against in organic and paid search. 2. Find competitor keywords that aren’t included in your list Start by opening the full report on your site’s organic competitors. By clicking on a number under the Missing Keywords column, you will get a list of keywords for which a specific competitor’s site ranks for in search, but your site doesn’t. Note that only direct competitors should be selected from the suggested list. In the example above, you can see that the direct organic competitors of bestbuy.com in the United States are amazon.com, ebay.com, and walmart.com. But note that it doesn’t really make sense to compare the keyword list of a consumer electronics retailer with that of a telecommunications company like verizon.com, so you need to be diligent. If you are totally unaware of the sites listed as your competitors, study them first by clicking on the link. 3. Compare the keyword list of your site with several competitors at once Under the Competitor Comparison subtab, you can simultaneously compare the semantics of your site with that of two competitors to find keywords both rival sites rank for, but your site doesn’t. The search volume and difficulty score metrics are listed for each keyword. They will help you find search queries outside of your keyword list that have the potential to drive traffic. 4. Conduct keyword research across every major competitor To find as many promising search queries as possible, it is worth analyzing the keyword list of your site in comparison with as many competitors as possible. Doing keyword research for existing sites Website optimization is an ongoing process that demands constant analysis and improvement. You can find new promising keywords to target by using the tools mentioned above, but don’t forget to exclude key phrases that you already use in your promo activities. Another way of increasing traffic is to find keywords that help your site be visible in search and upping the ante on their optimization efforts. You can find a list of all search queries that get impressions on Google and get clicked on by going to the Performance report in your Google Search Console account. If you have connected GSC to SE Ranking, you can find a list of such keywords under the corresponding section of the Analytics & Traffic module: If you see that a keyword has good indicators, but it is not tracked by the system, chances are that keyword isn’t in the list of target keywords and you should continue optimizing it. By the way, you can add a keyword to a project in SE Ranking and start tracking its ranking positions in a single click. Cutting irrelevant keywords from your list The tools listed in the previous section can help you get the largest amount of search queries in a niche. However, not all of them are relevant in terms of the site’s business goals. So, before starting any optimization work, clear your site’s target keyword list of all junk and non-targeted keywords. What keywords should be removed Let’s take a look at the common types of search queries you should definitely get rid of. Irrelevant search queries Such keywords don’t express any interest in the product, intent to buy or place an order. For example, a user can search for a definition on Wikipedia, articles on a given topic, or images. Irrelevant search queries will be ineffective for promotion. Keywords from other topical niches If an online store sells wallpapers, then the keyword “desktop wallpaper” surely shouldn’t be in its semantics. You need to remove every search query that isn’t related to other topics. Duplicates You can often find duplicates in lists of search queries for different seed keywords in the general niche. Removing all duplicates will improve the quality of your site’s keyword list. Products that aren’t available on the site Search queries that mention other brands, non-existent product types, or characteristics are ineffective in terms of SEO because they contradict the buyer’s intent. Using them in your site’s content reduces the URL’s click-through rate and leads to an increased bounce rate. Name of competitor site/company/brand When search engines are asked to provide results to such search queries, they try to find the most relevant web page. As a result, the competitor’s website will most likely be ranked #1 in organic search. Keywords that mention niche competitor companies and brands are only used if the site contains content that mentions them like a review or a comparison chart (brand 1, brand 2, etc.). With regard to advertising, some PPC strategies intentionally target branded keywords of other companies. PPC ads can be displayed above regular search results, which makes it possible to intercept customers and increase the awareness of your own site. Misspelled phrases Search engines are able to automatically correct keyword errors and typos, as well as recognize sets of characters entered in an alphabet other than Latin. For this reason, such keywords don’t have any positive effect on SEO. Keywords containing the terms “free”, “download”, “DIY”, etc. You can easily come across such keywords in a wide variety of niches. They are used if the content of the site matches the user intent, for example, if a website specializes in handmade products or a platform offers some sort of uploads/downloads. In e-commerce, these search queries are usually classified as irrelevant and non-targeted. If they are not added to the list of negative keywords as you are setting up your contextual advertising campaigns, their impressions can and most likely will lower the CTR and even drain the marketing budget. Geographically irrelevant keywords This primarily applies to companies that operate in a small area usually limited to the city or town: food delivery services, local caterers, repair services, and so on. If a company delivers or provides services nationwide, some of the geolocation search queries related to other regions may come in handy. How to clean up your keyword list Let’s check out several approaches you can use to remove unnecessary search queries from your site’s list of target keywords. Pre-grouping clean up Junk keywords must be removed immediately after you’ve created a list of all search queries. Clean up after relevant keywords are defined First, define what keywords your site needs to target, and then remove all irrelevant queries from your keyword list. Remove non-targeted topical keyword groups Once you’ve grouped the keywords from your list into topical groups, find and mark keyword groups that are not relevant to the topic of the site. They should also be removed from your website’s keyword list. Keyword tags The essence of this approach isn’t to analyze the search queries themselves but their categories. So, determine what common characteristics your keywords have and draw up a chart that points out their correspondence, separating the root of the keyword from its supplementary tags. Then, with the help of a macros script, you can get columns with search queries and their corresponding tags. Columns for tags that are not typical for the site should be removed from the site’s keyword list. Sub Categorize Dim Cursor As Object, Map As Object, Range As Object Dim NumColumns As long, Col As long, NumRows As long Dim Head As String Map = ThisComponent.Sheets.getByName(\"\") Cursor = Map.createCursor Cursor.gotoEndOfUsedArea(True) NumColumns = Cursor.Columns.Count For Col = 0 To NumColumns - 1 Step 2 Head = Map.getCellByPosition(Col, 0).String If Head <> \"\" Then NumRows = LastRowWithData(Col) + 1 ParseMap(Head, Col, NumRows) End If Next Col MsgBox \"\" End Sub Sub ParseMap (ByVal Head as String, ByVal Col as long, ByVal NumMarks as long) Dim Names(1 To NumMarks) As String, Keys(1 To NumMarks) As String Dim Core As Object, Map As Object, Cell As Object, Source As Object, Cursor As Object Dim I, J, NumRows, CellIndex CellIndex = GetCellByName(Head) Core = ThisComponent.Sheets.getByName(\"\") Map = ThisComponent.Sheets.getByName(\"\") For I = 1 To NumMarks Keys(I) = Map.getCellByPosition(Col, I-1).String Names(I) = Map.getCellByPosition(Col + 1, I-1).String Next I Cursor = Core.createCursor Cursor.gotoEndOfUsedArea(True) NumRows = Cursor.Rows.Count For I = 1 To NumRows Source = Core.getCellByPosition(0, I) Cell = Core.getCellByPosition(CellIndex, I) For J = 1 To NumMarks If InStr(LCase(Source.String), LCase(Keys(J))) > 0 Then Cell.String = Names(J) End If Next J Next I End Sub Function GetCellByName (Head as String) Dim Core As Object, Cursor As Object Dim J Core = ThisComponent.Sheets.getByName(\"\") Cursor = Core.createCursor Cursor.gotoEndOfUsedArea(True) NumColumns = Cursor.Columns.Count For J = 1 To NumColumns If Core.getCellByPosition(J - 1, 0).String = Head Then GetCellByName = J - 1 Exit Function End If Next Core.Columns.insertByIndex(1, 1) Core.getCellByPosition(1, 0).String = Head GetCellByName = 1 End Function Function LastRowWithData (ColumnIndex as long) as long Dim Cursor As Object, Range As Object, Map As Object Dim LastRowOfUsedArea as long, R as long Dim RangeData Map = ThisComponent.Sheets.getByName(\"\") Cursor = Map.createCursor Cursor.gotoEndOfUsedArea(False) LastRowOfUsedArea = Cursor.RangeAddress.EndRow Range = Map.getCellRangeByPosition(ColumnIndex, 0, ColumnIndex, LastRowOfUsedArea) Cursor = Map.createCursorByRange(Range) RangeData = Cursor.getDataArray For R = UBound(RangeData) To LBound(RangeData) Step - 1 If RangeData(R)(0) <> \"\" then LastRowWithData = R Exit Function End If Next End Function Keyword grouping Creating search query clusters, or keyword grouping, is a critical step in the process of building a target keyword list for your site. Combining queries based on their common characteristics is necessary for the proper distribution of keywords across the site’s web pages, the implementation of advertising and SEO strategies, and the creation of effective content. Let’s take a look at how you can group search queries from your site’s keyword list. The basic principles of keyword grouping Intent-based keyword grouping How to define a keyword’s intent In SEO, the term “intent” is used to describe the purpose of an online search. In other words, what does the user want to find when running a search on Google. An obvious intent enables search engines to show the most relevant results to users. Websites that are optimized for similar keywords are more likely to be seen by their target audience. Let’s take a look at several typical examples of search queries with different intents. Example 1. Interior design services. The search query “Scandinavian style” may indicate the user’s desire to read up on the topic or see examples of an interior designed in this style. But if we take the key phrase “designer for an apartment” or “apartment designer”, they will most likely be used when looking for a specialist who provides interior design services. Both keywords are related to the same topic but have completely different intents. Example 2. Travel accessory vendor. You will see very different SERPs for keywords like “sleeping bag types”, “sleeping bag shop”, and “red point sleeping bag”: informational articles, product pages, comparative brand reviews. Example 3. Sale of furniture. The intent of the search query “buy used sofa” meets the goals of a marketplace like ebay but does not correspond to the product range offered by an online store. The keyword “jacquard sofa” does not have additional words that specify its intent. As a result, the search results can be very mixed. For example, a user searches for information on sofas with jacquard upholstery and enters the search query “jacquard sofa”. The search results will contain links to commercial sites along with information on the jacquard fabric: But when you enter the search query “corner sofa with delivery”, the search engine displays commercial results that sell sofas and deliver them as well. In other words, search engines provide results that are closer to the intent of the search. Why it’s important to define keyword intent Knowing the purpose of the search helps you better understand your potential customers and optimize your site for them. In turn, this will help search engines better rank your site’s web pages. Now, let’s see how you can group keywords by intent. Keyword types based on intent: Informational. Examples: “quick breakfast options”, “how to assemble a wardrobe”. Their main goal is to get more information on a specific subject. Comparisons and reviews. Examples: “xiaomi samsung phone compare”, “LaPlaya thermos reviews”. Such queries are different from informational queries in that their intent has a distinct commercial aspect to it, as in users express desire to make a purchase. Commercial. Examples: “buy a smartphone”, “order bedroom furniture”, “Christmas tree with delivery”. This category includes transactional keywords that indicate the action that the user wants to take. Branded+commercial. Examples: “Nike running shoes”, “Amazon sale”. Such search queries indicate that the user is interested in a specific product/site/company and is likely to make a purchase in the near future. Vital/branded. Examples: “Pepsi”, “Verizon store”. Contain a name of a brand and do not show any signs of commercial interest. Branded informational. Examples: “Mercedes automobile”, “Sony TVs”. Simple as that. Navigational. Examples: “Italian restaurant in Chicago”, “New Mexico balloon festival” Such queries seek to get more information about a venue, event, or a specific website. Media queries. Examples: “download meditation music”, “psychology audiobook”. Such queries aim to locate multimedia files. Mixed keywords. Various combinations of above-mentioned query types. Examples: “february concerts info”, “samsung smartphone store prices”. Keywords without a clear intent. This category includes inaccurate phrases or those that can be simultaneously included in several keyword groups. OneBox keywords that search engines provide instant answers to. Search queries can transform from one type into another as with market changes or once a specific event (for example, concert) ends. Geo-based keyword grouping All of your keywords can additionally be divided into those with and without a location reference: Geo-dependent keywords are linked to the user’s location. For example, “flower delivery”, “buy a sofa in Liverpool”, “where to go this weekend”. Geo-independent keywords are independent of the user’s location. For example, “pancake recipes”, “Cinderella cartoon online”, “why birds fly.” Geo-dependent search queries do not always contain the name of a city or country, but the search results are usually linked to the location determined by the search engine. It’s also worth noting that keywords that don’t specify a location usually have a higher level of competition. For example, it’s much easier to get top ranking positions for the search query “cupcake delivery in Newcastle” than for “cupcake delivery”. If a company operates in a specific city or covers different communities and settlements thanks to branch offices and deliveries, it’s worth creating keyword groups that mention these locations and targeting them in your SEO campaigns. Search-volume-based keyword grouping The number of times a keyword is searched for each month on search engines like Google is a good indicator of how much traffic a website can potentially get by targeting that specific keyword. Typically, keywords with different search volumes are targeted in SEO campaigns. Keyword types based on search volume: High-search-volume keywords. These are the most popular searches that generally have a high level of competition, and as a result, should not be targeted by new sites. Mid-search-volume keywords. Unlike high-search-volume keywords, these search queries usually have specifications and are more informative in terms of intent. Targeting them in SEO helps attract high-quality targeted traffic. Low-search-volume keywords. People look for such keywords in search less often than others, but you may well find many long-tail keywords among them—as in search queries with additional details that, if used correctly, make it easier to get top ranking spots faster and help turn clicks into conversions. Niche keywords. These search queries have an extremely low search volume close to zero. If you have a targeted question with a specification, it might turn out to be very useful for SEO. In other cases, niche keywords practically don’t get any hits and there is ultimately no point in using them. Let’s get one thing straight: search volume is a relative term. Each niche, region, season, and even search engine will have its own range of a keyword’s popularity. For example, in some cases, all keywords with a search volume below 200 can be considered low-search-volume queries, but in other cases, this number can be the niche maximum. Sorting keywords by search volume helps carry out SEO and PPC strategies. For example, when distributing keywords across your pages based on the site’s hierarchy structure, put high-search-volume keywords on the homepage, mid-search-volume keywords on category pages, and low-search-volume keywords on product cards. Moreover, sorting keywords like this will come in handy when promoting a new website: start increasing the site’s visibility by targeting low-search-volume keywords that have a relatively low level of competition and then gradually add on keywords with a higher search volume. Putting together a list of negative keyword list A list of negative keywords is useful when targeting ads by keywords. For example, in order to minimize the number of irrelevant impressions and clicks, professional translation agencies should exclude such keywords as “online”, “free”, and “credit card” so that the ads aren’t displayed to a non-target audience. A negative keyword list can be created during the keyword research and grouping process. To find every negative keyword in your site’s keyword list, use the “Find” function or use automatic search in Key-Collector, Keyword Tool, etc. Distributing keywords across site pages To yield positive SEO results, your keywords must be correctly distributed across your website’s web pages. Many landing pages, such as the homepage or category descriptions, can actually cover multiple subject groups. When optimizing sites for search engines, it’s important to cover their semantics—as in include all of the main topical keywords—and use as many search queries from your website’s keyword list as possible. It is best to distribute keyword groups across pages that have specific subtopics. For example, the search queries “notary services” and “legal services” should be targeted by different URLs. If you have a lot of keywords to target, you can create additional pages to cover all of them: an article section, new product cards, and so on. For more information on how to create a site structure, check out our article. How to speed up the URL grouping process To correctly distribute keywords across a site’s pages, you need to break your keyword list down into thematic groups—and don’t forget to indicate the search volume. This can be either done manually or via SE Ranking’s Keyword Grouper tool. The tool groups keywords together based on their SERP similarities. Want to learn more about Keyword Grouper? Check out our YouTube video on it! To make use of this function and process your website’s target keyword list online, all you have to do is add a list of keywords, and the service will take care of the rest. Find out more about how keywords can be grouped automatically in our article on the mechanics behind keyword clustering. In the example below, we can see what a website’s keyword list looks like once it’s been broken down into keyword groups: As you are grouping keywords for your site’s keyword list, think about which keywords should go on the homepage, which ones are suitable for category pages and product descriptions, and which ones should be used in informational content. Note that different keyword groups can be created for a single page. At the same time, one keyword group can be used on multiple pages. Top ranking pages vs. user intent keyword groups Keyword groups created during the automatic keyword grouping process should ideally contain keywords with the same user intent. But it can happen that search queries with different intents will fall into the same keyword group or cluster. So, what do you do when this occurs? Once again, we asked our experts for a comment, and Joe Williams said: I often do both—group keywords by top-performers or by semantic similarities. But I’d recommend grouping by semantics first, so focusing and grouping a topic, and this will help with keyword and intent targeting. Then, I also like to group keywords by sitewide priority, so I can filter to see whether my most important keywords are performing or not. Omi Sido also shared his expertise, saying: I normally group my keywords by semantic similarities because well-organized semantic clusters contribute to a strong website structure and help with writing high-performing web copy. From my personal experience, a copy that’s written with semantic SEO in mind provides all the answers to the questions my potential clients are searching for as well as the questions they didn’t even know they had. Common keyword research mistakes For maximum efficiency, avoid making the following mistakes when compiling your website’s list of target keywords: Incorrect keyword distribution across pages. Don’t use a large number of search queries on one page and definitely don’t mix queries from different topics. Stick to the rule that one page should answer one user intent. Surface-level keyword collection. If you only pick out obvious keywords and don’t further expand the site’s keyword list by carefully analyzing the relevant search queries, you could potentially end up losing a lot of traffic. On top of that, do not forget to analyze your digital rivals, look for synonyms and other ways of getting promising keywords in terms of traffic. Creation of different pages for identical keywords. For example, the search queries “order furniture” and “buy furniture” should go on the same page. Incorrect keyword distribution across URLs. Keywords need to be grouped in such a way that their intent and topic on the page are not blurred and do not mislead the users. It is highly unlikely for people who Google “car rental” to stick around on a page if all it talks about is auto repairs. This is critical because search engines take the bounce rate into account when assessing a site’s value to users. Poorly cleaned keyword list. Besides having keywords that are wrong for your site in terms of topic and user intent, your website’s keyword list can also contain “empty” search queries that have an extremely low (or none at all) search volume. Using them in SEO and advertising will be ineffective. Note: Use keyword research tools that provide reliable and accurate data to avoid having search volume errors. How to use a ready-made keyword list For organic traffic Doing keyword research to build a website’s keyword list is the starting point of any SEO strategy. Here’s how you can put your site’s target keywords to use: HTML tag optimization Keywords and key phrases are used in the creation of content titles, descriptions, and headings. Search engine bots analyze page structural elements and take them into account when ranking pages. Promotion of visual content Using keywords in the names of images, their titles, and alt tags increases the images’ chances of appearing in search engine Images sections and attracting additional traffic as a result. Development of an anchor text strategy Including keywords in the anchor texts of internal site links as well as in the backlinks from other sites will increase your search visibility for relevant keywords. Content creation Keywords are also used in SEO copywriting. Having in-text search queries solves two problems at the same time. First, it helps create useful content with answers to users’ questions, and second, it sends a signal to search engines that relevant information is present on the page. For paid traffic When running ad campaigns on Google, keywords are used as a targeting method for contextual advertising and as a way of finding the best banner ad placement options. To create ad groups, you can either use your ready-made keyword list groups or sort the search queries separately. For search ads, you can target keywords that get more than 10 or 20 monthly searches. Keywords with a lower search volume either won’t get any clicks or will be covered by the built-in match type mechanisms. In layman’s terms, your ads will appear not only for the keywords you defined but also for other keywords that Google will consider to be relevant. You can also use broad match keyword targeting. If you put a plus “+” sign next to a keyword in the search box (for example, “+buy+iphone”), search engines will show your ads both for the search queries “buy iphone cheap” and “where to buy used iphone”. As a result, you may find new keyword combinations capable of driving conversions. Such keywords should be added to the advertising section of your website’s keyword list. Furthermore, when putting together a list of keywords for your website, you can immediately see which keywords are irrelevant and shouldn’t be targeted in your ads. So, add such keywords to your list of negative keywords, and if a user query contains a keyword from this list, they will not see your ad. For other promotion channels Targeting search queries is relevant not only for SEO and advertising but also for other promotion channels where users can run searches. Knowing what keywords are used in a topic will help you promote your site on social media, YouTube, various marketplaces, and other channels. Our industry experts were also kind enough to let us know what they do with their keyword lists after keyword research, and Joe Williams stated that: Once it’s built, and if it’s shaping up to look like Topic Clusters or a Content Hub, then it’s time to promote it. So, I’ll slowly build up connections with influencers and interact with them. When the time is right, and the relationship has developed, it’s time for the outreach, asking for a link or promotion on their social media channels. Omi Sido also shared his wisdom, saying: The simple answer to this question would be “once you’ve built it use it as often as possible.” But in reality, the building process is never finished. In today’s busy digital marketplace, creating content is a never-ending story. Publishing “great content’ can help a business build trust with prospective leads and customers. To add to this when your business is consistently publishing content across various digital platforms, your customers may come to see you as a leader in your niche. I strongly believe that approaching SEO from the point of view of ‘strings, not things’ helps to increase sales because it allows you to connect with and educate your sales leads and frequent buyers. In other words, with the help of semantic SEO, you are giving your clients the guidance, the knowledge they need to make an educated purchasing decision. Final thoughts Doing proper keyword research and collection can help you better understand the intent of your users, and as a result, effectively optimize your site both for search engines and people. A website’s list of target keywords is the bedrock for the creation and improvement of the site’s structure, content, performance in organic search and other marketing channels. Knowing the basic principles behind creating a list of keywords and being aware of the tools that can help you put it together, you’ll be able to streamline the entire website promotion process and make it more efficient. TL;DR? Here’s what you have to do to get a list of keywords your website will target: Analyze the website’s topic. Select a keyword research approach. Define the seed keywords for pages and categories. Collect as many search queries options as possible via special tools. Optimize your keyword list by removing irrelevant queries, bucketing the remaining ones into groups, and creating a list of negative keywords. There’s no clear standards as to how many keywords should be in a site’s list of target keywords: one site’s list can include several thousand search queries, while another site can do just fine by targeting a couple of dozen of keywords. The main goal of creating a keyword list is to target the widest possible range of keywords, to understand exactly how users search for content, and to optimize your website for the right keywords. What is your approach to putting together a list of keywords to target on your website? What tools do you use? Be sure to share your experience in the comments section below. Content Marketing Keyword Research 12084 views Written by Andrew Zarudnyi Andrew is a content marketer, writer, editor, and webinar host at SE Ranking, plus a guest contributor across various marketing media. He is passionate about content, marketing, social media, and SEO best practices and leverages his experience to help companies reach their global audiences more effectively. When he’s not writing about SEO and marketing, he can be found spending time with his cat, enjoying a video game, watching too much soccer or playing the guitar (in that order).",
  "headers": [
    {
      "level": "H1",
      "text": "How to do keyword research for your website"
    },
    {
      "level": "H2",
      "text": "Why you need to do keyword research"
    },
    {
      "level": "H2",
      "text": "The number of search queries in a typical keyword list"
    },
    {
      "level": "H2",
      "text": "Semantic SEO: focusing on quality over quantity"
    },
    {
      "level": "H3",
      "text": "How search engine algorithms work"
    },
    {
      "level": "H2",
      "text": "How to do keyword research"
    },
    {
      "level": "H3",
      "text": "3 steps to piecing together a keyword list"
    },
    {
      "level": "H3",
      "text": "Approaches to doing keyword research"
    },
    {
      "level": "H4",
      "text": "First approach: Structuring a new site based on its keywords"
    },
    {
      "level": "H4",
      "text": "Second approach: Doing keyword research for a ready-made site structure"
    },
    {
      "level": "H4",
      "text": "Third approach: Updating a site’s keyword list"
    },
    {
      "level": "H2",
      "text": "How to collect search queries for your keyword list"
    },
    {
      "level": "H3",
      "text": "Search for possible keyword variations"
    },
    {
      "level": "H4",
      "text": "Define the seed keyword"
    },
    {
      "level": "H4",
      "text": "Find all queries related to high-volume keywords"
    },
    {
      "level": "H4",
      "text": "Expand the keyword list by combining queries"
    },
    {
      "level": "H4",
      "text": "Find synonyms, abbreviations, and other search options"
    },
    {
      "level": "H4",
      "text": "Find search engine suggestions"
    },
    {
      "level": "H4",
      "text": "Analyze competitors"
    },
    {
      "level": "H2",
      "text": "How often you need to do keyword research"
    },
    {
      "level": "H2",
      "text": "Keyword research tools"
    },
    {
      "level": "H3",
      "text": "Doing keyword research from scratch"
    },
    {
      "level": "H3",
      "text": "Expanding your keyword list"
    },
    {
      "level": "H3",
      "text": "Borrowing keyword ideas from competitors"
    },
    {
      "level": "H3",
      "text": "Doing keyword research for existing sites"
    },
    {
      "level": "H2",
      "text": "Cutting irrelevant keywords from your list"
    },
    {
      "level": "H3",
      "text": "What keywords should be removed"
    },
    {
      "level": "H3",
      "text": "How to clean up your keyword list"
    },
    {
      "level": "H2",
      "text": "Keyword grouping"
    },
    {
      "level": "H3",
      "text": "The basic principles of keyword grouping"
    },
    {
      "level": "H4",
      "text": "Intent-based keyword grouping"
    },
    {
      "level": "H5",
      "text": "How to define a keyword’s intent"
    },
    {
      "level": "H5",
      "text": "Why it’s important to define keyword intent"
    },
    {
      "level": "H4",
      "text": "Geo-based keyword grouping"
    },
    {
      "level": "H4",
      "text": "Search-volume-based keyword grouping"
    },
    {
      "level": "H3",
      "text": "Putting together a list of negative keyword list"
    },
    {
      "level": "H3",
      "text": "Distributing keywords across site pages"
    },
    {
      "level": "H3",
      "text": "How to speed up the URL grouping process"
    },
    {
      "level": "H3",
      "text": "Top ranking pages vs. user intent keyword groups"
    },
    {
      "level": "H3",
      "text": "Common keyword research mistakes"
    },
    {
      "level": "H2",
      "text": "How to use a ready-made keyword list"
    },
    {
      "level": "H3",
      "text": "For organic traffic"
    },
    {
      "level": "H3",
      "text": "For paid traffic"
    },
    {
      "level": "H3",
      "text": "For other promotion channels"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Andrew Zarudnyi"
}