{
  "url": "https://seranking.com/blog/leuke-recepten-case-study/",
  "slug": "leuke-recepten-case-study",
  "title": "Case Study: How a family business website grew to 4M visitors per month",
  "description": "1 in every 5 citizens in the Netherlands visits this food website. Find out how SE Ranking helped achieve this success.",
  "content": "Blog / Case Studies / How a family project became the #1 food website in the Netherlands with over 4M in monthly organic trafficHow a family project became the #1 food website in the Netherlands with over 4M in monthly organic traffic Written by Dmytro Davydov Dec 29, 2022 9 min read Client Leuke Recepten is a trendy Dutch cooking website. Over 4 million people visit it each month to find new recipes and learn more about cooking—that’s every fifth citizen in the Netherlands! More importantly, Leuke Recepten is an excellent example of how a small hobby website can become a successful family business with enough passion and the right tools. The story behind Leuke Recepten started in 2011. At that time, Sandra Koopmans and Eric Waterschoot worked at the publishing house. This is where they met, fell in love, and married, but also where they discovered a mutual interest in digital marketing. Immediately after Sandra and Eric moved in together, they decided to start their own website together. The idea of Leuke Recepten appeared naturally. Sandra enjoyed experimenting in the kitchen, while Eric photographed a lot in his spare time. They decided to create a food website where they could share their favorite recipes. They started cooking in Eric’s parents’ kitchen, where they lived together for some time. Sandra didn’t have much cooking experience at the time, so the idea behind their website was simple: easy and fun recipes for everyone. That’s how they came up with the name for their website: Leuke Recepten — Lovely Recipes. Sandra Waterschoot-Koopmans Co-founder On Leuke Recepten, I can express my creativity and passion for food. The nice thing about cooking is that you are never done, because there are still so many ideas you can realize. In the evenings and on the weekends, Sandra and Eric worked together at the kitchen table on Leuke Recepten. They barely had any knowledge of SEO at the time, though Google was less advanced then than it is now. Still, Sandra and Eric enjoyed working on their website and content. They’ve been using SE Ranking for the past three years and continue using it to gain more insight and improve their site. Now their website performs admirably and receives a lot of traffic. We met this beautiful couple in Amsterdam during the Webwinkel SEO conference. We were so inspired by their story and passion for SEO (and food, of course) that we couldn’t help but ask them to share their insights into how Leuke Recepten became so successful. Are you hungry for some fresh tips? Enjoy! Goals Sandra and Eric wanted their website to succeed, so they set the following goals: Increase search visibility and boost organic search traffic. Achieve top positions for target keywords, for example ‘spruitjes stamppot’. Increase the number of visitors by 10% compared to the previous year. Retain existing visitors on site for longer. Appeal to potential clients and drive business growth. Steps they took to reach these goals Eric and Sandra use SE Ranking almost daily, and so for this case study, we asked them about their usual approach to optimizing pages on their website. You’ll notice that they apply similar techniques for creating new pages as they do for updating existing ones. Their strategy is so straightforward that you can try it out for yourself. 1. Website structure optimization Before creating, updating, or optimizing their pages, Eric and Sandra fixed their website structure. They realized at one point that they had to start bundling the many recipes they had on their site. This was the first thing they did to improve the SEO of their website. First, they created a ‘high tea recipes’ category page with a short intro text and links to all related pages across the website. In 2012, this was considered a unique approach because most blog sites only consisted of single blog posts. Interlinking various content pieces across the website made it more comfortable and convenient for users. As a result, within a few weeks, they were at the top of Google. Later, Eric and Sandra applied this successful strategy to other categories and recipes. 2. Keyword Research The first step inr every project is Keyword Research. Whenever Eric and Sandra come up with a new recipe, they start by researching keywords and comparing their search volumes. This allows them to identify keywords with the highest search potential for their content. Eric Waterschoot Co-founder We use Keyword Research a lot. Whenever we put a new recipe or blog post online, we first look at keywords and compare different variants and titles. This way, we can find an order of words with the highest search volume and be sure that the post will perform well in Google. Let’s take a look at the following example. Eric used SE Ranking to search for ‘stamppot’ — a traditional Dutch dish popular in winter. After analyzing the results, he settled on three variants with the most search volume: stamppot with endive, kale, and brussels sprouts. They then added these queries to their keyword list. Eric and Sandra found out that they were ranked among the top 3 on Google for many stamppot recipes, but the one with brussels sprouts stamppot recipe was in position 12. After reviewing this page, they realized it was partly because this was already an old recipe. So, they decided to work on optimizing this page for better rankings. Eric and Sandra track a lot of keywords. In fact, they track so many keywords that they have to group them into categories, such as ‘casseroles,’ ‘salads,’ ‘pasta,’ etc. This way, they can keep a close eye on their rankings (whether they are dropping or rising), and quickly respond. Grouping keywords also allowed them to set their goals more efficiently. One of their goals, for example, was to “achieve an average ranking of 4 for ‘salads’ group in one month”. Smart goals like these allow you to measure your current success, update your roadmap if necessary, and achieve your SEO goals more efficiently. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze 3. Competitive Research Competitive research is another vital step towards having a top-performing page. SE Ranking’s set of tools allows users to analyze the competitive landscape, find direct competitors, and check their performance. For Eric and Sandra, this tool was handy for improving the quality of their content. They frequently use Competitive Research to get an overview of competitors, to see how their website is doing against their rivals, and to fill possible content gaps. For example, they frequently looked at other competitors to see if they were ranking for high-volume keywords that Eric and Sandra didn’t target yet or didn’t perform particularly well for. For this project, they found that ‘stamppot with apples and bacon’ was a popular search query, so they decided to publish their own recipe for it. 4. On-page optimization Eric and Sandra use the On-Page SEO Checker on occasion to run a quick check-up of their most important pages that generate the most traffic. On-page optimization is an important step if you want to assess page health and find areas for improvement. Eric Waterschoot Co-founder We are constantly renewing old recipes and content on our website. SE Ranking shows whether these improvements are having an effect and whether your quality score and rankings are increasing. Sometimes a word or another picture can greatly impact page performance. Right after Eric and Sandra enter the target page URL in SE Ranking’s On-Page SEO Checker, they can see the overall quality score for the page they analyze. They can also see a report with a list of all page elements that could be improved, such as the title, H1-H2 headings, backlinks, and images. Let’s return to Sandra’s stamppot recipe page. After running an on-page audit, they added new keywords with high search volume (stamppot with apple and bacon) to the page title, updated the primary copy on the page, and added new photos. The quality score increased momentarily. This resulted in higher rankings, and within a few days, their brussels sprouts stamppot was in position 2. Because of excellent optimization, the page also appeared as a rich snippet on Google. Results All their efforts paid off! Sandra’s stamppot recipe ranked second in search results thanks to SE Ranking and some SEO magic. Many other recipes on her website get top positions daily. Some pages require more time to rise in SERPs, but overall organic traffic to their website has nearly quadrupled over the last two years. In other words, millions of Dutch cooking enthusiasts will almost always come across Leuke Recepten when searching for new recipes! Takeaways When it comes to SEO, Eric and Sandra use simple yet effective techniques for their website. The straightforward strategy that they use includes the following steps: creating unique, well-optimized and relevant content; constantly updating older pages; fixing on-page issues; and reconsidering their site structure as it grows. This methodology usually does the trick for them and leads to great results. Here’s a list of SE Ranking’s tools that Eric and Sandra find particularly helpful in their daily work: Keyword Research. To find the most relevant keywords, check their performance, and find the best ideas for article names. Rank Tracker. To keep a close eye on whether your rankings are rising and so you can respond fast if they are dropping. Competitive Research. To get a picture of your site’s performance compared to rivals and identify keyword and content gaps. On-Page SEO Checker. To check the quality score of important pages that generate a lot of traffic. Did you know that the content creation process can be even more effective if you use our new content editor tool? This AI-powered content writing assistant helps you create SEO and reader-friendly texts more efficiently. Eric and Sandra’s story also shows that besides essential SEO skills, you need a high level of dedication and passion for what you do. Sandra and Eric transformed their hobby into a successful online business. They recently published a cooking book and created a mobile app with customized meal plans. Also, if your tummy started rumbling while reading this post, read these festive New Year’s snacks recipes on Leuke Recepten! Keyword Research Website Promotion 3060 views Written by Dmytro Davydov Dmytro is a content marketer and copywriter at SE Ranking. He enjoys writing about digital marketing and SEO as simply as possible. He is also passionate about content, media, and design. An enthusiastic traveler, amateur cinephile, and desperate cat lover.",
  "headers": [
    {
      "level": "H1",
      "text": "How a family project became the #1 food website in the Netherlands with over 4M in monthly organic traffic"
    },
    {
      "level": "H2",
      "text": "Client"
    },
    {
      "level": "H2",
      "text": "Goals"
    },
    {
      "level": "H2",
      "text": "Steps they took to reach these goals"
    },
    {
      "level": "H3",
      "text": "1. Website structure optimization"
    },
    {
      "level": "H3",
      "text": "2. Keyword Research"
    },
    {
      "level": "H3",
      "text": "3. Competitive Research"
    },
    {
      "level": "H3",
      "text": "4. On-page optimization"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Dmytro Davydov"
}