{
  "url": "https://seranking.com/blog/listicles/",
  "slug": "listicles",
  "title": "How to Write a Listicle in 5 Steps",
  "description": "DIY guide on how to write a listicle that your audience will click, love, and share. Find more listicle examples and advanced tips inside.",
  "content": "Blog / Keywords & Content / Writing a Listicle in 5 StepsWriting a Listicle in 5 Steps Written by Megan Grant Nov 18, 2022 16 min read If you want to get more clicks on your content, put a number in the title. This is why listicles convert so well. In fact, in analyzing hundreds of articles, Danny Forest found that 41% of the top articles in 2020 were listicles, and the second most popular starting “words” for headlines were actually numbers. Content creators know this, and it’s become a double-edged sword. Listicles have been somewhat overused simply to get clicks, which has driven down the quality. However, when done properly, they do result in higher engagement and can capture readers’ attention. Let’s take a look at how listicles (when used in moderation) can be effective for content marketing. What is a listicle? Article + list = listicle! In other words, a listicle is an article written in list format. Readers eat them up, but why? Here are just a few of the many reasons why listicles are so popular. 1. They stand out in Google SERPs In a sea of text, what’s likely to catch a reader’s eye? Something that isn’t text, meaning numbers. When a reader spots a listicle in the search engine results, they’re immediately drawn to it because the title doesn’t look like the others around it. 2. They’re easy to scan There’s plenty of data suggesting that users typically don’t sit down and read a piece of content word for word. For example, one study found that readers skim about 69% of the e-zines they receive. The takeaway? Don’t assume people are digesting every last thing you say, because they probably aren’t. If you want people to stay on the page longer, make it easier for them to skim it. By nature, lists create more white space on the page, which makes it easier on the eyes and smoother to read. Consider, as an opposite example, an article that’s one giant paragraph of non-stop text. Would you enjoy reading that? Would you even bother? Probably not. Listicles help you avoid this type of issue. Listicles are uniquely reader-friendly because you can skim them with ease and still walk away with the main points. 3. Listicles curate the most important information The numbered points of a listicle usually represent the most important information in that article’s topic. If people want something that’s quick to digest and gives them only need-to-know information, they’re likely going to get it from a listicle. Listicles come in infinite topics and varieties. Glamour published a roundup of the 60 best drinks to order from the Starbucks secret menu in 2022. Homes & Gardens will give you 18 ways to transform a blank wall. Sprout Social offers six email marketing templates that deliver results. Instead of sifting through Google SERPs to find the most important information, readers can get it in a flash with a listicle. Content is crucial for your overall SEO success. Enroll in our Content SEO Course to master the creation of listicles and other types of content, driving better SEO results. How to write a listicle Now that you know what listicles are, why they’re so effective, and what they look like, it’s time to write your own listicle. But before you get started, let’s first break the process down into five simple steps. 1. Choose a topic that makes sense in list format Not everything belongs in list format. For example, if you’re writing an article on the history of Google, you’re telling a story. Stories shouldn’t be split up into lists. At the same time, if your topic is best winter holiday destinations, the intent behind it obviously begs for a listicle. One easy way to find topics suitable for listicle format is to pay attention to the main keyword. We’ll discuss why keyword research is essential for your listicle success in the next section. Here’s a list of keyword types that normally make for a great listicle: Keywords with modifiers such as best, top, new, free (e.g. best cms for small businesses). [Product name] + alternatives (e.g. Hubspot alternatives). The plural form of the keyword (e.g. winter hand creams, Christmas movies). Types of/examples of + [plural keyword] (e.g. types of rose bushes). [Plural keyword] with [*] (e.g. dog houses with heaters). [Plural keyword] that are [*] (e.g. ovens that are also microwaves). [Plural keyword] + [year] (e.g. books 2022). Some keywords can fall into one of these categories and still not be a great listicle topic. Avoid this by checking the SERP that each keyword triggers and see if your search intent matches the results. For example, if you google the plural keyword “garden chair covers,” you’ll see the pages of ecommerce giants such as Amazon, Home Depot, and Walmart. Example of a plural keyword that won’t make a good listicle This is because the search intent of this keyword is transactional and not informational. Users will want to choose a suitable garden chair cover right from the e-сommerce store of their choice without spending time reading a listicle first. It’s always a good idea to check the SERP before settling on a topic for your listicle. You can do this straight in Google or rely on special tools. For example, SE Ranking’s Keyword Research tool has a special Organic results tab, where you can immediately see which pages are ranking high for your chosen keyword. More on this tool in the next section. 2. Find your keywords If you want your target audience to find you in Google, then you need to make your list as visible as possible. This is where keywords come in. You should ideally use keywords that are higher in traffic and lower in competition. This means that a lot of people are searching for them, but not a lot of websites are creating content around them. These terms are easier to rank for. Go to the Keyword Explorer, enter a seed keyword (a general keyword around your topic of interest) and pick your target location. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze SE Ranking’s metrics such as search volume and difficulty will (hopefully) help you find low-competitive keywords with high traffic potential. Pay attention to the Organic results section we mentioned earlier. It shows pages that are already ranking for the chosen keyword. If you notice some listicles there, you can be sure that it’s the right format for the topic. Another way to find keywords for your listicle is to analyze your competitors’ content. You can get a bird’s-eye view of your competitors’ keywords with SE Ranking’s Competitive Research Tool. Enter your competitor’s URL and go to Organic Traffic Research — Keywords. Use the keyword modifiers we discussed in the previous section to find the right keywords for your future listicle. Finally, you can also use Google keyword trends to see what’s getting the lion’s share of search traffic lately. This is a great opportunity to take advantage of a topic/keyword that’s rising in popularity but isn’t super saturated quite yet. If, after researching different keyword opportunities, you have a great number of promising keywords, our advice is to use the Keyword Grouper. With it, you can organize similar keywords into clusters based on user intent. Grouping keywords with the help of a dedicated tool saves you time and reduces errors because you’re automating a process that you would otherwise have to do manually. If you are new to SEO, check out this complete guide on how to do keyword research. Play your cards right and your listicle will rise to the top of the SERPs. 3. Describe each item on the list You can go into as much detail as you want. Just remember to maintain one of the biggest benefits of listicles: “skimmability.” If you add several paragraphs of text to each item on your list, consider utilizing additional headers to keep the article as scannable as possible. Also, remember to add internal links (to the same website) and external links (to other websites). Internal links help keep people on your site longer, provide additional value, and can boost your SEO juice (aka link juice) with Google. External links, especially to credible sites, can help you build authority. Consider reaching out to the external sites you link to and letting them know. They might be inspired to share your content since you’re giving them a shout-out. 4. Make sure the order of the list is logical Your listicle should make the readers’ lives easier by condensing the most important information about that topic into one easy-to-read article. To do this, order your list in an intuitive and reader-friendly way. Don’t make them skip around because they’ll just end up leaving the page. 5. Bonus: Support it with imagery and examples Readers want something interesting to look at. In fact, one survey found that 91% of buyers prefer visual and interactive content to static, text-based content. This kind of content includes images, GIFs, social media embeds, YouTube video embeds, infographics (more on those in a minute), or even graphics you design yourself. Remember the Starbucks roundup we mentioned earlier? The author included (in this article) Instagram embeds on images of mouth-watering drinks. This brings the listicle to life, gives the reader examples of what they’re reading about, and keeps them on the page longer. Automate the listicle-writing process Wouldn’t it be nice to know exactly how many details you need to add when describing every item in your listicle? Or how about knowing the right number of images to include in your post? You also want to be sure that you’ve included all the relevant keywords in the text. Modern content tools can do just that. The heaps of tips they offerl not only help you write a listicle faster but can get you closer to the top of the SERP. SE Ranking’s new Content Marketing tool analyzes the SERP leaders to give you recommendations on the word count and the number of headers, paragraphs, and images. It also offers plenty of relevant terms (including NLP terms) to add to your copy so Google can find the text relevant to the user intent. You can also use it to analyze the structure of top-ranking texts side by side. Based on what you see, you can build your own outline using the simple drag-and-drop editor. Finally, the tool helps you optimize written text. It will check if you included all selected terms. It will also check if the word count is as recommended and whether the text is easy to read and error-free. The Content Marketing tool is available for free as part of the 14-day trial. 6 advanced tips for writing an effective listicle Now that we’ve got some of the basics down, let’s go over some more pro tips for writing a listicle that readers will love. 1. Incorporate influencers for credibility Influencer marketing is skyrocketing for a reason. That’s because influencers have a tremendous amount of… well, influence! Listicles are a great opportunity to weave in relevant influencers who have a big reach. For example, if you’re doing a list of the best dog breeds to own, you could include famous pooches like Noodle, Norbert, and Tuna. Once your listicle is published live, you can share it across social media and tag all of the influencers to expand your reach, grow your exposure, and get more engagement (likes, comments, and shares). If they end up re-sharing it to their network, think of the traffic boost you’re going to get from that. If you really want to go the extra mile, you can reach out to these influencers in advance and ask if they’d be willing to provide a quote for your listicle. 2. Add filters and navigation to the listicle Especially with longer listicles, readers can have a hard time finding the exact information they want. There are simple ways to help them navigate your content. One way is to create a Table of Contents in the very beginning, where each item on the list links out to the appropriate section in the listicle. This is called an “anchor link,” and it’ll take the reader to the right location on the page. Here’s an example from MongoDB. Not only is there a table of contents on the right side that allows for easier navigation, but it also has anchor links at the top. When you click on one of those anchor links—for example, Scale Cheaper—it takes you to that part of the blog. How you insert your anchor links will depend on the CMS you’re using. Some might have this feature natively included, but you might have to do a little manual coding with others. 3. Divide a listicle by subtopics to cover more items Did you notice that this article is a listicle? Did you also notice that we split it up into three sections? We made a list of the benefits of listicles, beginner tips, and advanced tips. Dividing it into subtopics helped us cover the many different aspects of listicles in a reader-friendly way. 4. Use infographics Infographics are the fourth most used type of content marketing. They’re eye-catching and highly sharable on social media. Plus, everyone learns differently. While some users will prefer to read/skim your listicle, others will benefit more from a graphic. Sum up the highlights and “key findings” of your listicle in an infographic format. If you don’t have access to a professional graphic designer, try using a free tool like Canva, which comes with a vast selection of free-to-use templates. Include the graphic somewhere in the listicle. Brands will often put it at the very beginning or end. You could even split it up into several smaller infographics and intersperse them throughout your listicle. Don’t forget that infographics are highly “sharable.” They make excellent material for your social media channels. If you have a portrait-oriented infographic, you can easily share this on Pinterest (a search engine!), likely without having to adjust the dimensions. For other social media channels (Instagram, Facebook, etc.) consider recreating the infographic so that it’s optimized for each platform with the correct dimensions. Pro tip: If you include your influencers in your infographic and then share the graphic on social media, tag them in the post. 5. Include the number in the title and header As we mentioned earlier, numbers are especially click-worthy. The title of your listicle should include a number, along with your H2(s), but only when it makes sense. If you can push the number closer toward the front of the title — along with your keyword — that’s ideal. But never force it. First and foremost, it has to feel natural to the reader. 6. Mind the quality — always We mentioned earlier that since listicles are so eye-catching, some brands tend to use them just to get the reader’s attention and skimp out on the actual quality of the content. With any and all content you create, always keep the user intent in mind. Whatever the title of the listicle is, the body of the content should respond to that specific query. Avoid clickbaity titles or anything else that could leave the reader disappointed once they click to read. Articles that fail to meet user intent won’t be ranked favorably because they disappoint both readers and Google. Finally, let’s talk about how long your list should be. Some say that the longer it is, the better. This is only true, however, if you maintain the quality throughout. One thing you can be certain of is that you don’t want your list to be too short. Remember that one of the purposes of making a list is to curate the most important information for the reader. Instead of crafting a blog post with a list of three things, try to stick to five or more. There is even anecdotal “evidence” suggesting that odd numbers in headlines get more clicks — particularly seven. However, our recommendation is that you prioritize creating a list packed with value. Skimp out on quality and it won’t matterwhether you use an even or odd number. TL;DR Listicles are easy to consume. They also collect all the most relevant information for users and they stand out in SERPs. When making listicles, decide on a topic and its keywords, list each item in a logical order and describe them, and add plenty of eye-catching images. Make your listicle shine even more by incorporating influencers, using filters and anchor links, breaking your listicle up into sub-topics, using an infographic, including the number in the title and header, and prioritizing quality of above all else. Not all content will make sense as a listicle. And without a doubt, other types of articles can perform very well — like how-tos. Consider making some room in your overall content strategy for listicles to get insights on what your readers want and need from you. Content Marketing SEO for Blogs 925 views Written by Megan Grant Megan has been writing and editing professionally since 2011. Writing is, hands down, her favorite thing to do. Her chihuahua, Peanut, often steps in to help with edits.",
  "headers": [
    {
      "level": "H1",
      "text": "Writing a Listicle in 5 Steps"
    },
    {
      "level": "H2",
      "text": "What is a listicle?"
    },
    {
      "level": "H3",
      "text": "1. They stand out in Google SERPs"
    },
    {
      "level": "H3",
      "text": "2. They’re easy to scan"
    },
    {
      "level": "H3",
      "text": "3. Listicles curate the most important information"
    },
    {
      "level": "H2",
      "text": "How to write a listicle"
    },
    {
      "level": "H3",
      "text": "1. Choose a topic that makes sense in list format"
    },
    {
      "level": "H3",
      "text": "2. Find your keywords"
    },
    {
      "level": "H3",
      "text": "3. Describe each item on the list"
    },
    {
      "level": "H3",
      "text": "4. Make sure the order of the list is logical"
    },
    {
      "level": "H3",
      "text": "5. Bonus: Support it with imagery and examples"
    },
    {
      "level": "H2",
      "text": "Automate the listicle-writing process"
    },
    {
      "level": "H2",
      "text": "6 advanced tips for writing an effective listicle"
    },
    {
      "level": "H3",
      "text": "1. Incorporate influencers for credibility"
    },
    {
      "level": "H3",
      "text": "2. Add filters and navigation to the listicle"
    },
    {
      "level": "H3",
      "text": "3. Divide a listicle by subtopics to cover more items"
    },
    {
      "level": "H3",
      "text": "4. Use infographics"
    },
    {
      "level": "H3",
      "text": "5. Include the number in the title and header"
    },
    {
      "level": "H3",
      "text": "6. Mind the quality — always"
    },
    {
      "level": "H2",
      "text": "TL;DR"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Megan Grant"
}