{
  "url": "https://seranking.com/blog/local-seo-age-hunt-mammoth/",
  "slug": "local-seo-age-hunt-mammoth",
  "title": "How to hunt a mammoth or Local SEO Age",
  "description": "Today, the whole \"hunting\" process has moved to the web. How to take an advantage of this modern hunting if you are an owner of a small local business?",
  "content": "Blog / Niche SEO / Local SEO Age, or how to hunt a mammothLocal SEO Age, or how to hunt a mammoth Written by Julia Torchynska May 18, 2018 8 min read How did people get food in the Stone Age? They collected roots and berries, fished, and hunted the mammoths to feed the whole tribe for a couple of months. Today, we hunt the other “mammoths” – pizza delivery, sushi bar or Starbucks. And the whole “hunting” process has moved to the web. How to take an advantage of this modern hunting if you are an owner of a small local business? Step 1. Locating your prey … They say that hunting depended on seasonal migration of animals. It was important to track the mammoths’ route correctly in order to dig a trap in the right place. Otherwise, the hunters could be sitting in vain for hours. It works the same way for a website. Does the search engine know about your target market localization? If you answer is “no” don’t expect to reach your target customers through SERP. What’s the plan? Google My Business helps to connect the local client with the local business. Create an account to: – Tell potential clients about your company, publish news and announcements (promotions and discounts) on Google+. – Respond instantly to the customers in a Google Hangout chat. – Track and respond to the reviews. And the last but not least – you can get a chance to appear at the local block of Google search – and grab a lot of users’ attention. What to do How to do it Add your company to Google My business Indicate the category your company belongs to. For example, “restaurant” or “wedding photographer”. Agree to the terms and conditions by clicking the box “I represent this company on Google and accept the terms of use”. Download your favorite game to not get bored until the postman brings a letter from Google with a confirmation code. Yes, yes, a paper letter! And now take two steps back and write your real postal code in the Google My business account. Fill out the company page on Google+. Add the company description with links to your website. Add as many office photos as possible (the office building, the interior, the team). Write your phone number with the local code. Add the company address. Make sure that it doesn’t differ from the address on your website and other resources. Google doesn’t trust companies with inaccurate data. It can lead to the ranking problems. Upload a profile photo (minimum 720 x 720 pixels). Specify your work schedule. Ask regular customers to leave feedback. Step 2. Explore the tracks … How did prehistoric humans find the mammoth? The footprints tracked their appearance. Fresh mammoths traces signalize that the mammoths were here and probably will return. Links from local directories, media, and forums are those traces that can lead local customers to your website. The link building is extremely important for local promotion as well as for traditional SEO. What’s the plan? Place an information about the company in local directories, media, and forums. We recommend using empty anchor text links (as simple URL or with the words like “here”, “on the website”, etc.). In order not to get under the SE filters make sure that: The media/catalog/forum topic is relevant to the company’s niche; The media/catalog/forum is trustworthy for search engines (it has backlinks from the other popular websites). The media/catalog/forum is optimized for mobile search (this affects its popularity among mobile search users. Note that more Google searches take place on mobile devices than on computers). Step 3. Talk to the tribe … In any tribe there were elders who were aware of mammoths annual migration routes. How did they know this? Over the long years of hunting and nomadism, they received priceless knowledge. Therefore, before setting up a trap, young tribe members used to ask the elders for an advice… 88% of consumers trust online reviews about the local company as much as personal recommendations. According to the same research, most people read an average of 6 reviews before buying. By the way, reviews also affect the website position in the local SERPs. What’s the plan? What to do How to do it Ask your satisfied customers for reviews — after a great purchase or successfully closed support ticket Google doesn’t forbid you to ask your clients for a feedback. But you’re not allowed to offer benefits or money for it — at least on your Google+ page. And it’s important — be sure to respond to each review. The number of positive reviews highly affects the local websites’ rankings. But try to avoid too rapid increase in the number of the reviews — it might look like a bot work for Google. It is also important for reviews to be posted from existing Google accounts. Track reviews Use Google Alerts or Mention. Track the company name in different spelling (for example: SE Ranking, seranking, Se Ranking, seranKING) and choose the time of notifications. The information will be sent to your gmail or Mention account. Step 4. Verify your data … It is known that mammoths were not the only source of meat for ancestors. For example, they hunted for buffalo too. Mammoths and buffalo used to go to the same watering places, so it was hard to know exactly who would get into the trap. And such mistake could cost many human lives. In contrast to slow-moving mammoths, buffalo tend to move in big herds and could reach a speed of up to 25 miles per hour. It was vital to check all information from scouts to be sure what animals you’ll be hunting… To avoid the situation when the search engine takes your mammoth site for a buffalo spam site, you need to prove it with your address, phone number and name (NAP). When Google picks a website for a geo query, it takes a data from the Google My Business account. It is quite unlikely that a website created for spam has a physical address and phone number, not to mention that this information should be duplicated in different sources. Step 5. Preparation of guns and alignment of forces In the palaeolithic age, people used various tools and weapons — sticks, stones, darts, spears with stone and bone tips. It was also extremely important to correctly distribute the duties between the hunters. XXI century human switch hunting spears to search queries. If you want to attract visitors to your website, you should carefully prepare the “tools” and correctly distribute the hunting roles optimize the site. What to do How to do it 1. Optimize a specific website page for local SEO (or number of pages for different regions). Include keywords with the names of regions to the semantic core, select the most relevant query and use it in the landing page Title. We recommend to also include your company name, address and phone. Use the keyword in Description. You can also add NAP here if it is appropriate and natural (remember that Description should be written for people, not robots). Include the keyword in the H1 and in the URL. Use keywords with the name of a region on the page, but within reasonable limits. The rule is the same here — you write for people. 2. Use Schema.org. The Schema.org markup code is hidden from users but is extremely important for search engines. It helps the SE to recognize a certain part of the text, for example, the name, address and phone number of the company. 3. Optimize the images. Add photos of your business (office, restaurant, cafe) to your website. Be sure that you use keywords with the name of the region (for example, “buffalo steaks NY”) in the image title and alt-text. 4. Check your mobile version Use the Google tool to check it. Need more tips? Read this article. What else? Sometimes the mammoths changed their routes. And the tribe had to follow the animals, moved to more fertile and suitable for hunting places. Therefore, an additional tool for successful hunting was the ability to quickly respond to environmental changes. Similar to traditional SEO you need to monitor and analyze the website positions for local promotion. Use the right tools for that to be always in the right place. Local SEO 19983 views Written by Julia Torchynska Julia is a content marketer with 10 years of experience in journalism, copywriting, advertising, and PR. She shares her knowledge and experience by creating helpful articles on SEO and digital marketing for SE Ranking blog and popular media. When Julia is not writing articles, she learns new asanas, travels, and as a volunteer helps YWCA with empowering women.",
  "headers": [
    {
      "level": "H1",
      "text": "Local SEO Age, or how to hunt a mammoth"
    },
    {
      "level": "H2",
      "text": "Step 1. Locating your prey"
    },
    {
      "level": "H2",
      "text": "Step 2. Explore the tracks"
    },
    {
      "level": "H2",
      "text": "Step 3. Talk to the tribe"
    },
    {
      "level": "H2",
      "text": "Step 4. Verify your data"
    },
    {
      "level": "H2",
      "text": "What else?"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Julia Torchynska"
}