{
  "url": "https://seranking.com/blog/long-tail-keywords/",
  "slug": "long-tail-keywords",
  "title": "Long Tail Keywords: How to Use Them for SEO",
  "description": "If you’ve ever conducted keyword research, then you’re definitely aware of long-tail keywords. But, are you sure you know everything about them?",
  "content": "Blog / Keywords & Content / Understanding Long-Tail Keywords: How to Find the Best Ones and Use Them in SEOUnderstanding Long-Tail Keywords: How to Find the Best Ones and Use Them in SEO Written by Andrew Zarudnyi Reviewed by Anastasia Kotsiubynska Jun 13, 2023 23 min read Anyone who has ever conducted keyword research is well aware of the term “long-tail keywords”. But at the same time, it may not be crystal clear to everyone what they really are. What are long-tail keywords in the context of SEO? Do long-tail keywords always have a low search volume? Do they always consist of 3-5+ words? Do they always have low competition? As you would expect, long-tail keywords are a fairly complex topic that can get pretty confusing, so the short answer is both yes and no. To explain it, a longer, more elaborate answer must be given. So, join me as I investigate what long-tail keywords are, what role they play in SEO, how to use them, and what misconceptions you should forget about. What are long-tail keywords Alright, so the number one question is what makes a keyword long-tail? What are long-tail keywords in SEO? Let’s take a look at several of their distinct characteristics: The primary determinant of a long-tail keyword is its length, often consisting of several words (3-5+). This multi-word structure serves to provide precise, detailed search queries that convey clear intent. While long-tail keywords typically have lower search volume due to their specificity, this is not a hard-and-fast rule. While fewer people may search for these detailed phrases, their precise nature can hold great significance for niche markets or specialized industries. Similarly, although long-tail keywords are often characterized by having lower competition, there are instances where numerous companies vie for top rankings using the same long-tail keywords. Another important attribute of long-tail keywords is their potential for high conversion rates. Because these keywords tend to mirror the searcher’s intent closely, search results for long-tail keywords usually align with what the user is seeking. Consequently, pages ranking for long-tail keywords often experience higher conversion rates. Now with long-tail keywords explained and with an established understanding of them, we can delve deeper into the integral role they play in search engine optimization. Why long-tail keywords matter in SEO Let’s start off with something simple. In practically every blog post you can find online on long-tail keywords, you’ll find a similar graph: This graph is important to understand because it highlights the paradox of long-tail keywords. Despite their search volume being low–as in they are not popular search terms–their conversion rate, or how often they satisfy search requests, is really high. As you can see, although the search query “playstation” is getting a lot of searches each month, it may well be an informational query, meaning that people are just looking. However, the long-tail keyword “playstation 4 controller battery life” is getting only 10 searches a month, but the pages that target this search query definitely know what the searcher is looking to find and give it to them. We at SE Ranking have conducted our own study that analyzed over 25 million keywords tracked by our customers and found that almost 44% of keywords with 1,000-9,999 monthly searches are made up of three or more words. So, considering this data, we can come to a conclusion that long-tail keywords get a large share of searches and create a loophole that we can take advantage of. You can get your web pages ranking high without practically any competition and get a lot of conversions! Think about it: What’s the point in targeting 1 popular search query that has a lot of competition fighting it out for Google’s top spot (and even if you do succeed, most searchers are just looking) when you can compete for 10 long-tail keywords instead? As a result, we can identify two main reasons for the importance of long-tail keywords in SEO. First of all, they are more likely to drive people who are close to the end of the buying cycle, aka hot leads, and those that have an intent that you are ready to satisfy. In other words, long-tail keywords have a high conversion rate. We reached out to Helen Pollitt, Managing Director at Arrows Up and an all-round SEO expert to comment on this and she confirmed, saying, Long-tail keywords are highly effective in driving traffic to your website. In fact, due to how specific the search terms usually are you have a better chance of writing content that directly answers the users’ queries and therefore provides a better user experience. Searchers using long-tail keywords are refining their searches to bring back more specific results. If you are ranking well for this type of keywords, you are likely to win traffic that is closer to conversion. For example, the keyword “high heel shoes” has 6,600 searches per month but it isn’t clear from this search query exactly what a user would want to be shown on a landing page. Do they mean examples of shoes, shoes they can buy or simply images for the keyword? The long-tail keyword “red high heel shoes with next day delivery” has far fewer people searching for it but the searcher’s intent is clear. So creating a page that meets their needs and converts is much easier. Secondly, long-tail keywords are easier to rank for since their level of competition is typically not high. For example, Google produces over 6 billion results for the head keyword “shoes” versus half a billion results that come up for the long-tail keyword variation “buy black designer shoes for men”. By the way, the same idea also applies to running advertising campaigns on Google Ads, where long-tail keywords are, generally, cheaper to bid on. Ecommerce and Technical SEO Consultant Kristina Azarenko of MarketingSyrup was also kind enough to share her thoughts on why it’s important to target long-tail keywords, saying, I see that many businesses are chasing high volume keywords instead of long-tail ones thinking that they will bring more traffic and sales. There are two issues with this approach. Firstly, the competition for keywords with high search volume is also high, so it will take more time and resources to rank for them. Secondly, high volume keywords are usually general, and when people use general search queries, they’re not ready to buy yet. So it’s better to use a combination of general keywords and long-tail keywords. Long-tail keywords help you get people who come to your website with a buying intent. These people have a good idea of what they want and if you give it to them, it will be much easier to convert them into customers. This has worked really well for many of my clients. Building more specific categories for one online store has substantially increased the revenue. Instead of targeting general keywords, when you don’t really know what people are looking for, we targeted more specific and, therefore, long-tail searches. Besides these two huge reasons why long-tail keywords are important in SEO, there are several less significant reasons like they help answer voice assistant searches as well as rank for the head term. In terms of voice search, when running searches using our voice, we tend to move away from using short keywords and just use long colloquial expressions to express our search request. Plus, as of 2021, there are around 4.2 billion voice assistant devices used across the globe, and forecasts predict this number will grow to 8.4 billion in 2024. With so many people running searches using their voice, you can expect the number of long-tail keywords to keep growing, giving you an extra reason to continue creating content for such search terms. As for helping you rank for the head term, let me quickly tell you what a head term is. Remember the graph that included the keywords “playstation” and “playstation 4 controller battery life”? Well, in this case, the long-tail keyword is a part of a bigger topic – PlayStation. In this case, the keyword “playstation” is the head term. Now, Google understands what we’re looking for when we enter similar searches, plus it’s always trying to provide searchers with better results. So for instance, if you optimize your content for the query “how to bake a cake for beginners”, your content is also likely to appear for the simpler search “how to bake a cake”. The key point to remember is to concentrate on creating top-quality content for your specific topic. If Google deems this content to be of excellent quality and highly relevant, it can help your page appear in search results related to broader topics. For this reason, search results that are displayed in SERPs for a long-tail keyword will include results that appear for the head term as well, even if these pages don’t actually rank for the search query that was entered into the search bar. Websites will often rank really high for multiple head terms and have decent to low rankings for millions of other keywords. These are long-tail keywords that have lower search volumes than head terms, but the former push the latter up in rankings by properly using search engine juice. Types of long-tail keywords Now, when looking at a long-tail keyword, you have to ask yourself if its intent is general or specific. Do long-tail keywords usually represent an individual topic or focus on a far broader topic? What’s the SERP competition like? Answering these questions will help you understand the type of long-tail keyword you’re dealing with. Depending on the purpose it serves, long-tail keywords can be broken down into three categories: supporting, topical and ‘weird’ ones. The first type, supporting long-tail keywords, doesn’t represent an individual topic, but supports much broader topics along with their head keywords, hence the name. For example, if you Google a long-tail search term like “how to make a grilled cheese in a toaster” whose search volume is pretty low, it may be difficult to outrank the top results because the term “how to make a grilled cheese in a toaster” doesn’t represent an individual topic, but falls under the greater topic of “grilled cheese”. For this reason, when Google provides search results for supporting long-tail keywords, it may include results that appear for the head keyword as well, even if these pages don’t actually rank for the entered keyword. As a result, supporting long-tail keywords tend to have greater competition and are harder to rank for. The second type, topical long-tail keywords, as the name suggests, focus on an individual topic. For example, the long-tail keyword “private blog network” has a monthly search volume of 260. And the search results that come up in SERPs don’t focus on any other topic besides PBNs, meaning that there’s no head term to support. Such keywords are long-tail in the classic sense of the word, meaning they have a low search volume, highly-specific and are easier to rank for. Search results for topical long-tail keywords will include pages that rank for the specific term – not for a general topic. I want to point out that these are the long-tail keywords you should be targeting. Unfortunately, not all long-tail keywords fall nicely under one of the two categories above. Lets refer to such keywords as ‘weird’ ones because they can focus on individual topics, but at the same time cover wider topics. Here are several long-tail keyword examples: Long-tail keywords with location modifiers that point out a city or a region (“SEO services in Greater Wilshire”) Seasonal queries (“sport fashion trends 2023”) Long descriptive names of specific objects (“how i met your mother”, “smithsonian national museum of natural history”). In the latter case, even though the search queries consist of multiple words, they are “too” specific, referring to a single object: an organization, a book or a movie, a place, etc. How to find long-tail keywords What are some ways to find long-tail keywords for your site? And more importantly, how can you find and determine which long-tail keywords are the best? The easiest way to get a list long-tail keywords is by using a dedicated tool—check out this blog post to choose your best keyword finder. In this article, we’ll illustrate the process using several popular tools as examples. SE Ranking Keyword Research tool Typically, tools that are specifically designed for keyword research will provide you with the most complete information on long-tail keywords. Let’s go over how to do this with SE Ranking. SE Ranking’s Keyword Generator is a powerful and easy-to-use tool that can help you find long-tail keywords for any niche or market. Start by accessing the tool from the top navigation bar on the main dashboard and enter your head term. It’s important to select the target country at this stage as well. As a result, you will get an overview of organic and paid search activities related to your head term in the specified country. You’re welcome to explore this data further, but since we’re looking for long-tail keyword ideas, you’ll want to go to the Keyword Suggestions tab on the left hand side. In this section, keyword suggestions are divided into four categories: Similar, Related, Questions, and Low Search Volume. For the first three categories, you gain additional data on keywords, including their search volume, popularity trend, search intent, SERP features, keyword difficulty, cost per click, and competition level. You can sort, filter, and export the results as you wish. Additionally, you can choose to include or exclude branded keywords, filter keywords by their difficulty score, or set a minimum word count of 4 or 5 to find longer and more specific phrases. Don’t forget to explore the “Questions” section, which displays user inquiries related to your topic. These questions often serve as long-tail keywords themselves or provide inspiration for generating content ideas. As for the Low Search Volume tab, this is where you can find additional long-tail keywords to use in your content. In the screenshot above, you can see that there are over 30 thousand long-tail keywords available for exploration under the head term “skin care”. SE Ranking Competitive Research tool SE Ranking’s Competitive Research tool can help you find long-tail keywords that your domain or page either already ranks for or has the potential to rank for. Here’s how to use it: Start by accessing the tool from the top navigation bar on the main dashboard and entering your domain. At this stage, be sure to select the target country, and specify whether you want to analyze your entire domain (with or without subdomains) or a specific URL if you’re seeking keyword ideas for a particular page. You will then receive insights into the organic and paid search performance of your website in the specified country. You’re welcome to explore this data further, but since we’re specifically looking for long-tail keyword ideas, either scroll down to the Organic Keywords section on the Overview page and click “View Detailed Report”, or use the left-hand navigation menu to access Organic Traffic Research → Keywords. In this section, you find a list of keywords that your domain is ranking for in organic search, along with corresponding keyword data such as difficulty score, search volume, search intent, SERP features, Google Ads competition, cost per click, your rankings, and traffic numbers for each keyword. While searching for long-tail keywords, take advantage of the filtering options to narrow down the results to keywords based on a specific minimum word count, such as 4 or 5 words. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Google Search Console Performance Report If your website is in business, there’s a good chance that you are already ranking for your top keywords. Let’s expand on this point. Chances are you already have several pages ranking within Google’s top 5 SERPs. And your long-tail keywords are probably ranking on Google as well, even if you haven’t optimized for them. In the majority of cases, by implementing some SEO strategies on the pages that rank for long-tail keywords, you can quickly improve their rankings and get to page 1 on Google. To uncover these long-tail keywords, you can use the Performance Report in GSC. Simply scroll down until you reach the following area: You can find any long-tail keywords you already rank for under the “Queries” list. After some analytical work, you’ll be able to understand which of these long-tail keywords deserve top priority in terms of SEO. Need help navigating GSC? Here’s a Google Search Console tutorial! Google Autocomplete Google autocomplete is one of the easiest and most popular ways of getting new keyword ideas. Just go to Google and type in your head keyword. One great aspect of Google autocomplete is that you can add any character to the search and get different results each time. For example, let’s add a space bar after the second keyword, as in “skin health ”. Try out different combinations of letters and words until you get enough long-tail keyword ideas to support your head term. Google “Searches related to” Another useful Google feature provides you with more long-tail ideas based on similar searches that people run on Google in relation to the entered search query. Let’s take the same keyword, “skin health”, and scroll all the way down to the bottom of the search results page until this box is in view: On top of that, you can click on a suggested related search option and scroll down to get long-tail searches related to that search query. Note that the Keywords Everywhere Chrome extension can display a long list of related keywords and people-also-ask-for suggestions right on Google’s SERP. Google “People also ask” The search giant’s “People also ask” box contains a list of questions that people ask in relation to the keyword you entered. If you scroll down the same SERP a little bit, you’ll get a list of long-tail keywords that are in the form of a question. Simple as that: Just like with “Searches related to”, you can then run a search for any of the long-tail keywords mentioned there and get a new list of related questions. Basically, you can continue doing this forever. Google Trends A tool that can help you uncover trends related to long-tail keywords is Google Trends. Enter any keyword and see if the interest in this topic is on the rise or on the fall. That way, you can see whether a certain keyword deserves your attention right now. As you scroll further down the page, you have the option of exploring related topics and search queries: So, you can pick a trending topic from the list on the left-hand side, and use the list of long-tail keywords on the right to support your content. And remember that while it is fine weather, mend your sails. In other words, you need to have everything ready before a topic is trending, so that when it’s time for those 2024 SEO trend articles to be trending in December, your pages will be long crawled and indexed.Be sure to check out this article if you’re not sure how to use Google Trends for SEO. Keyword Research via Bing Webmaster Tools Bing Webmaster Tools is a free service that helps you monitor and optimize your website’s performance in the Bing search engine. One of the many features it offers is Keyword Research, which allows you to discover and analyze keywords related to your site or any chosen topic. To find long-tail keywords for your website using the Bing Keyword Research tool, follow these steps: Step 1: Access the Keyword Research Tool Sign in to your Bing Webmaster Tools account and select your website from the dashboard. Then, expand the SEO tab in the left menu and click on Keyword Research. Step 2: Enter your head term/seed keyword In the Keyword Research tool, enter a seed keyword related to your website or topic in the search box. You can also choose the country, language, device type, and the date range for your query. Next, click on Get details. Step 3: Analyze the results The tool will provide a list of keywords associated with your seed keyword. For each keyword, you’ll find trend information and the number of impressions it has received. If you’re interested in exploring long-tail versions of any keyword, simply click on it. The chart can be arranged by “impressions,” allowing you to gauge the search volume in Bing. Below the chart, you’ll find the top 10 URLs that rank on Bing for the specific search query. What’s more, you have the option to select and download keywords in a CSV file format for further analysis. In addition, be sure to explore the keywords listed under the “Question keywords” and “Newly discovered” tabs to find even more long-tail keywords to work with. Forums and Q&A sites Forums and question-and-answer websites are your gravy train that helps you stay on the same page with your target audience. Such resources are specifically designed to house various discussions, and the best part is that the people that participate in them are committed enough to register and have actual opinionated conversations. In the vast majority of cases, the discussions that take place on such sites cover topics that aren’t fully covered by search engines or the search engines fail to provide a proper answer. What I recommend doing is find the resources that focus on your niche/industry and look for topics that you can create content for, thus providing readers with relevant answers and covering suitable long-tail keywords. Then, once you’ve established yourself as an expert on a discussion site, provide answers and link out to the content you specifically created to cater to your audience’s needs. To find a forum relevant for you, simply type “topic + forum” into Google and start picking out the most promising ones. As for Q&A sites, some of the most popular ones are Quora, Reddit, and Yahoo! Answers. AnswerThePublic As for non-Google ways of getting long-tail keyword ideas, it’s suggested to use the AnswerThePublic tool, which was specifically designed to help you expand your site’s keyword list. Once again, let’s see what results we get if we enter the search query “skin health”: AnswerThePublic will provide a plethora of suggestions on keywords including in the form of questions, with additional prepositions, keyword comparisons, alphabetical keyword listings, as well as related keywords. We have reached out to technical SEO expert and partner at Elementive, Matthew Edgar, to name his top sources for getting long-tail keywords, and here’s what he had to say: The best method for getting long-tail keywords is by interviewing your customers or users. Give your customers or users open-ended questions related to the topics covered and listen to the words and phrases they use in response. More and more, the way people search is the same as the way people talk, and this is especially true with long-tail keywords that are more obscure. The more you can use these words and phrases, the better your content will be for the end-user (for SEO, UX, CRO). If you can’t talk to customers, or in addition to talking to customers, you can also analyze social media posts or email communication from your customers to find the words they use. In some cases, analyzing social media posts or emails is even more helpful than talking since this is looking at how people discuss your product or service in writing, which is even more similar to how they search. In addition to these user-focused methods, the more traditional SEO tools, like Google Ads Keyword Planner, Google Search Console, and Suggested Search all can be helpful to locate long-tail keywords. Finding the right long-tail keywords can sometimes uncover hidden niches. In cases where there are no exact matching keywords for your specific product or service, you may have stumbled upon an untapped market. This presents a golden opportunity for you to pioneer and dominate that specific niche. Keep in mind that keywords may emerge and gain popularity as you establish your page and start generating traffic. Don’t be afraid to blaze a new trail. With the right content and marketing strategy, you could be the one shaping the keyword landscape for this niche. This exploratory process is not only beneficial for your unique offering, but it can also aid you in finding less competitive long-tail keywords for future campaigns. How to use long-tail keywords Okay, so now that we have our long-tail keywords, what do we do next? Do we create content for each single keyword? Can we move the words in long-tail keywords around or do we have to use them in content as is? It all depends on your business and the type of content you publish. However, you can follow these practical steps to get the most out of long-tail keywords: 1. Leverage existing pages Look through your existing content and identify places where long-tail keywords can be appropriately integrated into the copy. This not only improves your search ranking but also enhances the user experience. You can also incorporate these keywords in FAQ sections on your pages. This gives you a better chance of appearing in extended snippets on search engine results pages (SERPs). 2. Develop new pages with intent When creating new pages, organize your long-tail keywords into groups based on their similarities. This approach helps you identify popular keyword phrases that can serve as the main topics for your pages. However, remember to focus on the intent of these keywords. To avoid keyword cannibalization and maintain a clear keyword hierarchy, refrain from creating new pages for each discovered long-tail keyword. While it’s crucial to optimize for keywords, remember to prioritize optimizing for search intent. Regarding keyword flexibility, you may wonder if you can rearrange the words without sacrificing any potential benefits. The quick answer is yes. With Google’s understanding of Latent Semantic Indexing (LSI), diverse formats, and synonyms, you can shuffle the keywords while maintaining the original search intent. 3. Improve internal and external linking Strategically use long-tail keywords in your internal links to help search engines better understand and rank your pages. The same applies to backlinks. By incorporating long-tail keywords into the anchor text of both types of links, you provide a richer context for your page while avoiding over-optimization. Additionally, consider updating old posts to link to the new keywords you’re targeting on new pages. 4. Avoid competing with featured snippets If your targeted long-tail keywords are already featured in featured snippets, you may want to avoid using them. These snippets directly provide answers on the SERPS, potentially reducing click-throughs to your site, and typically appear for questions like “how old is king charles”. Tools like SE Ranking’s Keyword Suggestions can help you understand the SERP features associated with your chosen keywords and adapt your strategy accordingly. By leveraging long-tail keywords effectively, you can improve your website’s visibility, user experience, and conversion rates, gaining a competitive SEO advantage. Now over to you Who would have thought that there’s so much more to long-tail keywords than simply unpopular search queries consisting of 3-5 words? Turns out that if a long-tail keyword has a low monthly search volume, it may not always be easy to outrank competitors because it can be a part of a much bigger topic. And Google tends to show similar results for head and related long-tail keywords. So, I invite you to analyze the keywords that are already driving traffic to your site, optimize long-tail ones for SEO success, look for additional ways to expand your semantic core using the methods listed in this blog post, and then link out to content that focuses on your head term. Then just rinse and repeat! Did you find any long-tail keywords that you were surprised to see you are already ranking for? Keyword Research SEO for Blogs 4661 views Written by Andrew Zarudnyi Andrew is a content marketer, writer, editor, and webinar host at SE Ranking, plus a guest contributor across various marketing media. He is passionate about content, marketing, social media, and SEO best practices and leverages his experience to help companies reach their global audiences more effectively. When he’s not writing about SEO and marketing, he can be found spending time with his cat, enjoying a video game, watching too much soccer or playing the guitar (in that order).",
  "headers": [
    {
      "level": "H1",
      "text": "Understanding Long-Tail Keywords: How to Find the Best Ones and Use Them in SEO"
    },
    {
      "level": "H2",
      "text": "What are long-tail keywords"
    },
    {
      "level": "H2",
      "text": "Why long-tail keywords matter in SEO"
    },
    {
      "level": "H2",
      "text": "Types of long-tail keywords"
    },
    {
      "level": "H2",
      "text": "How to find long-tail keywords"
    },
    {
      "level": "H3",
      "text": "SE Ranking Keyword Research tool"
    },
    {
      "level": "H3",
      "text": "SE Ranking Competitive Research tool"
    },
    {
      "level": "H3",
      "text": "Google Search Console Performance Report"
    },
    {
      "level": "H3",
      "text": "Google Autocomplete"
    },
    {
      "level": "H3",
      "text": "Google “Searches related to”"
    },
    {
      "level": "H3",
      "text": "Google “People also ask”"
    },
    {
      "level": "H3",
      "text": "Google Trends"
    },
    {
      "level": "H3",
      "text": "Keyword Research via Bing Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Forums and Q&A sites"
    },
    {
      "level": "H3",
      "text": "AnswerThePublic"
    },
    {
      "level": "H2",
      "text": "How to use long-tail keywords"
    },
    {
      "level": "H2",
      "text": "Now over to you"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Andrew Zarudnyi"
}