{
  "url": "https://seranking.com/blog/nishikiya-case-study/",
  "slug": "nishikiya-case-study",
  "title": "Case Study: A Self-Storage Operator Boosts Sales by 1000% Using SEO",
  "description": "Learn how investing in content marketing and optimizing website for proper target keywords can result in a significant increase in sales.",
  "content": "Blog / Case Studies / How a Japanese Trunk Room Company Boosted Sales by 1000%How a Japanese Trunk Room Company Boosted Sales by 1000% Written by Stasia Avetysian Jan 26, 2022 7 min read The company Nishikiya is a family venture, founded in June 1968. The core business of the company is a storage space service. Although the company is located in Yokohama, Kanagawa Prefecture, the market it targets is Japan as a whole. The website and organic search is the most important source of clients for the company, so investing in SEO is one of the primary marketing strategies the team is relying on. The goal The company’s main service is providing storage rooms for individual and corporate clients. Over the time of their work, renting storage space for businesses proved to be significantly more beneficial than for individual buyers. This way, the rent is sold in bulk and is more long-term, which means it’s easier to predict the income and build a reinvestment plan. The company’s goal was to shift the focus from targeting individual customers to making deals with businesses. The exact purpose was to reach the mark of 25 deals with investors purchasing storage space for their own business purposes per year. SEO-wise the goal was to attract to the website the targeted audience – investors. Steps to reach the goal: Updating the keyword list to target investors (Keywords + competitive research) Ensuring the website is technically competitive (Website auditing and fixing the errors) Checking if the SEO actions provide an expected result (Tracking rankings and analytics) Let’s take a closer look at each of the steps having been made. 1. Rebuilding the list of target keywords First, was to reevaluate the website’s existing keyword list. First of all, the list included mostly high-volume transactional keywords, which were hard to compete over. Second, the keywords and the content containing them had targeted mostly individual clients. To ascertain which keywords the company should include to target a new focus audience, they’ve begun keyword research. It included two main stages: the keyword research itself and content creation. Both couldn’t be done without analyzing the competitors’ strategies. So, that’s what they’ve done. DEFINING THE NEW TARGET KEYWORDS They needed to gather the keywords to target investors. To avoid missing important semantic opportunities, they’ve started their research from analyzing their competitors’ keyword selection. “We used the Competitor Research tool to collect competitors’ domains that get top 10 rankings in the target keywords. Then, we entered each competitor’s domain one by one on the Competitor Research tool to understand what are the main keywords that attract the traffic to these domains.” Getting a list of websites competing for the target keywords via the Competitive Research tool. Now we can see the client’s website in the top 10, however, before it wasn’t even ranking for this keyword. For each competing domain, the tool highlighted the information on their traffic, keyword list, most popular pages, and keywords. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze EXPANDING THE KEYWORDS LIST WITH INFORMATIONAL TERMS At the next step, the transactional keywords with high search volume proved extremely hard to compete for, which rendered the need for more time to rank high. The top 3 companies ranking for those keywords were industrial giants providing solar power investment services. The Nishikiya company couldn’t afford comparable spendings on their SEO efforts; they also needed faster results. They needed to extend their keyword list with informational queries. To collect them, they used the Keyword Research tool and found the related and the long-tail keywords that included their seed term. The next step was to finalize the list of keywords and gather the most relevant ones, as well as the ones with a good traffic potential. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze CREATING CONTENT WITH RELATED AND LONG-TAIL KEYWORDS The final stage of implementing the new keyword strategy was about creating the content optimized for the new keyword list. It took time to create new pages and reoptimize the content they’ve already had. However, the efforts paid off. The team started seeing the first results in a few months. Besides, through careful keyword analysis, the company discovered insights about hidden customer’s demands. “We changed the past strategy and tried to add informational queries into the semantic core to rank for the related keywords. For example, we created a webpage related to laundromat investment. Apparently, people interested in the laundromat investments are also potentially interested in the trunk room investments (according to the data we’ve got working on the competitors’ keywords lists and pages). Having linked the new page dedicated to the laundromats, we’ve started getting traffic to our trunk room investment page.” Keyword research pushed the company not only to create new content but also to expand their product line, as well as to find original solutions not easy to imitate for competitors. “Online strategy is important; however, the product is what customers are coming for, and it should exceed their expectations.” 2. Fixing the technical issues With semantic research, it was crucial for the company to ensure their website was technically ready for the rivalry. They’ve started using SE Ranking’s Website Audit for occasional check-ups, but now, they are getting the regular reports on their website’s health. Since the team is working by themselves, without a webmaster on board, challenges with fixing issues requiring special technical knowledge of programming arise. However, thanks to the how-to-fix guides provided in the audit reports, they could fix most of the critical issues by themselves with the basic knowledge on WordPress and HTML. Now, their website is performing just fine. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze 3. Tracking the results of the SEO efforts Using the Keyword Rank Tracker, the team can trace their website’s progress as well as the rank changes of their competitors. After a couple of Google updates that almost induced a heart attack, checking the rankings became a part of the morning routine for the team. “We check the Ranking section every morning, and when a ranking fluctuation happens, we thoroughly analyze the content that is affected by the search algorithm and compare the competitors’ content to understand their strengths, weaknesses, and uniqueness. We will then take all of this information and use it to improve our web pages.” The team has organized the work with the rank tracker the way it covers their needs: they’ve grouped the keywords targeting different locations to track them separately. They’ve also singled out the keywords relating to the side services the company is providing. This allows them to see the accurate ranking data for each of the local markets the company is targeting. Google Update Alerts saves you from panicking!“We were put into a slight panic when algorithmic fluctuations occurred on Google, and sometimes, it affected our rankings before we started to use SE Ranking. Now, by using SE Ranking, we can check if the algorithmic update occurred with the note feature on the Ranking section.” The sales results Annual quantity of the sales to the big investors increased from 1 or 2 to 25. It took about a year to achieve the goal. Summing up The case study of the Nishikiya company demonstrates that doing smart keyword research, creating new content, and perfecting the website’s performance can provide results in relatively short terms. SE Ranking, as your SEO assistant, is always there to provide you with in-depth data on your website and your competitors by monitoring features, saving your nerves. Try SE Ranking — 14 days for free 2071 views Written by Stasia Avetysian Stasia is the brand communications manager at SE Ranking. Before assuming this role, she was actually a part of our content team for several years and still continues to write for our blog every now and then. Given the experience under her belt, you are welcome to ask her anything you want about our platform, content marketing, communications, and even philosophy. That’s right, Stasia has a PhD in Philosophy and can professionally explain complex things in simple words.",
  "headers": [
    {
      "level": "H1",
      "text": "How a Japanese Trunk Room Company Boosted Sales by 1000%"
    },
    {
      "level": "H2",
      "text": "The company"
    },
    {
      "level": "H2",
      "text": "The goal"
    },
    {
      "level": "H2",
      "text": "Steps to reach the goal:"
    },
    {
      "level": "H2",
      "text": "1. Rebuilding the list of target keywords"
    },
    {
      "level": "H3",
      "text": "DEFINING THE NEW TARGET KEYWORDS"
    },
    {
      "level": "H3",
      "text": "EXPANDING THE KEYWORDS LIST WITH INFORMATIONAL TERMS"
    },
    {
      "level": "H3",
      "text": "CREATING CONTENT WITH RELATED AND LONG-TAIL KEYWORDS"
    },
    {
      "level": "H2",
      "text": "2. Fixing the technical issues"
    },
    {
      "level": "H2",
      "text": "3. Tracking the results of the SEO efforts"
    },
    {
      "level": "H2",
      "text": "The sales results"
    },
    {
      "level": "H2",
      "text": "Summing up"
    }
  ],
  "author": "Stasia Avetysian"
}