{
  "url": "https://seranking.com/blog/rank-tracker-overview/",
  "slug": "rank-tracker-overview",
  "title": "22 Things to Expect From a Proper Rank Tracking Tool",
  "description": "Want to use a rank tracking tool? Ask these questions to unveil its capabilities and learn how to configure it to get maximum value for money.",
  "content": "Blog / Best Marketing Tools / What a good rank tracking tool can do: Ask these 22 questions before buyingWhat a good rank tracking tool can do: Ask these 22 questions before buying Written by Kseniia Kyslova Dec 17, 2021 37 min read Choosing a rank tracker tool can be difficult. You’ll probably start your research by watching software reviews, but they won’t give you a real taste of the tool’s capabilities. A feature that is presented by a reviewer as beneficial may just appear useless to you. And conversely, the reviewer may overlook a small feature that might be of great help in your daily SEO routine. To understand which tool is the best to accomplish your tasks, you’ll need a demo or a trial. But you shouldn’t approach the trial without a plan on what features to test. To help you with this, we‘ve answered the questions SE Ranking users asked when they started using our tool. Now you can follow in their footsteps during your trial. This question and answer guide covers different aspects of using a rank tracker tool. The best way to work with it is by having your SE Ranking account open in the next tab. So, if you still don’t have one, sign up for a trial and get back to this guide. Together we’ll go through common Rank Tracking Tool questions and use cases. Ranking trends and forecasts What’s the fastest way to spot issues with rankings? The easiest way to extract meaning from data is to read it in the form of a chart. Rank tracking tools are known for delivering a lot of raw data that’s difficult to grasp at a glance. They use different kinds of charts to visualize rankings fluctuations and other metrics’ dynamics. If your tool has a convenient dashboard with charts, you’ll quickly be able to spot trends, patterns, or sudden changes. In SE Ranking, you’ll find the consolidated dashboard for your key metrics under Summary, in the Rankings module. The widgets of the dashboard are interactive. You can click on them to configure or open detailed tables with sorted and filtered data in new tabs of your browser. On top of the dashboard, you’ll see charts showing the dynamics of your site’s Search Visibility, Average Position, and seven Top Positions Distribution charts. If you hover over the chart area, you’ll get data annotations that will help you read the visualized data. If you connect SE Ranking to your Google Analytics, you’ll have the Organic Traffic chart on the Summary dashboard. It’ll show you how overall traffic to your site fluctuated during a selected time frame. To check what pages and keywords bring the most traffic to your site, you’ll need to go to the Analytics & Traffic module and check the Traffic and Google Search Console Data sections. If you scroll down the dashboard, you’ll come to a stacked bar chart and table showing how many keywords Improved, Declined, or had No Changes in positions since the last check. In the table, you’ll see ranking dynamics in different segments of the SERP. To quickly check what keywords from the TOP 2-3 went down, click the corresponding row in the table and the Detailed section of the Rankings module will open in a new tab of your browser. The Rankings table on it will be filtered for you to see the keywords that need your attention right away. Scroll down the dashboard a bit more and you’ll see the Keyword overview table that lists your TOP, Improved, and Declined keywords sorted by Visibility or Traffic Forecast. This table will let you know if a keyword that contributes a lot to your website’s visibility in the SERPs or promises a lot of traffic is currently losing positions. In the same way, you can check your TOP, Improved, and Declined pages. View the five most important URLs in every category, or click View All to open the Rankings table filtered and sorted by URL in the SERP. How to check if Google algorithm updates impact my rankings? Every next Google update results in a shakeup in SERPs. Check if the rank tracking tool can help you track them. It’s nice if it allows you to add notes either manually or automatically and view them in the reports. With SE Ranking, you won’t miss any major Google search algorithm update that can potentially affect your rankings. By default, information on Google’s updates is added to the tool as Notes. These Notes are shown on the line charts, which allow you to see if there are any fluctuations in metrics after another update. Hover over the note icon on the timeline, and you’ll get a popup with details. If you click the View All Notes button in the popup or the Notes button in the upper right corner, you’ll get to the list of all the notes added to SE Ranking. On the Notes tab, you’ll find names and dates for all recent Google algorithm updates and links to resources where you can read more about them. You can also create your own notes that relate to the whole project or a particular keyword. For example, you want to remember when you did a major technical SEO fix on your site and see how it impacted your metrics. Or you want to remember when you got a backlink from an authoritative domain with your main keyword in the anchor text to see how it impacted your rankings for that keyword. SEO lifehacks and insights How to quickly check if rankings went up or down? When looking at your site’s rankings, the first thing you want to see are changes in positions. If you monitor a lot of keywords you can’t just quickly look through your list to see what has changed since the last check. You need special filters for that. With SE Ranking, at a glance, you’ll know how many keywords have recently changed their positions. The number of keywords that dropped or grew in SERPs after the last check is displayed under Changes above the Rankings table. To look through the list of all keywords that went up or down, click the corresponding number under Changes to filter the table. To reset the filter, click All under Position filters. To find out how rankings changed between two dates, use the Dynamics feature. First, customize your Rankings table by adding the Dynamics column to it. Then, select a timespan on the calendar. In the Dynamics column, you’ll see how many positions a keyword, URL, or a group of keywords (depending on the view mode you use) went up or down on SERPs. And there’s one more tip. When you analyze positions, pay attention to the keywords that cross ranking thresholds. They’re highlighted with color. The keywords in the TOP 10 are highlighted in green; those that entered the TOP 10, in blue; and the ones that left the TOP 10, in red. If you only care about what’s happening in the TOP 3, TOP 5, or TOP 10, etc. click the corresponding position filter and you’ll be able to analyze keywords that rank in a particular segment of search results. How to spot keyword cannibalization issues? By default, rank tracking tools track positions for pages that rank the highest on SERPs for every particular keyword. Yet, there may be several more pages of yours that rank for the same keyword on lower positions. Moreover, the URL that ranks the highest may not be the one you want, which indicates content cannibalization. In SE Ranking, to check if the positions are being tracked for the right page, hover over the link icon next to the keyword. You’ll see a URL. Or you may see several URLs if they all contain the keyword and rank close enough to each other to swap positions on the SERP from time to time. Don’t worry, you don’t have to hover over every link icon on the table to spot all cannibalization issues. Instead, you can use our Target URL feature to get the keywords with the wrong URLs ranking for them highlighted automatically. For this, you should define the desirable URLs for every keyword on your list. Just select a keyword or a group of keywords, click Target URL and specify the page address. Keywords with target URLs specified will have an additional link icon next to them. If the right page is ranking for a keyword, the positions in the table will be grey. If some other page is ranking for it, the positions in the table will be red. You can also switch the Rankings table View Mode to URLs in SERP to see what pages ‘steal’ keywords from others. To fix cannibalization issues, you can analyze rankings data for problematic keywords for, say, half a year. You’ll see which page managed to rank longest and highest. Then, you can compare the pages by other factors such as conversions and match between the content and user search intent. Finally, you can decide what page you want Google to rank and take some of the following measures: Optimize the desired page for the target keyword. Deoptimize undesired pages from the target keyword. Delete undesired pages or redirect them to the desired one. After you fix the cannibalization issues, make sure that the keyword has the desired page assigned as the Target URL. If your actions have the right effect, you’ll see only one page ranking for the keyword in SE Ranking. Can I see if my keywords trigger Google SERP features? Tracking positions for organic results without regard for SERP features doesn’t make sense anymore. Search ads, featured snippets, rich results, knowledge graphs, etc., own a lot of space on SERPs and capture people’s attention. Advanced rank tracking tools have adapted to changes in Google’s SERP and allow you to monitor these elements. You should know if any SERP features show up for your keywords and if your pages can get into them. Just think, what if your page ranks in position one, but a user needs to scroll down through a featured snippet and a list of People Also Ask questions to actually see it? With SE Ranking, you’ll be able to track 35 SERP features and see if they get displayed for any of your keywords. To add this information to your Rankings table, go to Columns and check mark the SERP Features column on the dropdown list. Additionally, you’ll see the overall statistics on the SERP features for your keywords in the bar chart over the Rankings table. SERP features are displayed in the table as icons. Hover over any icon to learn what feature it represents. If you see any icons highlighted in blue, congratulations—your pages appear in those SERP features. If the icons are grey, someone else’s pages own them. If there is no icon for a particular type of SERP feature, then it doesn’t show up for the keyword at all. Keyword list management How to find new keywords to add to position tracking? There are several ways to expand the list of keywords in your rank tracker. Arguably, the best one is to add search queries that your site is already ranking for. You’ll easily find such queries in Google Search Console. If your Rank Tracker doesn’t have an integration with Google’s services, you’ll need to export keywords from Search Console in a CSV file and then upload them to the tool. SE Ranking offers a better way to do that. You can link SE Ranking to your Search Console and import keywords from there. For this, you should go to the Analytics & Traffic module. Click the Connect Google Search Console button and log in to your Google account to allow SE Ranking to import data. Or, you might already have them connected if you did it during the SE Ranking project setup. Once your Search Console account is connected, you’ll see the keywords your website ranks for, along with clicks, impressions, and CTR, under Google Search Console Data, on the Keywords tab. Pay attention to the Position column in the table. SE Ranking will show the current positions for the keywords that you already track. For the keywords that you don’t track, it will show the Not Tracked status. For the latter, it’s worth taking a closer look at the performance metrics, to spot some new keywords worth tracking. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze After you find new interesting keywords, check mark them and you’ll see the Add to the project button above the table. Click the button and select one of the existing groups where they belong or create a new one. SE Ranking will show positions for these keywords after the next rankings check. Another great way to find more optimization opportunities and expand your target keyword list is by using SE Ranking’s Keyword Research and Competitor Research tools. If you want to get the maximum out of these tools, read our guide about how to do keyword research. Can I quickly start using Rank Tracker if I don’t have a keyword list? Creating a list of keywords is among the first things to do in any rank tracker tool. Yet, if you use SE Ranking, you don’t necessarily need to have a target keyword list at hand before you set up a project for SERP monitoring. SE Ranking can help you collect relevant keywords on the fly during your project setup or anytime after. When you set up a new project, SE Ranking automatically searches for keywords you might want to track. You’ll be able to use our keyword suggestions on the second step of the project setup. If you skip that step, you’ll be able to add keywords later. For this, you’ll need to click the Add Keywords button available on any section in the Rankings module. The Add keywords button opens the Keywords wizard in your Project Settings. On this tab, you’ll instantly get a list of automatically collected keywords relevant to your domain name, and that’s not all. You can get even more keyword ideas. For this, type a competitor’s domain name or one of your primary keywords in the Keyword Suggestions bar, choose the target country, and you’ll get a new list of keywords. If you’d like to use our keyword ideas, click the + Keywords button to select and add them to the Add Manually area. Then, clean up the list if needed and click the Add Keywords button. The keywords you added will be listed in the table below. You can iterate with the tool as long as your account limits allow adding more keywords. And don’t be afraid of creating duplicates, the software will get rid of them automatically. How to organize your keyword list into topic clusters? The number of keywords you can add to a rank tracking tool depends on your payment plan, but technically it’s almost limitless. On the downside, the more keywords you have, the harder it is to navigate through them. Therefore, keeping them as a bare-bones list isn’t that helpful. Here at SE Ranking, we know that the best way to organize keywords is by clustering them. That’s why our tool has a grouping feature for you to analyze your optimization results for different product lines, services, or topics. If you have a new site that doesn’t rank for many keywords yet, you should cluster keywords before adding them to SE Ranking. For this, you should have a CSV file with two columns—keyword and group. To create such a file, you can use our Keyword Grouper. It’ll cluster a bare list of keywords for you based on their SERPs similarity. Then, add a group name for every cluster and upload your list to SE Ranking. If you want to track positions for an established site, you can upload a bare list of keywords to SE Ranking and then group them manually right in the Rankings module. By doing so you can still leverage SERP-based keyword clustering. For this, switch your Rankings table View Mode from List to URL in SERP. You’ll get the keywords organized by pages that already rank for them. Then, select all keywords that belong to one URL on SERP and add them to a group. As a result, you’ll get your keywords clustered in a way similar to how the search engine does it. Note that every keyword in SE Ranking can only belong to one group, and you can move them from one group to another. Once all groups are created, switch your Rankings table View Mode to Groups to analyze keywords cluster by cluster. The keywords that don’t belong to any group will remain in the General group created by default until you decide to cluster them. How to navigate through a large keyword list effectively? The longer your keyword list is, the harder it is to find and isolate sets of keywords that have something in common, be it search intent, priority, difficulty, or any other property. Yet, if you don’t divide your list into chunks you won’t get any granular insights. To help you do a detailed analysis, we equipped the Rankings table with smart sorting, tagging, and filtering features. First of all, the Rankings table has several View Modes. You can switch between them to see your keywords as a bare list or organize them by Group, Target URL, URL in SERP, Date when you added them to the tool, or by Tags. When applying view modes, you’ll always see the full list of keywords in the table, but they’ll be sorted and ordered in different ways. On top of that, you can use Tags to add an endless number of custom features to your list and use them to filter your keywords by different properties. To tag a keyword or a group of keywords, select them in the table and click the Tag icon on top of the table. You’ll be able to choose one of the existing tags or create a new one. Tagging will help you evaluate the performance of different types of keywords or parts of your website. For example, you can tag and filter keywords that: Contain your brand name to keep an eye on branded SERPs Belong to your home page, blog, or sales pages Have commercial, informational, or navigational intent Influence your KPIs in the current quarter. To isolate a set of keywords with a certain tag from the rest of the list, you should apply Filters. To open the filtering options, click Filters on top of the Rankings table. Select a tag or a combination of tags and click the Apply Filters button. When you apply filters, the table only displays keywords that match the filtering parameters. The charts on top of the table are also updated to show the average position, traffic forecast, search visibility, and other metrics for the filtered set of keywords. Can I customize Rank Tracker and change the way data is displayed? Although all rank trackers serve the same goal, their user interfaces differ a lot. You’ll find some tools more intuitive and appealing than others. The information density, interface layout, self-explanatory icons, and common navigation—all contribute to the overall ease of use. On top of that, there may be defaults and customization opportunities that can ease your rank tracking routine. In SE Ranking, you can decide what data you want to be displayed under Rankings. For this, click the Gear icon to access Ranking settings. You’ll see quite a long list of options when you open the Rankings module. By comparing these two screenshots of the same Detailed section you can see how different it may look depending on your preferences. In the first screenshot, charts are displayed over the Rankings table, the table itself contains positions with rankings check dates arranged left to right, and the Keywords column shows icons for page URLs. In the second screenshot, there are no charts, the Rankings table has four additional columns with keywords sorted by Visibility, the rankings check dates are arranged right to left, and the Keywords column shows the full URL of the page. Keyword tracking capabilities How to track keywords for different locations and languages? If your site targets different countries or cities you’ll need to track positions for each location separately. The matter is search results vary considerably by location. In large cities (such as London or New York), the competition in search is so harsh that SERPs for local businesses even vary by city district. There’s one more thing to keep in mind. If your target audiences in all locations speak the same language, you’ll have a single keyword list. If they speak different languages, you’ll have several keyword lists. The number of locations and keyword lists will define how you’ll configure your rank tracking tool. For a single-language site, you’ll have a single keyword list, so unless you have more than one hundred locations to track, you’ll only need to create one single project with SE Ranking. In this project, you’ll be able to set up to one hundred targets—a combination of search engine and precise location defined up to the zip code level. For a multilingual site in SE Ranking, you’ll need to set up an independent project for every language. When creating the projects, specify the same domain name, but add different target keyword lists. On the Search Engine configuration step of the project setup, you’ll be able to choose different combinations for the Google user interface language and user location. Imagine you have a bilingual site targeting North America. In one project you’ll check positions on the SERPs shown to Spanish-speaking audiences living in Mexico, the US, and Canada. In another project, you’ll check positions on the SERPs shown to English-speaking audiences living in the same three countries. Thus, you’ll have one account with two projects, and each one of them will include three locations. How to view rankings if I track many locations and languages? If you monitor SERPs for several locations and languages, it’s important to organize all the properties in your account logically and hierarchically. If you do everything right, you’ll be able to analyze metrics on several levels: for every location separately, for a group of locations in one language, for one site overall, or in general for the entire account. In SE Ranking you have the following hierarchy levels: account > group of projects > project > search engine. If you have several projects set up for different languages and locations, unite them in a group. This way, you’ll be able to track the results of a site across all its regional versions. Inside every project, you’ll have up to five search engines that will reflect the needed combination of search engine, language, and location. To check metrics for separate projects and groups of projects, go to the All Projects dashboard. There, you’ll be able to view charts showing the dynamics for key metrics, namely Average Position, Traffic Forecast, Search Visibility, and % In TOP 10. To get data for particular projects displayed on the charts, you should mark them on the list. The rest of the modules in SE Ranking will show you data on the project level or the search engine level. For example, select a project and go to the Rankings module. Choose All search engines if you want to see all Rankings tables for all locations shown on the same screen, one under another. Or choose only one search engine from the dropdown list and view only one Rankings table for a particular location. To compare positions across locations in one project, go to the Overall section of the Rankings module. Then choose a time frame in the calendar. In the Rankings table, you’ll see the final keyword position for every location for the selected period. The changes in rankings that happened during that period will also be reflected in the table. A red downward arrow and a number will indicate that keywords dropped in the SERPs while a green upward arrow and a number will show that they jumped. Can I monitor my paid search presenсe along with organic? Some rank trackers allow you to monitor your search engine marketing (SEM) campaigns on Google. For example, with SE Ranking, you can check SERP positions for your PPC ads for free. For this, just enable paid search position tracking on the Search Engines configuration step of the project setup. If you turn on the Track Google Ads Rankings toggle, you’ll be able to switch your Rankings table from Organic to Paid search positions. In the Detailed and Historical Data sections of the Rankings module, you’ll see on what days your ads were shown for this or that keyword on page one of Google search results. Your ad positions may vary from 1 to 8. If none of the ads fall on the first page of Google for a certain keyword, you’ll see a dash in the table. When you analyze your ad positions, it’s important to remember that the ad position doesn’t define the location of your ad on the SERP. Position 1 means that this ad was the first one shown on the SERP, but it could show up either above or below the organic search results. To know exactly where your ads were displayed on the SERPs, click the position number to see the Detailed information and follow the Cached copy or Live Results links. Can I check rankings on Google’s Local Pack? If you have created a Business Profile on Google, you may want to track your performance on both ​​Google Search and Maps. If your business has good ratings on Google Maps, it can show up in the Google Local Pack on the SERPs for local searches, like “near me” or “open now”. Most rank tracking tools won’t count your appearances in Local Packs towards your site’s rankings, but some do. With SE Ranking, you can monitor Google Local Pack results along with organic search results. For this, you should turn on two toggles on the Search Engine configuration step of the project setup. Then you’ll need to specify the name and phone number from your Business Profile for us to identify your company in Google’s listing. If your business shows up in the top three in Local Pack for a particular keyword, you’ll see it in the Rankings table under Detailed and Historical Data. The Google Maps Pin icon and the rank will be displayed next to the organic position number. This feature allows you to better estimate your presence in search since even though your site may fail to rank for some keywords, your business will still show up for them in the Local Pack at the top of the SERPs. Competition and search visibility How to compare your and competitors’ visibility in search? SE Ranking calculates Visibility Rating for your site as well as for your competitor’s sites. Check out a guide to analyzing search visibility with SE Ranking to see how easy it is. To see the visibility scores, go to Visibility Rating in the My Competitors module. The visibility score will help you see who owns the biggest share of impressions on the SERPs across search engines and locations in a particular niche. By default, you’ll see the overall Visibility Rating for domains that compete for your keywords, but our tool allows you to go much deeper. You can check visibility on SERPs for a particular group of keywords. For this, use Filters to choose the Group of keywords that you want to analyze. With the filters applied, the table will show your closest niche competitors and where you stand compared to them. Along with the Visibility score, you’ll be able to consider the number of Backlinks and Referring Domains, as well as the Domain Trust for every site on the list. This will help you estimate how difficult it will be to increase your share of impressions on the SERP. How to check SERP dynamics and competition for a certain keyword? Although ranking tables and charts are a great source of insights, you still might want to view and compare daily SERPs for every keyword. This will allow you to estimate how stable or shaky the SERPs are, whose pages rank higher than yours, what’s going on in your brand SERPs, and a million other things. With SE Ranking, you can view the TOP 100 results for any keyword tracked in your project. For this, go to the My Competitors module, and choose the SERP Competitors section. Select a keyword from the dropdown list and set a desired period in the calendar to view daily SERPs side by side. The snapshot of SERPs will help you see what pages you compete with for every keyword or group of keywords. These can be pages of your business competitors, social media sites, online magazines, marketplaces, etc. Choose the Domain display option to see sites instead of page URLs. You can click any of the listed domains to highlight it across all SERPs and see its ranking fluctuations. If you want to analyze any of the listed domains, click the three dots next to the page name and choose the Research this domain option. You’ll open the domain in the Competitive Research tool. There you’ll see for what keywords it’s ranking, how much organic and paid traffic it’s getting, how many backlinks and referring domains it has, and more. Budgeting and planning How many keywords should I track? The number of keywords to track depends on the overall size of your target keyword list. As every site is different, it’s impossible to specify exact numbers. However, we can speak about the percentages of keywords you want to track for every keyword cluster or page. The percentage of tracked keywords shouldn’t be equal across the site. It should change depending on the importance and relevance of every particular page. For the least important pages, tracking around 10% of keywords from their cluster is enough to get an approximate picture. For pages that require more accurate data on rankings, you should raise the percentage up to 50%. For the most important pages, it’s best to track 100% of the keywords they target. When following this approach you’ll have to choose what keywords to add. Select them based on their search volume and search intent. For example, if your website targets both informational and commercial keywords, you’ll prefer to track more of the latter. That’s because ranking high for commercial keywords influences your bottom line more directly. The type of page will also matter. It may be enough to track 1–5 keywords for a top-of-the-funnel blog post. But for a bottom-of-the-funnel sales page, you’ll want to track as many keywords as possible. If you want to balance your rank tracking list, try to add keywords in iterations. First, upload the keywords your pages already rank high for to keep an eye on them. Then, add the keywords you want your pages to go up for in the near future to see your optimization progress. And finally, expand your main keyword groups proportionally or add new groups until you reach your account limits. How often should I check positions in Rank Tracker? You should expect your site’s rankings to constantly fluctuate. Moreover, you should accept the fact that the frequency of these fluctuations doesn’t adhere to any schedule. That’s because too many factors influence them. Rankings for competitive keywords tend to change more often than for less competitive ones. Everybody’s positions in the SERPs tend to move around more often after each Google algorithm update. Some of your pages can go up or down anytime you make changes to your site. How often you look at the data collected by the tool will depend on your circumstances. You can do it once a week or a couple of times a week. Yet, your rank tracker should collect rankings data daily. The best thing here is that you’ll be able to analyze positions on any day and always see the most complete and fresh rankings data. If you set the Rank Tracker to check positions daily, you won’t miss any position changes and will always know the exact day when they happened. This will help you respond to changes on time and better understand the cause and effect for every ranking fluctuation. Can I check my website rankings for free? Checking your site’s ranking for a particular keyword free of charge is not a problem. Type the keyword in the Google search bar and you’ll get search results with your page listed in them. Yet, you should keep in mind that you’ll see a personalized SERP. It’ll be affected by your location, search results settings (language and country), and previous searches. Even if you manage to depersonalize your search results, doing manual SERP checks won’t help your SEO at all. Position tracking only makes sense if done regularly, accurately, and at scale. If you’re serious about position tracking, you should use professional SEO software. To use a rank tracking tool for free, sign up for a trial. For example, SE Ranking will give you 14 days to try out all the features available in the Essential Plan. During this time you’ll be able to set up projects for up to ten sites and track daily positions for 750 keywords. Every keyword added to a project can be tracked across five locations or search engines. A free-of-charge trial will help you get an idea of where your most important pages stand on different SERPs. Yet, seeing how your SEO activities affect your rankings is only possible if you track positions continuously. Therefore, to get maximum value from rank tracking you should buy a subscription and use the tool for a longer time. How much does Rank Tracker cost? Pricing policies for rank tracking software vary. The most convenient tools provide flexible price plans. They allow you to adjust the rank tracker keyword limit and rankings check frequency as needed. Therefore, whether you track positions for a small or a giant website, you’ll get a fair and reasonable price. SE Ranking has one of the most flexible pricing policies. It goes beyond the three-tier pricing model commonly used for online software. You can change the price for any SE Ranking payment plan by adjusting the number of keywords to track and frequency of ranking checks. On top of that, by choosing a longer subscription period you can get up to 20% off the monthly subscription price. Data accuracy and safety Does Rank Tracker data reflect the actual situation on SERPs? If you live-check a SERP for a particular keyword in your browser, you may see a slightly different picture than your rank tracker shows. Yet, this doesn’t mean you should put the tool’s data accuracy into question. Instead, consider two cases when the positions in your rankings table and your browser mismatch for valid reasons. First, search results are shifting all the time. For example, you set SE Ranking to check positions daily at 8 am. And then, you decided to check the SERPs in the browser at 8 pm. Chances are your site’s rankings change during these 12 hours. Therefore, if your position analysis routine is scheduled at a particular time of the day, you should configure automatic positions check a couple of hours earlier. This way you’ll always work with the freshest data. The second reason for the position mismatch is Google’s SERP personalization. The search results in your browser adjust to your current location and also may be affected by the immediate context from your prior search. At the same time, in SE Ranking you’ll see the positions from depersonalized SERPs shown in the location you target. For you to check the accuracy of data, SE Ranking saves a cached copy of the search results that Google provided when we checked your positions. You can click on any position number in the Rankings table to view the Detailed information popup that links to cached and live SERPs. Moreover, there is the Recheck Data button in the Positions module in SE Ranking. At any time, you can click it to start a new position check and refresh the positions in the table for the current date. The tool allows you to update positions for the entire account or for a specific location. Can I safely share keyword rankings data? Your subscription for a rank tracking software may allow one or several users in your account, depending on the payment plan. If multiple user seats are available, you’ll be able to grant access to your colleagues or clients. When sending invites, you’ll define their access privileges, namely the data they can view and actions they can take in the software. For example, to add users in SE Ranking, hover over the Account Icon and select the Users option from the dropdown list. On the Users tab, click the Add User button, choose the type of account you want to create (Manager or Client), and configure access permissions. If only one user is allowed in your account, or all user seats have been taken, you can still share access to the rankings data in an alternative way. Use the Guest link feature. It allows you to let a guest in the Rankings, Competitors, or Analytics & Traffic modules in a couple of clicks. It’s still safe because you control what the guest can see and can update your Guest link at any time to disable access through the link you previously shared. In any case, you shouldn’t give your own account credentials to other people. It isn’t safe and may result in losing data or access to your account due to malicious actions done by a third party. Takeaway Hopefully, this question and answer guide will help you dive deeper into the features of rank tracking tools and the various ways to use them effectively. In the example of SE Ranking, you can see solutions to organize your target keyword list, monitor the positions of your site in the SERPs for different locations and languages, spot common issues with rankings, and find new optimization opportunities. Yet, this list of rank tracker use cases is by no means exhaustive. The tools have evolved to adapt to changes in search engines algorithms and meet the most current needs of digital marketing professionals. Check out What’s New at SE Ranking and learn more about the features that have recently expanded our tool’s capabilities and given you new SEO powers. Don’t forget that you can be part of this magic! If you have ideas about what features could help you reach your SEO goals, let us know in the comments. We’ll embrace your feedback and suggestions and turn them into new features and improvements. Keywords SE Ranking Tools SEO Metrics 8915 views Written by Kseniia Kyslova Kseniia is a content marketer at SE Ranking. She's curious about all things SEO and content production. When she's not writing, you're likely to see her training, running, climbing, or cycling. Yet, the ever-evolving world of digital marketing occupies her mind and deters her from being a total fitness junkie.",
  "headers": [
    {
      "level": "H1",
      "text": "What a good rank tracking tool can do: Ask these 22 questions before buying"
    },
    {
      "level": "H2",
      "text": "Ranking trends and forecasts"
    },
    {
      "level": "H3",
      "text": "What’s the fastest way to spot issues with rankings?"
    },
    {
      "level": "H3",
      "text": "How to check if Google algorithm updates impact my rankings?"
    },
    {
      "level": "H2",
      "text": "SEO lifehacks and insights"
    },
    {
      "level": "H3",
      "text": "How to quickly check if rankings went up or down?"
    },
    {
      "level": "H3",
      "text": "How to spot keyword cannibalization issues?"
    },
    {
      "level": "H3",
      "text": "Can I see if my keywords trigger Google SERP features?"
    },
    {
      "level": "H2",
      "text": "Keyword list management"
    },
    {
      "level": "H3",
      "text": "How to find new keywords to add to position tracking?"
    },
    {
      "level": "H3",
      "text": "Can I quickly start using Rank Tracker if I don’t have a keyword list?"
    },
    {
      "level": "H3",
      "text": "How to organize your keyword list into topic clusters?"
    },
    {
      "level": "H3",
      "text": "How to navigate through a large keyword list effectively?"
    },
    {
      "level": "H3",
      "text": "Can I customize Rank Tracker and change the way data is displayed?"
    },
    {
      "level": "H2",
      "text": "Keyword tracking capabilities"
    },
    {
      "level": "H3",
      "text": "How to track keywords for different locations and languages?"
    },
    {
      "level": "H3",
      "text": "How to view rankings if I track many locations and languages?"
    },
    {
      "level": "H3",
      "text": "Can I monitor my paid search presenсe along with organic?"
    },
    {
      "level": "H3",
      "text": "Can I check rankings on Google’s Local Pack?"
    },
    {
      "level": "H2",
      "text": "Competition and search visibility"
    },
    {
      "level": "H3",
      "text": "How to compare your and competitors’ visibility in search?"
    },
    {
      "level": "H3",
      "text": "How to check SERP dynamics and competition for a certain keyword?"
    },
    {
      "level": "H2",
      "text": "Budgeting and planning"
    },
    {
      "level": "H3",
      "text": "How many keywords should I track?"
    },
    {
      "level": "H3",
      "text": "How often should I check positions in Rank Tracker?"
    },
    {
      "level": "H3",
      "text": "Can I check my website rankings for free?"
    },
    {
      "level": "H3",
      "text": "How much does Rank Tracker cost?"
    },
    {
      "level": "H2",
      "text": "Data accuracy and safety"
    },
    {
      "level": "H3",
      "text": "Does Rank Tracker data reflect the actual situation on SERPs?"
    },
    {
      "level": "H3",
      "text": "Can I safely share keyword rankings data?"
    },
    {
      "level": "H2",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Kseniia Kyslova"
}