{
  "url": "https://seranking.com/blog/se-ranking-notification-system/",
  "slug": "se-ranking-notification-system",
  "title": "SE Ranking Notification System",
  "description": "Today you can get all possible SE Ranking news, updates and website ranking changes with a new notification system. Each user will view all general information within his account.",
  "content": "Blog / SE Ranking News / SE Ranking Notification SystemSE Ranking Notification System Written by Kelly Breland Jun 27, 2015 1 min read Proper and timely communication is everything. Especially when it comes to informing our customers about new features or important updates. That’s why we’ve implemented a new notification system. The updated version will cover not only our system upgrades but inform you about the results of website positions. We hope that some of SE Ranking users have already noticed a bell close to your username. If you view a colorful point together with your bell it means that you should check some news and updates! The most important thing that you can view is to check your keyword positions in search engines. If some search queries are just included into TOP 10 or TOP 100 ranking results or dropped out from these ratings you will get notifications about these changes! As the ranking table we used different colors to improve your perception of rankings results. If you click specific news you will get well-detailed information about it. We will share different SE Ranking news, declare some sales, ranking changes and other things with help of our new notification system. General information (SE Ranking updates, discounts, news) will be displayed for all user accounts. All notifications connected with website positions will be sent to the admin of projects and additional accounts that admin gives the permission to a certain project. Thus, you won’t miss any important events, news and updates of SE Ranking. Enjoy our new feature! 1896 views Written by Kelly Breland Kelly Breland is a Digital Marketing Manager at SE Ranking with experience in SEO, digital and content marketing. She is a persistent advocate of using content marketing to build a solid brand. In her spare time, she is engaged in gardening.",
  "headers": [
    {
      "level": "H1",
      "text": "SE Ranking Notification System"
    }
  ],
  "author": "Kelly Breland"
}