{
  "url": "https://seranking.com/blog/seo-news-january-2024/",
  "slug": "seo-news-january-2024",
  "title": "Google Confirmed a Ranking Issue: Did You Notice It?",
  "description": "Catch up on the latest SEO news of January 2024. This detailed overview contains all major updates that happened during the first month of the year.",
  "content": "Blog / SEO Industry News / Ranking Issue, Huge Update Coming, and Other SEO News for January 2024Ranking Issue, Huge Update Coming, and Other SEO News for January 2024 Written by Yulia Deda Reviewed by Olena Karpova Feb 06, 2024 5 min read In this edition of our blog series on SEO news, we’ll focus on a ranking issue that occurred where sites were removed from SERPs on weekends. We’ll also review the coming algorithm update, changes within GSC, and categories that Google has started disabling. So, let’s not waste time and get straight to the point! Ranking Bug Removing Sites from SERPs At the beginning of the year, many website owners and marketing specialists began discussing the appearance of unusual ranking fluctuations in search results. This bug was limited to specific ICANN-era generic top-level domains (gTLDs) like .energy, .club, .info, etc. (although some dot-com websites also got affected), and it only occurred on the weekends. Site quality was likely not to blame here. But the main problem went beyond a decrease in traffic during the weekends. The actual rankings of websites (including branded ones), were dropping out of search. Some pages had become impossible to find on weekends, an indication that they were deindexed. Some discussions regarding this issue had begun in November 2023, but they happened most in January 2024. For instance, this issue was highlighted in a tweet by Olesia Korobka (@Giridja): The question is if all websites in .media, club, clinic etc experience the issue? Or could it be a mix of locality and tld or something else?https://t.co/kehMg3phLS— 🐝 Olesia Korobka 💙💛🐝 (@Giridja) January 16, 2024 It’s important to note that this bug was causing both individual web pages and entire sites to disappear from search results. Affected sites performed well in between these fluctuations, sometimes even ranking #1 for competitive queries. Later this month, Google confirmed that this bug did affect a “small number of websites.” The search giant stated the following: “We’re aware of a very narrow issue that caused temporary fluctuations in search results for a small number of websites. The issue has since been resolved, and the sites should no longer be seeing its effects.” SEOs Asking for a New Algorithm Update There were no official algorithm updates in January. However, there is a but in this story. After tons of updates launched in the second half of 2023, most SEOs expected a significant improvement in search results. But not everything happened as expected. There are multiple Google support forum discussions revolving around the fact that the quality of search results has decreased. Many people have observed plenty of spam at the top of the SERP. And even though adapting to new updates can be difficult, some SEOs are actually urging Google to release new algorithm updates. Just kidding. Here’s a meme tweet by Lily Ray where she jokes around and asks Google for a new update: Me in 2023: please, no more Google updates, I am dying and can't take anymoreMe in 2024: pic.twitter.com/iyrmD0Svom— Lily Ray 😏 (@lilyraynyc) January 26, 2024 Throughout December and January, tons of discussions centered around Google’s potential efforts to reduce spam on SERPs. Google also officially confirmed its intention to deal with its current surge in search spam, but the exact timeline for this update has not yet been specified. Danny Sullivan, Google’s Search Liaison, posted a response to Lily Ray’s tweet. He hinted that an immense update is coming: pic.twitter.com/xnJeYVeVHn— Google SearchLiaison (@searchliaison) January 26, 2024 That means we’ll all have to steel ourselves soon! But until then, let’s keep our fingers crossed that the coming update will actually help deal with this problem and enhance the overall quality of search results. Google Search Console Updates Updated evaluation of impressions and clicks metrics for job listing and detail pages Because of the changes made to the way Google tracks clicks and impressions for job listing and detail pages, these metrics might increase within performance reports, starting from January 9th. But this doesn’t necessarily imply actual growth. In most cases, the rapid growth of these metrics can be attributed to GSC’s improved reporting of impression and click counts. Crawl rate setting is officially gone The crawl rate setting, which was launched 15 years ago, has officially been removed from GSC as of January 8th. This was expected as Google issued a warning about the feature’s removal back in November of 2023. Gary Illyes from Google explained the reason behind this decision, stating that “with the improvements we’ve made to our crawling logic and other tools available to publishers, its usefulness has dissipated.” Google Categories Set for Deactivativation Websites made with Google Business Profiles are expected to be turned off soon The update targets websites with domains that end with business.site and negocio.site. In March 2024, these websites will be turned off and all the traffic will be redirected to your Business Profile. This approach is expected to be in effect until June 10, 2024. But after that, visitors to these websites will get a “Page Not Found” error. To avoid this problem, create a new website using other tools and update your Business Profile with the new website address. Google Groups ending support for Usenet As of February 22, 2024, you will no longer be able to publish content to Usenet groups, subscribe to Usenet groups, or access newly posted Usenet content using Google Groups (at groups.google.com). But you can still browse and search through historical Usenet posts on Google Groups that were made before February 22, 2024. In the past several months, Google has been giving its old Google Groups forum area a massive ranking and visibility boost on SERPs. Spammers have also clearly taken advantage of this boost, exploiting it to such an extent that Google has chosen to pull the plug. Google has begun the process of disabling cookies In October 2023, Google warned about the coming initiative to end third-party cookies. As of January 4th, the Chrome web browser disabled cookies for 1% of its users (this equals to approximately 30 million people). By the end of 2024, cookies are expected to be completely disabled in Chrome. Finishing up for now. Stay engaged with our blog for upcoming SEO news! SEO News 1804 views Written by Yulia Deda Yulia Deda is a content marketer at SE Ranking. She is passionate about all things SEO, with a particular focus on analytics & reporting, technical SEO, and keyword research. In her spare moments, Yulia enjoys watching documentaries or immersing herself in a captivating book.",
  "headers": [
    {
      "level": "H1",
      "text": "Ranking Issue, Huge Update Coming, and Other SEO News for January 2024"
    },
    {
      "level": "H2",
      "text": "Ranking Bug Removing Sites from SERPs"
    },
    {
      "level": "H2",
      "text": "SEOs Asking for a New Algorithm Update"
    },
    {
      "level": "H2",
      "text": "Google Search Console Updates"
    },
    {
      "level": "H2",
      "text": "Google Categories Set for Deactivativation"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yulia Deda"
}