{
  "url": "https://seranking.com/blog/seo-video-marketing/",
  "slug": "seo-video-marketing",
  "title": "Video SEO: Get Your Videos Ranked on Google",
  "description": "Get tips on how to help Google find, index, and rank videos hosted on your website as well as YouTube. Learn how to find hot content topics & keep viewers engaged.",
  "content": "Blog / SEO Strategy / SEO for Videos to Shine in Google SERP and Boost Your Marketing StrategySEO for Videos to Shine in Google SERP and Boost Your Marketing Strategy Written by Yulia Deda Reviewed by Olena Karpova Jun 07, 2024 23 min read Online video consumption is steadily growing, with 91% of businesses using video content production as an integral part of their marketing mix. Businesses feature videos in their content plans to boost user engagement, take the load off the support team, build user communities, attract qualified leads, and even drive sales. For instance, Google recently conducted a case study demonstrating the potential impact of following video best practices. Italiaonline, one of Italy’s leading digital groups, “implemented video structured data and saw an 841% increase in video clicks and 353% increase in impressions in organic search, while video indexing errors decreased by 85%.” This is clear evidence that both search engines and people crave video content! But with so much video content out there, getting yours to stand out isn’t easy. That’s where SEO video marketing comes in. This article will explain how to improve the performance of your videos (on YouTube and your website) and keep viewers’ eyes glued to your content. Key takeaways High-quality video content can keep viewers engaged for longer, increase CTR, and lead to more websites linking to yours (enhance backlink generation). To optimize website-hosted videos for search engines, SEOs usually follow a multi-step approach. This includes: 1. Making sure videos are indexable; 2. Helping Google find videos (by making them publicly viewable, placing them on dedicated pages, including them in the proper HTML tag, submitting a video sitemap, etc); 3. Allowing Google to fetch video content files; 4. Making videos eligible for specific video features (video previews, key moments, live badge); 5. Maintaining video relevance through removal, restriction, or updates. In terms of SEO for YouTube videos, it’s recommended to create powerful titles and descriptions, optimize thumbnails for better CTR, and provide users with quality subtitles. To keep viewers engaged, make sure to hook them in the first 5-10 seconds with a summary of key points, use timestamps for easy navigation, encourage interaction (likes and comments), link to related content on your channel, and create playlists for enhanced viewing experience. Does video help SEO? Now more than ever, Google’s algorithms favor search results containing videos. Let’s look at some statistical data to illustrate this. As of now, 51.07% of mobile SERPs in the US contain video content. The numbers are also pretty impressive in the European markets: 56.5% in Italy, 52.28% in Finland, and 46.41% in the UK. When googling a popular how-to query, in most cases, you’ll get a SERP that looks like this: I bet you wouldn’t mind securing a spot for your video in similar search results. To do so, you’ll need to build and maintain a comprehensive SEO video marketing strategy. By combining video and SEO into a single strategy, you may expect a mix of different benefits for your online business. Let’s take a look at some of them in detail. 1. Video content extends session duration. Videos tend to hold viewers’ attention longer than text-based content. This increased dwell time on your website is a positive behavioral factor. It indicates to search engines that your content is relevant and valuable. Plus, the more time people take to explore your content, the more likely they are to navigate deeper into your website. This means you may also notice an increase in pageviews per session. 2. Video content can increase your click-through rate (CTR). Video content combines three essential components for grabbing user attention: sight, sound, and motion. It also provides you with all the necessary means to tell a compelling story, showcase a product, or explain a concept in an informative and entertaining way. A catchy video can also interrupt a viewer’s scroll and encourage more clicks. 3. Video content can enhance backlink generation. People are more likely to share video content than any other content type. This means one essential thing: valuable backlinks to your site. These backlinks showcase your website’s credibility and value to search engines, which leads to higher rankings and a stronger overall SEO performance for your website. What’s more, if you upload a YouTube video and add a link to your website in your channel/video description, expect to receive qualified referral traffic. The first step to achieving these benefits through video marketing is to find and address the right topics. Find topics to cover in your video How do you typically generate your video ideas? Perhaps you draw inspiration from your product. Or maybe you create videos based on customers’ requests. Sure, these methods can help you find great video topics, but there are other methods worth looking into that can improve your video SEO strategy. Create videos for the keywords you already rank for Finding the right keywords is easy with the Competitive Research tool. Out of all the keywords your site ranks for, this tool will single out keywords with videos in search results. Just enter your website URL into the search box and scroll through the dashboard to the SERP Features section. Click the Video tab to see a lengthy list of keywords. Your site will rank for all of them. Plus, they trigger SERPs that feature videos. Using filters is a great way to sift through bulky keyword lists. For example, you can configure the search volume range to get rid of overly broad queries and those likely to generate little traffic. This can save you from investing in video protection that may not be worth investing in. You can also exclude topics that you prefer not to cover in your videos. Another option is to find keywords that aren’t making it to the top 10 and create quality videos around them. This can help in achieving a spot on Google’s first page. The tool is exceptional in that it always lets you view the SERP and the exact videos it features. Just click the three dots next to whichever keyword and check Live results. This will give you an idea of the videos you will be competing with. Find brand-new topics for your videos It is also possible that your website still doesn’t rank for keywords that could make for a great video. To get a limitless pool of topic ideas, go to SE Ranking’s Keyword Research tool. It contains information on millions of queries Googled by people regularly. Naturally, many of these queries trigger video snippets. Start by entering search queries related to your business. In the example below, the keyword entered doesn’t contain a video snippet in search. But going to the Similar keywords report yields plenty of video opportunities. Use filters to single out keywords that trigger a video snippet. You can also filter out keywords with specific search volumes. You can also paste a keyword that triggers a video snippet into the Keyword Research tool and look for keywords of the same cluster. As a rule, if the SERP is dominated by video content for some of the cluster’s keywords, other keywords will gradually follow the lead. This gives you a heads-up to create respective videos that can increase your chance of reaching the top of search results. Finally, here is one major pro tip to consider. If your niche isn’t as video-rich as the legal industry, (used as an example above), you can create videos for keywords that may eventually (but don’t currently) feature a video in search results. These typically take the form of tutorials & how-to requests, product reviews (unboxings, comparisons), and educational content. Make your videos stand out on Google Finding top-ranking topics is easy with SE Ranking. The hard part is getting Google to favor your videos over others and include them at the top of the SERP. Whether you plan on creating a YouTube video or a video hosted on your website, you should always strive to create quality content. One way to accomplish this is by showcasing the highest levels of E-E-A-T. According to Page Quality Guidelines, to achieve the top quality mark, artistic content (videos, images, photography, writing, etc.) should be “unique, original, and created by highly skilled and talented artists or content creators.” Plus, if your video is related to a YMYL topic, Google will analyze your content with an even higher level of scrupulosity. There are plenty of YouTube videos that promote dangerous medical info, conspiracy theories, and other topics that can negatively impact people’s lives. So, when creating videos on YMYL topics, take extra care to align with all E-E-A-T principles. The next part of this article focuses on ways to improve your SEO for videos, whether hosted on your website or on YouTube. For those who have had enough reading for today, check out SE Ranking’s webinar replay on video SEO. Greg Jarboe’s 10 steps for optimizing videos for Search and Discovery has you covered: How to conduct SEO for website-hosted videos Let’s go over some of the best SEO video marketing practices. These can make your video-hosted website stand out on SERPs today. Help Google find your videos Follow the steps below to simplify the process of finding your videos by search engine: Only publish your videos on webpages that are accessible for public viewing. Plus, double-check to ensure these pages aren’t blocked by robots.txt or noindex robots meta tags. Place each video on a dedicated page, with the video serving as the page’s main content. Incorporate relevant titles and descriptions that are unique to the video. You can also feature this video on its original page next to other information. This is common for news articles and product detail webpages. Include your video in the appropriate HTML tag. It’s easier for search bots to identify videos on webpages with HTML tags. Generate a corresponding video sitemap. This will help search engines find and understand your videos more effectively. Ensure your videos load directly on the page without requiring extra effort from users (e.g., swiping, clicking, or typing). Otherwise, if your webpage cannot load without complex user actions or specific URL fragments, Google may not find your video content. Make your videos indexable Google is constantly changing its algorithms, altering how content is indexed and ranked. Video content is no exception here. To make your videos eligible for indexing today, you must ensure they are the main content of your webpage. In April 2023, Google announced that “video thumbnails will only appear next to Google search results when the video is the main content of a page.” This change in video presentation on SERPs was aimed at making it easier for users to understand what to expect when visiting pages. This suggests that if the video is not your page’s main content or primary focus, it will not be eligible for indexing. Here are some page types where text is considered the core content and video is optional: A blog post where the main emphasis is put on text. Video is only used to enhance information or provide a different perspective. A product page where the featured video provides a visual demonstration or additional features of the product/service. A video category page where each featured video has equal weight and importance. In December 2023, Google extended this change to search results in Video mode. After the update, clicking a video search result could only bring users to webpages whose videos serve as the main content. The Video indexing report in GSC clearly outlines the impact of this change. Videos that aren’t the main content on the page are now marked with “No video indexed” issues. This report now includes the following new explanation for why some videos aren’t indexed: “Video is not the main content of the page.” In 2024, expect several new changes to the way Google indexes videos and shows them in search. Since Google also rolled out its AI-powered SGE in the US, videos may become even more prominent in search results. Allow Google to fetch your video content files Google needs to access the video itself to analyze its content and then potentially enable rich features like video previews and key moments. Follow the practices below so Google can fetch your video content files: Use structured data to provide the contentURL property value using file formats supported by Google. Follow robots.txt rules and use the noindex tag carefully. Otherwise, you may unintentionally block Google from fetching the video’s streaming file bytes. Both the website embedding the video and the website hosting the video must be accessible to search bots and have an available server load. Ensure that each video is available through a unique and stable URL. Enable specific video features Apart from traditional organic results, Google sometimes displays additional SERP features with relevant information to the user’s query. They make search results more informative and allow users to see highlights of what they searched for without needing to go to any website. When it comes to video search results, Google offers several SERP features to help your videos stand out. Let’s explore some of the most popular options. Video previews Let’s say Google decides that video content would be valuable when providing search results to a particular search query. In this case, the search giant chooses the three most relevant videos and features them in search results. To give users a better idea of what to expect from watching this type of video content, Google usually displays a moving video preview. To make your videos eligible for the video preview feature, double-check whether you gave Google access to fetch your video content files. To instruct the search engine on how many seconds your video preview should display, you can use the max-video-preview robots meta tag. Key Moments Key Moments is another interesting SERP feature. You can use it to give users a deeper contextual understanding of your video content. Simply put, this feature is used to divide long-form videos into so-called chapters, linking viewers to the video’s key moments. Google can automatically analyze your video to identify key moments, but you can also manually provide timestamps to important sections using structured data or through your YouTube description. After providing these instructions, the search engine will prioritize them. For video content hosted on your web page, you can choose one of the following two options to enable Key Moments: Clip structured data This method lets you mark specific parts of your content, defining start and end points for each segment, and provide labels for any language supported by Google. SeekToAction structured data This method is used to explain how your URL structure works. Google will use this data to display your video’s key moments, which are automatically identified. Live Badge Finally, you can optimize your content for Google’s Live Badge feature. This informs Google that you are broadcasting a live stream, which essentially means publishing video content in real time. The Live Badge could be particularly useful for events like press conferences, award shows, live sports broadcasts, and educational events like live lectures, workshops, or Q&A sessions. To be eligible for this feature, mark your video with the BroadcastEvent structured data and the Indexing API. Remove, restrict, or update your videos as needed Google suggests keeping track of your videos and their relevance to ensure you continue providing the best experience to the user over time. If one of the videos on your website provides little to no value to users, doesn’t align with your goals, or creates confusion, delete it. Here is how: Return the HTTP status code 404 (Not Found) for any webpage with a removed or expired video. Set up a noindex robots meta tag for webpages featuring a removed or expired video. This instructs search bots not to index these URLs. Specify an expiration date using schema.org structured data or video sitemap. This tells search engines when the information in your video is no longer considered valid. If possible, replace the video with a new, accurate version. Videos with an expiration date in the past typically aren’t included in SERPs, but Google may still display webpages hosting these videos for relevant queries (but without a video thumbnail). Make sure all videos with time-sensitive content are marked with accurate expiration dates. You could otherwise confuse search engines and users with outdated insights. But be careful not to accidentally set the date to the past for an available video. Doing so may result in the exclusion from SERPs of up-to-date videos containing valuable information. Another thing worth mentioning is that you can control who can watch your videos based on their location. In a video sitemap, the <video:restriction> allows you to specify which countries can access a particular video. However, keep in mind that each video can only have one restriction featuring specific ISO 3166 country codes. How does this tag work? The tag works with a relationship attribute that determines how the restriction is applied. You can choose to allow the video only in specific countries using the corresponding relationship=”allow” tag. On the other hand, you can deny access to the video in specific countries with the relationship=”deny” tag. When using VideoObject structured data to describe a video, set the regionsAllowed property to target specific locations. Otherwise, users from all regions can watch the video. How to SEO YouTube videos To optimize your YouTube content correctly, you first need to analyze your current performance. This is where SE Ranking’s YouTube Rank Tracker comes in handy. This tool gives you access to insights on how your video’s rankings change over time in different locations, both on YouTube and Google. This gives you an understanding of how efficient your current strategy is so you can plan your next steps going forward. Now, let’s focus on some practical steps to take when conducting SEO for videos. Create powerful titles and descriptions In its early days, YouTube search ranking algorithms largely relied on keyword placement within the video title and description. Today, the way you optimize your titles and descriptions still matters. Make sure to: Create an enticing title that grabs viewers’ attention. Also, avoid using clickbait phrases or titles that mislead users. Keep your title under 50 characters to make sure it properly fits on mobile screens. Add your primary keyword to the title and put it closer to the beginning. Also, incorporate your secondary keywords into the video description. Use natural conversational language in the video description. Start with the most important information that viewers can see immediately, but don’t miss the chance to include all the details and extra keywords in the part of the description hidden under the “Show more” button. Add up to 15 hashtags to your video description to help users find you when looking for distinct information. Optimize thumbnails for better CTR Most people these days watch YouTube on mobile devices, and the fastest-growing portion of YouTube traffic comes from connected TVs. The two devices have one thing in common: users browsing through them only see a title and thumbnail, with no access to video descriptions. The thumbnail takes up a great deal of space, making it a powerful tool for capturing viewers’ attention. Whether they click or pass often hinges on the story conveyed by the thumbnail. Here’s how to secure clicks: Upload a custom thumbnail instead of opting for whatever YouTube offers. Add text to your thumbnail. This is your chance to delineate what the video is about. Incorporate a human element into your thumbnail (both a picture of you and an image of a human hand will do). Use photography best practices. Follow the rule of thirds to draw users’ attention to the thumbnail’s most important elements. Follow the resolution and aspect ratio. Always use 1280 x 720 pixels images with a 16:9 aspect ratio. Provide users with quality subtitles Since YouTube automatically generates subtitles, most content creators don’t bother to add built-in subtitles to their videos. After all, creating and adding them takes time. Unfortunately, YouTube’s voice recognition algorithms aren’t perfect. Depending on the sound quality, speaker accent, and speech pace, automatically generated subtitles can vary in quality from excellent to poor. The choice is yours. To fully benefit from subtitles, consider using dedicated software or creating subtitles manually. Here’s what you can gain as a reward: Videos with quality subtitles have a chance to make it to video-featured snippets placed at the top of search results, taking up the whole first screen. Google chooses videos that contain fast answers to users’ queries. The video conveniently highlights the part with the answer, so when you hit play, the video starts right where you need it. A short transcription of the answer is also included in the video snippet. Subtitles, ideally containing a keyword, make it easier for Google to understand the video’s content and highlight a relevant video snippet. If you create videos for social media, adding captions helps with attracting users’ attention. People generally scroll their feed on mute, so creating videos with no captions puts you at a major disadvantage. Subtitles can ensure users continue to digest and understand your content. Plus, videos with captions typically yield better engagement outcomes compared to those without. Research suggests that up to 80% of viewers are more likely to watch a subtitled video to completion, with half of them expressing a preference for captions. Make viewers stick around Have you ever hit the play button intending to watch a short video only to realize several hours later that you’ve been binge-watching YouTube? If so, you are YouTube’s perfect customer. The service strives to keep users glued to its content. The average time spent on YouTube per day is 48.7 minutes. If that isn’t impressive enough already, it’s worth noting that YouTube ranks among the top three platforms for daily usage, coming in third after Netflix and TikTok. YouTube considers and leverages multiple factors to keep users on its platform. Getting users to watch your video and award it with their likes is important, but so is increasing how often your video is shown to users, even if they choose not to watch it. Another important factor to consider is when users click the video but leave within a short time. Here are some tips for conducting SEO for videos on YouTube in a way that caters to the search engine’s algorithms: Use the first 5 to 10 seconds of the video to make viewers stay. Hook them by summarizing your video’s key moments, whether they take the form of important insights or funny hijinks. Add timestamps to help users navigate directly to the parts of your video they’re interested in. If your video makes it to YouTube, timestamps will help Google highlight the video’s key moments. Top videos’ key moments are visible immediately, while others have them hidden under the Key Moments bar. Encourage users to interact with your video. Ask them to give it a like and leave comments. Also, remind viewers to subscribe and hit the bell button to get notified about any new content you upload to your channel. Add links to other related videos on your channel and encourage people to watch them. If users start binge-watching videos on your channel, this will send extremely positive ranking signals to YouTube. Create playlists of related videos. They make it even easier to keep users engaged. Develop a content calendar and upload new videos on specific days. This helps your most loyal viewers know when to expect new content and how to fit new videos into their daily plans. While adapting to YouTube’s constantly changing algorithms is no easy task, you absolutely must keep up with the tech part. Learning how to use these new features can help you leapfrog the competition. But what truly counts is the quality of the videos themselves, a best practice that hasn’t changed since the very first silent videos. Make sure your videos are worth watching. Thankfully, one aspect of dominating the SERP with top-notch videos is easy: finding the right topics to target. SE Ranking’s Competitive Research makes this task a breeze, while also providing plenty of other SEO and marketing tasks, including: Analyzing any website from head to toe Finding the right guest posting prospects Expanding your target keyword list Keeping tabs on your competitors SERP Features Video 8126 views Written by Yulia Deda Yulia Deda is a content marketer at SE Ranking. She is passionate about all things SEO, with a particular focus on analytics & reporting, technical SEO, and keyword research. In her spare moments, Yulia enjoys watching documentaries or immersing herself in a captivating book.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO for Videos to Shine in Google SERP and Boost Your Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Does video help SEO?"
    },
    {
      "level": "H2",
      "text": "Find topics to cover in your video"
    },
    {
      "level": "H3",
      "text": "Create videos for the keywords you already rank for"
    },
    {
      "level": "H3",
      "text": "Find brand-new topics for your videos"
    },
    {
      "level": "H2",
      "text": "Make your videos stand out on Google"
    },
    {
      "level": "H3",
      "text": "How to conduct SEO for website-hosted videos"
    },
    {
      "level": "H4",
      "text": "Help Google find your videos"
    },
    {
      "level": "H4",
      "text": "Make your videos indexable"
    },
    {
      "level": "H4",
      "text": "Allow Google to fetch your video content files"
    },
    {
      "level": "H4",
      "text": "Enable specific video features"
    },
    {
      "level": "H4",
      "text": "Remove, restrict, or update your videos as needed"
    },
    {
      "level": "H3",
      "text": "How to SEO YouTube videos"
    },
    {
      "level": "H4",
      "text": "Create powerful titles and descriptions"
    },
    {
      "level": "H4",
      "text": "Optimize thumbnails for better CTR"
    },
    {
      "level": "H4",
      "text": "Provide users with quality subtitles"
    },
    {
      "level": "H3",
      "text": "Make viewers stick around"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yulia Deda"
}