{
  "url": "https://seranking.com/blog/seo-news-march-2024-core-update-spam-policies/",
  "slug": "seo-news-march-2024-core-update-spam-policies",
  "title": "Google Rolls Out March 2024 Core and Spam Updates: What's in Store?",
  "description": "On March 5th, 2024, Google announced its core update and new spam policies to deter content designed to attract clicks. Find out more details in this post.",
  "content": "Blog / SEO Industry News / Google’s March 2024 Core Update and New Spam Policies: Penalties Already in ActionGoogle’s March 2024 Core Update and New Spam Policies: Penalties Already in Action Written by Daria Chetvertak Reviewed by Olena Karpova Mar 07, 2024 3 min read On March 5th, Google announced a core update to its search algorithms and spam policies. It aims to greatly reduce the appearance of content created solely to attract clicks and display more content that people find useful. Here’s everything you need to know. Google’s March 2024 core update At the end of February, SEO specialists started noticing massive volatility and fluctuations in Google search results. These were much more substantial than Google’s routine algorithm improvements. Some SEOs observed pages disappearing from the index, while others experienced sudden drops in traffic. Many speculated that these were early signs of a possible Google search ranking algorithm update—and they were right. Now Google has officially rolled out its March 2024 core update. What are this core update’s key points? It will affect unhelpful pages with poor UX, as well as pages that prioritize search engine bots over human users. It will also deprioritize pages designed specifically to rank for ultra distinct search queries. It marks an evolution in how Google identifies content helpfulness. Google no longer uses one signal or system to do this. Use this Creating People-First Content page to get more details about this update. In short, this new update underscores the importance of creating content that genuinely helps and informs users, rather than being solely focused on acquiring clicks. Google predicts that this update combined with its previous efforts will reduce low-quality, unoriginal content in search results by 40%. “We believe these updates will reduce the amount of low-quality content in Search and send more traffic to helpful and high-quality sites. Based on our evaluations, we expect that the combination of this update and our previous efforts will collectively reduce low-quality, unoriginal content in search results by 40%.” This core update is more complex than usual core updates, involving changes to multiple core systems. This means there are likely to be more fluctuations in rankings than with a regular core update, and the rollout may take up to a month. You can monitor the Google Search Status Dashboard to find out when the update has been completed. Google’s March 2024 spam update Along with the core update, Google is also launching a spam update based on its newly added spam policies. From now on, Google will issue penalties for abusing expired domains, content scaling, and site reputation: Expired domain abuse: This is when you purchase expired domains to host low-quality content while using the domain’s past reputation. For example, this could look like purchasing a domain previously used by a medical site to publish low-quality casino-related content. Another example would be publishing affiliate content on a site that was previously used by a government agency. Scaled content abuse: This is when site owners manipulate search results by generating (with or without AI tools) large amounts of unoriginal content that provides no value to users. Some examples of this include using generative AI tools or scraping search results to create numerous pages devoid of any value for users, or generating unhelpful content made solely to rank for target keywords. Site reputation abuse: This is when third-party pages are published without the publisher’s knowing. It’s sole purpose is to manipulate rankings. These third-party pages include advertising, sponsored, partner, or other third-party pages that have nothing to do with the host website’s main topic. For instance, a medical website may write about the best casinos, or a news website might publish coupons from third-party websites. Google has already started completely removing both AI-generated sites and those with bad user experience, aggressive ads, copied content, and other similar issues. Glenn Gabe has even mentioned that these sites have since been hit with manual penalties. Although we're waiting for the March 2024 core update to land (soon), it looks like Google has not waited on the manual action front based on the spam policy updates it announced yesterday. I've already had multiple people ping me about sites being completely deindexed. And those… pic.twitter.com/VBZMaSwSww— Glenn Gabe (@glenngabe) March 6, 2024 It may take up to two weeks for Google to finish its rollout of spam updates. However, websites that engage in reputation abuse won’t face penalties until May 5th, giving you ample time to improve your content. This could also be a hint toward another spam update rolling out in May. So, stay tuned 😉 SEO News 659 views Written by Daria Chetvertak Daria is a content marketer at SE Ranking. Her interests span across SEO and digital marketing. She likes to describe complicated things in plain words. In her free time, Daria enjoys traveling around the world, studying the art of photography, and visiting art galleries.",
  "headers": [
    {
      "level": "H1",
      "text": "Google’s March 2024 Core Update and New Spam Policies: Penalties Already in Action"
    },
    {
      "level": "H2",
      "text": "Google’s March 2024 core update"
    },
    {
      "level": "H2",
      "text": "Google’s March 2024 spam update"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Daria Chetvertak"
}