{
  "url": "https://seranking.com/blog/seo-metrics-and-kpis/",
  "slug": "seo-metrics-and-kpis",
  "title": "Top SEO Metrics: What Must Be Tracked and Why",
  "description": "Why is tracking customer-oriented metrics important in SEO? Find out how to measure SEO performance, what should be tracked and why.",
  "content": "Blog / Analytics & Reporting / Top SEO Metrics to Track and How to Do It RightTop SEO Metrics to Track and How to Do It Right Written by Julia Torchynska Reviewed by Valerii Khomenko Feb 29, 2024 27 min read In SEO, understanding and keeping track of the most relevant metrics can make the difference between having a site that gets lost in the vast digital world and having a site that reaches the top of the SERPs. It’s not just about collecting data, but about collecting the right data. Tracking the SEO metrics that align with your business goals gives you practical insights for improving your website’s performance in search. In this article, we’re going to find out which SEO metrics are the most crucial for assisting SEO (and website promotion) experts in boosting their sites’ search engine rankings. As we go over this topic, we’ll not only highlight key SEO metrics, but also demonstrate how a powerful SEO platform like SE Ranking can assist you in monitoring and leveraging them for optimal results. Let’s take a deep dive into these SEO metrics and discover which ones matter most in the grand scheme of online visibility and digital success. Understanding Traffic Types and Their Importance When we talk about traffic in SEO, we’re actually talking about the very lifeblood of website success. Website traffic is the stream of visitors who navigate to your website. Without any visitors, your website is as good as dead. However, not all traffic is created equal. Let’s take a closer look at two specific types of traffic that are incredibly important for your website’s growth: organic and referral traffic. A key component of fine-tuning your SEO strategy to attract the right audience is being on good terms with these two distinct traffic types. Organic Traffic: The Powerhouse of Web Visits Organic traffic refers to all visitors who land on your website after running a search and clicking on a non-ad search result. This kind of traffic comes directly from search engines like Google and Bing. But tracking all of your site’s organic traffic alone won’t provide you with enough actionable insights. You’ll be able to forecast its dynamics better by monitoring the flow of traffic to individual pages. It’s also necessary sometimes to focus on traffic that originates from certain countries or that is made up exclusively of new users. When analyzing this traffic for reporting through dedicated tools like Google Analytics, HubSpot and Metrics Watch, it’s important to consider your business objectives. Analyzing rankings-based traffic helps you figure out which pages and keywords you need to focus on. For example, sometimes pages that are not ranking at the top of search for high-volume keywords get a lot of traffic from low-volume search queries. These pages are often left unnoticed and untracked. It’s also important to know your traffic’s conversion quality. Traffic, alongside keyword rankings, is a good indicator of possible website issues. If your traffic rate drops, you can find the source of the problem and quickly resolve the issue. In today’s mobile-first world, understanding the clear distinction between desktop and mobile traffic is foundational to SEO success. Depending on your niche, your mobile traffic can surpass your desktop traffic by a wide margin. One pro tip is that if you’re getting more traffic from mobile devices than from desktops, a mobile-optimized SEO strategy is in order. If you’re still on the fence about mobile optimization, consider mobile search statistics. According to Statista, the share of mobile traffic has been consistently growing since Q1 2015 until now, from 31% to almost 59%. At this point, optimizing for mobile search is a necessity. It is no longer an option. To keep track of organic traffic from search engines, you can use tools like Google Analytics, Google Search Console, or SE Ranking. Let’s explore them all. For starters, Google offers a pre-made organic search traffic report that includes landing page data as well as accompanying Google Search Console and Google Analytics metrics, specifically for the connected Search Console property. It also lets you explore data on countries and across different dimensions. And since this is a combined report, you can also find this data in the Search Console. Another key metric to consider in terms of organic traffic is Google Search Console’s Impressions metric. It can be accessed from the Performance report. The Impressions metric helps you understand how often the site appears in search results. The rationale is straightforward: the more impressions a site gets, the higher its chances of obtaining organic traffic. With SE Ranking, you can access data on organic traffic and impressions from Google Analytics and Google Search Console within a single interface. This eliminates the need to switch between browser tabs. Once you connect your Google accounts to SE Ranking, you use the Analytics & Traffic tool to access data on organic traffic. Referral Traffic: The Significance of External Links Referral traffic refers to the segment of visitors that comes to your site by clicking on direct links on other websites rather than through search engines. The volume of referral traffic a site gets reveals how widely its content or offerings are being referenced or linked to online. The bottom line is that tracking referral traffic helps you identify the most valuable external sources and pages within your site for driving visitors. Tools like Google Analytics and SE Ranking’s Competitive Research become indispensable for this. They allow you to track where your referral traffic is coming from and identify the most beneficial partnerships and content for your site. The GA4 report above displays a general overview of your referral traffic metrics. This includes the number of people who visited your site as well as their user session lengths. To get more detailed data and to find out where the referral traffic is coming from, enter “referral” into the search bar. Then, click on the Blue plus icon and choose Traffic Source, which is followed by Session source, in the dropdown menu: This will pull up the relevant referral traffic information into your GA4 report so you can analyze the data further. In SE Ranking, you can view data on referral traffic under Traffic sources in the Analytics & Traffic module: Remember that you can always enter your website (or a competitor’s website) into SE Ranking’s Competitive Research tool to gain insights into its organic and paid traffic performance. By analyzing the available metrics, you can fine-tune your SEO strategy to target the right audience and get better engagement and conversion rates. Each traffic type offers unique insights and opportunities. Understanding and optimizing for both organic and referral traffic sets your website up for digital success. Keyword Positions: Navigating the Search Ranking Landscape Monitoring keyword ranking positions helps you see the ranking performance of your site’s pages in search for specific search queries. They also reveal your position in relation to your digital rivals. Afterall, your site does not exist in a vacuum. But it’s not just about getting that coveted top spot on Google. It’s also about having a clear vision of the position you want, knowing where your competitors are, and the ranking dynamics of everyone involved. Tracking the ranking positions of your keywords ultimately gives you an accurate appraisal of your SEO efforts. Ideally, you want to track as many relevant keywords to your business as possible, but if you must choose from a smaller pool, keep your eyes on the following keyword categories: Product keywords. Monitoring their rankings helps you see how well your offerings are ranking in search, and what your chances are of getting target traffic (people who are highly interested in your products or services). You can also keep separate track of high search volume keywords. They have high potential to drive traffic to your site, but they are usually harder to compete with and rank for. Branded keywords. Find out if your brand keywords (and therefore your brand) are popular in search. As a rule of thumb, companies have the top ranking positions for their brand queries, but it’s still worth monitoring them. Be sure to focus on the search volume (shows brand popularity) and the diversity of your branded keywords. We encourage you to use our rank tracking tool to keep track of your website’s keyword ranking positions. It’s also good practice to check up on your site’s positions manually via Google Search. SE Ranking’s Keyword Rank Tracker enables you to accurately monitor both desktop and mobile search results in your target locations. Just specify the search engine(s) you want to track your target keywords in. Check back in regularly to see their change in ranking dynamics over time. If you see that a keyword is quickly losing rankings, you can investigate the issue further to discover the cause of the drop, be it an update, a competitor improvement, or something on your end. Backlinks: The Backbone of Your SEO Strategy Backlinks, also known as incoming or inbound links, occur when a page from one website links to another. For example, your website gets a backlink when someone links to it. On the other hand, when you link to a website other than your own, that site gets a backlink from you. Backlinks are the most important off-page SEO metric that you can track. They play a crucial role in determining the authority and credibility of your site. Backlinks also directly affect your website’s ranking positions in search. The more high-quality backlinks you have, the better your chances of climbing the ranks. It is important to keep track of the backlinks (and donors) present in your backlink profile. This includes both their quantity and quality. Getting high-quality links from reputable and relevant websites can significantly boost your site’s search engine rankings. On the flip side, links from spammy or irrelevant sites can harm your SEO efforts. When assessing backlink quality, consider factors like the authority of the linking domain, the relevance of the content on the linking page to your website, and how natural their backlink profile is overall. A diverse link profile with backlinks from various authoritative domains is more beneficial than numerous links from a single domain. Another aspect to keep tabs on is backlink spamminess. As a rule of thumb, links from spammy or low-quality sites are detrimental to a site’s SEO health. Regularly auditing your backlink profile can help you identify and disavow harmful backlinks. Consider using tools like SE Ranking’s Backlink Checker and Backlink Monitor to protect your site from potential search engine penalties. To get the complete list of a domain’s backlinks, enter its URL into the search box in SE Ranking’s Backlink Checker tool and click on it to get the full report: Now you can click on different sections within the report, such as Referring Domains and Backlinks, to get detailed information on the analyzed website’s backlink profile. Once you finish analyzing the report, add all important backlinks to the Backlink Monitor tool. It will inform you whether the backlinks that you worked so hard to earn are working properly. The most important metrics to look at here include backlink quantity, quality, and their increase rate. If you are doing your content and technical page setup correctly, you should see a steady growth of organically built backlinks. Plus, keep in mind that you can add any backlinks to a Disavow file and submit them to Google. This instructs the search giant not to consider these links when assessing your or your client’s site. Anchor Text: The Art of Link Optimization Anchor texts are clickable, visible words or phrases that appear in hyperlinks on web pages. In SEO, anchor texts are strategic tools that can have a positive impact on your site’s search engine rankings. But you must optimize them thoughtfully if you want to avoid getting penalized by search engines for over-optimization or irrelevant linking. The process of properly optimizing anchor texts is a delicate one. The text should be relevant to the page it’s linking to, while also providing users and search engines with context about the actual content of the link. Note that overusing exact-match keywords in your anchor texts can appear manipulative to search engines. This can ultimately lead to penalties. Your SEO depends on a naturally diverse anchor text profile. A natural-looking profile includes a mix of exact match, partial match, branded, and generic anchor texts. This signals to search engines that your links have grown organically. You can use tools like SE Ranking’s Backlink Checker to analyze your website’s anchor text profile. Here are some key metrics to consider when analyzing your anchor text profile: Ratio of anchors with and without text. A healthy link profile has a balanced mix of anchored and unanchored (plain or no text URL) links. This mix helps in getting search engines to view your profile as natural and not over-optimized. Overuse of identical anchor texts. Repeatedly using the same anchor text (aka keyword stuffing) can cause your site to get flagged as spam. It’s also important to diversify anchor texts across your backlinks. Presence of irrelevant anchor texts. Anchors that have no relevance to the content they link to can negatively affect your site’s credibility. Go the extra mile to ensure that anchor texts used in your backlink profile are contextually relevant to your page content. Analyzing these metrics provides you with insights into the overall effectiveness of your anchor text strategy. It can show areas to improve, like diversifying anchor texts or replacing irrelevant ones. Content Quality: The King of SEO Success In SEO, content quality still reigns supreme. Quality content is the cornerstone of a successful SEO strategy. It’s not just about stringing words together, but about crafting valuable, engaging, and relevant information that resonates with your audience and satisfies search engine algorithms. Including keywords in your content is critical, but doing it right is a balancing act. Keywords help search engines understand what your content is about and how it should be indexed, but keyword stuffing – the overuse of keywords – can lower your content’s readability. This is a manipulative practice that can lead to penalties from search engines. The key is to include keywords naturally and contextually. This enhances rather than detracts from your content’s value. SE Ranking’s Content Editor (part of the Content Marketing Tool) is an invaluable resource in assessing and enhancing your content’s quality. Other than generating texts using the latest in AI technologies, you can use this tool to analyze major content metrics like: Content volume and quality. The length of your content matters, but so does its quality. Your content should be detailed enough to cover the topic thoroughly but also concise enough to maintain reader engagement. Content uniqueness. Original content is a must in the SEO world. Unique content not only helps you stand out, but it also protects you against duplicate content, which can negatively impact your search engine rankings. Keyword presence. Identifying whether your content contains the right keywords (and whether they are used optimally) is key. This tool can help you achieve this by analyzing keyword density, placement, and relevance to the topic. Overall content optimization. This tool examines elements other than keywords, including readability, tone, and structure. This integrated approach keeps your content both SEO-friendly and user-friendly. Quality content is about creating value for your audience. It should answer their questions, solve their problems, and offer insights or information that they couldn’t easily find elsewhere. By using tools like SE Ranking’s Content Editor to audit your content, you can ensure your content ticks each of these boxes. This will transform it not only into a magnet for search engines but also into a resource that your audience trusts and values. Creating unique, keyword-optimized, and reader-friendly content significantly enhances your website’s relevance, authority, and its overall performance in search engine rankings. Keyword Volume and Difficulty: Balancing Potential and Feasibility Understanding keyword volume and difficulty is crucial for crafting a winning SEO strategy. These metrics not only influence your keyword choices, but also the overall direction of your SEO efforts. Keyword search volume refers to the number of searches a particular keyword receives within a given timeframe. This is a vital metric because it gives you a rough idea of how much traffic you can attract to your site. A higher search volume indicates a larger audience, but chasing the most popular keywords will only take you so far. When selecting the best keywords for you, it’s best to strike a balance between their search volume and relevance to your niche or business. Keyword difficulty, on the other hand, measures how challenging it would be to rank for a particular keyword. This metric looks at how strong the competition currently ranking for that keyword is. Keywords with a high difficulty score will be more challenging to achieve top rankings for. Newer or smaller websites will have an especially difficult time ranking for them. Leveraging SE Ranking’s Keyword Research tool SE Ranking’s Keyword Research tool is an invaluable asset to this analysis. It helps you identify keywords that are relevant to your promotion strategy and assesses both their volume and difficulty. This combined dual analysis allows you to choose keywords that are not only popular but also attainable (based on your website’s current SEO strength). Balancing keyword volume and difficulty is a critical aspect of SEO. It involves gauging a keyword’s traffic potential and the effort that will be required to rank for it. By carefully selecting keywords whose difficulty scores strike a balance between these two metrics, you can develop an SEO strategy that is more effective and more achievable. This will lead to better visibility, traffic, and an overall stronger online presence. Website Technical Errors: The Silent SEO Disruptors Technical errors on a website are like cracks in a building’s foundation. While they may not be immediately visible, they can cause significant issues in the long run, especially in terms of SEO rankings and visibility. You must monitor and address such issues promptly to maintain and improve your site’s search engine performance. As outlined in our detailed article on SEO issues, technical errors can range from broken links and slow load times to poor mobile optimization. Each of these issues can negatively impact user experience and, by extension, your site’s rankings in search. Leveraging SE Ranking’s Website Audit SE Ranking’s Website Audit tool is an indispensable SEO tool for managing technical components like these. It can be used to identify the full range of technical issues that could be hindering your website’s SEO performance. It also provides fix suggestions. The tool examines over 120 metrics, including: Page Load Speed: Essential for both user experience and search engine rankings. Mobile Usability: This is critical for reaching a wider audience due to the prevalence of mobile browsing. HTTP status codes: Be aware of when browsers attempt to contact your website. Broken Links: Keeping links functional enhances user experience and site credibility. Regularly auditing your site helps you to stay on top of these technical issues and address them before they grow into bigger problems. Page Speed and Core Web Vitals: The Speedometers of Website Performance In the high-speed world of the internet, page speed is not just a convenience but a necessity. It’s a critical factor for user experience and SEO. Google’s Core Web Vitals offer a specific set of factors that Google considers as ‘vital’ to a webpage’s overall user experience. These vitals are essential in understanding and improving your website’s performance in terms of its loading, interactivity, and visual stability. Core Web Vitals consist of three specific metrics: Largest Contentful Paint (LCP), First Input Delay (FID), and Cumulative Layout Shift (CLS). Largest Contentful Paint (LCP): This measures how long it takes for the largest content element on your page to load. A fast LCP (2.5 seconds or faster) suggests that the page is useful. First Input Delay (FID): FID measures the time between when a user first interacts with your site and when the browser can respond to that interaction. A low FID is essential for a good user experience; aim for less than 100 milliseconds. In march 2024, Google will replace FID with a new metric known as Interaction to Next Paint (INP). This new metric measures the responsiveness and interactivity of a page by tracking the time between when a user interacts with a page to when they see a response. Cumulative Layout Shift (CLS): This metric measures the visual stability of your website. It prevents pages from shifting around as they load, which can be frustrating and confusing for users. The goal is to have a CLS score of less than 0.1. Leveraging Tools for Page Speed Optimization To analyze and optimize these critical metrics, tools like Google’s PageSpeed Insights and SE Ranking’s Website Audit are invaluable. They provide a comprehensive overview of your website’s performance and offer actionable insights to improve these scores. PageSpeed Insights: It provides detailed information on your page performance and offers suggestions for improving your LCP, FID, and CLS scores. SE Ranking’s Website Audit: This tool gives a broader view of your site’s overall health, including its page speed and Core Web Vitals. This helps you identify and address issues that could be affecting your site’s performance. Page Indexing: Ensuring Visibility in Search Page indexing is a fundamental aspect of SEO. It’s a lot like placing a book in the library for readers to find. It’s a process where the end goal is to get your web pages included in search engine indexes. Proper index management is crucial for efficient SEO because it directly impacts your site’s search visibility. Here’s what you should focus on when analyzing page indexation: Indexing of optimized pages: First and foremost, ensure that all the pages you’ve optimized for SEO are indeed indexed by search engines. These pages are carefully crafted and optimized with keywords to draw in traffic. If they’re not indexed, they’re invisible to search engine users, which can negate all of your optimization efforts. Unintentional indexing of pages: There may also be pages that you do not want to be indexed, such as 404 error pages or pages with sensitive information. Indexing these pages can negatively affect your site’s credibility and user experience. Indexation of blocked pages: Another critical aspect involves ensuring that the pages you’ve intentionally blocked from being indexed (using robots.txt or noindex tags) are indeed not appearing in search results. This is important for managing the narrative of your site and directing users and search engine crawlers to the right content. Leveraging Google Search Console and SE Ranking’s Index Status Checker To effectively monitor and manage your site’s indexation, tools like Google Search Console and SE Ranking’s Index Status Checker are indispensable: Google Search Console: This tool shows you which of your pages are indexed and identifies any issues preventing indexation. It’s also useful for submitting sitemaps and individual pages for indexing. SE Ranking’s Index Status Checker: This tool offers a quick and efficient way to check the indexation status of a site’s pages. It’s especially handy for large sites, where manually checking each page would be impractical. Page indexing is the strategic management of what gets indexed in order to establish optimal SEO performance. Regularly monitoring and adjusting your site’s indexation can lead to improved visibility, better user experience, and higher search rankings. It’s not just about getting indexed, it’s about controlling what gets indexed. Internal Links: Mastering the Art of Intra-site Connectivity Internal linking, an often underutilized aspect of SEO, is similar to creating a roadmap for your website. It involves strategically linking your web pages to one another, which helps in distributing ‘link equity’ or ‘link juice’ across your site and improving user navigation. Proper internal linking is vital for directing both users and search engine crawlers to your most important pages. The internal linking process should be deliberate and strategic. The goal of internal linking is to distribute page authority appropriately and ensure that your priority pages receive the most visibility and value. Here are some key aspects of internal linking to consider: Click Depth: This refers to how many clicks it takes to reach a particular page from the homepage. Priority pages should be easily accessible, ideally within a few clicks from the homepage. This ensures these pages receive more attention from both users and search engine crawlers. Avoid Orphaned Pages: Orphaned pages don’t have any internal links pointing to them. Since these pages are hard for both users and search engines to find, they can negatively impact a site’s overall performance and ranking. Balance Link Weight Distribution: It’s important to ensure that internal links are distributed so as to reflect each page’s importance. More important pages should have more internal links pointing to them. Leveraging SE Ranking’s Website Audit and Screaming Frog SEO Spider For a thorough analysis and optimization of your internal linking structure, tools like Screaming Frog SEO Spider and SE Ranking’s Website Audit are perfect: Screaming Frog SEO Spider: This tool offers a detailed view of your site’s link structure. You can analyze click depth and ensure important pages are adequately linked. SE Ranking’s Website Audit: This tool helps you identify any issues with internal linking, such as orphaned pages or pages with low link equity. Just click on any number in the screenshot below to access the full report. Regular audits and adjustments to your internal link structure are essential for maintaining an optimal flow of link equity throughout your site. Behavioral Factors: Deciphering User Engagement and Experience Behavioral factors are critical indicators of how users interact with your website. They provide insights into user engagement and satisfaction while influencing both your website’s usability and SEO performance. Note that if you are working with an ecommerce company, you should track e-commerce specific metrics as well. By analyzing metrics like average session duration, bounce rate, and pages per session, you can gauge how effective your content and website design is in meeting user needs and preferences. Here are some key behavioral metrics to consider: Average Session Duration: This metric indicates the average amount of time users spend on your site during a session. Longer session durations usually suggest that users find your content engaging and relevant. Bounce Rate: This metric shows how many user sessions on your site lacked meaningful engagement. The bounce rate is the opposite of the engagement rate. It measures the percentage of sessions that last longer than 10 seconds, had any type of conversion event, or got at least 2 pageviews. Pages per Session: This metric shows the average number of pages viewed during a session. More pages per session indicates higher user engagement and overall interest in what your site has to offer. Leveraging Google Analytics for Behavioral Analysis Google Analytics is an indispensable tool for monitoring these behavioral factors. It allows you to track and analyze user interactions on your website, providing data to optimize user experience and SEO. To find behavioral metrics in Google Analytics 4 (GA4), you can use the Funnel Exploration and Path Exploration reports available in the “Explore” section of the GA4 interface. These reports are alternatives to the Behavior Flow report in Universal Analytics. They offer more flexibility and detailed insights into user journeys on your site. The Funnel Exploration report allows you to track a predefined user path, while the Path Exploration report provides a free-form approach to tracking user paths without predefined steps. These reports help analyze user engagement and behavior on your website. By regularly monitoring and analyzing these metrics, you can gain valuable insights into how users interact with your site. This helps you make data-driven decisions that result in enhanced user experience, improved content relevance, and an overall higher SEO effectiveness for your site. Remember, a website that caters well to its users’ needs is more likely to perform well in search. Wrapping Up By focusing on the metrics we covered in this article, you can boost your website’s SEO performance. Each metric offers unique insights and opportunities for growth. Remember, the key to successful SEO lies in a balanced approach. You must continuously monitor, analyze, and optimize various aspects of your site using tools like SE Ranking and Google. This broad approach ensures that your website not only ranks well in search engine results but also delivers a valuable and satisfying experience to your users. It will pave the way to sustained digital success. I’d love to know your thoughts on SEO metrics. Which ones do you track and why? SEO Analytics SEO Metrics 11290 views Written by Julia Torchynska Julia is a content marketer with 10 years of experience in journalism, copywriting, advertising, and PR. She shares her knowledge and experience by creating helpful articles on SEO and digital marketing for SE Ranking blog and popular media. When Julia is not writing articles, she learns new asanas, travels, and as a volunteer helps YWCA with empowering women.",
  "headers": [
    {
      "level": "H1",
      "text": "Top SEO Metrics to Track and How to Do It Right"
    },
    {
      "level": "H2",
      "text": "Understanding Traffic Types and Their Importance"
    },
    {
      "level": "H3",
      "text": "Organic Traffic: The Powerhouse of Web Visits"
    },
    {
      "level": "H3",
      "text": "Referral Traffic: The Significance of External Links"
    },
    {
      "level": "H2",
      "text": "Keyword Positions: Navigating the Search Ranking Landscape"
    },
    {
      "level": "H2",
      "text": "Backlinks: The Backbone of Your SEO Strategy"
    },
    {
      "level": "H2",
      "text": "Anchor Text: The Art of Link Optimization"
    },
    {
      "level": "H2",
      "text": "Content Quality: The King of SEO Success"
    },
    {
      "level": "H2",
      "text": "Keyword Volume and Difficulty: Balancing Potential and Feasibility"
    },
    {
      "level": "H3",
      "text": "Leveraging SE Ranking’s Keyword Research tool"
    },
    {
      "level": "H2",
      "text": "Website Technical Errors: The Silent SEO Disruptors"
    },
    {
      "level": "H3",
      "text": "Leveraging SE Ranking’s Website Audit"
    },
    {
      "level": "H2",
      "text": "Page Speed and Core Web Vitals: The Speedometers of Website Performance"
    },
    {
      "level": "H2",
      "text": "Leveraging Tools for Page Speed Optimization"
    },
    {
      "level": "H2",
      "text": "Page Indexing: Ensuring Visibility in Search"
    },
    {
      "level": "H3",
      "text": "Leveraging Google Search Console and SE Ranking’s Index Status Checker"
    },
    {
      "level": "H2",
      "text": "Internal Links: Mastering the Art of Intra-site Connectivity"
    },
    {
      "level": "H3",
      "text": "Leveraging SE Ranking’s Website Audit and Screaming Frog SEO Spider"
    },
    {
      "level": "H2",
      "text": "Behavioral Factors: Deciphering User Engagement and Experience"
    },
    {
      "level": "H3",
      "text": "Leveraging Google Analytics for Behavioral Analysis"
    },
    {
      "level": "H2",
      "text": "Wrapping Up"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Julia Torchynska"
}