{
  "url": "https://seranking.com/blog/seo-news-december-2023/",
  "slug": "seo-news-december-2023",
  "title": "SEO News: Key Takeaways from December 2023",
  "description": "Get the inside scoop on what happened in SEO in December 2023. We’ve compiled all of the most important news and useful links for you in this article.",
  "content": "Blog / SEO Industry News / December 2023 SEO News: Changes You Can’t MissDecember 2023 SEO News: Changes You Can’t Miss Written by Yevheniia Khromova Reviewed by Olena Karpova Jan 05, 2024 12 min read Delivering the best possible results for your clients goes well beyond following the basic accepted SEO practices. To hold onto your expertise, you also need to keep up with the latest trends and updates happening in the SEO world. That’s why we launched our SEO News series—a brand new edition to the SE Ranking blog. Get ready for the latest SEO insights and updates on topics like Google’s algorithm updates, AI, search interface enhancements, and all major changes from December 2023 onward. All are surely worth your attention. So buckle up! Let’s get right to it! Google algorithm updates Google’s Review Update: A 29-day saga Google finished rolling out its November 2023 Reviews Update on December 7. It took them 29 days, which was even longer than the core algorithm update rollout. Keep in mind that this was the last review update officially announced by Google. Any updates to its algorithm will now happen regularly without notifications. So again, reviews update improvements will continuously run. i.e. No more periodic reviews updates -> \"We expect an update to our reviews system to start rolling out next week. That will also mark a point when we'll no longer be giving periodic notifications of improvements to… pic.twitter.com/v32w4raKYd— Glenn Gabe (@glenngabe) November 2, 2023 We also observed some volatility in search results post-rollout. SE Ranking’s Rank Tracker showed jumps and declines in keyword positions after the update rollout was completed. But this was to be expected. Post-update volatility is common in search results. But nobody could have expected the pre-Christmas and pre-New Year’s Eve volatility. It wouldn’t make sense to connect these jumps directly to the review algorithm update. The SEO community is also discussing the possibility of another major unconfirmed update that could have slid under the radar. If so, let’s hope to get some information from Google on this later. Some believe that these jumps could be related to Google’s work on parasite SEO neutralization. This is possible, as Google did mention that they don’t use the term internally. They also announced that they’d be renaming the term in the future. This suggests that they are working on this internally and may create/update related documentation. They also wrote shortly after that they “have taken steps to deal with the parasite SEO problem,” whatever that means. We don't use that term internally. I expect you will see us assign a term to this type of activity in the near future, along with further guidance, as I touched on here: https://t.co/el6RIMFgxrWe do have some guidance about this type of activity on the page below, where the key… pic.twitter.com/FfT8PFCwqa— Google SearchLiaison (@searchliaison) December 11, 2023 What’s more, Danny Sullivan, the Google Search Liaison, started collecting and documenting examples of poor-quality SERPs. Yes, I already passed that one on to the search team. Here’s a peek. And it’s being looked at. pic.twitter.com/vJH3EisnXD— Google SearchLiaison (@searchliaison) December 19, 2023 This is hardly a coincidence. We’ll keep tabs on what’s happening and share more insights on this in one of our following articles. SGE and AI developments Google’s leap into next-level AI On December 6, Google introduced its new AI model called Gemini. During the presentation, Gemini impressed everybody with its capabilities. It can provide real-time answers, generate web pages, and much more. In short, wow! But, and there’s always a but… It was revealed that the presentation video wasn’t entirely genuine. The results shown during the presentation were derived from complex, detailed prompts, not the simple ones displayed in the video. Despite this, Gemini’s potential is promising, especially for search. It has already been integrated with Bard and will expand into SGE. The experiments have already started, and the results have been impressive. This integration has already greatly enhanced UX. It has even reduced latency by 40% for English searches in the US while also improving the quality of results. Google’s plans for Gemini don’t stop there. The AI model will also be implemented in Search, Google Ads, Chrome, and other Google products. And we expect all of this to happen in the coming months! Search interface enhancements The “Follow This Search” feature: A new way to track topics Announced on Google’s official blog on November 15, the ‘Follow This Search’ feature is making its way into our SERPs. This feature allows you to follow queries of your interest in search results. Here’s how this feature looks now: pic.twitter.com/lTasgZ4xvM— Shameem Adhikarath (@shemiadhikarath) December 20, 2023 So far, the Follow This Search feature has been used in SERPs for major news topics, but we expect it to expand its reach. Image box experiments Google experimented with one of its most significant SERP features, the image pack, in December. They began by testing their full-width image pack with elements like larger images, image descriptions, the site name, and additional filters. Google proceeded to experiment with its new Expandable Image Box feature. Unlike the full-width version, this design necessitates clicking to expand the section and reveal the images. 🆕 After full-width packing for images rolled our, Now google testing images section on serp in expandable feature.↗️ I think Google want to save more space by this feature.@rustybrick pic.twitter.com/WbSlGbGPIf— Khushal Bherwani (@b4k_khushal) December 9, 2023 Why all these changes? Chances are that Google is trying to prevent the search results page from getting too crowded and wants to optimize space. If you have a website that currently appears in these image boxes, you should be on the lookout. The way image packs work and how people will use them may affect your website’s click-through rates. To get your images to rank in these boxes, focus on image SEO. One tool that can help you with this task is SE Ranking’s Website Audit. Once you check your website, it will show you all the image-related issues, the pages containing them, and personalized tips for solving them. Local search updates New Local Pack ranking factor In December, the SEO community noticed that having an opened or closed status affected how businesses appeared in local pack and search on maps. Businesses lost rankings during non-working hours and regained them during working hours. Danny Sullivan recently confirmed these observations. He stated that Google had previously used openness as a part of its ranking system, but it had now become a stronger signal. They even incorporated it into the November 2023 Core Update. The team tells me we've long used \"openness\" as part of our local ranking systems, and it recently became a stronger signal for non-navigational queries. This might change in various ways, as we continue to evaluate the usefulness of it, however.— Google SearchLiaison (@searchliaison) December 15, 2023 It’s safe to assume that this update will stimulate businesses to begin changing their working hours to 24/7 to bypass the algorithm. Even so, Google doesn’t recommend doing this. Eventually, this ranking signal will be updated to prevent businesses from taking advantage of this loophole. Yes, I've passed that feedback on to the team already. I wouldn't recommend businesses do this, given the ranking signal may continue to be adjusted.— Google SearchLiaison (@searchliaison) December 15, 2023 Besides monitoring local ranking signal updates, you should also track your local campaigns effectively. Correct any issues before they influence your local rankings. Our Local Marketing Tool has everything you need to accomplish this. It simplifies your local listing optimization, allows you to monitor your listings and local rankings, manage reviews, and maintain NAP consistency. Updated suspension emails for more personalized communication Google has updated its approach to handling Google Business Profile suspensions. The search giant now sends customized emails to businesses that explain the reason for the suspension and offer steps to reverse it. In Colan Nielsen’s case, Google advised creating a new profile as a service-area business and offered additional personalized assistance. Whoa! Personalized email from GBP support with the reason for suspension and guidance on how to fix it. 🤯😱 pic.twitter.com/OUYbxFyvOf— Colan Nielsen (@ColanNielsen) December 15, 2023 Molly Youngblood noticed suspension emails that gave users the ability to make an appeal request directly from them. New format of email sent for suspended profiles that allow an appeal @rustybrick pic.twitter.com/tbniQ22mcL— Molly Youngblood (@mygeigermeister) December 13, 2023 Local businesses will definitely benefit from this move towards transparency and personalizations. Tidbits December 2023 Google Office Hours After a two-month hiatus, Google Office Hours is back with its December edition. This time around, the Google Search Quality team answered tons of questions. Each inquiry centered around topic issues like choosing the right structure for the site, how Google handles special characters in search results, and why Google indexes pages with noindex and blocked robots.txt. Here are some insights worth considering: Use the noindex and indexifembedded combination in the meta robots tag on the embedded page to ensure the embedded with an iframe content from another page is indexed within your primary page. Use a hierarchical structure if you have a big website. This enables Google to crawl your site more flexibly. The content in the /news/ folder, for example, will be scanned faster and more frequently than the content in the /archives/ folder. To prevent Google from crawling the links you added via scripts, disallow them in robots.txt. If your page content is in a language other than English, you can also use that language in the page URL. Google ignores the <meta name=”prerender-status-code” content=”404″> status code. Having multiple slashes in URLs is acceptable, but they can confuse crawlers. If your images changed URLs, add redirects to the new addresses. For more insights, watch the full video: John Mueller’s New Year SEO support – a tradition since 2007 This December, John Mueller continued his longstanding tradition of offering SEO support during the New Year’s holiday. For over 16 years, he has dedicated his time on both Christmas and New Year to assist site owners, creators, publishers, and SEO professionals with their queries. This year was no different. He responded to several Reddit threads and answered users’ questions on Mastodon, X, and other platforms. You can find some of these threads (and John Mueller’s responses) here. 9 Google patents from 2023 and their significance for SEO Google’s patents have historically given us a sneak peek into everything going on in their tech lab. In fact, 2023 saw nine new patents. To discover where Google is heading next innovation-wise, be sure to check out these patents. Search result filters from resource content This patent encompasses the creation of custom and dynamic search filters based on content related to your query. From an SEO perspective, it’s important to focus on creating content that covers a wide range of relevant topics in a specific field. You’ll also need to use the most relevant and diverse keywords. They are the most likely to influence the creation of search filters and can play a defining role in how Google ranks content. Evaluating an interpretation for a search query This patent goes into detail about Google’s method for assessing the accuracy of human interpretation of search queries. This will make it even more important to align your content with the way users are likely to interpret search queries. When optimizing your copies, you will have to consider the current context and group related keywords or topics together. Providing search results based on a compositional query This patent focuses on delivering search results based on compositional queries. This is one step further toward making Google an entity-based search engine. The system will recognize entity types and their relationships, and assess attribute values to determine the resulting entity references. Given that Google will involve different entities and is moving towards greater complexity when dealing with queries, you should focus on creating easily recognizable content for search engines. Categorizing different entities and making content contextually relevant will also be important. Contextualizing knowledge panels This patent is centered around the incorporation of knowledge panels that provide contextual information related to search queries. It’s another step towards entity-based search and optimization. For a chance to get featured in knowledge graphs, you’ll need to create rich content that includes relevant contextual terms next to your main keywords. It will also become increasingly important to understand user intent, the basics of semantic search, and how search terms are used in different contexts. Systems and methods for using document activity logs to train machine-learned models for determining document relevance This patent outlines the new need to consider things like how users interact with content, the way they engage with documents, and how they access private or cloud-stored files. Query composition system This patent is about simplifying the search query composition process through the use of context clusters. Its status is currently pending, but it may become active in the future. If it does, focusing on content that is relevant to the user’s context (i.e their location or time) will become increasingly important. Understanding the most likely user contexts can help you create content that better matches their intent. Combining parameters of multiple search queries that share a line of inquiry This patent describes how combining several related search queries into one more efficient query accounts for a better overall search experience. Because this patent demonstrates Google’s growing emphasis on linking semantically related queries, you’ll need to pay more attention to semantic relevance and context. Consider using more long-tail keywords and conversational queries and try to optimize your content to match a series of related queries. Presenting search result information This patent outlines a method for increasing the accuracy and relevance of search results by incorporating content from web notebooks. SEOs may need to place more value on user-generated content and should focus on personalization and context dependence. Multi source extraction and scoring of short query answers This patent offers a method for generating and ranking short answers based on multiple sources. It signals a move towards more relevant and context-focused content. This patent also suggests that SEOs should prioritize creating well-rounded content that captures the wider essence of a topic rather than focusing solely on high-ranking keywords. We’ve only lightly covered Google’s new patents and what their implementation means for SEO. For a better understanding, read this article to learn in more detail how each patent works. That’s it for now. Keep an eye on our blog for more relevant and impactful SEO news. See you in our January edition soon! SEO News 12164 views Written by Yevheniia Khromova Yevheniia is a content marketer and copywriter at SE Ranking. She is a fan of SEO, digital marketing, and content creation. Yevheniia believes simplicity is key as it helps reduce the clutter in our heads and focus on what matters. This is the principle she uses in her writing. She also enjoys cooking, learning new spices and flavors, traveling, and playing board games.",
  "headers": [
    {
      "level": "H1",
      "text": "December 2023 SEO News: Changes You Can’t Miss"
    },
    {
      "level": "H2",
      "text": "Google algorithm updates"
    },
    {
      "level": "H3",
      "text": "Google’s Review Update: A 29-day saga"
    },
    {
      "level": "H2",
      "text": "SGE and AI developments"
    },
    {
      "level": "H3",
      "text": "Google’s leap into next-level AI"
    },
    {
      "level": "H2",
      "text": "Search interface enhancements"
    },
    {
      "level": "H3",
      "text": "The “Follow This Search” feature: A new way to track topics"
    },
    {
      "level": "H3",
      "text": "Image box experiments"
    },
    {
      "level": "H2",
      "text": "Local search updates"
    },
    {
      "level": "H3",
      "text": "New Local Pack ranking factor"
    },
    {
      "level": "H3",
      "text": "Updated suspension emails for more personalized communication"
    },
    {
      "level": "H2",
      "text": "Tidbits"
    },
    {
      "level": "H3",
      "text": "December 2023 Google Office Hours"
    },
    {
      "level": "H3",
      "text": "John Mueller’s New Year SEO support – a tradition since 2007"
    },
    {
      "level": "H3",
      "text": "9 Google patents from 2023 and their significance for SEO"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yevheniia Khromova"
}