{
  "url": "https://seranking.com/blog/seo-news-march-2024-spam-update-rollercoaster/",
  "slug": "seo-news-march-2024-spam-update-rollercoaster",
  "title": "March 2024 Spam Update: First Casualties Overview",
  "description": "Find out how the March 2024 spam update has shaken up websites within the first week of the rollout.",
  "content": "Blog / SEO Industry News / Google’s March 2024 Spam Update Rollercoaster: Manual Actions and First ResultsGoogle’s March 2024 Spam Update Rollercoaster: Manual Actions and First Results Written by Yulia Deda Reviewed by Olena Karpova Mar 15, 2024 4 min read The second half of 2023 saw a flurry of Google algorithm updates. Surprisingly but ever since, many SEOs have been discussing how the SERP has decreased in quality due to the rise of spammy results. Marketers have also been making tongue-in-cheek jokes about how Google should release a new update (even though we all know how stressful every major algorithm update can be). Well, it seems like Google took notice and released two major updates since then: March 2024 core and spam updates. However, its early impact has surprised even the most experienced of experts. After the update launch and the announcement of new policies, many website owners started receiving manual penalties from Google, in addition to the automatic detection and penalization of websites. As Google states, manual actions are issued “against a site when a human reviewer at Google has determined that pages on the site are not compliant with Google’s spam policies.” Search Engine Roundtable’s Barry Schwartz collected numerous complaints from website owners on how they were issued with penalties. Here are some tweets that you may find interesting: @glenngabe @lilyraynyc @Marie_Haynes @searchliaison Received a Manual Penalty on one of my oldest websites saying that it is pure SPAM which is totally not the case as we are doing the best possible work in niche since 2016. Would love to get some help. pic.twitter.com/JuEfkc8pqb— Harsh (@seo_harsh) March 6, 2024 My biggest money site was also hit with manual actions! I'm confused and don't know what next to do as anything Google is 50/50 even if you are innocent.— Akinbobola A. (@bobbydoo2003) March 6, 2024 While some sites faced significant ranking drops, others are no longer showing in Google Search at all, even with the site: operator. @searchliaison One of my 9 years old human content websites got a manual penalty & everything was de-indexed overnight– All the content was human-written-I was publishing 20 articles daily about celebrities and the entertainment industry pic.twitter.com/9wjAOddbK5— Learningweb (@seoninja69) March 7, 2024 Google is definitely manually de-indexing mass AI spam sites right now.This one was ranking #1 for \"how old is Taylor Swift's daughter\" She doesn't have a daughter. 🤣 pic.twitter.com/yAvQajSQJ4— Mike Futia (@mikefutia) March 6, 2024 Some sites are even experiencing a so-called “yo-yo deindexing.” They disappear from search results and then reappear only to be deindexed again later: A number of sites that were deindexed during the Google manual actions are back – comments about it at https://t.co/vI7Oc4cC5q pic.twitter.com/OajjsvVT89— Barry Schwartz (@rustybrick) March 11, 2024 gone again as of last night pic.twitter.com/hWPgzpXZlD— Barry Schwartz (@rustybrick) March 12, 2024 To keep track of changes in the SERP environment for your projects’ target keywords after the update, you can use SE Ranking’s SERP Competitors feature in the My Competitors block. You can use it to observe changes in ranking dynamics since the update (e.g., starting from March 5th), as well as determine if you or your competitors have been removed from a particular SERP: Users are currently discussing the reinstatement of deindexed sites, particularly on Black Hat World. Some users from this discussion say that submitting your website for review can help you get sanctions removed. Now, let’s get back to the issues that most website owners have experienced after the release of the March 2024 spam update. Some users, for example, have noticed a pretty unusual pattern related to banning sites in the same GSC. This suggests that if there are several websites linked to the same GSC and one of them gets penalized by Google, the other one often gets sanctioned as well. Fucksake. Two of my sites hit. One absolutely did not deserve it. Pretty obvious they've been rooting through my GSC looking for targets. ☹️I thought that keeping your sites separate was only needed for black hats. Not so. My mistake. pic.twitter.com/yp0XRG7mQH— Niche Site Lady (@NicheSiteLady) March 8, 2024 We’ve also found a pretty interesting insight based on a list of affected sites compiled by Ian Nuttal. The irony is, many website owners that spoke openly about generating content at a huge scale ended up being sanctioned. No surprise that bragging about fooling Google’s algorithms led to some serious countermeasures. No one saw it coming? Are you serious? Here's a little tip… If you talk shit in public about how you are spamming the shit out of Google, you will get torched. That's how it's always been, and always will be.— Greg Boser (@GregBoser) March 7, 2024 And these updates are far from over. Google initially informed us that the core update would take at least one month to roll out, whereas the spam update would require around two weeks. Since it’s been only a week and a half after the release of these updates, there are still probably more changes to come.So, buckle up! We’ll keep you informed about these updates and their impact on SEO in our upcoming news articles! SEO News 253 views Written by Yulia Deda Yulia Deda is a content marketer at SE Ranking. She is passionate about all things SEO, with a particular focus on analytics & reporting, technical SEO, and keyword research. In her spare moments, Yulia enjoys watching documentaries or immersing herself in a captivating book.",
  "headers": [
    {
      "level": "H1",
      "text": "Google’s March 2024 Spam Update Rollercoaster: Manual Actions and First Results"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yulia Deda"
}