{
  "url": "https://seranking.com/blog/seo-checklist/",
  "slug": "seo-checklist",
  "title": "Ultimate 2024 SEO Checklist (for new and existing websites)",
  "description": "Read our ultimate SEO checklist to get best practices for SEO basics, keyword research, technical SEO, content optimization, local, on-page and off-page SEO.",
  "content": "Blog / SEO Strategy / SEO Checklist for New and Existing WebsitesSEO Checklist for New and Existing Websites Written by Daria Chetvertak Reviewed by Olena Karpova Mar 25, 2024 53 min read SEO is a detailed and long-term process with many stages and tasks. To keep your website optimization organized, consult our SEO checklist, which compiles all the SEO best practices that you’ll need to follow to reach the top of search results. Feel free to explore all sections of this article. Each outlines each task in great detail. Alternatively, you can download a copy of this free SEO checklist template. What is an SEO checklist? An SEO checklist is a systematic list of tasks founded on best practices that aim to enhance website quality, help search engines better understand it, and increase website visibility in search results. The checklist typically covers areas like keyword research, content optimization, technical SEO, backlink analysis, and local SEO. How to use this SEO checklist Think of this checklist as your roadmap to optimizing your site from A to Z. Whether you’re building a new website or fine-tuning an existing one, this checklist for SEO will ensure that you are able to cover all the essentials. It will also provide you with additional advice to help you enhance your site for search engines. The tips provided are universal, which means they are suitable for all sites big and small. They can assist commercial or news-oriented sites, as well as those tailored to specific regions or global search preferences. Each step is designed to improve one particular aspect of your website and to support your overall SEO strategy. We’ve assigned each task to a specific category to make navigation easier. Just stick to the advice given for each step, whether you’re following the sequence or focusing on specific aspects that suit your needs. Basic setup To achieve SEO success, you must master the fundamentals. You also need essential data and proper tools. Follow the basic SEO tips below to create a successful SEO strategy. 1. Understand basic SEO concepts Before performing any of the tasks listed below, you need to have a clear understanding of why you are doing them and the results each step will bring to the website. This requires a solid grasp of SEO fundamentals. That’s why we urge you to read our blog. It has hundreds of useful articles on various important SEO topics. Additionally, if you want to expand your SEO expertise, consider joining SE Ranking Academy. It offers a variety of courses to help you brush up on your SEO skills. 2. Check if you have Google Search Console and Bing Webmaster Tools connected Webmaster tools are vital for SEO. They offer insights into site performance, indexing, crawl errors, sitemap submission, security, mobile-friendliness, backlinks, manual actions, and others. Analytical data from these tools helps SEO specialists make the right decisions when taking further steps towards website optimization. One of your first SEO tasks should be to connect your website to tools like Google Search Console and Bing Webmaster Tools. These tools will collect and analyze important SEO data about your website’s performance. Check if you already have GSC in place. If not, set up GSC for your website. If it is in place, you can also connect it to your SE Ranking account. After connection, you can view additional data from Google directly on the platform, such as search queries, impressions, clicks, CTR, and much more. If you promote your website on Bing, set up Bing Webmaster Tools on your website. You will get access to the entire set of tools. It will also enable you to monitor and improve your results on Bing. 3. Check if you have Google Analytics or GTM Google Analytics is essential for SEO because it provides valuable data on website traffic, user behavior, conversions, and engagement. It can help you find the pages on your site that drive the most traffic, as well as identify sources that send you traffic, track your average bounce rate, page views, and time on site, etc. GA4 is a vital tool for anyone who wants to dive deeper into website visitor analysis and make data-driven decisions. So, to set up GA4, you need to: Create an account. Add a GA property. Select the data stream. Obtain and install your Google Tag and Analytics tracking code. Then check if it’s working correctly. To simplify work with tags, use Google Tag Manager. It’s a tag management system enabling easy updates of measurement codes and tags to track virtually any event on your website. After setting up GA4, you can connect it to your SE Ranking account to get more detailed insights. For step-by-step instructions, check out this GA4 guide. 4. Check and configure SEO plugins CMSs offer a variety of plugins for several SEO tasks, including setting meta tags, optimizing page speed, managing redirects, and more. Consider adding at least one all-in-one plugin to enhance your SEO performance. For instance, WordPress offers Yoast, a widely used SEO plugin that aids in optimizing your site for search engines. It provides technical SEO tips such as implementing robots.txt and XML sitemaps. It also analyzes on-page SEO elements like title and description length, readability, and more. Plugins like Yoast can be installed by going to the appropriate section of the CMS and activating them directly within the platform. Be careful when selecting plugins. Some of them may have security vulnerabilities or slow down your website. Technical SEO Technical SEO is vital to establishing a strong foundation for your website. It ensures efficient crawling and indexing by search engines. Check out this technical SEO checklist to get essential best practices. 5. Check errors in Google Search Console Google Search Console offers insights into your website’s performance and can highlight important SEO issues. It’s useful for identifying and addressing indexing and crawl problems, finding potential security issues such as malware or hacked content, and identifying mobile usability issues, sitemap errors, etc. To view all potential issues, navigate to the Indexing and Experience reports. In the Pages section of the Indexing report, you can find out which issues your website URLs have. Click on the specific issue detected by the tool to access a list of pages affected by it. Then, examine the section below to get tips for improving pages to elevate their appearance in search results. Afterwards, you can review issues in the Core Web Vitals section of the Experience report. Click on the numbers to discover a list of pages with experience issues that your pages might have, including CWVs, HTTP statuses, or any desktop and mobile usability errors. 6. Run a website audit Website audits are the key to uncovering additional issues that may be preventing websites from achieving better search rankings. To identify issues with the potential to negatively impact the health of your website, run a website check. For instance, a specialized tool like SE Ranking’s Website Audit covers 120+ site parameters and groups them into 16 categories. It thoroughly examines the site, assessing usability, localization, links, media asset accessibility, and so much more. Once completed, it generates detailed reports on issues and provides practical tips for resolving them. The tool also enables you to set audit schedules and customize crawling rules. Start by fixing errors and warnings with high occurrences. Monitor your website’s health as you resolve issues—the higher its score, the better. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze To learn more about how to conduct a comprehensive website audit, refer to this guide. 7. Check your SSL certificate An SSL certificate is required for securely sending data between the site and users through encryption. It reduces the risk of sensitive information being seized or manipulated when people visit your site. To see if your website is secure, check the validity of your SSL certificate. You can inspect certificate details in the browser by clicking on the button next to the website address. To explore website security issues, use online SSL checker tools. SE Ranking’s Website Audit tool is another great option. To get a comprehensive analysis through it, just navigate to the Issue Report and select the Website Security option. If your SSL certificate is missing or invalid, renew it or obtain a new one from a trusted Certificate Authority. Install the certificate on your web server, update website settings to use HTTPS, and ensure internal links and resources are configured accordingly. Learn how to do it here. 8. Make sure you don’t have 404 pages and images Try to keep your website from having pages and images that respond with a 404 Not Found HTTP status code, or links leading to them. These errors pose a severe threat to your user experience and SEO. To find 404 pages, check the Pages section of the Indexing report in Google Search Console, which we described earlier, or use a Website Audit tool. For instance, SE Ranking’s Website Audit tool has the HTTP Status Code section. This allows you to detect broken links on your website and catch any 4XX server response code occurrences. To address this issue, review the list of 4XX URLs along with each internal page that is linked to a specific 4XX URL. Restore pages, remove broken links, or replace them with relevant links to live and accessible pages. Moreover, avoid 4XX errors by setting up 301 redirects when moving or deleting the site’s pages. Your users will inevitably encounter 404 pages on your website from time to time. For instance, they may type an incorrect URL in the address bar or access hidden pieces of content. This is why you need to create a well-designed, user-friendly 404 page with customized navigation elements. 9. Check redirects When managed correctly, redirects guide website users and search bots to a new location after the page has been deleted or moved. To makesure that your redirects work correctly, avoid redirect chains or loops, redirects to broken URLs, or hreflang attributes to 3XX pages, etc. Also, maintain a lowpercentage of 3XX pages on your website. To identify redirect issues, either use the Indexing report in Google Search Console or check them in SE Ranking’s Issue Report. Pay attention to the 3XX HTTP status code issues, as well as the Redirects section. 10. Check noindex & nofollow pages The noindex meta tag instructs search engines not to include pages with this tag in the index after crawling. This prevents them from appearing in search results. Similarly, the nofollow meta tag prohibits search engines from crawling links on the page. This also means that any authority held by the page will not be passed to the pages it links to. In short, be precise when assigning these tags to your page to prevent indexation and crawling issues. To check if everything has been configured correctly, access the Website Audit tool and review the report for the following issues: Blocked by nofollow Blocked by noindex Nofollow internal links Nofollow external links Alternatively, you can navigate to the Pages section within the Indexing report in GSC to examine the status of noindex and nofollow directives. You can also use the URL Inspection tool to inspect the indexing status of individual pages. 11. Check canonical tags Canonical tags tell search engines which URL should be indexed when similar or identical content exists on multiple pages. These tags help prevent duplicate content-related penalties. They also ensure that the correct version appears in search results. To check canonical tags on a page, inspect the page source or use browser developer tools to locate the <link rel=”canonical” href=”…”> tag in the HTML code. SEO browser extensions can also be helpful. If your website uses a CMS, look for plugins or built-in features that provide easy access to canonical tag information. To get a straightforward check of proper canonical tag setup, use a tool made specifically for website auditing. The following issues should appear in the report: Canonical chain rel=”canonical” from HTTP to HTTPS Multiple rel=”canonical” Canonical URL with a 3XX/4XX/5XX Status Code To learn how to define the canonical URL after launching a website, refer to this complete canonical tag guide. 12. Check your robots.txt file Robots.txt is a file that tells search engines how to crawl your website. If you want to restrict access to the admin area or other pages on your website, be wary of robots.txt-related issues that can prevent it from being crawled and indexed properly (or at all). To check if your robots.txt file has been configured correctly, follow these manual steps: Access your website’s root directory to find the robots.txt file. This is typically located in the URL, www.yourwebsite.com/robots.txt. Confirm that search engine bots can access the robots.txt file. Check for syntax errors. Ensure there are no typos, missing characters, or formatting issues. Review the disallow directives in your robots.txt file. Be careful not to block important pages from crawling. Ensure that User-Agent specifications are correctly configured. These directives tell specific crawlers how to interact with your site. To automate the verification of any robots.txt-related issues, use one of the robots.txt validators or navigate to the Crawling section in the Website Audit tool. If you still don’t have a robots.txt file, either create it manually or use a robots.txt generator. You can then place it directly in the website’s root directory. 13. Check your sitemap.xml The sitemap of your website’s plays a crucial role in helping search engines discover and index your pages, especially on larger websites. Ensure that your sitemap is valid, doesn’t include noindexed pages, or pages returning a non-200 status code. You can check your sitemaps in Google Search Console’s Sitemaps report. Go to the Status column and click on the URL to see detailed information on any issues with the sitemap. Keep in mind that you’ll find only the sitemaps that you submitted there. Go to the Crawling section in the Website Audit tool to get a comprehensive review of your sitemaps. If you don’t have a sitemap yet, you can use a Sitemap Generator to create one. Just navigate to Website Audit ▶️ Click the three-dots button ▶️ Push Generate Sitemap. After you’ve added the sitemap to your website, submit it to Google Search Console using the Sitemaps report. 14. Check and optimize your site’s crawl depth The crawl depth of a page is determined by the number of links it takes to navigate from the homepage to that specific page. A shorter path makes it easier for Google to crawl and for users to find it. Ideally, it shouldn’t take longer than three clicks to get to a page. If it does, this is a signal that you need to invest more time in reworking your site structure. Make sure that your website has a streamlined structure straight from the beginning, and that your pages are easily accessible in as few clicks as possible. Check out this step-by-step guide to building a solid site structure. 15. Check for internal linking issues Internal links aid website crawling, show relationships between pages, and distribute link weight. They also help users navigate and understand topics or concepts more deeply. This is why you need to conduct internal link audits regularly and address common issues, such as broken internal links and internal links to redirected pages. You might also want to make sure there are no internal links marked as nofollow. Assessing if there are too many links to unimportant pages or too few links to important ones is also important. To prevent your website from facing internal link problems, check the Internal Links section in the Website Audit’s Issues Report. If you have a new website and need help setting up a robust internal linking strategy, check out this guide. It provides tips and tricks for fixing common linking issues. 16. Check the website for orphan pages Orphan pages do not have any internal links pointing to them, which poses an issue for internal linking. These pages are seldom discovered by crawlers or users, unless otherwise indicated in the XML sitemap or through external links. Here is how to avoid this problem: Review your website data to identify pages with zero internal links. Check for indexation issues in Google Search Console. Review analytics data for pages with minimal traffic to find potential orphan pages. To automate this process, go to the No inbound links issue in SE Ranking’s Website Audit Issues Report. Make sure essential pages are linked from the main navigation menu to prevent them from being orphaned. 17. Check website speed and Core Web Vitals ​​CWVs focus on the aspects of page performance that directly influence user experience. Google strongly emphasizes providing users with a positive and efficient browsing experience. Websites that deliver pages that are faster and more responsive are more likely to satisfy users and rank higher in search results. This is why it’s crucial to ensure your site loads quickly. You can use Google’s PageSpeed Insights tool to gauge page performance and Core Web Vitals stats. Alternatively, you can run the Google Lighthouse test for any page. If you’re using Chrome, right-click on a page ▶️ choose Inspect ▶️ click Lighthouse ▶️ push Analyze page load. Another option is to use the Performance section of SE Ranking’s Issue Report. 18. Fix duplicate or missing title tags and meta descriptions Each page on your website should have a unique title and meta description. This helps search engines understand your site’s content. It also informs users about what to expect from a page before clicking on it from the SERP. To check for any pages with missing or duplicated data, use the Title and Description sections in SE Ranking’s Issue Report. Alternatively, you can export all data from your website pages and check them using options like formulas in Google Sheets. From there, rewrite any duplicate titles and meta descriptions to maintain the content’s overall uniqueness while accurately describing the content and purpose of each page. If there are any pages with duplicate titles and similar content, either implement canonical tags to specify the preferred version or merge them into one. 19. Check hreflang tags if you have a multilingual website Hreflang tags enable search engines to deliver the correct language version of your pages to users in different countries, improving their experience. These tags also indicate to search engines that similar content in multiple languages (or for different regions in the same language) is intentional, avoiding duplicate issues and protecting your rankings. You can find hreflang-related errors and instructions to fix them in the Localization section of your Website Audit Issue Report. If your website is intended for an international audience, check out our guide on hreflang configuration. 20. Make sure you don’t have HTTP links on HTTPS pages If there are any HTTP-based resources or media on your website, such as pages, JS, CSS, or images, they can pose security problems. HTTPS is a more secure protocol, and Google strongly recommends using it over HTTP. To check if your site uses HTTPS, look at your browser’s URL bar. If there’s a padlock to the left of the URL, you’re using HTTPS. If not, your connection may be insecure. SE Ranking’s Website Audit tool provides an overview of HTTPS issues for pages. It also checks links to media and other resources. 21. Ensure that your website is only accessible from one domain Search engines treat www and non-www site versions as separate entities. Search engines and your visitors should only be able to access your site from one location. Otherwise, both versions might get indexed and compete with each other in the SERPs. For example, let’s say the following URLs are different versions of your site. https://www.domain.com https://domain.com To prevent cannibalization, you will need to tell search engines which version of your site they should crawl and index, and which version to ignore. Whichever version you choose, make sure all your sitemap.xml, internal links, and backlinks are attached to it. Redirect all other versions to the primary one using a 301 redirect. You can quickly check for duplicate versions of your site by typing each variant into your browser’s address bar. If it redirects you to the primary version of your site, everything should be in order. For more detailed tips, refer to this guide on www and non-www domain names. 22. Run a mobile-friendly test Many users access websites through mobile devices. Websites offering a seamless and responsive experience on mobile devices are more likely to retain users. This results in lower bounce rates and improved engagement. Plus, Google considers mobile-friendliness as a ranking factor. Websites that are optimized for mobile devices are more likely to rank higher in search results. This increases their visibility and attracts more organic traffic. Check mobile-friendliness with Google’s Lighthouse. You can also run the Mobile-Friendly Test using Bing Webmaster Tools. Another option is to conduct a mobile-friendliness analysis using the Website Audit tool. Here are a few mobile-friendly best practices to follow: Choose a mobile-friendly font that does not compromise text readability. Ensure a high color contrast between the text and background. Compress images and adjust their size to match the screen dimensions. Consider implementing lazy loading to allow page content to load gradually as visitors scroll. Enlarge interactive elements such as buttons, text entry fields, checkboxes, links, and others to make it easy to engage with fingertips. For more tips on mobile-friendliness, refer to our mobile SEO guide. 23. Check if your design is responsive Having a responsive design is crucial for SEO because it aligns with Google’s mobile-first indexing and enhances user experience. Ensure your website looks and performs well across different devices, screen sizes, and resolutions. Perform a quick check with Chrome by navigating to the Inspect option and toggling the device toolbar. This step verifies the visibility and readability of your content. It is also good practice to manually test pages and their interactive elements on different screens. Use media queries to define different CSS styles for different screen sizes. This allows you to adjust the layout, font sizes, images, and other design elements based on screen size. Keyword and competitor research Keyword and competitor research are fundamental aspects of SEO that contribute to targeted content creation, a better understanding of user intent, effective competitor benchmarking, identification of content gaps and strategic planning. This ultimate SEO checklist provides essential steps related to keyword and competitor research. 24. Identify your top pages by their traffic and the keywords they rank for Some pages are more effective than others at driving organic traffic. To identify growth points for your SEO in this area, here are several ways to find your top-performing pages: Use Google Analytics to find pages with the highest amount of traffic: Navigate to Reports ▶️ Engagement ▶️ Pages and screens. Pay attention to the Views column. You can also use Google Search Console to find the top pages for specific keywords. Just go to Search results and review Queries and Pages. SE Ranking also enables you to view all of this information in its Analytics & Traffic section (provided you’ve connected your GA and GSC accounts). Another option is to use SE Ranking’s Competitive Research tool. Just insert your domain, hit Analyze, and go to the Organic Traffic Research ▶️ Pages tabs. Sort your pages by traffic by clicking on the corresponding column’s header. For more information on how to identify pages with the most organic traffic, refer to this guide on website analysis. 25. Identify your competitors Knowing who your competitors are allows you to detect SEO gaps and plan out how to properly position your website within your industry or niche. Competitor analysis helps you: Identify the keywords your competitors are targeting successfully. Figure out the type of content that resonates well with your shared audience. Identify potential link-building opportunities. Stay informed about SERP trends. Knowing who your direct, partial, and even indirect competitors are is a crucial part of succeeding in your SEO goals. Indirect competitors target a similar audience but offer different products or services. Direct competitors offer the same products/services as you. Partial competitors are websites that share some overlap with your offerings but may also focus or specialize in something else. To identify your SERP competitors, search for your target keywords and see what appears on the first page of search results. Note the domains and pages that consistently appear for these queries. If your business is location-based, you should also assess any competitors residing in your local area. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze To quickly identify your domain’s competitors, navigate to the Competitor Research tool ▶️ Enter your domain ▶️ choose the Organic Traffic Research section ▶️ go to the Competitors tab. Check the Visibility Rating section under your project to get a more general scope of the websites competing with your domain. Also, make sure to explore the SERP Competitors section, where you can observe the ranking changes of websites for specific queries. This feature allows you to track sudden rises or drops in search results positions and identify the domains that consistently rank at the top of SERPs. Pay attention to these websites. Regularly monitor SERP fluctuations and keep your competitor list dynamic. New competitors may emerge while existing ones alter their strategies. 26. Analyze your competitors’ top pages and keywords Examining your competitors’ top-performing pages can help you figure out what kind of content resonates best with your audience. Moreover, by analyzing your competitors’ keywords, you can discover which terms and phrases they target in their content and incorporate them into your SEO strategy. Use SE Ranking’s Competitor Research tool to find out which of your competitors’ pages work best, the keywords they rank for, and how much traffic they generate. This information is available in the Keywords and Pages sections. 27. Find content and keyword gaps Closing content and keyword gaps not only improves your online performance but also boosts your ranking positions ahead of your competitors. Look for content created by your competitors that performs well and examine any techniques used (or topics covered) that may be missing from your strategy. Analyze search engine results pages for your target keywords to identify and understand the types of content that rank well. This will assist you creating similar but more valuable content. To find valuable keywords used by your competition but not by you, go to the Competitor Research tool ▶️ Competitor Comparison tab. This is where you can pit your domain up against two competitors. Pay special attention to the keywords in the Missing group to figure out which of them to target. To analyze competitor content, navigate to the Organic Traffic Research tab and select the Pages option. Click on the URL to visit the page and examine it. 28. Create or update your keyword list Identifying new keywords can reveal more opportunities to reach untapped audiences and draw in relevant traffic. First, define the main categories of your business. Then, draft a list of potential seed phrases for those categories. Next, utilize keyword research tools such as Google Keyword Planner to add similar and related keywords to the list. Enter your seed keyword in the search bar to find keyword ideas. Another option is to use SE Ranking’s Keyword Research tool. Just input your seed keywords to get metrics like search volume, search intent, CPC, competition level, and SERP features. It also offers a variety of keyword suggestions, including similar, relevant, question-based, and low search volume keywords. 29. Analyze keyword search volume, difficulty, and search intent Not all keywords on your list are equally valuable. Some may be too difficult to rank high for, or they may not be worth the investment due to their low traffic potential. They may also have a search intent that you cannot meet. To create a refined list of keywords, pay special attention to the following metrics: Search volume: Learn how popular the keyword is among users. Observe seasonal trends, if applicable, to better understand fluctuations in search volume. Difficulty: Examine the keyword difficulty metric, which indicates how hard it is to rank for that keyword. Search intent: Review the SERPs for your target keywords and find out which types of content currently rank high. Identify patterns in the content format (e.g., informational, transactional) to discover user intent. All of these metrics can be found in the main dashboard of SE Ranking’s Keyword Research tool. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze You can also use Google Keyword Planner to get monthly search volumes for keywords. This tool can help you find out how difficult each keyword will be to reach the top of the SERP for. 30. Wipe your keyword list clean of irrelevant keywords After assessing all your keywords based on the metrics described above, the next step is to remove all keywords that don’t align with your SEO strategy. Eliminate keywords that are irrelevant, have too high a difficulty, or with low search volume. However, some low-search volume keywords may still be useful for your SEO strategy. They can attract some users with minimal effort. And as an added tip, be sure to eliminate all keyword duplicates from your list. 31. Cluster your keywords With your newly created group (cluster) of related keywords, you can create content that provides in-depth information, answers user queries comprehensively, and satisfies search intent. This leads to higher user engagement and satisfaction. Split keywords into clusters based on their semantic similarity and resemblance in search results. To streamline the clustering process, you can use our Keyword Grouper tool. Just select the grouping accuracy and clustering method depending on your needs. This will help it to more accurately produce clusters with your preferred level of detail. Refer to our keyword clustering guide to learn more. 32. Identify your target keywords Keywords with the ability to generate leads, sales, and conversions are your “money” keywords. Review your keyword list before selecting a target keyword to focus on for each cluster.Here’s how to do this: Understand your business, audience, and goals. Conduct market research and analyze competitors. Prioritize keywords based on relevance and search volume. Get audience feedback to gauge your efforts. Monitor performance and adjust your strategy as needed. 33. Add or update keywords (and their target URLs) for rank tracking Tracking keyword rankings is essential for understanding how well your SEO strategy is performing, staying competitive, and adapting to changes in the search landscape. To build a successful SEO strategy, add both your keywords and their target URLs to a rank tracker tool. For example, SE Ranking’s Rank Tracking tool makes this process easy. Just select a keyword or a group of keywords, click on the Target URL button, and then specify the page address. The tool enables you to view keyword rankings and distributes them by the day. It also displays essential metrics like search volume, traffic forecast, SERP features where your URL appears, and fluctuations in ranking positions. Keep in mind: If the correct URL is ranking for the query, the icon in the table near it will be blue. If the icon is red, the wrong URL is ranking for the query. Do not ignore this. 34. Analyze your current website structure Having a well-organized website structure with intelligent linking is the key to transforming a cluttered set of pages into a site that users and search engines adore. It promotes effective page crawling and enhances the user experience. When analyzing your site architecture, always consider the following: ensure that your content is logically categorized, the navigation is simple, each internal page is linked, etc. All transitions between pages should be natural. If you’re launching a new website or plan to enhance your existing site’s structure, read our step-by-step guide to building a robust site architecture. Content creation & audit The next crucial step in comprehensive website optimization is conducting a content audit and creating valuable content. Otherwise, it will be difficult to achieve high rankings and attract relevant traffic. Now, let’s dive into the next steps of this complete SEO checklist. 35. Verify that your current site’s content is up-to-date Check if your content is accurate and relevant. If it is not, update it. Search engines will notice any changes made to the indexed pages. If your content remains up-to-date, this is a surefire sign that your site is active and well-maintained. You may want to focus on updating your top-performing pages and archiving and/or redirecting severely outdated posts (if there are any). It might also be worth tending to pages that used to rank high but have since dropped. They could regain positions if you update them. 36. Ensure that your current site’s content is unique Content works best when it is unique (both in terms of copy and value), optimized, and credible. When your content offers a unique experience, readers and search algorithms are more likely to derive value from it. Higher value content results in higher rankings in SERPs. This also suggest that you should never use stolen content or create poorly rewritten content. Check the uniqueness and quality of your texts with SE Ranking’s Plagiarism Checker, located in Content Editor. 37. Optimize or redirect poorly performing pages Poor-performing pages may contain outdated or irrelevant content disliked by both users and search engines. Regularly reviewing and updating content ensures that it remains timely and aligned with users’ needs. Optimization can be done by: Writing new content, or adjusting existing content on underperforming pages. Redirecting pages to similar pages with better quality. Pay attention to any pages that are ranking on the second page of the SERP. It will likely take less effort to get these pages into the top 10 than others. If you have a page that has already made it to the first SERP, perform competitive research to figure out what may be preventing it from occupying the first spot on Google. Use SE Ranking’s Rank Tracker tool to find out which of your pages rank low, are in the top 20, or are close to the top spot. 38. Check for keyword cannibalization and duplicate content issues Having duplicate (or noticeably similar) content appearing on multiple pages on your website can confuse search engines. Google, for example, won’t know which URL to list higher in search results. Duplicate content issues also point to your website being littered with soft 404 errors. To detect duplicate content, go to the Issue Report of the Website Audit tool. After detecting these errors, either delete or rework any duplicate content. You can also use canonical tags or 301 redirects. Duplicate pages can also result in cannibalization issues. Keyword cannibalization issues occur when two or more pages on your website compete for the same target keyword. Pay attention to the following scenarios: Your page isn’t progressing in rankings for the targeted keyword despite all optimization efforts. This indicates that another page could be interfering with this one. Different pages on your site frequently replace each other in the search results. The wrong page is ranking for the keyword another page is optimized for. To check for cannibal pages, use the Search results tab in Google Search Console. To check a keyword, select New, and then enter the keyword you’d like to check. A filter will be applied. Keyword cannibalization occurs when multiple pages from the same website compete for top rankings in the SERP for the same keyword. To find out which URL is ranking the highest for this keyword, go to the Pages tab. You can also detect cannibalization with SE Ranking’s Rank Tracker: Go to the Detailed tab. Scroll down to the Keywords section and check the URL column. If you see a red number next to the icon, this indicates that several pages rank for this key term. If cannibalization is detected, review your keyword map and consider merging or splitting clusters by applying strategic page adjustments. Please note: Websites with high trustworthiness can rank twice in the top 10 for the same query. This increases their visibility and traffic. 39. Create a content plan for new keyword clusters You may come across untapped keyword clusters after completing your keyword research. We recommend creating a content plan for them. When reviewing these clusters, consider the topics and type of content you plan to cover within them. Determine when and where you want them to be published as well. Keep seasonality in mind and prepare all seasonal content beforehand. SE Ranking’s Content Idea Finder is a great tool if you need help coming up with topic ideas for clusters. The tool analyzes keywords in your niche and provides dozens of relevant content topics. Furthermore, you can discover title ideas here and navigate to pages covering your desired topics to uncover valuable content for your own purposes. 40. Create briefs for new pages To generate new content, start by creating a quality brief. This will make it easier for copywriters, designers, and other team members to create SEO-friendly content. Each one of your briefs must be informed by a thorough SERP analysis as well as your own subject matter expertise. Here are some key points to consider: Clearly state the purpose of the new page. Specify its primary goal or the action you want visitors to take. Describe the target audience. Provide on-page SEO guidelines. Include the meta tags, title, and meta description. Include a list of primary and secondary keywords to use in text. Outline the structure of the page: define headings, subheadings, and sections. Plan internal linking strategies to connect new content with existing pages. Identify the visual elements required for the page, including images and videos. SE Ranking’s Content Editor can help with simplifying the brief creation process. It recommends all essential elements of your article by analyzing the top-performing competitors. This includes content parameters, structure, metadata, suggested links, and terms to use. On-page SEO This on-page SEO checklist includes tips for optimizing content, meta tags, headings, and other elements, all of which are necessary for improving user experience and helping search engines better understand your content. Make your site follow the points outlined below. 41. Optimize page content for search intent and keywords Review the search results for your keyword to discover what kind of content satisfies user intent for it. Periodically revisit and update your pages to match any changes in information or trends. Use the On-Page SEO Checker to compare your page content with that of your competitors. It can find out which pages are currently ranking at the top, compare them with yours, and provide you with actionable steps for improving your page. The tool displays a comprehensive report with a list of issues found during the audit. It also displays a page quality score and the SEO tasks that you must complete to improve it. The issues are categorized as errors, warnings, and notices. Each category has a different weight and impact on the overall score for easy prioritization. RUN AN ON-PAGE SEO CHECKGet SERP-backed tips to outrank competitorsTRY NOW Also, be sure to apply improvements based on your own insights, not just the tool’s recommendations. 42. Make sure your URL is SEO-friendly Clear and concise URLs enhance readability for both users and search engines. A well-structured URL provides a quick overview of the page’s content. Consider the following key points when creating an SEO-friendly URL: Include the target keyword in the URL. Keep the URL short, descriptive, and evergreen (e.g., without years, numbers, or variables). This is to avoid having to change it later. Structure URLs in the following way: your-domain.com/folder/subfolder/page/. This informs visitors about where they are on your site. Use the On-Page SEO Checker tool to identify areas for improvement. It also offers URL-related suggestions. To learn more about this topic, check out on guide on optimizing SEO-friendly URLs. 43. Make sure your title and meta description are optimized Crafting a well-optimized title tag and meta description gives clear signals to users about the content and purpose of your page. This helps them understand how relevant it is to theirs search query, increasing the chances of your page being prominently displayed in search results. It is recommended to include your focus keyword in the title, as this can influence your rankings. While the meta description doesn’t directly impact rankings, it plays a crucial role in encouraging users to click on your snippet. So, even though it’s not necessary to include a focus keyword, crafting a compelling and engaging description is. Make sure the lengths of title and meta description fall within the recommended parameters to prevent them from being truncated on the SERP. The recommended character limits are up between 55-60 for titles and 155-160 for descriptions. For more information on this topic, read our guide on titles and meta descriptions. 44. Check your heading and optimize them H tags help search engine bots understand your content hierarchy by enabling them to more accurately determine which queries the page can answer. They also promote a positive user experience. Consider the following when optimizing headings: Maintain heading hierarchy. Don’t skip levels. Use heading tags where it makes sense. Avoid overly long headings. Incorporate an H1. Include a focus keyword in your H1. Use our On-Page SEO Checker to conduct a thorough analysis of your page headings by comparing them with those of similar content that ranks high on the SERP. For more on optimizing headings, check out this guide for h1-h6 tags. 45. Ensure images have alt text The alt attribute inside an <img> tag provides image descriptions that are accessible to both search engines and people that use screen readers. This helps them better understand the content of the image, which can improve image search rankings. Be careful not to confuse this with the title attribute, which pops up as a tooltip when you hover over the image. Although the title attribute isn’t mandatory, consider adding it in cases where it can be helpful for users. Use descriptive alt text that accurately describes the content of an image to users and search engine bots and how it relates to the surrounding text. To learn more about alt text, refer to our comprehensive image optimization guide. To identify alt tag-related issues on your page, navigate to the Media section in the On-Page SEO Checker. 46. Add schema markup for rich snippets Schema markup is important for SEO because it provides search engines with additional context about your content, which increases its chances of being displayed in SERP features. Having content that appears in featured snippets enhances its visibility and relevance in search results. This increases your click-through rates and improves your overall search engine rankings. Optimizing for rich snippets essentially means adding Schema.org structured data markup into your website’s pages. Here are the four key steps to accomplishing this: Find out which Schema markup you need. Code it manually or with tools like Google’s Structured Data Markup Helper or Schema.org’s Markup Generator. Confirm the accuracy of your structured data using Google’s Rich Results Test tool. Update your page and submit it for indexation via Google Search Console. 47. Optimize internal linking Here is how to optimize your website’s internal linking structure: Confirm that all links on your pages bring value to users and work properly. Provide descriptive and relevant anchor texts for the pages that they lead to. Double-check your page content for 404 links. If there are some redirected links, update them with direct ones. For more tips on improving your internal linking strategy, go to the On-Page SEO Checker. 48. Optimize your logo and favicon The favicon appears on the SERP. It enhances the recognizability of your pages when multiple tabs are open. Also, pages featuring the brand favicon tend to be more appealing and trustworthy to visitors. Create favicon.ico files in multiple sizes (e.g., 16×16, 32×32) to support various devices. Keep the file size small to ensure quick loading. Click the following link to explore further insights on optimizing favicons. It’s also good practice to optimize the website logo. Here’s how: Compress it to 70 KB without compromising quality. Add alt text. Confirm that your logo is responsive. Keep your favicon and logo consistent in terms of design, colors, and branding elements. 49. Optimize your content for E-E-A-T Google acknowledges and rewards sites that produce high-quality content because they tend to provide the most satisfying answers to users’ queries. The primary concepts used by Google to assess content quality and value (especially on YMYL sites) is E-E-A-T.EEAT is an acronym that stands for the four key elements below: Experience: The creator’s first-hand (or life) experience related to the topic, such as actual use of a product. Expertise: The creator’s knowledge level of the topic. Authoritativeness: The reputation and authority of the website that publishes the content. Trustworthiness: The reliability and credibility of the content itself. Take the following steps to achieve high E-E-A-T: Craft unique and high-quality content that resonates with your target audience. Preserve author visibility by creating separate bio pages for them. Get mentions on authoritative websites. Share personal insights or discuss niche products/services from your perspective. Build trust across the website by including key elements like an About Us page, certifications, and a portfolio with real customer reviews. Link building Off-page SEO is another essential aspect of website optimization. It is almost impossible to achieve SERP success without quality backlinks. Follow the steps in our off-page SEO checklist below to enhance your authority for search engines. 50. Analyze your backlink profile High-quality backlinks boost trust, increase referral traffic, and enhance brand awareness. To boost your website’s reputation, build a solid backlink profile. Start by analyzing your existing one with a specialized tool. Use the Backlink Checker tool to: Evaluate your Domain Trust score to gauge the quality of your backlink profile. Check your website for toxic backlinks and review them more precisely. Assess the dofollow/nofollow attributes ratio. The standard share of nofollow links depends on your niche. Check for the number and quality of referring domains and backlinks you have. Typically, the more high-quality referral domains a website has, the greater its authority, according to search engines. Go to the Backlinks section to analyze each one using more than 15 parameters, such as Domain Trust score, target URL, anchor texts, backlink toxicity, and more. Explore all backlinks’ anchor texts. See which pages have the greatest share of backlinks and referring domains. 51. Analyze your competitors’ link profiles Analyzing and finding the backlinks of your competitors is a valuable strategy for gaining insights into the competitive off-page landscape and learning how to outperform rivals. Here’s how to accomplish this with SE Ranking’s Backlink Checker tool: Assess your competitor’s Domain Trust score and compare it with yours. A higher score suggests that the domain is more likely to rank high in search results. Determine how many quality links and referring domains your competitor has. If they have more mentions from authoritative websites than you, this suggests that you may need to get additional high-quality backlinks. Explore your competitors’ backlink types. For example, if they do a lot of guest posting, adopt a similar approach. Examine their techniques to inform your own guest blogging strategy. Investigate the anchor texts used by your competitors. Include the most relevant ones as part of your own link-building strategy. Avoid overwhelming users with overly promotional “money” anchors. CHECK ANY SITE'S BACKLINKSCheck which domains link out to any website and get ideas for enhancing your backlink profile.Analyze 52. Conduct a backlink gap analysis Conducting a backlink gap analysis enables you to pinpoint potential backlink opportunities by comparing your website’s link profile with those of your competitors. Uncover sources that are currently linking to your rivals but not to your own site. They may also consider linking to your website. This is where SE Ranking’s Backlink Gap Analyzer can come in handy. Enter your domain (and up to 5 competitor domains) to get a detailed list of untapped referring domains. The tool shows up to 10,000 backlinks for each domain. 53. Make link building plan A link building plan is a structured and formalized set of strategies for gaining backlinks whose end goal is to enhance your website’s visibility and credibility. Improve your link building strategy by incorporating the following white-hat SEO methods: Create shareable content: Offer valuable information and insights to increase the likelihood of earning organic backlinks. Establish a company profile: Create comprehensive company profiles on business listing sites, industry directories, catalogs, and trusted review platforms. Engage in guest blogging: Contact authoritative sites relevant to your niche and contribute high-quality content to them. It’s a win-win situation for both sides: you secure backlinks to your site while the other domain gets valuable content. Run PR campaigns: Highlight noteworthy achievements, product launches, or significant company updates. Press releases and media coverage can attract authoritative backlinks from reputable sources while increasing your brand awareness. Utilize HARO: Share your expert opinions and insights on relevant topics. Responding to journalist queries provides an avenue for securing mentions and backlinks from reputable media outlets. Leave reviews on authoritative websites: Share your experiences and insights by leaving thoughtful reviews on authoritative websites within your industry. Mention your website whenever it is appropriate to do so. 54. Approach relevant websites that might link to you Trying to acquire valuable backlinks without proactively reaching out to potential collaborators is like trying to make new friends without going to new places. That’s why you should look around and see who’s out there. Once you have settled on a relevant list of websites that might link to you, follow these steps: Craft personalized outreach emails: Acknowledge their website, and clarify to them how your content is relevant and valuable to both them and their audience. Propose content opportunities: Present a variety of topic options to choose from. Offering topic flexibility increases your chances of finding a subject that aligns with your target website’s interests. Highlight mutual benefits: Clarify that creating high-quality content with a link back to your site benefits both your website and your partner’s. Share success stories: Share examples of work you have done with other websites. This demonstrates the positive outcomes you have achieved through content partnerships. Attach or provide links to samples of your previous work. Follow up politely: If you don’t receive a response following your initial outreach, send a polite follow-up email to reignite the conversation. Remember, effective outreach is about building relationships and demonstrating the value you offer. Follow the steps in this outreach guide to start establishing meaningful connections and increasing your chances of securing valuable backlinks through collaborative efforts. 55. Reclaim lost backlinks from quality domains To maintain a high-quality backlink profile, consistently monitor your backlinks and identify any that have disappeared or no longer point to your site. Use the Backlink Monitor to get notifications about them. Identify reasons for the link’s absence, including broken pages, changes in URL structure, or alterations to the linking website. If the loss was due to an error or misunderstanding on the donor’s side, reach out to them to sort out the issue. If the loss resulted from changes on your website, such as page deletions or URL modifications, ask the donor website to update the link on their end. Also, implement 301 redirects from the old URL to the new one on your site. 56. Turn unlinked mentions into links If you’ve got unlinked brand mentions, you’re already halfway to securing a link. Brand mentions indicate that the author is familiar with your business. This is a great opportunity to engage with them and turn that mention into an active link. To find new unlinked mentions, configure Google Alerts or use a Google search operators combo like [brand] after:[a specific date]. Example: 57. Check disavow backlink file The disavow file is used to handle toxic backlinks as well as prevent penalties and drops in rankings. It is a text file that lists all the links (URLs or entire domains) that you want Google to ignore. Check if your website has a disavow file. If it does, review the domains and/or URLs found there. Only add purchased or harmful links to the disavow file. If you don’t have a disavow file but need one, you can use a disavow file generator tool or create it manually. After creating the disavow file, submit it to Google Search Console. To get a more detailed explanation for this, read this guide. Local SEO Local SEO is essential for businesses that sell products or services in a specific region and have a physical presence. It helps attract nearby customers and improves visibility in the local market. Follow the steps in the ultimate SEO checklist below to boost local sales. 58. Audit your Google Business Profile A well-optimized Google Business Profile can attract new customers to your site and enhance your digital presence. Make sure your GBP has accurate and comprehensive information about the location(s) of your business. Make it easy for users to contact and find you by including your address, phone number, website URL, service area, working hours, business description, and other details. Here is how it should look on Google: You can add, check and manage your business information within the Local Marketing tool’s Google Business Profile section. You can add or modify your business details, and gain insights into how users interact with your Google Business Profile. The tool provides data on how often users view your business profile on Google Maps versus Google Search, along with metrics like direction requests, photo views, phone calls, etc. If you don’t have a Google Business Profile yet, follow the steps in this Guide by Google to create one. If you run into issues getting it to go live, refer to our article on GBP verification. 59. Add your website to local directories Local directories, such as Foursquare, Google, and Tripadvisor list and offer information about businesses within specific geographical areas. These platforms can help your business get discovered by local customers and spread brand loyalty throughout your neighborhood. The Business Listings section displays the local directories where your business is listed and suggests additional listing opportunities. If you notice that your location is not listed in the relevant directory, add it. 60. Make sure your NAP is consistent Google sees listing consistency as a sign of trustworthiness. Your business’s NAP (name, address, and phone number), for example, must remain the same across all listings. SE Ranking’s Local Marketing tool can help you achieve this by providing information on any NAP errors that are present in each listing. The Error column in the tool’s Business Listings section highlights if your business is missing critical directory-related information or has inconsistent contact information across listings. This helps you figure out which corrections you need to make. 61. Use the Local Business schema markup Schema markup provides detailed information about your local business to search engines, which enhances its visibility in local search results. Use Local Business structured data to provide Google with key business information like operating hours, distinct departments, reviews, and more. Here’s how to do it: Choose the relevant category from schema.org. For example, for an ice cream chain, opt for schema.org/IceCreamShop. For a local hardware chain, select schema.org/HardwareStore. Include schema.org sub-properties such as URL, business name, operating hours, contact telephone, address, link to the business logo image, zip code, served area, and more. Verify the accuracy of your structured data and incorporate it into your website. Double-check for any errors to ensure a smooth implementation. Explore Google’s guide to structured data for local businesses. 62. Audit your online reviews It’s crucial to listen and respond to what customers are saying about your business. This enables you to address customer concerns, gain valuable insights, and discover how to improve business performance. You can use SE Ranking’s Local Marketing tool to view business reviews and ratings left by clients on popular review websites. Our review sources include Google, Facebook, Yelp, Foursquare, and Tripadvisor. The tool empowers you to respond to reviews directly from the platform, manage review statuses and track your location’s rating for each source. It also provides insights into frequently used words in the reviews. One of the most interesting features is that you can gather insights from reviews and identify new keywords to incorporate into your content. Final thoughts SEO is an ongoing, dynamic process, making it challenging to squeeze everything into a single website SEO checklist. However, we’ve covered the most important points, which should be more than enough to help you get on the right foot and enhance your website’s quality. So, keep up the good work, and feel free to customize this checklist to your needs. You’re sure to benefit from better search visibility if you do. The key is not just ticking off tasks, but regularly improving the value and performance of your website, specifically for your target audience. Website Promotion 876 views Written by Daria Chetvertak Daria is a content marketer at SE Ranking. Her interests span across SEO and digital marketing. She likes to describe complicated things in plain words. In her free time, Daria enjoys traveling around the world, studying the art of photography, and visiting art galleries.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Checklist for New and Existing Websites"
    },
    {
      "level": "H2",
      "text": "What is an SEO checklist?"
    },
    {
      "level": "H2",
      "text": "How to use this SEO checklist"
    },
    {
      "level": "H2",
      "text": "Basic setup"
    },
    {
      "level": "H3",
      "text": "1. Understand basic SEO concepts"
    },
    {
      "level": "H3",
      "text": "2. Check if you have Google Search Console and Bing Webmaster Tools connected"
    },
    {
      "level": "H3",
      "text": "3. Check if you have Google Analytics or GTM"
    },
    {
      "level": "H3",
      "text": "4. Check and configure SEO plugins"
    },
    {
      "level": "H2",
      "text": "Technical SEO"
    },
    {
      "level": "H3",
      "text": "5. Check errors in Google Search Console"
    },
    {
      "level": "H3",
      "text": "6. Run a website audit"
    },
    {
      "level": "H3",
      "text": "7. Check your SSL certificate"
    },
    {
      "level": "H3",
      "text": "8. Make sure you don’t have 404 pages and images"
    },
    {
      "level": "H3",
      "text": "9. Check redirects"
    },
    {
      "level": "H3",
      "text": "10. Check noindex & nofollow pages"
    },
    {
      "level": "H3",
      "text": "11. Check canonical tags"
    },
    {
      "level": "H3",
      "text": "12. Check your robots.txt file"
    },
    {
      "level": "H3",
      "text": "13. Check your sitemap.xml"
    },
    {
      "level": "H3",
      "text": "14. Check and optimize your site’s crawl depth"
    },
    {
      "level": "H3",
      "text": "15. Check for internal linking issues"
    },
    {
      "level": "H3",
      "text": "16. Check the website for orphan pages"
    },
    {
      "level": "H3",
      "text": "17. Check website speed and Core Web Vitals"
    },
    {
      "level": "H3",
      "text": "18. Fix duplicate or missing title tags and meta descriptions"
    },
    {
      "level": "H3",
      "text": "19. Check hreflang tags if you have a multilingual website"
    },
    {
      "level": "H3",
      "text": "20. Make sure you don’t have HTTP links on HTTPS pages"
    },
    {
      "level": "H3",
      "text": "21. Ensure that your website is only accessible from one domain"
    },
    {
      "level": "H3",
      "text": "22. Run a mobile-friendly test"
    },
    {
      "level": "H3",
      "text": "23. Check if your design is responsive"
    },
    {
      "level": "H2",
      "text": "Keyword and competitor research"
    },
    {
      "level": "H3",
      "text": "24. Identify your top pages by their traffic and the keywords they rank for"
    },
    {
      "level": "H3",
      "text": "25. Identify your competitors"
    },
    {
      "level": "H3",
      "text": "26. Analyze your competitors’ top pages and keywords"
    },
    {
      "level": "H3",
      "text": "27. Find content and keyword gaps"
    },
    {
      "level": "H3",
      "text": "28. Create or update your keyword list"
    },
    {
      "level": "H3",
      "text": "29. Analyze keyword search volume, difficulty, and search intent"
    },
    {
      "level": "H3",
      "text": "30. Wipe your keyword list clean of irrelevant keywords"
    },
    {
      "level": "H3",
      "text": "31. Cluster your keywords"
    },
    {
      "level": "H3",
      "text": "32. Identify your target keywords"
    },
    {
      "level": "H3",
      "text": "33. Add or update keywords (and their target URLs) for rank tracking"
    },
    {
      "level": "H3",
      "text": "34. Analyze your current website structure"
    },
    {
      "level": "H2",
      "text": "Content creation & audit"
    },
    {
      "level": "H3",
      "text": "35. Verify that your current site’s content is up-to-date"
    },
    {
      "level": "H3",
      "text": "36. Ensure that your current site’s content is unique"
    },
    {
      "level": "H3",
      "text": "37. Optimize or redirect poorly performing pages"
    },
    {
      "level": "H3",
      "text": "38. Check for keyword cannibalization and duplicate content issues"
    },
    {
      "level": "H3",
      "text": "39. Create a content plan for new keyword clusters"
    },
    {
      "level": "H3",
      "text": "40. Create briefs for new pages"
    },
    {
      "level": "H2",
      "text": "On-page SEO"
    },
    {
      "level": "H3",
      "text": "41. Optimize page content for search intent and keywords"
    },
    {
      "level": "H3",
      "text": "42. Make sure your URL is SEO-friendly"
    },
    {
      "level": "H3",
      "text": "43. Make sure your title and meta description are optimized"
    },
    {
      "level": "H3",
      "text": "44. Check your heading and optimize them"
    },
    {
      "level": "H3",
      "text": "45. Ensure images have alt text"
    },
    {
      "level": "H3",
      "text": "46. Add schema markup for rich snippets"
    },
    {
      "level": "H3",
      "text": "47. Optimize internal linking"
    },
    {
      "level": "H3",
      "text": "48. Optimize your logo and favicon"
    },
    {
      "level": "H3",
      "text": "49. Optimize your content for E-E-A-T"
    },
    {
      "level": "H2",
      "text": "Link building"
    },
    {
      "level": "H3",
      "text": "50. Analyze your backlink profile"
    },
    {
      "level": "H3",
      "text": "51. Analyze your competitors’ link profiles"
    },
    {
      "level": "H3",
      "text": "52. Conduct a backlink gap analysis"
    },
    {
      "level": "H3",
      "text": "53. Make link building plan"
    },
    {
      "level": "H3",
      "text": "54. Approach relevant websites that might link to you"
    },
    {
      "level": "H3",
      "text": "55. Reclaim lost backlinks from quality domains"
    },
    {
      "level": "H3",
      "text": "56. Turn unlinked mentions into links"
    },
    {
      "level": "H3",
      "text": "57. Check disavow backlink file"
    },
    {
      "level": "H2",
      "text": "Local SEO"
    },
    {
      "level": "H3",
      "text": "58. Audit your Google Business Profile"
    },
    {
      "level": "H3",
      "text": "59. Add your website to local directories"
    },
    {
      "level": "H3",
      "text": "60. Make sure your NAP is consistent"
    },
    {
      "level": "H3",
      "text": "61. Use the Local Business schema markup"
    },
    {
      "level": "H3",
      "text": "62. Audit your online reviews"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Daria Chetvertak"
}