{
  "url": "https://seranking.com/blog/sge-research/",
  "slug": "sge-research",
  "title": "The Google SGE Snippet Study by SE Ranking",
  "description": "The SE Ranking team analyzed 100K keywords to uncover insights into Google’s SGE snippets. Check out our conclusions based on the data we collected.",
  "content": "Blog / SEO Industry News / SGE Snippet Research: We Analyzed 100K Keywords to See Google’s AI in ActionSGE Snippet Research: We Analyzed 100K Keywords to See Google’s AI in Action Written by Yevheniia Khromova Reviewed by Ivanna Vashyst Feb 26, 2024 21 min read September 2024 update:Our latest research shows shifts in the AI Overview behavior. Read our AI Overviews research for the pre vs. post-rollout comparisons and check out July 2024 research for more stats and insights on sources featured in AIOs. For more data on AIOs and Google Ads interplay in search, review our latest research. Search Generative Experience (SGE) stands as one of the most significant recent developments in Google search, and understanding the impact of this innovation is crucial for businesses and marketers. That’s why the SE Ranking team conducted an extensive analysis of SGE responses across a wide sample net of keywords and niches. We handpicked 100,000 keywords with various search intents and search volumes across 20 niches. Leveraging our newly developed feature capable of detecting SGE responses in Google search, we analyzed them for the US (New York) region. This uncovered insights such as how often Google provides AI-generated responses, the length of SGE content, linking patterns, and differences across niches. What’s more, we did all this using our own AI results tracking features. SE Ranking has recently released an AI Overviews Tracker capable of monitoring AIO/SGE snippets for your keywords. You can analyze sources featured in AI-generated answers, review cached SERPs, and even detect AIO SERP features when running competitive and keyword research. Sign up for a free trial to try out this functionality and stay on track as search evolves. We’re finally ready to present our findings. TL;DR: 64% of the analyzed keywords either have an SGE answer or a Generate button. The average text length of the SGE snippet is approximately 3,485 characters. The most common number of links in the SGE answer after expanding is 8 links. 85.5% of SGE snippets link to one or more domains from the top 10 organic results. quora.com, local.google.com (Google Maps), and en.wikipedia.org are the most linked domains in SGE. Keywords from the Food and Beverage niche trigger SGE snippets most often, while the News and Politics niche gets SGE responses less often. SGE snippets containing text appear in SERPs alongside featured snippets approximately 25% of the time. Long-tail keywords are more likely to trigger AI-powered responses. In 27% of cases, no ads accompanied SGE snippets. In 73% of cases, ads were present. Ads at the top of the SERP accompany SGE snippets more often than shopping ads, but shopping ads tend to appear above the SGE snippet. Now, let’s take a closer look at the results of our study. Disclaimer: In the following sections, you’ll find our research results, along with our data analyses and resulting conclusions. Keep in mind though that the data can be interpreted in different ways. The conclusions we presented here are our best hypotheses but are not necessarily the only right way to view these results. It’s also important to note that the findings presented in this research reflect Google’s SGE behavior at the time of our study. This may not reflect reality later down the road. Google is continuously being updated, so each of the patterns we detected can shift over time. How often do SGE responses appear in search? Our analysis shows that SGE responses frequently appear in Google search results. We found SGE content, including the ‘Generate’ button, in nearly 64% of SERPs for the analyzed keywords. The graph below displays the percentage of keywords that triggered an SGE snippet, had the Generate button, ended with a technical error, or didn’t have an SGE snippet at all: Here is our breakdown of the results after checking 100,013 keywords: SGE snippet: The SGE answer with text was generated for 18,455 keywords (about 18.5%). Generate SGE snippet: In 45,111 cases (45.1%), Google offered to generate an SGE answer via the Generate button. Technical SGE error: There were 24,105 cases (around 24.1%) in which Google couldn’t generate an SGE snippet. No SGE snippet: In 12,342 cases (around 12.3% of the total keywords analyzed), no SGE snippet appeared. We see a substantial integration of AI-generated responses within search results, with a significant portion of searches either displaying an SGE answer or offering the option to generate one. Still, SGE technology has its limitations. Nearly a quarter of the keywords did not receive SGE answers during the check, with the engine prompting us to try again later. Google is also cautious about some queries, as evidenced by the Generate button’s frequent appearance. What is the average length of the text in SGE answers? We measured the length of the text in SGE answers by character count to determine common text lengths. We wanted to see how much information Google’s AI can generate and how much text users are likely to encounter. The text length range that most frequently appeared in the SGE snippet was between 3,044 and 4,646 characters. The average text length was approximately 3,485 characters. The graph below shows the distribution of text length in SGE snippets and its frequency of occurrence: Some parts of the content were hidden within dropdowns. This required users to expand their answers. During our analysis, we analyzed the character count by expanding the SGE answers and terms within them. Google is quite flexible in how much auto-generated content it provides, but it bends in favor of providing substantive content. Content creators and SEO professionals should keep an eye on the typical length of SGE text responses. This can give professionals an idea of how thorough and expansive their content needs to be in order to compete in the updated search. On the other hand, the more space the SGE snippet gets in the SERP, the less potential for sites to get organic traffic from organic search results. This is still mere speculation on our part because the integration of SGE snippets into search will further complicate traffic forecasting. How many links do SGE snippets contain? We carefully checked in our study the number of links in the SGE snippets. We didn’t research the links in the carousel of websites on the right side of the SGE snippet. Instead, we directed most of our attention to the links in the SGE text response. We considered both the pre-click state of the SGE response (where the SGE snippet had yet to expand, showing a shortened version of the answer) and the post-click state (where the SGE answer was expanded to reveal the full content). Here’s a graph showing the general distribution of links in SGE responses: Let’s go over these numbers in more detail: Pre-click links: The biggest number of links observed before using the dropdown to expand the AI-powered answer was 70 links. However, the most frequently occurring number of pre-click links was just one link. The most frequent number of pre-click links in an SGE snippet: Post-click links: When expanding the SGE snippet, the number of links increased. Our data showed that the largest number of post-click links within an SGE snippet was 144, while the typical number of post-click links was 8. Here is a pie graph showing the most frequent number of post-click links in an SGE snippet: Google aims to balance the number of links within SGE responses. Having too many links could overwhelm users, but having very few of them won’t provide enough context. This explains why 8 post-click links appeared most often. We can assume that Google doesn’t want SGE snippets to feel spammy. At the same time, having 8 links to different websites in SGE snippets, coupled with ads and other SERP features, amount to a lot of content grabbing user attention before organic results (which are located lower on the SERP). For SEO specialists and website owners, this can lead to lower CTRs for their sites. Do SGE snippets contain links to domains from the TOP 10 of organic search results? We also checked to see if Google references high-ranking domains in its SGE responses. Out of the 18,455 checks (SERPs containing an SGE answer with text), we detected: 15,786 cases (85.5%) where the SGE snippets linked to at least one domain from the top 10 organic results. 2,669 cases (14.5%) where the SGE snippets had no overlap with the top organic domains. Below is a pie graph showing links to the top 10 ranking domains in SGE snippets: In our next research study, we plan to explore in more detail how SGE snippets overlap with organic results. We’ll try to find out how many of the websites linked by SGE snippets are also at the top of the organic search. Meanwhile, we also investigated the intersection between links within SGE snippets with texts (15,786 cases) and URLs from the regular organic results. Our focus was on determining how frequently these AI-powered responses linked to URLs from the organic search results across various niches. The data shows that the News and Politics niche leads with the highest overlap at 48.03%, while the Fashion and Beauty niche has the lowest overlap at 10.35%. The bar chart below shows a detailed breakdown of all niches: Here are some examples. For the search query, how do AI algorithms work, from the Technology niche, we saw an SGE snippet containing links to blogs from HubSpot and Rock Content, as well as a Tableau data insights page. You can see these URLs in the organic search results below the SGE snippet. We saw a similar situation when checking the SERP for the first home buyer homes for sale search query from the Real Estate niche: But, for example, the search query hand positions for meditation from the Self-Care and Wellness niche triggered an SGE snippet that didn’t contain links to pages from the search results. We see that Google tends to refer to the top organic results when selecting links to include in SGE snippets. As for the overall intersection of SGE snippet links with URLs from organic search results, some niches (News and Politics, Real Estate, Insurance) share many of the same links. For SEO professionals, these results show that even if the user doesn’t go to the regular search results, there is still a chance of driving traffic to your website if it ranks at the top. So, don’t underestimate how important it is to monitor your website positions. In addition, Google keeps its generated snippets trustworthy by linking to the same high-ranking domains that users would see in organic results. Which sites are included in SGE snippets? Our data indicates that the websites featured in SGE snippets are usually high-traffic, reputable resources with a wide focus. Here are the top 5 linked websites, as identified by our research: Quora.com, which was linked 3,701 times Local.google.com, which was linked 2,356 times En.wikipedia.org, which was linked 2,124 times Investopedia.com, which was linked 1,636 times Linkedin.com, which was linked 1,244 times Below is a bar chart showing the websites that are most often linked to in SGE snippets: The domains referred to in the SGE snippet all have a substantial online presence. This is evidenced by the large number of referring domains and keywords associated with them. We checked each of these domains using the SE Ranking platform and discovered that the range of their referring domains spans from approximately 2.5M to 52M, while the associated organic keywords vary from about 115M to 950M. Google favors authoritative, popular sites when picking links to add in SGE snippets. These sites come from different categories and are rarely niche-specific, although niche sites may still appear when closely matched to the query (Investopedia, Healthline). Forum sites like Quora and Reddit also appear in SGE snippets a lot. This is likely because forums contain discussions that help answer queries and first-hand experiences on specific topics. Google also tends to include Google Maps links (local.google.com) to SGE snippets when generating responses to local search queries. SEO specialists should be aware that small websites will have a difficult time appearing in SGE snippets. Based on the linked sites’ referring domains and keywords, Google mainly picks authoritative sites with millions of backlinks and keywords. Which niches are more likely to get an SGE response? We investigated 20 different niches, each of which was represented by approximately 5,000 keywords. This assisted us in determining which niches are most (and least) likely to get an SGE snippet in search results. Below is a graph displaying niches with the largest number of SGE responses: Keywords from the Food and Beverage category produced SGE snippets containing text in 1,662 of 5,000 cases, (or 33.2%), making it a leader in our research. The top 5 also includes such niches as: Business (27.2%) Relationships (25.9%) Ecommerce and Retail (25.7%) Fashion and Beauty (25.2%). Our study also highlighted certain niches that triggered much fewer SGE snippets: News and Politics: 5.34% Career and Jobs: 6.08% Insurance: 8.03% Finance: 11.84% Education: 13.72% Self-Care and Wellness: 13.74% Legal: 14.88% These niches typically require more careful fact-checking. These are Your Money or Your Life (YMYL) sites that deal with sensitive information. They can significantly impact a person’s life, health, or financial well-being. We also identified the most linked-to websites in SGE snippets by their niche: Business Website linkedin.com Link count 335 Career and Jobs Website indeed.com Link count 292 Cars Website local.google.com Link count 667 Ecommerce and Retail Website runnersworld.com Link count 370 Education Website quora.com Link count 176 Entertainment and Hobbies Website reddit.com Link count 544 Fashion and Beauty Website amazon.com Link count 306 Finance Website investopedia.com Link count 436 Food and Beverage Website healthline.com Link count 704 Healthcare Website healthcare.gov Link count 336 Insurance Website progressive.com Link count 95 Legal Website indeed.com Link count 291 News and Politics Website cnn.com Link count 211 Pets Website breedingbusiness.com Link count 424 Real Estate Website realtor.com Link count 440 Relationships Website quora.com Link count 708 Self-Care and Wellness Website en.wikipedia.org Link count 282 Sports and Exercise Website quora.com Link count 224 Technology Website simplilearn.com Link count 276 Travel Website quora.com Link count 506 Niche Website Link count Business linkedin.com 335 Career and Jobs indeed.com 292 Cars local.google.com 667 Ecommerce and Retail runnersworld.com 370 Education quora.com 176 Entertainment and Hobbies reddit.com 544 Fashion and Beauty amazon.com 306 Finance investopedia.com 436 Food and Beverage healthline.com 704 Healthcare healthcare.gov 336 Insurance progressive.com 95 Legal indeed.com 291 News and Politics cnn.com 211 Pets breedingbusiness.com 424 Real Estate realtor.com 440 Relationships quora.com 708 Self-Care and Wellness en.wikipedia.org 282 Sports and Exercise quora.com 224 Technology simplilearn.com 276 Travel quora.com 506 Check out the top 10 websites in each niche based on link count in this file. Niches that get the most SGE snippets are casual, everyday topics with extensive content. These subjects typically present less ambiguity and allow AI to generate satisfying answers to search queries. This means that website owners and SEO specialists whose websites fall under Food and Beverage, Business, Relationships, and other niches should be prepared to lose more traffic. This change in Google’s search experience can also affect certain ecommerce metrics (including number of visitors, conversions, etc.). We have found that the ecommerce niche gets SGE snippets quite often. Google simultaneously takes extra care when generating content around sensitive or high-stakes topics. Compared to less risky niches like Food, Fashion, and Relationships, these topics need thorough fact-checking. Additionally, most of these niches contain sites categorized as YMYL. Does the number of words in a search query affect the appearance of an SGE snippet? Our data shows a correlation between the number of words in search queries and the appearance of SGE snippets with text. We categorized search queries based on the number of words they contained and then measured how often these queries triggered an SGE snippet with text. Here’s a breakdown of our findings: Single-word queries triggered an SGE snippet in 12.03% of cases. Even though the number of single-word queries in our analysis was low (374), we can say that short queries have a lower chance of getting AI-powered answers. Two-word queries had a rate of 15.25% (2,327 cases) out of 15,256 queries analyzed. Three-word queries triggered SGE snippets in 17.10% (5,513 out of 32,238 queries). Four-word queries continued the trend, with 18.31% (4,901 of 26,762 queries). Five-word queries had the SGE occurrence rate reach nearly 20% (2,895 out of 14,507 queries). Six-word queries resulted in SGE responses in 23.04% (1,496 cases). However, the number of six-word queries in our research (6,493) was much lower compared to the two-, three-, four-, and five-word queries. Seven-word queries had a rate of 27.53% (738 out of 2,681 seven-word queries). But again, the total number of such queries in our research was significantly lower. Eight-word queries led to SGE answers in 32.11% (341 queries) of cases. Similarly to the two previous points, the amount of eight-word search queries in our analysis was pretty low (1,062 queries). Nine-word queries triggered an SGE snippet in 31.82% (147 queries out of 462) of cases. Ten-word queries concluded the decrease pattern with a 29.21% (52 queries out of 178) occurrence rate. Below is a graph displaying how often search queries with different word counts triggered an SGE snippet (%): The data suggests a correlation between query length and the presence of SGE snippets, with long-tail keywords being more likely to generate AI-powered responses. The increased specificity and context from longer queries likely allow Google’s AI to generate more relevant and precise content. So, to compete for SGE snippets, content creators and SEO specialists should create in-depth texts that answer specific search queries. They should also optimize their content for multi-word queries. Do featured snippets appear along with SGE snippets? We analyzed how often featured snippets appeared alongside SGE snippets. When an SGE snippet with text was present, featured snippets appeared 23.03% of the time (4,251 times out of 18,455 cases). But this data doesn’t necessarily imply that featured snippets’ presence in search depends on the SGE snippets’ presence. To get the full picture, we must also examine instances where Google returned an error when trying to generate an SGE snippet, as well as cases where users were prompted to generate an SGE snippet themselves. This presents an avenue for future research. The presence of featured snippets alongside SGE snippets: Our research shows that featured snippets accompany almost a quarter of the queries that trigger SGE snippets with text. This provides users with multiple options to find answers on the search results page. We can say that Google combines different content formats to create an information-dense results page. Additionally, websites get more opportunities to be included in the featured snippet and drive traffic. Do ads appear along with SGE, and where? In our study, we examined Google ads and how they coexist with SGE snippets within SERPs. When examining instances where an SGE snippet with text was present (18,455), ads appeared 4,280 times (23.19%) at the top and 6,499 times (35.22%) at the bottom. There were also shopping ads that appeared in the form of carousels (as shown in the screenshot below) 2,660 times (14.41%). This means that in 5,016 instances (27.18%), no ad accompanied the SGE snippets with text. We also analyzed the types of ads and how they were combined with text-based SGE snippets: Both shopping ads and ads at the top of the SERP accompanied SGE responses in 1,018 cases. Shopping ads appeared alongside text-based SGE snippets in 2,660 cases. In 3,262 cases, only ads at the top of the SERP appeared alongside text-based SGE snippets. The graph below shows ads that appear alongside the SGE snippet: Carousel shopping ads can be positioned above, below, or in the sidebar of the SGE snippet. In the screenshot above, these ads appear beneath the AI-powered response to a search query. In our research, we also sought to identify the most popular location for shopping ads in the SGE SERP. The data from our analysis shows a clear preference for placing shopping ads above the SGE snippet: Shopping ads appeared above the SGE snippet 2,969 times (80.72%). In 502 cases (13.65%), shopping ads were placed below the SGE snippet. Shopping ads appeared in the sidebar 207 times (5.63%), making this placement the least common. The graph below displays where shopping ads appear in the SERP next to the SGE snippet: As for ad type distribution by niche, our research showed that some niches are more inclined towards certain ad types. This is natural because these niches sell products: The Fashion and Beauty niche leads in shopping-only ads with 801 cases and in shopping & top ads with 330 cases, but it has comparatively fewer top-only ads (53). Ecommerce and Retail also show a strong preference for shopping ads alone (800 cases) and shopping & top ads (239 cases), while top-only ads are rare (17 cases). The Pets niche exhibits a balanced mix with 394 cases of shopping-only ads, 219 cases where shopping & top ads coexist, and 186 cases of top-ads only. Niches like Cars, Business, Sports and Exercise, Healthcare, Education, and Real Estate are more likely to have top ads accompanying SGE snippets, with lower instances of either shopping-only ads or a combination of shopping and top ads. At the same time, niches of Insurance, Finance, Legal, Careers and Jobs, and News and Politics didn’t have shopping-only ads or shopping & top ads at all. The graph below shows different ad types that appear with SGE snippets by niche: Here are some of our conclusions based on the research data: Regardless of SGE snippet presence, ads appear more often at the bottom of search results. Ads at the top of the SERP accompany SGE snippets more often than shopping ads (carousels). Still, this depends on the niche and keyword type. Shopping ads (carousels) usually appear above the SGE snippet. Niches like Fashion and Beauty, and Ecommerce and Retail, are more likely to feature shopping ads. Be sure to use these insights to adjust your PPC campaigns and get the most out of your ads. Methodology We analyzed 100,013 keywords. This sample included different types of keywords: With varying search intents. With varying search volumes. With varying word counts (from single-word terms up to ten-word phrases). We chose approximately 5,000 keywords from each of the 20 niches listed below: Business Career and Jobs Cars Ecommerce and Retail Education Entertainment and Hobbies Fashion and Beauty Finance Food and Beverage Healthcare Insurance Legal News and Politics Pets Real Estate Relationships Self-Care and Wellness Sports and Exercise Technology Travel We used the SE Ranking platform to create website projects for each niche. We then ran our analysis while taking the following parameters into account: Search engine: Google Location: USA Region: New York, New York, United States Language: English (en) We used the Chrome browser on a PC running Ubuntu and logged into a Google account based in New York. The data collection was done as a one-time check on January 30, 2024. To maintain impartiality, we disabled any form of personalization on the accounts used for data collection. Wrapping Up The main takeaway here is that we really need to stay on top of things. Changes seem to be happening practically every day. This becomes extra clear when we compare these results to a previous study we did. When we ran our first round of SGE research back in late 2023, the results showed that only about 4% of keywords failed to trigger an SGE snippet. This time, 12.3% of keywords did not trigger an SGE response. There was also a big shift in the number of links included in SGE snippets per search. Back in 2023, it was around 28 links. 45% of those links appeared in the top 10 organic search results. Now, after expanding the SGE snippet, the most common number is 8 links, with 85.5% of them overlapping with the top organic results. While this study has shed some light on Google’s AI-powered responses, much remains uncertain. We’ll be keeping a close eye on SGE’s latest developments and do more research to stay up-to-date. You can also use SE Ranking to experiment with SGE tracking. In fact, the SGE snippet’s detection feature is now available in our Rank Tracker. Our team upgrades this tool whenever we notice new patterns in SGE responses, giving you tons of useful insights. Moreover, make sure to give our new AI Overviews Tracker a try. It tracks AI-generated snippets for your keywords, analyzes sources, collects saved SERP copies, and much more. Sign up for our free trial to explore these tools and get ready for GenAI search. Research SEO News SERP 2063 views Written by Yevheniia Khromova Yevheniia is a content marketer and copywriter at SE Ranking. She is a fan of SEO, digital marketing, and content creation. Yevheniia believes simplicity is key as it helps reduce the clutter in our heads and focus on what matters. This is the principle she uses in her writing. She also enjoys cooking, learning new spices and flavors, traveling, and playing board games.",
  "headers": [
    {
      "level": "H1",
      "text": "SGE Snippet Research: We Analyzed 100K Keywords to See Google’s AI in Action"
    },
    {
      "level": "H1",
      "text": "TL;DR:"
    },
    {
      "level": "H2",
      "text": "How often do SGE responses appear in search?"
    },
    {
      "level": "H2",
      "text": "What is the average length of the text in SGE answers?"
    },
    {
      "level": "H2",
      "text": "How many links do SGE snippets contain?"
    },
    {
      "level": "H2",
      "text": "Do SGE snippets contain links to domains from the TOP 10 of organic search results?"
    },
    {
      "level": "H2",
      "text": "Which sites are included in SGE snippets?"
    },
    {
      "level": "H2",
      "text": "Which niches are more likely to get an SGE response?"
    },
    {
      "level": "H2",
      "text": "Does the number of words in a search query affect the appearance of an SGE snippet?"
    },
    {
      "level": "H2",
      "text": "Do featured snippets appear along with SGE snippets?"
    },
    {
      "level": "H2",
      "text": "Do ads appear along with SGE, and where?"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H2",
      "text": "Wrapping Up"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yevheniia Khromova"
}