{
  "url": "https://seranking.com/blog/title-tags-and-meta-descriptions-in-seo/",
  "slug": "title-tags-and-meta-descriptions-in-seo",
  "title": "Meta Title and Meta Description for SEO: Complete Guide",
  "description": "Find out what a meta title and meta description are and how they affect SEO in our guide. Learn how to write them correctly and avoid typical mistakes.",
  "content": "Blog / Technical SEO / How Title and Meta Description Tags Help in SEOHow Title and Meta Description Tags Help in SEO Written by Andrew Zarudnyi Reviewed by Anastasia Kotsiubynska Jun 24, 2022 22 min read The title tag and meta description are basic but core elements of SEO. And because Google tends to use meta tag content to generate snippets, they can have a direct impact on a searcher’s decision to click through to your website. But if you think that you can simply write anything you want in your pages’ metadata and search engines will display it word for word in the SERPs, you’ve got another thing coming. Search engines can pull any text from your web pages because they might think it’s more relevant and display that text in the snippet instead. However, there are certain rules that will help you make the most of your tags when it comes to promoting your website. Similar to a business card, title tags and meta descriptions store data on the content of your pages, and when the time’s right, share that information with both search engines and people. And if you want to please both of them, you simply can’t ignore title and description tags. Let’s take a look at why metadata is important in SEO and how to use it correctly. AI Overviews Study by SE RankingDownload our findings to learn how AIOs have changed after rollout and sign up to SE Ranking’s news and SEO tips digests!Next step You’re all set!Click the link we sent you in the email to confirm your emailand get AI Overviews Research by SE Ranking What is a title tag? The title tag is an HTML element that summarizes the main idea of a web page and is displayed in the SERPs as well as in browser tabs. It can also be referred to as the meta title, title tag, or SEO title. The title tag is also often mistakenly classified as a meta tag, but it technically isn’t the one. For convenience, we’ll still refer to this as the “meta title.” It is wrapped into the <title> tags and always goes inside the <head> element of a page’s HTML code. Here is how it looks in the code: <title>Your SEO title</title> Why the title tag is important for SEO The title tag lets search engine robots know what your page is about and helps them understand how relevant it is to the user’s search query. So, a meta title tag is an important on-page SEO element and you should optimize it for your focus keyword. It can help you improve your rankings for the keyword you use in your title (and for the cluster around the keyword as well). If you don’t yet track your website rankings regularly, make sure to set up automatic position tracking with the help of the Keyword Rank Checker. Moreover, as Google states, “​​one of the primary ways people determine which search results might be relevant to their query is by reviewing the titles of listed web pages.” So searchers can see the HTML title tag right in the SERP as the title of the snippet. Another place where you can find the meta title is the text you see in your browser tabs. Even if you have multiple tabs open, you’ll still be able to see the beginning of the title tag. You can see the full title by hovering over a tab. The third and final place where the meta title can be found is on social media when you publish a post and link out to the original web page. The title you indicate in the article will be pulled into the social media post by default. But if you want to display another title on social media, you can change it via the Yoast SEO plugin for WordPress. As you can see, the title tag appears as the title of a web page in search engines and on social media, and as searchers, we tend to look at it before clicking through in order to understand whether or not the page answers our search query and intent. Meanwhile, the title tag is an important indicator for search engines that tells them what your page is about and what its relevance is. For this reason, it’s crucial that you know how to write title tags for SEO, as in know how to optimize your page for search engines, and drive the maximum amount of organic traffic to it. 6 rules to writing the perfect page title 1. Each page must have a unique title If several of your website’s pages have the same title tag, both search engines and searchers will be confused. Think about it: if you write the same title tag for several of your web pages that cover different topics—they could be around the same topic, but answer different questions—searchers won’t be able to tell them apart and decide which one is relevant to their specific search intent. In such cases, Google will probably display a different title in the SERP by pulling a piece of text from your content that it thinks is more relevant to the searcher’s query. But the text that the search giant, or any other search engine, pulls may not be attractive enough to get people to click through to your web page. 2. The title must accurately describe what the page is about If you have a web page that talks about a restaurant that delivers food across New York, don’t write something like “How to bake a cake at home” in the title tag. The title should concisely and accurately reveal the main topic of the page. Remember that search engines are all about providing searchers with content that is relevant to their search intent. As a rule of thumb, write for people because they are the ones who pay most attention to the title to see if it offers a solution to their problem. 3. Keep your titles under 60 characters Lengthy titles are truncated by search engines to about 50-60 characters, which adds up to 600 pixels—the width of the title in the SERP. This is why it’s better to take this limit into account when creating the title tag. Otherwise, searchers may see an incomplete title. So, if you want to be smart about it, create concise titles for your pages and use the available title tag length to your advantage. 4. Put the main keyword at the beginning of the title While you need to make sure your title is readable and click-worthy, there’s a rule that many SEOs have agreed on: The closer the keyword is to the beginning of the title tag, the more weight it has with search engines. Here are some examples of such titles: Cropped Blue Jeans for Women: Skinny, Flared & More [“cropped blue jeans”] CBD Oil: All the Rage, But Is It Safe & Effective? – WebMD [“cbd oil”] Freelance Writing: How to Start and Build a Successful Career [“freelance writing”] And when you check out the top 10 results in highly competitive niches, you’ll probably see this rule applied to the majority of websites there. For instance, here you can see that 5 websites that are ranking among the top 10 search results for “freelance writing”—a highly competitive search term—use the keyword at the beginning, and two more websites use it in the middle. There is also a good trick to getting the most out of your title: place two keywords—primary and secondary—into your title (especially, if they don’t overlap in words). Here are some examples: Best CBD Oil | Shop Cannabidiol Oil [“best cbd oil”, “cannabidiol oil”] Carpet Cleaning Services | Boston Cleaners | Rugs, Couches [“carpet cleaning services”, “boston cleaners”] By the way, if you are not sure what keywords to focus on and use in your title, our Keyword Search Tool will help you out. Go to the Keyword Research module, enter a seed keyword, and choose the needed location. The tool will generate a list of keywords you can choose from (remember the rule: relevancy, high search volume, low difficulty). DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Finally, you can place the brand name at the end of the page’s meta title if you still have characters left. But don’t add your brand term as a rule. In most cases, your website will already be visible in the search for your brand name. For example, “Best House Cleaning, Home Cleaning in Boston | Handy” In this example, you can see that the title, consisting of only 52 characters, includes two keywords (“Best House Cleaning” + “Home Cleaning in Boston”), and a brand name at the end. By the way, many CMS automatically generate titles based on templates, like “page title” + brand name. Keep in mind that in some cases, Google may automatically add the brand name to the page’s meta title, provided that the title itself consists of only 2-5 words and there’s enough room left to add the name of the site or company. It’s also worth checking if the promoted brand is being searched for in other countries, like China or Bulgaria, for example. If you see that such search queries have a high search volume, include the transliterated brand name in the title too. 5. If your price or quality is a competitive advantage, add it to the title If you’re creating a title for a page with a commercial intent, such as Gifts under $20 or Free deliveries across Los Angeles, it’s wise to add this information to the page’s SEO meta title to stand out in the SERP and get more people to click on your advantageous offer. Here is another example of a good title: House Cleaning Service Boston, MA. Free Estimate | The Maids It includes the focus keyword at the beginning (“house cleaning service boston”) and their benefit—”free estimate”. So, this is good for both SEO and for improving your CTR. 6. If you’re working with huge websites, create templates If you’re running or managing an online store, you can automatically add the name of products and their distinct characteristics like color, model and so on to the page’s SEO meta title. But it’s important to point out here that Google recommends to write informative and descriptive titles and avoid using terms that don’t add any real value. That being said, sometimes search engines may not use your HTML title in the snippet at all. In August 2021, the SEO community started actively discussing that Google had been replacing the title tag with H1 (but other elements can be used as well). This was the result of Google trying to improve the relevancy of the titles shown in the SERP. For example, this page has the title tag “Manhattan Real Estate &amp; Apartments For Sale” but Google shows its H1 in the SERP while also appending the brand name at the end. According to Google, “When we know the user’s query, we can often find an alternative text from a page that better explains why that result is relevant. Using this alternative text as a title helps the user, and it also can help your site.” Let’s look at several reason why this can happen: Your title does not answer the search query. For example, when internet surfers enter a search query with a low search volume, the search engine can decide to select another piece of text from the page that more closely matches the intent; Your HTML title tag is missing or search engine robots were unable to crawl your page and were forced to use the information provided by anchor texts from the backlinks that link out to your page; The meta tag title is spammed with keywords; Your HTML title tag is too long; Your title tags contain huge repetitive text parts or generally are the same across the website. However, Google said that still over 80% of pages shown in SERPs will retain their original HTML title tag. So, if you’re in the 20% and Google has replaced your original meta title tag, your title probably should be rewritten. But if you get your page’s meta tag title right, your optimization work doesn’t stop there. Next up is the meta description tag that helps users learn more about your page right there in the SERP. What is a meta description tag? The meta description tag or SEO description is an HTML tag that, like the meta title, provides brief information about a page. Its main purpose is to let users know what the page is about and entice them to click through from the SERP to your site. It always goes inside the <head> element of a page’s HTML code and starts with <meta name=”description” tag. Here is what your meta tag description looks like in the HTML code: <meta name=”description” content=”Your discription.”/> What is the role of the meta description? More than a decade ago, Google said that they can use the meta description tag to generate a description of a page that will be featured in the snippet, but they certainly don’t use it to rank pages. Not much has changed since then. But since the description can increase the click-through rate of the SERP snippet, it does have an indirect effect on page rankings. The descriptive text you find in snippets right under the title is the meta description tag: Google tends to take the text for the snippet description from the HTML meta description tag itself, but if the latter turns out to be uninformative, just as the case is with the title tag, the search engine can also use content from your page to generate a snippet. To prevent Google from pulling text from your page to generate a description, use the data-nosnippet HTML attribute. You can also limit the length of the snippet using the max-snippet:[number] tag. You can learn more about these tags from Google’s official guide. So, what exactly do you need to know to create a quality meta description tag and help it take its rightful place in the featured snippet? 8 rules to writing the perfect meta description tag 1. Each page must have a unique meta description tag By doing so, you get the opportunity to put forward the text you want to be displayed in the snippet description and influence the snippet’s click-through rate. Otherwise, search engines will take a piece of the page’s content that they think is more relevant to the search query and use it in the snippet instead. 2. Keep your meta description length under 155 characters Google will truncate the meta description tag if it goes over 155 characters in most cases, so there’s no point in creating extensively long description tags that searchers won’t even get to fully read. 3. Concisely describe what the page is about in 1-3 sentences The information provided in the meta description tag should supplement what was said in the title tag. The main purpose of the description tag is to advertise your content and convince users to click the link in the SERP and go to your website. This is where you can get creative with your CTAs and write attention-grabbing copy. Just keep in mind that the SEO meta description should be concise and clear so that everyone can understand what information they will get by going to your page. 4. Put your head keywords into the description tag (but don’t go overboard) As with the title, it’s good practice to add keywords to the meta tag but try not to use the same ones. It would be best if you could use long-tail variations of your focus keyword in your meta descriptions. Moreover, if your page meta description tags contain keywords that answer the searcher’s intent and query, they may be highlighted in the SERPs. When this happens, searcher attention automatically gets pulled toward the highlighted keywords, letting them know that they’ve found what they were looking for. SE Ranking’s Keyword Grouper tool lets you know what keywords Google will highlight for any search query you’re interested in. This gives you data that you can use to your advantage when writing SEO meta description tags. 5. Add your business phone number and other useful data to the description If your website offers emergency services, like towing and locksmith services, you can specify the business phone number and price right in the description tag. That way, searchers can immediately get the information they need and reach out to you. You can also specify where you provide your services to show more relevant information that corresponds to the searcher’s query, and as a result, increase the clickability of the snippet—provided that the region where you provide your services is relevant for the searcher. On top of that, you can include important product information, such as manufacturer, characteristics, and specifications—basically, give people all the data they need to make a purchase decision in your favor. 6. Create templates If your site has a lot of pages and it’s rather difficult to manually enter descriptions for each one, create description templates. You can add templates to your site’s pages with the help of a coder or use plugins for popular CMSs. 7. Use emojis wisely Emojis can be a great way of bringing emotion and some fun into your snippets but under certain conditions. Google displays only those emojis in the SERPs that it finds relevant to the search query, blocking those that deceive searchers and look spammy. Keep in mind that in most cases emojis won’t be blocked if they are used in the meta description tag, not in the title tag. Here you can find emojis to use in your metadata. So, descriptions really can attract the attention of potential users in the SERPs, which is why you simply can’t afford to ignore them. Now that we’ve covered page title and description tags, let’s take a look at how to add them to your web pages and check up on them. 8. Add a CTA A call to action (CTA) instructs your reader to take a specific action, such as buying something, calling your company, signing up for service, etc. It usually starts with a verb, explaining what users need to do next. Here’s an example of meta description without CTA: “Wide range of gardening tools for beginners and experienced gardeners. Everything your gardening project needs in a single store with free delivery.” And this is what it looks like with one: “Discover our extensive collection of gardening tools, perfect for all skill levels. Browse now to start your gardening journey and get free delivery!” The last option looks shorter, straightforward, and persuasive. How to add meta title and meta description on your site Many CMS don’t give you the option to add meta tags via the admin panel. For this reason, you have to install special plugins, such as Yoast SEO for WordPress and Easy Frontend SEO for Joomla. For example, if you have the Yoast SEO plugin installed and activated, go to the page, scroll down and find this section to add your meta title and description tags. Yoast SEO also allows users to add title and description tags in bulk by creating templates based on a page type. For this, go to SEO from the left sidebar menu, and click on Search Appearance. Here you can use variables to generate meta tags en masse. For example, in the screenshot below, you will have the same title and description template for all WordPress author pages with a unique element: H1 of a page (Name here). So, with the templates, you won’t have to write unique meta tags for each page but you do get unique titles and descriptions as a result. If your CMS doesn’t give you the possibility to add meta tags by default, or if for some reason you cannot install the required plugin, you can open the PHP file of the necessary page via an FTP client and add metadata to it. How to check the meta title and description I want to point out that many websites have issues with meta tags. Some time ago, we analyzed 40,000 sites to find out which issues are hindering their promotion efforts and here’s what we found. 71.11% of the analyzed websites had an empty or missing meta description tag, slightly more than 50% had duplicate descriptions, and 64.6% had duplicate titles. So, if you’re not sure that your website’s meta tags are in order, check all of your pages using SE Ranking and review the website audit report. In just a few minutes, the tool will scan all your site’s pages—including subdomains—and will check your meta tags in the process. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze Under Issue Report, you will see a long list of checks broken down into categories. What you want to look at here are the Title, Description, and Textual Content (Identical Title and H1 tags issue) sections. They’ll point out pages that don’t have meta tags, have duplicate titles and descriptions, or have tags that are too short and too long. Next to each issue, you’ll find a list of all web pages where the given issue was found. Before doing website audit, you can manually set the optimal length for your page title and description tags. Go to Settings, choose Report Setup, and specify relevant parameters. Moreover, you’re at liberty to schedule automatic checks to get regular reports sent right to your inbox. That way, you’ll be able to stay on top of your site’s meta tags, among other things. Meanwhile, with our On-Page SEO Analyzer, you can also determine how your page is optimized compared to your main competitors and get a list of on-page SEO steps to take to outrank them in SERPs. Enter a URL, focus keywords, choose a location, and press Run audit. After it’s finished, you will see possible issues with your title and description meta tags and learn how to optimize them for your keywords. And if you have a specific page in mind, visit the Title and Meta Description Checker to ensure its meta tags are optimized for the target keyword and fall within the acceptable length for accurate display on SERPs. So, sign up for a free 14-day trial today and start getting all of your website’s meta tags in order. Closing thoughts If you plan on taking your search engine optimization efforts seriously, you need to keep two big things related to meta tags in mind. First, each page must have its own unique meta title and meta description tag. This is not an option, but a necessity! And second, write meta tags not for search robots, but for people who will potentially visit your website. Think about it this way: you only have about 10 seconds to convince searchers to click through to your page and not on that of a competitor. That’s where your meta tags come into play as searchers only see your page title and description in the SERP and have to make a call judging by the text they see. Now you know everything there is to know about meta tags and will be able to avoid making mistakes that prevent you from acquiring organic traffic for the search results. If you’ve had success using other advice and tips on setting up your metadata, share your experience in the comments section below. And if you’re ready to move one step further, learn about other HTML tags that matter for SEO. HTML Tags On-Page SEO 77191 views Written by Andrew Zarudnyi Andrew is a content marketer, writer, editor, and webinar host at SE Ranking, plus a guest contributor across various marketing media. He is passionate about content, marketing, social media, and SEO best practices and leverages his experience to help companies reach their global audiences more effectively. When he’s not writing about SEO and marketing, he can be found spending time with his cat, enjoying a video game, watching too much soccer or playing the guitar (in that order).",
  "headers": [
    {
      "level": "H1",
      "text": "How Title and Meta Description Tags Help in SEO"
    },
    {
      "level": "H2",
      "text": "What is a title tag?"
    },
    {
      "level": "H2",
      "text": "Why the title tag is important for SEO"
    },
    {
      "level": "H2",
      "text": "6 rules to writing the perfect page title"
    },
    {
      "level": "H3",
      "text": "1. Each page must have a unique title"
    },
    {
      "level": "H3",
      "text": "2. The title must accurately describe what the page is about"
    },
    {
      "level": "H3",
      "text": "3. Keep your titles under 60 characters"
    },
    {
      "level": "H3",
      "text": "4. Put the main keyword at the beginning of the title"
    },
    {
      "level": "H3",
      "text": "5. If your price or quality is a competitive advantage, add it to the title"
    },
    {
      "level": "H3",
      "text": "6. If you’re working with huge websites, create templates"
    },
    {
      "level": "H2",
      "text": "What is a meta description tag?"
    },
    {
      "level": "H2",
      "text": "What is the role of the meta description?"
    },
    {
      "level": "H2",
      "text": "8 rules to writing the perfect meta description tag"
    },
    {
      "level": "H3",
      "text": "1. Each page must have a unique meta description tag"
    },
    {
      "level": "H3",
      "text": "2. Keep your meta description length under 155 characters"
    },
    {
      "level": "H3",
      "text": "3. Concisely describe what the page is about in 1-3 sentences"
    },
    {
      "level": "H3",
      "text": "4. Put your head keywords into the description tag (but don’t go overboard)"
    },
    {
      "level": "H3",
      "text": "5. Add your business phone number and other useful data to the description"
    },
    {
      "level": "H3",
      "text": "6. Create templates"
    },
    {
      "level": "H3",
      "text": "7. Use emojis wisely"
    },
    {
      "level": "H3",
      "text": "8. Add a CTA"
    },
    {
      "level": "H2",
      "text": "How to add meta title and meta description on your site"
    },
    {
      "level": "H2",
      "text": "How to check the meta title and description"
    },
    {
      "level": "H2",
      "text": "Closing thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Andrew Zarudnyi"
}