{
  "url": "https://seranking.com/blog/top-spanish-ecommerce-websites-market-study/",
  "slug": "top-spanish-ecommerce-websites-market-study",
  "title": "Top Spanish eCommerce Websites Market Study",
  "description": "Learn what most of the Spanish top-raking ecommerce sites have in common and build your own strategy with regard to major ranking factors",
  "content": "Blog / SEO Industry News / Most prominent ranking factors of TOP ecommerce websites in SpainMost prominent ranking factors of TOP ecommerce websites in Spain Written by Svetlana Shchehel Mar 30, 2022 13 min read The study was conducted in cooperation with Sock Data marketing agency The objective of this study was to single out the most relevant SEO factors of the TOP ecommerce sites that enjoy good positioning in Google Spain. We have selected the largest top-ranking websites belonging to some of the most relevant industries such as: Children Sports Feeding Computer/Electronics Home Fashion Perfumery/Makeup Health Books Jewels Flowers Sex shops The data shown in the study was obtained with the help of SE Ranking tools and direct research of the selected ecommerce sites. Check out the infographics for major insights, and keep reading to get into the details. Domain-related factors HTTPS protocol 100% of the analyzed ecommerce sites have an SSL certificate and a domain indexed in Google with HTTPS. At first glance, we assumed that having an HTTPS protocol is an important factor in terms of SEO for these websites. We can conclude that it is unfeasible to have an online store with an “UNSAFE SITE” message. Domain type Among the websites we have studied, we have divided those that use a regional domain—in this case a “.es,” and those not using a regional domain. We have chosen the top ecommerce sites in the sectors studied, and we’ve figured out that 58% of these sites run on a regional domain. However, this does not mean that 58% of all e-commerce stores in Spain have an “.es” domain—the conclusions are only applicable to the sectors studied. Based on the data, we can assume that it is beneficial to have a website 100% dedicated to the target country. At the same time, we must not lose sight of global domains, as they also represent a large share of the studied top-ranking ecommerce sites. Content-related factors Wordcount The most important pages of an ecommerce site at an SEO level are the home page, category pages (subcategories included), and product pages. These pages are supposed to rank for most of the site’s target transactional keywords—or at least the vast majority of such keywords. The goal was to calculate the average wordcount for each type of page at the content level, disregarding internal links, HTML code, etc. The result are as follows: Home page’s wordcount reaches about 300 words Category pages’ wordcount is at least 450 words Product pages’ wordcount is about 180 words on average It is worth noting that some of the analyzed websites had significantly higher wordcount and the numbers indicated above are average. The conclusion we’ve reached is that the home pages of some of the analyzed e-commerce stores did not have excessive content because they were not targeting transactional keywords with their homepages. Instead, they focused mostly on attracting brand traffic. Category pages, however, featured more content, as they were targeting larger groups of keywords and therefore used this content to introduce more keyword variations. Except for a few specific websites, there was not much content on the product pages. The reason is that producing long-form content for thousands of product pages of a large e-commerce store is rather challenging. It also makes more sense to work with categories and subcategories to attract higher volumes of traffic and gain more profit. At the same time, it is still possible to make your product pages rank for high-volume keywords. Number of keywords on a page In this study, we wanted to check the number of times the most important keywords were used on a page to measure the keyword density. The result we obtained was an average density of 2.4%. 94% of the analyzed ecommerce sites had keyword density of less than 3%. Therefore, we concluded that the studied pages were not over-optimized at the page level. Keywords in relevant areas It is important to know which areas of a page Google gives more relevance—then you can place your most important keywords within these areas. In this study, we have analyzed how the selected websites use keywords in their title tags, description meta tags, H1 tag, and other H tags, within main text content and images. We obtained the following results: Meta title: 100% of the ecommerce stores in the study comprised target keywords in meta titles. Meta description: 80% of the ecommerce sites in the study mentioned keywords in meta descriptions. H1: 80% of the ecommerce companies in the study featured target keywords in their H1 tags. Other H tags: 87% of the ecommerce companies in the study used H tags other than H1 to showcase important keywords. Main text content: 60% of the e-commerce companies in the study placed keywords within the pages’ text content. Images: 56% of the e-commerce companies in the study used images to showcase important keywords. With these data, we can conclude: All SEO specialists stick to the rule that the page’s title tag should feature the most relevant keywords Most e-commerce store add their target keywords to meta descriptions; however, not all of them. The H1 is optimized by a vast majority of large ecommerce companies, although there are some who are not using it to place target keywords. Adding keywords to other H tags is also a common strategy. Using target keywords within the page’s main content isn’t a universal practice. Many websites don’t optimize product descriptions given that the page’s title, description, and H tags feature all the necessary keywords. Even more websites tend to not use keywords as images’ alt tags. Paid advertising Next, we decided to check if the selected ecommerce stores were investing in Google’s paid advertising. 90% of the ecommerce companies in the study used PPC to drive traffic to the websites. The average number of keywords sites were targeting in their ads reached 41,684 queries—most of the analyzed ecommerce stores were bidding on a large number of keywords. These efforts allow the ecommerce stores to not only boost sales, but also to increase brand searches and visibility on Google. Factors related to keyword positions and traffic Number of keywords a site ranks for In this study, we wanted to measure the number of keywords the selected top ecommerce sites ranked for. The average number was 1,300,000 keywords. The site with the smallest amount of keywords under its belt ranked for more than 30,000 queries, while the largest websites ranked for millions of keywords. We can conclude that large ecommerce stores end up ranking for large amounts of keywords, which was to be expected with regard to the number of categories, subcategories, and products these sites featured. In this study, we have also reviewed the number of indexed URLs, verifying that the number of keywords each site ranked for exceeded the number of its indexed URLs. Keywords’ topic relevance We have also checked if the keywords a site ranked for were related to its major topic, or if large groups of keywords covered other topics. We can confirm that the keywords the analyzed ecommerce sites ranked for were all relevant to the website’s niche. This proves that having an “expert” website in a niche sends positive signals to Google. Stable traffic growth Knowing how traffic is growing with the number of keywords the site ranks for helps you measure its SEO growth. We have studied the correlation for the selected ecommerce stores. The result: 75% of the ecommerce sites in the study demonstrate a stable growth of both traffic and keywords they rank for. The remaining 25% are not growing or are experiencing a slight loss in traffic and positions. With this, we can conclude that it is important for a project to evolve in terms of traffic and the number of keywords. This shows Google that the site is supported and that the project is still alive. Site running a blog Of all the ecommerce websites in the study, 65% have a blog, and of that 65%, 40% have the blog on a subdomain. On average, blogs account for about 8% of sites’ global traffic. However, different sites in our study demonstrated very diverse data where some ecommerce stores would get less than 1% of traffic from their blog, and others would gain more than 40% from blog articles. Therefore, although the blog is not a deciding factor for large ecommerce sites—since many groups of keywords are targeted on category, subcategory, and product pages—a well-established blog can also drive plenty of traffic to such websites. Factors related to Link Building Total number of referring domains Link building is an essential part of any SEO strategy, and we could not but include respective data in our study. We have figured out that, on average, the analyzed ecommerce sites had 13,000 referring domains. Ecommerce sites with the smallest backlink profiles had around 400 referring domains, and those with the biggest amount of backlinks boasted around 50,000 referring domains on average. We can conclude that the number of referring domains is an important ranking factor for large ecommerce websites. Total number of backlinks In addition to checking the number of referring domains, it is important to measure the total number of backlinks a site has. On average, the studied ecommerce sites had about 4 million backlinks. With the average number of referring domains being 13,000, and the average number of backlinks being 4 million, the analyzed ecommerce site had thousands of mentions on the same referring domains. Total number of dofollow backlinks Dofollow/nofollow backlinks ratio is another major factor to track. The analyzed sites had on average 84% of dofollow backlinks. At the same time, some of the selected ecommerce sites had only 40% of dofollow links while others boasted a 96% to 4% dofollow/nofollow ratio. We can conclude that for ecommerce sites, it is important to also have a large portion of dofollow links in the backlink profile. Total number of referral IPs Another factor we have studied is the amount of referral IPs of the backlinks e-commerce sites had. On average, we have spotted 3,700 referral IPs per backlink profile. With 13,000 referring domains on average, we can conclude that only 28% of the referring domains of the analyzed websites had different IP addresses. Therefore, we can conclude that there is no problem in having a large number of backlinks from repeated IPs, at least on this large scale, where having repeated reference IPs is “diluted.” Variety of anchor texts 100% of the e-commerce sites we have studied demonstrate a wide variety of anchor texts in their backlink profiles. Therefore, we can summarize that using various anchor texts works well for SEO, and it makes a site’s backlink profile look natural. As a rule, every person would link to your site differently; people don’t normally use the same texts when expressing their opinion. Backlinks with branded anchor text On average, 59% of all the anchor text we’ve singled out in the websites’ backlink profiles were branded. Backlinks with branded anchor texts pointed both to sites’ home pages and other pages. Some of the analyzed ecommerce sites had fewer backlinks with branded anchor text while others demonstrate bigger numbers; still, the vast majority of sites had a significant percentage of branded anchor texts in their backlink profiles. We can conclude that most of the backlinks pointing to a website should have branded anchor texts—this is to be taken into account when crafting a link-building strategy. Again, such a distribution is foreseen, since many people will naturally link to a site using its brand name variation. Backlinks with exact-match anchor text Something that we have also studied is the use of exact-match keywords as anchor texts. For this, we have studied websites areas that normally feature the site’s target keywords. We have figured out that, on average, 17% of all anchor texts site’s backlinks used were exact-match keywords. Some websites we studied didn’t use exact-match keywords at all, while others had up to 50% of exact-match anchor texts in their backlink profiles. We can conclude that gaining backlinks with exact-match anchor texts can send a positive ranking signal to Google, but such anchors should be used in moderation so that a site’s backlink profile still looks natural. Backlinks to the home page We wanted to pay special attention to ecommerce sites’ backlinks pointing to the home page. We’ve learned that 32% of the backlinks were pointing to the home page of the analyzed e-commerce stores. Some websites have only 8% of links pointing to the home page, and others have up to 50% of links leading to the home page, but as a general rule, most websites have a significant number of links pointing to the home page. This can be once again explained by natural link building—most of the organic backlinks normally lead to the home page. Stable backlink growth 95% of sites demonstrated stable backlink growth, and their backlink profiles keep scaling. As the popularity of your brand grows, your site should naturally get more backlinks from newspapers, forums, blogs, etc. Backlinks from newspapers 100% of the analyzed sites had at least some backlinks from newspapers. Large websites with recognized brands often get newspaper mentions naturally. Backlinks from sites in the same niche 44% of the selected sites had a significant number of backlinks from other websites in their own niche. We can conclude that having such links is a relatively important factor, but is not essential. Although links coming from websites that cover similar topics can be a powerful ranking signal, such links are hard to gain. Other types of backlinks 100% of the studied ecommerce site have backlinks from various forums, blogs, free sites, etc. Such links look absolutely natural. If a site is well-known among the general public, it will normally get mentions on various forums and blogs. Brand-related factors Brand searches The analyzed ecommerce sites get an average of 3 million brand searches per month. To achieve the most accurate result possible, we analyzed search volume for all brand variations. Websites offering more specific products get only 20,000 searches, while bigger sites offering popular goods get up to 12 million of brand searches monthly. This data proves that it is essential for any ecommerce site to work on brand awareness and thus secure a steady flow of bran traffic. Ranking Factors SEO Analytics 4274 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "Most prominent ranking factors of TOP ecommerce websites in Spain"
    },
    {
      "level": "H2",
      "text": "Domain-related factors"
    },
    {
      "level": "H3",
      "text": "HTTPS protocol"
    },
    {
      "level": "H3",
      "text": "Domain type"
    },
    {
      "level": "H2",
      "text": "Content-related factors"
    },
    {
      "level": "H3",
      "text": "Wordcount"
    },
    {
      "level": "H3",
      "text": "Number of keywords on a page"
    },
    {
      "level": "H3",
      "text": "Keywords in relevant areas"
    },
    {
      "level": "H3",
      "text": "Paid advertising"
    },
    {
      "level": "H2",
      "text": "Factors related to keyword positions and traffic"
    },
    {
      "level": "H3",
      "text": "Number of keywords a site ranks for"
    },
    {
      "level": "H3",
      "text": "Keywords’ topic relevance"
    },
    {
      "level": "H3",
      "text": "Stable traffic growth"
    },
    {
      "level": "H3",
      "text": "Site running a blog"
    },
    {
      "level": "H2",
      "text": "Factors related to Link Building"
    },
    {
      "level": "H3",
      "text": "Total number of referring domains"
    },
    {
      "level": "H3",
      "text": "Total number of backlinks"
    },
    {
      "level": "H3",
      "text": "Total number of dofollow backlinks"
    },
    {
      "level": "H3",
      "text": "Total number of referral IPs"
    },
    {
      "level": "H3",
      "text": "Variety of anchor texts"
    },
    {
      "level": "H3",
      "text": "Backlinks with branded anchor text"
    },
    {
      "level": "H3",
      "text": "Backlinks with exact-match anchor text"
    },
    {
      "level": "H3",
      "text": "Backlinks to the home page"
    },
    {
      "level": "H3",
      "text": "Stable backlink growth"
    },
    {
      "level": "H3",
      "text": "Backlinks from newspapers"
    },
    {
      "level": "H3",
      "text": "Backlinks from sites in the same niche"
    },
    {
      "level": "H3",
      "text": "Other types of backlinks"
    },
    {
      "level": "H2",
      "text": "Brand-related factors"
    },
    {
      "level": "H3",
      "text": "Brand searches"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Svetlana Shchehel"
}