{
  "url": "https://seranking.com/blog/us-database-expansion/",
  "slug": "us-database-expansion",
  "title": "SE Ranking Expanded Its US Database by 30%",
  "description": "Find even more quality keywords for various industries and get more precise data on website traffic, the number of its keywords, and ranking.",
  "content": "Blog / SE Ranking News / Major US Database Expansion: More Accurate Data & New Keyword OpportunitiesMajor US Database Expansion: More Accurate Data & New Keyword Opportunities Written by Svetlana Shchehel Apr 22, 2022 2 min read Providing users with the most precise and up-to-date information is one of SE Ranking’s core values. For the past years, we’ve been constantly expanding our existing databases and adding new locations to the list. In January, the number of our supported countries reached 190—we achieved our long-term goal of covering all locations across the world. In the last two months, we’ve been working on the major expansion of our US database. We’ve managed to grow it by 30%, and now we have 304mln keywords at your disposal. It is the largest database of keywords with traffic potential—we deliberately focused solely on up-to-date keywords that drive traffic as opposed to long-tail queries with zero search volume. As a result, you can find plenty of keywords no other tool in the market offers, both when analyzing competitors or looking for similar queries via Keyword Research. In the carousel, you can see Competitive Research reports vs other similar tools: We at SE Ranking do all the crawling and database management on our own—no third parties involved. This allows us to be confident about the data quality as well as to provide our customers with unique insights no other tools possess. Larger databases deliver more precise data And one more thing I want to stress before you proceed to test the updated tool. Bigger databases not only bring more keyword opportunities but also ensure data accuracy. It means you get more precise figures on any site’s performance: the amount of traffic it gets, the number of keywords it ranks for, its share of top-ranking keywords, etc. This in its turn means you can make calculated decisions when it comes to: Assessing how efficient your competitors are Evaluating the performance of a new client’s site Scoring a guest posting prospect Analyzing the SEO specifics of certain industry With SE Ranking, you can build data-driven strategies knowing you can trust every stat you see. 1607 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "Major US Database Expansion: More Accurate Data & New Keyword Opportunities"
    },
    {
      "level": "H2",
      "text": "Larger databases deliver more precise data"
    }
  ],
  "author": "Svetlana Shchehel"
}