{
  "url": "https://seranking.com/blog/verify-google-business/",
  "slug": "verify-google-business",
  "title": "How to verify your Google Business Profile in 2024",
  "description": "This guide explores all methods to verify your GBP, from receiving a postcard and phone call to using video recording and more.",
  "content": "Blog / Niche SEO / The ultimate list of methods for verifying your Google Business ProfileThe ultimate list of methods for verifying your Google Business Profile Written by Julia Torchynska Reviewed by Olena Karpova Sep 10, 2024 25 min read Key takeaways Verifying your Google Business Profile is essential for becoming visible and managing your business information on Google. It improves local search visibility and builds trust with potential customers. Google offers various methods for verifying your GBP, including postcard, phone, email, instant verification, bulk verification, live video call, video recording, and photo upload. It typically takes a few weeks for business information to appear on Google after verification. However, factors like verification method, business category, and Google’s workload can significantly impact this timeframe. If you encounter difficulties during verification, Google offers several support options, including a Verification Status Tool, Help Community, and support on X (Twitter). After verification, it’s important to monitor your GBP’s performance. Tools like SE Ranking’s Local Marketing Tool can help you track local rankings, manage reviews, and analyze local SEO performance effectively. What letter would you be happier to get: an acceptance letter from Hogwarts or a letter from Google? Everyone loves the wizard world, but if you’ve been waiting for your Google Business Profile verification code, chances are you’re more excited to see that nestled inside your envelope instead. Now, the process can seem pretty straightforward at first glance because Google will give you clear instructions on how to verify your listing. But after taking a closer look, you’ll see that there’s much more to it. Many people struggle to verify their listing due to various reasons, such as losing postcards, not receiving them at all, and missing obvious points, eventually struggling to find any solution. In this article, we’ll go over every possible way to verify your listing, look at all the hidden pitfalls that you may face in the process, and then show you where to seek help in case you experience any difficulties. Google AI Overviews Study by SE RankingDownload our free ebook with research findings and sign up to SE Ranking’s news and SEO tips digests!Next step You’re all set!Click the link we sent you in the email to confirm your emailand get AI Overviews Research by SE Ranking Why verifying your GBP listing is so important While a website might rank in the traditional SERP for local queries, it won’t appear in the Local Pack and on maps unless there is a verified GBP listing. Google has to confirm the physical location of your business and check whether you’re authorized to own a listing. Only after Google confirms your location can you do the following: Make changes to your business info across Google View listing stats called Insights Upload new photos Publish posts Respond to customer reviews GBP signals (including proximity, categories, keywords in business titles, etc.) are also important for determining Local Pack rankings. This is why taking control of the information included in your GBP profile is key. If you’re looking for a reliable way to track your website’s rankings down to the zip code level, consider using SE Ranking’s search engine position tool. Also, the platform’s Local Marketing Module lets you monitor and manage your business listings and provides insights into the performance of your Google Business Profile. We’ll describe this feature in more detail later on. Make sure to read all the way to the end if you don’t want to miss important details about this feature. Another reason why having a GBP listing is crucial is because, according to Google, verified businesses are twice as likely to be considered reputable by users. GBP profiles look more consistent and trustworthy when they’re optimized and edited by the actual owner. Finally, verifying your business can protect it from anyone trying to pose as a representative of it and claim the listing as their own. This is a basic example of fraud, so make sure you’re aware of such cases. Do verified GBP profiles look different? Only verified listings are visible in search results, so if you see a listing online, it’s likely been verified. Verified business owners will see a badge labeled You manage this Business Profile under their business name. Keep in mind that only the account manager of this verified profile, and only when logged into their account, can see this tick. Regular searchers who browse business profiles in search won’t see it. How to check if your listing is verified If you want to check the business that is associated with your own Google account, you can use a special tool from Google. Just sign in with your Google account and choose the business you want to check to see its verification status. Another way of checking GBP verification is to do it manually from the search results. If your business listing was created by someone else and you want to claim it as your own, using this method will be especially helpful. From here, you’ll need to Google the business’s name and take a look at their profile. You’ll have to claim it first, which you can do manually from the search results. Claiming an existing GBP listing 1. Click the “Own this business?” button. 2. Then click the “Manage now” button, as shown below. 3. At this stage, you’ll need to verify your business. There are 8 Google Business Profile verification methods, but the system chooses the most suitable verification approach for your company, and you can’t change it. For the business used in this example, Google has determined that mail verification is the most appropriate method. Who can claim or verify GBP listings? Anyone can initiate a claim for a GBP listing, but only the business’s true owner is authorized to verify it. This verification process requires the owner to provide essential documentation or evidence of ownership. If you’re not the business’s owner but would like to claim a listing, you’ll need to contact the owner directly and request their assistance in completing the verification process. Note! You can request ownership of a business listing even if it’s already verified by another person. Here is a detailed guide by Google on how to do it. The 8 ways to verify a Google Business Profile listing Google’s various business verification methods largely depend on the nature of the business and the area where its located. Google will select a list of options for each business that cannot be altered. Let’s analyze all the possible GBP verification options and see how they differ from one another. After registering or claiming a business, Google will offer you ways to verify it. The system will make its offer in one or several of the following ways. If you only get one option, you can’t change it, but if you see several of them, you can choose the way that works best for you. 1. Postcard This is the most frequently used way to verify a business. Postcards not only let Google know exactly where the business is located but that it does, in fact, exist. The delivery process typically takes up to two weeks depending on the region, but it can sometimes take longer. Keep in mind that the verification process will take much longer if you change your business information (business name, address, category, etc.) before it is verified. You should also avoid requesting a new code because Google will have to cancel the original code in the postcard and send a new one, thereby prolonging the process. It’s also important to note that Google won’t send any verification letters to PO boxes. So to get started with your postcard, fill in your business address and name, and hit the Post button. And of course, make sure your address is correct. Next, you will see a pop-up saying that your postcard is on its way: Once you have the postcard with a GBP verification code, log into your Google Business Profile, select the business you want to verify, and click “Verify now”. Finally, enter the code you received from Google into the appropriate field. GBP community members mentioned how frequently their first attempt to get a verification code was unsuccessful and that they were only able to succeed after the second or even third attempt. If your postcard is missing or got lost, you can request a new code by signing into your Google Business Profile, going to the verification code page and clicking the blue “Post again” link. Also, letters like these can often be mistaken for junk and get thrown away, so you might want to hold off on cutting the red tape and let everyone at your company (or even building) know that you’re waiting for the verification letter from Google. 2. Phone or SMS Some, but not all, businesses will have the option to verify their GBP listing by phone. If this option is available to you, consider yourself lucky, as this process only takes a few minutes. You can choose the calling option or have a text message sent to your phone. The system will send you a 5-digit code for you to enter into the code field. Use your actual phone number, as you will need it to directly answer calls (you can’t use Interactive Voice Response systems) or receive texts. The verification process on your phone consists of several simple steps: Open your Google Business Profile Click Get Verified Choose language Select the preferred verification method: Phone or SMS Answer the call or open the SMS to get the code Enter the code into your profile Unfortunately, the GBP community forum has several real life stories involving fraudulent calls made by people who claim to work at Google. Here is a guide from Google on how to identify suspicious calls. Keep in mind that during the verification call, Google will never: Charge you for any GBP listing-related services Ask for your passwords, verification codes or any other personal information Offer to improve your GBP listing During the verification call from an actual Google representative, you’ll only need to listen for your verification code and write it down for future use. 3. Email If your business is eligible, you’ll see the “Verify by email” option after beginning the GBP verification process. Before clicking “Verify now”, make sure that the email displayed on the verification screen is correct and that you have access to it. After that, open your inbox and find the email from your Google Business Profile. A verification code and a link to the GBP page where you can activate it are both included in it. 4. Instant verification Another great option that business owners can take advantage of is instant verification. Choose it if it is one of the suggested options because it lets you verify your listing in a flash. Why wait for a postcard when you don’t have to? According to Google, if your site has already been verified in Google Search Console, you can qualify for instant verification. This means you won’t see the “Get verified” button and can start working with clients on your profile and content right away. If you create your GBP profile first before adding your website to GSC, you’ll see the “Get verified” button. It may instantly verify your profile once you click on it. Keep in mind that using GSC doesn’t guarantee instant verification of your GBP. Google has the discretion to give you this verification option or not. The real issue here is how much trust Google thinks it can place in your business. If you own a new business or one that has little online presence, getting your business verified instantly is highly unlikely. In such cases, sending the postcard is the best way for Google to check your business. To use instant verification, sign into GBP using the same account you use for Google Search Console. 5. Bulk verification This option is accessible for businesses that need to verify more than 10 locations of one business at once. You might be qualified for this, for instance, if you own a pizza chain with 25 locations. After signing into Google Business Profile manager, follow the next steps: Create a group for your business locations Add businesses to this group (transfer ungrouped locations, manually add businesses one by one, or upload a spreadsheet with business details) Click “Get verified” next to one of your locations Choose “Chain” Fill in all the required information Submit the verification form When verifying multiple locations at once, ensure that: Your business isn’t classified as a service-area. Your spreadsheet doesn’t contain errors (assuming you choose this option for importing locations). You don’t have duplicate, suspended, or disabled profiles among your 10 locations, as they don’t count. Note! It can take up to a week for Google to review and check your form. 6. Live video call If your business qualifies for the video call verification option, using it shouldn’t be a hassle. Video call verification is done via video chat with a Google specialist. To get started, click ‘Get verified’ next to your profile, choose Video call, and then hit the Next button. At this point, you’ll need to select your language and click the Start Call button. This will take you to a text chat with the next available representative, who will assist you in joining a video call on your device. If you have a storefront business, a Google representative may want to check your workplace, logo, equipment, public space, non-sensitive business documents, and even meet a couple of your employees or clients. If you own a service area business, you might be required to show your branded work vehicle, license plate, and the tools you use to provide your services. Make sure you can showcase your business in a positive light and prove your ownership before the video call even begins. One more thing to consider is that you should plan your video call during the appropriate support hours for your region and language. 7. Video recording If Google gives you the option to verify your business profile on Google using video recording, consider making a short video to show off your business, to confirm that your business’s location exists, as well as prove that the person requesting the verification (you) is authorized to manage the listing. Before proceeding to verification, plan your video recording. You’ll need to record a 360-degree view of the interior and exterior of the business’s location, including the storefront, the street view, and the signage. Additionally, you must display your equipment, marketing materials, employee-only areas, and items. Once you have a plan set in place, click on the Get verified button and choose Capture video. Next, record your video and upload it to the system. Google will review your request, which can take up to 5 business days, and if everything is okay, you’ll be granted verification. If your video doesn’t work, the Get Verified button will appear again, and you can try recording a new video or choose another option instead. You can also delete the video at any time. 8. Photo upload Local service area businesses have long struggled with the GBP verification process due to their lack of a physical storefront. This issue has contributed to a surge in fake service providers who create deceptive listings, steal potential customers, and then resell this information to legitimate businesses. Google has addressed these problems by introducing a new verification method that allows service-based businesses to confirm their identity. Business owners can submit pictures of tools, vehicles, bills, and work done on-site. Kevin Pauls, local SEO expert, noted on X that it’s a “win for service area business verifications!” Win for service area business verifications!Google has added a new option to upload photos of your vehicle in a \"local area where you meet customers\" pic.twitter.com/7o20jseQuS— Kevin Pauls (@Kevin__Pauls) November 15, 2023 This new method provides businesses with a more flexible way to verify GBP accounts and significantly enhances protection against spammer abuse. Need help getting verified? If you’re still facing difficulties with GBP verification after trying all of the methods above, here are a few useful links: Getting help via the Verification Status Tool Businesses facing verification issues on Google Maps can now use the Verification Status Tool to get help. Log in to your business profile account and submit a support request through the tool. GBP Help Community For most GBP issues, you can get in touch here to get answers from the experts. GBP Twitter Support To contact GBP support on Twitter, send a Tweet or direct message to @GoogleMyBiz. GBP Help Center If you’re experiencing any verification issues, you can fill in this form to get instructions from Google on how to fix them. General guidelines If you have general questions about representing your business on Google, read these guidelines. Overview for agencies If you are an agency and are managing your client’s business profiles, read this overview to get more details. Third-party policies If you are an agency or using an agency’s services to manage your business profile, read these rules. I finished the verification process. Now what? Now that your Google Business Profile verification is complete and your listing is visible in Google’s search results, it’s time to start monitoring its performance. SE Ranking’s Local Marketing tool has got you covered. You can use it to: Track how well your GBP ranks on Google Maps over time Get a grid-based view of your business’s ranking within your specified area Monitor 30+ business directories in one place Manage and respond to reviews Get important statistics on your GBP Get notifications about issues with your GBP To get more data on your company’s GBP, choose the Local Marketing tool at the left-hand navigation bar and go to the Google Business Profile tab. In this tab, you’ll find all the essential data on your business profile performance, including: The platform and devices that people used to find your profile. The ratio of times users on desktops and mobile devices see your profile on Google Maps vs. Google Search. The frequency with which users view your profile in Google Maps and Google Search over various timeframes (seven days, one month, three months, half a year, a year, or during all time available). The cumulative number of times your GBP was shown to users in search results. Keywords for which your company profile appears in search results. You can view keyword stats over a three-month period, half a year, or a year, and export them for further analysis. The cumulative number of times users have accessed your website from its GBP. The number of times users requested directions to your location from your GBP. The number of times users called your company by phone from your GBP. SE Ranking presents all of this information in convenient graphs, tables, and charts, which helps you analyze the progress of your company’s GBP more effectively. This can also help you better understand: How customers find your business and which channels you should focus on developing. The search terms that your clients use to find your profile, and the keywords you should optimize your profile for. The days when you get the most interactions so that you can better allocate your resources. Moreover, the tool offers precise local rank tracking. In particular, it allows you to get a visual representation of your business’s local search rankings across a specific geographic area. Instead of relying on a single ranking position for an entire city, it breaks down the area into a grid, showing your business’s performance across different neighborhoods. All you need to do is define your target area, choose the keywords relevant to your business that you want to track, and configure the grid’s size and spacing to match your target area. Proximity plays a key role in ranking, making the closest areas uniquely valuable. However, our tool provides complete coverage and tracks progress across the entire setup grid. This comprehensive approach enables you to analyze rankings more closely, identify direct competitors in specific locations, and better track your progress. Plus, the tool provides a convenient feature for tracking competitors. It shows you the top 20 companies in the local SERP for your target keyword. Analyzing these competitors allows you to see what’s working in your niche and what isn’t. By studying their local SEO strategies, you can refine your own SEO tactics. SE Ranking’s Local Marketing module also has many other valuable features to assist you in your local marketing activities. For example: It enables you to read and respond to reviews you get directly from the platform. Its Analytics gives you in-depth information about the distribution of reviews by their source and rating so you can better understand your customers’ satisfaction. Its Insights report shows the keywords your customers use most often in their reviews, which can help you identify areas that need to be improved to increase customer loyalty. Consider all of the above when using SE Ranking’s Local Marketing Tool. Using this tool to its full potential can refine your local marketing efforts before and after verification. Most frequently asked questions about Google Business Profile verification We mentioned every possible way to verify your GBP listing, but the verification process doesn’t always run smoothly. Since several things can go wrong, we examined the most common profile verification issues to help you clarify what to do if you ever encounter any. Why is Google asking me to verify my business? Google wants to ensure users that it provides accurate and reliable information. It is also serious about protecting them from any type of online fraud. By verifying your business, Google can confirm its existence, preventing fake or misleading listings. This is why Google Business Profile verification helps build trust between businesses and potential customers. How long does it take for my business to appear on Google after verification? It generally takes a few weeks for your updated business information to appear on Google after verification. This timeframe can vary depending on several factors, including the complexity of your business information, the accuracy of the data provided, and the current status of your Google Business Profile. Plus, the verification method plays a role in this process (e.g., instant verification is quicker than other methods, like postcard verification). The business category might also affect the timeframe, as some categories undergo additional verification steps. Additionally, Google’s current workload can impact how quickly the verification is processed. What should I do if I can see my business listing in search, but it doesn’t have anything to do with me? You can claim the already existing listing, as we described earlier in this article, and verify it to manage the information about your business. What if the proposed verification method doesn’t suit me? Unfortunately, you can’t change the verification method. Google offers what it thinks is most suitable for your business. The system considers your business type, business category, public information, region, support hours, and other factors. We recommend trying to use the method suggested by the search engine. If you fail to verify your profile after several attempts, you can contact the support service and describe your problem (take a look at the Need help getting verified? section above). How do I verify my Google business without an address? Google’s guidelines for representing your business on Google state that “if your business either has a physical location that customers can visit, or travels to customers where they are, you can create a Business Profile on Google.” The document also notes, “Brands, organizations, artists, and other online-only businesses aren’t eligible for Business Profiles.” Based on this, businesses that don’t have a physical address or service area can’t create and verify their business profiles. Also, some companies without a physical address may try to rent P.O. Boxes to have an address for legal reasons. When verifying their Google Business Profiles, they may attempt to use their P.O. Box address to receive a verification postcard. It’s important to note that Google forbids this behavior. The purpose of a Google Business Profile is to represent precise physical locations or businesses in a given service area, not remote locations like a P.O. Box. Verifying such a listing is not likely to happen, and even if someone managed to do it, their account would likely be suspended. How do I verify my Google business with multiple addresses? If you have at least 10 locations for one business, you can request bulk verification, as was described earlier in this article. This is the easiest option because you don’t waste time verifying each location separately. Alternatively, you may be eligible for instant verification, but it’s up to Google to decide whether to offer this option to you. If you have less than 10 locations for one business, you’ll need to verify them separately using the verification methods provided by Google. What do I do if my verification postcard never arrived? Occasionally, postcards can get lost in the mail or you may have specified the wrong address. In the latter case, you can correct your address and request a new postcard. If the address is correct and a new postcard still doesn’t arrive within the expected two-week timeframe, you can contact the Help Center. Once you’ve chosen your business, select Verification as the problem, choose Other, and click Next step. Then, navigate to the Email and complete the form with all requested information. The Help Center will then review your request and contact you to help resolve the problem. How to verify a Google Business Profile without a postcard? You can only verify GBP without a postcard if you were offered a different verification method. Google may occasionally present you with several options for verification and ask you to choose one. In this case, you can select any of the proposed methods, but, if you only receive one way to verify your account, such as via a postcard, you must use that method. If, for some reason, this method doesn’t suit you, but the system doesn’t offer any other options, you can contact the Help Center for assistance. If they consider that suitable, they will offer you another verification method. Will my GBP get verified faster if I send several verification requests? No, it won’t. Sending multiple requests for the same Google Business Profile will only delay verification. If you requested a verification code and didn’t wait long enough to get it before requesting a new one, the first code will be deactivated. This means that you would be wasting time waiting for the first code and would still need to wait for the new one. What’s more, multiple verification requests for the same GBP could raise suspicion. Summing up Verifying your GBP listing can be a daunting task, but the benefits of doing so make it worth it. By verifying your GBP listing, you will have an efficient toolbox to analyze and control your business’s representation on Google search and maps, and nothing could be more important than turning searchers into loyal customers. After verifying your GBP listing, the next step is to optimize your website for local search. This involves getting your business featured in the Local Pack and striving to improve and maintain that position for as long as possible. If you’ve encountered any difficulties while verifying your GBP but were able to resolve them, please tell us how you did it. Your experience can be very helpful to fellow readers. Google Business Profile Local SEO 80555 views Written by Julia Torchynska Julia is a content marketer with 10 years of experience in journalism, copywriting, advertising, and PR. She shares her knowledge and experience by creating helpful articles on SEO and digital marketing for SE Ranking blog and popular media. When Julia is not writing articles, she learns new asanas, travels, and as a volunteer helps YWCA with empowering women.",
  "headers": [
    {
      "level": "H1",
      "text": "The ultimate list of methods for verifying your Google Business Profile"
    },
    {
      "level": "H2",
      "text": "Why verifying your GBP listing is so important"
    },
    {
      "level": "H3",
      "text": "Do verified GBP profiles look different?"
    },
    {
      "level": "H2",
      "text": "How to check if your listing is verified"
    },
    {
      "level": "H3",
      "text": "Claiming an existing GBP listing"
    },
    {
      "level": "H2",
      "text": "The 8 ways to verify a Google Business Profile listing"
    },
    {
      "level": "H3",
      "text": "1. Postcard"
    },
    {
      "level": "H3",
      "text": "2. Phone or SMS"
    },
    {
      "level": "H3",
      "text": "3. Email"
    },
    {
      "level": "H3",
      "text": "4. Instant verification"
    },
    {
      "level": "H3",
      "text": "5. Bulk verification"
    },
    {
      "level": "H3",
      "text": "6. Live video call"
    },
    {
      "level": "H3",
      "text": "7. Video recording"
    },
    {
      "level": "H3",
      "text": "8. Photo upload"
    },
    {
      "level": "H2",
      "text": "Need help getting verified?"
    },
    {
      "level": "H3",
      "text": "Getting help via the Verification Status Tool"
    },
    {
      "level": "H3",
      "text": "GBP Help Community"
    },
    {
      "level": "H3",
      "text": "GBP Twitter Support"
    },
    {
      "level": "H3",
      "text": "GBP Help Center"
    },
    {
      "level": "H3",
      "text": "General guidelines"
    },
    {
      "level": "H3",
      "text": "Overview for agencies"
    },
    {
      "level": "H3",
      "text": "Third-party policies"
    },
    {
      "level": "H2",
      "text": "I finished the verification process. Now what?"
    },
    {
      "level": "H2",
      "text": "Most frequently asked questions about Google Business Profile verification"
    },
    {
      "level": "H3",
      "text": "Why is Google asking me to verify my business?"
    },
    {
      "level": "H3",
      "text": "How long does it take for my business to appear on Google after verification?"
    },
    {
      "level": "H3",
      "text": "What should I do if I can see my business listing in search, but it doesn’t have anything to do with me?"
    },
    {
      "level": "H3",
      "text": "What if the proposed verification method doesn’t suit me?"
    },
    {
      "level": "H3",
      "text": "How do I verify my Google business without an address?"
    },
    {
      "level": "H3",
      "text": "How do I verify my Google business with multiple addresses?"
    },
    {
      "level": "H3",
      "text": "What do I do if my verification postcard never arrived?"
    },
    {
      "level": "H3",
      "text": "How to verify a Google Business Profile without a postcard?"
    },
    {
      "level": "H3",
      "text": "Will my GBP get verified faster if I send several verification requests?"
    },
    {
      "level": "H2",
      "text": "Summing up"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Julia Torchynska"
}