{
  "url": "https://moz.com/blog/category/moz-news/p10",
  "slug": "p10",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Ronell Smith March 29, 2017 ​Feast Your Eyes on the MozCon 2017 Initial Agenda Moz News | Marketing Industry | SEO Events Are you ready for MozCon 2017? It's only a few months away — get a sneak peek at our speaker lineup, covered topics, and pick up your tickets before we sell out. Read this post By: Sarah Bird March 7, 2017 The Moz 2016 Annual Report Moz News | Marketing Industry Take a gander at how 2016 shaped up for Moz as we share our internal data and reflect on everything that happened last year. It's the 2016 Moz annual report! Read this post By: Roxana Nelson January 17, 2017 MozBar Revived! How We Rebuilt MozBar to be More Robust Than Ever—Plus a Brand-New Feature Moz News | On-page SEO | Content Marketing MozBar has been completely rebuilt for speed and reliability — plus the addition of On-Page Content Suggestions! Check out what's changed (and watch us react to the tweets you've sent us). Read this post By: George Freitag January 12, 2017 MozCon Local 2017's Full Agenda Moz News | Local SEO | SEO Events Brand with a ton of locations? Marketer with a ton of local clients? MozCon Local is where you need to be. Buy your ticket today. Read this post By: Felicia Crawford January 12, 2017 Simply the Best: 2016's Top Content from the Moz Blog Content Marketing | Advanced SEO | Moz News With every click, visit, thumbs-up, and comment, you voted for the best Moz Blog content of 2016. Revisit your favorite posts and check out what you might have missed throughout the year! Read this post By: Felicia Crawford December 22, 2016 Treat Yo'self: Warm Holiday Wishes from Moz! Moz News It's been a big year, and it's almost over. To make sure you're ready to enter 2017 recharged, relaxed, and rejuvenated, we've got a fun video tale to tell. Spoiler alert: There's a really cute Mozdog in it. Read this post By: George Freitag November 21, 2016 Announcing MozCon Local 2017! SEO Events | Local SEO | Moz News Get a sneak peek at the speakers (and get your early-bird tickets) for February 2017's #1 local marketing conference, MozCon Local! Read this post By: Dudley Carr November 17, 2016 The New Moz Local: Make Local Your Advantage! Local SEO | Moz News Today we’re excited to share our latest updates to Moz Local. This release has something useful for everyone in local SEO — read on to see what's new! Read this post By: Dudley Carr October 24, 2016 New Moz Local Product Packages Are Coming in November Moz News The cat's out of the bag: new features are coming to Moz Local. Get a hint about what's on the horizon for this November. Read this post By: Danielle Launders October 17, 2016 The 2016 #MozCon Video Bundle Has Arrived! SEO Events | Moz News | Video Whether you missed MozCon 2016 completely or just wish you could relive it again and again, you're in luck: the MozCon 2016 Video Bundle is now available! Get a taste of the goodness with a free session by Joe Hall included in this blog post. Read this post By: Dr. Peter J. Meyers September 8, 2016 ​The Future of the Moz Community Moz News With the recent changes at Moz, there's been a lot of speculation about the future of our community. I'd like to try to set the record straight and provide an honest account of where we're at and where we're headed. Read this post By: Erica McGillivray August 31, 2016 Get Your Seattle Exploration on at MozCon 2016! SEO Events | Moz News Don't miss out on everything MozCon! Make sure to get your ticket today and check out all the sights and more. Read this post By: Sarah Bird August 17, 2016 Moz is Doubling Down on Search Moz News We're focusing our efforts on core SEO such as rank tracking, keyword research, local listings, duplicate management, on-page, crawl, and links. To do so, some painful decisions were made: We'll sunset Moz Content and Followerwonk, and say goodbye to many of our fellow Mozzers. Send good vibes. Read this post By: George Freitag August 9, 2016 Giving Duplicate Listing Management the Upgrade it Deserves Local SEO | Moz Tools | Moz News Duplicate listings have plagued local marketers for years. See how agencies, brands & SMBs alike can seek and destroy dupes faster than ever with Moz Local. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "​Feast Your Eyes on the MozCon 2017 Initial Agenda"
    },
    {
      "level": "H2",
      "text": "The Moz 2016 Annual Report"
    },
    {
      "level": "H2",
      "text": "MozBar Revived! How We Rebuilt MozBar to be More Robust Than Ever—Plus a Brand-New Feature"
    },
    {
      "level": "H2",
      "text": "MozCon Local 2017's Full Agenda"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Simply the Best: 2016's Top Content from the Moz Blog"
    },
    {
      "level": "H2",
      "text": "Treat Yo'self: Warm Holiday Wishes from Moz!"
    },
    {
      "level": "H2",
      "text": "Announcing MozCon Local 2017!"
    },
    {
      "level": "H2",
      "text": "The New Moz Local: Make Local Your Advantage!"
    },
    {
      "level": "H2",
      "text": "New Moz Local Product Packages Are Coming in November"
    },
    {
      "level": "H2",
      "text": "The 2016 #MozCon Video Bundle Has Arrived!"
    },
    {
      "level": "H2",
      "text": "​The Future of the Moz Community"
    },
    {
      "level": "H2",
      "text": "Get Your Seattle Exploration on at MozCon 2016!"
    },
    {
      "level": "H2",
      "text": "Moz is Doubling Down on Search"
    },
    {
      "level": "H2",
      "text": "Giving Duplicate Listing Management the Upgrade it Deserves"
    }
  ],
  "author": "Ronell Smith\n          \n            Sarah Bird\n          \n            Roxana Nelson\n          \n            George Freitag\n          \n            Felicia Crawford\n          \n            Felicia Crawford\n          \n            George Freitag\n          \n            Dudley Carr\n          \n            Dudley Carr\n          \n            Danielle Launders\n          \n            Dr. Peter J. Meyers\n          \n            Erica McGillivray\n          \n            Sarah Bird\n          \n            George Freitag"
}