{
  "url": "https://moz.com/blog/category/moz-news/p12",
  "slug": "p12",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dudley Carr March 10, 2016 Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!) Local SEO | Moz Tools | Moz News It's now as easy as pie to import locations straight from Google My Business into your Moz Local dashboard. And on top of that, we've got a new free tool to make painful GMB permissions management a thing of the past: introducing My Business Console! Read this post By: Jon March 9, 2016 How to Feed a Hummingbird: Improve Your On-Page SEO with Related Topics in Moz Pro On-page SEO | Moz Tools | Moz News SEO is changing. We can no longer rely on keyword targeting alone to optimize our content. Moz Pro now has a tool to make understanding and targeting topics on the SERPs a whole lot easier. Read this post By: Jeremy Modjeska February 16, 2016 Revved Up Rankings: History & Filtering at Your Fingertips, New in Moz Pro Moz News As of today, timeframe selection in Moz Pro has no bounds. You can report on rankings data with start and end dates anywhere in the life of your campaign, up to and including the entire campaign’s history. Your full rankings histories have been liberated. Read this post By: Sarah Bird February 11, 2016 The 2015 Moz Annual Report: All the Facts and Then Some Moz News It was a huge year for Moz! We worked hard to make our tools the best they can be, continue our TAGFEE legacy, and develop fancy new things for you to use toward the ever-important goal of better marketing. Review 2015 with us, reminisce about all that we went through together, and stand with us as we look to the bright and exciting future! Read this post By: Adam Feldstein February 11, 2016 Moz Pro: The Rear View and the Road Ahead Moz News So much change has been wrought in the past year, we had to write a blog post about it. Innumerable improvements were made to Moz Pro throughout 2015 — we list out the biggies, lay out our future plans, and most of all, thank you (our wonderful community) so much for allowing us to be where we are today. Read this post By: Dudley Carr February 9, 2016 We're Thrilled to Announce... Moz Local Insights Released from Beta! Local SEO | Moz News We're jazzed to announce that Moz Local Insights is out of its beta period! Incorporating Google My Business data and Google/Facebook reviews, offering up beautiful new PDF reports — the goodness doesn't stop there, with tons of new features planned for the future. Your local search presence management will never be the same! Read this post By: Jay Leary February 2, 2016 Moz Content Launches New Tiers and Google Analytics Integration Content Marketing | Moz News We've got some cool new features in Moz Content to share with you! Your content analysis will be more in-depth than ever before with Google Analytics integration, and if you're an agency or a larger site, we've got expanded tier levels to accommodate your needs. Read this post By: Sarah Bird January 26, 2016 Moz Announces $10 Million Financing Round to Build on Momentum of New Products Moz News We've got some big news to share with you! Read about how our new Series C round of financing will spur our product momentum for the future and continue to help our Moz community be the thriving, successful place it is today. Read this post By: Felicia Crawford January 7, 2016 The Best of 2015: Top Posts and People of the Year Blogging | Moz News The Moz Blog Best of 2015 is hot off the presses! Check out the top posts of the year, which comments resonated with the community, who the top commenters were, and more. Here's to a great 2016! Read this post By: Felicia Crawford December 24, 2015 'Twas the Night Before Christmas... Moz-Style Moz News Whatever your joys and celebrations this season, we at Moz wish you all the best! In the spirit of the season, we bring you a festive poem about a little Moz Dog with a big heart. Read this post By: Erica McGillivray November 30, 2015 It's Here! The MozCon Local 2016 Agenda Local SEO | Moz News | SEO Events On the fence about MozCon Local 2016? Check out our entire agenda: topics and speakers! Read this post By: Jay Leary November 23, 2015 We're Pleased to Announce Moz Content – A New Product for Content Marketers Content Marketing | Moz Tools | Moz News We're excited to announce the newest addition to our family of tools — Moz Content! Moz Content helps marketers build engaging content strategies with specialized research, measurement, and analysis tools. Read this post By: Martin York November 12, 2015 Good News: We Launched a New Index Early! Let's Also Talk About 2015's Mozscape Index Woes Moz News Of late, we've faced some big challenges with the Mozscape index. Our Director of Engineering goes into detail about the recent troubles our index has endured, what went wrong, how we fixed it, and why we expect to deliver you better link metrics than ever from now on. Read this post By: David Mihm November 11, 2015 ​Announcing Search Insights from Moz Local! Local SEO | Moz Tools | Moz News It's our pleasure to announce a new feature to our Moz Local product: Search Insights! Dive deep into your business reputation, visibility, and site performance in an easy dashboard to make keeping track of your local search efforts easier than ever before. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!)"
    },
    {
      "level": "H2",
      "text": "How to Feed a Hummingbird: Improve Your On-Page SEO with Related Topics in Moz Pro"
    },
    {
      "level": "H2",
      "text": "Revved Up Rankings: History & Filtering at Your Fingertips, New in Moz Pro"
    },
    {
      "level": "H2",
      "text": "The 2015 Moz Annual Report: All the Facts and Then Some"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Moz Pro: The Rear View and the Road Ahead"
    },
    {
      "level": "H2",
      "text": "We're Thrilled to Announce... Moz Local Insights Released from Beta!"
    },
    {
      "level": "H2",
      "text": "Moz Content Launches New Tiers and Google Analytics Integration"
    },
    {
      "level": "H2",
      "text": "Moz Announces $10 Million Financing Round to Build on Momentum of New Products"
    },
    {
      "level": "H2",
      "text": "The Best of 2015: Top Posts and People of the Year"
    },
    {
      "level": "H2",
      "text": "'Twas the Night Before Christmas... Moz-Style"
    },
    {
      "level": "H2",
      "text": "It's Here! The MozCon Local 2016 Agenda"
    },
    {
      "level": "H2",
      "text": "We're Pleased to Announce Moz Content – A New Product for Content Marketers"
    },
    {
      "level": "H2",
      "text": "Good News: We Launched a New Index Early! Let's Also Talk About 2015's Mozscape Index Woes"
    },
    {
      "level": "H2",
      "text": "​Announcing Search Insights from Moz Local!"
    }
  ],
  "author": "Dudley Carr\n          \n            Jon\n          \n            Jeremy Modjeska\n          \n            Sarah Bird\n          \n            Adam Feldstein\n          \n            Dudley Carr\n          \n            Jay Leary\n          \n            Sarah Bird\n          \n            Felicia Crawford\n          \n            Felicia Crawford\n          \n            Erica McGillivray\n          \n            Jay Leary\n          \n            Martin York\n          \n            David Mihm"
}