{
  "url": "https://moz.com/blog/category/moz-news/p13",
  "slug": "p13",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Adam Feldstein October 1, 2015 At Last, You Can Now Add Users to Your Moz Pro Account! Moz Tools | Moz News We're thrilled to announce that one of our most-requested features, the ability for Moz Pro account owners to provide unique logins for their team members and/or clients, is now available. Read this post By: Trevor Klein September 21, 2015 A Picture of You: Results of the 2015 Moz Blog Reader Survey Blogging | Moz News This summer, 750+ of our readers told us about themselves, their work, and their thoughts on the Moz Blog. Here's what they had to say. Read this post By: Jennifer Sable Lopez September 18, 2015 Remembering Dana Lookadoo Marketing Industry | Moz News Today we mourn the loss of our dear friend, long-time community member, and constant shining star in the industry, Dana Lookadoo. We all have a story about Dana. I'd love to hear yours. Read this post By: Rand Fishkin August 27, 2015 Moz's Acquisition of SERPscape, Russ Jones Joining Our Team, and a Sneak Peek at a New Tool Keyword Research | Moz Tools | Moz News Today, it's my pleasure to announce some exciting news. First, if you haven't already seen it via his blog post, I'm thrilled to welcome Russ Jones, a longtime community member and great contributor to the SEO world, to Moz. Read this post By: Jon July 30, 2015 ​​Measure Your Mobile Rankings and Search Visibility in Moz Analytics Moz Tools | Moz News We're excited to announce two new features in Moz Analytics: Mobile Rankings tracking and a score for your Search Visibility! Read this post By: Dr. Peter J. Meyers July 28, 2015 ​The 2015 Online Marketing Industry Survey Marketing Industry | Moz News After sifting through more than 3,600 responses, we've painted a picture of the online marketing industry in 2015. Here's what we found. Read this post By: Trevor Klein June 30, 2015 Help Us Improve the Moz Blog: 2015 Reader Survey Moz News We want to make the Moz Blog as valuable for you as we possibly can. To do that, we need to know a bit about you. Please help us out by taking this five-minute survey. Read this post By: Noam Chitayat May 27, 2015 Moz Local Dashboard Updates Moz Tools | Moz News Today, we're excited to announce some new features and changes to the Moz Local dashboard. We've updated your dashboard to make it easier to manage and gauge the performance of your local search listings. Read this post By: Erica McGillivray May 7, 2015 ​We Want Your Stories: Accepting MozCon Ignite Pitches SEO Events | Moz News Announcing a new Tuesday night event at MozCon: MozCon Ignite. Submit your topic pitch to be one of 16 speakers on non-marketing topics by Sunday, May 17 at 5pm PDT. Read this post By: Sarah Bird April 22, 2015 Moz's 2014 Annual Report Moz News The results are in, and 2014 showed significant improvement over 2013 for Moz. Check out our financials, community statistics, and more in this annual report card from our previous year. Read this post By: David Mihm April 6, 2015 Check Your Local Business Listings in the UK Local SEO | Moz Tools | Moz News One of the most consistent refrains from the Moz community as we've released features over the last two years has been the desire to see Moz Local expand to countries outside the U.S. Today I'm pleased to announce that we’re embarking on our journey to global expansion with support for U.K. business listing searches in our Check Listing tool. Read this post By: Nick Sayers April 1, 2015 Support 4.0: Using Snapchat for all of Moz's Support Branding | Moz Tools | Moz News Support 4.0 with Moz's new philosophy on using Snapchat for all customer inquiries. Read this post By: Erica McGillivray March 26, 2015 A Sneak Preview of #MozCon 2015 SEO Events | Moz News Here's a sneak peek at our amazing speakers for MozCon 2015! Read this post By: Cyrus Shepard March 3, 2015 Announcing the 2015 Online Marketing Industry Survey Marketing Industry | Moz News We're very excited to announce the 2015 Online Marketing Industry Survey is ready. By comparing answers and predictions from one year to the next, we can spot trends and gain insight not easily reported through any other source. This is our best chance to understand exactly where the future of our industry is headed. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "At Last, You Can Now Add Users to Your Moz Pro Account!"
    },
    {
      "level": "H2",
      "text": "A Picture of You: Results of the 2015 Moz Blog Reader Survey"
    },
    {
      "level": "H2",
      "text": "Remembering Dana Lookadoo"
    },
    {
      "level": "H2",
      "text": "Moz's Acquisition of SERPscape, Russ Jones Joining Our Team, and a Sneak Peek at a New Tool"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "​​Measure Your Mobile Rankings and Search Visibility in Moz Analytics"
    },
    {
      "level": "H2",
      "text": "​The 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H2",
      "text": "Help Us Improve the Moz Blog: 2015 Reader Survey"
    },
    {
      "level": "H2",
      "text": "Moz Local Dashboard Updates"
    },
    {
      "level": "H2",
      "text": "​We Want Your Stories: Accepting MozCon Ignite Pitches"
    },
    {
      "level": "H2",
      "text": "Moz's 2014 Annual Report"
    },
    {
      "level": "H2",
      "text": "Check Your Local Business Listings in the UK"
    },
    {
      "level": "H2",
      "text": "Support 4.0: Using Snapchat for all of Moz's Support"
    },
    {
      "level": "H2",
      "text": "A Sneak Preview of #MozCon 2015"
    },
    {
      "level": "H2",
      "text": "Announcing the 2015 Online Marketing Industry Survey"
    }
  ],
  "author": "Adam Feldstein\n          \n            Trevor Klein\n          \n            Jennifer Sable Lopez\n          \n            Rand Fishkin\n          \n            Jon\n          \n            Dr. Peter J. Meyers\n          \n            Trevor Klein\n          \n            Noam Chitayat\n          \n            Erica McGillivray\n          \n            Sarah Bird\n          \n            David Mihm\n          \n            Nick Sayers\n          \n            Erica McGillivray\n          \n            Cyrus Shepard"
}