{
  "url": "https://moz.com/blog/category/moz-news/p14",
  "slug": "p14",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin February 10, 2015 Announcing the New & Improved Link Intersect Tool Moz Tools | Moz News The new Link Intersect offers fast, fresh, deep link data for marketers seeking to ID great targets for outreach and link opportunities. See how the tool works and some tactical tips on how to get the best results, plus Rand snuck in a few quips. Read this post By: David Mihm February 5, 2015 Enhanced Reporting Now Available in Moz Local Local SEO | Moz Tools | Moz News Learn about the latest feature release from Moz Local including how it can help you track the accuracy of your listings over time and what's coming next. Read this post By: Jennifer Sable Lopez January 26, 2015 Get to Know the Moz Community Managers Community Management | Moz News At this very moment a spam comment is being written on the Moz blog, a tweet is being sent to @Moz, and someone is signing up for the next Mozinar. Today, meet the peeps behind the *beep*s from Roger, and join me in acknowledging our team of community managers for #CMAD. Read this post By: Felicia Crawford December 24, 2014 Happy Holidays from Moz Moz News Join in the holiday fun with this video about some new office holiday traditions from Moz. Read this post By: Matthew Brown December 17, 2014 Location is Everything: Local Rankings in Moz Analytics Local SEO | Moz News Big news for local search marketers: Moz Analytics now gives you the ability to track local rankings by adding locations to the tracked keywords in your rankings reports. Read this post By: Rand Fishkin October 6, 2014 Thank You for 10 Incredible Years Moz News It's been 10 amazing years since Rand started the blog that would turn into SEOmoz and then Moz, and we never could have come this far without you all. You'll find letters of appreciation from Rand and Sarah in this post (along with a super-cool video retrospective!), and from all of us at Moz, thank you! Read this post By: David Mihm September 2, 2014 Moz Local Summer Updates Local SEO | Moz Tools | Moz News Our engineering team has been hard at work on a number of behind-the-scenes improvements since the launch of Moz Local in March, but today marks our first major feature release--streamlined submission for individual listings and a killer duplicate-closure upgrade. Read this post By: Trevor Klein August 20, 2014 Announcing the All-New Beginner's Guide to Link Building Content Marketing | Moz News | Link Building We're excited to announce the third beginner's guide from Moz: The Beginner's Guide to Link Building! Read this post By: Rand Fishkin July 23, 2014 Dear Google, Links from YouMoz Don't Violate Your Quality Guidelines Search Engines | Moz News Recently, Moz contributor Scott Wyden, a photographer in New Jersey, received a warning in his Google Webmaster Tools about some links that violated Google's Quality Guidelines. One example was from moz.com. Read this post By: Jon June 3, 2014 Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar Moz Tools | Moz News We're thrilled to announce version 3 of the MozBar for Chrome! Check out the functionality in this post; the Firefox add-on will follow soon. Read this post By: Megan Singley February 10, 2014 Introducing the New MozPlex Moz News Moz has moved, and we invite you all to check out the new MozPlex! Read this post By: Sarah Bird January 30, 2014 Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More Moz News Learn more than you ever cared to know about Moz's inner workings. It's the 2013 year in review, complete with gigantic infographic! It's a metricstraveganza! Read this post By: Rand Fishkin January 15, 2014 My Final Post as CEO: Sarah Bird Has the Conn Moz News If you haven't already heard, we have some big news to share: I'm officially handing over the reins as CEO, and am thrilled to welcome our President and COO Sarah Bird into the role. I sat down with Sarah for a conversation about our memories from working together these past seven years and our plans for the future at Moz. Read this post By: Trevor Klein December 31, 2013 The Best of 2013: The Top Posts and People on the Moz Blog Moz News On the last day of 2013, we bring you a roundup of the year's top posts (based on several metrics), the top comments from community members, and the most active commenters on the blogs. Happy New Year! Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Announcing the New & Improved Link Intersect Tool"
    },
    {
      "level": "H2",
      "text": "Enhanced Reporting Now Available in Moz Local"
    },
    {
      "level": "H2",
      "text": "Get to Know the Moz Community Managers"
    },
    {
      "level": "H2",
      "text": "Happy Holidays from Moz"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Location is Everything: Local Rankings in Moz Analytics"
    },
    {
      "level": "H2",
      "text": "Thank You for 10 Incredible Years"
    },
    {
      "level": "H2",
      "text": "Moz Local Summer Updates"
    },
    {
      "level": "H2",
      "text": "Announcing the All-New Beginner's Guide to Link Building"
    },
    {
      "level": "H2",
      "text": "Dear Google, Links from YouMoz Don't Violate Your Quality Guidelines"
    },
    {
      "level": "H2",
      "text": "Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar"
    },
    {
      "level": "H2",
      "text": "Introducing the New MozPlex"
    },
    {
      "level": "H2",
      "text": "Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More"
    },
    {
      "level": "H2",
      "text": "My Final Post as CEO: Sarah Bird Has the Conn"
    },
    {
      "level": "H2",
      "text": "The Best of 2013: The Top Posts and People on the Moz Blog"
    }
  ],
  "author": "Rand Fishkin\n          \n            David Mihm\n          \n            Jennifer Sable Lopez\n          \n            Felicia Crawford\n          \n            Matthew Brown\n          \n            Rand Fishkin\n          \n            David Mihm\n          \n            Trevor Klein\n          \n            Rand Fishkin\n          \n            Jon\n          \n            Megan Singley\n          \n            Sarah Bird\n          \n            Rand Fishkin\n          \n            Trevor Klein"
}