{
  "url": "https://moz.com/blog/category/moz-news/p18",
  "slug": "p18",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Jennifer Sable Lopez December 22, 2011 The Best of 2011 - Posts & People Who Rocked Our World Moz News What's better than unicorns and kittens happily leaping over rainbows with gold at the end? The Moz community, that's what! At the end of every year we like to take a... Read this post By: Rand Fishkin November 29, 2011 2nd November Index Update: Our Broadest Index Yet, and New PA/DA Scores are Live Moz News Hey gang - it's that magical time again when Linkscape's web index has updated with brand new data (for the second time this month). Open Site Explorer, the Mozbar and the PRO Web App... Read this post By: Megan Singley November 17, 2011 What Does your Ideal Rank Tracker Look Like? We Want to Know! Moz News You know that corner sandwich shop that you love so much because they'll make you the exact sandwich you crave? Yea, so this is kinda like that... well, but not. Here at SEOmoz we think a lot about how we can not only come out with new features, but also improve existing tools so our members ... Read this post By: Rand Fishkin November 6, 2011 November Linkscape Update is Live; Binary Files Issue Dramatically Reduced Moz News On Thursday (November 3rd) of this past week, Linkscape's index updated (in record time - just 3 weeks). New link data's once again available in OpenSiteExplorer, via the SEOmoz API and in the Mozbar. Here are the stats for this latest index update (our 46th inde... Read this post By: Rand Fishkin October 19, 2011 October 2011 Linkscape Update + New OSE Features Moz News Howdy gang! As promised, last night we launched our 45th Linkscape index. You'll find new data in Open Site Explorer, the Mozbar and the PRO Web App as well as in our API. We've also started to address some of the cha... Read this post By: Rand Fishkin September 17, 2011 Linkscape's September Update + Feedback Moz News Last week, we launched a new Linkscape update with data crawled and indexed in August. Several folks noticed some significant changes in this index, particularly in link counts and some PA/DA metrics. I wanted to take some time in this post to talk about Linkscape's data, our process, some of the challenges we're facing and what you can expect to see with the index over the next several months.... Read this post By: Joanna Lord September 14, 2011 Refer Your Friends & Get SEOmoz PRO for Free! Moz News Alright SEOmoz PRO members, are you ready for some good news? Drum roll please...today we launched our PRO Refer-a-Friend Program! What does this mean for you? It means you might not have to pay for your PRO membership ever again. Read this post By: Gianluca Fiorelli August 16, 2011 Remembering a Dog Named Goodnewscowboy Moz News Sunday, August the 7th, was a sad day for the Moz community when we lost a beloved member due to cancer. Read this post By: Rand Fishkin July 27, 2011 Brand New Open Site Explorer is Here (and Linkscape's Updated, too) Moz News This morning at Mozcon, I announced the launch of Open Site Explorer v3, a long-awaited upgrade to one of the most popular marketing tools on the web. I'm more than a little excited about all the progress, hard work and remarkable features that are included in this upgrade, so let's get right to them.The first thing you'll notice is the new d... Read this post By: Karen Semyan July 26, 2011 Our Latest Chrome Toolbar Update is Live! (and one more cool thing) Moz News On the heels of our Firefox toolbar launch in May, I’m happy to announce that we’ve launched our MozBar for Chrome. With this update, you’ll be able to research sites in your favorite browser--Chrome or Firefox--using a powerful toolbar that gets you quickly to the data you need most. We’ve made a number of useful improvements, most suggested... Read this post By: Joanna Lord June 16, 2011 Announcing the Conference Crasher Giveaway: Enter & Win! Moz News You know all those times you've had to save a search on Twitter so you can keep up with, yet another, search conference you couldn't afford attending? Well no more my friends! We have partnered with some premier search and social conferences and compiled a dozen full-conference passes to give away! Here at the MozPlex we know how important it is to get out there and expand your search marketing... Read this post By: Rand Fishkin June 8, 2011 Early Launch of SERPs Analysis Tool + June Linkscape Update Moz News If you're anything like me, you spend several hours each month (maybe more often) preparing elaborate worksheets of ranking analyses to help uncover why a particular site/page is outranking another and what it will take to reach top rankings. Which is why the screenshot below has me pretty excited. That's the first version of the ... Read this post By: Rand Fishkin June 6, 2011 New Edition of the Ranking Factors for 2011 is Now Live! Moz News Since 2005, SEOmoz has released a new version of the Search Ranking Factors survey every two years, a piece of content that many in the SEO world have used and referenced. This year, we've continued that tradition and added a whole new element of research, comparing the aggregated opinions of 132 SEOs around the world with correla... Read this post By: Jennifer Sable Lopez June 1, 2011 And The Winning City for #MozCation Is... Moz News Come on now, you didn't think I'd spill beans just like that did you? Before I give you the goods, let me refresh your memory in case this is the first time you're hearing about MozCation. A few weeks ago, we asked people to create some sort of unique content and ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "The Best of 2011 - Posts & People Who Rocked Our World"
    },
    {
      "level": "H2",
      "text": "2nd November Index Update: Our Broadest Index Yet, and New PA/DA Scores are Live"
    },
    {
      "level": "H2",
      "text": "What Does your Ideal Rank Tracker Look Like?  We Want to Know!"
    },
    {
      "level": "H2",
      "text": "November Linkscape Update is Live; Binary Files Issue Dramatically Reduced"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "October 2011 Linkscape Update + New OSE Features"
    },
    {
      "level": "H2",
      "text": "Linkscape's September Update + Feedback"
    },
    {
      "level": "H2",
      "text": "Refer Your Friends & Get SEOmoz PRO for Free!"
    },
    {
      "level": "H2",
      "text": "Remembering a Dog Named Goodnewscowboy"
    },
    {
      "level": "H2",
      "text": "Brand New Open Site Explorer is Here (and Linkscape's Updated, too)"
    },
    {
      "level": "H2",
      "text": "Our Latest Chrome Toolbar Update is Live! (and one more cool thing)"
    },
    {
      "level": "H2",
      "text": "Announcing the Conference Crasher Giveaway: Enter & Win!"
    },
    {
      "level": "H2",
      "text": "Early Launch of SERPs Analysis Tool + June Linkscape Update"
    },
    {
      "level": "H2",
      "text": "New Edition of the Ranking Factors for 2011 is Now Live!"
    },
    {
      "level": "H2",
      "text": "And The Winning City for #MozCation Is..."
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Rand Fishkin\n          \n            Megan Singley\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Joanna Lord\n          \n            Gianluca Fiorelli\n          \n            Rand Fishkin\n          \n            Karen Semyan\n          \n            Joanna Lord\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Jennifer Sable Lopez"
}