{
  "url": "https://moz.com/blog/category/moz-news/p33",
  "slug": "p33",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin November 7, 2007 Answers to Questions for Rand: Round 2 Moz News Sorry it's taken me so long to get to all of these. The past few days trying to get grounded after a week in Stockholm have been even busier than the usual (and that's saying something). With a little luck, though, we'll have two very exciting announcements tomorrow and Thursday, and we've managed to get some great YOUmoz entries over the last few days - keep 'em coming! For those who m... Read this post By: Rand Fishkin November 4, 2007 Rewriting the Beginner's Guide - Part III: Why Search Engine Marketing is Neccessary Moz News For the next few weeks, my blog posts will primarily consist of re-authoring and re-building the Beginner's Guide to Search Engine Optimization, section by section. You can read more about this project here. Part III... Read this post By: Rebecca Kelley November 1, 2007 Should You Optimize Your Site For Each Individual Search Engine? Moz News I was reading through Search Engine Land today (as I do every day--kissuptodannykissuptodanny) and came across the following blurb in Stoney deGeyter's 10 Useless SEO Worries post: Don't think that you need to optimize a page for each search engine. It doesn't work that way. Just do good optimization and all eng... Read this post P By: Patrick Sexton October 29, 2007 SEOmoz Google Gadget Moz News Here is a new gadget that displays four things from SEOmoz besides the blog.I am going to just put a screenshot of it here, but you can see it live on SEOish. To add it to iGoogle you can click the \"add to Google\" button below.... Read this post By: Rand Fishkin October 29, 2007 Answers to Questions for Rand, Round #1 Moz News First things first - go watch this video of Amanda Camp explaining her job at Google's Webmaster Central. There's a critical lesson in her 90 seconds on tape that's incredibly revealing. If you listen carefully, what Amanda's saying is, \"yes, we read your comments, we read your questions, we look at all your spam reports, but we don'... Read this post By: Rand Fishkin October 24, 2007 Your Questions Answered Moz News I've gotten a few emails asking if I'd be willing to do a blog post thread similar to Shoemoney's Ask Questions & Get Answers series. I've actually been meaning to put this up earlier, but keep running into other posts I'd like to author.... Read this post By: Rand Fishkin October 20, 2007 Snippets from 30,000 Feet Moz News I'm on a plane from Newark to Seattle. It's late at night, and the first hour was spent on the ground waiting for low CIGS (low ceilings of clouds & rain) to clear. So, while I still have another 4.5 hours in front of me, I'm just grateful to be in the air. The last week was a whirlwind – although that's nothing new. For the last 4 ... Read this post By: buybigtires October 19, 2007 Why Can't You Just Use Dreamweaver Like Everyone Else?!? Moz News Six months ago, I was a very different person. SEO was something I knew little about(I still do not claim to have above a beginner's understanding), and I was running an OS that I did not care for. Then one day, after struggling with a lousy driver install and a Lexmark printer(Die!! Lexmark...DIE!!!) I said some rather foul words, and went to the Ubuntu website, intending to dual bo... Read this post M By: mystery_guest October 15, 2007 13 Things to Do When Your Loved One is Away at Conferences Moz News As many of you know, Rand travels quite a bit for his work, leaving me at home with Raul, the cabana boy. All is well for the first few hours, until I grow tired of Raul's deep tissue massages and the peeled grapes he insists on feeding me. After that, I tend to get a little bored and lonely. I'm assuming the other conference widows out there feel the same way, and as such, I'... Read this post By: Rand Fishkin October 12, 2007 What if the Ron Paul Fans Became SEO Savvy? Moz News It's late, and I should be wrapping up Q+A (or at least blogging on my promised topic of the Beginner's Guide) and getting some shut eye, but I simply couldn't resist sharing some thoughts about the web-based fervor for Republican Presidential candidate Ron Paul. For those who don't know, Paul's supporters are possibly the most organized and galvanized web community in the modern political spec... Read this post K By: Karen Browning-Cutler October 4, 2007 A Humble Request for All SEOmoz Staff and Readers Moz News I have a humble request. Fall has come, so I am back in school for the last year. I enrolled in a magazine writing class because I thought it would be fun. So far it has not been fun at all, but our first assignment is to profile a person, business, or organization. I lovingly think of SEOmoz as all three, in a way, and I knew right away that I wanted to do my article on it. Read this post By: Rand Fishkin September 25, 2007 SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup Moz News This week we're diving into the hiring game - trying to find the people who will help us make both the free and premium content on the site even more valuable over the weeks and months to come. Jane's in charge of hiring our new customer service / office manager and Jeff's doing double-duty, seeking out both a web developer and a GUI designer. We've already received one resume that's so incredi... Read this post C By: Carlos del Rio September 25, 2007 Pre-Funk the SEOmoz Seminar Moz News Congratulations SEOmoz Team on all of your big news the past week! To celebrate these bold moves into the future and the SEOmoz Seminar I am hosting a gathering at the ... Read this post M By: MikePiper September 21, 2007 3 Minute Guide to Taxes for SEMs/SEOs Moz News If you’re a newly self-employed SEM/SEO, you’ve certainly got several things on your plate right now: link building for your clients, promoting your own website and blog, worrying that your paid links are now going to get you blacklisted by Google, etc. Well, if you haven’t thought of it yet, there’s one more thing for you to worry about: Taxes. Now that... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Answers to Questions for Rand: Round 2"
    },
    {
      "level": "H2",
      "text": "Rewriting the Beginner's Guide - Part III: Why Search Engine Marketing is Neccessary"
    },
    {
      "level": "H2",
      "text": "Should You Optimize Your Site For Each Individual Search Engine?"
    },
    {
      "level": "H2",
      "text": "SEOmoz Google Gadget"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Answers to Questions for Rand, Round #1"
    },
    {
      "level": "H2",
      "text": "Your Questions Answered"
    },
    {
      "level": "H2",
      "text": "Snippets from 30,000 Feet"
    },
    {
      "level": "H2",
      "text": "Why Can't You Just Use Dreamweaver Like Everyone Else?!?"
    },
    {
      "level": "H2",
      "text": "13 Things to Do When Your Loved One is Away at Conferences"
    },
    {
      "level": "H2",
      "text": "What if the Ron Paul Fans Became SEO Savvy?"
    },
    {
      "level": "H2",
      "text": "A Humble Request for All SEOmoz Staff and Readers"
    },
    {
      "level": "H2",
      "text": "SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup"
    },
    {
      "level": "H2",
      "text": "Pre-Funk the SEOmoz Seminar"
    },
    {
      "level": "H2",
      "text": "3 Minute Guide to Taxes for SEMs/SEOs"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Patrick Sexton\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            buybigtires\n          \n            mystery_guest\n          \n            Rand Fishkin\n          \n            Karen Browning-Cutler\n          \n            Rand Fishkin\n          \n            Carlos del Rio\n          \n            MikePiper"
}