{
  "url": "https://moz.com/blog/category/moz-news/p35",
  "slug": "p35",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rebecca Kelley July 31, 2007 Apparently I Work for Google Moz News ...at least, according to my relatives I do. I'm in Michigan right now. Hot, humid, flat, skinny tree'd, built Ford (or GM, or Chrysler) tough Michigan. I was born and raised here, but moved to Seattle for college, where I fell in love with the Emerald City and got a pretty sweet internship-turned-job working at the Moz Plex. Still, like a good daughter/sister/niece, I try to visit the Mother Land... Read this post C By: ChildeRoland July 29, 2007 Miva Merchant 5 Module Developers, Shafting Their Customers Moz News So I'm not sure how many users within SEOmoz use Miva Merchant 5 as their ecommerce platform, but we've recently been approached by numerous companies complaining that their 2-4 year old sites have dropped out of Google, Yahoo and MSN completely. Now upon first glance, we assumed that the drop was caused by lack of activity, on and off page seo and tons of other things, however we... Read this post By: Rand Fishkin July 18, 2007 New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing Moz News As promised, SEOmoz has new rates for premium membership today: Monthly Subscription - now $49/month 6 Month Membership - now $249 (15% off monthly rate) 1 Year Membership - now $399 (32% off monthly rate) We've also got some very exciting new features for premium members. The first of these is the brainchild of Matt, who no... Read this post By: Rand Fishkin July 17, 2007 Advice on Landing Pages from the Experts, More Details on the SEOmoz Contest & Our First Landing Page Submission Moz News Yesterday's announcement of the SEOmoz premium landing page contest created an exceptional buzz - we've already had more than a dozen people contact us about creating their version of the document. In addition, I received some excellent advice from two experts in the field - Jon Mendez of OTTO Digital and Bryan Eisenberg of FutureNow. To help anyone and everyone who's in the field of landing pa... Read this post By: Rand Fishkin July 16, 2007 Announcing SEOmoz's Landing Page Competition Moz News Last week, Roberta Rosenberg at Copyblogger authored a piece that offered some terrific advice for SEOmoz's premium membership landing page. We wrote about ... Read this post By: Jane Copland July 13, 2007 The Fear of the Disconnect Moz News I am going on vacation today and there is one thing that concerns me a lot about my upcoming holiday. For the next nine days, I will have no access to the Internet. Absolutely none. Not even dial-up. Read this post By: Adam Green July 13, 2007 1993 Canadian Report on \"The Internet\" Moz News Up here in the great white north, we have a national news agency called the Canadian Broadcasting Corporation or CBC for short. Love or hate our national broadcaster, they certainly have some great archives. I came across this 6 minute video clip and laughed my hockey playing butt off. I am aware that this may be running the risk of being labelled a \"shallow blog post\" (full respect given to A.N.Onym and your last YouMoz post) but hopefully it will give you a good chuckle before your weekend. No, it doesn't really add much to the great SEO, PPC and general Internet Marketing discussion that we all know and love... but sometimes I have to laugh at how far our little \"Internet\" has come along. Read this post By: Rand Fishkin July 8, 2007 Making YOUmoz Work for You (and your clients) Moz News YOUmoz has been a fantastic experiment and one that we're really proud of. The community at YOUmoz is knowledgeable, dedicated and committed. We couldn't ask for more. With the growth of the UGC portal and an ever-increasing amount of traffic from search and referring links pointing to YOUmoz content, we thought we'd better illustrate how you can best levera... Read this post C By: Ciaran Norris July 6, 2007 Should A Comment Be Worth More Than A Thumb? Moz News Those of you who don't know me may be suprised than I'm a big of an ego searcher (no sniggering Rebecca & Lisa). This isn't due to any serious God complex or anything, it's just fact that blogging still gives me the childish thrill of seeing my name at the top of a published article. Which is quite somethi... Read this post By: Rand Fishkin June 29, 2007 Come Work for SEOmoz - We're Hiring a Developer in Seattle Moz News I just placed the following ad on Craigslist here in Seattle, and thought I'd share it here on the blog as well... Mighty LAMP Coders of Seattle, Heed Our Cry Don't be wooed by the big firms; come to a place where your talents are appreciated, y... Read this post By: Rand Fishkin June 17, 2007 Action Items for the Engines from the SMX Conference Moz News It feels cruel to give the search engineers at Yahoo!, Google, MSN & Ask more work, but I know that sometimes they might not have the best project tracking or distribution software, so I figured I'd be kind and make a list of items that need attention here in the blog, and they can refer to my post when they're wondering what to do with all their free time. ... Read this post O By: Oatmeal June 8, 2007 New SEOmoz Feature: SEO Q&A Moz News We're launching a new section for our premium members this morning: SEOmoz Q&A. This is a place where premium members can ask the SEOmoz staff SEO related questions and receive tips, advice, or just get pointed in the right direction. It works a bit like a trouble ticket system: discussions are opened, closed, rated, and eventual... Read this post C By: Ciaran Norris May 17, 2007 Happy Birthday Alan Moz News Like most people who have featured on YOUmoz, for me blogging is a pleasure. It allows me to play at being a journalist, as well as giving me a platform to talk about a subject that fascinates me, and hopefully even lets me spread some learning.However, for many people journalism is a very serious issue indeed. The reason I say this is that today (May 17th) is the 45th birthday of a man ... Read this post By: Rand Fishkin May 16, 2007 Censorsed Search Results in China Changing Moz News Si & I arrived late last night in Xi'an, in the Shaanxi province after 26+ hours of travel (which I don't recommend). Of course, I'm already set up online, trying to respond to dozens of emails, despite the us of an auto-responder. I think I'm feeling some empathy with Matt Cutts :) While here, I couldn't help myself but to conduct one of the most talked-about searches in regards to... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Apparently I Work for Google"
    },
    {
      "level": "H2",
      "text": "Miva Merchant 5 Module Developers, Shafting Their Customers"
    },
    {
      "level": "H2",
      "text": "New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing"
    },
    {
      "level": "H2",
      "text": "Advice on Landing Pages from the Experts, More Details on the SEOmoz Contest & Our First Landing Page Submission"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Announcing SEOmoz's Landing Page Competition"
    },
    {
      "level": "H2",
      "text": "The Fear of the Disconnect"
    },
    {
      "level": "H2",
      "text": "1993 Canadian Report on \"The Internet\""
    },
    {
      "level": "H2",
      "text": "Making YOUmoz Work for You (and your clients)"
    },
    {
      "level": "H2",
      "text": "Should A Comment Be Worth More Than A Thumb?"
    },
    {
      "level": "H2",
      "text": "Come Work for SEOmoz - We're Hiring a Developer in Seattle"
    },
    {
      "level": "H2",
      "text": "Action Items for the Engines from the SMX Conference"
    },
    {
      "level": "H2",
      "text": "New SEOmoz Feature:  SEO Q&A"
    },
    {
      "level": "H2",
      "text": "Happy Birthday Alan"
    },
    {
      "level": "H2",
      "text": "Censorsed Search Results in China Changing"
    }
  ],
  "author": "Rebecca Kelley\n          \n            ChildeRoland\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Jane Copland\n          \n            Adam Green\n          \n            Rand Fishkin\n          \n            Ciaran Norris\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Oatmeal\n          \n            Ciaran Norris\n          \n            Rand Fishkin"
}