{
  "url": "https://moz.com/blog/category/moz-news/p44",
  "slug": "p44",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin January 16, 2006 Martin Luther King Jr. Day in the US Moz News Dr. King is, to me, one of the greatest heroes of the modern era. Every year I find myself wishing I could do more to honor his memory and this year, there's a few sites on the web that are doing a great job: Reme... Read this post By: Rand Fishkin January 5, 2006 Ferry Halim's Orisinal Moz News No relation to SEO whatsoever, but Ferry Halim, a graphic and Flash game designer whose work astounds me has put together what is, in my opinion, his most addictive game yet. If you've never been to Orisinal, get ready to spend the rest of the ... Read this post By: Rand Fishkin January 2, 2006 Craigslist Blocks Search Engines Moz News According to a thread at SERoundtable, a few million results in Google (and other search engines) from Craigslist have dropped out due to a change in the robots.txt. The change must be very recent, as I had used Google to search CL just a week before the holidays. It's an interesting strategy from the classifieds giant - If anyon... Read this post By: Rand Fishkin December 30, 2005 Mick's Selling Syndik8 Moz News The infamous Black Hat SEO forums are for sale - Mick's done a good job building up the community there. Let's hope it stays in good hands. It sounds like offers should be $10K+, so make sure you're serious if you want to bid. The traffic and revenue details are also listed - I'd imagine it carries a valuable advertising spac... Read this post By: Rand Fishkin December 29, 2005 Ordered My New Laptop Today Moz News I ordered my brand new Dell Inspiron 6000 laptop today. I was swayed mostly by the widescreen SUXGA monitor, which allows for a resolution of 1920 x 1200, ... Read this post By: Rand Fishkin December 18, 2005 Ifish.net - An Amateur Webmaster's Dream Come True Moz News I got an email from Jen, who runs Ifish.net, a community fishing website that's got a lot of great things going for it, including a loyal visitor base of almost 100,000 (she's got logs here). Jen was looking for advice on where to take her business, and I directed her to cre8, where she's ... Read this post O By: Oatmeal December 13, 2005 SEO on Efnet IRC Moz News Internet Relay Chat (aka IRC) is an older form of communication on the internet. It's an online discussion system where you join \"channels,\" which are basically chat rooms. I frequent several technical channels but recently have been spending some time in one centered around SEO. The topics of discus... Read this post By: Rand Fishkin December 12, 2005 Recognizing my Team Moz News One of the most dissapointing features to the Newsweek article is that, despite my pleading, the editors chose not to feature any of the photos which included Matt & Kat - nor were they mentioned in the article, prompting Matt's mom to exclaim - \"you got robbed!\" Indeed they did, and, although it's a small condol... Read this post By: Rand Fishkin December 11, 2005 Newsweek Article Moz News It's been quite a week - first a slashdotting, now an article in Newsweek. The print edition is coming out tomorrow, but you can read the article online here. I think the title is supposed to be \"Hotwiring your Search Engine Ran... Read this post By: Rand Fishkin December 7, 2005 Slashdotted Moz News SEOmoz's Beginner's Guide was just Slashdotted. We'll see how the server holds up, but there's a lot of very big files to be accessed there... Sorry for any lag. More to report soon. UPDATE: The lag should be gone by now. We made some... Read this post By: Rand Fishkin December 7, 2005 9Rules Network - What am I Missing? Moz News I've been wanting to write about the 9 Rules Network for sometime now. They've got a good looking design, they link to some well-known (and little-known bloggers) and have a Web 2.0ey (just coined that adjective) feel that is backed up by ... Read this post By: Rand Fishkin December 7, 2005 New Yorker Licensing Cartoons Online Moz News The New Yorker magazine, which I read from time to time on vacation or long plane trips, has an online site - CartoonBank.com - that allows users to browse through their tens of thousands of cartoons (sorted by subject) a... Read this post By: Rand Fishkin December 5, 2005 Beginner's Guide Finally Finished Moz News For the last 4 weeks, I've been toiling away in my non-existant free time on a Beginner's Guide to SEO. My goal was to have a comprehensive document that I could reference to the many newcomers I engage through email, forums and in person. The final product is something I'm already proud of, though I hope to get even more feedback and improve it over time. I... Read this post By: Rand Fishkin December 1, 2005 Nick's 80/20 Rule & Your Thoughts on SEOmoz Moz News I've been trying to find something \"relevant\" to point to a Performancing, Nick Wilson & Patrick Gavin's new foray into the blog publishing sphere and ran into this - The 80/20 Rule of Focus. From Nick: The problem in brief is that some, and by my reckoning, many, blogger... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Martin Luther King Jr. Day in the US"
    },
    {
      "level": "H2",
      "text": "Ferry Halim's Orisinal"
    },
    {
      "level": "H2",
      "text": "Craigslist Blocks Search Engines"
    },
    {
      "level": "H2",
      "text": "Mick's Selling Syndik8"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Ordered My New Laptop Today"
    },
    {
      "level": "H2",
      "text": "Ifish.net - An Amateur Webmaster's Dream Come True"
    },
    {
      "level": "H2",
      "text": "SEO on Efnet IRC"
    },
    {
      "level": "H2",
      "text": "Recognizing my Team"
    },
    {
      "level": "H2",
      "text": "Newsweek Article"
    },
    {
      "level": "H2",
      "text": "Slashdotted"
    },
    {
      "level": "H2",
      "text": "9Rules Network - What am I Missing?"
    },
    {
      "level": "H2",
      "text": "New Yorker Licensing Cartoons Online"
    },
    {
      "level": "H2",
      "text": "Beginner's Guide Finally Finished"
    },
    {
      "level": "H2",
      "text": "Nick's 80/20 Rule & Your Thoughts on SEOmoz"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Oatmeal\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}