{
  "url": "https://moz.com/blog/category/moz-news/p45",
  "slug": "p45",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin November 28, 2005 SEOmoz and Wired Magazine Moz News As several of my close associates know, SEOmoz was to be featured in the January issue of Wired Magazine (which hits newsstands around Dec. 19). In October, Brad St... Read this post By: Rand Fishkin November 18, 2005 Professionals... Naked & In Underwear? Welcome to UPONG Moz News ISOS has done it again. Hot on the heels of SEMPO and SMA-NA, the ... Read this post By: Rand Fishkin October 31, 2005 SEOmoz Ranking Factors in 3rd Place Moz News Our ranking factors article from several weeks ago is now in 3rd place at del.icio.us SEO tags for all time most popular. 671 folks have tagged it to date and we're closing in on Vaughn's Google Ranking Factors List, wh... Read this post By: Rand Fishkin October 21, 2005 The Long Tail of Lego & How their Site Gets it Right Moz News I noticed this well thought-out post today from Chris Anderson at the Long Tail (which is a blog I've been mean... Read this post M By: mozUser1469147917838 October 20, 2005 SEO map Moz News A recent thread in SEOChat brought up this extremely cool and fun tool - SEO Map. This is one wicked and excellent idea to utilize Google services to connect business and professionals to each other. If you are not listed, ... Read this post By: Rand Fishkin October 20, 2005 Etsy - It's Froogle, but 10x Better Moz News Shopping on the web has never been cooler. This site - Etsy - is appealing in a way that I haven't seen in a long time. They've combined many of the latest \"Web 2.0\" trends into the store and amalgamated thousands of sellers into an online... Read this post By: Rand Fishkin October 14, 2005 Happy Birthday to Us Moz News SEOmoz turned 1 year old today. Our first post, way back on October 14th of last year shows just how far we've come. I'm really happy with the way this site has turned out and I have great things in mind (particularly with relation to the tools) o... Read this post By: Rand Fishkin October 14, 2005 Online Sketchbook Moz News Back in the late '90's, I was obsessed with Flash design. I spent countless hours animating text and building organic-styled site designs. I gave up on that a long time ago, when I realized that true designers had something I lacked (namely talent) and that hard work can only take you ... Read this post By: Rand Fishkin October 6, 2005 Ranking Factors Article Finally Finished Moz News Apologies for the long delay, but the search ranking factors article is now complete. Thanks to everyone who contributed; it's quite an impressive display of how much knowledge and experience professional SEOs can share when they get together on a project. There are now two formats, one where all of the comments left by the contrib... Read this post By: Rand Fishkin October 4, 2005 Welcome to Keijo Kortelainen Moz News SEOmoz welcomes to our posting team a 3rd member - Keijo Kortelainen of 2KMediat in Finland. It's a pleasure adding international flair to our editorial content and Keijo's first post on keyword research is a great one. I'm l... Read this post By: Rand Fishkin October 3, 2005 Neato - An Anchor Text Analysis Tool from WeBuildPages Moz News Neato is a great tool from WeBuildPages (Jim Boykin & Todd Malicoat's excellent SEO shop). It analyzes backlinks (up to 1000 at a time) and their respective anchor texts. It's actually insanely v... Read this post By: Rand Fishkin September 30, 2005 Simple Regression Tool Moz News This may not apply directly to a lot of SEOs, but an automated regression analysis is what allowed me to build most of the SEOmoz tools' reports accurately. This sweet l... Read this post By: Rand Fishkin September 27, 2005 Seeking Contributors Moz News With EGOL and I the loan wolves running SEOmoz, I think it's time to find some new talent to write for the site. SEOmoz, as you know, doesn't deliver copies of the daily headlines (although we occassionally give our take on big news). We're more focused on providing specific, daily tips and information that SEO/Ms and webmastesr can use in their site optimization efforts. If you're some... Read this post By: Rand Fishkin September 13, 2005 Cre8asite's Website Hospital Moz News The various webmaster and SEO/M forums on the web all offer their own versions of a peer review for member websites, but no one does as good a job as Cre8asite forums with their ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "SEOmoz and Wired Magazine"
    },
    {
      "level": "H2",
      "text": "Professionals... Naked & In Underwear? Welcome to UPONG"
    },
    {
      "level": "H2",
      "text": "SEOmoz Ranking Factors in 3rd Place"
    },
    {
      "level": "H2",
      "text": "The Long Tail of Lego & How their Site Gets it Right"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "SEO map"
    },
    {
      "level": "H2",
      "text": "Etsy - It's Froogle, but 10x Better"
    },
    {
      "level": "H2",
      "text": "Happy Birthday to Us"
    },
    {
      "level": "H2",
      "text": "Online Sketchbook"
    },
    {
      "level": "H2",
      "text": "Ranking Factors Article Finally Finished"
    },
    {
      "level": "H2",
      "text": "Welcome to Keijo Kortelainen"
    },
    {
      "level": "H2",
      "text": "Neato - An Anchor Text Analysis Tool from WeBuildPages"
    },
    {
      "level": "H2",
      "text": "Simple Regression Tool"
    },
    {
      "level": "H2",
      "text": "Seeking Contributors"
    },
    {
      "level": "H2",
      "text": "Cre8asite's Website Hospital"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}