{
  "url": "https://moz.com/blog/category/moz-news/p46",
  "slug": "p46",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin August 31, 2005 Got 15 Minutes? We've got a new SEO/M Exam Moz News After a much longer than expected delay from May, when I posted the original SEO Quiz, we've got a new, full-featured SEM Exam. It's fun and a great way to pass the last few lazy days of... Read this post By: Rand Fishkin August 26, 2005 If You're Going to San Francisco Moz News I'm heading out of town for the weekend (and an additional two days next week). We're landing in Oakland, but staying near Union Square in San Francsico from Saturday to Tuesday. While I'm away, EGOL will be blogging ... Read this post By: Rand Fishkin August 21, 2005 gVisit Moz News gVisit is a tool that you can install on your site to see where the last 20-100 visitors to your site came from geographically. It's nothing sophisticated, but it is another example of a site using Google's map API to create something unique, and building on the succes... Read this post By: Rand Fishkin August 1, 2005 RSS Discussions Moz News An excellent thread at SEOChat points out the defintion of RSS (Really Simple Syndication) and how it's use in websites for SEO purposes can help to boost things like pages indexed, fresh content, and the \"long tail\" of search visitors. In particular, several resources were pointed to: How to ... Read this post By: Rand Fishkin July 26, 2005 Let's Talk about Your Workspace Moz News Today I found my way over to some of CNET's more personalized content, a section on home office pohots sent in by users. Of course, CNET offers their own guidelines as to what you should buy to improve the space, and links to the stuff you already have so readers can bu... Read this post By: Rand Fishkin July 26, 2005 The Slowest Loading Community Portals on the Web Moz News One of the largest online tech communities is the world-wide phenomenon of web, graphic & media designers. This illustrative and overflowing group floods the web with portal communities that take 10 minutes to download, even with a broadband connection. Th... Read this post By: Rand Fishkin July 24, 2005 Pack Your Website Bags Moz News One of the big time spammers at SEOChat - Geoffrey of Syndk8 - has posted a great advice thread on the value of having a quick and easy exit from your website host. Geoff's host caught on to some of his nefarious practices and apparently doesn't approve, so he's been in a bit of a spot. Donna... Read this post By: Rand Fishkin July 15, 2005 Bum Rush the SEOmoz Tools Moz News We're nearing completion of the fixes, error removals and problems associated with the SEOmoz tools, but we need your help. When the tools get slammed is when they're at their most vulnerable, so we invite you today to run all the reports you've been putting off and see how accurate our data is - some tools are still returning bad results, but ... Read this post By: Rand Fishkin July 11, 2005 A New Home Page Moz News On the suggestion of a friend, I've changed my home page to a new location, Wikipedia's Random Article page - it's a special feature and has to be manually entered as the home page for your web browser, but it's a great way to learn something new every time you start surfing. If it bogs down workflow too much, I may change back, but for ... Read this post By: Rand Fishkin July 1, 2005 Blogging about Morgan Spurlock's 30 Days Moz News Most people will recognize the name Morgan Spurlock from the famous documentary he made last year - SuperSize Me. He's also the author of Don't Eat this Book (a play on Abbie Ho... Read this post By: Rand Fishkin June 29, 2005 Posting Light Today Moz News Due to my work schedule being overwhelmingly busy today, I won't be posting much. I feel bad about this, since my loyal readers - you - have been kind enough to drop by. There are a few interesting things taking place in the SEO world that are worth reading about: Kim Krause-Berg is talking about... Read this post By: Rand Fishkin June 13, 2005 SEO Browser Moz News Ian McAnerin & Anduro Technologies have put together a very clever and useful tool called the SEO Browser. The site acts as an interpreter, giving you an opporunity to view a we... Read this post By: Rand Fishkin June 2, 2005 What is SEOmoz Planning? Moz News SEOmoz is re-launching around the end of next week with a slightly updated look and feel, along with some other new items, which I've listed below: The SEO Tools will have 2 dedicated servers to reduce wait times A new link pricing tool is complete and await... Read this post By: Rand Fishkin May 31, 2005 OpenRank & PageRank - Options for Moving Forward Moz News As most SEOs in the business know, PageRank in Google's toolbar was unavailable over the Memorial Day weekend. This naturally led to many people asking questions about whether PR had dissapeared forever and if it had, whether a private-party solution could be c... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "Got 15 Minutes? We've got a new SEO/M Exam"
    },
    {
      "level": "H2",
      "text": "If You're Going to San Francisco"
    },
    {
      "level": "H2",
      "text": "gVisit"
    },
    {
      "level": "H2",
      "text": "RSS Discussions"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Let's Talk about Your Workspace"
    },
    {
      "level": "H2",
      "text": "The Slowest Loading Community Portals on the Web"
    },
    {
      "level": "H2",
      "text": "Pack Your Website Bags"
    },
    {
      "level": "H2",
      "text": "Bum Rush the SEOmoz Tools"
    },
    {
      "level": "H2",
      "text": "A New Home Page"
    },
    {
      "level": "H2",
      "text": "Blogging about Morgan Spurlock's 30 Days"
    },
    {
      "level": "H2",
      "text": "Posting Light Today"
    },
    {
      "level": "H2",
      "text": "SEO Browser"
    },
    {
      "level": "H2",
      "text": "What is SEOmoz Planning?"
    },
    {
      "level": "H2",
      "text": "OpenRank & PageRank - Options for Moving Forward"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}