{
  "url": "https://moz.com/blog/category/moz-news/p47",
  "slug": "p47",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin May 24, 2005 The SEOmoz Quiz Moz News I whipped together something fun for the SEO community to do on their respective lunchbreaks today - the SEOmoz Quiz. It's fun, light-hearted and easy to cheat on (but don't do that 'cause you'll spoil all the fun). Anyone who gets a perfect s... Read this post By: Rand Fishkin April 25, 2005 Google Images & Concept Guessing Game Moz News Nacho from SEW points to an excellent site that uses Google's image results in Flash to create a guessing game. The object is to determine, as quickly as possible, what the que... Read this post By: Rand Fishkin April 21, 2005 A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims Moz News Shawn Hogan, the operator of the DigitalPoint forums, tools & ... Read this post By: Rand Fishkin April 21, 2005 Integration of Craigslist & Google Maps Moz News Craigslist's directory of real estate for rent and sale has long been the very best the Internet has to offer for those searching for housing in metropolitan areas. Now, Paul Rademacher has combined Craigslist's RSS... Read this post By: Rand Fishkin April 11, 2005 Gerunding & the Progression of Language Moz News Today's International Herald Tribune has an article on the bastardization of English words into strange pseudo-related meanings in other languages. The piece, Meanwhile: The world is Englishing, den... Read this post By: Rand Fishkin April 7, 2005 The Balance between Form & Function Moz News Purskincare, a cosmetics company based in the UK, has been asking for some advice on Cre8asite forums. The website itself is quite a looker - clearly designed by s... Read this post By: Rand Fishkin April 6, 2005 American Apparel's Online Store Moz News American Apparel is a very clean, alternative look at the clothing industry as a whole and it's well-reflected on their highly simplistic but ultimately seductive website. The online store does a particularly good job expre... Read this post By: Rand Fishkin April 5, 2005 NetDisaster Moz News Paralleling the topic of yesterday's \"humor as link-building\" subject, today I've stumbled across a site called NetDisaster that will take a given URL and turn the page into a private battlefield for Martians, meteors and other untimely disasters.... Read this post By: Rand Fishkin March 22, 2005 Craigslist & the Power of a Free Community Moz News Craig Newmark has put together one of the most revolutionary, popular and well-thought out communities on the web. It's 1996 style design has not inhibited growth, but rather allowed the community to flourish and the largely free model has created a competitor fo... Read this post By: Rand Fishkin March 13, 2005 Content Sourcing with Creative Commons Moz News A great source for content, especially images & tools is the Creative Commons licensing website. The search system enables you to find the content you're seeking and also provides a great outlet for developers looki... Read this post By: Rand Fishkin March 9, 2005 SWOOP - An Ontology Browser Moz News What is an ontology? In case you're disinclined to follow the link, I've quoted Wikipedia's excellent article on the subject: In computer science, an ontology... Read this post By: Rand Fishkin February 23, 2005 Yellow Shoes @ NYC SES Moz News It may seem unconventional to wear yellow sneakers with a suit, but that's what I'll be in on Monday the 28th - the first day of the Search Engine Strategies Conference. Look for a touch of yellow on the floor if you'd like to chat and feel free to criticize my Seattle fashion ... Read this post By: Rand Fishkin January 30, 2005 Scientific American Covers the World of Search Moz News An excellent, in-depth article from the Scientific American was published earlier this week. The article goes deep inside the search industry and discusses many of the cutting edge technologies and ideas that are propelling the growth and innovatio... Read this post By: Rand Fishkin January 18, 2005 Folksonomies Moz News An impressive new idea from the world of librarians, cataloguers and other reference technicians called Folksonomies has taken root in the world of web search. This new technology exploits users' time to classify and meta-label the web through browsing. The promise of this new categorization syte... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "The SEOmoz Quiz"
    },
    {
      "level": "H2",
      "text": "Google Images & Concept Guessing Game"
    },
    {
      "level": "H2",
      "text": "A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims"
    },
    {
      "level": "H2",
      "text": "Integration of Craigslist & Google Maps"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Gerunding & the Progression of Language"
    },
    {
      "level": "H2",
      "text": "The Balance between Form & Function"
    },
    {
      "level": "H2",
      "text": "American Apparel's Online Store"
    },
    {
      "level": "H2",
      "text": "NetDisaster"
    },
    {
      "level": "H2",
      "text": "Craigslist & the Power of a Free Community"
    },
    {
      "level": "H2",
      "text": "Content Sourcing with Creative Commons"
    },
    {
      "level": "H2",
      "text": "SWOOP - An Ontology Browser"
    },
    {
      "level": "H2",
      "text": "Yellow Shoes @ NYC SES"
    },
    {
      "level": "H2",
      "text": "Scientific American Covers the World of Search"
    },
    {
      "level": "H2",
      "text": "Folksonomies"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}