{
  "url": "https://moz.com/blog/category/moz-news/p7",
  "slug": "p7",
  "title": "Moz News - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis May 14, 2019 The New Moz Local Is on Its Way! Local SEO | Moz News The secret's ready to share: a new Moz Local is coming your way this June! Check out what you can expect to see from us in the next month as we continue to evolve our solutions for local SEO and help you grow your business. Read this post By: PJ Howland May 8, 2019 MozCon 2019: Acceptance. Education. Donuts SEO Events | Marketing Industry | Moz News We could tell you what it's like to attend MozCon — but why not hear from someone who's actually been? Read this post By: Brian Childs May 1, 2019 Announcing the New Moz SEO Essentials Certification: What It Is & How to Get Certified Moz News | SEO Basics Does Moz offer an SEO certification? As of today, the answer is an enthusiastic YES! Check out the details on our new SEO Essentials certification and how you can earn shiny new credentials to show off on your LinkedIn profile. Read this post By: Cheryl Draper May 1, 2019 Give it up for Your MozCon 2019 Community Speakers! SEO Events | Marketing Industry | Moz News After much deliberation, we’re confident these six community speakers are going to be a great addition to the MozCon Stage. Read this post By: Felicia Crawford April 1, 2019 Now Live for Your SEO Learning Pleasure: The NEW Beginner's Guide to SEO! SEO Basics | Moz News It's here! It's here! The brand-new Beginner's Guide to SEO is live and ready to teach another generation of SEOs all about how to optimize sites for both searchers and search engines alike. Read this post By: Cheryl Draper March 27, 2019 MozCon 2019: The Initial Agenda SEO Events | Marketing Industry | Moz News Take a gander at who you'll see on stage this year, along with some of the topics we've already worked out. Read this post By: Roger MozBot March 14, 2019 Our Own Sarah Bird Joins the 2019 Class of Henry Crown Fellows! Moz News Please join us in congratulating Sarah Bird on her acceptance into the 2019 class of Henry Crown Fellows. We can't wait to see what the future holds! Read this post By: Russ Jones February 5, 2019 A New Domain Authority Is Coming Soon: What’s Changing, When, & Why Link Building | Moz News We're improving our Domain Authority algorithm on March 5th, 2019. Learn more, download helpful resources to share with clients and colleagues, and get ready for our most accurate authority score to date! Read this post By: Dr. Peter J. Meyers October 11, 2018 Why We're Doubling Down on the Future of SEO - Moz + STAT Moz News | Marketing Industry Search is changing, but search marketing is alive and well. We have to meet the challenge of new complexities, and that's why Moz and STAT are teaming up to double-down on search analytics. Read this post By: Sarah Bird October 10, 2018 Moz Acquires STAT Search Analytics: We're Better Together! Moz News We're thrilled to announce our new partnership with STAT Search Analytics! Check out Sarah & Rob's fireside chat and please celebrate with us as we chart the future of SERP analytics together. Read this post By: Hayley Bowyer October 2, 2018 A Slice of MozCon Magic: The 2018 Video Bundle is HERE! Moz News | SEO Events The MozCon 2018 video bundle is here! Grab your copy and get a taste of this year's MozCon event with a free video of Dr. Pete's talk, \"Ranking is a Promise: Can You Deliver?\" Read this post By: Dr. Peter J. Meyers August 21, 2018 NEW On-Demand Crawl: Quick Insights for Sales, Prospecting, & Competitive Analysis Moz Tools | Technical SEO | Moz News On-Demand Crawl lets you quickly crawl any site, even without a Campaign. Learn how On-Demand can yield immediate insights for sales, prospecting, and competitive intelligence. Read this post By: Felicia Crawford June 25, 2018 How to Rock MozCon 2018 Like the Marketing Superhero You Are SEO Events | Moz News MozCon is just around the corner, meaning it's time to share one of our absolute favorite posts of the year: the semi-official MozCon Guide to Seattle! Check out all the fun details and start daydreaming about 3 days in the Emerald City with our firsthand suggestions. Read this post By: Neil Crist June 20, 2018 Moz's Mid-Year Retrospective: Exciting Upgrades from the First Half of 2018 Moz News | Moz Tools It's been a busy year so far for the folks behind the scenes here at Moz. We've been working around the clock to upgrade and improve our products across the board — check out what's new in just the first half of 2018! Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz News"
    },
    {
      "level": "H2",
      "text": "The New Moz Local Is on Its Way!"
    },
    {
      "level": "H2",
      "text": "MozCon 2019: Acceptance. Education. Donuts"
    },
    {
      "level": "H2",
      "text": "Announcing the New Moz SEO Essentials Certification: What It Is & How to Get Certified"
    },
    {
      "level": "H2",
      "text": "Give it up for Your MozCon 2019 Community Speakers!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Now Live for Your SEO Learning Pleasure: The NEW Beginner's Guide to SEO!"
    },
    {
      "level": "H2",
      "text": "MozCon 2019: The Initial Agenda"
    },
    {
      "level": "H2",
      "text": "Our Own Sarah Bird Joins the 2019 Class of Henry Crown Fellows!"
    },
    {
      "level": "H2",
      "text": "A New Domain Authority Is Coming Soon: What’s Changing, When, & Why"
    },
    {
      "level": "H2",
      "text": "Why We're Doubling Down on the Future of SEO - Moz + STAT"
    },
    {
      "level": "H2",
      "text": "Moz Acquires STAT Search Analytics: We're Better Together!"
    },
    {
      "level": "H2",
      "text": "A Slice of MozCon Magic: The 2018 Video Bundle is HERE!"
    },
    {
      "level": "H2",
      "text": "NEW On-Demand Crawl: Quick Insights for Sales, Prospecting, & Competitive Analysis"
    },
    {
      "level": "H2",
      "text": "How to Rock MozCon 2018 Like the Marketing Superhero You Are"
    },
    {
      "level": "H2",
      "text": "Moz's Mid-Year Retrospective: Exciting Upgrades from the First Half of 2018"
    }
  ],
  "author": "Miriam Ellis\n          \n            PJ Howland\n          \n            Brian Childs\n          \n            Cheryl Draper\n          \n            Felicia Crawford\n          \n            Cheryl Draper\n          \n            Roger MozBot\n          \n            Russ Jones\n          \n            Dr. Peter J. Meyers\n          \n            Sarah Bird\n          \n            Hayley Bowyer\n          \n            Dr. Peter J. Meyers\n          \n            Felicia Crawford\n          \n            Neil Crist"
}