{
  "url": "https://moz.com/blog/category/public-relations/p16",
  "slug": "p16",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rebecca Kelley November 16, 2006 All The Female Bloggers Say Heyyyy!...Hello? Ladies? Public Relations Kim Krause Berg recently raised a stink on her Cr8pc blog, criticizing the utter absence of female bloggers interviewed for Google Blogoscoped's Popular Blog Posts entry. In her blog, she protested that female bloggers have a lot more to juggle than a couple unique blog entries ... Read this post M By: mozUser1469147917838 November 5, 2006 The funny little thing called TRUST Public Relations Understanding and managing trust is an essential skill in search engine business. In terms of sociology, trust is the willing acceptance of one's power to affect another - allowing actions that otherwise would not be possible. Trust is a mighty tool when it comes to signing up new clients, achieving credentials and referrers or building a (social) network... Read this post By: Rand Fishkin November 3, 2006 When Search Marketing Firms Turn Clients Away Public Relations Thanks to a small team and a lot of publicity, SEOmoz turns away a significant amount of work - sending folks to specific references or our recommended list or, occassionally, recommending they hire in-house SEO help. We're lucky in that we get to picky about the folks we choose to work with - some of the reasons for turning away busi... Read this post By: Rand Fishkin November 3, 2006 SEO Salaries - How Much Should You Make (updated Jan. 2011) Public Relations This is going to be a tough and contentious issue and one that isn't easy for me to write about. Along with the obvious internal conflicts of interest in disclosing salary numbers, there's bound to be a lot of companies and individuals who will come away feeling that my numbers are wrong (or that their employers are cheating them). That said, it's a topic that needs to be addressed and if my ex... Read this post By: Rand Fishkin October 26, 2006 InfoSearch Media & ContentLogic - Purveyors of Falsehoods Public Relations I spent some time on the phone today with William Stinson from InfoSearch Media (link condom applied). They had cold called an old client (and friend) of mine who referred them to us. I spent a good 20 minutes chatting with William to attempt to understand their business model and their services. I took a few ... Read this post By: Rand Fishkin October 9, 2006 Daniel Dessinger - Accusing SEOs without Evidence Public Relations Last Friday, Donna wrote about an article in Google News on Breaking SEO Myths. The article suggests that SEOs are primarily scam artists (not a new accusation by any means) and that even the... Read this post M By: mozUser1469147917838 October 3, 2006 The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc. Public Relations I know country specific posts are not of large interest, but since SEOmoz has European readers I decided to give a short rundown of what’s happening in Finnish (and Scandinavian) SEO markets this autumn.SEO is a hot topicSEO and internet marketing is finally catching fire in Finland – news articles are published every now and then, and some even... Read this post By: Rebecca Kelley September 29, 2006 Apparently Black Hats Can't Reform Their Evil Ways Public Relations Via Slashdot, I came across this entertaining article at ZDNet called \"Do Former Black Hats Make Good Hires?\" It asks the brain-busting question of whether black hats should be hired for legit positions. The article approaches the question as if it has the same moral weight of \"Shuld We Treet Coloreds... Read this post By: Rebecca Kelley September 19, 2006 What's the ROI on an MBA When You're in the SEO Industry? Public Relations Although I've had my Bachelor's degree for less than a year, I've already begun considering going back to school for a Master's degree. Working in the SEO industry has sparked an interest in getting an MBA (a Master's in Business Administration for you initialism-inept readers). My desire to get an MBA doesn't stem from the notion that more degrees = better pay (though it does); rather, in this in... Read this post By: Rebecca Kelley September 19, 2006 MarketingSherpa States That SEM Clients Aren't Multiplying Like Wet Gremlins Public Relations Via Threadwatch, I came across MarketingSherpa's report on the SEM industry's growth over the past two years. While it appears that SEM is on the up and up--staffing for top SEM firms has increased 75% from 2005, and \"six firms [reported] more than $10 million in SEM revenue... Read this post By: Rebecca Kelley September 6, 2006 SEO Terms That Make You Go 'Huh?' Public Relations Every industry has its own jargon, and SEO is no exception. Since there are no interviews scheduled today and I actually have some down time (shhhh, don't tell Rand, or he'll make me scrub his Pumas again), I thought I'd share my picks for SEO terms that make you go \"Huh?\" These are terms that almost always require some sort of explanation, since the words associated with the ideas or ph... Read this post By: Rand Fishkin September 5, 2006 Andy Beal's Top 10 SEM Agency Mistakes Public Relations Barely had time to read it, but I have to share - Top 10 Business Mistakes Search Marketing Firms Make. Which ones am I guilty of? #3 - Their Business Doesn’t Scale #7 - They Rely On One “Expert” to Provi... Read this post By: Rand Fishkin August 29, 2006 What Danny Sullivan's Departure Means to this Industry Public Relations For nearly 10 years, Danny Sullivan has been a leader in the field of search and search marketing. Today, he's departing from SearchEngineWatch & the Search Engine Strategies conference series: I love both the site and the conference series. I hate to say goodbye to them. Th... Read this post By: Rand Fishkin August 22, 2006 Why Canadians are the Best SEOs Public Relations In conversation today at the office, we found ourselves mulling over the disproportionate number of search marketing folks who hail from or live in Canada (aka hockey-land). In trying to ascertain what environmental or cultural factors might account for the propensity of the maple-minded to seek employment in the search field, we came across a few ideas: Canadians are disturb... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "All The Female Bloggers Say Heyyyy!...Hello? Ladies?"
    },
    {
      "level": "H2",
      "text": "The funny little thing called TRUST"
    },
    {
      "level": "H2",
      "text": "When Search Marketing Firms Turn Clients Away"
    },
    {
      "level": "H2",
      "text": "SEO Salaries - How Much Should You Make (updated Jan. 2011)"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "InfoSearch Media & ContentLogic - Purveyors of Falsehoods"
    },
    {
      "level": "H2",
      "text": "Daniel Dessinger - Accusing SEOs without Evidence"
    },
    {
      "level": "H2",
      "text": "The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc."
    },
    {
      "level": "H2",
      "text": "Apparently Black Hats Can't Reform Their Evil Ways"
    },
    {
      "level": "H2",
      "text": "What's the ROI on an MBA When You're in the SEO Industry?"
    },
    {
      "level": "H2",
      "text": "MarketingSherpa States That SEM Clients Aren't Multiplying Like Wet Gremlins"
    },
    {
      "level": "H2",
      "text": "SEO Terms That Make You Go 'Huh?'"
    },
    {
      "level": "H2",
      "text": "Andy Beal's Top 10 SEM Agency Mistakes"
    },
    {
      "level": "H2",
      "text": "What Danny Sullivan's Departure Means to this Industry"
    },
    {
      "level": "H2",
      "text": "Why Canadians are the Best SEOs"
    }
  ],
  "author": "Rebecca Kelley\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            mozUser1469147917838\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}