{
  "url": "https://moz.com/blog/category/public-relations/p20",
  "slug": "p20",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin October 21, 2005 SERPs You Can't Understand Public Relations With this latest update from Google, we've been noticing some very odd things in the SERPs. Despite our best instincts and measurements of link quality, quantity and optimization, sites seem to be ranking in very strange orders. In the hopes of making greater sense of things, we wondered if you'd like to list your top search results that make no sense. No need to point out your site or those of... Read this post By: Rand Fishkin October 20, 2005 Bad Information from SEO-News Public Relations Following Nick's lovely recommendations for community building, I'll be doing a bit of link baiting in this thread. Actually, that's a lie; I'm just ticked off about this article from SEO News' Rob Sullivan about a conference call he had with some Google employees. I'll just refute... Read this post By: Rand Fishkin October 6, 2005 Boardtracker Public Relations At SEW, Orion points out a great service called Boardtracker that Chris Sherman mentioned earlier. Th... Read this post By: Rand Fishkin October 3, 2005 Threadwatch is 1 year old Public Relations It's hard to believe that Threadwatch is only a year old (today). In that time, Nick has taken the site from obscurity to infamy. They've been Slashdotted, added to major blogrolls all around the search and technology industries and created a hotbed for SEO/M and search politics. Congratulations, Nick. I hope SEOmoz can do half as well in a yea... Read this post By: Rand Fishkin September 29, 2005 Anatomy of a Forum Thread Public Relations Kim Krause Berg posted a hilarious topic over at Cre8asite on the subject of a forum thread on light bulb changing. Naturally, her fellow SEO forum members chipped in with their own personal takes on the post and ma... Read this post By: Rand Fishkin September 19, 2005 In SEO, Do You Get What You Pay For? Public Relations Search Engine Optimization has been described as an art, a science, a practice, an abomination and a career by those in and around the industry. But, to most outsiders learning about the practice for the first time, SEO is primarily seen as a service that professionals provide to clients. Although I'm often in the professional seat, I have become a client of many well known SEOs and secondary p... Read this post By: Rand Fishkin August 23, 2005 Sample SEO Contract Public Relations DazzlinDonna has a pre-made SEO contract that might be useful for those who run smaller operations and need a hand getting started in contract design. It's by no means over-arching, but it's an excellent place to start and it's free. She also has a good, basic description of the specific tasks that fit into SEO work: ... Read this post By: Rand Fishkin August 8, 2005 Actions to Take for Non-Payment Public Relations Traian, a member at SEW, is asking for help in what to do regarding a client who will not pay for a verbal contract which he completed. The discussion is fascinating as both ethical and legal issues ari... Read this post By: Rand Fishkin August 3, 2005 In the Summertime, When the Weather is Hot... Public Relations The lazy days of summer crawl in North America & Europe, creating a bevvy of webmasters who fret and furrow their brows, wondering where the traffic has gone. This \"summer slump\" is an observable phenomenon every year in industries of all types as workers in t... Read this post By: Rand Fishkin August 2, 2005 Black Hats Hiring Public Relations There's an opening for a \"Black Hat\" position with a company in Toronto, ON. It looks like they're desperate, as they've opened the position to candidates worldwide. Incubator has opened a thread at SEW on the subject and is requesting e-mails go to waynec_at_yellowmediainc.com. I'm not sure if an... Read this post By: Rand Fishkin July 27, 2005 Breaking an SEO Contract Public Relations Invitationsgirl at SEOChat asks - Can I get out of my SEO Contract? There's quite a bit of good advice about contracts in general and SEO specifically in this thread, but mostly what we're seeing here is the forums serving as a business refuge and tool. There's several individuals in the thread who are p... Read this post By: Rand Fishkin July 27, 2005 An SEO Dream Job Public Relations While many in SEO, myself included, pride themselves on being independent contractors or owners of small firms (in my case), there are others who are seeking that prestigious, well paying position in the Internet industry that will provide security, challenges and a fun work environment. ... Read this post By: Rand Fishkin July 20, 2005 Organic SEO Wiki Public Relations An old idea of mine was to produce a wiki for SEO. Happily, someone else has taken on the project (as I really never got around to it). It's called Organic SEO and it's got a fairly good basic walkthrough of the principles of optimization already. I u... Read this post By: Rand Fishkin July 4, 2005 SEO's Grim Reaper Public Relations Threadwatch has a terrific (though poorly titled) thread (hats my arse) today on the demise of SEO. There are intelligent opinions from both sides, primarily in the comments on Nick's somewhat over-the-top post - a response to a ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "SERPs You Can't Understand"
    },
    {
      "level": "H2",
      "text": "Bad Information from SEO-News"
    },
    {
      "level": "H2",
      "text": "Boardtracker"
    },
    {
      "level": "H2",
      "text": "Threadwatch is 1 year old"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Anatomy of a Forum Thread"
    },
    {
      "level": "H2",
      "text": "In SEO, Do You Get What You Pay For?"
    },
    {
      "level": "H2",
      "text": "Sample SEO Contract"
    },
    {
      "level": "H2",
      "text": "Actions to Take for Non-Payment"
    },
    {
      "level": "H2",
      "text": "In the Summertime, When the Weather is Hot..."
    },
    {
      "level": "H2",
      "text": "Black Hats Hiring"
    },
    {
      "level": "H2",
      "text": "Breaking an SEO Contract"
    },
    {
      "level": "H2",
      "text": "An SEO Dream Job"
    },
    {
      "level": "H2",
      "text": "Organic SEO Wiki"
    },
    {
      "level": "H2",
      "text": "SEO's Grim Reaper"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}