{
  "url": "https://moz.com/blog/category/public-relations/p3",
  "slug": "p3",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Liam Curley December 17, 2015 Here’s How We Found Success By Using A PR Tactic For Agency Outreach Public Relations Ready to take outreach beyond email and phone calls? Read this post By: Simon Penson November 18, 2015 The Content Marketing Campaign Playbook – Guaranteeing Success in 2016 Content Marketing | Public Relations | Social Media Planning your content marketing campaigns for 2016? This indispensable guide will help you ensure each one is a hit all the way through. Plus, a free downloadable campaign planner! Read this post By: Rand Fishkin September 25, 2015 How to Hack the Amplification Process Whiteboard Friday | Public Relations In a special Whiteboard Friday filmed for the Turing Festival in Scotland, Rand takes an in-depth look at how to amplify your tools and content to the right audiences. Read this post By: Rand Fishkin August 28, 2015 How to Get Content into the Hands of Influencers Who Can Help Amplify It Whiteboard Friday | Public Relations Influencers in your industry can serve as megaphones for your content, but you have to earn their attention and appreciation first. In today's Whiteboard Friday, Rand shows you how. Read this post By: Christopher Long June 18, 2015 How Winning an Award Helped Us Refine Our Outreach Public Relations Is your outreach falling on deaf ears? Use these tips to add some oomph to your messages and get your emails returned. Read this post By: Beverley Reinemann February 9, 2015 Effective Outreach: Making It as Easy as Possible for Journalists to Say \"Yes\" Public Relations When reaching out to journalists for coverage, some techniques will get you noticed, while others are a one-way ticket to the trash. This post gives you an overview of the former. Pro Tip: These tips are applicable to all kinds of outreach, not just to journalists! Read this post By: Samuel Scott February 1, 2015 How to Approach Owned and Earned Media Content Marketing | Branding | Public Relations The core of a sound content marketing strategy is the wise use of both owned and paid media. Samuel Scott explains in this post. Read this post By: Samuel Scott November 16, 2014 The Coming Integration of PR and SEO Advanced SEO | Marketing Industry | Public Relations Looking to enhance the digital footprint of your brand but not sure where to start? Smartly deploy PR and SEO to propel your business toward success. We show you how to integrate them seamlessly. Read this post By: Simon Penson September 11, 2014 The Marketer's Guide to Facebook Graph Search Content Marketing | Public Relations | Social Media This post looks at how Facebook Graph Search is improving and, as a result, is becoming one of the most powerful tools around for the modern marketer. Read this post By: Jessica Edmondson September 1, 2014 The Why, What, and How of Blogger Outreach for Your Clients Public Relations Blogger outreach campaigns have gained popularity with big brands like Ford and eBay Deals hopping on the bandwagon. But why does blogger outreach help brands, and more importantly, how will it help your client? Overall, this post serves to gives you a why, what and how glimpse inside blogger promotion. Read this post By: Carson Ward June 24, 2014 Is Your Content Credible Enough to Share? Content Marketing | Link Building | Public Relations People don't share content that isn't credible. Credibility gets mentioned in passing as something content needs, but little has been said about how to build it. This is your guide. Read this post By: Samuel Scott March 5, 2014 An Introduction to PR Strategy for SEOs Public Relations | Branding Jen Lopez and Everett Sizemore invited me to elaborate on the \"PR side of SEO\" in a detailed Moz post. Here's that post! Read this post By: Larry Kim January 6, 2014 How to Get on National TV Public Relations Last month, I was on Fox Business News. How did this happen? In this column, I’ll share a step-by-step, replicable process you can use to get yourself on TV. Read this post By: Jennifer Sable Lopez April 26, 2012 Community: The Inbound Resource You Forgot About Public Relations Remember a time when “community” meant the neighborhood or town you lived in? Or when a business only had to be concerned with making customers happy when they were inside their store? It’s sometimes hard to remember what life was like before online communities became such commonplace. But the fact of the matter is that online communities are where we spend most of our time ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "Here’s How We Found Success By Using A PR Tactic For Agency Outreach"
    },
    {
      "level": "H2",
      "text": "The Content Marketing Campaign Playbook – Guaranteeing Success in 2016"
    },
    {
      "level": "H2",
      "text": "How to Hack the Amplification Process"
    },
    {
      "level": "H2",
      "text": "How to Get Content into the Hands of Influencers Who Can Help Amplify It"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How Winning an Award Helped Us Refine Our Outreach"
    },
    {
      "level": "H2",
      "text": "Effective Outreach: Making It as Easy as Possible for Journalists to Say \"Yes\""
    },
    {
      "level": "H2",
      "text": "How to Approach Owned and Earned Media"
    },
    {
      "level": "H2",
      "text": "The Coming Integration of PR and SEO"
    },
    {
      "level": "H2",
      "text": "The Marketer's Guide to Facebook Graph Search"
    },
    {
      "level": "H2",
      "text": "The Why, What, and How of Blogger Outreach for Your Clients"
    },
    {
      "level": "H2",
      "text": "Is Your Content Credible Enough to Share?"
    },
    {
      "level": "H2",
      "text": "An Introduction to PR Strategy for SEOs"
    },
    {
      "level": "H2",
      "text": "How to Get on National TV"
    },
    {
      "level": "H2",
      "text": "Community: The Inbound Resource You Forgot About"
    }
  ],
  "author": "Liam Curley\n          \n            Simon Penson\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Christopher Long\n          \n            Beverley Reinemann\n          \n            Samuel Scott\n          \n            Samuel Scott\n          \n            Simon Penson\n          \n            Jessica Edmondson\n          \n            Carson Ward\n          \n            Samuel Scott\n          \n            Larry Kim\n          \n            Jennifer Sable Lopez"
}