{
  "url": "https://moz.com/blog/category/public-relations/p5",
  "slug": "p5",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin February 15, 2011 The Next Generation of Ranking Signals Public Relations Every 3-4 years, there's a big shift or addition to the key metrics Google (and, to a lesser extent MSN/Bing and Yahoo!) uses to order competitive search results. 1996-1999: On-page keyword usage + meta data 1999 - 2002: PageRank + On-page 2002 - 2005: Anchor text + Domain name + PageRank + On-Page 2005 - 200... Read this post M By: Mark Collier February 4, 2011 The Bing Sting Facts: Why Bing Isn't Copying Google Public Relations For anyone who hasn't been following this week/last week's whole Google and Bing copying and not copying saga, let me fill you in. Google noticed late last year that Bing were showing the same result as Google for a misspelled query (torsorophy which should have been spelt, tarsorrhaphy). But Bing showed no spelling correction in their result. The news was broken via Danny Sullivan in another great investigative journalistic pieces. Read this post T By: Tom Critchlow February 1, 2011 Summary of the #FutureSearch Talk with Google, Bing & Blekko Public Relations Wow. Today has been interesting - I woke up to the news that Bing copies Google search results and I've ended my day watching a live cast debate between Google, Bing and Blekko over on BigThink.This post wraps up some of my thoug... Read this post By: Rand Fishkin February 1, 2011 Is SEO Immoral? Public Relations Inquiring Quorites want to know: Is SEO immoral? We search for relevance via the search engine. By learning and manipulating the system to accomplish its goal, SEO makes it more likely that you will come upon a target that is irrelevant. Thereby, wasting... Read this post By: Rand Fishkin January 5, 2011 Help Us Build the 2011 Search Ranking Factors Public Relations 2011 is here, and that means it's time for our biennial search engine ranking factors survey to be renewed. This year, we're planning something much bigger and, we hope, better. Our plan is to offer a report that provides: Aggregated expert opinions on the importance of factors individually and ranking influencers ove... Read this post J By: Jamie Steven December 10, 2010 SEOmoz Pie Eating Contest Live at Noon Pacific Today! Public Relations As 2010 comes to an end we've got a lot to celebrate at SEOmoz, so today we've decided to take a little break and do something completely silly: we're having a pie eating contest, and you can watch the recording now. Read this post K By: KenSpeckle-138545 November 25, 2010 SEO Beyond the Instant Public Relations There's been a lot of discussion about the effects, or lack thereof, of Google Instant on SEO. Initial reactions seem to have polarized users, and while it's probably too soon to predict Instant's impact on search behavior, this may be a good time to raise some questions I've been dwelling on recently regarding the state of optimization. ... Read this post By: Dr. Peter J. Meyers November 23, 2010 What Is \"Advanced\" SEO? Public Relations One of the things we struggle with as SEO content providers is what level to target content at. People are always looking for more \"advanced\" content, but that word can have so many meanings. Read this post By: Rand Fishkin November 23, 2010 Answers to the SEO Professional's Litmus Test Public Relations Yesterday I wrote a post: Ten Question Litmus Test for Professional SEOs. Today, as promised, I'm providing my answers to these questions. Note that these aren't the only way(s) to answer correctly, as some of the questions are more open-ended. In the answers, you'll also see citations to sources for the answers. Which is more likely to have a positive impact on a... Read this post By: Rand Fishkin November 22, 2010 Ten Question Litmus Test for Professional SEOs Public Relations A few years back, I wrote a popular post on SEOmoz featuring a set of questions I felt were a litmus test for SEOs seeking to charge for their consulting services. It's time to revisit that, as many of the answers have changed and the baseline has moved (forward). If you're in the SEO business professionally - either as an in-house marketer helping your team with SEO or as an SEO c... Read this post By: Rand Fishkin November 2, 2010 2010 Industry Survey Results, Infographic & Surprising Trends Public Relations Earlier this year we asked the community to take the SEO Industry Survey. We had originally hoped to get at least 3,000 responses and were completely blown away when over 10,000 people ended up taking the survey! Of course, it never hurts to wave an iPad in front of a search marketers nose.With this survey we wanted to fin... Read this post By: Federico Caramella September 28, 2010 Where Do You Come From: Marketing or Software? Public Relations Hello there. This is my first post on SEOmoz, I hope you'll find it interesting. It's about a thing that I was thinking on last few days and I want to share it with you. I'm finishing my degree on System Engineering, and I'm more a systems analyst than a programmer, but no matter what I like most, I ... Read this post B By: brunotorres September 23, 2010 SEO For Huge Sites: An Interview With Dennis Goedegebuure of eBay Public Relations Have you ever wondered how hard it is to do SEO for a site as huge as eBay? In this video, Dennis Goedegebuure, director of SEO at eBay talks about his work at one of the biggest sites of the world and the challenges he faces at it. This is the first video of a series of interviews shot by ... Read this post By: Rand Fishkin September 8, 2010 An Interview on SEOBook Public Relations Just a short post tonight.First, off, I'm honored to be interviewed by Aaron Wall. We've had our differences and maintain some divergent opinions on a few topics, but we both have an insane passion for helping make SEO professionals better at their job and work hard to grow the credibility of SEO as a whole.... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "The Next Generation of Ranking Signals"
    },
    {
      "level": "H2",
      "text": "The Bing Sting Facts: Why Bing Isn't Copying Google"
    },
    {
      "level": "H2",
      "text": "Summary of the #FutureSearch Talk with Google, Bing & Blekko"
    },
    {
      "level": "H2",
      "text": "Is SEO Immoral?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Help Us Build the 2011 Search Ranking Factors"
    },
    {
      "level": "H2",
      "text": "SEOmoz Pie Eating Contest Live at Noon Pacific Today!"
    },
    {
      "level": "H2",
      "text": "SEO Beyond the Instant"
    },
    {
      "level": "H2",
      "text": "What Is \"Advanced\" SEO?"
    },
    {
      "level": "H2",
      "text": "Answers to the SEO Professional's Litmus Test"
    },
    {
      "level": "H2",
      "text": "Ten Question Litmus Test for Professional SEOs"
    },
    {
      "level": "H2",
      "text": "2010 Industry Survey Results, Infographic & Surprising Trends"
    },
    {
      "level": "H2",
      "text": "Where Do You Come From: Marketing or Software?"
    },
    {
      "level": "H2",
      "text": "SEO For Huge Sites: An Interview With Dennis Goedegebuure of eBay"
    },
    {
      "level": "H2",
      "text": "An Interview on SEOBook"
    }
  ],
  "author": "Rand Fishkin\n          \n            Mark Collier\n          \n            Tom Critchlow\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Jamie Steven\n          \n            KenSpeckle-138545\n          \n            Dr. Peter J. Meyers\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Federico Caramella\n          \n            brunotorres\n          \n            Rand Fishkin"
}