{
  "url": "https://moz.com/blog/category/public-relations/p6",
  "slug": "p6",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin August 18, 2010 A Comprehensive, Intro to SEO Powerpoint Slide Deck Public Relations For the past few years, I've given numerous presentations introducing SEO to new audiences of marketers, engineers and executives. With the end of SEOmoz's consulting business this past January and the completion of our final contract obligations this Spring, I thought it would be wise to share the 190+ page deck to hopefully help those of you who are tasked with introducing SEO to your co... Read this post By: Rand Fishkin August 7, 2010 Best SEO Blogs: Top 10 Sources to Stay Up-to-Date Public Relations Like many overly-connected web junkies, I find myself increasingly overwhelmed by information, resources and news. Sorting the signal from the noise is essential to staying sane, but missing an important development can be costly. To balance this conflict, I've recently re-arranged my daily reading habits (which I've written about ... Read this post E By: Ed Fry July 22, 2010 Growing Up in the SEO Ninjahood Public Relations The word “ninja” gets uttered a lot here in the Distilled office. As an outsider, I don’t know - perhaps they all have fly-by-night jobs where they go out, chasing baddies and saving the world... or it simply means being kick-ass awesome at doing SEO. Whatever, peaking in the “ninjahood” seems the ultimate goal, I mean, look ... Read this post C By: Conner July 19, 2010 So What Type Of SEO'er Are You? Public Relations This is just for a bit of fun ... see if you can identify yourself or others from the following list. I don’t have much SEO advice, everything I learned I did from great sites like this one, so you already know it, but I wanted to put something back, in a light-hearted tone. Having spent months on blogs and forums learning everything I could about ... Read this post C By: Carlos del Rio May 21, 2010 Job Data For Social Media - US, UK and Canada Public Relations During December 2009 and January 2010 many of you participated in an 18-question survey that Jeff Noethen and I produced to address the job landscape for web workers. We had over 600 responses from around the world, 460 from US, UK and Canada. Here are some of things we found. ... Read this post By: Rand Fishkin May 11, 2010 Some Opinions on the SEO Myths & Realities Fight Public Relations A few weeks back, Stephan Spencer authored a post for SearchEngineLand entitled 36 Myths that Won't Die But Need To. I certainly recommend checking out the post, but be warned of some highly contentious comments. The tweets and offline feedback were similarly up-in-arms and it's easy to understand why. ... Read this post By: Rand Fishkin April 22, 2010 Take the 2010 SEO Industry Survey; Your Peers Need You! Public Relations I am very excited to announce that we have just put the finishing touches on our second SEO Industry Survey! We ran our first industry survey in 2008, and learned and shared a lot about the SEO community. This survey follows up on a lot of questions we asked last time, but includes a greater focus on other areas of organic... Read this post By: Richard Baxter March 30, 2010 KPI's and Monthly Objective Metrics for People Who Do SEO Public Relations Today’s post is part inspired by a brilliant question that came up recently in Q&A. The question was based on targets and objective setting for SEO’s and it went something like this: What metrics should an SEO’s monthly objectives be based on? Having spent a good portion of my SEO career managing SEO teams in-house, this question really re... Read this post By: Danny Dover February 18, 2010 Peer Review: SEO Best Practices for HTTP Status Codes Public Relations This post is part of an ongoing series where my co-workers and I are working to build a freely available resource center of up-to-date SEO best practices. As we write this content, we are submitting them for peer review so that everyone on the Internet can benefit from collective intelligence. You can read more about the ... Read this post T By: Tom Critchlow January 17, 2010 10 Professional Development Tips to Boost Your SEO Career Public Relations So it's a new year (doesn't 2010 feel like the future?!) and it's a new you. As Pete blogged last week plenty of new year's resolutions are being set. For many this may involve getting a better or job or getting paid more money. This post is for you. Hopefully by the time you've read this post you'll have some ideas to tu... Read this post C By: Carlos del Rio December 4, 2009 The Job Landscape in Search, Design and Social Media Public Relations In late October Forum One Networks put out a white paper titled \"Online Community and Social Media Compensation.\" I applaud their efforts, but, I think they create an unrealistic view of the job space in online media. One, I think the surveyed companies over-represent corporate ... Read this post By: Rand Fishkin September 29, 2009 Terrible SEO Advice: Focus on Users, Not Engines Public Relations If you've been around the SEO world a while, you've undoubtedly heard the old adage: Do what's right for users and engines will reward you with higher rankings Along with its peer: SEO tactics that focus on engines, rather than users, are manipulative (... Read this post By: Thomas Schmitz September 2, 2009 Just What are the Ethics of Search Marketing & SEO? Public Relations Earlier today (08/31/2009) Rand questioned Should SEOs Spam report ... Read this post By: Rand Fishkin July 26, 2009 Do Former Search Engine Insiders Make Great SEOs? Public Relations You may have noticed recently that there's a trend of folks who leave search engines crafting their own startups. It made me wonder - how are these individuals doing with the SEO on their own sites? Have they engaged a secret formula that the rest of us don't know to achieve incredible results? Or are they languishing in poor accessibility and SEO tactics gone awry? Since many of these ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "A Comprehensive, Intro to SEO Powerpoint Slide Deck"
    },
    {
      "level": "H2",
      "text": "Best SEO Blogs: Top 10 Sources to Stay Up-to-Date"
    },
    {
      "level": "H2",
      "text": "Growing Up in the SEO Ninjahood"
    },
    {
      "level": "H2",
      "text": "So What Type Of SEO'er Are You?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Job Data For Social Media - US, UK and Canada"
    },
    {
      "level": "H2",
      "text": "Some Opinions on the SEO Myths & Realities Fight"
    },
    {
      "level": "H2",
      "text": "Take the 2010 SEO Industry Survey; Your Peers Need You!"
    },
    {
      "level": "H2",
      "text": "KPI's and Monthly Objective Metrics for People Who Do SEO"
    },
    {
      "level": "H2",
      "text": "Peer Review: SEO Best Practices for HTTP Status Codes"
    },
    {
      "level": "H2",
      "text": "10 Professional Development Tips to Boost Your SEO Career"
    },
    {
      "level": "H2",
      "text": "The Job Landscape in Search, Design and Social Media"
    },
    {
      "level": "H2",
      "text": "Terrible SEO Advice: Focus on Users, Not Engines"
    },
    {
      "level": "H2",
      "text": "Just What are the Ethics of Search Marketing & SEO?"
    },
    {
      "level": "H2",
      "text": "Do Former Search Engine Insiders Make Great SEOs?"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Ed Fry\n          \n            Conner\n          \n            Carlos del Rio\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Richard Baxter\n          \n            Danny Dover\n          \n            Tom Critchlow\n          \n            Carlos del Rio\n          \n            Rand Fishkin\n          \n            Thomas Schmitz\n          \n            Rand Fishkin"
}