{
  "url": "https://moz.com/blog/category/public-relations/p9",
  "slug": "p9",
  "title": "Public Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "J By: Jeff Sliger August 27, 2008 Networking at the SEOmoz Expert Training Seminar Public Relations I just got back from the SEOmoz Expert Training Seminar.“This expert seminar is not a conference – no press, no multiple tracks, no expo hall and no search engine reps. We won’t be providing a platform for debating the issues, but rather a learning environment for those seeking to gain knowledge about high-level, scalable, enterprise, SEO tactics and strategies.”There is... Read this post By: Rand Fishkin August 18, 2008 Sigh... More Ignorance About SEO Public Relations As I said, blogging is light this week, but I couldn't help but notice this thread at Metafilter. How can we fight against such entrenched, misinformation and stereotypes? SEO people remind me of \"weight weenies\" in the bicycle world. Instead ... Read this post By: Rebecca Kelley August 11, 2008 Chatting with Chris Winfield: SES, Viral Marketing, and Desert Island Essentials Public Relations One of my friends and colleagues, Chris Winfield, is presenting on how to ignite viral campaigns at SES San Jose later this month. If you're attending SES San Jose, I highly recommend hearing Chris's presentation. Not only is he a great speaker, he knows his stuff when it comes to social media marketing, link bait, and viral marketing. Also,... Read this post L By: LGTim July 21, 2008 Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users Public Relations Irrelevant Preamble I am not now, nor have I ever been, Darren Slattern. My reasons for stating this at the start of this post are two fold: · Scurrilous rumours to this effect were posted in the comments of my ... Read this post By: Wil Reynolds July 15, 2008 SEO Consulting is Here to Stay: Aaron Wall is Wrong (for once) Public Relations I am an Aaron Wall groupie, I use his tools, and often go up to him and say thank you (and walk away) at every conference because of how much info he graciously gives out, but this time I think he is SO WRONG on his most recent blog post titled:Why Traditional SEO Consulting usually sucks My old bo... Read this post A By: anonymousblogger July 10, 2008 10 Blog Posts I'll Never Publish Due to Controversy Public Relations No SEO stuff here; this one's just for fun. I can't tell you how many emails I get asking if I'll write a post exposing hypocrisy ABC or fraudulent company practices XYZ. It's a lot. The thing is - I wish I could write those posts and offer them up to the search blogosphere. The information is valuable, whether it's helping you avoid a scam or giving you ... Read this post L By: LGTim June 18, 2008 The Rookie: First Thoughts of an SEO Beginner Public Relations Hi, my name is Tim...and I'm an SEO.I’ve been working for a small web marketing company for a few weeks now. I had a fair bit of writing experience before I got this job, but the world of online marketing and SEO is totally new to me. It’s a steep learning curve: I’ve been stuffing my head as fast as I can since I started working ... Read this post By: jamersan June 17, 2008 The Acceptance of User Experience Optimization (UEO) Will Pave the Future for SEO Public Relations SEO has no future. This has been the hot topic on many blogs over the past few weeks, with many of the industry celebrities weighing in on the issue. I am no celebrity, so my opinion is not heard as loudly as some, but I happen to agree with many people that believe SEO as we know it is coming to an end. However, it is my firm belief that we are experiencing an evolutio... Read this post By: Brian Brown June 11, 2008 Blog For Your Dinner Public Relations While being at a show is a hectic time to pull together a YOUmoz post, I couldn't help but feel that it would be rather symbolic while being in The Emerald City and the land of SEOmoz. Fortunately, I also had a post in mind already. Unfortunately, the original title I had in mind was a little more targeted, from catchy - \"Maximize the Marketplace,\" - to practical - \"Optimize You... Read this post K By: Kevin Doory June 9, 2008 My First Conference Public Relations During my 6 hour flight from Seattle to Baltimore I wrote down a few notes from the SMX Advanced conference and thought this might provide me a chance at my first blog post on SEOMoz. I will spare you a recap of the conference, as much better writers have already given excellent accounts of SMX Advanced. I would however like to recount a story about the true nature ... Read this post By: Rand Fishkin June 8, 2008 Answers to Your Questions Public Relations At the beginning of last week, I asked for your questions and recieved more than a hundred! As promised, here's a first round of answers to those queries, and, not surprisingly, I think there's some terrific material in here for everyone who reads SEOmoz or works in the SEO or startup community. The SEO... Read this post J By: Jean Marc Thomas June 4, 2008 No Surprise for the US Elections Public Relations As an SEO/SEM consultant, I do often use tools that are online. Some of them are good, some difficult to use, some I never use because they are only for the US and have no other language than English.Of course, one of the tool I do use, is Google Trends. Today I heard the news, and heard that Hilary Clinton was about to stop her race for the US Elections. So I went to Google Trends and d... Read this post T By: Theo van der Zee April 9, 2008 Group Dynamics at SEOmoz.org Public Relations Being a BSc in psychology, the entire internet sometimes seems like a fieldtrip to me. SEOmoz.org being no exception. Thus, I hereby present you my findings of the group dynamics at SEOmoz.org. These findings are made within 10 days, and thus be off on some levels. If these types of analysis are welcomed, I will keep my eyes open and report back on it after a couple of weeks.Role... Read this post By: Rand Fishkin April 7, 2008 SEO Standards Debate is Back - But Something's Missing... Public Relations In case you haven't seen the litany of content around the search marketing world regarding SEO Standards, here's a short re-cap. The issue arose (this time around) when Danny Sullivan made Is it Time for Search Marketing Standards? a panel at SMX West in February. You can see the ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Relations"
    },
    {
      "level": "H2",
      "text": "Networking at the SEOmoz Expert Training Seminar"
    },
    {
      "level": "H2",
      "text": "Sigh... More Ignorance About SEO"
    },
    {
      "level": "H2",
      "text": "Chatting with Chris Winfield: SES, Viral Marketing, and Desert Island Essentials"
    },
    {
      "level": "H2",
      "text": "Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "SEO Consulting is Here to Stay: Aaron Wall is Wrong (for once)"
    },
    {
      "level": "H2",
      "text": "10 Blog Posts I'll Never Publish Due to Controversy"
    },
    {
      "level": "H2",
      "text": "The Rookie: First Thoughts of an SEO Beginner"
    },
    {
      "level": "H2",
      "text": "The Acceptance of User Experience Optimization (UEO) Will Pave the Future for SEO"
    },
    {
      "level": "H2",
      "text": "Blog For Your Dinner"
    },
    {
      "level": "H2",
      "text": "My First Conference"
    },
    {
      "level": "H2",
      "text": "Answers to Your Questions"
    },
    {
      "level": "H2",
      "text": "No Surprise for the US Elections"
    },
    {
      "level": "H2",
      "text": "Group Dynamics at SEOmoz.org"
    },
    {
      "level": "H2",
      "text": "SEO Standards Debate is Back - But Something's Missing..."
    }
  ],
  "author": "Jeff Sliger\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            LGTim\n          \n            Wil Reynolds\n          \n            anonymousblogger\n          \n            LGTim\n          \n            jamersan\n          \n            Brian Brown\n          \n            Kevin Doory\n          \n            Rand Fishkin\n          \n            Jean Marc Thomas\n          \n            Theo van der Zee\n          \n            Rand Fishkin"
}