{
  "url": "https://moz.com/blog/category/video/p3",
  "slug": "p3",
  "title": "Video - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Firstconversion.com January 9, 2014 Insights into Marketing Age-Restricted Videos on YouTube Video We were lucky enough to have an interesting - and somewhat different - client for whom we could test a YouTube promotion. Though YouTube is a giant of the web world and video marketing is a massive goldmine of audience potential, few people talk about marketing through the video platform and even fewer mention adult marketing. I convinced them to let me write it up and share it. Read this post By: Amanda DiSilvestro December 11, 2013 What We Can Learn about Going Viral from the Google and YouTube Integration Video Ever since Google+ integrated with YouTube comments back in September, there has been a string of crude complaints with very few positive voices found in the middle. User opinions (along with the videos and content to match) have gone viral and make us all stop and think. Sure, we might have our own opinions, but is there anything we can learn from this unique situation? People have been fighting authority since the beginning of time, but now that search and social are in the picture, the spotlight is on the importance of viral content. Read this post By: Phil Nottingham April 1, 2013 The Marketing Value of YouTube Video One of the earliest questions considered by any business investing in video marketing will certainly be, “Should I have a YouTube channel?\" The answer: probably. In this post, I expand on that answer and outline the core values most businesses can hope to gain from using YouTube as a marketing channel. Read this post By: Dana Tan March 15, 2013 How to Advertise for Free on YouTube & Leverage Your Video SEO! Video In the SearchLove London video, Phil had a tip that involved creating Google Adwords ads for the display network that make it possible to overlay a banner ad into your own YouTube videos that link back to your site. Yes, wake up people!!! I said, “You can configure a YouTube video to have an embedded link back to your site.“ Yes, in the video! Read this post By: Phil Nottingham December 3, 2012 Building a Video SEO Strategy Video Designing and implementing a goal-driven strategy for Video SEO is imperative to its success. In today's post, Phil outlines the core goals video can provide for SEO and explains what type of content is required for businesses to reach Video SEO glory. Read this post By: Ben Ruedlinger August 31, 2012 Video-Centric Keyword Research Video While standard SEO and video SEO work in very similar ways, optimizing your video content for search requires special considerations for many of the steps, including one that is often overlooked:... Read this post By: Jeff McRitchie August 7, 2012 Winning the Video Thumbnail in Google Universal Search Video Have you noticed that more and more video results are showing up in Google search results? Everywhere I turn, it seems that Google is providing me with options of videos to watch on the first page of their search results. As a user, I appreciate the video content and will often click on the video results. As a marketer, I am incredibly jealous of those placements and am cons... Read this post By: Ann Smarty June 13, 2012 Dominating Youtube Search and \"Related Videos\" Results (Case Study) Video Earlier in April I have come up with the fun contest idea: having our users create screencast tutorials of their favorite MyBlogGuest features. Before that our Youtube presence had been quite weak, so it turned out to be quite an insightful experience that I am laying out here for other Youtube newbies like me. Read this post By: Ben Ruedlinger May 4, 2012 The YouTube Experiment Video When I first suggested setting up a YouTube channel for our videos, I got a lot of sneers at the office. YouTube gets a bad rap (compared to a good rap) around our office. It’s probably because we’ve been soured by the comparisons between it and Wistia for business video hosting. Read this post By: Phil Nottingham April 8, 2012 An SEO's Guide to Video Hosting and Embedding Video I'm frequently asked: \"How should I host my videos for SEO purposes? Is it better to use YouTube, Vimeo or third party hosting?\" My response to this question is invariably terse, along the lines of \"it depends on the style of your content and what you want to achieve with it.\" Each situation is different. Read this post B By: Ben Andrews January 24, 2012 Video Sitemap Guide for Vimeo and YouTube Video Did you know that major search engines want you to make video sitemaps for all of your embeds, even if you're hosting on Vimeo or Youtube? Not only does it help them spider your website by giving the search engines clues as to where to look for video embeds, it may also earn your site a click through boost by giving you a picture in the SERP. Below I'll show you how I managed to index my Vimeo video embeds to include a thumbnail. Don't worry, the same steps should work for Youtube as well. Read this post J By: Jordan Judson July 28, 2011 Formatting for the Keyword Difficulty Tool Video When SEOmoz launched the Keyword Difficulty Tool I think we were all impressed with the reports that it was able to spit out. For me having all the data in one place was very useful except for when I tried to share it. At the moment the only way to share it is by exporting it as a .csv and then it just becomes a block of data. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Video"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Video"
    },
    {
      "level": "H2",
      "text": "Insights into Marketing Age-Restricted Videos on YouTube"
    },
    {
      "level": "H2",
      "text": "What We Can Learn about Going Viral from the Google  and YouTube Integration"
    },
    {
      "level": "H2",
      "text": "The Marketing Value of YouTube"
    },
    {
      "level": "H2",
      "text": "How to Advertise for Free on YouTube & Leverage Your Video SEO!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Building a Video SEO Strategy"
    },
    {
      "level": "H2",
      "text": "Video-Centric Keyword Research"
    },
    {
      "level": "H2",
      "text": "Winning the Video Thumbnail in Google Universal Search"
    },
    {
      "level": "H2",
      "text": "Dominating Youtube Search and \"Related Videos\" Results (Case Study)"
    },
    {
      "level": "H2",
      "text": "The YouTube Experiment"
    },
    {
      "level": "H2",
      "text": "An SEO's Guide to Video Hosting and Embedding"
    },
    {
      "level": "H2",
      "text": "Video Sitemap Guide for Vimeo and YouTube"
    },
    {
      "level": "H2",
      "text": "Formatting for the Keyword Difficulty Tool"
    }
  ],
  "author": "Firstconversion.com\n          \n            Amanda DiSilvestro\n          \n            Phil Nottingham\n          \n            Dana Tan\n          \n            Phil Nottingham\n          \n            Ben Ruedlinger\n          \n            Jeff McRitchie\n          \n            Ann Smarty\n          \n            Ben Ruedlinger\n          \n            Phil Nottingham\n          \n            Ben Andrews\n          \n            Jordan Judson"
}