{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/amazon-influencer-tiktok/",
  "slug": "amazon-influencer-tiktok",
  "title": "How Amazon Influencers Use TikTok For Beauty | Similarweb",
  "description": "Amazon influencers on TikTok have contributed to soaring sales in the beauty industry. Learn influencer trends to leverage the platform for your brand",
  "content": "HomeBlogEcommerceAmazon Insights#TikTokMadeMeBuyIt: How Amazon Influencers on TikTok Boost Beauty Sales Ecommerce Intelligence #TikTokMadeMeBuyIt: How Amazon Influencers on TikTok Boost Beauty Sales Download report by Emily Hunt , Market Research & eCommerce Specialist 5 Min. November 29, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In February, Carly Joy (996,900 followers) posted a TikTok about her shaving routine. 18 million views later, EOS rolled out a limited edition line inspired by her video. There is no doubt influencers are making an impact on beauty and personal care sales through TikTok. Last fall, #beauty hit 61 billion views worldwide. With that pretty picture in mind, here are some highlights from a report by Inès Durand, our Beauty and Personal Care expert, which taps Similarweb Shopper Intelligence to examine the impact of TikTok influencers on Amazon beauty sales. Read on for insights and bonus tips to shine in the blossoming beauty space. Download Our Full TikTok Beauty Influencer Report See how influencers are impacting Amazon sales Download report Why is TikTok a top platform for Amazon influencers? First, stop the clock for the background. Chinese company ByteDance launched TikTok in 2016. As the video-focused social networking service grew, companies like MAC and Walmart launched their own TikTok accounts. For advertising, however, the real power seems to be in the influencers – particularly as they relate to Amazon. The popularity of TikTok’s “Best Amazon Finds,” which gained over 14.1 billion views for #BestAmazonFinds, encourages users to tie their reels to the eCommerce giant. Moreover, #TikTokMadeMeBuyIt, used by influencers to show off Amazon purchases they discovered on TikTok, snagged more than 4.1 billion views in August. Amazon’s influencer program allows a select number of TikTokers to monetize their following. By linking to their own personal Amazon “storefront” within their bio, influencers can earn 1-10% commission. TikTok vs. other social media platforms While TikTok’s 1 billion users lag behind Instagram’s 1.4 billion, its 17.5% engagement rate is more than four times the competitor’s 4.2%. Facebook’s video engagement trails at a paltry 0.26%. TikTok is also giving Google a run for its money — tiktok.com overtook google.com as the most visited domain in the world in 2021. What beauty-based trends are taking over TikTok and amping up Amazon sales? 1. Liven up old labels Revlon turns 100 in 2032. But influencer @looksbylexington (63,900 followers) breathed new life into the centenarian brand with her video featuring its Oil Absorbing Volcano Face Roller, which generated more than 1.5 million views and 139,300 shares in March of last year. Afterward, #revlonroller trended with monthly videos and beauty publishers regularly quoting the product. TikTok trends last spring coincided with sales blossoming 53% from February to March and then a 65% MoM increase in May, which sharply contrasted the category’s -13% MoM. As of October 2021 #revlonroller accumulated 4.6 million views, showing that TikTok truly revved Revlon up. 2. Shape product development Carly Joy’s humorous and hot take on shaving down under inspired which explained EOS’s new product line, bringing in results like nether before. The name of the special product line? “Bless Your F**ing Cooch.” Cheeky, isn’t it? The product’s 171% revenue growth from February to nearly $150,000 in March, significantly exceeded the 30% growth of Amazon’s Women’s Shaving Cream category. 3. Layer wins Although dermatologist and TikTok influencer @dermdoctor’s (11.6 million followers) first viral video for Aquaphor captured over 15.3 million views in October, revenue declined 14% in November. But after a second video went viral in December, revenue increased by 21%, exceeding the 7% average growth for the category. Videos in March and June 2021 correlate with 28% and 63% revenue increases, while the category lagged at 10% and 30%. 4. Ride the TikTok wave Get some TikTok success? It’s nearly impossible to predict how long it’ll last! After @rocio.roses (1.2 million followers) released a video comparing L’Oréal’s Fresh Wear Powder foundation to higher-end alternatives, revenue skyrocketed 1237% from January to reach $272,200 in February greatly exceeding the 2.6% category growth for the period. Even though more videos went viral, growth remained in line with category averages or even declined. In fact, after L’Oréal’s second viral video, sales dropped 44% MoM from $294,800 to $106,000. 5. Prepare for sellouts It’s not just Amazon that’s benefiting from viral videos – search trends indicate that other retailers are cashing in, even when inventory can’t keep up. In May, a video featuring Cerave’s SA Cleanser by @Skincarebyhyram (6.6 million followers) went viral. That month, “cerave sa cleanser” ranked fourth top keyword containing “cerave” across ulta,com, target.com, and amazon.com combined and sixth for paid traffic. As the product-related video took off, Target and Ulta ramped up investment. “Cerave sa cleanser” soon became the number one Cerave-related paid search term across the three retailers, with Target and Ulta accounting for 80% and 20% of paid traffic. Aggressive investment on the heels of TikTok exposure may have helped induce sell-outs of the product at Target and Ulta in July. That month, “cerave sa cleanser” fell off the top keyword list with “cerave” as retailers’ halted paid spending. 6. Consider paying up While investing in paid search may help ride a product’s viral video popularity, brands can also consider investing in paid partnerships with TikTok influencers. After the initial hype, searches for “cerave sa cleanser” declined on Amazon, but rose 35% MoM in January after the brand launched paid partnerships with influencer dermatologists. Methodology Interested in leveraging TikTok or another platform to market your brand or want to see how viral videos impact your competitors? Here’s how we pulled our insights: Narrowed down the top 10 products for subcategories of Amazon Beauty & Personal Care including makeup, haircare, skincare, hair removal, and accessories that went viral on TikTok. Used Similarweb Shopper Intelligence to pull data on revenue and units sold at the time of top trending videos. Benchmarked these numbers against category averages to counter seasonality. We also incorporated data points from Similarweb Digital Research Intelligence and TikTok statistics. Get your own insights To get your own data for consumer and purchase behaviors across Amazon, Target, Walmart, and other online marketplaces, sign up for a demo of Shopper Intelligence. To best prepare, check out our eCommerce tools like Similarweb Shopper and Research Intelligence, which we used to provide these web, Amazon, and online marketplace insights. Schedule a Demo of Shopper Intelligence Get real time eCommerce insights Sign me up by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "#TikTokMadeMeBuyIt: How Amazon Influencers on TikTok Boost Beauty Sales"
    },
    {
      "level": "H2",
      "text": "Why is TikTok a top platform for Amazon influencers?"
    },
    {
      "level": "H3",
      "text": "TikTok vs. other social media platforms"
    },
    {
      "level": "H2",
      "text": "What beauty-based trends are taking over TikTok and amping up Amazon sales?"
    },
    {
      "level": "H3",
      "text": "1. Liven up old labels"
    },
    {
      "level": "H3",
      "text": "2. Shape product development"
    },
    {
      "level": "H3",
      "text": "3. Layer wins"
    },
    {
      "level": "H3",
      "text": "4. Ride the TikTok wave"
    },
    {
      "level": "H3",
      "text": "5. Prepare for sellouts"
    },
    {
      "level": "H3",
      "text": "6. Consider paying up"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H2",
      "text": "Get your own insights"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}