{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/competing-with-amazon/",
  "slug": "competing-with-amazon",
  "title": "Competing With Amazon Successfully | Similarweb",
  "description": "This practical guide will offer you tips and tricks about how to beat Amazon out and make more sales, even if you’re a small business. Read it here.",
  "content": "HomeBlogEcommerceAmazon InsightsCompeting With Amazon: It’s Not As Crazy As It Sounds! Ecommerce Intelligence Competing With Amazon: It’s Not As Crazy As It Sounds! See Similarweb work it's magic by Sarah Mehlman , Sr. Marketing Intelligence Specialist 8 Min. August 14, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As cliche as it sounds, “it’s not about the size of the dog in the fight, but the size of the fight in the dog.” –Mark Twain Even in ecommerce. Yes, Amazon is a big dog. Amazon is Goliath and the other sellers are David. It’s easy to get intimidated by the ecommerce giant, but if you have your slingshot at the ready you can go toe-to-toe with Amazon. This guide offers practical tips and tricks to develop the right strategy to compete with Amazon. How to compete with Amazon With 43.5% of retail ecommerce sales taking place on Amazon, you might wonder what’s the point of even trying to compete. But, don’t forget, this means that 56.5%, more than half of an almost $5 trillion dollar industry is up for grabs. There are many people who prefer not to support the largest online retailer and would rather spend their money at small businesses. Others are just looking for the right product, no matter who the retailer is. To find these customers, you need to get yourself in the arena to compete with Amazon. Here is what you need to do. 1. Find your niche There are millions of products on Amazon all organized into specific categories. While you may not be able to compete with Amazon in variety, you can compete on a specialty. Dominate your niche, and you have a fighting chance against Amazon. The first step in finding your niche audience is to analyze your categories. Take a deep dive into the Amazon categories you’re competing with to find out who are the leading sellers on Amazon and what are the customer segments you’re competing for. You want to understand customers’ purchasing habits, category trends, and product performance. Read reviews and feature lists to compare what companies are offering and what is important to customers. Pro Tip: Sound like a lot of legwork to analyze all the products and categories related to your business? Use Similarweb’s Amazon Categories tool to do the heavy lifting. This tool lets you drill down into each category to analyze performance, high-converting brands, top products, customer loyalty, and more. 2. Choose your platform Location, location, location! This also applies to ecommerce. You need to find the best location to sell your niche products. This could mean selling directly on your own website, via social media, or choosing another platform, such as Etsy, eBay, or Shopify, that better fits your needs. Selling directly on your own website can lead to huge success if you have the infrastructure for it. With this option, you avoid paying commissions, have full control to personalize your customer’s shopping experience, and you’ll have full visibility into the analytics and sales metrics on your site. On the other hand, choosing an online marketplace has its own perks. It might be easier to set up than your own website, could give you access to new customers, and provides trust and transparency for new customers who may not be aware of your brand. You should look into niche marketplaces that are the most relevant for your products. For example, if you sell homemade artwork, Etsy could be for you. If you sell pet products, you better get on Chewy! 3. Target Amazon-specific keywords When you know where you can compete with Amazon, your next step is figuring out how. This means making sure your business is discoverable to potential customers. How will customers discover you? Keywords. While many customers make their final purchasing decisions on Amazon, at least 51% of shoppers start their buyer decision-making process on Google. This is your chance to introduce yourself to potential customers before they hop over to Amazon. You’ll need to beef up your SEO and PPC strategies with product-related keywords. Amazon search keywords are keywords focused on transactional search intent. These keywords could relate to a specific feature, price point, brand, or anything else people might be looking for when they are interested in buying something. If you target these keywords in your SEO and PPC campaigns, you’re likely to attract some attention on Google. Think Amazon dominates Google? Think again. When it comes to SEO, Amazon isn’t always on top. Want proof? Let’s have a look together. Amazon is the second SERP result, behind The Spruce Eats. Focus your SEO and PPC strategies on Amazon-specific keywords, so you can beat Amazon in the Google SERP. Pro Tip: Find the top Amazon keywords for your category with Similarweb’s Amazon Keywords tool. This tool tells you what people are looking for, which keywords are trending, and each keyword’s performance for organic and paid search results. 4. Provide fast shipping options One of the greatest benefits of shopping on Amazon is the shipping options. With options for free two-day delivery and even same-day delivery, Amazon has pretty much nailed it. The takeaway? Get creative to get your products to customers quickly. Here are a few ideas: Buy online and pick up in-store: If you have a physical location, this is a great option that allows customers to quickly get their orders at no shipping cost. You can even offer curbside pickup to make it even faster. Pickup locations: No physical location? No problem. Use shipping services like Boxit which offers many different pickup locations. Customers can choose the pickup location closest to them. Free shipping thresholds: It may be beneficial for you to offer free shipping for orders above a specific threshold. This is a great way to increase customer satisfaction and lead to higher order amounts. Paid expedited shipping: You can offer different shipping methods for different prices. If customers want something quicker, they can choose to pay extra to get their order by a specific time. Generally, customers are very understanding if you are open and honest about your shipping methods. Make sure to set clear expectations and follow through with whatever delivery time you promised. In the case of delays, be honest and update customers. They will appreciate you for this. 5. Offer subscription options Subscriptions are a win-win for you and your customers. You get consistent orders and revenue and your customers never run out of the products they need on a recurring basis. Think cosmetics, toiletries, pet products, and more. If your products fall in this category, offer customers a subscription service. Amazon offers a subscription & save program that improves customer loyalty and reduces customer acquisition costs. Let me throw one more idea your way. How about opening up a loyalty program to compete with Amazon Prime? You can offer a subscription for a small fee that gives customers discounts or other benefits. 6. Up your customer service game According to a Microsoft survey, 90% of customers say customer service is extremely important when choosing or remaining loyal to a brand. Ever tried to talk to a representative from Amazon? It’s nearly impossible and this is definitely one of its downsides. Use this to your advantage and provide customers with the personalized service they are missing from Amazon. Show customers that you have exceptional service, and you’re off to a strong start. Here are a few ideas: Answer FAQs: A lot of customer service requests are simple and generic questions you can easily answer on your website, niche platforms like Etsy, or even social media. Make sure to answer questions about shipping methods, shipping times, return policies, warranties, and anything else that is relevant to your company. Use a chatbot: In 2020, one out of six customer service interactions was fully resolved by chatbots. Chatbots use artificial intelligence to respond to customer requests. Add a bot to your website and it can provide 24/7 support. It will answer simple questions and resolve many issues without human interaction. Be transparent: Consumers hate the unknown. You can put them at ease by being transparent about what customer services you offer. If you only answer emails and calls during specific hours, make sure these are clearly posted on your website. This sets customer expectations and ensures you won’t disappoint them. Open multiple service channels: Give your customers multiple ways to contact you if they need help. In fact, one of the biggest customer service channels today is Twitter. Many companies have dedicated Twitter handles to respond to customer service requests quickly and publically. Be friendly and personal: Sounds obvious, right? Make sure any staff members who interact with customers are friendly and sympathetic to your customers’ needs. A positive interaction goes a long way. 7. Build customer loyalty While many people frequently shop on Amazon, most wouldn’t say they are “loyal” to the company. They may be loyal to the brands on Amazon or enjoy the convenience of Amazon, but Amazon buyers generally don’t feel emotionally connected. You, on the other hand, can build that emotional relationship, which is the key to customer loyalty. A Deloitte survey showed that 60% of long-term customers talk about their favorite brands with the same emotional language they would use to talk about their family, friends, or pets. They use words like love, happy, and adore. Now wouldn’t you want them to say this about you? It’s much easier to sell to existing customers than acquire new ones. If you build a loyal customer base, you’ll save money on customer acquisition and have a team of fans who will recommend you to their friends. Here are a few tips for building customer loyalty: Create useful content: Content marketing is a great way to connect with customers. They will appreciate you for providing valuable information and you’ll build trust, another important emotion that leads to loyalty! Share your brand’s values: Is the environment important to you? Do you care about the forests in Africa? Having values humanizes your brand and gives customers something to relate to. If they share your values, they are more likely to be loyal. Create a loyalty program: Customers love savings! If customers know they are earning points by shopping with your company, they might be more likely to stick with you. Pro Tip: Benchmark customer loyalty against Amazon with Similarweb’s Loyalty and Retention tool. This tool shows you the purchase frequency for categories on Amazon and shows the distribution between new and returning customers. See how loyal customers are on Amazon and build your loyalty program so you can beat it! 8. Monitor, track, and optimize How successfully are you competing with Amazon? The only way to answer this question is to monitor and track both your performance and Amazon’s. You should have a good idea of your own sales and customer purchasing habits. To see how you stack up against Amazon, you need a shopper intelligence tool to understand browsing and buying habits in the marketplace. Similarweb can help you analyze Amazon’s performance. Our Amazon Overview has deep insights into category and product performance. Analyze the products and categories you’re competing with to figure out how you compare. Your next step is to optimize. If there are places Amazon is beating you, brainstorm how you can do better. You can always improve and optimize the shopping experience on your website and the more you do it, the better you’ll become. Competing with Amazon on Amazon Even if you are selling your products on Amazon, you’re still competing with Amazon. Amazon has its own brands including Wholefoods, Goodthreads, and Solimo. Over the last couple of years, controversy arose that Amazon was favoring its own brands over private sellers in search results. Amazon denies these claims, saying that its priority is always providing customers with the most relevant search results, yet this does raise the point that even selling on Amazon is competing with Amazon. For you to compete with Amazon’s own brands, you need to upgrade your Amazon SEO and Amazon PPC so that you’ll get discovered by potential customers and increase your sales. Once Amazon sees that your brand is relevant and selling well, it will start favoring you more in search results. Be the ultimate competitor Competing with Amazon is all about providing customers with the right value proposition. While you might have thought Amazon has covered all the bases to provide top value, this is simply not the case. Sometimes being huge is not an advantage. Sometimes being too big makes it impossible to excel in the little things that might make a big difference to customers. This is where you can thrive. Provide value where Amazon can’t. You’ll be a worthy competitor and you’re sure to see the results in your bottom line. Stop Guessing, Start Analyzing. Try Similarweb for free by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Competing With Amazon: It’s Not As Crazy As It Sounds!"
    },
    {
      "level": "H2",
      "text": "How to compete with Amazon"
    },
    {
      "level": "H3",
      "text": "1. Find your niche"
    },
    {
      "level": "H3",
      "text": "2. Choose your platform"
    },
    {
      "level": "H3",
      "text": "3. Target Amazon-specific keywords"
    },
    {
      "level": "H3",
      "text": "4. Provide fast shipping options"
    },
    {
      "level": "H3",
      "text": "5. Offer subscription options"
    },
    {
      "level": "H3",
      "text": "6. Up your customer service game"
    },
    {
      "level": "H3",
      "text": "7. Build customer loyalty"
    },
    {
      "level": "H3",
      "text": "8. Monitor, track, and optimize"
    },
    {
      "level": "H2",
      "text": "Competing with Amazon on Amazon"
    },
    {
      "level": "H2",
      "text": "Be the ultimate competitor"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}