{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/create-amazon-bundles/",
  "slug": "create-amazon-bundles",
  "title": "How To Create Profitable Amazon Bundles | Similarweb",
  "description": "Create winning Amazon bundles to increase profitability with our product bundles guide. Includes do's and don'ts for ecommerce pros, tools, tips, & more.",
  "content": "HomeBlogEcommerceAmazon InsightsHow To Create Profitable Amazon Bundles [7 Expert Tips] Ecommerce Intelligence How To Create Profitable Amazon Bundles [7 Expert Tips] Demo Similarweb today by Molly Winik , Senior Content Marketing Manager 8 Min. August 30, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic If you’ve ever bought a value meal with french fries, a burger, and a Coke, you’re already familiar with the power of bundling. Also called “packaged deals,” product bundles include several goods and services sold to consumers in one combined package. The pricing of the total bundle is typically less than the individual items, making it an enticing deal for customers. For sellers, it’s an easy way to boost conversion. But bundles aren’t limited to fast-food chains. Given the power of bundling to increase revenue, they’ve infiltrated the ecommerce industry. Selling bundles on Amazon has become a popular way for sellers to drive online sales based on consumer demand. In this article, we’ll explore product bundles – the pros and the cons – so you can see if it’s right for your ecommerce strategy. We’ve also included 7 expert tips to help you create profitable Amazon bundles. What are Amazon product bundles? Amazon bundles consist of single items sold together. The number of items ranges from two to five. The entire bundle has a unique Amazon Standard Identification Number (ASIN) or Universal Product Code (UPC). This new UPC doesn’t correlate to any specific item in the bundle. Mrs. Meyers Cleaning Bundle, Amazon listing Amazon product bundling allows sellers to create multiple listings on the marketplace’s catalog without launching new products. Amazon product bundles examples: Here are some great examples of Amazon product bundles that make sense given consumer preferences. For example, a shopper buying new cleaning products would most likely prefer to buy cleaner, hand soap, and dish soap all at once rather than individually, especially if it’s at a discounted price. Another example is bedding. In the product bundle below, the shopper would get a complete bedding set, including pillowcases, flat sheet, fitted sheet, pillow cover, bed skirt, and comforter. The shopping experience is easy and seamless. Bundles vs. multipacks Often confused, bundles and multipacks are not the same. A multipack consists of multiple items packaged together (e.g. five blue t-shirts), with the same stock-keeping unit (SKU). Bundles contain multiple items which are different but complement each other, packaged together. Amazon Seller Central guidelines help define the difference: “If an item is a multi-pack, such as six pairs of socks, list it as a single product and not as a bundle. See UPCs and Item Package Quantity for Multi-Packs.” What are Amazon’s virtual product bundles? Amazon’s Virtual Product Bundles (VPB) program allows sellers on Amazon’s brand registry to bundle more efficiently. Brand owners can offer product bundles without packaging them together. They also don’t need to change to fulfillment by Amazon (FBA) inbound shipments. Amazon assigns a unique SKU for the bundle and automatically updates quantities depending on the lowest-stock item in the FBA inventory. Creating a VPB is free – sellers can create and edit the product title, description, price, and images accordingly. Currently, this feature is only available to sellers who own a brand and are responsible for selling that brand in their Amazon store. For more details and eligibility, check out Seller Central. Look at items “frequently bought together” to help determine items to bundle The pros & cons: why create an Amazon product bundle Why retailers are excited about Amazon product bundling New, unique listing. You’ll get a new listing for Amazon’s catalog without launching a new product. Increased average order value (AOV): Even if individual items bundled together are discounted, multiple products mean higher AOV. Competitive advantage: Since unique Amazon product bundles are featured in Amazon’s Buy Box (white box on the right-hand side of the product detail page) bundles can ensure more exposure for catalog listings. Customers add bundles to their carts seamlessly from the Buy Box. Sellers would need to have the exact same items and packaging to sell on your listing. 4. Higher profitability: For those using Amazon fulfillment, Amazon deducts FBA fees from one item, rather than each item separately, bringing higher profit margins. 5. Move low-cost items: The cost to ship standalone, low-cost items may not be worth the shipping fees. Since bundling increases AOV, now the cost may be worth it. 6. Sell slow-moving inventory: Can’t get rid of certain products? Bundle them with more popular ones. 7. Added value for customers: Product bundles can be priced equal to or lower than the items sold individually because of the savings for the seller. Bundling also improves the customer experience for shoppers, since all the products are on one page. After all, happy customers are more likely to be repeat loyal customers and bring recurring revenue. Make sure bundling is right for your brand Some cons to selling bundles on Amazon include: 1. Greater need for customer reviews: Bundle ASINs have separate reviews and ratings from those of their components. Since reviews of existing, individual products won’t transfer to the bundle, sellers need to generate reviews from scratch. 2. Forbidden categories: Forget about bundling if you sell DVDs, video games, books, and products in other categories (more detail below). 3. Permanent: After the bundle is created, the bundle cannot be modified (a new listing would need to be added). Guidelines for creating Amazon bundles Amazon has a specific policy for product bundles, which are designed to help customers locate goods easily and prevent duplicate listings. The full list of Amazon’s basic guidelines for product bundling (including further details, warranties and return rules, and bundle tile restrictions), can be found in Seller Central. But check out a few key specifics to know when starting out: You may not list bundled products where the primary product in the bundle is from the Video Games category or is a Books, Music, Video, or DVD (BMVD) product. You may include BMVD and Video Games items as secondary products in a bundle if they are related and complementary to the primary product in the bundle. For example, you can list a bundle composed of a yoga mat (the primary product), a yoga DVD, and a yoga book. Bundle pricing must follow the Amazon marketplace fair pricing policy to ensure customer trust. The referral fee for the primary product category (the same category used to list the product) applies to the entire bundle. All products in bundles must comply with Amazon’s Selling Policies and Seller Code of Conduct. More specifically, all products within bundles must adhere to the guidelines for each category. Bundle images, features, and descriptions must also adhere to Amazon listing policies. Although the guidelines from Amazon are useful, they are a bit technical. Here are some of our top do’s, don’ts, and pro tips for retailers looking to sell bundles on Amazon. Do Choose your product category wisely: Individual products may come from multiple categories, but you only need to choose one for your bundle – ideally, the least competitive. To help decide, consider the percentage of paid vs. organic search terms within a product category. Optimize your product listing: Use an explicit name and images following best practices in Optimize Your Amazon Product Listings. Optimize for Amazon Search: Ensure your product stands out among others on the giant ecommerce marketplace with these Amazon SEO tips. Make a lasting impression: When sending, use unique packaging to stand out to help customers remember (and make repeat purchases) from you. Use ecommerce intelligence tools: Gain insights at the category, brand, and product level with tools like Similarweb Shopper Intelligence. Don’t “Force” the bundle on customers: Make sure customers have the option to buy products individually. Forget to monitor your competitors: Understand (and stay away from) common bundles offered by competitors. Choose a forbidden category: You don’t include items like DVDs, books, or video games. Put together random assortments of products: They should be complementary. How to create profitable Amazon bundles Ready to move forward? Use these seven steps to choose the best products for Amazon product bundling. 1. Only choose eligible products: Check out Amazon’s policy to ensure you don’t bundle ineligible products. In addition to items already mentioned, FBA-prohibited items, products with manufacturer warranties, products you’re not approved to sell, and generic products are ineligible for bundling. 2. Make sure the bundle contains complementary items: Bundles should contain complementary products to comply with Amazon’s detailed product bundling policy. For example, if you’re selling an insulated lunch box, it would make sense to bundle this product with portable ice packs. 3. Use keyword research to boost your bundle: Marketplace SEO plays an important role in driving clicks to your bundles. It’s all about optimizing your product listings to boost organic clicks and in turn produce higher ecommerce conversions. Because at the end of the day, the more eyes on your product bundle, the better your chances of getting a sale. If you’re not sure where to start, Similarweb’s On-Site Search Optimization tool can help you identify the right keywords for product bundling, such as high-performing keywords in a specific category. 4. Consider product recommendations: Be sure to check out products “frequently bought together” according to Amazon’s algorithms as about 35% of Amazon purchases come from product recommendations. 5. Choose evergreen products: A bundle cannot be changed without creating a new product listing so it’s best to include evergreen over seasonal components. 6. Consider wholesale bundling: Rather than creating a new private label product, identify brands already performing well on Amazon, open a wholesale account with that brand, then resell on Amazon. 7. Be able and willing to discount: Since the most successful bundles offer attractive discounts, ensure that the total bundle price is less than the sum of its product prices. Be wary of including items with low inventory, which may not make sense to discount. Read More: How to Optimize Your Amazon Pricing Strategy Want to start creating a bundle listing on Amazon product bundles? As mentioned, bundle choices last forever so be sure you do your research before investing your resources to create your first Amazon bundle. Similarweb Shopper Intelligence provides insights to help, like: Paid vs. organic search terms per Amazon category Cross-shopping behavior Brand basket analysis Best-performing brands within a category (applies to wholesale bundling) Purchase frequency, including seasonal patterns Ecommerce Insights on Demand Uncover cross-shopping behavior and consumer trends on Amazon. Schedule a demo FAQ What are Amazon product bundles? Amazon bundles consist of single items sold together, usually at a discounted price compared to purchasing each item individually. The number of items sold in a bundle ranges from two to five. Bundling allows sellers to create multiple listings for Amazon’s catalog without launching new products. What’s the difference between a product bundle and a multi-pack? Multipack consists of multiple items (e.g. five blue t-shirts), with the same stock-keeping unit (SKU). Bundles contain multiple items which are different but complement each other, packaged together. What are the pros and cons of creating an Amazon product bundle? Some of the pros of product bundling on Amazon include increased average order value, a competitive advantage, new Amazon listings without new product launches, higher profitability, and the chance to move low-cost items or slow-moving inventory. However, there are some cons. For example, customer reviews won’t always transfer to a bundle, and there are some forbidden categories for bundling, like DVDs, video games, books, and more. by Molly Winik Senior Content Marketing Manager Molly has 8+ years of experience in marketing, content creation, and PR. Her work has been featured on Mention, The Times of Israel, and Culture Trip. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How To Create Profitable Amazon Bundles [7 Expert Tips]"
    },
    {
      "level": "H2",
      "text": "What are Amazon product bundles?"
    },
    {
      "level": "H3",
      "text": "Amazon product bundles examples:"
    },
    {
      "level": "H3",
      "text": "Bundles vs. multipacks"
    },
    {
      "level": "H3",
      "text": "What are Amazon’s virtual product bundles?"
    },
    {
      "level": "H2",
      "text": "The pros & cons: why create an Amazon product bundle"
    },
    {
      "level": "H3",
      "text": "Why retailers are excited about Amazon product bundling"
    },
    {
      "level": "H3",
      "text": "Make sure bundling is right for your brand"
    },
    {
      "level": "H2",
      "text": "Guidelines for creating Amazon bundles"
    },
    {
      "level": "H3",
      "text": "Do"
    },
    {
      "level": "H3",
      "text": "Don’t"
    },
    {
      "level": "H2",
      "text": "How to create profitable Amazon bundles"
    },
    {
      "level": "H2",
      "text": "Want to start creating a bundle listing on Amazon product bundles?"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Molly Winik"
}