{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/pet-supply-brands/",
  "slug": "pet-supply-brands",
  "title": "Fastest-Growing Pet Supply Brands on Amazon | Similarweb",
  "description": "Check out the fastest-growing pet supply brands of 2021 and tips for CPG brands so that their products can lead the pack on the Amazon Marketplace.",
  "content": "HomeBlogEcommerceAmazon InsightsRanked: Top 10 Pet Supply Brands on Amazon in 2021 Ecommerce Intelligence Ranked: Top 10 Pet Supply Brands on Amazon in 2021 Download the list by Emily Hunt , Market Research & eCommerce Specialist 4 Min. May 14, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic May is National Pet Month in the U.S. As animal lovers at Similarweb, to honor it we’ll fetch insights with Shopper Intelligence and analyze Amazon’s top pet supply brands. We’ll pinpoint winning brands in 2021 according to year-over-year (YoY) revenue growth, identify consumer trends driving growth, and provide tips for CPG brands to pawfect their Amazon strategy. Amazon pet supplies sales at a glance As pet adoptions soared across America in 2020–2021, revenue (+30.7%), unit sales (+33.2%), and product views (+48.3%) for Amazon pet supplies increased. Yet, declining conversion rates (-13.4%) demonstrate more competition and pickier pet parents that are browsing more and comparison shopping when purchasing products. Product and revenue growth for Amazon’s pet supply category 2020 – 2021 via Shopper Intelligence American Pet Products Association (APPA), estimates that consumers will spend $109.6 billion on pets this year, up from 2020. So, which brands are capturing consumer dollars and why? Pet supply brands – The winners by most revenue growth in 2021 Cat-centric companies are bringing home the bacon among top pet brands (and, it’s literally about the litter box). Here are some insights on the leaders of the pack: 1. PetSafe monetizes on top organic keyword Revenue growth YoY for PetSafe, which describes itself as “the world’s leader in containment, training, and lifestyle solutions” exceeded other pet supply brands. We attribute this gain to PetSafe winning the most brand share for “litter box,” which ranks among the category’s top 10 keywords two years in a row. Pricing, however, has increased – the average unit price of PetSafe’s litter box jumped $4.00 from $37.67 to $41.67 in just one year. Cat owners replace litter boxes yearly (roughly), therefore, customer loyalty (less than 25% are returning), is very much below the 68.6% category average (for April 2021) and less than half that of the other top five pet supply brands. 2. Fresh Step, ranked second, could profit from pairing up with PetSafe If PetSafe, which is ranked number one, can supply cats’ litter boxes, Fresh Step, number two, can fill them. Owned by Clorox, Fresh Step has the second-highest revenue growth YoY. Since its products are complementary and viewed by a similar customer base as PetSafe, the two brands can team up. From January 2020 – April 2021 7.5–8% of shoppers for cat litter and housebreaking supplies viewed the others’ brands within the same month. Just over 8% of Fresh Step shoppers also viewed PetSafe products within the same month (Amazon’s Cats – Litter & Housebreaking Supplies, Shopper Intelligence) Consumers need to purchase litter on a regular basis to care for their cats. Over the past six months (November 2020–April 2021), nearly 53% of Fresh Step customers return – more than double that of PetSafe. If the two companies bundle their products, PetSafe’s strong brand share for litter boxes can help hook consumers on Fresh Step’s litter, which they’ll purchase litter regularly. 3. Temptations, Purina Friskies, and Hill’s Science Diet: Subscribe & Save savvy At three-fifths, pet food has the highest Subscribe & Save (SnS) rate across all of Amazon. Three of the top five brands (Temptations, Purina Friskies, and Hill’s Science Diet) specialize in pet food. Given the high customer loyalty metrics (more than 50% for all), we suspect that SnS contributes to a significant revenue share for these top brands. Not only is pet food is essential for fluffy family members, but it can also weigh five pounds or more (particularly kibble) and can be difficult to lug from a store. CPG brands: Become the cat’s meow To take advantage of the growing pet supply market, CPG brands should carry pet products, like food, that are needed on a regular basis and/or team up with brands already offering subscription-worthy items. For more insights to succeed in the pet supply business, check out our blog posts – How to Compete in the Dog Food Industry and Best Marketplaces for Online Dog Food Sales. Better yet, book a demo of Shopper Intelligence, part of our eCommerce solution suite, to harness actionable data and insights to grow on Amazon, among other eCommerce marketplaces. P.S., don’t forget to visit our social media for snaps of our Barketing team and other Similarweb pets, like the floofball pictured. by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Ranked: Top 10 Pet Supply Brands on Amazon in 2021"
    },
    {
      "level": "H2",
      "text": "Amazon pet supplies sales at a glance"
    },
    {
      "level": "H2",
      "text": "Pet supply brands – The winners by most revenue growth in 2021"
    },
    {
      "level": "H2",
      "text": "1. PetSafe monetizes on top organic keyword"
    },
    {
      "level": "H2",
      "text": "2. Fresh Step, ranked second, could profit from pairing up with PetSafe"
    },
    {
      "level": "H2",
      "text": "3. Temptations, Purina Friskies, and Hill’s Science Diet: Subscribe & Save savvy"
    },
    {
      "level": "H2",
      "text": "CPG brands: Become the cat’s meow"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}