{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/shein-vs-amazon/",
  "slug": "shein-vs-amazon",
  "title": "Shein vs. Amazon - Ultimate Retailer Battle | Similarweb",
  "description": "Shein vs. Amazon: Shein’s quickly overtaken Amazon in mobile app downloads, but is the fashion upstart really a threat to the eCommerce giant?",
  "content": "HomeBlogEcommerceAmazon InsightsShein vs. Amazon – Is Fast Fashion Dressed for Success? Ecommerce Intelligence Shein vs. Amazon – Is Fast Fashion Dressed for Success? Get the full fast fashion report by Emily Hunt , Market Research & eCommerce Specialist 7 Min. September 15, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In May 2021, Shein made headlines by overtaking Amazon as the number-one shopping app on iOS and Android. The June announcement that Shein may IPO at a $47 billion valuation rattled public attention again. How did this Chinese app seemingly emerge out of nowhere to become the most downloaded in the U.S.? In this article, we’ll use data from our eCommerce solutions Research Intelligence and Shopper Intelligence, to analyze Shein and see if it’s truly a threat to retailers like Amazon and Walmart. Hold your breath for the Shein vs. Amazon face-off. Shining a light on Shein Despite reaching 81 million downloads worldwide and trending on app stores, Shein has maintained a low profile. The self-proclaimed “B2C fast fashion e-commerce platform” was founded in 2008. Its headquarters are registered in Guangzhou, China. The company designs and manufactures clothing and apparel, operating a supply chain that is unmatched in its ability to deliver “fast fashion” (we’ll get to that later). Why compare Shein vs. Amazon? The publicity Shein received after overtaking Amazon for app downloads makes the fast-fashion company one to be noticed. However, it’s important to note that Amazon’s high app penetration, almost 57%, makes growing its app downloads more challenging than Shein. Nevertheless, Shein seems like a formidable force that can challenge eCommerce giants. We also cannot deny that with consumers turning heavily to mobile shopping, this win is further proof of Shein’s rising force. Shein vs. Amazon: An overview Based on the size, revenue, and scope of the business, at first glance, Shein seems a little match for Amazon. But once we look at Shein’s strengths, including where Shein overtakes Amazon, and vice-versa, it’s clear it’s a heavy hitter in Amazon’s corner. How Shein became so trendy 1. Mastery of fast fashion Shein could be the quickest fast fashion provider around. The company emulates catwalk trends, then provides low prices online and fast delivery to mass audiences. Other well-known fast fashion brands include ASOS, H&M, and Zara. Shein achieves speed-to-store by owning its production chain, from design and prototype to procurement and manufacturing. Each step is highly digitized and integrated with the others, enabling Shein to churn out hundreds of new products tailored to different regions and user tastes at a daily rate. 2. Provides fashion for regular people Shein’s slogan is “everyone has the right to enjoy the beauty of fashion.” Closely aligning with this, the company accommodates many different styles and body types, including a popular section for plus-size fashion. The retail brand’s more realistic approach to the human body aligns with many of the fastest-growing D2C brands this year and helps appeal to a wider audience. Shein’s website shows fashion for all sizes 3. GenZ attraction Shein has successfully appealed to Gen-Z, through: Interactivity: You can leave comments on products and even upload your own images. Gamification and incentives: Visitors collect points for engagement, including contests. These translate into discounts. Social media presence: Marketing goes through third parties and social media. Millennials and young shoppers are likely to hear about Shein from various influencers on YouTube, TikTok, or Instagram. In 2021, the brand generated nearly 11% of desktop web traffic through social media, which is more than double the fashion and apparel industry (4.7%). On mobile, that number rises to 20.9%. Shein’s mobile app: filled with contests and hashtags Shein vs. Amazon: Digital performance Amazon is a marketplace across products and lines of business, including streaming services, and is expanding into additional industries. Shein just focuses on fashion. To compare the two retailers fairly, we’ll hone in on Amazon’s fashion-related shopping category with our eCommerce tools: Research Intelligence: Using the Conversion Analysis feature, we limit the comparison to Amazon’s Clothing, Shoes, & Jewelry shopping category. Shopper Intelligence: The solution, focused on Amazon and marketplace insights, is used to analyze page views, unit sales, and loyalty for Amazon’s apparel category. Web traffic Worldwide traffic to shein.com has nearly doubled from September 2020, soaring from 32.7 million to 67.2 million monthly visits. In the U.S. Shein’s traffic nearly tripled since January 2020 from 10.6 million to 27.8 million today. However, Amazon has consistently generated more traffic to its Clothing, Shoes, & Jewelry category than Shein, rising from 73.0 million visits in January 2020 to 94.1 million today. Amazon’s growth seems more impacted by seasonality than Shein’s. Amazon’s traffic spiked in December 2019 (109.3 million) and 2020 (124.9 million) reflecting holiday gift-buying. Shein’s growth actually declined slightly month-over-month (MoM) at the same time. Amazon seems to attract a larger proportion of customers buying just fashion-related gifts for the holiday season, perhaps because they are already shopping in other Amazon categories. However, Shein seems to attract more consumers that buy fast fashion regularly from its site. Overall, U.S. web traffic to shein.com seems to be steadily and consistently growing. As it gains brand awareness in the U.S., it seems to seamlessly build a fashion-forward customer base of regular shoppers. Main traffic channels Direct By volume of visits, direct traffic and organic search are the primary traffic channels for both eCommerce sites. Amazon receives significantly more of its traffic through direct channels (58.8%) whereas Shein gets just 36.7%, reflecting greater brand awareness for Amazon. Overall, Shein lags behind the fashion and apparel industry for this metric, which receives 42.2% of traffic through direct channels, indicating the need to improve brand awareness. Organic search Shein’s percentage of traffic through organic search channels also trails the industry average of 31.1%, as does Amazon’s. Shein generates 20.1% through organic search vs. 24.6% for Amazon. Search terms Shein’s top search terms tend to be trendy, fashion-related terms or rival brand names rather than Shein-branded terms. In the U.S., these keywords scored higher than the best-performing branded keyword: Fashion Nova lingerie Forever 21 Zara overalls Paid advertising Shein’s investment in paid search seems to mitigate low brand awareness and help spur growth. This year, Shein received 18.9% of its worldwide desktop traffic through paid search, exceeding the fashion and apparel industry (11.7%) by over 7 percentage points. Amazon received just 3.2% of traffic through paid searches. Engagement metrics Shein’s website visitors are becoming more engaged. Looking at some key eCommerce metrics, we notice: Bounce rate: Shein shows progress by managing to push its bounce rates, down from 34% in August 2020 to 27% by July 2021. The graph’s upward trend of unbounced visits shows Shoppers are gaining confidence in Shein’s fast fashion. More and more visitors are coming to stay. Shein’s unbounced visits show growing engagement Pages visited: The number of pages users visit on average has grown from close to 13 last year to almost 16 pages this year. Audience loyalty Shein’s strong engagement metrics suggest it’s effectively building a strong, loyal customer base. An analysis of Amazon loyalty metrics using Similarweb Shopper Intelligence suggests Amazon also has a strong following. Customer loyalty for its apparel category is on the rise. July 2021, revenue for Subscribe and Save, its subscription program, went up over 70% MoM. In August, more than 67% of Amazon fashion and apparel shoppers were returning customers. Growing Subscribe and Save metrics indicate more recurring revenue for Amazon and that it is successfully growing out one sector of its business. Unlike Shein, Amazon is not known as a fashion business. Converted visits Despite online apparel shopping becoming more popular, consumers generally spend more time browsing before buying, lowering eCommerce conversion rates The 12% decline in conversion rates (CVRs) since January 2020 for Amazon’s fashion and apparel category, despite growing sales and product views, reflects this. Amazon’s current CVR for fashion and apparel is just 4.5% across U.S. desktop and mobile apps. CVR for Amazon’s Clothing category (via Shopper Intelligence) Shein started with a CVR of only 1% in 2019, caught up with the industry leaders in 2020, and reached 5% in March 2021, which exceeds Amazon. The growing number of converted visits for Shein, again, signals that it’s building trust among consumers. Visitors don’t just window-shop or compare styles and prices. It seems Shein’s low-price, fast-delivery fashion for everyone to enjoy makes it easy to reach a buying decision and optimize its conversion funnel. Shein vs. competing online retailers Shein may be a threat to Amazon’s fashion and apparel business, but it’s critical to note Amazon’s primary business ambitions are elsewhere. To get a better sense of where Shein stands, we’ll briefly compare it to top competing fast-fashion retailers. These are vying for the same audience’s attention. Despite the rise in consumer demand for online apparel shopping, competitor retailers hardly increased their CVRs since January 2019, whereas Shein grew to 5%. H&M maintained a conversion rate of 4%, Zara held steady at 5%, and only Nike increased from 3% to 5%. In a standoff between top competitors, Shein’s CVR further shows it may be a force to be reckoned with. Shein’s strong conversion rate growth may be a force for other retailers to reckon with Key takeaway Shein’s rise to fame was exceptionally fast, and the fast-fashion brand could soon outperform its competitors, becoming a game-changer in the online shopping category ‘fashion.’ Though Shein is growing quickly, its threat to Amazon as a whole seems to be minimal right now given Amazon’s size and diverse offerings. However, it is important to note that Amazon started by just selling books online, and perfected this – could Shein be next, but with fashion? Amazon and other top ecommerce sites may want to think about innovating in directions they didn’t previously consider and emulate Shein. Other marketplace comparisons To see more marketplace comparisons check out: Amazon vs. Walmart Aliexpress vs. eBay Wish and AliExpress ASOS vs. Next Amazon vs. eBay Ulta vs. Sephora Overstock vs. Wayfair vs. Amazon vs. Ikea Amazon vs. Shopify Target vs. Walmart Get your own insights Our analysis leverages Similarweb eCommerce solutions including Research Intelligence, which provides detailed data on the online digital retail landscape, and Shopper Intelligence, for detailed insights on Amazon and other marketplaces. Get a demo to stay ahead of Shein and other online retailers disrupting the eCommerce space. by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Amazon Insights Company Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Shein vs. Amazon – Is Fast Fashion Dressed for Success?"
    },
    {
      "level": "H2",
      "text": "Shining a light on Shein"
    },
    {
      "level": "H2",
      "text": "Why compare Shein vs. Amazon?"
    },
    {
      "level": "H3",
      "text": "Shein vs. Amazon: An overview"
    },
    {
      "level": "H2",
      "text": "How Shein became so trendy"
    },
    {
      "level": "H3",
      "text": "1. Mastery of fast fashion"
    },
    {
      "level": "H3",
      "text": "2. Provides fashion for regular people"
    },
    {
      "level": "H3",
      "text": "3. GenZ attraction"
    },
    {
      "level": "H2",
      "text": "Shein vs. Amazon: Digital performance"
    },
    {
      "level": "H3",
      "text": "Web traffic"
    },
    {
      "level": "H3",
      "text": "Main traffic channels"
    },
    {
      "level": "H4",
      "text": "Direct"
    },
    {
      "level": "H4",
      "text": "Organic search"
    },
    {
      "level": "H4",
      "text": "Search terms"
    },
    {
      "level": "H3",
      "text": "Paid advertising"
    },
    {
      "level": "H3",
      "text": "Engagement metrics"
    },
    {
      "level": "H3",
      "text": "Audience loyalty"
    },
    {
      "level": "H3",
      "text": "Converted visits"
    },
    {
      "level": "H2",
      "text": "Shein vs. competing online retailers"
    },
    {
      "level": "H2",
      "text": "Key takeaway"
    },
    {
      "level": "H3",
      "text": "Other marketplace comparisons"
    },
    {
      "level": "H3",
      "text": "Get your own insights"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}