{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/tonys-chocolonely/",
  "slug": "tonys-chocolonely",
  "title": "Amazon #1 Candy Brand Tony's Chocolonely eCommerce Insights | Similarweb",
  "description": "Tony Chocolonely is ranked #1 among top candy brands, with soaring Amazon & D2C growth. Get sweet insights from the chocolate maker, today!",
  "content": "HomeBlogEcommerceAmazon InsightsTony's Chocolonely: Lessons From Amazon’s Top Candy Brand Ecommerce Intelligence Tony’s Chocolonely: Lessons From Amazon’s Top Candy Brand See All Top 10 Brands by Emily Hunt , Market Research & eCommerce Specialist 4 Min. May 26, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Similarweb’s CPG expert, Alisha Kapur, recently analyzed Amazon’s top candy brands based on year-over-year (YoY) unit sales growth. Tony’s Chocolonely, came in first, growing an impressive 817% YoY. To uncover what’s fueling this mouthful-of-a-brand’s success, we’ll pull insights from Shopper Intelligence, our eCommerce intelligence tool. We’ll also share lessons from this mission-driven confectionary brand so that other CPG brands can improve their digital performance. Sweet product, sweeter mission In his effort to end child slavery in the chocolate industry, television producer and investigative journalist Teun van de Keuken founded Tony’s Chocolonely in 2006. His mission to create “100% slave-free chocolate,” became a core part of the brand’s identity. Over the following years, Tony’s Chocolonely expanded from the Netherlands into the U.S. and other countries, generating attention as an ethical company. Lesson 1: Social good triumphs in developing brand identity Today, Tony’s Chocolonely’s direct-to-consumer (D2C) website clearly emphasizes its mission first, followed by its chocolate shop, which aligns with its ethical brand identity. These priorities are reflected by its homepage, with the organization of its main menu (our mission, join in, chocoshop), and the above-the-fold content (reading left to right “our mission” is before its “choco shop”). A section of the website, “Why we are not on all lists of ethical chocolate brands” even addresses those that question the brand’s ability to live up to its mission, showing both dedication and transparency. So, what does Tony’s Chocolonely website have to do with its Amazon marketplace performance? Tony’s website reflects its mission-driven, unique brand image (and name), which resonates with consumers. It’s this strong identity that drives Amazon shoppers to specifically look for Tony’s Chocolonely on the platform. Over the past six months, branded searches made up more than 73% of its search traffic. These Amazon shoppers are high-intentioned. Tony’s Chocolonely’s conversion rate exceeds 55%, which is more than three times Amazon’s candy and the chocolate category average (17.8%). Once viewed, more than half of Tony’s shoppers buy. Lesson 2: Get exposure by leveraging Amazon for search and discovery Despite high conversion metrics, loyalty metrics are low. In the past six months (November–April), nearly 76% of customers were one-time purchasers only, which is more than the Amazon category average. We suspect that this is because shoppers purchase Tony’s Chocolonely for the first time on Amazon after hearing buzz about the brand. If they like the products, shoppers go directly to its website, or, use its store locator to support a local retailer for future purchases. Soaring monthly visits to Tony’s D2C website support this behavior. Using Shopper Intelligence, we see that combined desktop and mobile monthly traffic grew more than 600% from January 2020 to March 2021 (14,399 visits to 107,179 visits). With nearly 14% traffic share, Tony’s “all products” page, part of the “Chocoshop,” had the strongest performance on the website, demonstrating that users visit the website to shop. Key takeaways Since most consumers already regularly visit amazon.com brands should optimize their listings on the top eCommerce marketplace worldwide for maximum exposure. Once shoppers get familiar with your brand, they may be more likely to try it on Amazon or visit your website in the future. The price point of most candy products can also serve as an advantage. Purchases at low prices can help non-Prime members reach the minimum purchase amount to qualify for free shipping. Rather than spending a few dollars for delivery, consumers would rather buy a bar of chocolate. This could be Tony’s Chocolonely’s Milk Chocolate Bar with Caramel and Sea Salt, among its best-selling items, priced at $4.99. Devour more lessons from Amazon’s top candy brands These insights are just a taste of learnings from Amazon’s top candy brands of 2021 based on YoY growth. To learn more, check out our full report on Amazon’s candy industry. To get more insights on Amazon’s candy or another category, reach out to us to schedule a demo of Shopper Intelligence or access more insights reports. by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Tony’s Chocolonely: Lessons From Amazon’s Top Candy Brand"
    },
    {
      "level": "H2",
      "text": "Sweet product, sweeter mission"
    },
    {
      "level": "H2",
      "text": "Lesson 1: Social good triumphs in developing brand identity"
    },
    {
      "level": "H2",
      "text": "Lesson 2: Get exposure by leveraging Amazon for search and discovery"
    },
    {
      "level": "H3",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Devour more lessons from Amazon’s top candy brands"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}