{
  "url": "https://www.similarweb.com/blog/ecommerce/amazon-insights/top-cleaning-brands/",
  "slug": "top-cleaning-brands",
  "title": "Top Cleaning Brands on Amazon In 2021 | Similarweb",
  "description": "Check out the top cleaning brands for 2021 on Amazon and learn from the success of household cleaning brands cleaning up the ranking",
  "content": "HomeBlogEcommerceAmazon InsightsRanked: Top Cleaning Brands on Amazon in 2021 Ecommerce Intelligence Ranked: Top Cleaning Brands on Amazon in 2021 Download the List by Emily Hunt , Market Research & eCommerce Specialist 3 Min. May 21, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic “Spring cleaning,” is taking on a new meaning. Now, maybe for the first time in more than a year, many shoppers prep their homes for guests. In this post, we’ll use Shopper Intelligence data to examine Amazon’s top cleaning brands with the largest unit sales in 2021. We’ll look at the factors propelling their growth and provide tips for CPG brands. Amazon household cleaning category at a glance In 2021 (January-April) units sold and conversion rates increased for Amazon’s household supply category while revenue and product views are down. Since shoppers can now buy the products they want, when needed, rather than hoard bulk cleaning supplies, they are buying smaller ticket items with lower price points, at a higher frequency. Despite changing consumer dynamics, the same cleaning brands reign. Let’s look at (and learn from) who’s ranked highest. 1. Lysol cleans up rankings ahead of Clorox Lysol and Clorox, which account for nearly 25% of Amazon’s household cleaning supply revenue, take the number one and two spots for top cleaning supplies two years in a row. However, Lysol is gaining an edge over Clorox. While Lysol’s unit sales increased nearly 11%, Clorox declined by 22%, January-April 2021, year-over-year (YoY). Revenue and product views for both brands decreased. However, Clorox endured more losses with a revenue decline of 83% (vs. 44% for Lysol) and product views down 67% vs. 79% for Lysol. These declines align with overall category activity. Insight Lysol’s product selection has effectively adjusted to consumer demand. For two consecutive years, its fresh, crisp linen spray ranked among the top three category sellers. While last year the most popular offering was a 2 pack, priced at $10, this year the single fresh linen spray, approximately $4, is the bestseller. With in-store shopping rising with vaccine rollouts, consumers are spending less per transaction online, for lesser volume, but making them more frequent (whether online or in stores). Takeaway for CPG brands Ensure that your products come in single units, not just bulk or multi-packs. At a lower price point and quantity, it’s easier for shoppers to rationalize buying your products. 2. Green Gobbler gobbles up other household cleaners Green Gobbler, ranked third, climbed from seventh place just one year ago. “Green” acquisitions helped fuel this growth, including resources for marketing. In August 2020, Weiman Products, known for chemical cleaning supplies, acquired Green Gobbler, whose tagline says “safer, stronger, cleaning products.” The year before Carlyle Group, the leading private equity firm, acquired Weiman, with greener alternative products among goals. Shortly thereafter, the Green Gobbler acquisition was part of a $750 million deal to support Carlyle Group’s environmental, social, and governance (ESG) investment strategies. We suspect that additional resources helped Green Gobbler ramp up its ad budget, catapulting it to Amazon’s third top household cleaning brand. Green Gobbler’s paid search clicks more than doubled from 2020 to 2021 (176,000, to 390,000). Weiman’s paid clicks increased to a lesser extent, signifying that Green Gobbler’s eco-friendly, sustainable brand is more in touch with consumer sentiment and worthy of Carlyle’s investment. Takeaway for CPG Brands By expanding offerings to include more eco-friendly products, brands can appeal to increasingly conscious consumers that value sustainability and the environment. Ultimately, shoppers want products that align with their values. Leading investors are also eager to fund these brands. Methodology We pulled the list our list of top cleaning brands using Shopper Intelligence, which provides consumer and purchase behavior insights on Amazon and other eCommerce marketplaces. To learn more about trends in cleaning supplies or other CPG categories, connect with us to schedule a demo. We can also review more reports specific to your product offering. by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Amazon Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Updates Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard Amazon Insights Announcements by Similarweb 2 Min. Nov 27, 2022 Ecommerce Intelligence Black Friday Predictions for 2022 Amazon Insights Retail Insights by Sarah Mehlman 5 Min. Nov 3, 2022 Ecommerce Intelligence Amazon Sales Rank: Everything You Need to Know Amazon Insights by Sarah Mehlman 7 Min. Oct 2, 2022 Ecommerce Intelligence Amazon Product Listing Optimization Done Right [9 Expert Tips] Amazon Insights by Molly Winik 8 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Ranked: Top Cleaning Brands on Amazon in 2021"
    },
    {
      "level": "H2",
      "text": "Amazon household cleaning category at a glance"
    },
    {
      "level": "H2",
      "text": "1. Lysol cleans up rankings ahead of Clorox"
    },
    {
      "level": "H3",
      "text": "Insight"
    },
    {
      "level": "H3",
      "text": "Takeaway for CPG brands"
    },
    {
      "level": "H2",
      "text": "2. Green Gobbler gobbles up other household cleaners"
    },
    {
      "level": "H3",
      "text": "Takeaway for CPG Brands"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Shopper Intelligence My Brand Analytics Dashboard"
    },
    {
      "level": "H3",
      "text": "Black Friday Predictions for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon Sales Rank: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "Amazon Product Listing Optimization Done Right [9 Expert Tips]"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}