{
  "url": "https://www.similarweb.com/blog/insights/stock-news/hinge-bumble-dating/",
  "slug": "hinge-bumble-dating",
  "title": "Hinge Clear Dating Apps Growth Leader for Q2, Up 17% | Similarweb",
  "description": "Hinge's focus on long-term relationships yielded the greatest gain. Bumble, which puts women in charge of initiating contact, grew users 2.3% year-over-year",
  "content": "HomeBlogInsightsStock NewsHinge Clear Dating Apps Growth Leader for Q2, Up 17% Insights Hinge Clear Dating Apps Growth Leader for Q2, Up 17% Start your free trial by David F. Carr 4 Min. July 28, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Bumble also grew monthly active users 2.3% year-over-year, while Tinder dropped 7.7% – and others did worse In a dating apps market where usage has been trending down, the two apps that performed best in the second quarter were Hinge, which promises a focus on long-term relationships rather than quick hookups, and Bumble, which puts women in charge of initiating contact with potential dates. Tinder, which popularized the whole swipe-right / swipe-left metaphor of making snap judgments on potential mates, remains the most used app based on Similarweb estimates of combined monthly active users of iOS and Android in the US. However, the user count for Tinder dropped 7.7% in Q2, and most other dating apps saw even bigger losses in user engagement. Tinder and Hinge are both properties of Match Group, which also offers the Match dating app, Plenty of Fish, and others. Key takeaways Hinge monthly active users grew 17.2% in Q2, totaling 5.1 million in June. Bumble grew users by 2.3% in the quarter to 4.8 million in June. Tinder remains the most popular dating app, despite a 7.7% quarterly drop, with nearly 9 million monthly active users as of June. The apps with the biggest losses of monthly active users were Grindr (-8.6%), Match Dating (-13.9%), Plenty of Fish, another Match property (-22.2%), and Zoosk (-48.8%). Hinge and Bumble also had the best 30-day retention rates, based on active users of their Android apps in the US: 13.4% and 12.4%, respectively. While Hinge gained 2.2 million active users, year-over-year, for the quarter, Tinder users dropped by about the same amount. If we throw the Match app and Plenty of Fish into the equation, it looks like users of Match brands in total were down 3% year-over-year. These estimates take advantage of a new Similarweb data model for mobile apps, particularly for iOS, that is being introduced first in the US. Hinge and Bumble grew app usage in Q2, while most others dropped We’ve been monitoring a steady drop in in-app engagement, but it looks like Hinge and Bumble – the two promising to deliver more lasting relationships and treat women with more respect – are doing their best at bucking that trend. Hinge and Bumble also lead in 30-day retention Retention of users is a challenge for dating apps, where only a small fraction of new users are continuing to use the app after 30 days. Here’s what that looks like, on average, across all dating apps we track. In addition to growing fastest, Hinge and Bumble rank the highest for retention of users at the 30-day mark, at 13.4% and 12.4%, respectively. OkCupid is close behind at 10.3%, while the others fall below 10%. This ranking is based on Android active users in the US. Tinder remains the largest, followed by Hinge The two most popular apps by monthly active users are Tinder and Hinge, both properties of Match Group. They are followed by Bumble, Grindr, and Plenty of Fish, another Match property. Match’s namesake app trails in after OkCupid, which is owned by the holding company IAC. Hinge and Bumble rising on parallel paths Whether or not the trend of the quarter spells a lasting change toward the success of apps for lasting rather than transactional relationships, we can see that Hinge and Bumble are rising on parallel paths – with Bumble as the startup promising to redefine the dating app, Hinge providing Match Group’s answer, and Tinder still well ahead of both of them. Public companies referenced in this report include Match Group Inc. (NASDAQ: MTCH), Grindr Inc. (NYSE: GRND), and Bumble Inc. (NASDAQ: BMBL). Also Zoosk owner Spark Networks SE (NASDAQ: LOV). The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Stock News This post is subject to Similarweb legal notices and disclaimers. Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free!",
  "headers": [
    {
      "level": "H1",
      "text": "Hinge Clear Dating Apps Growth Leader for Q2, Up 17%"
    },
    {
      "level": "H2",
      "text": "Bumble also grew monthly active users 2.3% year-over-year, while Tinder dropped 7.7% – and others did worse"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Hinge and Bumble grew app usage in Q2, while most others dropped"
    },
    {
      "level": "H2",
      "text": "Hinge and Bumble also lead in 30-day retention"
    },
    {
      "level": "H2",
      "text": "Tinder remains the largest, followed by Hinge"
    },
    {
      "level": "H2",
      "text": "Hinge and Bumble rising on parallel paths"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}