{
  "url": "https://www.similarweb.com/blog/insights/betting-news/march-madness-sports-betting/",
  "slug": "march-madness-sports-betting",
  "title": "Sports Betting Up 20% During March Madness | Similarweb",
  "description": "More than 3 million US users per day were active in sports betting apps last weekend (iOS and Android, combined)",
  "content": "HomeBlogInsightsBetting NewsSports Betting Up 20% During March Madness Insights Sports Betting Up 20% During March Madness Start your free trial by David F. Carr 2 Min. March 29, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic More than 3 million US users per day were active in sports betting apps last weekend Sports betting activity driven by the March Madness college basketball championships for men and women was about 20% higher during a week at the peak of the action than at the same time last year, according to Similarweb estimates of active users for popular mobile apps. Sports betting on iOS and Android The nine mobile apps available in the US that we’ve been tracking collectively attracted more than 3.4 million daily active users on Friday and Saturday, 3.2 million on Sunday, and 2.7 million on Monday. FanDuel leads The most popular sports betting app, FanDuel Sportsbook, attracted 1.6 million daily users on Friday and Saturday, followed by DraftKings app, which had more than 870K active users on Saturday and Sunday. This app usage also includes other sports betting activity, but it’s safe to say that the surge over the past few days was driven by March Madness. While not at quite the same level as the Super Bowl or the NBA championship, March Madness is the beginning of a major cultural event that culminates in the early April championship. Legalized sports betting is now an increasingly big part of it. Betting might be even more intense if there was a little more suspense about the outcome. Following a couple of bracket-busting upsets in the first round of competition (like Oakland over Kentucky), the men’s basketball tournament coalesced around a more predictable set of top names for the Sweet Sixteen runoff underway now. Defending champion UConn is still favored to win the men’s championship in the end, while South Carolina could take it all for the women. Still, enough uncertainty remains to give fans something to bet on. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Photo by Jacob Rice on Unsplash by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Betting News Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Polymarket Traffic Surges as US Election Approaches Betting News by David F. Carr 3 Min. Oct 8, 2024 Insights Ahead of NCAA March Madness, Bracket Builders See 400% Traffic Spike Betting News by Molly Winik 2 Min. Mar 5, 2024 Insights Overtime Bonanza! Super Bowl’s First OT in 7 Years Fuels Betting App Frenzy Betting News Ecommerce News by Daniel Reid 4 Min. Feb 13, 2024 Insights Online Sports Betting Continues Rapid Growth in the US, Dovetailing with Fantasy Sports Betting News by David F. Carr 6 Min. Dec 19, 2023 Insights Use of Sports Betting Websites and Apps Jumps 60% with NFL Season Start Betting News by David F. Carr 4 Min. Sep 13, 2023 Insights March Madness Drives 34% Increase in Sports Betting Over Past 28 Days Betting News by Jim Corridore 3 Min. Mar 16, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Sports Betting Up 20% During March Madness"
    },
    {
      "level": "H2",
      "text": "More than 3 million US users per day were active in sports betting apps last weekend"
    },
    {
      "level": "H2",
      "text": "Sports betting on iOS and Android"
    },
    {
      "level": "H2",
      "text": "FanDuel leads"
    },
    {
      "level": "H3",
      "text": "Polymarket Traffic Surges as US Election Approaches"
    },
    {
      "level": "H3",
      "text": "Ahead of NCAA March Madness, Bracket Builders See 400% Traffic Spike"
    },
    {
      "level": "H3",
      "text": "Overtime Bonanza! Super Bowl’s First OT in 7 Years Fuels Betting App Frenzy"
    },
    {
      "level": "H3",
      "text": "Online Sports Betting Continues Rapid Growth in the US, Dovetailing with Fantasy Sports"
    },
    {
      "level": "H3",
      "text": "Use of Sports Betting Websites and Apps Jumps 60% with NFL Season Start"
    },
    {
      "level": "H3",
      "text": "March Madness Drives 34% Increase in Sports Betting Over Past 28 Days"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}