{
  "url": "https://www.similarweb.com/blog/insights/betting-news/similarweb-data-on-sports-betting-leading-up-to-world-cup-2022/",
  "slug": "similarweb-data-on-sports-betting-leading-up-to-world-cup-2022",
  "title": "Sports Betting Should Benefit From World Cup 2022  | Similarweb",
  "description": "We took a look at leading sports betting companies, using Similarweb data on web traffic and engagement in the run-up to World Cup 2022.",
  "content": "HomeBlogInsightsBetting NewsSports Betting Should Benefit From World Cup 2022 Insights Sports Betting Should Benefit From World Cup 2022 Start your free trial by Jim Corridore , Senior Analyst 4 Min. November 10, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic A look at leading beneficiaries worldwide World Cup 2022 starts November 20 and runs through December. The date was pushed back from June to cope with the extreme heat in host country, Qatar. Has this impacted betting for the event? We took a look at leading sports betting companies, using Similarweb data on web traffic and engagement. Key takeaways Global traffic to leading sports betting companies rose 3.5% in October, month over month, and was up 34% year over year. Sports betting could be seeing a positive impact from the World Cup 2022. Sports betting market leaders worldwide include bet365 (4.4% share of traffic), by far the largest, and some names you might not have heard of including pgjazz (2.3%), and bet9ja (1.6%). Leading U.S. sports betting companies DraftKings and FanDuel were not in the top 25, but have also seen strong October 2022 growth. Leading countries for sports betting include Brazil (soccer or football obsessed, depending on what you call it), Germany, the U.K., The U.S, and South Korea. Interest in betting rising ahead of World Cup 2022 The chart below tracks web traffic to the top 100 sports betting sites globally since October 2020. The World Cup did not take place in the past two years, so some of the increase in traffic in October 2022 could be attributed to the event. Global traffic to leading sports betting companies rose 3.5% in October, month over month, was up 34% year over year, and was up 102% over October 2020. Sports betting could be seeing a positive impact from the World Cup 2022. Brazil leads in sports betting, followed by Germany Traffic to sports betting sites in Brazil has spiked in advance of World Cup 2022. October saw a 62% increase year over year, and a 116% spike over October 2020. With 113.9 million visits in October 2022, Brazil leads the second largest sports betting country, the United States (77.9 million) by a wide margin. The below chart tracks the top seven sports betting countries over time. The United States has seen a surge in traffic to betting sites in the past two months, likely more aligned with the NFL than the World Cup. Bet365 dominates in Brazil sports betting The chart below shows just how much bet365.com dominates sports betting in Brazil, the country with the largest share of sports betting in the world. In Brazil, bet365 has averaged 93 million visitors on desktop and mobile web over the past three months, representing 14% of all sports betting in Brazil. However, betano.com, pixbet.com and futemax.app have seen huge growth over the past few months in the lead up to World Cup 2022. While bet365’s traffic in Brazil declined 25% in October from the prior year, betano saw 841% growth, futmax 3872% growth and pixbet 755% growth over that same period. United States sees strong growth in sports betting traffic. Draftkings leads A look at traffic to leading sports betting sites in the United States shows that traffic in the past two months has risen sharply. While this is most likely due to the onset of the NFL season rather than the World Cup, the rise in traffic versus the past two years could be at least partially due to World Cup 2022. Draftkings leads FanDuel by a wide margin, though both have seen strong traffic growth in the United States. For the month of October 2022, Draftkings had some 20.3 million visitors to its website on desktop and mobile web, a rise of 17% from the prior year, when there was no world cup but there was still a comparable NFL season, and 36% over October 2020. Fanduel had 13.9 million visitors in October 2022, up 5% and 23% from the past two Octobers. The chart below shows traffic on desktop and mobile web in the United States over the past two years. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/corp/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Jim Corridore Senior Analyst Jim provides insights across multiple sectors. With 30 years on Wall Street and numerous awards for stock-picking, he is a SUNY Albany graduate. Related Topics: Betting News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Polymarket Traffic Surges as US Election Approaches Betting News by David F. Carr 3 Min. Oct 8, 2024 Insights Sports Betting Up 20% During March Madness Betting News Media & Entertainment News by David F. Carr 2 Min. Mar 29, 2024 Insights Ahead of NCAA March Madness, Bracket Builders See 400% Traffic Spike Betting News by Molly Winik 2 Min. Mar 5, 2024 Insights Overtime Bonanza! Super Bowl’s First OT in 7 Years Fuels Betting App Frenzy Betting News Ecommerce News by Daniel Reid 4 Min. Feb 13, 2024 Insights Online Sports Betting Continues Rapid Growth in the US, Dovetailing with Fantasy Sports Betting News by David F. Carr 6 Min. Dec 19, 2023 Insights Use of Sports Betting Websites and Apps Jumps 60% with NFL Season Start Betting News by David F. Carr 4 Min. Sep 13, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Sports Betting Should Benefit From World Cup 2022"
    },
    {
      "level": "H2",
      "text": "A look at leading beneficiaries worldwide"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Interest in betting rising ahead of World Cup 2022"
    },
    {
      "level": "H2",
      "text": "Brazil leads in sports betting, followed by Germany"
    },
    {
      "level": "H2",
      "text": "Bet365 dominates in Brazil sports betting"
    },
    {
      "level": "H2",
      "text": "United States sees strong growth in sports betting traffic. Draftkings leads"
    },
    {
      "level": "H3",
      "text": "Polymarket Traffic Surges as US Election Approaches"
    },
    {
      "level": "H3",
      "text": "Sports Betting Up 20% During March Madness"
    },
    {
      "level": "H3",
      "text": "Ahead of NCAA March Madness, Bracket Builders See 400% Traffic Spike"
    },
    {
      "level": "H3",
      "text": "Overtime Bonanza! Super Bowl’s First OT in 7 Years Fuels Betting App Frenzy"
    },
    {
      "level": "H3",
      "text": "Online Sports Betting Continues Rapid Growth in the US, Dovetailing with Fantasy Sports"
    },
    {
      "level": "H3",
      "text": "Use of Sports Betting Websites and Apps Jumps 60% with NFL Season Start"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Jim Corridore"
}