{
  "url": "https://www.similarweb.com/blog/marketing/search-podcast/confirmation-bias-seo/",
  "slug": "confirmation-bias-seo",
  "title": "In Search Podcast: Confirmation Bias in Marketing | Similarweb",
  "description": "What is confirmation bias & does it impact your marketing? Carolyn Lyden joins the podcast to explain how confirmation bias works and how it affects your site!",
  "content": "HomeBlogMarketingIn Search PodcastIn Search Podcast: The World of Google Search from the Lens of Confirmation Bias Marketing Intelligence In Search Podcast: The World of Google Search from the Lens of Confirmation Bias Try Similarweb for free by Darrell Mordecai 21 Min. March 31, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Don’t forget, you can keep up with the In Search SEO Podcast by subscribing on iTunes or by following the podcast on SoundCloud! The Impact of Confirmation Bias on Marketing & SEO Practices: Summary of Episode 65 [This is a general summary of the podcast and not a word for word transcript.] Featuring: Mordy Oberstein (Host) Sapir Karabello (Co-Host) Carolyn Lyden of Search Hermit (Special Guest) Resources: Signup Form for 3-Months free access to our reporting dashboards #SEOchat Marie Haynes Informal Survey Marketing Psychology: Avoiding Confirmation Bias in Digital Marketing News: Google My Business Adds Temporarily Closed Option Google My Business Not Working 100% Google Adds New Support Doc For Health Clinic Listings Google Warns Businesses Not to Disable Their Website We welcome the podcast’s first-ever repeat guest, the one the only, the magnificent and always pleasant Carolyn Lyden joins us to chat it up about the pros and cons of confirmation bias in digital marketing! How can confirmation bias both help and hinder your digital marketing efforts How far can you push confirmation bias in your marketing without being unethical? Where are the lines? How does confirmation bias impact our favorite search engine? Plus, they’re here, they’re there… Google is spraying COVID-19 results around everywhere…. We dive into what’s happening, why it’s happening, and what it might mean for you! Outperform Your Competition - in Every Marketing Channel The all-in-one solution for data-driven marketing planning and competitor analysis Start your free trial Google Casting a Wide Net with COVID-19 Results [00:06:36 – 00:21:41] One day, Mordy was just minding his own business doing some research on websites ranking within the health vertical as he ups his core update game to new levels with even deeper and far more granular insights for Ungagged NYC this July (postponed). Anyway, Mordy was running a ton of long-tail health queries for data-driven insights when he noticed that a whole heap of them started showing results for COVID-19 but the intent had nothing to do with this stupid stupid virus. For example, searches like, “I’m a pregnant woman. Am I more likely to catch a cold…” showed COVID-19 results. In fact, 3 out of the top 4 results were COVID-19 related with one having nothing to do with pregnancy… just parenting and COVID-19. In short, it wasn’t very accurate! Plus, it’s preventing the real results from showing up. With this, Mordy noticed a bit of a pattern here. Let’s now go down the rabbit hole. Mordy ran a query for does having a poor immune system with diabetes mean I will get sick quicker. Sure enough, there were COVID-19 results. While there is nothing wrong with the results shown here, he wondered if there’s a connection between poor immunity and COVID-19 results. Specifically, what if you put poor immunity into an absurd query, would COVID-19 results still show up? So Mordy did a test. He first ran a search for Is walking into the backyard with autoimmune disease dangerous and found no COVID-19 results. Then he changed the word walking to traveling and sure enough, there were COVID-19 results! You see, autoimmune creates a COVID-19 context as we saw with does having a poor immune system with diabetes mean I will get sick quicker. But it needs something to trigger it. At this point, Google could show or not show COVID-19 results… yet it needs a trigger to show COVID-19 and travel is that trigger. What are we getting at? With tons of content being generated and with tons of searches related to COVID-19, Google’s machine learning is quickly creating conceptual connections. It knows that COVID-19 is a highly relatable topic, as in related to many things, and now it yearns to create conceptual connections to it. In our case it’s a pretty simple equation: travel + autoimmune = COVID-19 relevant. If you take travel out as we did with the query is walking into the backyard with autoimmune dangerous then out goes COVID-19 relevancy! It just goes to show how quickly Google’s machine learning assimilates things. This is just the initial stage, the equation between these concepts will only get more complex and more refined as time goes on. It does mean that for now, users may not be getting the content they want. It also means that there is less space on the SERP for the “right” content for queries like this. So if you rank for such queries, you need to check if you were pushed off the page or further down the page as a result. Seeing this might be a clue of what content to create or how to think of content creation and ranking such content when it relates to Corona because you will definitely not rank for queries that tackle the issue head-on as that’s left for the WHO and the NHS. But if you have a real and valuable take on an aspect of Corona and if you are a qualified health professional/content creator then these sorts of patterns in how Google understands the topic could help you create content that ranks well for long-tail queries. But if you take what Mordy’s saying and decide to write whatever crap about Corona just so you can rank, MORDY WILL HUNT YOU DOWN LIKE THE DOG YOU ARE! What’s the Deal with Confirmation Bias: A Conversation with Carolyn Lyden [00:21:41 – 01:07:11] Mordy: Welcome to a very special In Search SEO podcast interview session. Today we are concluding our Women in Search interview series with one of my favorite people in SEO. You may know her as one of Search Engine Journal’s top 140 SEOs to follow. You might know her as an SEO author. You might know her as the host and admin of SEO Chat which happens every Thursday at 1 pm Eastern time. You might even know her as an avid Falcons fan. She is the president and lead SEO of Search Hermit. She is Carolyn Lyden. Welcome! Carolyn: Thanks for having me. M: So let’s talk about confirmation bias. For the people who don’t know, what in the world is confirmation bias? C: Obviously, I’m not a psychology expert, but it sort of originates in psychology. It’s essentially when our brains like to make things really easy on us. So they create these shortcuts that help us jump from one conclusion to another without having to do all the extra work. We’re essentially building these bridges in our brains that get from point A to point B. They’re meant so we don’t have to do the work of building the bridge over and over again. Confirmation bias is part of where we see something that we assume is true and we jump to the conclusion that that’s what it is. Because of all the evidence that’s presented to us we interpret it in a way that confirms that conclusion. For example, if I assume that left-handed people are very artsy, all the evidence that indicates those markers for me I’ll use to confirm what I think about left-handed people and anything that goes against that I just shrug off. I’ll think, “Oh, it’s an anomaly. It’s a one-time thing. It’s only for this person” because it doesn’t confirm what I already thought. That’s the general premise of how I understand confirmation bias, especially when it comes to looking at our marketing. M: So it’s the Homer Simpson of psychological mechanisms. It’s a shortcut so you don’t have to think and you can just go on with your life. C: Sure, I mean, I don’t know that I would call it that. I don’t know a lot about the Simpsons to be honest. M: So let’s keep with the psychology aspect for one second, we’ll get to the marketing and the SEO side of it in a moment. Why do we have confirmation bias? Is it just quicker and easier that we have these preconceived a priori notions? Is it a whole scheme on how we view the world because we like fitting things into boxes? Where does it come from? What part of the mind is this thing? C: I think it’s really evolutionary. It’s when we look at things like stereotypes, obviously, we’re a woke culture now and we realize that not all stereotypes are true, but I do think that it sort of ties into the same thing as confirmation bias where our brains see the easy way to get through life without having to do all these computations along the way to assess what’s going on. Like I was saying with all artists being left-handed, I think it’s evolutionary to make it easy for us to not have to compute every single situation that we’re in. Obviously, we don’t do it consciously but our brain doesn’t have to do all the computations to get from point A to point B when we’re thinking about regular things in everyday life. I don’t have all the research on it (I can do research and send you links later), but I do think it’s evolutionary we’ve gotten to this point because it’s made it easier for us to live. To that note, back in the day, when we were cavemen, I’m assuming there were certain signals to us of what’s dangerous. If there’s a saber-toothed tiger on the horizon that is bad news for me and I need to run away or hide. So instead of having to calculate how fast the tiger can run I immediately know to get out of there. I think it has evolved from that to the modern-day. To touch on that, I do think that modern technology and the way that we’re using it has shifted the way confirmation bias works for us and sometimes against us. We evolved slowly over time and I do believe that technology has evolved way more rapidly. So maybe the ways that marketers and people in technology have used confirmation bias both for good and bad hasn’t necessarily been good for us as our brains weren’t built for that initially. So we’re having to be conscious about it in our everyday interactions, especially online. M: I think you need to elaborate on how that plays itself out. You’re right as things are advancing so rapidly. I see so much of it on social media and everywhere. It’s hard to really keep up with what exactly is happening around you and you don’t really realize what’s happening around you until it’s too late. So I wonder if you could speak to that in more detail. C: Yeah, for sure. I touched on the evolutionary side of it. If you think about it, I was looking at something where the amount of time from dinosaurs to now is shorter than you actually think it is. Think of the overall scope of human evolution and how long we’ve been on this planet and things like that. If you think about it in that way, from the start of social media to now is minuscule in the amount of time that has taken our brains to evolve. From being cavemen to now with social media marketing, advertisements everywhere, sponsored content, and stuff like that, our brains probably are not evolving as rapidly to catch on to those things which I think is why so certain people just haven’t figured out how social media works and how social media has taken advantage, for example, of their particular viewpoints or hijacks the way they see certain perspectives or certain people. I don’t remember the name of the movie, but there’s this movie that I remember watching where essentially we had gotten to a point in technology where advertisements were literally everywhere and it was just a way of life that everyone had accepted. Every window had advertisements and every building was covered in advertisements and we had gotten to a point where we just sort of ignored it. It was hard to break through as marketers and advertisers and so the brains of the people in that movie had developed to a point where they just completely ignored it and marketers were trying to find new and different ways to break through that or figure out how to make those messages resonate with people. I think we’re at a weird point where our brains are just now sort of figuring out these are the ways that marketing has taken advantage of our confirmation bias or the ways that we look at particular things and just assume they are XYZ ways. To make us believe a certain thing or make us purchase things or make us feel like we belong in a certain group that needs to buy these products or services, etc. M: I understand things might be accentuated by the fact that things are moving very rapidly with the use of technology, but I sort of feel that marketing is the ability, not in the micro-level, but at least at the macro-level to say they have a read on civilization and society and capitalize on their disposition. If you look back through an ad from the 1950s, 60s, 70s, or even the 80s or 90s people actually fell for what now is so obvious, but in the moment, the marketers were one step ahead on the psychological/evolutionary level. Is it really different now, is it more now, or is it qualitatively different than it was in the past eras? C: That’s a great point. I remember doing a project when I was getting my MBA in my advertising class about the first advertisements as they came out and it was things like doctors recommending smoking. Now, that would be insane. Why would your doctor recommend that? But back in the day it seemed logical. Like with confirmation bias, when you see a study that there are one or two benefits that come from smoking versus the 100 million drawbacks of smoking and they’ll advertise this with doctors saying that all pregnant women should be smoking. I think advertisements and marketing has always been on the cusp of trends and where people are going. I think the way that marketing and advertising has evolved has shaped the direction that people go. I’m thinking of things like Gwyneth Paltrow and her Goop brand which targets specifically rich white women who want to be like Gwyneth Paltrow. They’re building this lifestyle that people will happily walk into and think, “Oh, I want to be the kind of person who spends $100 on a tiny candle.” In modern marketing, we have created this environment where we’re ahead of what people think they want and we’re helping create that venue or pathway for them to go down to confirm their existing biases. M: Basically, we have the vision of Galileo and the ethical compass of Bernie Madoff. C: Perhaps, yeah. I don’t want to say that as I do know people who have a moral compass when creating marketing. I also think, as a marketer, you have to look at your own confirmation bias and how it affects the way you perform your job as a marketer. There are some things that we think are a good choice, or are not going to harm anyone or will help people when in reality, if you actually look at the data, you will see that you’re not making that positive decision. Like that smoking ad, maybe they really did think it was wise to recommend smoking from your doctor, but once they actually looked at the data and saw the information and the health drawbacks that were coming from it they stopped recommending it. M: I want to talk about the moral implications of all of this, but something you said before about confirmation bias and the evolution of the mind struck me. The way I think about these things is that however you want to slice what confirmation bias is, whether it’s evolutionary or not, it’s still a natural way of thinking and from my standpoint, and you may think that I’m wrong, but when something is natural there usually is a positive benefit to it as it’s the way humankind was supposed to be if you want to put it in those terms. But at the same time, the second you use the word “bias,” you usually think of something bad. But if it is a natural evolution of humankind, then it’s there for a reason and there must be a certain benefit to it. Meaning, you could benefit so confirmation bias is good sometimes. C: Yeah, I definitely think that in the example I was talking about before that the connections that we make and the conclusions that we draw from certain situations and use again in future situations can be super helpful. Like my previous example, if you see a dangerous animal on the horizon you should not approach, scream at, yell at it, or run toward that animal. You should run away. I definitely think that there are positives to it. We didn’t evolve this way nor did our brains create this bridge for us because it wants to trick us. It’s worked well and If you believe in the overall concept of evolution, the people who were living their lives this way and using their confirmation bias to survive are the people who did survive. That’s why it is a positive thing that we have today. That’s why I bring up the technology aspect of it because I do think there are elements of it that are positive and are helping us as humans live our lives every day. But there are definitely parts, both the elements on the part of consumers and marketers, that we have to be aware of to make sure that we’re not overstepping or making sure we’re not having a negative impact on ourselves or the people that we’re working with or for. M: Let me play devil’s devil’s advocate for a second. This is not my position, for the record, but let me just put it out there. I’m a marketer and I can say that I’m aware of your biases and I’m going to confirm them, but I’m just giving you what you want. It’s not my problem, I’m not doing anything wrong. C: I think a lot of marketers are like that. There comes a point where it’s not always worth the effort to tangle with yourself internally. Gwyneth Paltrow’s marketing team, to go back to our example, I’m sure that there are rich white ladies wanting this stuff and will easily buy this stuff and we’re just giving them what they want. I think a lot of gyms, for example, build this concept of you will be this person that you want to be and you’ll achieve these results. People want to be a part of that so it’s not that the gyms are terrible people that are using people for their money, they’re just trying to have a mutually beneficial relationship. And just because it doesn’t work for one person doesn’t mean it’s immoral. You just need to be aware of how we’re using it and that has potential negative effects and then weighing the cost-benefit analysis. I’m trying to think of a brand that thought that they were doing some really great things, but it didn’t turn out super awesome for them. I can’t think of one off the top of my head. M: I was just about to ask you. What’s a real case where confirmation bias was used in a positive way for good and for bad? C: The one I bring up the most is the 2016 election. That was one example of one group of people who, regardless of how they got their information which was definitely immoral in my opinion, used information like demographic information, opinion information, people belief information and then created these ads that targeted individual groups. That really solidified people’s confirmation bias about themselves. This is who I am as a person. This is what I believe. This is what I stand for and anyone who doesn’t feel the same way is in a group of others. I think that was one example of how confirmation bias was used by marketers in a very negative way of dividing America. Based on articles that I read and a couple of documentaries I’ve seen, I do feel like the political campaigns who used data analysts that looked at that marketing data and based on the initial way they were using data, I don’t think they really knew that’s what they were doing. They were sort of experimenting. They were trying new things and they had the money to do it. When they started seeing these very solidified groups going in different directions that was probably the point where they should have been asked, “Is this how we want this to go?” And I think it shows where the moral conundrum comes from for me personally. I do think they were initially using their own confirmation bias and then working to solidify other people’s confirmation biases as well and I don’t necessarily know that it had a negative intention at the very beginning, but that’s where it probably evolved eventually. M: We can go down the political world forever and the biases and how that will play itself out and that would be an amazing conversation for a totally different podcast. Let’s jump to Google because we’re an SEO podcast. Google has been accused of advancing confirmation bias. Google calls it the filter bubble where basically Google will give you what you want to see instead of giving you a more diverse set of results to help you have a wider truth for lack of a better term. Is that really a problem with Google or is it really a one-off and I’m hyperventilating about something that’s really an aberration? C: I honestly think it’s almost a mirror of the things that are happening in other industries or other mediums sort of like what’s happening where we were mentioning on the political side. I know this probably will anger some people so feel free to cut this out. But I think about when Donald Trump was ranting on Twitter about the things that were showing up in his Google news feed, and everyone is explaining that what you’re served is really based on what you’re clicking through to and articles for specific news organizations that you’re already reading. So Google is serving you what it thinks you want based on your previous activity, especially if you’re logged in. Google is not biased toward liberal news, it’s just that you’re clicking through that. I’m actually really interested in non-SEO people who use search. I’ve mentioned this to a couple of people that Marie Haynes recently did an informal survey with non-SEOs and I was really blown away that people don’t completely understand how Google search works. They don’t understand the results that they’re giving. They think that certain things are ads that aren’t ads and when they click an ad, they don’t actually know it’s an ad at first. Even talking with my own clients. In general, a lot of people don’t understand that personalization aspect, especially if the search that Google thinks it’s providing you with a really great user experience by showing you what it’s estimating that you want to see, based on your previous search history, the places you visit, things like that. So it thinks that it’s providing you with a great search experience, but there is also the potential for you to exist in your own bubble as there are other potential search results. Honestly, I’ve experienced it myself too, when I look for certain things in the news and I scroll down the Google News results and I see it from a publication that I don’t personally ever read or I wouldn’t consider it a reputable publication. I wonder why this is in my search result and I think, “Oh, maybe Google is actually trying to help me see more than one point of view here.” I think Google is trying to serve the users as best they can. But sometimes, maybe as users, we should not be given exactly what we want all the time. M: That’s exactly the point. I mean, speaking to the political side of this for a really quick second, I have family on both sides of the political spectrum where I’m sort of sideways. I don’t really fit into any spectrum. So I’ll have family members complain from both sides of the political aisle why do they only get these types of results? Google is biased! It’s amazing to me how people have an opinion on a complex algorithm that I hardly understand and I spend all my time trying to understand this stupid thing. It’s both sides of everybody, and everyone’s all worked up about this. This is where I think the problem is. It’s Google. Let’s take it into philosophical terms and you can correct me if I’m wrong, but if you’re dealing with the dissemination of knowledge you have a moral and ethical obligation that truth is put out there. When you’re dealing with knowledge you have to go beyond your bottom line to a certain extent I believe the use of personalization is a very big moral shortcoming. I know Google’s trying, and I think they have gotten that message. I just don’t know how they’re going to do this because everything they’re trying to serve with machine learning is all about personalization. I don’t know how they’re going to go in that direction while at the same time offer you what you need to see versus what you want to see. C: Yeah, I agree with that. It’s definitely, I don’t want to say it’s a conundrum, but it’s a hard problem to solve. I think it’s a fine line. M: My next question is, how bad is this going to get? C: I don’t know for sure. It makes me think if we’ll start having some sort of control over Google. I know that a lot of people think that there’s a monopoly and there should be some congressional control over it, but Google’s mission back in the day was just to not be evil and how they interpret that as a company now has evolved. I don’t know. I think it’ll probably get worse before it gets better. At least Google is trying to fact check. M: Yeah, they’re trying. Definitely trying. C: I think they’re making better efforts than Facebook. M: Yes. 100%. Agree. That’s a very good point. I’m optimistic about this, actually. I feel at a certain point, no matter how advanced Google gets with machine learning, it’s never going to be able to offer the level of personalization the user really wants. I think it’s going to have to let the user have some more control over what they see and have more input, whether it be through the usage of filters or the use of carousel cards that change what you see. Imagine, for example, you do a search for buy car insurance. Google shows you all these results where you can compare car insurance policies and learn about car insurance policies. But you don’t really want that as you want to buy a car insurance policy. So Google could give you a filter to click for commerce sites. We’re going to hit a point where the level of personalization will give you more control of what you want to see and be able to explore more directly without Google feeding you. C: Yeah, there is going to be a hassle. There has to be a level of people’s understanding of Google search to increase a little bit based on the stuff we were talking about before. But it definitely has potential. M: With all this, I have to ask you, and this is really where it becomes hard…. Things are going to progress, personalization is going to get bigger, things are going to get more complex, and technology’s going to continue advancing at a more rapid pace than before. How in the world are you supposed to walk that fine line between offering targeted, personalized content or results versus making sure that you don’t go too far with it? How do you actually deal with that? C: I think that’s a problem we’re all facing together as marketers and also as consumers. I think one point that’s really helpful is the data that you can gather to identify the trends that are happening either in your work as a marketer or what you’re seeing as a marketer with the people that you’re marketing towards, i.e., you target audiences. One way I think about confirmation bias is when we run an A/B test or we decide as marketers to test certain things or to try different things out, we come to those experiments with an attitude of, “Oh, I think this one is going to be the winner,” or, “I think this is what my target our audience wants.” We use that to potentially affect the test or the experiment by either not putting in all the effort into the second version of an A/B test or there’s no point in getting statistical significance and we’ll just run it for a couple of days and see what happens. Because of that, we’re sort of affecting how the data is presented and we don’t necessarily get all the information. Being as neutral as possible, even though it’s hard because we’re all humans, and then using all the data points and looking at it comprehensively in the wide range of data that’s happening and being presented to you or that you’re finding about what you’re doing and your job as a marketer and looking at it more objectively if you can find a way or even having a third-party, someone in a different department if you work at a large company, look at it as objectively as possible and checking what conclusions are they drawing that may be different from what I’m drawing. You will see what’s happening in your marketing from a more zoomed out perspective to see if maybe my confirmation bias, what I assume about my target audience, or what my target audience is telling me isn’t necessarily what I think is happening. You’re basically looking at that cold hard number. M: So you basically recommend people not to gloss over their shortcomings, inadequacies, and insecurities and to actually face them. As a cynic, I’m going to say good luck with that. C: Yeah, I understand that. I think that’s where a lot of marketing departments maybe fall short. When we interview people we ask what are your strengths and weaknesses? And everybody’s like, “Oh, my weakness is that I care too much.” I like it when people say their weakness is that they care too much or they’re too detail-oriented or I work too many hours. I can’t remember exactly who it was but maybe it was the guy who wrote the four-hour workweek. I’m pretty sure he was saying that he doesn’t spend his time working on his weaknesses, he spends his time making his strength stronger and finding people who can help counterbalance his weaknesses. He’ll say, “I want to be really awesome at what I’m really awesome at and then I want to find people to call me out on the things that I’m not great at.” That’s just one perspective. You don’t have to see your weakness as it’s the worst thing about you. It can actually be one of the best things about you is that you are strong in these other areas and you can find people who will call you out or help you with the areas that you’re not as strong in. M: Right. I mean, I feel like for something like that to happen you really have to have solid nuanced sensitive initiatives and structure in place in your company so that it happens in a methodical sort of way. I feel that I agree with you 1,000,000%. I just don’t feel like that’s going to happen naturally with most people. But if you have a sort of structure there that naturally lends itself towards that, maybe you could be successful. C: Yeah, and I think you don’t necessarily have to have the structure. I run my own business. I have random hours based on when I record podcasts with Mordy, when I take a doctor’s visit, or when I have to take my dog to the vet. So my schedule varies and it’s all over the place. I’m doing different projects for different clients. But there are generally things that when I’m trying to do them I’m either struggling, they take me longer, and I end up having to Google a bunch of resources or ask friends. I know that either 1) it is a big weakness for me personally on a skill level or 2) this is a weakness for me, personality-wise, and I don’t like doing this. I’d rather spend my time doing things that I know that I’m good at. So I can either outsource it or find a resource to help me get through that online. You can figure it out in a non-structured environment too. Even on your own, as a human, you might feel this is not working out for you or this is not the best way to spend your time. One of my bosses said to me if it’s taking you longer than 10 or 15 minutes to figure something out then you need to go ask someone else because you’re just wasting your time. After 30 minutes to an hour of trying to figure something out, that somebody else would have already done it. So don’t waste your time and find people who can help you with your weaknesses so that you’re more balanced and you’re not as likely to fall into the confirmation bias trap that a lot of marketers probably fall into. Optimize It Or Disavow It M: If you had to do one or the other, you either had to sell links or purposely confirm people’s biases, which would you do? C: So I don’t feel like they’re as bad as you do because I have worked with link building companies before that do what I would consider the correct and moral way where they’re doing link outreach. M: Oh, no, we’re talking about spammy link building, not real solid link building. C: Let me justify it how I want to. M: Fine. C: Then I was also thinking if I’m confirming people’s confirmation bias in a positive way and I’m ensuring that I’m not doing it in a negative way then I would also not mind that. I have such a negative connotation with both as being the scammy way. Link building is not my area of expertise and it feels so funny to me that the nasty link building that I would say that I was probably purposely confirming people’s existing biases but I would hope that I would be a moral enough person to do it in a positive way. M: Confirmation bias at its best. Thank you so much for coming on, Carolyn. C: Yeah, thanks for having me. I appreciate it. And join us on SEO Chat on Twitter every Thursday at 1 PM Eastern time. SEO News [01:07:28 – 01:11:23] Google My Business Adds Temporarily Closed Option: Amid COVID-19, GMB has added the option to indicate that a business is temporarily closed. Google My Business Not Working 100%: There have been a variety of complaints about things in GMB not working well. Things from editing your location or Google Posts have seen complications. Google Adds New Support Doc For Health Clinic Listings: Google has set up a new support doc to help health clinics set up their listing to better help patients stay up to date on COVID-19. Google Warns Businesses Not to Disable Their Website: Google says businesses impacted by COVID-19 should see disabling their site as a last resort. Google did offer some ideas depending on the scenario such as informing users of your situation with a pop-up. Tune in next Tuesday for a new episode of The In Search SEO Podcast. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: In Search Podcast This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "In Search Podcast: The World of Google Search from the Lens of Confirmation Bias"
    },
    {
      "level": "H2",
      "text": "The Impact of Confirmation Bias on Marketing & SEO Practices: Summary of Episode 65"
    },
    {
      "level": "H3",
      "text": "Google Casting a Wide Net with COVID-19 Results [00:06:36 – 00:21:41]"
    },
    {
      "level": "H3",
      "text": "What’s the Deal with Confirmation Bias: A Conversation with Carolyn Lyden [00:21:41 – 01:07:11]"
    },
    {
      "level": "H3",
      "text": "SEO News [01:07:28 – 01:11:23]"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}