{
  "url": "https://www.similarweb.com/blog/marketing/search-podcast/five-ways-seos-should-embrace-content-teams/",
  "slug": "five-ways-seos-should-embrace-content-teams",
  "title": "In Search Podcast: Embrace Content Teams | Similarweb",
  "description": "How well are you leveraging the power of your content teams? Ashley Liddell shares five key ways SEOs should be embracing their content teams.",
  "content": "HomeBlogMarketingIn Search PodcastIn Search Podcast: 5 Key Ways SEOs Should Be Embracing Their Content Teams Marketing Intelligence In Search Podcast: 5 Key Ways SEOs Should Be Embracing Their Content Teams Start your free trial by Darrell Mordecai 10 Min. August 16, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic How well are you leveraging the power of your content teams? That’s what we’re discussing today with a man who will be speaking about his learnings, observations, and skills in his mission to become an agency founder in the future at Brighton SEO in September. He’s an SEO content strategist at Reprise Digital. A warm welcome to the In Search SEO podcast, Ashley Liddell. In this episode, Ashley shares five ways SEOs should embrace content teams, including: Focus on outcomes over outputs Move away from being robots and embrace creativity Move away from perfection paralysis Embrace experience is Queen alongside content is King Conduct the band, don’t dictate to it 5 WAYS YOU SHOULD EMBRACE YOUR CONTENT TEAM 1. Focus on outcomes over outputs D: You can find Ashley over at ashleyliddell.co.uk. Today, you’re sharing the five key ways SEO should be embracing their content teams starting off with number one, focus on outcomes over outputs. A: Yeah, that’s definitely one of the keys. I think SEOs are in a weird transition, especially since the pandemic, when budgets have been shortening and agencies are expected to deliver a lot more and get as much as they can out of their budgets. It’s become really obvious that we’re we’re focusing on delivering X amount of blogs per month or delivering X number of pieces of content, rather than focusing on what that content is actually going to achieve in terms of the grander landscape or the wider strategy. One of the key ways for SEOs to do better and also bring content strategy into that conversation is to focus on outcomes over outputs. As SEOs, we tend to say that we need to create this piece of content to meet this keyword. But if we can bring content strategists into that conversation and say, “How is this piece of content going to help me move people through the user journey? How is that going to benefit the brand in terms of getting people closer to that ultimate purchase decision?” Then we can say that this doesn’t need to be its own standalone blog. This can sit within this piece of content, or this can sit on this landing page. And all of a sudden, we’re looking at creating a user experience that’s encompassing a wider journey, as opposed to just delivering x amount of blogs per month for a client and not delivering on a real strategy. D: I guess the challenge is if the keywords you’re talking about are top-of-funnel type keywords, and the funnel was quite long, then it becomes the challenge of how do you measure the effectiveness of that piece of content? What are your thoughts on the metrics or other outputs to measure the success of that type of content? A: I’d say that obviously, we face these challenges daily, and understanding what metric you’re going to use is vital to the success of your strategy. In terms of what metrics I tend to, if it was top of the funnel, I’d be looking at pages per session, I’d be looking at where the progressions are going, and how many pages the user is going on to visit. I’d also be looking at my brand awareness. Am I getting impressions? Am I getting clicks on a SERP, that’s key. And then, as I said, I’d be more concerned with the amount of people that are continuing their journey, and the KPIs that are associated with that, as opposed to the vanity metrics. Those would be the big ones. Can we move people down that funnel is the main one brands want us to achieve. So anything that’s concerned with that is going to be different for different brands, what they need to look out for their audience or for their brand. But definitely, how many people we are actually moving down that funnel? D: And what’s an example of a vanity metric? Is it a ranking position or something else? A: A ranking position can be because you can be ranking position one but if someone’s got a Featured Snippet, that ultimately leads to people then remembering that brand and coming back to that brand forever on in the journey. It’s okay ranking position one, but if someone’s position is zero, then it’s ultimately pointless if you’re not getting the traffic that then comes through with that. And then there’s also “People also ask questions”. You could be ranking page one and think you’re doing a really good job. But then all of a sudden, if someone’s doing effective work at ranking within those various Featured Snippets, not just the People Also Ask, then that’s going to be essential for their success and moving people through that follow-up. So yeah, I’m not a big fan of vanity metrics. D: I guess the challenge with People Also Ask type keyword phrases are they often allegedly have zero volume traffic when you measure them. Does that mean, as far as you’re concerned, that they’re worthless? A: No, it’s absolutely the opposite. It becomes tough to then measure that output but as long as your content is getting in front of the audience, and they’re remembering your brand, they’ll ultimately come to a purchase decision. This is obviously looking specifically at the top of the funnel. But if they’re going to remember your brand later down the road, then that’s absolutely fine. It’s more if you’re in a situation where your content is not strong enough so that they do remember your brand. But as long as they do, and they’re joining your website later down the funnel when they’re moving towards the consideration and conversion stages, then I’d say it’s absolutely fine to consider zero search volume keywords within your strategies or within your efforts. 2. Move away from being robots and embrace creativity D: Point number two is to move away from being robots and brace creativity. A: Yeah, that ties nicely with the previous point. To be a little bit fair, as SEOs, we historically have been super concerned with what Google and the like are doing as algorithms. And I think that we’re at a transition stage where we’re seeing brands turn to Creative SEO. And instead of looking to talk to Google and talk to the various algorithms on search engines, whatever that might be, or whatever the platform might be, we’re instead seeing brands focused on talking to the user first and saying, “If I speak to my user, first, the algorithms will follow suit. They’ll reward me for speaking to my audience or focusing on the audience.” And that’s become really important because search is everywhere. In that, it’s okay to have content ranking on Google, and you could master the Google algorithm, but then all of a sudden your users are demanding that you put content on Pinterest, TikTok, and YouTube, and all of a sudden you’re expected to master four or five. So instead of trying to master those five algorithms, you could just master talking to your audience in an effective way, or being creative in how you talk to your audience. And if you do that, then it’s likely that that’s going to resonate on some level with those various algorithms, because ultimately, they just want to give users the content to meet their needs. So if you can do that through creativity, as opposed to being a robot that’s churning out text content, for example, or specifically speaking to algorithms, then I think your content is going to be in a much better position. And that’s another example of why we need to be leveraging our content teams, because then we are going to be able to do that a lot more effectively than traditional SEOs, if that makes sense. D: You use that word ‘effective’ a few times there. How do you measure if you’re becoming more effective at talking to your audience? A: Your audience will tell you. For example, social shareability is going to be a big one. If you’re creating content that is naturally building backlinks. Or you’ve outreach that and then that’s getting backlinks as a result of your outreach efforts, then it’s likely that you’re talking to your audience in an effective way. Because journalists are covering it and websites have decided that it’s worthy to put in front of their audience who are likely your audience as well. On a simpler level, if someone goes and shares our infographic, our video, or our how to guide on their social media, then it’s likely that that type of social share is a good indication that it’s worked for that user, and they’re willing to put there word of mouth in sharing that. So I’d say that shareability of your content and how wide you can get your content is a really good indication of how it’s performing within the user audience. 3. Move away from perfection paralysis D: Point number three is to move away from perfection paralysis. A: This is a big one. Myself included, especially when I first started in the industry, which wasn’t too long ago, to be fair. Everybody seeks that perfect piece of content. And we need to remember that we’re serving content to an imperfect audience. As content creators or as content strategists, we could create what we believe is the perfect piece of content. But 90% of our audience could think that it’s actually not a perfect piece of piece of content as they needed another solution. What I’m trying to get at with that point is, it’s better to iterate a version of a piece of content, and then test, learn, evolve, and innovate that content over time. Rather than taking moments to deliberate in creating a piece of content, serving that piece of content, and then realizing six months after that it completely misses the mark. You could have learned that at month one or at week one just by testing, learning, and innovating your content solutions. 4. Embrace experience is Queen alongside content is King D: Number four embrace experience is Queen alongside content is king. A: This is a phrase that I coined a couple of weeks ago on one of my LinkedIn posts, and it’s essentially this idea that it’s widely accepted that content is king. And for those people that accept that they’d probably also likely accept that content experience or user experience is queen, i.e. it’s just as important as your content is. And what I mean by this is we’re at a stage now where to be remembered, we need to be creating effective content solutions. This goes back to the creativity point. If we can create valid, fun, and innovative content experiences, that’s going to lead to our brand awareness being generated by people remembering us as they get further on during the journey or down the purchase funnel. Essentially, it means we’re going to be making our brands more money when it comes to conversion time. I’d say it’s a vital stage of where we’re at. And it’s only going to develop and improve as things like AI and search everywhere become a bigger conversation point within the topic, where I think it’s going to become even more vital. D: Is there any trend that you’re seeing that people prefer to consume now as content? A: If we speak to the Gen Z audience, specifically, then it’s clear that TikTok is leading where we’re seeing bite-size, shareable, really quick, and snappy content is becoming more and more prominent. And as Gen Z embrace that then Millennials are following and then all of a sudden, the older audiences are likely to follow suit as well. I’d say that there’s justification in that theory in the fact that Google’s obviously introducing its Perspectives feed, which is going to share those bite-sized pieces of content in the video format, alongside other types of content. It’s a direct link to that short-form, snappy, straight-to-the-point video content. D: You started off talking about Gen Z but then you said that perhaps some older generations are going to move towards that as well. Does that mean that if you’re a brand that appeals to older generations, and that’s primarily your target market, you should be seriously considering and moving towards publishing short-form content? A: Yeah, I think so. Obviously, you could start by experimenting and testing that on your website. I’m not saying that you need to go and hire a TikTok team and put all your efforts into creating TikTok content. Experiment first and see if short-form content works for your brand on your website. As that starts to take shape, and you notice that your users are interested in that short-form content, look at what the trend line is with TikTok. As more older audiences continue to adopt that platform, you could be first into the market by saying that we’ve recognized that our users are willing to adopt short-form content because we’ve tested it on our website and we’re now seeing that more and more are taking TikTok seriously and spending more time on TikTok. Let’s repurpose that web content and put that on TikTok. Leverage that content further, get more bang for your buck. And all of a sudden, you’ve got a TikTok strategy. 5. Conduct the band, don’t dictate to it D: And point number five conduct the band, don’t dictate to them. A: This is more aimed at workflow and managing those relationships between teams. It would be very easy for SEOs to take the reign when it comes to the SEO strategy and say this is this is what we’re doing. This is how we’re doing it. And the content teams are expected to just write the content as per the brief. And once it meets the brief, it gets pushed live. That’s a common workflow. Whereas I’d say we’re at a stage now where it needs to be much more collaborative. Content strategists and content creators deserve a seat at the table. They probably always have, but that needs to be happening now. We need to invite their ideas into the conversation because, in a world where we need to create the most creative solution, we should be turning to the most creative people to come up with those solutions. So for SEOs that are maybe more tech-based, for SEOs that are really good at the strategy side of things, but they’re not necessarily great at creating that big idea, then leverage the people in your business that can do that, and involve them in the creation of your strategies. With that, you’re the conduct and you’re not just dictating the strategy. THE PARETO PICKLE – DOES IT INSPIRE, EDUCATE OR ENTERTAIN? D: Let’s finish off with the Pareto Pickle. Pareto says that you can get 80% of your results from 20% of your efforts. What’s one SEO activity that you would recommend that provides incredible results for modest levels of effort? A: We mentioned earlier about the perfection paralysis point, and that is a big stumbling block for brands and for strategists. I think one task people can do, to see if their content is working as hard as possible, is to ask three questions of their content. Does it inspire, does it educate, and does it entertain? And if you can answer yes to three or two of those three points, depending on the specific use case, then that’s when I’d say that this content is ready to go. It’s a really quick, really simple metric, and our way of checking that content. Once you’ve done that, you can continually be asking that because that’s likely to change over time. So as your content fatigues and it gets older, you’re just re-ask that question. And if you need to optimize, you optimize, ask that question again. And all of a sudden, you’ve got a really quick way of checking over your content. D: I’ve been your host, David Bain. You can find Ashley Liddell over at ashleyliddell.co.uk. Ashley, thanks so much for being on the In Search SEO podcast. A: I really appreciate it, David. Thank you. D: And thank you for listening. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: In Search Podcast This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "In Search Podcast: 5 Key Ways SEOs Should Be Embracing Their Content Teams"
    },
    {
      "level": "H2",
      "text": "5 WAYS YOU SHOULD EMBRACE YOUR CONTENT TEAM"
    },
    {
      "level": "H3",
      "text": "1. Focus on outcomes over outputs"
    },
    {
      "level": "H3",
      "text": "2. Move away from being robots and embrace creativity"
    },
    {
      "level": "H3",
      "text": "3. Move away from perfection paralysis"
    },
    {
      "level": "H3",
      "text": "4. Embrace experience is Queen alongside content is King"
    },
    {
      "level": "H3",
      "text": "5. Conduct the band, don’t dictate to it"
    },
    {
      "level": "H2",
      "text": "THE PARETO PICKLE – DOES IT INSPIRE, EDUCATE OR ENTERTAIN?"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}