{
  "url": "https://backlinko.com/hub/content/email-outreach",
  "slug": "email-outreach",
  "title": "Email Outreach: How to Send Effective Outreach Emails",
  "description": "A complete guide to sending outreach emails that get opened and replied to.",
  "content": "Email OutreachWritten by Brian DeanLast updated Aug. 02, 2024What Is Email Outreach? Email outreach is the process of getting in touch with other people via email. In content marketing, the goal is typically to promote a piece of content, to request a backlink, or to attempt to form a partnership/collaboration with an influencer. Why Is Email Outreach Important? We’ve all gotten bad outreach emails before. Your spam folder is probably full of them. In fact, all of the bad outreach emails that you get probably make you wonder: “Does email outreach actually work?”. The short answer: yes, email outreach can still work. Longer answer: To get people to reply to your outreach, you need to send the right types of outreach emails. Specifically: emails that don’t make you look like a spammer, that actually provide value to the people you’re emailing, and get the results you want. When you send outreach emails that people WANT to receive, your business will start to notice a few key benefits: Email outreach is still one of the best ways to build links. In fact, most link-building methods require you to send outreach emails. Email outreach helps you build relationships with other folks in your industry. These relationships can lead to partnerships, interviews, guest blogging opportunities and more. Outreach can also lead to press coverage. Especially when you send highly-targeted emails to journalists that cover your space. Best Practices Compile a List of Targets One of the most important parts of email outreach is making sure that you’re sending your outreach emails to the right people. This sounds like common sense. But I’m shocked at how many emails I receive that were clearly meant for someone else. With that, here’s how to create a list of outreach targets. Set goals: Different goals call for different outreach targets. If you’re looking for press coverage, you want to look for journalists who cover a related topic (like startups, if you’re a startup or the food industry if you’re a chef). If you’re trying to build links, you might be reaching out to people who have linked to similar pages in the past. The takeaway here is that you want to know EXACTLY what you want to get out of your outreach before you start blasting out emails to hundreds of people. Create Your List: Create a spreadsheet with each target’s names, why you’re reaching out to them, and the URLs of any relevant pages. For example, you might jot down the page you want them to link to you from, or a recent article they wrote covering your industry. You can also add a “status” column to show whether you’ve reached out yet and whether they’ve responded (if you use an email outreach tool, status is usually tracked inside of the tool). Here’s an example of how this list might look: Pro Tip: Having trouble creating a list? Use Semrush’s Influencer Analytics or a tool BuzzSumo to find influencers. (Notice that I said influencers, not celebrities. Be realistic.) Find Their Email Addresses Now it’s time to start collecting email addresses and adding them to the spreadsheet you just made. If possible, build your outreach list with specific people’s email addresses “joe@example.com”, not “info@example.com” or “webmaster@example.com”. There are a few tools I like for finding emails. They all have free tiers: Hunter.io: Probably my favorite email-finding tool. First, because it includes email verification. Second, because you can find emails from your browser. Voila Norbert: lets you choose specific people rather than lists of emails that they have in their database for a specific domain. Helpful when reaching out to big sites. Email Format: Good for larger companies, but doesn’t give you an exact email address. Use (Your Own) Templates When it comes to cold email outreach, people think “template” is a bad word. They think it means sending spammy “Dear sir or madam” messages to a million people at once (don’t do that). But templates can be massive time-savers if you use them properly. In fact, if you want to scale email outreach, you’ll need to use templates that you can personalize. With that, here’s how to develop your own templates: Start by looking at some example email templates for inspiration. But don’t send the exact same email you find online. Otherwise, your email will look like everyone else’s. Now make it your own. Add a little humor if you can, but keep it short. Pay special attention to the subject line. Do it all a second time, so you’ll have two different versions you can split-test. For example, this is a personalized version of a template that I use for broken link building. I based this template on scripts and case studies that I’d read before. And I added my own twist to make it unique. Personalize Your Outreach Emails Personalization is critical. It’s the single biggest thing that separates spammers from pros. In fact, our analysis of millions of outreach emails discovered that personalized emails get 1/3rd more replies than generic emails. Here’s how to personalize your outreach emails: Use their name. It’s amazing how often I get outreach emails that say “Dear sir” on them. When I see that, I don’t even bother to read the rest. Simply saying “Hi Brian” makes it 10 times more likely that I’ll read it. Reference something you saw of theirs on their site or elsewhere. This shows that you actually know who you’re sending your email to. If you can make it sound natural, give them a compliment. Here’s an example of a compliment that doesn’t come off as generic. Optional: Warm up your most important targets BEFORE you send your email. Leave really good comments on their blog posts, follow them on social media and share their work with your followers. Be Concise and Specific The people you’re reaching out to are probably very busy. So the more concise and specific you are in your email, the more likely you are to get a good response. Get to the point, quickly. It drives me crazy when someone sends me a super-long email: a five-paragraph monster that rambles on and on. Use the “inverted pyramid”approach. Put the most important elements at the beginning of your message. And keep it as short as you can after that. Here’s a great example: Fill in key details. Just as bad as the super-long email is its opposite: the one-sentence email, often asking for a phone call so they can tell me about an idea they have. These emails have a super low response rate because the person you’re sending to has no idea what you want. It’s much better to give someone a quick summary of your idea in your first message. If I’m interested then we can have the call (or I can ask for more information via email). There’s nothing wrong with your first cold outreach email being a “teaser” that introduces the idea and asks if they’d like to know more. Either don’t follow up or only do it once. Journalists list “too many follow-ups” as one of the top three most annoying things they have to deal with from email outreachers. I’m sure the same is true for non-journalists as well. So if you do follow up, do it only once. And try to include additional information or use a different angle. As Gisele Navarro says, “You’ve got nothing to lose so try something new.” Here’s an example of a follow up that brings something new to the table. Use An Email Outreach Tool Outreach tools can save you a lot of time. And help you scale. Here are some of my favorites. PitchBox: The tool that most outreach pros turn to. PitchBox includes workflows that guide you through outreach campaigns. BuzzStream: One of the oldest and best email outreach tools on the market. Good for solopreneurs and small teams that use cold outreach as part of their SEO campaigns. JustReachOut: Another solid tool. It’s designed to pitch journalists than bloggers or influencers. NinjaOutreach: Engineered specifically for SEO and link building outreach. Advanced Tips and Strategies Add LinkedIn, Facebook and Twitter links in your email signature. Our analysis found that this can make a huge dent in your reply rate. Tools like Email Signature Generator can help you add those links and other contact information with ease. Only use contact forms as a last resort. Sometimes you absolutely cannot find the email of the person that you want to get in touch with (it happens). In that case, a contact form is your best bet. But whenever you can, email the person you want something from directly. Master the process… THEN use a tool. If you’re new to email outreach, I recommend sending each email one-by-one. That way, you get a sense for what works and what doesn’t. Plus, you’ll avoid embarrassing newbie mistakes like this: Use long email subject lines. Why? Because they give your recipient a sneak preview into what your email is all about. Which can boost your open rate. Which can lead to more opens. Learn More Blogger Outreach: The Definitive Guide: Learn how to send targeted outreach emails to big name bloggers. Email Marketing: The Definitive Guide: Thorough guide that covers almost everything you need to know about email marketing. How to Write Outreach Emails (That Won’t Get Ignored): Fantastic video by Ahrefs that shows you how to create outreach templates that actually work. The Cold Email Masterclass: Massive guide to sending cold emails for sales, infographic promotion, influencer marketing and more.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Email Outreach"
    },
    {
      "level": "H3",
      "text": "What Is Email Outreach?"
    },
    {
      "level": "H3",
      "text": "Why Is Email Outreach Important?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Compile a List of Targets"
    },
    {
      "level": "H4",
      "text": "Find Their Email Addresses"
    },
    {
      "level": "H4",
      "text": "Use (Your Own) Templates"
    },
    {
      "level": "H4",
      "text": "Personalize Your Outreach Emails"
    },
    {
      "level": "H4",
      "text": "Be Concise and Specific"
    },
    {
      "level": "H4",
      "text": "Use An Email Outreach Tool"
    },
    {
      "level": "H4",
      "text": "Advanced Tips and Strategies"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}