{
  "url": "https://backlinko.com/hub/content/lead-magnets",
  "slug": "lead-magnets",
  "title": "What Are Lead Magnets?",
  "description": "Learn how to use Lead Magnets to build your email list in record time.",
  "content": "Lead MagnetsWritten by Brian DeanLast updated Aug. 07, 2021What Are Lead Magnets? Lead Magnets are pieces of exclusive content offered as an incentive for an action (typically signing up for an email newsletter or providing contact information). Common types of Lead Magnets include downloadable PDFs, case studies, resource lists, and videos. Why Do Lead Magnets Work So Well? Here are the top 3 reasons that Lead Magnets convert so well: Clear Reason to Subscribe: Lead magnets give people a tangible reason to subscribe to your email list. Unlike a pitch like “sign up for our newsletter”, which is a Lead Magnet, your subscriber knows exactly what they’re going to get in return for their email. They’re Targeted: Rather than offering the same generic “sign up for my email list” message on every page, you can offer bonuses that are specific to what your visitors are already looking at on that specific page. Or, you can offer different Lead Magnets depending on the category of a page that they’re looking at. For example, you can offer people reading a post about digital marketing a video case study on how to get more traffic. But for someone on an eCommerce product page, you can offer them a limited-time discount. That way, your offer is tailored to what that person wants, which can increase conversions. Qualifies Visitors: Lead Magnets help qualify your visitors. Obviously, no matter how compelling your Lead Magnet happens to be, you won’t get anywhere near 100% of your website visitors to sign up for your email list. But those who do are typically much more valuable than the average subscriber. Why? You already what they’re interested in based on which lead magnet they signed up for. This means you can send them targeted offers later on down the line using marketing automation and sales funnels. Best Practices How to Easily Create a Lead Magnet Lead Magnets don’t have to be complex or difficult. Especially when first starting out, it’s best to keep things simple. That said, you definitely want your Lead Magnet to be valuable. But you don’t necessarily need to “WOW” people with design or production value. But your Lead Magnet does have to be something that people will be happy to hand their email address over for. Otherwise, it won’t covert. Here are a few ways to quickly make different types of Lead Magnets. Use the free tool Attract to quickly create a good-looking lead magnet, based on proven templates. Create a checklist version of a long how-to guide to help people follow along and implement what you just taught. This can be done easily in Google Docs. When you’re done making it, just go to File → Download → PDF Document to export a PDF. You can do the same thing with Google Sheets Curate content and offer it as a Google Doc or PDF. Same idea as what I just described. But this time, you’re offering people a list of the best content on a given topic. Use the Simple Membership WordPress plugin to restrict access to some of your blog posts. This helps you repurpose some of your existing content to build your email list. For example, we publish a small percentage of our content as “Padlock Posts”. These posts are only accessible to email subscribers. And because they’re blog posts, you don’t need to hire a designer to make a fancy PDF. As soon as the post is published, it’s ready to become a Lead Magnet. Offer PDF versions of existing content. This is especially helpful if you publish a lot of long-form content. For example, this guide to link building on our blog is 4,732 words. Unless you’re dedicated to learning everything there is to know about link building right then and there, it’s not super likely that you’re going to read four thousand words in one sitting. Which is why we offer the post as a PDF. Even though this PDF is literally the same exact content that’s in the free blog post, this Lead Magnet offer converts super well. Customize Your Lead Magnet Based On Context The “Content Upgrade” is a special kind of Lead Magnet that’s tailored to the exact page — typically a blog post — your visitor is on. Using this method, I was able to increase my own conversion rate by 785% overnight. Here’s how it works: First, find a piece of content on your site that gets a lot of traffic. I recommend using the “Landing Pages” report from Google Analytics for this step. Second, figure out a way to improve that content. Specifically, something you could offer in an opt-in form (for example, a downloadable PDF, a set of extra tips or a video case study). This is the “upgrade” part of The Content Upgrade. You’re looking at a specific post and figuring out a way you could make that content even better. But instead of improving the post itself, you offer that additional value as a Lead Magnet. For example, this old on-page SEO post was pretty comprehensive. But it didn’t cover everything there is to know about optimizing your content. Just the most important strategies. So for people that want to learn even more about on-page SEO, we offered a PDF checklist that contained 2 bonus tips. Third, add the bonus resource to the piece of content you found earlier. The easiest way to do this is to simply add a form at the top of your blog post, like this: Finally, send the resource to people that signed up for it. Because you’re sending different people different Lead Magnets, this can get tricky. How you set this up depends a lot on the email marketing software that you use. For example, we use Aweber. And to deliver specific Lead Magnets to specific people, we have to essentially create a new autoresponder message for each new Lead Magnet. This is kind of a pain. But it works well. Other email marketing software platforms (like Convertkit) have Content Upgrades built into their UI. Features of Great Lead Magnets So: how do you create a good Lead Magnet that actually converts? As a blogger that built an email list to over 200k subscribers, I can tell you that certain offers convert MUCH better than others. Yes, creating a Lead Magnet for different members of your target audience will typically convert better than a generic offer. But it’s no guarantee that emails will start to flood in. So to get the most out of the Lead Magnets you create, I recommend sticking to these key principles. Your Lead Magnet needs to be worth the effort: People are getting shyer and shyer about giving away their email addresses. This means your Lead Magnet needs to be insanely valuable to convert. In other words, the value of your offer needs to outweigh the hassle of signing up for a newsletter. For example, one of our most popular Lead Magnets is a complete guide to SEO. And because this free guide is SUPER valuable to people that are looking to learn more about SEO, it converts super well. You need a great pitch: It’s one thing to have an awesome Lead Magnet. But for someone to actually sign up, you need to have a fantastic pitch. The exact pitch depends a lot on your Lead Magnet (for example, the pitch for a case study will be completely different than for a swipe file). But in general, your goal should be to make it clear what the person’s going to get. Here’s an example: Well-designed: It’s getting easier and easier to make good-looking lead magnets. Which means that people’s expectations are going up. Yes, a high-value Google Doc or plain PDF can still work. But design can help boost the perceived value of your Lead Magnet. Easy to get: It goes without saying that your Lead Magnet should be free. But you also want to make sure to also only ask for as many pieces of information as you really need. That’s because the more form fields you require, the fewer people will fill them out. This is why I only ask for one piece of information: an email address. That’s not to say that you have to limit yourself to one or two fields. HubSpot asks for a ton of information in exchange for their stuff. In their case, the information that they need is much higher than for the average blog. And that’s totally fine. Delivers on the promise: Collecting someone’s email address is only the first step in the lead generation process. You also want to build a strong relationship with your subscribers (especially new subscribers). This means your Lead Magnet should make new subscribers PUMPED that they signed up. After all, you only have one chance to make a first impression. And if your subscriber’s first impression is a lame PDF, potential customers are going to unsubscribe in droves. Don’t Put All Your Best Content In Lead Magnets Some companies “gate” their best content, making it impossible for you to access it without providing your email address. I’m sure this strategy helps increase conversion rates, but it has significant drawbacks. Why? If your best content is all in the form of Lead Magnets, you’ll have a much harder time getting backlinks. You’ll also get less traffic: people aren’t as like to share inaccessible content. And it’s almost impossible to rank for competitive keywords on Google without a sufficient amount of content on the page. For example, our study on Google CTR could have easily been published as something that required an email to access. And I’m sure we would have collected a few emails. But because we published our results in a blog post, we gave people something to share on social media. Which drove a ton of traffic to our site. And many of these folks became email subscribers. If you want to get the best of both worlds, you can at least include some information that’s not gated. For example, SEMrush publishes a high-level summary of their Google ranking factors industry study. This summary doesn’t include all the meaty details (you need to give them your email for that). But they do have SOME content on the page. That way, there’s something there for people to share and link to. Offer Your Lead Magnet Now that you’ve created a Lead Magnet, how do you let people know that it exists? Here are a few options: Popups: Popups may be annoying. But they work. And they’re a great way to offer your Lead Magnet to visitors. Here’s an example from our blog. Depending on the software that you use, you can even create a different popup for each of your Lead Magnets. That way, your popup is super duper targeted. Embedded forms: These are opt-in forms that you add to your existing content. As you can see, I don’t have a traditional form field there. Instead, I use a click-triggered form. When someone clicks on the link, the form appears as a mini popup. I like this approach because the link is subtle. And the only people that see the form are people that are actually interested in what you have to offer. Here’s another example of this approach: Pop-ins: These are less intrusive forms of popups. While they don’t covert as well as a traditional popup, they’re less distracting. Landing page: You can create a Squeeze Page for each of your different Lead Magnets. HubSpot is the master at this. Examples of Lead Magnet Types Here are 10 of the best Lead Magnet examples. PDF whitepapers and industry studies Video tutorials Cheat sheets Webinars Ebooks Case studies Tools and widgets Workbooks and templates Quizzes and assessments Multi-part email course Learn More Step-by-Step Guide to Using Content Upgrades: An in-depth guide to using Content Upgrades to build your email list. Includes the nuts and bolts of setting these up on your own site. 17 “Quick Hit” Lead Magnet Ideas (Video): An excellent video that walks you through 17 Lead Magnet ideas that you can use in your content marketing. 15 Call To Action Examples (and How to Write the Perfect One): This list can help you write a compelling CTA for each of the Lead Magnets that you offer.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Lead Magnets"
    },
    {
      "level": "H3",
      "text": "What Are Lead Magnets?"
    },
    {
      "level": "H3",
      "text": "Why Do Lead Magnets Work So Well?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "How to Easily Create a Lead Magnet"
    },
    {
      "level": "H4",
      "text": "Customize Your Lead Magnet Based On Context"
    },
    {
      "level": "H4",
      "text": "Features of Great Lead Magnets"
    },
    {
      "level": "H4",
      "text": "Don’t Put All Your Best Content In Lead Magnets"
    },
    {
      "level": "H4",
      "text": "Offer Your Lead Magnet"
    },
    {
      "level": "H4",
      "text": "Examples of Lead Magnet Types"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}