{
  "url": "https://backlinko.com/hub/content/topic-ideas",
  "slug": "topic-ideas",
  "title": "25 Creative Ways to Find New Content Ideas",
  "description": "25 easy ways to find LOTS of new content topic ideas, including tools and strategies.",
  "content": "25 Creative Ways to Find New Content IdeasLast updated Sep. 20, 2024Written by Shannon WillobyEver wished you had a magic wand that could automatically populate your content calendar with topics your audience will love? Well, here’s the next best thing. This list is filled with proven (and little-known) ways to find relevant content ideas for blogs, podcasts, videos, social media, and more. In fact, these very tips help us come up with high-performing topics for the Backlinko blog. And we get over 673,000 organic sessions per month: While this growth didn’t happen overnight, creating content on the right topics can significantly increase your organic traffic. And help you attract and retain your target audience. Let’s get started. 1. Use Google Image Tags Need content ideas fast? Head to Google Images and type in a broad topic idea like “chatbots.” Then, take a look at the tags Google suggests. You’ll see topics like “artificial intelligence” and “customer service.” Google considers these topics closely related to what you just typed. So, all you need to do is combine the tag with the keyword you searched for. For example, take the term “Paleo Diet.” You can use Google Image tags to come up with topics like “Paleo diet meal plan,” “Paleo Diet breakfast,” and more. Click on the arrow to see additional content topic ideas you can turn into blog posts, Instagram stories, TikTok videos, and more. Further reading: How to Promote Content on Social Media 2. Poll Your Audience What’s one of the best (and easiest) ways to find new content ideas? Go directly to the source: your customers or clients. Most popular social media platforms, like Instagram, LinkedIn, and X, have polling features. For example, Hired Remoteli, a remote job platform, polled its followers on LinkedIn to get ideas for podcast episodes. This valuable insight tells you exactly what your audience is interested in reading or listening to, giving your content a head start. Further reading: Podcasting: The Complete Beginner’s Guide 3. Take Advantage of Trending News Stories Turn trending topics into engaging content for your audience to help promote your brand, products, or services (aka newsjacking). Including: Popular news stories Viral social media challenges Timely entertainment topics Google Trends is perfect for this—but you can also find inspiration by scrolling social media feeds. Take note of trending topics—even if they’re not directly related to your brand. The key here is to get creative. Spin the trend so it’s relevant to your products or services. But don’t force it. Before you jump on the bandwagon, ensure the trend aligns with your brand values and message. For example, when audience intelligence tool SparkToro noticed a tweet by Elon Musk receiving a lot of attention, they saw an opportunity for newsjacking. In the tweet, Elon repeats Twitter’s claim that fake or spam accounts make up less than 5% of users, which inspired SparkToro and Followerwonk to conduct their own analysis. They found that the number was actually 19.42%—nearly four times Twitter’s estimate. So, they turned these findings into a blog post. Did newsjacking pay off for SparkToro? You could say that. Using Semrush’s Backlinks Analytics tool, we can see that the blog post received 1,600 backlinks from authoritative sites like Search Engine Land, Business Insider, and CNET. Pro tip: Organic traffic is just one indicator of success. Backlinks from reputable sites can also be highly valuable. By adding original data and insights to your content, you can build a strong backlink profile and enhance your site’s credibility. 4. Interview SMEs SMEs can add authority and expertise to your content. But they’re also a great source of content ideas. Talk to SMEs in your industry (and those within your organization) to uncover new angles and insights to create content for your audience. When interviewing SMEs, ask open-ended questions that encourage detailed responses. For example: What are the biggest challenges you see in our industry today? What advice would you give to newcomers in our field? What underrated tools or resources should professionals in our industry be aware of? How will technology impact our industry in the next 5-10 years? What critical skills should professionals in our industry develop to stay competitive? These questions can lead to niche content ideas that work well as short- or long-form content. Further reading: 12 Content Marketing Trends 5. Use Meta Ad Library When you’re fresh out of content ideas, turn to The Meta Ad Library. There, you’ll find a database of competitor ad content you can draw upon for inspiration. To use it, change the drop-down to “All Ads” and search for a Facebook page in your niche. For example, let’s say you have a wellness site, and Well+Good is your main competitor. Type their name into the search box. This will bring up their past and current ads. Pay special attention to posts that promote a specific piece of content. Why is this important? Well, if someone’s paying to promote a piece of content, it’s probably performing well for them. Like this Well+Good ad that links to a blog post with a brownie recipe. Plus, you get to see the exact words and phrases they use to promote their post. Which will come in handy when you start to promote your content. Make a list of topics that have performed well for your competitors’ ads in the past. And see what gaps you can fill in your content strategy. 6. Try a Content Idea Generator Content idea generators ensure you never run out of relevant topics. For example, Semrush’s Topic Research tool helps you discover new and trending content ideas. All you need is a broad topic to get started. Enter a topic into the tool. It’ll instantly return subtopics, headlines, and questions. Which you can sort by volume or difficulty. And turn into engaging posts for your audience. Note: A free Semrush account gives you two free searches in Topic Research. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. 7. Use The Reddit Keyword Research Tool Unlike most keyword research tools, The Reddit Keyword Research Tool doesn’t take a seed keyword and spit out a bunch of suggestions. Instead, this tool shows you hot topics people are discussing on Reddit, which is a quick way to find content ideas. All you need to do is pop a subreddit into the tool. And you’ll get a list of keywords people are talking about on that specific subreddit. The best part? The tool even pulls monthly search volume data from the Google Keyword Planner: 8. Spy on Your Competitors’ Content Strategies Ever wonder how your competitors consistently churn out engaging content that keeps their audience hooked? They’re likely monitoring what others in the industry are doing, and you can do the same. Here’s how: Use a tool like Semrush’s Organic Research to research your competitors’ top-performing content. Say you have a home improvement brand, and your top competitor is The Spruce. Use the Organic Research tool to view The Spruce’s most popular content, including estimated organic monthly traffic. Note: A free Semrush account gives you up to 10 credits in this tool per day. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. Next, click the number in the “Keywords” column to see the terms driving traffic to the site. Review the keywords to ensure they’re relevant to your brand and audience. Use this information to decide if the topic is right for your brand. But don’t copy your competitors. Consider how you can make the topic your own. Will your article be more comprehensive, feature a new angle, or include an expert quote? Use your competitors’ content strategies to create something better and outrank them in the SERPs. 9. Take Inspiration from Podcast Titles and Descriptions Browsing podcast titles and descriptions is an underrated—yet effective—way to find new content ideas First, head over to a podcast in your niche. For this example, we used “The Side Hustle Show.” Then, scan the episode list to spark content ideas. In about 30 seconds, you’ll find yourself with some solid topic ideas for your audience. Like tips for hiring a virtual assistant or how to scale a local service business. 10. Use The Exploding Topics Tool One of the best ways to find content topic ideas is to focus on new topics. Why? It’s simple: New topics aren’t super competitive (yet). So, when you’re the first to create a post on something new, you get a huge “first-mover advantage.” For example, in 2018, we were among the first to publish a comprehensive guide to voice search. And because we got in early, our post was shared like crazy. And it quickly racked up lots of links and mentions: The question is: How do you consistently find new topics? Exploding Topics. Exploding Topics is a free tool that scans the web for topics growing in popularity. If you want to find topics for your niche, sort the list by category. Options include tech, fitness, AI, and more. We used this tactic in the past to create a high-performing blog post for Backlinko. We searched Exploding Topics for trending keywords, and found one that was growing quickly at the time—Ubersuggest. So, we decided to whip up a quick post and add it to the SEO Marketing Hub. And because that topic (and keyword) weren’t super competitive yet, we hit the first page within about a week. Moral of the story? Don’t sleep on new topics—tackle them early and increase your chances of ranking highly in the SERPs. 11. Learn from Blog Comments The great thing about using comments from your blog is that you already know your audience will love the content you create. They’re literally asking you to write about that exact topic. For example, people had been asking us for a guide to local SEO for years. So, it was time to deliver. And sure enough, our audience loved it. Obviously, this strategy works best with comments on your own blog. But you can also use this approach on a competitor’s blog. For example, we usually spend some time looking at the comments section on other popular SEO blogs. And every now and again, we come across a really good topic idea we can use on the blog, LinkedIn, or another social media site. 12. Analyze Your Competitors’ YouTube Channels This technique couldn’t be easier. First, head over to a competitor’s YouTube channel. Then, sort their videos by “Most popular.” And you’ll see their all-time best videos in terms of views. We recommend heading to a few competitors’ channels to see what’s working well for them. For example, if you’re in the fitness space, the Fitness Blender channel would be a great one to watch. You can either sort by their most popular all-time videos. Or look at what topics have worked best for them over the last few months. Obviously, this strategy works best for finding topics for YouTube videos. But you can also use it to come up with topic ideas for blog posts, social media, infographics, podcasts, or any other type of content you create. 13. See What’s Trending on Product Hunt How do you get new topic ideas from Product Hunt? First, we recommend checking out the products that win product of the day, week, or month awards. We’re not recommending that you create content about these specific products (although you can). Instead, these products tell you problems people are looking to solve. And niches that are rapidly growing. For example, social media tools are doing well right now on Product Hunt. So, you could create a post that lists the 20 most popular social media management tools on the market. Or do a showdown like “SocialPilot vs. Sendible.” Product Hunt also has a ” Discussions ” forum where people ask questions about tech, AI, working remotely, and more. Look for questions relevant to your industry and turn them into engaging content for your audience. 14. View Google Analytics’ Landing Page Report This is a great way to scale up what’s already working for your blog. To be clear: This technique only works if your site has some traffic coming in. But if your blog generates even a little bit of traffic, you can use Google Analytics to come up with ideas for topics. All you need to do is head over to your Google Analytics “landing page” report. This shows you pages that are driving traffic to your website. You can use this data to figure out what’s working in terms of: Content topics Content formats (list posts, case studies, etc.) Authors (for multi-author blogs) Promotional strategies SEO Writing style Visuals, charts, and embedded videos Then, double down on what’s working best. For example, if you look at our landing page report, you can see that the posts on YouTube tend to outperform pretty much anything else. Which tells us we should put out more content about YouTube marketing. This is super valuable information. BuzzSumo and other tools can tell you what types of content are working best overall. But they don’t tell you what topics, formats, and angles work best for your site and audience. That’s why this strategy is so helpful: You can quickly determine which topics you should focus on. And update your strategy to match. 15. Consider Publishing Yearly Content If you’re in a competitive niche like ours, most of the keywords you come across are super competitive. For example, take the keyword “SEO.” According to Semrush, “SEO” has a keyword difficulty score of 96%. Well, here’s a sneaky way around this problem. Instead of creating another blog post on a competitive topic that will get buried in the SERPs, create an annual guide instead. No, you still won’t rank #1 for a competitive keyword like “SEO.” But you can rank for “keyword + year” versions of that term. For example, we publish a guide to SEO every year. Instead of a high-level overview of SEO, we focus on SEO trends that are taking off. Not only do people love these forward-looking guides… … but they can bring in a lot of traffic. In fact, this approach works so well that we created a content marketing yearly guide. This one didn’t perform as well as our SEO guide. But it still brings in a fair amount of traffic. You can do this regardless of your industry or the type of content you want to create. For example, you could create content on any of the following: The Definitive Guide to Traveling Solo in [Year] 7 SaaS Trends That Will Disrupt the Industry in [Year] 5 Pet Healthcare Trends Owners Need to Know for [Year] The [Year] Guide to Sustainable Fashion These topics work equally well as a blog post, infographic, carousel post, or video. 16. Check Google’s “People Also Search For” Section This is a great way to find low-competition, long-tail keywords. All you need to do is search for a broad topic you want to write about. Then, check the “People Also Search For” area in the search results. And you’ll get a list of topic ideas straight from Google. Click on one of the suggested search terms. And scroll to the People Also Search For section. Then, click on a suggested search from that list. For example, if you click “What backlinks are best for SEO?” from the original list, you’ll get this new list: Now, you know what people are searching for related to this topic. Which you can use as inspiration for relevant content ideas. Rinse and repeat “Inception” style. 17. Try the A/B Rankings Keyword Questions Tool Don’t want to manually sift through People Also Ask questions? This nifty little tool scrapes it for you. This way, you get access to a comprehensive list of popular questions. Questions you can answer with your content, whether it’s an FAQ page or ebook. 18. Research Low-Competition Keywords Reverse engineer a competitor’s top keywords to get content ideas using your favorite keyword research tool. Then, filter the results so it only shows you terms with super low competition (we usually go with a keyword difficulty of <20). Now, here’s a cool little trick. As you can see here, most of the low-competition keywords on this list aren’t great. Why? Look at the CPC estimates. Most of these terms have zero commercial intent. Here’s what you can do to fix this. Add another filter that only shows keywords with a CPC >$2.00. This way, the keywords on the list have at least some buyer intent. As you can see, this makes the list of low-competition keywords much better: Go through the list and see if inspiration strikes. 19. Review Conference Agendas in Your Industry If you want a fresh set of content ideas that you won’t find in any tool, check out conference agenda pages. These pages are GREAT because they show you in-demand topics. After all, people pay for a ticket and fly there just to learn about these topics. For example, check out this conference agenda page: There are three to four content topics that could work really well as short- or long-form content. Including articles, infographics, social media posts, and email newsletter content. Pro Tip: Pop a conference page into Keyword Planner to generate lots of ideas (and get monthly search volume data): 20. Use Pinterest’s Suggested Topics Feature Google isn’t the only search engine with a suggested search feature. In fact, Pinterest is a completely untapped source of potential content ideas. It works exactly the same way as Google autocomplete. Type in a keyword and get a list of suggestions. But the cool thing about using Pinterest is that you’re likely to get different content ideas than you’d get from Google. For example, when we type “gardening” into Pinterest, we get suggestions like “gardening for kids” and “gardening outfit.” But when we type the same search into Google, autocomplete suggests “gardening tools” and “gardening gifts.” 21. Analyze Social Media Conversations Your audience’s questions, pain points, and preferences are a valuable source of content ideas. Customer reviews and social media comments can tell you a lot about your customers’ wants and needs. For example, a quick look at Neil Patel’s X (formerly Twitter) account reveals multiple follower questions he could turn into blog posts. Like the best data visualization tools. And the types of content that get the most engagement on LinkedIn. 22. Subscribe to Newsletters in Your Industry Subscribing to industry newsletters is a smart way to get niche content ideas directly in your inbox. Newsletters (no matter the industry) often curate the latest trends, insights, and topics making waves in your field. By keeping up with these updates, you’ll never run out of fresh content ideas. For example, a recent issue of the #SEOForLunch newsletter featured interesting Google updates that could inspire a short social media video or long-form blog post. As you get weekly or monthly newsletters in your inbox, look for new studies, tools, and strategies you can expand upon in your own content. 23. Talk to Your Team Members Team members who interact directly with customers are an invaluable source of content ideas. This includes customer service reps, social media managers, and product managers. These people have firsthand knowledge of your audience’s pain points, questions, and interests. All of which can translate to impactful content ideas that are likely to resonate with your audience. For example, if your customer service team continually receives questions about how to use a specific feature of your product, that’s a clear sign you need to create a detailed how-to guide or video tutorial. Like this video tutorial from lifestyle site The Spruce that teaches its audience how to clean a washing machine. Ask your customer-facing team members to share the most common questions and recurring themes from customer interactions. Then, turn these ideas into helpful content that will increase engagement and traffic. 24. Browse Forums for Relevant Topics Forums like Quora and Reddit are filled with real people asking real questions (mostly—watch out for the trolls), which means they’re excellent sources for discovering content ideas. Identify common audience pain points, interests, and trends by browsing relevant threads. For example, on Reddit, you can filter subreddits by “Hot,” “New,” “Top,” and “Rising.” If you do this for the subreddit “Travel” and select “Top,” you’ll see potential content ideas immediately. Like a listicle of the top 10 temples to visit or a how-to guide on staying safe in Mexico. Look for questions that get a lot of engagement or have repeated themes. If you see multiple people asking the same question or lots of comments on a particular topic, you know there’s a demand for it. 25. Ask Artificial Intelligence for Help When all else fails, ask a robot. AI tools like ChatGPT can help you come up with relevant content ideas instantly. The key is to write a great prompt. Try something like this: Act like a content marketing expert for the hospitality industry and generate a list of content ideas a hotel management software company could use to attract and retain its target audience of hotel operators. Include a mix of topics that would work for informational, commercial, and transactional search intent. Now, you have a list of ideas categorized by intent. Whether you use the ideas as-is or as inspiration for a new angle, AI can be a powerful tool for filling your content calendar. Don’t like any of the ideas? Ask ChatGPT to generate 20 more. That’s the beauty of AI—it speeds up tasks that used to eat up hours of your day. Pro tip: New content is essential, but don’t neglect your older work. Revitalize it with fresh stats, updated images, and new links. Then, share it with your audience. It’s a smart way to keep your content relevant and your calendar full. Turn Your Ideas into High-Performing Content Coming up with great content ideas is just the beginning. The next step is writing high-quality, SEO-friendly content that drives organic traffic, leads, and conversions. Learn the basics in our SEO Content: Complete Beginner’s Guide.Ever wished you had a magic wand that could automatically populate your content calendar with topics your audience will love? Well, here’s the next best thing. This list is filled with proven (and little-known) ways to find relevant content ideas for blogs, podcasts, videos, social media, and more. In fact, these very tips help us come up with high-performing topics for the Backlinko blog. And we get over 673,000 organic sessions per month: While this growth didn’t happen overnight, creating content on the right topics can significantly increase your organic traffic. And help you attract and retain your target audience. Let’s get started. 1. Use Google Image Tags Need content ideas fast? Head to Google Images and type in a broad topic idea like “chatbots.” Then, take a look at the tags Google suggests. You’ll see topics like “artificial intelligence” and “customer service.” Google considers these topics closely related to what you just typed. So, all you need to do is combine the tag with the keyword you searched for. For example, take the term “Paleo Diet.” You can use Google Image tags to come up with topics like “Paleo diet meal plan,” “Paleo Diet breakfast,” and more. Click on the arrow to see additional content topic ideas you can turn into blog posts, Instagram stories, TikTok videos, and more. Further reading: How to Promote Content on Social Media 2. Poll Your Audience What’s one of the best (and easiest) ways to find new content ideas? Go directly to the source: your customers or clients. Most popular social media platforms, like Instagram, LinkedIn, and X, have polling features. For example, Hired Remoteli, a remote job platform, polled its followers on LinkedIn to get ideas for podcast episodes. This valuable insight tells you exactly what your audience is interested in reading or listening to, giving your content a head start. Further reading: Podcasting: The Complete Beginner’s Guide 3. Take Advantage of Trending News Stories Turn trending topics into engaging content for your audience to help promote your brand, products, or services (aka newsjacking). Including: Popular news stories Viral social media challenges Timely entertainment topics Google Trends is perfect for this—but you can also find inspiration by scrolling social media feeds. Take note of trending topics—even if they’re not directly related to your brand. The key here is to get creative. Spin the trend so it’s relevant to your products or services. But don’t force it. Before you jump on the bandwagon, ensure the trend aligns with your brand values and message. For example, when audience intelligence tool SparkToro noticed a tweet by Elon Musk receiving a lot of attention, they saw an opportunity for newsjacking. In the tweet, Elon repeats Twitter’s claim that fake or spam accounts make up less than 5% of users, which inspired SparkToro and Followerwonk to conduct their own analysis. They found that the number was actually 19.42%—nearly four times Twitter’s estimate. So, they turned these findings into a blog post. Did newsjacking pay off for SparkToro? You could say that. Using Semrush’s Backlinks Analytics tool, we can see that the blog post received 1,600 backlinks from authoritative sites like Search Engine Land, Business Insider, and CNET. Pro tip: Organic traffic is just one indicator of success. Backlinks from reputable sites can also be highly valuable. By adding original data and insights to your content, you can build a strong backlink profile and enhance your site’s credibility. 4. Interview SMEs SMEs can add authority and expertise to your content. But they’re also a great source of content ideas. Talk to SMEs in your industry (and those within your organization) to uncover new angles and insights to create content for your audience. When interviewing SMEs, ask open-ended questions that encourage detailed responses. For example: What are the biggest challenges you see in our industry today? What advice would you give to newcomers in our field? What underrated tools or resources should professionals in our industry be aware of? How will technology impact our industry in the next 5-10 years? What critical skills should professionals in our industry develop to stay competitive? These questions can lead to niche content ideas that work well as short- or long-form content. Further reading: 12 Content Marketing Trends 5. Use Meta Ad Library When you’re fresh out of content ideas, turn to The Meta Ad Library. There, you’ll find a database of competitor ad content you can draw upon for inspiration. To use it, change the drop-down to “All Ads” and search for a Facebook page in your niche. For example, let’s say you have a wellness site, and Well+Good is your main competitor. Type their name into the search box. This will bring up their past and current ads. Pay special attention to posts that promote a specific piece of content. Why is this important? Well, if someone’s paying to promote a piece of content, it’s probably performing well for them. Like this Well+Good ad that links to a blog post with a brownie recipe. Plus, you get to see the exact words and phrases they use to promote their post. Which will come in handy when you start to promote your content. Make a list of topics that have performed well for your competitors’ ads in the past. And see what gaps you can fill in your content strategy. 6. Try a Content Idea Generator Content idea generators ensure you never run out of relevant topics. For example, Semrush’s Topic Research tool helps you discover new and trending content ideas. All you need is a broad topic to get started. Enter a topic into the tool. It’ll instantly return subtopics, headlines, and questions. Which you can sort by volume or difficulty. And turn into engaging posts for your audience. Note: A free Semrush account gives you two free searches in Topic Research. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. 7. Use The Reddit Keyword Research Tool Unlike most keyword research tools, The Reddit Keyword Research Tool doesn’t take a seed keyword and spit out a bunch of suggestions. Instead, this tool shows you hot topics people are discussing on Reddit, which is a quick way to find content ideas. All you need to do is pop a subreddit into the tool. And you’ll get a list of keywords people are talking about on that specific subreddit. The best part? The tool even pulls monthly search volume data from the Google Keyword Planner: 8. Spy on Your Competitors’ Content Strategies Ever wonder how your competitors consistently churn out engaging content that keeps their audience hooked? They’re likely monitoring what others in the industry are doing, and you can do the same. Here’s how: Use a tool like Semrush’s Organic Research to research your competitors’ top-performing content. Say you have a home improvement brand, and your top competitor is The Spruce. Use the Organic Research tool to view The Spruce’s most popular content, including estimated organic monthly traffic. Note: A free Semrush account gives you up to 10 credits in this tool per day. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. Next, click the number in the “Keywords” column to see the terms driving traffic to the site. Review the keywords to ensure they’re relevant to your brand and audience. Use this information to decide if the topic is right for your brand. But don’t copy your competitors. Consider how you can make the topic your own. Will your article be more comprehensive, feature a new angle, or include an expert quote? Use your competitors’ content strategies to create something better and outrank them in the SERPs. 9. Take Inspiration from Podcast Titles and Descriptions Browsing podcast titles and descriptions is an underrated—yet effective—way to find new content ideas First, head over to a podcast in your niche. For this example, we used “The Side Hustle Show.” Then, scan the episode list to spark content ideas. In about 30 seconds, you’ll find yourself with some solid topic ideas for your audience. Like tips for hiring a virtual assistant or how to scale a local service business. 10. Use The Exploding Topics Tool One of the best ways to find content topic ideas is to focus on new topics. Why? It’s simple: New topics aren’t super competitive (yet). So, when you’re the first to create a post on something new, you get a huge “first-mover advantage.” For example, in 2018, we were among the first to publish a comprehensive guide to voice search. And because we got in early, our post was shared like crazy. And it quickly racked up lots of links and mentions: The question is: How do you consistently find new topics? Exploding Topics. Exploding Topics is a free tool that scans the web for topics growing in popularity. If you want to find topics for your niche, sort the list by category. Options include tech, fitness, AI, and more. We used this tactic in the past to create a high-performing blog post for Backlinko. We searched Exploding Topics for trending keywords, and found one that was growing quickly at the time—Ubersuggest. So, we decided to whip up a quick post and add it to the SEO Marketing Hub. And because that topic (and keyword) weren’t super competitive yet, we hit the first page within about a week. Moral of the story? Don’t sleep on new topics—tackle them early and increase your chances of ranking highly in the SERPs. 11. Learn from Blog Comments The great thing about using comments from your blog is that you already know your audience will love the content you create. They’re literally asking you to write about that exact topic. For example, people had been asking us for a guide to local SEO for years. So, it was time to deliver. And sure enough, our audience loved it. Obviously, this strategy works best with comments on your own blog. But you can also use this approach on a competitor’s blog. For example, we usually spend some time looking at the comments section on other popular SEO blogs. And every now and again, we come across a really good topic idea we can use on the blog, LinkedIn, or another social media site. 12. Analyze Your Competitors’ YouTube Channels This technique couldn’t be easier. First, head over to a competitor’s YouTube channel. Then, sort their videos by “Most popular.” And you’ll see their all-time best videos in terms of views. We recommend heading to a few competitors’ channels to see what’s working well for them. For example, if you’re in the fitness space, the Fitness Blender channel would be a great one to watch. You can either sort by their most popular all-time videos. Or look at what topics have worked best for them over the last few months. Obviously, this strategy works best for finding topics for YouTube videos. But you can also use it to come up with topic ideas for blog posts, social media, infographics, podcasts, or any other type of content you create. 13. See What’s Trending on Product Hunt How do you get new topic ideas from Product Hunt? First, we recommend checking out the products that win product of the day, week, or month awards. We’re not recommending that you create content about these specific products (although you can). Instead, these products tell you problems people are looking to solve. And niches that are rapidly growing. For example, social media tools are doing well right now on Product Hunt. So, you could create a post that lists the 20 most popular social media management tools on the market. Or do a showdown like “SocialPilot vs. Sendible.” Product Hunt also has a ” Discussions ” forum where people ask questions about tech, AI, working remotely, and more. Look for questions relevant to your industry and turn them into engaging content for your audience. 14. View Google Analytics’ Landing Page Report This is a great way to scale up what’s already working for your blog. To be clear: This technique only works if your site has some traffic coming in. But if your blog generates even a little bit of traffic, you can use Google Analytics to come up with ideas for topics. All you need to do is head over to your Google Analytics “landing page” report. This shows you pages that are driving traffic to your website. You can use this data to figure out what’s working in terms of: Content topics Content formats (list posts, case studies, etc.) Authors (for multi-author blogs) Promotional strategies SEO Writing style Visuals, charts, and embedded videos Then, double down on what’s working best. For example, if you look at our landing page report, you can see that the posts on YouTube tend to outperform pretty much anything else. Which tells us we should put out more content about YouTube marketing. This is super valuable information. BuzzSumo and other tools can tell you what types of content are working best overall. But they don’t tell you what topics, formats, and angles work best for your site and audience. That’s why this strategy is so helpful: You can quickly determine which topics you should focus on. And update your strategy to match. 15. Consider Publishing Yearly Content If you’re in a competitive niche like ours, most of the keywords you come across are super competitive. For example, take the keyword “SEO.” According to Semrush, “SEO” has a keyword difficulty score of 96%. Well, here’s a sneaky way around this problem. Instead of creating another blog post on a competitive topic that will get buried in the SERPs, create an annual guide instead. No, you still won’t rank #1 for a competitive keyword like “SEO.” But you can rank for “keyword + year” versions of that term. For example, we publish a guide to SEO every year. Instead of a high-level overview of SEO, we focus on SEO trends that are taking off. Not only do people love these forward-looking guides… … but they can bring in a lot of traffic. In fact, this approach works so well that we created a content marketing yearly guide. This one didn’t perform as well as our SEO guide. But it still brings in a fair amount of traffic. You can do this regardless of your industry or the type of content you want to create. For example, you could create content on any of the following: The Definitive Guide to Traveling Solo in [Year] 7 SaaS Trends That Will Disrupt the Industry in [Year] 5 Pet Healthcare Trends Owners Need to Know for [Year] The [Year] Guide to Sustainable Fashion These topics work equally well as a blog post, infographic, carousel post, or video. 16. Check Google’s “People Also Search For” Section This is a great way to find low-competition, long-tail keywords. All you need to do is search for a broad topic you want to write about. Then, check the “People Also Search For” area in the search results. And you’ll get a list of topic ideas straight from Google. Click on one of the suggested search terms. And scroll to the People Also Search For section. Then, click on a suggested search from that list. For example, if you click “What backlinks are best for SEO?” from the original list, you’ll get this new list: Now, you know what people are searching for related to this topic. Which you can use as inspiration for relevant content ideas. Rinse and repeat “Inception” style. 17. Try the A/B Rankings Keyword Questions Tool Don’t want to manually sift through People Also Ask questions? This nifty little tool scrapes it for you. This way, you get access to a comprehensive list of popular questions. Questions you can answer with your content, whether it’s an FAQ page or ebook. 18. Research Low-Competition Keywords Reverse engineer a competitor’s top keywords to get content ideas using your favorite keyword research tool. Then, filter the results so it only shows you terms with super low competition (we usually go with a keyword difficulty of <20). Now, here’s a cool little trick. As you can see here, most of the low-competition keywords on this list aren’t great. Why? Look at the CPC estimates. Most of these terms have zero commercial intent. Here’s what you can do to fix this. Add another filter that only shows keywords with a CPC >$2.00. This way, the keywords on the list have at least some buyer intent. As you can see, this makes the list of low-competition keywords much better: Go through the list and see if inspiration strikes. 19. Review Conference Agendas in Your Industry If you want a fresh set of content ideas that you won’t find in any tool, check out conference agenda pages. These pages are GREAT because they show you in-demand topics. After all, people pay for a ticket and fly there just to learn about these topics. For example, check out this conference agenda page: There are three to four content topics that could work really well as short- or long-form content. Including articles, infographics, social media posts, and email newsletter content. Pro Tip: Pop a conference page into Keyword Planner to generate lots of ideas (and get monthly search volume data): 20. Use Pinterest’s Suggested Topics Feature Google isn’t the only search engine with a suggested search feature. In fact, Pinterest is a completely untapped source of potential content ideas. It works exactly the same way as Google autocomplete. Type in a keyword and get a list of suggestions. But the cool thing about using Pinterest is that you’re likely to get different content ideas than you’d get from Google. For example, when we type “gardening” into Pinterest, we get suggestions like “gardening for kids” and “gardening outfit.” But when we type the same search into Google, autocomplete suggests “gardening tools” and “gardening gifts.” 21. Analyze Social Media Conversations Your audience’s questions, pain points, and preferences are a valuable source of content ideas. Customer reviews and social media comments can tell you a lot about your customers’ wants and needs. For example, a quick look at Neil Patel’s X (formerly Twitter) account reveals multiple follower questions he could turn into blog posts. Like the best data visualization tools. And the types of content that get the most engagement on LinkedIn. 22. Subscribe to Newsletters in Your Industry Subscribing to industry newsletters is a smart way to get niche content ideas directly in your inbox. Newsletters (no matter the industry) often curate the latest trends, insights, and topics making waves in your field. By keeping up with these updates, you’ll never run out of fresh content ideas. For example, a recent issue of the #SEOForLunch newsletter featured interesting Google updates that could inspire a short social media video or long-form blog post. As you get weekly or monthly newsletters in your inbox, look for new studies, tools, and strategies you can expand upon in your own content. 23. Talk to Your Team Members Team members who interact directly with customers are an invaluable source of content ideas. This includes customer service reps, social media managers, and product managers. These people have firsthand knowledge of your audience’s pain points, questions, and interests. All of which can translate to impactful content ideas that are likely to resonate with your audience. For example, if your customer service team continually receives questions about how to use a specific feature of your product, that’s a clear sign you need to create a detailed how-to guide or video tutorial. Like this video tutorial from lifestyle site The Spruce that teaches its audience how to clean a washing machine. Ask your customer-facing team members to share the most common questions and recurring themes from customer interactions. Then, turn these ideas into helpful content that will increase engagement and traffic. 24. Browse Forums for Relevant Topics Forums like Quora and Reddit are filled with real people asking real questions (mostly—watch out for the trolls), which means they’re excellent sources for discovering content ideas. Identify common audience pain points, interests, and trends by browsing relevant threads. For example, on Reddit, you can filter subreddits by “Hot,” “New,” “Top,” and “Rising.” If you do this for the subreddit “Travel” and select “Top,” you’ll see potential content ideas immediately. Like a listicle of the top 10 temples to visit or a how-to guide on staying safe in Mexico. Look for questions that get a lot of engagement or have repeated themes. If you see multiple people asking the same question or lots of comments on a particular topic, you know there’s a demand for it. 25. Ask Artificial Intelligence for Help When all else fails, ask a robot. AI tools like ChatGPT can help you come up with relevant content ideas instantly. The key is to write a great prompt. Try something like this: Act like a content marketing expert for the hospitality industry and generate a list of content ideas a hotel management software company could use to attract and retain its target audience of hotel operators. Include a mix of topics that would work for informational, commercial, and transactional search intent. Now, you have a list of ideas categorized by intent. Whether you use the ideas as-is or as inspiration for a new angle, AI can be a powerful tool for filling your content calendar. Don’t like any of the ideas? Ask ChatGPT to generate 20 more. That’s the beauty of AI—it speeds up tasks that used to eat up hours of your day. Pro tip: New content is essential, but don’t neglect your older work. Revitalize it with fresh stats, updated images, and new links. Then, share it with your audience. It’s a smart way to keep your content relevant and your calendar full. Turn Your Ideas into High-Performing Content Coming up with great content ideas is just the beginning. The next step is writing high-quality, SEO-friendly content that drives organic traffic, leads, and conversions. Learn the basics in our SEO Content: Complete Beginner’s Guide.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H6",
      "text": "Find Keyword Ideas in Seconds"
    },
    {
      "level": "H1",
      "text": "25 Creative Ways to Find New Content Ideas"
    },
    {
      "level": "H2",
      "text": "1. Use Google Image Tags"
    },
    {
      "level": "H2",
      "text": "2. Poll Your Audience"
    },
    {
      "level": "H2",
      "text": "3. Take Advantage of Trending News Stories"
    },
    {
      "level": "H2",
      "text": "4. Interview SMEs"
    },
    {
      "level": "H2",
      "text": "5. Use Meta Ad Library"
    },
    {
      "level": "H2",
      "text": "6. Try a Content Idea Generator"
    },
    {
      "level": "H2",
      "text": "7. Use The Reddit Keyword Research Tool"
    },
    {
      "level": "H2",
      "text": "8. Spy on Your Competitors’ Content Strategies"
    },
    {
      "level": "H2",
      "text": "9. Take Inspiration from Podcast Titles and Descriptions"
    },
    {
      "level": "H2",
      "text": "10. Use The Exploding Topics Tool"
    },
    {
      "level": "H2",
      "text": "11. Learn from Blog Comments"
    },
    {
      "level": "H2",
      "text": "12. Analyze Your Competitors’ YouTube Channels"
    },
    {
      "level": "H2",
      "text": "13. See What’s Trending on Product Hunt"
    },
    {
      "level": "H2",
      "text": "14. View Google Analytics’ Landing Page Report"
    },
    {
      "level": "H2",
      "text": "15. Consider Publishing Yearly Content"
    },
    {
      "level": "H2",
      "text": "16. Check Google’s “People Also Search For” Section"
    },
    {
      "level": "H2",
      "text": "17. Try the A/B Rankings Keyword Questions Tool"
    },
    {
      "level": "H2",
      "text": "18. Research Low-Competition Keywords"
    },
    {
      "level": "H2",
      "text": "19. Review Conference Agendas in Your Industry"
    },
    {
      "level": "H2",
      "text": "20. Use Pinterest’s Suggested Topics Feature"
    },
    {
      "level": "H2",
      "text": "21. Analyze Social Media Conversations"
    },
    {
      "level": "H2",
      "text": "22. Subscribe to Newsletters in Your Industry"
    },
    {
      "level": "H2",
      "text": "23. Talk to Your Team Members"
    },
    {
      "level": "H2",
      "text": "24. Browse Forums for Relevant Topics"
    },
    {
      "level": "H2",
      "text": "25. Ask Artificial Intelligence for Help"
    },
    {
      "level": "H2",
      "text": "Turn Your Ideas into High-Performing Content"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}