{
  "url": "https://backlinko.com/hub/content/viral",
  "slug": "viral",
  "title": "What is Viral Content?",
  "description": "Learn how to create viral content that leads to social media shares and traffic.",
  "content": "Viral ContentWritten by Brian DeanLast updated Aug. 02, 2024What Is Viral Content? Viral content is online content that achieves a high level of awareness due to shares and exposure on social media networks, news websites, aggregators, email newsletters, and search engines. Why Is Viral Content Important? A single piece of viral content can generate significant amounts of brand awareness and traffic to your website. And because most of the traffic comes from social shares, viral content is relatively cheap compared to paid ads. But there’s a catch: Viral content is tough to pull off. In fact, our content marketing study found that a small percentage of content (called “Power Posts”) drive most social sharing. In other words: Most content gets virtually zero shares. But a few top performers tend to dominate. So, how do you get your content to go viral? Check out these best practices. Best Practices Focus On Trending Topics When it comes to viral content, your topic is KEY. Specifically, you want to create your content around a topic that’s blowing up. That way, you can ride the wave. And the best way to find growing topics? Google Trends. All you need to do is type in the topic you want to write about. If interest in that topic is growing, that’s a good sign. If not, you probably want to go with a different topic. Write Viral Headlines When someone sees your content getting shared on X (formerly Twitter), Facebook, and other social sites, your title is what ultimately pushes them to click. So, while your content itself is super important, your title can make or break how your post does. Headlines with numbers can grab readers’ attention and persuade them to click. So, whenever it makes sense, use a specific number in your title. Like “9 Data-Backed Ways to Improve Your Content” and “14 Chew Toys Your Dog Can’t Destroy.” HubSpot reports that adding brackets to your headlines can also lead to more clicks and shares. Brackets give people a “sneak preview” of your post. 10 Proven Strategies for Boosting Your SEO [Report] The Ultimate Guide to Content Marketing [Free Template Included] How to Master Social Media Advertising [Step-by-Step Tutorial] Top 5 Email Marketing Tips [From Industry Experts] These headlines leverage brackets to offer extra information or highlight value, making them more compelling for readers. Is your post an infographic? A case study? A video? Brackets let people know… before they click. For example, here’s the headline from one of my posts. The text in the brackets lets readers know that my post is an actionable step-by-step guide. Create Captivating Introductions If you want to create a viral post, it’s easy to overlook your introduction. That said, people only read about 28% of a blog post. So, if you want your post to go viral, you need to hook readers fast. This means your intro should be compelling and interesting. Besides that, you might also want to try using short sentences. Dr. John Morkes found that short sentences boosted content readability by 58%. Here’s an example of an intro that uses short sentences. Use Colorful Visuals Images make your content much more compelling. (Especially compared to a blog post that’s 100% text.) Plus, cool-looking visuals will end up in tweets and Facebook posts. Which can help your content go viral. There’s evidence to back this up. Xerox found that colorful visuals made people 80% more likely to read a document. What if colorful images don’t make sense for your post? No worries. Just make sure to include something visual. Venngage found that original infographics and illustrations are the best-performing visuals. But stock photos, graphs, and charts aren’t far behind. Experiment With Long-Form Content In a study of virality, Professor Dr. Jonah Berger found that longer content was 76.8% more likely to go viral compared to short content. There’s no magical length that will make your content go viral. But at least according to this research, longer content can increase your odds. Set a Featured Image Social shares with images get 35% more retweets on X. And Facebook says posts with visuals tend to receive more likes, shares, and comments. This is why a featured Image can help you create viral content. A featured Image is an image that automatically appears when people share your content on Facebook, LinkedIn, and other social media websites. For example, we set this as the featured image for this piece of content. And whenever someone shares it, that image shows up underneath the post. Place Share Buttons Above The Fold A Google study found that elements above the fold are seen by 58% more people than elements that are further down the page. This is why you want to place your social sharing buttons high up on your page. Here’s an example: Publish Emotionally-Charged Content A study published in the Journal of Marketing Research found content that elicits the emotions “awe”, “surprise” or “anger” was 28% more likely to go viral. This applies to text content (like a blog post). But also works if your goal is to create a viral video. The format isn’t super important. The important thing is that your content elicits an emotional response. That’s one of the keys to creating shareable content. Promote To Influencers Sure, you should write content for your target audience. That’s content marketing 101. But don’t forget to mention influential bloggers in your post (and let them know about it). A Columbia University study found that for your content to go viral, influencer shares were ”critical”. That’s because these folks will share your content on social networks like Facebook, X and YouTube, increasing the odds that you go viral. Publish Practical Content Dr. Jonah Berger found that highly-practical articles are 34% more likely to go viral. So, if you don’t want to create controversial or emotionally charged content, consider practical content, like recipes and how-to guides. When done well, practical content has a decent chance of going viral, too. For example, some time ago, we published a guide to writing a blog post. There wasn’t anything super controversial or emotional in the guide. But it was super practical. And all of the actionable tips in our guide helped it rack up over 6,000 shares. Focus On List Posts and Why Posts Are there types of content that get shared more often? Yes. List posts and why posts get more shares than videos, infographics, and how-to posts. The downside is that these content formats don’t get as many backlinks. So they’re great for viral content campaigns but not for SEO. Focus on Content Quality over Virality When it comes down to it, no one can predict if content will go viral. But there are steps you can take to help your articles get more exposure. Like focusing on trending topics and writing knockout headlines. Even more important? Creating high-quality content that aligns with your target audience’s preferences and pain points. And their search intent. Read our Content Writing 101 guide to learn how to create content that resonates with readers. And gets more clicks, shares, and conversions. Learn More The Definitive Guide to Viral Marketing: Learn how to create products, videos, and content that goes viral. We Analyzed 912 Million Blog Posts. Here’s What We Learned About Content Marketing: This study attempts to answer the question, “How do I create viral content?” My Video Went Viral. Here’s Why: A super in-depth case study of how a YouTuber created a video that went viral and racked up 37 million views.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Viral Content"
    },
    {
      "level": "H3",
      "text": "What Is Viral Content?"
    },
    {
      "level": "H3",
      "text": "Why Is Viral Content Important?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Focus On Trending Topics"
    },
    {
      "level": "H4",
      "text": "Write Viral Headlines"
    },
    {
      "level": "H4",
      "text": "Create Captivating Introductions"
    },
    {
      "level": "H4",
      "text": "Use Colorful Visuals"
    },
    {
      "level": "H4",
      "text": "Experiment With Long-Form Content"
    },
    {
      "level": "H4",
      "text": "Set a Featured Image"
    },
    {
      "level": "H4",
      "text": "Place Share Buttons Above The Fold"
    },
    {
      "level": "H4",
      "text": "Publish Emotionally-Charged Content"
    },
    {
      "level": "H4",
      "text": "Promote To Influencers"
    },
    {
      "level": "H4",
      "text": "Publish Practical Content"
    },
    {
      "level": "H4",
      "text": "Focus On List Posts and Why Posts"
    },
    {
      "level": "H3",
      "text": "Focus on Content Quality over Virality"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}