{
  "url": "https://moz.com/blog/category/seo-copywriting/p2",
  "slug": "p2",
  "title": "SEO Copywriting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Martina Mercer March 21, 2016 10 Simple Steps for Creating a Blog Your Readers Will Adore Content Marketing | Blogging | SEO Copywriting The keys to making your blog a success is knowing who'll be reading it and what they desire in the way of content. Read this post By: Nichole Elizabeth DeMeré March 15, 2016 Here’s How to Combine Storytelling and Data to Produce Persuasive Content Content Marketing | Blogging | SEO Copywriting Ever thought about what really sticks out in your audience's minds? Hint: it's not the hard facts alone. Combining data and storytelling can make your brand's content stick out in a meaningful way; Nichole DeMeré shows you how in today's post. Read this post By: Isla McKetta January 27, 2016 Manufacturing Serendipity: How to Create Content that Captivates Your Audience Content Marketing | SEO Copywriting Learn how to turn empathy, surprise, delight, and information into the kind of content your audience will connect with and remember. Read this post By: Nichole Elizabeth DeMeré January 12, 2016 Here’s How Brands Execute Truly Awesome Tactics for Email Marketing Content Marketing | Email Marketing | SEO Copywriting Effective email marketing campaigns begin with attention to detail and empathy for your customers. Read this post By: Martina Mercer October 6, 2015 7 Copywriting Tips That Will Instantly Lower Your Bounce Rates Content Marketing | Conversion Rate Optimization (CRO) | SEO Copywriting One of the simplest ways to lower the bounce rates of your landing pages is to use copy that's snappy, enticing and free of useless words and phrases. Read this post By: Ronell Smith September 30, 2015 Why Meaning Will Ultimately Determine Your Brand's Content Marketing Success Content Marketing | Blogging | SEO Copywriting If your brand is ready to make the next big step in content marketing, adding meaning to the content you create and share is a necessity. Read this post By: Martina Mercer September 11, 2015 How to Write Product Descriptions That Will Make Customers Love Your Brand Content Marketing | SEO Basics | SEO Copywriting Product descriptions are some of the most neglected pieces of content on the web, which is a shame because they are often the first point of contact for ecommerce customers. Read this post By: Alp Mimaroglu September 9, 2015 Seven Simple Tips for Insightful A/B Testing SEO Analytics | SEO Copywriting Marketing is full of cliches, but one that has stood the test of time and still rings true is \"When in doubt, test.\" Are you testing your assumptions? Read this post By: Isla McKetta March 17, 2015 The Art of Concision: How to Effectively Make Your Point in Fewer Words Content Marketing | Blogging | SEO Copywriting Learn how to write fewer words while making a stronger impact on your readers, customers, and decision makers. Read this post By: Ben Austin March 15, 2015 9 Simple Tips For Making An About Us Page That Works For Your Brand Content Marketing | Conversion Rate Optimization (CRO) | SEO Copywriting Your brand's About Us page is prime real estate for prospects looking to do business with the company. Reward visitors for their efforts by showcasing an engaging, insightful page. Read this post By: Gianluca Fiorelli March 12, 2015 Understand and Harness the Power of Archetypes in Marketing Marketing Psychology | Branding | SEO Copywriting Understanding your brand's archetype and narrative mode can embed you deep in the psyche of your customer. Learn how. Read this post By: Isla McKetta February 11, 2015 Death to Wishy-Washy Reports: Simple Edits to Put the Authority Back in Your Writing SEO Reporting | SEO Consulting | SEO Copywriting This is a post about how anyone can write a clearer, more persuasive report. And the lessons contained herein can help you with any form of corporate communication, whether you're writing for a client or your boss. Get ready to sound smarter. Read this post By: Isla McKetta January 27, 2015 For Writers Only: Secrets to Improving Engagement on Your Content Using Word Pictures (and I Don't Mean Wordle) Content Marketing | SEO Copywriting If you aren't thinking about imagery as you're writing, you're missing a huge opportunity to engage readers. Learn how to capture all the magic that word pictures can offer. Read this post By: Isla McKetta December 9, 2014 The Un-Checkbox Approach to Content Marketing Content Marketing | SEO Copywriting Data and insights can be incredibly valuable, but should never be treated as gospel, and the only logic worse than \"because that's how we've always done it\" might just be \"because everyone else is doing it.\" Content is no exception. When was the last time you broke a few rules? Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Copywriting"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Copywriting"
    },
    {
      "level": "H2",
      "text": "10 Simple Steps for Creating a Blog Your Readers Will Adore"
    },
    {
      "level": "H2",
      "text": "Here’s How to Combine Storytelling and Data to Produce Persuasive Content"
    },
    {
      "level": "H2",
      "text": "Manufacturing Serendipity: How to Create Content that Captivates Your Audience"
    },
    {
      "level": "H2",
      "text": "Here’s How Brands Execute Truly Awesome Tactics for Email Marketing"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "7 Copywriting Tips That Will Instantly Lower Your Bounce Rates"
    },
    {
      "level": "H2",
      "text": "Why Meaning Will Ultimately Determine Your Brand's Content Marketing Success"
    },
    {
      "level": "H2",
      "text": "How to Write Product Descriptions That Will Make Customers Love Your Brand"
    },
    {
      "level": "H2",
      "text": "Seven Simple Tips for Insightful A/B Testing"
    },
    {
      "level": "H2",
      "text": "The Art of Concision: How to Effectively Make Your Point in Fewer Words"
    },
    {
      "level": "H2",
      "text": "9 Simple Tips For Making An About Us Page That Works For Your Brand"
    },
    {
      "level": "H2",
      "text": "Understand and Harness the Power of Archetypes in Marketing"
    },
    {
      "level": "H2",
      "text": "Death to Wishy-Washy Reports: Simple Edits to Put the Authority Back in Your Writing"
    },
    {
      "level": "H2",
      "text": "For Writers Only: Secrets to Improving Engagement on Your Content Using Word Pictures (and I Don't Mean Wordle)"
    },
    {
      "level": "H2",
      "text": "The Un-Checkbox Approach to Content Marketing"
    }
  ],
  "author": "Martina Mercer\n          \n            Nichole Elizabeth DeMeré\n          \n            Isla McKetta\n          \n            Nichole Elizabeth DeMeré\n          \n            Martina Mercer\n          \n            Ronell Smith\n          \n            Martina Mercer\n          \n            Alp Mimaroglu\n          \n            Isla McKetta\n          \n            Ben Austin\n          \n            Gianluca Fiorelli\n          \n            Isla McKetta\n          \n            Isla McKetta\n          \n            Isla McKetta"
}