{
  "url": "https://moz.com/blog/category/mobile-seo/p11",
  "slug": "p11",
  "title": "Mobile SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin October 11, 2005 Build Your Own Search Engine Mobile SEO Xan has a great post on how to build your own search engine. It's not nearly as difficult as it sounds and she notes (as Matt Cutts did in his interview by Aaron) that it will quickly make you an on-pag... Read this post By: Rand Fishkin September 15, 2005 Ask Jeeves Does Gift Search Mobile SEO Ask Jeeves noted on their blog today that they've got a new gift search service and it's awesome. It's so much fun to play around with all the different personality types and ages and other demographics to see what they'... Read this post By: Rand Fishkin September 6, 2005 Digging up Dirty DNS Deeds Mobile SEO SamSpade.org has a fantastic collection of tools for digging up everything from falsified IP addresses to browsing the web anonymously to checking traceroutes, running whois and reverse lookups and much more. The site's super-clean, minimalis... Read this post By: Rand Fishkin September 2, 2005 A Little Bit Naughty Mobile SEO Google's SafeSearch feature doesnt' strongly affect most of us in the non-adult industry, but I came across a fun little tool yesterday that I thought was worth mentioning. Monzy's UnSafe Search is a play on Google's adult filtering and conducts a search at Google with SafeSearch on and off, then filters out those results that... Read this post By: Rand Fishkin September 2, 2005 Librarian's Directory Mobile SEO The two groups most commonly associated by search engines as being interested in things like link data and information retrieval technology, outside of their own engineers, are librarians & SEOs. The first group are typically lauded while the second receives both internal and external... Read this post By: Rand Fishkin August 17, 2005 SearchLore Mobile SEO Came across an interesting site today called SearchLore. There's an older but excellent article there on the subject of deep searching and deep indexing - it covers a wide variety of issues and has a great 3D mod... Read this post By: Rand Fishkin August 2, 2005 Dogpile Comparison Tool Mobile SEO Hot tip from Barry Welford over at cre8asite forums. He points to Dogpile's new comparison tool that's designed to help users see why searching at Dogpile c... Read this post By: Rand Fishkin July 28, 2005 Map Wars - Google Maps vs. MSN Virtual Earth Mobile SEO The map wars is on, go visit Ryan's map fight site to determine for yourself which map is better. On my short visit, Google clearly has the usability edge, while MSN is far better at finding the right location, even... Read this post By: Rand Fishkin May 27, 2005 Live Q+A with Jim Lanzone of Ask Jeeves at Cre8asite Mobile SEO Jim Lanzone, the senior vice president of search properties for Ask Jeeves/Teoma, whom Mike Grehan previously interviewed with Apostolos Gerasoulis, is giving a live ... Read this post By: Rand Fishkin March 21, 2005 Clusterizer & iBoogie Web Search Mobile SEO These guys are ripe for acquisition. Clusterizer, who operates the technology behind the iBoogie clustering meta-search engine, has a terrific description of the clustering process an... Read this post By: Rand Fishkin February 24, 2005 Interview with Ask Jeeves Mobile SEO Mike Grehan, one of the most diligent and intuitive people in the search marketing industry, has conducted a fantastic interview with some of the top technology & business people at the Ask Jeeves engin... Read this post By: Rand Fishkin February 5, 2005 Using Cluster-Based Engines to Discover Keywords & Themes Mobile SEO A list of clustering search engines can be used to help understand how the search engines are currently perceiving the links & topical nature of you... Read this post By: Rand Fishkin February 2, 2005 Media Content & Web Search Mobile SEO As Google, Yahoo! & the major engines dive into rich media and alternative data sources (news, video, images, etc.), it's important for SEOs to keep on top of the changes and how best to optimize for them. Image searches are already a great source of traffic for sites t... Read this post By: Rand Fishkin February 1, 2005 Visual Page Segmentation & MSN Mobile SEO An incredible research paper from Microsoft highlights the advancements in search engine link detection technology. The paper, VIPS: a Vision-based Page Segmentation Algor... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Mobile SEO"
    },
    {
      "level": "H2",
      "text": "Build Your Own Search Engine"
    },
    {
      "level": "H2",
      "text": "Ask Jeeves Does Gift Search"
    },
    {
      "level": "H2",
      "text": "Digging up Dirty DNS Deeds"
    },
    {
      "level": "H2",
      "text": "A Little Bit Naughty"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Librarian's Directory"
    },
    {
      "level": "H2",
      "text": "SearchLore"
    },
    {
      "level": "H2",
      "text": "Dogpile Comparison Tool"
    },
    {
      "level": "H2",
      "text": "Map Wars - Google Maps vs. MSN Virtual Earth"
    },
    {
      "level": "H2",
      "text": "Live Q+A with Jim Lanzone of Ask Jeeves at Cre8asite"
    },
    {
      "level": "H2",
      "text": "Clusterizer & iBoogie Web Search"
    },
    {
      "level": "H2",
      "text": "Interview with Ask Jeeves"
    },
    {
      "level": "H2",
      "text": "Using Cluster-Based Engines to Discover Keywords & Themes"
    },
    {
      "level": "H2",
      "text": "Media Content & Web Search"
    },
    {
      "level": "H2",
      "text": "Visual Page Segmentation & MSN"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}