{
  "url": "https://moz.com/blog/category/mobile-seo/p3",
  "slug": "p3",
  "title": "Mobile SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Roy Hinkis December 21, 2015 Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps Mobile SEO When Google announced last month that app-only content would now stream in the SERPs via the cloud, regardless of whether that app is installed on your phone, they introduced a real game-changer into the equation. Although this update is still in beta, we should begin to think about what it could mean. Read this post By: Will Critchlow December 18, 2015 What You Need to Know About Accelerated Mobile Pages (AMPs) Mobile SEO | Whiteboard Friday You may have heard the term \"AMPs\" thrown around lately. What exactly are Accelerated Mobile Pages, what do they mean for search, and how can you prepare for it all? In this week's ​British​ Whiteboard Friday, Will Critchlow and Tom Anthony of Distilled lay out all the important details. Read this post By: Rand Fishkin December 4, 2015 Mobile Web vs Mobile Apps: Where Should You Invest Your Marketing? Mobile SEO | Marketing Industry | Whiteboard Friday Mobile's been a hot topic for a while now. We know it's not something to be ignored, but when it comes to different mobile mediums, it can be tricky to determine where to focus your efforts. In this week's Whiteboard Friday, Rand goes over the differences between marketing via mobile apps and mobile web, examines some criteria that can help guide your decision, and speculates about the future of the mobile world in general. Read this post By: Ran Avrahamy November 10, 2015 Here’s How to Break down Reporting Options in Mobile Analytics SEO Analytics | SEO Tools | Mobile SEO Do you know what your reporting options are when it comes to mobile analytics? Read this post By: Bridget Randolph October 26, 2015 How to Get Your App Content Indexed by Google Search Engines | Mobile SEO While the idea of app indexation isn’t new, it's an area of rapid innovation—and the process for getting your apps indexed by Google has recently been simplified. Bridget Randolph provides a brief overview of that process and gives us an update to the app indexation info already available. Read this post By: Alex Walz May 27, 2015 Deconstructing the App Store Rankings Formula with a Little Mad Science Search Engines | Mobile SEO This deep-dive look at the Apple App Store and Google Play highlights some interesting nuggets any app developer would find useful, in particular the information surrounding rankings. Read this post By: Adam Whittles April 23, 2015 How to Ace the Google Mobile-Friendly Test & Score 100% Advanced SEO | SEO Tools | Mobile SEO Use the results of our study to help improve your site's mobile friendliness score. Read this post By: Dr. Peter J. Meyers April 22, 2015 7 Days After Mobilegeddon: How Far Did the Sky Fall? Search Engines | Mobile SEO After the dreaded Mobilegeddon update from Google, what terrors have befallen the SERPs? Dr. Pete will regularly update this post with the latest from the Mobile Mozcast. Read this post By: Billy Hoffman April 13, 2015 How to Keep your Site Fast for Mobile-Friendly Mobile SEO With the mad rush to optimize mobile sites prior to April 21st, it can be very easy to sacrifice performance in the process. Our friends at Zoompf are back to help you make sure your site loads quickly over a mobile connection. Read this post By: Cindy Krum April 6, 2015 9 Things You Need to Know About Google's Mobile-Friendly Update Content Marketing | Search Engines | Mobile SEO My colleague Emily Grossman and I wanted to cut through the noise and bring online marketers a clearer picture of what's in store later this month. In this post, you'll find our answers to nine key questions about the update. Read this post By: Justin Briggs February 17, 2015 Everything You Need to Know About Mobile App Search Technical SEO | Advanced SEO | Mobile SEO Mobile isn't the future. It's the present. Learn about new and emerging mobile app search opportunities, from mobile search results to app indexation. The growth of mobile search is transforming how we define technical SEO, moving beyond front-end and back-end optimization of websites into the realm of structured data and application development. Read this post By: Will Critchlow September 29, 2014 Why You Shouldn't Have a Mobile Marketing Strategy Mobile SEO We all need to move beyond thinking about mobile marketing strategies. This post shows you why and offers actionable tactics that'll keep your team on top of this ever-changing area of marketing. Read this post By: Dr. Peter J. Meyers July 8, 2014 Why Mobile Matters - Now Mobile SEO We've been hearing that mobile will change everything for years. This post is about why I think that time has finally come, and why marketers need to pay attention. Read this post By: David Mihm July 2, 2014 Stop Worrying About the New Google Maps; These URL Parameters Are Gold Local SEO | Competitive Research | Mobile SEO Somewhat inspired by a Pete Wailes YouMoz post from many years ago, I set out last week to explore Google Maps with a fresh set of eyes and an open mind to see what I could discover about how it renders local business results. Read on, for what I think I found. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Mobile SEO"
    },
    {
      "level": "H2",
      "text": "Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps"
    },
    {
      "level": "H2",
      "text": "What You Need to Know About Accelerated Mobile Pages (AMPs)"
    },
    {
      "level": "H2",
      "text": "Mobile Web vs Mobile Apps: Where Should You Invest Your Marketing?"
    },
    {
      "level": "H2",
      "text": "Here’s How to Break down Reporting Options in Mobile Analytics"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Get Your App Content Indexed by Google"
    },
    {
      "level": "H2",
      "text": "Deconstructing the App Store Rankings Formula with a Little Mad Science"
    },
    {
      "level": "H2",
      "text": "How to Ace the Google Mobile-Friendly Test & Score 100%"
    },
    {
      "level": "H2",
      "text": "7 Days After Mobilegeddon: How Far Did the Sky Fall?"
    },
    {
      "level": "H2",
      "text": "How to Keep your Site Fast for Mobile-Friendly"
    },
    {
      "level": "H2",
      "text": "9 Things You Need to Know About Google's Mobile-Friendly Update"
    },
    {
      "level": "H2",
      "text": "Everything You Need to Know About Mobile App Search"
    },
    {
      "level": "H2",
      "text": "Why You Shouldn't Have a Mobile Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Why Mobile Matters - Now"
    },
    {
      "level": "H2",
      "text": "Stop Worrying About the New Google Maps; These URL Parameters Are Gold"
    }
  ],
  "author": "Roy Hinkis\n          \n            Will Critchlow\n          \n            Rand Fishkin\n          \n            Ran Avrahamy\n          \n            Bridget Randolph\n          \n            Alex Walz\n          \n            Adam Whittles\n          \n            Dr. Peter J. Meyers\n          \n            Billy Hoffman\n          \n            Cindy Krum\n          \n            Justin Briggs\n          \n            Will Critchlow\n          \n            Dr. Peter J. Meyers\n          \n            David Mihm"
}