{
  "url": "https://moz.com/blog/category/mobile-seo/p4",
  "slug": "p4",
  "title": "Mobile SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Hugh Kimura March 5, 2014 The Apple App Store SEO Keyword Selection Process In A Nutshell Mobile SEO This post will concentrate only on the keyword selection process of App Store Optimization because it is the most measurable. Read this post By: Jesse James Woods October 29, 2013 Responsive Design is Hot Right Now, But for M-Commerce Too? Mobile SEO One look at Google Trends and you can quickly see that responsive design is super-hot right now. It has actually become an effective solution for many websites to serve a mobile friendly experience to their users. It was even recommended by Google this summer as the optimal way to serve a website to mobile users. But what about responsive design for mobile ecommerce? When we talk about taking all of the product pages and payment checkout processes of an online shop and displaying them in a sales-maximizing mobile shopping experience, is responsive design the best solution? And if so, how can you implement responsive design in the best possible way for your online shop? Read this post By: Greg Shuey October 15, 2013 Ten Crucial Steps In Creating & Executing A Mobile App Marketing Campaign Mobile SEO Contrary to popular belief, developing and executing successful marketing campaigns for a mobile application begins long before you put your idea into development. Since leaving SEO.com in February, I've become quite infatuated with mobile app development and creating demand and downloads for apps. The problem is, many apps are created with \"just an idea\" so they aren't nearly as successful as they could be. So in today's post, I want to discuss the ten steps of creating and executing a killer mobile app marketing campaign. Read this post By: Marketing Team July 24, 2013 The Definitive Guide to Google's New Mobile SEO Rules Mobile SEO In this definitive guide to Google’s new mobile SEO rules, I'll highlight the key ways you can optimize your website to take advantage of these recent changes. Read this post By: Kristina Kledzik July 22, 2013 The SEO's Guide to Building a Great Mobile Site Mobile SEO 15% of internet usage is done on a mobile device, and that's expected to climb to 20% by the end of 2013. Review the facts to build the best mobile site you can, whether it's a separate mobile site, a responsive site, or a combination of the two. Read this post By: Robi Ganguly July 18, 2013 Mobile App Marketing, App Retention, and Building Real Customer Relationships Mobile SEO Your customers are using mobile devices more than ever. Someone who downloads your app, though, isn't much help if they uninstall it shortly thereafter. It's time for a focus on mobile retention. Read this post By: Ian Sefferman June 20, 2013 App Store SEO: The Inbound Marketer's Guide to Mobile Mobile SEO As the app ecosystem grows, many marketers are turning their sights towards mobile app marketing. Today's post provides a high-level view of App Store Optimization, and gives tips on how to break into the rapidly expanding world of apps. Read this post By: Aleyda Solis May 21, 2013 The 3 Steps for Success in a Multi-device Search World Mobile SEO We live in a multi-device world, and if you're still focused on improving your visibility, traffic, and conversions solely for desktop users, you're losing a great opportunity. Follow these steps to close the gap and connect with your audience, no matter what device they're searching from. Read this post By: Larry Kim March 26, 2013 5 Mobile SEO Tips from the Google AdWords Team Mobile SEO In my article today, I’d like to summarize for you five key mobile SEO trends to look out for, based on all of the exciting changes that are happening in the world of paid mobile search. Read this post By: Aleyda Solis February 20, 2013 Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity Mobile SEO How's your mobile SEO? In today's post, Aleyda Solis offers a supplement to her Mozinar and answers your questions on the mobile SEO process. Read this post By: Bridget Randolph February 11, 2013 When Responsive Design is Not an Option: a Checklist for Optimizing Your Mobile Site Mobile SEO We've been hearing a lot recently about responsive design as the recommended approach for companies who want to become mobile-friendly. But what if you aren't able to implement a responsive design, or what if it's just not the right approach for your business model? Today's post shows you how to optimize a \"different URL\" mobile site as an alternative. Read this post By: Robi Ganguly January 29, 2013 Top Three Inbound Marketing Strategies for Mobile Apps Mobile SEO Mobile is a term we hear a lot about these days, but, as marketers, how can we tell what strategies work when consumers are looking for (and ultimately finding) information via mobile? In today's post, Robi Ganguly expands on his recent Mozinar and shares his tips on inbound marketing in the wonderful world of mobile apps. Read this post By: Robin Campbell December 6, 2012 App Store SEO Not Enough: Why Mobile App Publishers Need Inbound Marketing Mobile SEO The benefits of inbound marketing for SEO are clear: 90% of web traffic is driven by search engines, content creation and social media - it’s almost all organic. If you want to build a lasting web business it’s obvious you can’t ignore it. After all, you can see the difference search engines make in your own visitor logs. Read this post By: Shannon Bauman August 27, 2012 Mobile Conversion Rates: From Drab to Fab Mobile SEO Mobile e-commerce isn't quite there yet, but you can help your conversions. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Mobile SEO"
    },
    {
      "level": "H2",
      "text": "The Apple App Store SEO Keyword Selection Process In A Nutshell"
    },
    {
      "level": "H2",
      "text": "Responsive Design is Hot Right Now, But for M-Commerce Too?"
    },
    {
      "level": "H2",
      "text": "Ten Crucial Steps In Creating & Executing A Mobile App Marketing Campaign"
    },
    {
      "level": "H2",
      "text": "The Definitive Guide to Google's New Mobile SEO Rules"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The SEO's Guide to Building a Great Mobile Site"
    },
    {
      "level": "H2",
      "text": "Mobile App Marketing, App Retention, and Building Real Customer Relationships"
    },
    {
      "level": "H2",
      "text": "App Store SEO: The Inbound Marketer's Guide to Mobile"
    },
    {
      "level": "H2",
      "text": "The 3 Steps for Success in a Multi-device Search World"
    },
    {
      "level": "H2",
      "text": "5 Mobile SEO Tips from the Google AdWords Team"
    },
    {
      "level": "H2",
      "text": "Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity"
    },
    {
      "level": "H2",
      "text": "When Responsive Design is Not an Option: a Checklist for Optimizing Your Mobile Site"
    },
    {
      "level": "H2",
      "text": "Top Three Inbound Marketing Strategies for Mobile Apps"
    },
    {
      "level": "H2",
      "text": "App Store SEO Not Enough: Why Mobile App Publishers Need Inbound Marketing"
    },
    {
      "level": "H2",
      "text": "Mobile Conversion Rates: From Drab to Fab"
    }
  ],
  "author": "Hugh Kimura\n          \n            Jesse James Woods\n          \n            Greg Shuey\n          \n            Marketing Team\n          \n            Kristina Kledzik\n          \n            Robi Ganguly\n          \n            Ian Sefferman\n          \n            Aleyda Solis\n          \n            Larry Kim\n          \n            Aleyda Solis\n          \n            Bridget Randolph\n          \n            Robi Ganguly\n          \n            Robin Campbell\n          \n            Shannon Bauman"
}