{
  "url": "https://backlinko.com/hub/youtube/community",
  "slug": "community",
  "title": "YouTube Community Tab",
  "description": "A complete guide to YouTube’s new Community Tab.",
  "content": "YouTube Community TabWritten by Brian DeanLast updated Jan. 31, 2019What Is the Community Tab? The YouTube Community Tab is a feature designed to help creators engage with their audience outside of the videos that they upload to their channel. Types of Community Posts include polls, text-based posts and images. Best Practices Use Polls Polls are one of the most popular types of community posts. And for good reason: polls are an easy way to get your community more involved with your channel. For example, lots of YouTubers use polls to ask their subscribers what types of content they want to see next: Polls don’t necessarily have to be about your channel. You can also use polls as a fun way to start a discussion or to give your fans a voice on a topic related to your channel. Here’s a great example: Get Informal For many creators, the only time viewers see them is in front of the camera (usually accompanied by lights, makeup, and a carefully-selected outfit). Community Posts allow you to show a more informal side of your life. For example, Rudy Mancuso uses Community Posts to give viewers a sneak peak into “real life” outside of YouTube: Promotion The Community Tab is a great place to promote older videos, merch or products that you sell. While you do want to balance value with promotion, promoting things in community posts can be much easier (and more effective) than doing so in a video. For example, John Sonmez regularly shares his old videos in his Community posts: And Sean from ThinkMedia uses posts to promote his webinars and online courses: Pre-Promotion Before the Community Tab, there was no easy way to get your fans excited about an upcoming video. In fact, many creators would build anticipation for their videos on other platforms, like Twitter and Facebook. Thanks to the Community Tab, you can pre-promote your videos on YouTube. And when it comes to pre-promotion, you have two options: Use a Poll: Ask viewers what they want to learn about or see in your next video. Evan Carmichael has mastered this technique: Use a GIF of Behind-the-Scenes Shot: Give your fans a sneak preview of your video using a clip as an GIF or a still shot of the video being filmed: Exclusive Content Like any platform, it’s important to give people a reason to follow your updates in your Community Tab. If you simply repost content from Instagram or Twitter, people aren’t going to have a reason to check out what’s going on in your Community Tab. Do your best to offer exclusive content that your fans can’t find anywhere else. For example, Lewis Howes posts images that you can only find on his Community Tab: Shout Outs Use Community Posts to show appreciation to people that support your channel (either financially through something like Patreon or people that are super active members of your community): Cross-Promotion and Collabs You can use the Community Tab to send your fans to content on other channels that you find interesting. Also, if you do a collab with another channel, a Community Post is a great way to let your fans know about it:",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "YouTube Community Tab"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}