{
  "url": "https://backlinko.com/hub/youtube/crowdfunding",
  "slug": "crowdfunding",
  "title": "Crowdfunding on YouTube",
  "description": "A thorough resource that shows you exactly how to find your channel using Crowdfunding platforms like Patreon and the new YouTube Sponsor button.",
  "content": "CrowdfundingWritten by Brian DeanLast updated Jan. 31, 2019While most YouTubers support themselves with ads and products, others go the crowdfunding route. Crowdfunding on YouTube is great because, unlike ads, you’re giving your audience more of what they want: content and engagement with you, the creator. And with new crowdfunding technology coming to YouTube, this approach to monetization is likely to become even more popular in the coming years. Ways to CrowdFund Your YouTube Channel Patreon Patreon is a crowdfunding website designed to serve “artists and creatives”. Unlike sites like Kickstarter and IndiGoGo, that offer one-off funding for projects, Patreon is designed to help fund creators on a regular (monthly) basis. And because ongoing support is in-line with the consistent content that YouTubers produce, Patreon is massively popular in the YouTube community. In addition to giving you a platform that makes it easy for your audience to support what you’re already doing, Patreon also lets you offer rewards in exchange for their support. The types of rewards you offer your supporters are limited only by your imagination. That said, the most common types of rewards are: Early Access: Here’s where you let your backers see your content before anyone else. Most YouTubers publish their early access video as unlisted… and then share it with their early access folks. That way, the views you get on that video still count when the video goes public. Behind-The-Scenes Access: This reward gives your fans a peek behind the curtain. You can either share an entire video that shows the process behind your videos, or share pictures of you doing your thing. Shout Outs: Shout outs are an easy way to recognize your loyal backers. The big upside of this reward is that it’s super-duper easy and requires very little additional work. Exclusive Content: This can be just about anything, from bonus content, an exclusive video series, a podcast… or a blog that only backers can access. Merch: Some YouTubers offer Merch to people that support them. While Merch can be valuable, it should be mixed in with other types of recurring rewards to match people’s ongoing support: Live Events: Lots of YouTubers offer their Patreon patrons something that’s hard to get on YouTube: interaction with the creator. This can be in the form of a Q&A session or a more informal hangout. YouTube Sponsor Button YouTube recently launched their own Crowdfunding feature called “Sponsorships”. Sponsorships work just like Patreon: your fans provide regular support in exchange for rewards (YouTube calls them “Perks”). The big upside of Sponsorships is that all the perks happen on YouTube. So there’s no need to visit an external website to get access to exclusive content or to join a live hangout. Also, it converts a lot better than a Patreon link as the Sponsorship button appears prominently underneath each video: Types of perks you can provide to your sponsors include: Custom Badge: This is a badge that you create for your supporters. Whenever a sponsor comments on one of your videos, they’ll have a sweet badge next to their username: Custom Emoji: Emojis just for your channel that only supporters can use for live chat. Exclusive Live Streams: A live stream video that only goes out to sponsors. Not only is this great exclusive content, but it gives your fans a chance to interact with you. Exclusive Community Tab Content: You can allows supporters to see exclusive content in your Community Tab. Here are some tips for getting people to sponsor your channel: Announce It: YouTube Sponsorships is a brand new feature. So it’s important to take the time to explain what it is, how it works and how fans can support you using this feature. In fact, YouTube states that: “We’ve seen that creators who make announcement videos convert more of their subscribers to sponsors than those who don’t.” Here’s a great example: Give Extra: While you want to reward people that hook you up with support, you don’t want to alienate existing fans. So do your best to provide extra content for backers vs. creating paywall to access the content you already put out. For example, Simon and Martina added valuable perks like exclusive tips and blog posts… while keeping their regular publishing schedule on-track. Review the Guidelines: Even though YouTube sponsorships are new, they’ve already laid out a list of guidelines of what types of perks aren’t allowed (like contests and anything that would otherwise violate YouTube’s Community Guidelines). Crowdfund Projects You can also tap into your fanbase to fund a one-off project. This can be a book, product, movie, webseries, podcast, app… anything that you’ve wanted to produce and you think your fans will support. For example, Cinemassacre (aka the Angry Video Game Nerd) is one of the most popular gaming channels on YouTube. A few years back, the channel’s creator (James Rolfe) wanted to make a movie based on the Angry Video Game Nerd Character. So he started a funding campaign on IndieGoGo. This campaign raised $325,327 (more than 4x the goal). Learn More Crowdfunding: Lesson from the YouTube Creator academy on crowdfunding your YouTube channel.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Crowdfunding"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}