{
  "url": "https://backlinko.com/hub/youtube/trailer",
  "slug": "trailer",
  "title": "Channel Trailer",
  "description": "A complete guide to creating a Channel Trailer that converts viewers into loyal subscribers (plus: a ton of real-life examples and case studies).",
  "content": "Channel TrailerWritten by Brian DeanLast updated Sep. 06, 2024What Is a Channel Trailer? A Channel Trailer is a video designed to help people quickly learn about a YouTube channel. When enabled, this trailer is automatically displayed at the top of a YouTube Channel Page for non-subscribed visitors. Why Is a Channel Trailer Important? Your Channel Trailer can be a powerful way to turn channel page visitors into subscribers. After someone sees your Channel Art and Channel Icon, your Channel Trailer is typically the next thing that catches their eye. If executed correctly, trailer viewers will learn more about your channel and subscribe. Best Practices Aim For 30-90 Seconds While there’s no perfect length for a trailer, YouTube recommends that you “keep it short”. And many YouTube marketing experts recommend that you limit the length of your trailer to 30-60 seconds. That’s not a lot of time. But if you script out your Channel Trailer, 30-90 seconds gives you plenty of time to include everything a trailer needs to convert viewers into subs: Quick intro of you and your channel Overview of the types of videos you publish Highlight reel of your video content Posting schedule (optional) Call-to-action to subscribe For example the Fitness Blender channel hits on all of these elements in their super crisp Channel Trailer. Use The “T.O.P.” Formula The “T.O.P” Formula is an easy and effective way to structure your Channel Trailer content. Here’s how it works: T=Target Audience Start your Trailer off by letting people know who your channel is for. For example, is your channel’s target audience: Scuba divers? Tech junkies? Hikers? Bloggers? Let them know right off the bat. That way, your audience will know they’ve found the channel for them within the first 5-10 seconds. O=Origin Story Now that your audience knows your Channel is designed to help them, it’s time to cover your origin story. Here’s where you quickly tell the story of why you created your channel. This personal story helps your channel stand out from the hundreds (or even thousands) of other YouTube channels on your topic. P=Pitch Finally, ask viewers to subscribe to your channel. You can phrase this pitch however you’d like (it should match your channel’s style and personality). But some common subscribe pitches include: “If that sounds good, make sure to subscribe to my channel right now” “Make sure to hit that subscribe button” “So go ahead and subscribe. Or don’t” “And now it’s time to subscribe!” For example, Sean and Benji from Video Influencers follow the T.O.P. formula to a “T”: Show a Highlight Reel As YouTube states: “Show, don’t tell”. This is great advice. Obviously, you should let people know who your channel helps and why you created it. But don’t forget to also show viewers what to expect from your video content. If you’ve already published a few videos on your channel, you’re in great shape. Simply include a highlight reel of your best clips in your Channel Trailer. Pro Tip: Highlights are perfect to show as b-rolls while you talk about your channel. For example, Gemma Stafford features plenty of shots from her other videos in her trailer. Optimize Video Title and Description Your trailer’s Title and description appear next to your trailer on your Channel Page: So it’s important that your title and description support the message in your trailer. In other words, you want to avoid a generic-sounding title like: “Channel Trailer 2018”. Instead, make a trailer title that’s compelling, like: “Welcome to…” or “Why You Should Subscribe to…”. For your trailer’s video description, briefly highlight: Your tagline or positioning What types of videos you produce Publishing schedule Subscribe call-to-action For example, this trailer from iSURFTRIBE uses a title and description that matches the style and messaging in the trailer itself. Tips and Advanced Strategies Go “Trailerless”: Some YouTubers ditch the traditional trailer. Instead, they use one of their best videos as a Channel Trailer. Specifically, they use a video that converts a large amount of viewers into subscribers. For example, the Good Financial Cents channel uses a popular (and high-converting) video as their trailer: Use a Script (or Outline): Even if you don’t usually plan out your videos, consider using a script or outline for your trailer. You only have about a minute to cover a lot of material. And those “umms” and “ahhh” ad up fast. A script helps make sure you hit your key points in the shortest amount of time possible. Represent: You want your trailer to represent the videos you create. Even though the format may be different than what you’re used to, do your best to retain the look, feel and personality of your videos in your trailer. Assume Nothing: It’s important to assume that the viewer doesn’t know much about you or your channel yet. In fact, many of the people that check out your trailer have only seen one or two of your videos. So don’t be afraid to introduce yourself and describe exactly what makes your channel unique. Add an End Screen: YouTube will automatically add a subscribe button on-screen when your trailer ends: But you may also want to add a 10-20 second end screen at the end of your trailer (just like you would at the end of a normal video). This gives your viewers another chance to subscribe. Learn More Create a channel trailer for new viewers: The step-by-step process to enable and add a trailer to your YouTube Channel.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Channel Trailer"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}