{
  "url": "https://backlinko.com/hub/youtube/watch-time",
  "slug": "watch-time",
  "title": "YouTube Watch Time: Strategies for Increasing Viewer Hours",
  "description": "Watch Time is probably YouTube’s #1 ranking factor. But how do you optimize for it? This guide has everything you need to know.",
  "content": "Watch TimeWritten by Brian DeanLast updated Apr. 12, 2024What Is Watch Time? Watch time is the total accumulated amount of time people have spent watching your video on YouTube. YouTube has confirmed that Watch Time is an important part of their search and discovery algorithm. It’s also important to point out that Watch Time is different than Audience Retention. Audience Retention measures the percentage of video that people watch. Watch Time looks at the total amount of accumulated minutes that people have spent watching your video since you first published it: Why Is Watch Time Important? YouTube has gone on the record several times to let creators know that they prefer to rank and promote videos with lots of accumulated Watch Time: “The longer you can keep people watching on YouTube because of your content, the more your content may get surfaced.” And the data supports these statements from YouTube. An industry study by Justin Briggs found a strong correlation between Watch Time and rankings in YouTube search: Considering that Watch Time plays such a key role in video optimization, it pays to maximize your videos’ Watch Time. Best Practices Increase Audience Retention As it turns out, the same strategies that boost Audience Retention will also increase your Watch Time. (After all: If someone stops watching after 5 seconds, it’s not going to do your Audience Retention or Watch Time any favors). Here are some of the most effective ways to maximize Audience Retention: Nail The First 15 Seconds: Most YouTube viewers judge a video based on the first 15 seconds of content. So it’s important to hook viewers as soon as they start watching. Mix Things Up: Viewers hate static videos. Make sure to change camera angles, visual styles, music…anything that keeps your video fresh and interesting. Plan, Script and Outline: Planning and scripting your videos in advance usually leads to a more polished finished product. For example, here’s a video that puts these three techniques into practice: Create Longer Videos Want an easy way to increase Watch Time? Create longer videos. Here’s why longer videos are great for maximizing Watch Time: Imagine you create two videos: Video A and Video B. Video A is 6 minutes. And Video B is 12 minutes. And let’s say that your Audience Retention for both of these videos is exactly the same: 50%. Let’s also say that 1,000 people watch each of your videos. The Watch Time for Video A would be 3,000 Minutes. And the Watch Time for video B? 6,000 minutes. And because Video B has 2x the watch time of Video A, it’s more likely to rank in YouTube Search (and get promoted on YouTube’s homepage and in the Suggested Video sidebar). This isn’t just a theory. A recent YouTube ranking factors study found that longer videos (>15 minutes) outperformed shorter videos in YouTube search: For example, if you do a search in YouTube for “SEO Tutorial”, you’ll notice that the top 3 results are all at least 10 minutes (and some are over 30 minutes): Get More Subscribers Creating long, engaging videos can help you get more Watch Time on your videos. That said, to really maximize Watch Time, you need to get lots of views on your videos. And the best way to do that? Build up a loyal base of channel subscribers. That way, whenever you publish a new video, you’ll have a group of thousands (or even millions) of people ready to watch it. (And because subscribers are primed to enjoy your content, they’re much more likely to watch all the way to the end). Promote Your Videos If you don’t have a ton of subscribers yet, no worries. You can still generate views (and Watch Time) by sending people off of YouTube to your video. In other words, you can promote your video to your existing network of Facebook fans, Twitter followers or LinkedIn connections. For example, Melissa from Clean My Space always promotes her videos on Twitter: And note how she goes the extra mile to really sell her video content. Most people would just add the video title and link to their tweet. But Melissa includes a quote from the video… and even throws in a few emojis and hashtags. That way, more people will click on her link and watch her video. Double Down On What Works It’s inevitable: certain videos on your channel will have significantly more Watch Time than others. And if you can scale what works, you can create Watch Time winners on a consistent basis. Here’s how to do it: First, go to your YouTube Studio and click on “Interest Viewers” → “Top Videos”: This report shows you the videos on your channel with the highest Watch Time. Then, note what your top 3-5 videos have in common in terms of: Video length Title and thumbnail SEO Format Style Visuals Target audience This takes a lot of the guesswork out of creating successful YouTube videos. You already know what works for your audience. Then, it’s simply a matter of doing more of those things in future videos. Increase Session Watch Time So far we’ve focused on the Watch Time for an individual video (which is a super important ranking signal). That said, there’s another important part of Watch Time we need to cover: Session Watch Time. Session Watch Time is the amount of time someone spends on YouTube during a single session. Obviously, YouTube loves videos that keep people on YouTube (because they make more money from ads). And YouTube has confirmed that videos that lead to a longer Session Time can increase that video’s visibility on the platform: “Your channel also gets a boost when people watch anything anywhere in YouTube after watching your content. …and when you make content that makes people watch more from your channel, then you’re helping us out.” For example, if people tend to leave YouTube after watching one your videos, that video is going to get buried: But if your video leads to people spending more time on YouTube, they’re going to make sure more people see your video. Here are some strategies you can use to increase your Session Time: Use Playlists: Playlists essentially increase your Session Time automatically. That’s because playlists automatically play all the videos in that playlist. There’s no need for a user to click on anything or make a decision on what to watch next. Use Cards: You can add cards to videos that funnel people to your other videos. This is especially powerful if you add cards right where viewers tend to drop off. That way, you turn a lost viewer into one that increases your Session Time. Add Video Elements to Your End Screens: This makes it easy for people to easily find another related video from your channel: Tips and Advanced Strategies: Use Consistent, Branded Thumbnails: It’s important that videos from your channel are easy to spot. And the best way to do that? Branded Thumbnails. For example, take a look at these thumbnails: Even though each thumbnail is unique, they all have a consistent look and feel. And you want to do the same thing with your thumbnails. That way, whenever one of your videos shows up on YouTube (whether in the Suggested Video sidebar or the YouTube homepage), users will know that’s a video from your channel. Link to Playlists From Cards and End Screens: As you know, playlists can lead to a serious boost in Session Watch Time. Unfortunately, many creators only link to playlists on their channel page. To get even more people watching your playlists, promote them in Cards and your End Screen. Here’s an example: Link to Videos In Comments: The next time someone asks you a question in the comments section of your video, link to your video as an answer. Not only will that person likely watch your entire video (after all, it answers their burning question), but other people will see and click on that link too: Learn More Watch Time Report: YouTube support page that goes into the nitty gritty of the YouTube Analytics Watch Time Report. How to Increase Watch Time on YouTube — 3 Tips: Helpful video on how Watch Time (and Session Watch Time) works, including tips on increasing both.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Watch Time"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}