{
  "url": "https://backlinko.com/hub/youtube/watermark",
  "slug": "watermark",
  "title": "YouTube Watermark: Best Practices for Channel Branding",
  "description": "How to make a Branding Watermark that turns viewers into subscribers (includes a ton of real-life examples).",
  "content": "Branding WatermarkWritten by Brian DeanLast updated Sep. 11, 2024What Is a Branding Watermark? A YouTube Branding Watermark is a feature that allows creators to add a small, transparent logo or image to all videos on their channel. This watermark appears on top of the video content and, when clicked, allows viewers to subscribe to the channel directly from within the video. While subtle, this powerful tool is important in brand visibility and channel growth on the platform. Best Practices Make it Visible YouTube recommends that you “use a transparent background rather than a solid one”. While a transparent video watermark is slightly less distracting for viewers, it’s also not going to convert very well. For example: Sure, that watermark isn’t distracting. But it’s also difficult to see. And if viewers don’t see your watermark, they’re not going to interact with it. On the other hand, take a look at this watermark from Evan Carmichael’s channel: That’s one watermark you’re not going to miss. Of course, the choice between a solid or transparent watermark is ultimately up to you. If you’re concerned about distracting viewers with your Branding Watermark, go with a transparent image. But if you want to maximize conversions, choose a solid watermark that stands out. Choose an Image When it comes to choosing an image for your watermark, you have two main options: Channel Logo or Icon Many channels use their logo (or a variation of it) as their branded watermark. The upside to this approach is that it reinforces your brand. That’s because, every time someone watches one of your videos, they’ll see that logo on the bottom of the screen. Here’s an example: The downside is that many YouTube viewers don’t know that they can click on your Branding Watermark. That’s why some YouTubers use a watermark image that looks like a YouTube subscribe button, like this: Subscribe Button If your #1 goal with your watermark is to get more subscribers, go with a watermark that resembles a YouTube subscribe button. This makes it easy for viewers to know that they can subscribe to your channel using your photo watermark, which can bump up conversions. For example, the Backlinko YouTube Channel used to use a transparent logo: And when we changed the watermark to a small subscribe button, the number of subscribers we got from our watermark improved by nearly 70%. Choose a Start Time YouTube allows you to choose the exact moment that your watermark first appears. One thing to keep in mind here is that this setting applies to all of the videos on your channel. Unfortunately, you can’t choose a custom start time for individual videos. So: what’s the best start time for your Branding Watermark? There’s no magical start time that works best for every channel. That said, YouTubers tend to be in two different camps when it comes to Branding Watermark start time: Have it Appear at 0:00: In other words, have your watermark appear for your entire video. The advantage of this approach is that people see your watermark right away, which helps viewers realize they’re watching a video from your channel. The downside is that your watermark appears during the critical first 15 seconds of your video, which can distract viewers from your message. Start After Your Intro: This means your watermark will appear at around 00:30-1:00. That way, your watermark doesn’t draw attention away from your intro. However, when your watermark does appear, it’s very noticeable, which may distract viewers. As you can see, there are pros and cons to each approach. And the exact timing is ultimately your call. Don’t Block the Good Stuff As you plan and film your videos, it’s important to remember that you’ll have a branding watermark on-screen in your final video. So make sure to avoid putting important information (like helpful text) or compelling visuals in the bottom right-hand corner of your shot. Track Performance YouTube actually shows you how well your Branding Watermark is performing (in terms of click through rate). This report shows you how many people see and interact with your watermark. In general, a super small percentage of folks will actually engage with your watermark. So don’t expect to see a click through rate of 5% or more. That said, this report does allow you to test different watermarks to see which style and format work best for your channel.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Branding Watermark"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}