{
  "url": "https://moz.com/blog/category/link-building/p17",
  "slug": "p17",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: James Agate July 10, 2013 Link Building Survey 2013 - The Results [INFOGRAPHIC] Link Building Many of us faced a challenging 2012, and 2013 has been no different. We created a survey to really capture the current market sentiment and better understand how industry peers are faring. This post walks you through the infographic we created from the results. Read this post By: Geoff Kenyon July 1, 2013 Pyscape: Your Best Friend for Using the Mozscape API Link Building This post dives into Pyscape, a Python-based tool that uses the Mozscape API to extract data from Open Site Explorer. Try it out, and you might never go back to using Google Docs to pull that data. Read this post By: Phil Nottingham June 17, 2013 How to Leverage Investment in Video to Build More Links Link Building Video can be an expensive and time consuming investment. In this post, I outline nine ways in which video can be used to augment and enhance link building activity, with the goal of giving you more ammunition to secure an investment in video as part of a wider inbound marketing strategy. Read this post By: Matthew Barby June 4, 2013 How to Build Links to Your Blog - A Case Study Link Building After a month or so of development, my site was finally ready and I wanted to start thinking about how to get some traffic going on the website. Whilst paid advertising and social media were a huge part of the strategy, I knew that appearing in the search engines for a wide selection of long-tail phrases was going to be instrumental to the blog's success. This is when I began developing my link building strategy and, after trialing out some very successful approaches, I've decided to now share my link building tactics with you all. Read this post By: YouLee May 21, 2013 Fear and Challenges in Link Building: Hard-boiling Experiment with 4 Interactive Infographics. Link Building This article is a first-hand experience of creating and promoting four infographics. I will reveal exactly which techniques worked, which were an exercise in futility and which were utter disasters. Read this post By: Adam Wagner May 14, 2013 Building a Freelance Link Building Team Link Building Need help link building, but can’t afford to hire an agency or a full-time employee? There are some great resources out there that can connect you with qualified freelancers to help you meet your goals. The trick is knowing what to look for in freelance SEO help. Read this post By: Martijn Oud May 13, 2013 Get Email Alerts for New Backlinks with Open Site Explorer Link Building Recently SEOmoz added a new function to their Open Site Explorer called Just-Discovered Links. Instead of having to wait for new index updates and comparing your CSVs, you can simply monitor the new links tab. Unfortunately SEOmoz doesn’t have RSS support for Just-Discovered links. And checking for page updates every day is probably not the best use of your time. Read this post By: James Finlayson May 7, 2013 How Guest Bloggers are Sleepwalking Their Way into Penalties Link Building How do you get links in a post-penguin world? For far too many the answer seems to be, exclusively, guest posting. Today I’m going to give you four reasons why I think this tactic can be as dangerous as those it replaced. Read this post By: Kelsey Libert May 7, 2013 The Secret Recipe for Viral Content Marketing Success Link Building We know that content marketing is one of the best ways to engage with audiences and potential customers online. But what happens when a business has tried content marketing and has seen few returns? It's time to come up with content that works; content that will go viral and can show what content marketing can really do for your business. Read this post By: Ian Lurie April 24, 2013 Machine Learning and Link Spam: My Brush With Insanity Link Building Using machine learning to combat dirty link profiles can save hours of time and countless dollars spent on hand-checking web pages. In today's post, Ian Lurie walks us through a tale of successfully implementing machine learning, one step at a time. Read this post By: Marie Haynes April 18, 2013 The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too) Link Building Are you confused about the difference between Penguin and an Unnatural Links penalty? Not sure whether you should be disavowing your links? Wondering whether you should file for reconsideration? Well...you're not alone! I have spent a good amount of time answering questions and learning from others in the SEOmoz Q&A and I see a lot of site owners and even SEOs who are unsure about the answers to these questions. Read this post By: Matt Ridout April 16, 2013 The Impact of Company Investment on SEO - Link Building Case Study Link Building On the 4th of March 2013 the company I work for underwent a third round of investment from Conde Nast. This was, for a number of reasons pretty big news in the fashion industry as it was Conde Nast’s biggest investment in e-fashion to date – as a result we received a large number of global citations, many of them with links and social signals to our site. So how does Google treat this sudden influx of positive signals to a site and what impact has that had in rankings and visits? Read this post By: Daniel Herndler April 8, 2013 Dos and Don'ts - Bad Link Building And Useful Alternatives Link Building High-value links and a successful link profiles are still important topics in the world of SEO. Although “Content is King” links are still counting for SEO too. However, it is now important to avoid negative links instead of building more and more new ones. Read this post By: Rhea Drysdale April 4, 2013 33 Link Building Questions Answered Link Building When it comes to link building idea generation, the sky's the limit! In today's post, Rhea Drysdale offers her tips for best practices and a philosophical approach to link building that will help bring your ideas to life. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "Link Building Survey 2013 - The Results [INFOGRAPHIC]"
    },
    {
      "level": "H2",
      "text": "Pyscape: Your Best Friend for Using the Mozscape API"
    },
    {
      "level": "H2",
      "text": "How to Leverage Investment in Video to Build More Links"
    },
    {
      "level": "H2",
      "text": "How to Build Links to Your Blog - A Case Study"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Fear and Challenges in Link Building: Hard-boiling Experiment with 4 Interactive Infographics."
    },
    {
      "level": "H2",
      "text": "Building a Freelance Link Building Team"
    },
    {
      "level": "H2",
      "text": "Get Email Alerts for New Backlinks with Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "How Guest Bloggers are Sleepwalking Their Way into Penalties"
    },
    {
      "level": "H2",
      "text": "The Secret Recipe for Viral Content Marketing Success"
    },
    {
      "level": "H2",
      "text": "Machine Learning and Link Spam: My Brush With Insanity"
    },
    {
      "level": "H2",
      "text": "The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too)"
    },
    {
      "level": "H2",
      "text": "The Impact of Company Investment on SEO -  Link Building Case Study"
    },
    {
      "level": "H2",
      "text": "Dos and Don'ts - Bad Link Building And Useful Alternatives"
    },
    {
      "level": "H2",
      "text": "33 Link Building Questions Answered"
    }
  ],
  "author": "James Agate\n          \n            Geoff Kenyon\n          \n            Phil Nottingham\n          \n            Matthew Barby\n          \n            YouLee\n          \n            Adam Wagner\n          \n            Martijn Oud\n          \n            James Finlayson\n          \n            Kelsey Libert\n          \n            Ian Lurie\n          \n            Marie Haynes\n          \n            Matt Ridout\n          \n            Daniel Herndler\n          \n            Rhea Drysdale"
}