{
  "url": "https://moz.com/blog/category/link-building/p32",
  "slug": "p32",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin October 13, 2009 Headsmacking Tip #14: Offer Testimonials, Get Links Link Building What motivates a link? Sometimes it's referencing data/research/news or given because you've produced something interesting and valuable. Sometimes it's because another site has licensed or adopted content/widgets/badges from you. But, in most cases where an editorial link is given, I find that the underlying motivation is because that link provides some benefit to the linki... Read this post D By: Deckers October 12, 2009 Where to Begin a White-Hat Link Building Campaign Link Building In reading Rand’s post on the paid links debate and the related comments that followed, as well as the discussion about link brokers on another site, I wanted to take some time to fig... Read this post By: David Ciccarelli September 28, 2009 Parable of the Lost Link Link Building In the Bible, Jesus tells the story called \"The Parable of the Lost Sheep\". If a man lost a sheep, he would leave the others to look for it. When he had found it he... Read this post By: Mike Tekula September 25, 2009 Examining the Top 150 In-Linked Posts at SEOmoz Link Building Though it's certainly not the most hyped, an SEOmoz tool I took an immediate fascination with is the Top Pages tool (found in SEOmoz Labs - PRO only). What it does is very simple yet powerful: you give it a domain, and it returns a list of the pages at that domain that are linked to by the most root domains (sort... Read this post By: Jennifer Sable Lopez September 23, 2009 Followed Links from Four Unexpected Sources Link Building We receive many questions every day in our Q & A section. Every question is answered by a different person and is handled personally. Often times we will run across a specific question being asked various times. Although the question is usually never exactly the same, the answer is often fairly similar. One question that has been popping up lately is whether it is really worth it, from an SEO ... Read this post By: Rand Fishkin September 17, 2009 Our Stance on Paid Links & Link Ads Link Building Tonight I'm tackling a contentious, thorny issue and that's always a tough task. Thus, I'll ask, up front, for a bit of leeway in how my words are parsed and interpreted. I'm happy to make clarifications on specifics in the comments. Lately, we've been getting a lot of questions (through Q+A as well as from clients and the SEO community) about the practi... Read this post By: Rob Ousbey September 14, 2009 A Link Building Rule to Cut Out and Keep Link Building There's one piece of advice I've given to quite a few people recently, who are just starting to market their website. I thought I'd share this with you, and show how savvy internet marketers can get even more out of the same tip. Read this post By: Rand Fishkin September 10, 2009 17 Ways Search Engines Judge the Value of a Link Link Building It's 9:30am and you've just started a pitch for a new SEO client. They're the curious type - wanting to know how search engines rank pages, why the changes you'll recommend will make an impact, where you learned to do SEO, and who you can list as good examples of your work. As you dive deeper into the requirements for the project, you arrive at the link building section. The client wants to kno... Read this post E By: Ethan Stanislawski September 8, 2009 Competitive Link Finder Provides Qualitative Link Building Ideas Link Building What enthralled me about using SEOmoz's Competitive Link Finder was not the raw stats. In fact, considering how early on in the SEO process I am with my current client, it was somewhat disheartening to see how strong the backlinks were to established competitor sites. What was a lot more interesting was to see the kind of sites that were providing my competitors backlinks. Some were resourc... Read this post By: Rand Fishkin September 1, 2009 Linkscape's Best Link Building Tool Yet Link Building Linkscape has always been a project with a lot of promise. Building a crawl of the WWW that can expose link data in interesting ways, calculate metrics in the ways search engines do and surfacing potential SEO opportunities are all a part of that. Last week, Linkscape took a giant leap forward in usefulness with Nick Gerner's new ... Read this post T By: trafikant August 31, 2009 How Did I Get 200 Quality Backlinks in Two Weeks - For FREE? Link Building Well, it wasn't easy.Harvesting backlinks is hard but harvesting quality backlinks is much harder. Why people would give you links for free? Why people in your industry will do so without asking for a favor in return?Family firstWe always go for new backlinks, new websites, new partnerships and so on, but what about our old backlinks? do they s... Read this post By: Rob Ousbey August 18, 2009 Link Building for Small eCommerce Sites Link Building Link building for small ecommerce sites can be amongst the toughest SEO challenges - but also the most common. I'd like to share a few bits of advice for anyone rising to the challenge - whether you're working in-house or as an agency. These are targetted at small companies, probably with limited internal resource or a small SEO agency contract, and who don't have a PR firm able to get them into newspapers or an advertising budget that will put them in magazines and on radio, etc. Read this post By: Joshua Unseth August 17, 2009 The Importance of NoFollow Links Link Building In college I worked for a conservative magazine called The Brown Spectator. While it was only a college magazine, I had a ton of fun working on it to practice SEO. My proudest moment was the day I discovered I was ranking number 1 for “Mitt Romney” in google images—although it didn't last long because I screwed wit... Read this post L By: LucyLangdon July 13, 2009 Finding and Using Niche Blogs Link Building When I talk about 'niche blogs', I mean blogs that are regularly updated and focus mainly, but not exclusively, on a certain subject area like, for example, crocheting or tea. More often than not, a blog with a specialty will be of a much higher quality than your average 'rambling and musings of x' site. However, with a zillion new blogs published per hour, it's getting increasingly difficult to ferret these quality blogs out, particularly if they're not in the business of being found. That makes it sound like I'm talking about underground crochet blogs. I'm not. I just mean blogs that aren't particularly well optimised for the search engines and don't know an awful lot about things like title tags or keyphrases. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #14: Offer Testimonials, Get Links"
    },
    {
      "level": "H2",
      "text": "Where to Begin a White-Hat Link Building Campaign"
    },
    {
      "level": "H2",
      "text": "Parable of the Lost Link"
    },
    {
      "level": "H2",
      "text": "Examining the Top 150 In-Linked Posts at SEOmoz"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Followed Links from Four Unexpected Sources"
    },
    {
      "level": "H2",
      "text": "Our Stance on Paid Links & Link Ads"
    },
    {
      "level": "H2",
      "text": "A Link Building Rule to Cut Out and Keep"
    },
    {
      "level": "H2",
      "text": "17 Ways Search Engines Judge the Value of a Link"
    },
    {
      "level": "H2",
      "text": "Competitive Link Finder Provides Qualitative Link Building Ideas"
    },
    {
      "level": "H2",
      "text": "Linkscape's Best Link Building Tool Yet"
    },
    {
      "level": "H2",
      "text": "How Did I Get 200 Quality Backlinks in Two Weeks - For FREE?"
    },
    {
      "level": "H2",
      "text": "Link Building for Small eCommerce Sites"
    },
    {
      "level": "H2",
      "text": "The Importance of NoFollow Links"
    },
    {
      "level": "H2",
      "text": "Finding and Using Niche Blogs"
    }
  ],
  "author": "Rand Fishkin\n          \n            Deckers\n          \n            David Ciccarelli\n          \n            Mike Tekula\n          \n            Jennifer Sable Lopez\n          \n            Rand Fishkin\n          \n            Rob Ousbey\n          \n            Rand Fishkin\n          \n            Ethan Stanislawski\n          \n            Rand Fishkin\n          \n            trafikant\n          \n            Rob Ousbey\n          \n            Joshua Unseth\n          \n            LucyLangdon"
}