{
  "url": "https://moz.com/blog/category/link-building/p34",
  "slug": "p34",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: David Ciccarelli March 23, 2009 How I Got a Link from CNN Link Building As my Dad always says, \"It's better to be on page 2 in the editorial than on page 7 as an advertisement.\" This advice has been the guiding principle when it comes to the public relations strategy at Voices.com. In fact, I've proven this to be so effective in public relations that I've applied it to SEO as well. How does the advice translate? Read this post By: Adam Henige March 23, 2009 Avoiding a Transactional Mindset When Link Building Link Building I don't know what everyone else's client roster looks like, but for us it's all over the map, both literally and figuratively. Not only have our clients allowed us to fulfill our dream of manifest destiny (almost), but they range from billion dollar corporations to one person start ups and everything in between. Obviously, the means and the goals of these types of businesses are drastically different, and from our standpoint they each require us to use different \"SEO muscles.\" Read this post J By: Jason Lancaster March 19, 2009 The NoFollow Tag is a Lot Like a Drunken Boss Link Building Imagine for a moment that you've spent the last three hours watching your boss imbibe, and that he (or she) is shamelessly sloshed. Just as things are really getting comfortable, your boss drops this little jewel of information into your lap: Read this post T By: Tripti March 17, 2009 Link Building: Mislead to Believe Link Building Everyone in the field of internet marketing knows that without link building, your site will not be valued by search engines. Also, we agree that links are a path through which our prospects can reach to us. Most importantly, we need to develop high quality links to outrank our competitors. Read this post By: Thomas Schmitz March 12, 2009 Using SEOmoz Linkscape to Troll for Terrific Link Prospects Link Building When it comes to finding links, since the dawn of SEO one constant piece of advice has been to look at your competitors links for opportunities. Unfortunately, this means wading through the muck in order to find the gems. How do you gather, organize and prioritize all of those links? Wouldn't it be nice to take a power-hose to all that mud and grime to more easily uncover the best prospects? It's not that difficult. Here's a step-by-step guide for doing just that! Read this post D By: davidseo March 6, 2009 How to Rank Well Without Inlinks Link Building The idea that you cannot be found on the web if there are no inlinks to one's site was recently the subject of a debate between myself and a fellow geek. My response was that one does not need ANY links to have a good ranking. This myth about inbound links (at least in my view it's a myth) is silly. Read this post By: Rand Fishkin February 24, 2009 5 Reasons You Should Link Out to Others From Your Website Link Building There's a lot of debate in the web world, particularly in the SEO & marketing departments of mid-size and larger organizations, about whether or not to link out to other websites from their own. People are scared for a number of reasons; they worry that linking out could: Harm their reputation Damage their search engine rankings Cost them Pag... Read this post By: Tim Grice February 23, 2009 How Effective Are Outbound Links? Link Building Whenever outbound links are mentioned in an SEO environment, the response is usually negative. I have read recently on some blogs that it even casts a very negative shadow over outbound links, stating they could \"harm your site's PageRank.\" I know this is simply referring to the old \"bad neighbourhood,\" but I have wondered for a while now what the effect of outbound links are. Read this post By: Will Critchlow February 23, 2009 Nofollow is Dying: The Impact of Micro-Blogging and Nofollow on SEO Link Building In the interests of starting with a bold statement, I'll go with what I twittered earlier this morning: \"My seo theory for the morning. Nofollow is dying.\" In the same way that blogging, commenting, trackbacks (and associated spam) forced a change in the search engines' strategies, I believe we are starting to see similar changes caused by the meteoric growth of Twitter and use of nofollow. The effects on web usage are there for all to see - what has been less discussed is impacts on SEO both now and in the future. Read this post A By: ao.com February 18, 2009 Twitter Links Are a Source of External Links...Sometimes Link Building I wanted to establish if external links from Twitter hold any weighting. It is a well-known fact that Twitter uses rel = “no follow” on all external links, but do the search engines still cache these and consider them a vote? Read this post N By: Nathan Taitt January 30, 2009 Another Post About Getting .edu Links Link Building Hey guys! This is my first post, so maybe in celebration we could take off the nofollows on this blog post...hahaha, just messing. Recently, I was talking to one of my friends at Georgia Tech and discovered he had his own web design company (like a lot of CS majors at Tech). When I went to his website I discovered his homepage had a PR 4 (not too shabby). Read this post By: Saadi Allan January 27, 2009 Linkbaiting Our Way to a Better World? Link Building Link baiting has been around for a fair while now, and we all know the basic concept is essentially driven by self interest, i.e., increasing website traffic for financial or personal gain. Read this post By: Will Critchlow January 15, 2009 The Full List of Suppliers to Ask for Links Link Building One small step in any linkbuilding process that has been written about many times before is to ensure that you (/ your client) has links from all appropriate businesses that they actually have a real relationship with. In the SEO world, it'd be unthinkable to enter into a partnership without a few links between your sites, but in many industries, this happens. Beyond partnerships, what about all your suppliers and customers? This has been written about many times before - along with techniques for getting links from those suppliers (such as offering testimonials). What is harder to find is an easy reference list for who all the suppliers you should approach are. Read this post N By: Nathaniel Gibson January 12, 2009 The Power of Indirect Marketing Link Building Just What the Heck is Indirect Marketing, Anyway? Indirect marketing is a way for a business to market their product, idea, or service without having to use the methods of SPAM or direct advertising and marketing.The idea behind indirect marketing is instead of sending a message out to your target market directly, just send them something like a friend request, or a vote, or a digg, or anything to get their attention. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "How I Got a Link from CNN"
    },
    {
      "level": "H2",
      "text": "Avoiding a Transactional Mindset When Link Building"
    },
    {
      "level": "H2",
      "text": "The NoFollow Tag is a Lot Like a Drunken Boss"
    },
    {
      "level": "H2",
      "text": "Link Building: Mislead to Believe"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Using SEOmoz Linkscape to Troll for Terrific Link Prospects"
    },
    {
      "level": "H2",
      "text": "How to Rank Well Without Inlinks"
    },
    {
      "level": "H2",
      "text": "5 Reasons You Should Link Out to Others From Your Website"
    },
    {
      "level": "H2",
      "text": "How Effective Are Outbound Links?"
    },
    {
      "level": "H2",
      "text": "Nofollow is Dying: The Impact of Micro-Blogging and Nofollow on SEO"
    },
    {
      "level": "H2",
      "text": "Twitter Links Are a Source of External Links...Sometimes"
    },
    {
      "level": "H2",
      "text": "Another Post About Getting .edu Links"
    },
    {
      "level": "H2",
      "text": "Linkbaiting Our Way to a Better World?"
    },
    {
      "level": "H2",
      "text": "The Full List of Suppliers to Ask for Links"
    },
    {
      "level": "H2",
      "text": "The Power of Indirect Marketing"
    }
  ],
  "author": "David Ciccarelli\n          \n            Adam Henige\n          \n            Jason Lancaster\n          \n            Tripti\n          \n            Thomas Schmitz\n          \n            davidseo\n          \n            Rand Fishkin\n          \n            Tim Grice\n          \n            Will Critchlow\n          \n            ao.com\n          \n            Nathan Taitt\n          \n            Saadi Allan\n          \n            Will Critchlow\n          \n            Nathaniel Gibson"
}