{
  "url": "https://moz.com/blog/category/link-building/p40",
  "slug": "p40",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin May 28, 2007 Link & Ranking Strategies for Enterprise Sites Link Building Tonight I'm back from Hong Kong and China, sitting at my computer in lovely, cool, wonderfully-clean-tap-water-spouting Seattle. There's a lot to come on Chinese search marketing from myself, Si and David Temple (who generously offered coverage of the conference for the blog), but, in the meantime, I know we need to get back to basics here at SEOmoz... Read this post By: Rebecca Kelley May 25, 2007 Will .edu Links Ever Lose Their Luster? Link Building That Joe Whyte sure has been busy lately. With the amount of time he spends on IM pestering me and Jane, I'm astounded he had the time to get a new site up and running and post this entry about how to get links from .edu sites. Basically, h... Read this post J By: JohnBarton May 3, 2007 Inbound Link Penalties are Non-Existent Link Building This post is in response to the idea that you should be afraid of who you buy links from. Inbound links cannot be penalized because there is not a reliable way for Google or any other search engine to verify that the target of the inbound links is responsible for placing them.Googlebowling doesn't exist here because if it did then everyone would be able to get their compe... Read this post P By: Patrick Sexton April 22, 2007 Stop Wanting Money and Start Wanting Traffic Link Building \"I once had a farm in Africa\" Meryll Streep told us in Out of Africa. Well Meryll, I had a house in Africa too and it was a nice sturdy house with an enormous patio that overlooked a landscape filled with trees of such shape that my eyes never became familiar with and which never failed to be lovely to the point of amazing me every morning I woke up. Beyond the t... Read this post C By: Ciaran Norris March 26, 2007 A Little Knowledge Can Be A Dangerous Thing Link Building Last week Seth Godin wrote a raging post about emails he’d received requesting links from his blog. The emails were from employees of Reed Elsevier, the publishers of titles such as Variety & LexisNexis, and what really angered Seth is not so much the fact that he received multiple reque... Read this post By: Rand Fishkin March 23, 2007 I Love Being Wrong About Digg Link Building Brandon Hopkins, who runs a blog on search & webmastering, emailed me earlier this week to ask for my opinion on an article of his. Here's what I wrote back: I doubt you've got a shot at Digg-bait; it's too SEO focused and will get buried instantly. I'm not sure I'd even submit it as the ... Read this post J By: James Wittering March 19, 2007 Living Without the Linkerati Link Building Rand's post on Monday \"The Secret to Ranking at the Search Engines (that's really no secret at all)\" highlights the importance of website content appealing to the linkerati for the purposes of encouraging plenty of high quality, on-topic (possibly) and most impo... Read this post By: Pete Watson-Wailes March 19, 2007 BlackLinking Part II Link Building And here we go, diving into the other half of it! So, let's get cracking...Question Six: What are the top 3 over-rated and under-rated criteria for determining how valuable an individual link will potentially be to your site’s search engine rankings? Over-rated - PR, location in a site, and the content it's onUnder-rated - Where... Read this post By: Pete Watson-Wailes March 16, 2007 How to Get BlackLinks, Or Link Building the Black Hat Way Link Building The \"round robin link interview\" over at Rae's blog, which Rand posted on recently, had me thinking...\"As someone who has more than his toe in the black hat circle, as well as d... Read this post By: Rand Fishkin March 14, 2007 Link Dev Experts Answer the Tough Questions Link Building Rae Hoffman, in all her brilliance, devised a round-robin link interview on Sugarrae that truly rocks. She asked five experts in the link building space (myself included) to generate their toughest questions around link building and then had all five of us answer each question. The results are terrific.... Read this post By: Rand Fishkin March 8, 2007 The Rising Tide Lifts All Ships Link Building I hate to revisit this topic again so soon, but it appears to require clarification for many folks. I've tried to lay out the process of how this theory works as clearly as possible, and provide a few examples. ... Read this post By: Rand Fishkin March 2, 2007 Two Clarifications on How Search Engines Interpret Links Link Building Today I want to touch on two issues that, when improperly perceived, can negatively impact how search marketers and site owners build out their campaigns. Links to Pages & Domains Many folks new to search marketing, and even some with experience, incorrectly assume that many elements of the PageRank model are still in place, including the idea that the link ... Read this post J By: James Wittering February 22, 2007 A Brief Review of the SEOmoz Professional Guide to Link Building Link Building I thought I had already submitted this but after I hit 'publish' it lost formatting and I'm not sure if it actually went to you. If this is a duplicate then please accept my apologies... My little boy had a temperature on Friday so it was a day of sitting under blankets on the settee, playing Lego Star Wars and watching DVDs whilst the virus worked it's merry way thr... Read this post C By: closedsaturday February 16, 2007 The Power of the Phone in Linkbuilding Link Building First off I want to preface this post with a little warning. I’m by no means an SEO expert. In fact, I’m a newbie to the game. I only have about six months of real Internet marketing under my belt (although in online time I suppose that would equate to a few years of real world experience.) Many people might shrug me off because of my lack of experience but I think it’s actual... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "Link & Ranking Strategies for Enterprise Sites"
    },
    {
      "level": "H2",
      "text": "Will .edu Links Ever Lose Their Luster?"
    },
    {
      "level": "H2",
      "text": "Inbound Link Penalties are Non-Existent"
    },
    {
      "level": "H2",
      "text": "Stop Wanting Money and Start Wanting Traffic"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "A Little Knowledge Can Be A Dangerous Thing"
    },
    {
      "level": "H2",
      "text": "I Love Being Wrong About Digg"
    },
    {
      "level": "H2",
      "text": "Living Without the Linkerati"
    },
    {
      "level": "H2",
      "text": "BlackLinking Part II"
    },
    {
      "level": "H2",
      "text": "How to Get BlackLinks, Or Link Building the Black Hat Way"
    },
    {
      "level": "H2",
      "text": "Link Dev Experts Answer the Tough Questions"
    },
    {
      "level": "H2",
      "text": "The Rising Tide Lifts All Ships"
    },
    {
      "level": "H2",
      "text": "Two Clarifications on How Search Engines Interpret Links"
    },
    {
      "level": "H2",
      "text": "A Brief Review of the SEOmoz Professional Guide to Link Building"
    },
    {
      "level": "H2",
      "text": "The Power of the Phone in Linkbuilding"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rebecca Kelley\n          \n            JohnBarton\n          \n            Patrick Sexton\n          \n            Ciaran Norris\n          \n            Rand Fishkin\n          \n            James Wittering\n          \n            Pete Watson-Wailes\n          \n            Pete Watson-Wailes\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            James Wittering\n          \n            closedsaturday"
}