{
  "url": "https://moz.com/blog/category/link-building/p42",
  "slug": "p42",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin November 28, 2006 Why Would You Display Your Text Link Ad Inventory? Link Building The friendly guys over at TextLinkBrokers are about to become partners of SEOmoz - they're going to be hosting our new site (slightly delayed due to Matt's Hawaiian getaway - sorry folks) and helping us run some of the tools a bit faster. I was chatting with Jarrod Hunt, who runs the business and he let me know that they just released their ... Read this post By: Rand Fishkin November 7, 2006 Free Linkbait Idea on Web Analytics Link Building Someone on the web must want the 50,000 visitors and 10,000 links this article would provide, and I'm too swamped. Here's the idea: Compare 5-10 of the top web analytics suites on 2-3 websites over the course of one month Analyze the data, compare them against each other, rate them on ease-of-use, pricing, service, accuracy and features Write up an... Read this post I By: IBrian November 3, 2006 Landing Pages for SEO Link Building What is a Landing Page?A Landing Page is a page that focuses information targeted towards a particular user – and according to Seth Godin, optimised specifically to encourage 1 of 5 actions: Get a visitor to click (to go to another page, on your site or someone... Read this post By: Rand Fishkin November 2, 2006 A Long List of Competitive Link Searches Link Building Last week, I covered searching for potential links through highly ranking sites at the engines. Today, we'll talk about competitive link searches - finding the links your competetion is using to rank well. As an example, I'll use Farecast, a local Seattle company that I've mentioned in the past (full disclosure: David Shim, who works there, is a friend). Si... Read this post By: Rand Fishkin October 27, 2006 Long List of Link Searches Link Building This is competitive intelligence - the kind that SEO firms shouldn't be sharing because it reveals a considerable portion of the value they (we) provides to clients. Thus, it's the perfect topic for an SEOmoz post. The best way to do this is by example. I've picked one lucky website - EvoGear.com (based here in Seattle) and one of their primary... Read this post E By: EGOL September 22, 2006 Ten Ways to Earn an .edu Link Link Building I've been an .edu webmaster for about 13 years. I've seen lots of links given to .com domains. Four general characteristics are common through these links. The folks who receive them are: A) generous with their time, B) generous with their talent, C) generous with their money, or D) know a lot about an academic subject and are very good at writing about it.&nbsp... Read this post By: Rand Fishkin September 15, 2006 Email is Still the Key to a Successful Link Building Campaign Link Building Last week, Michael wrote about his take on link request emails. I thought it would be valuable to share my own perspective on the subject, coming primarily from a background of making email requests to site operators. The lessons I've learned aren't universally applicable, but they've helped go a long way in getting attention and having... Read this post By: Rand Fishkin September 14, 2006 Jim Boykin on Quantity vs. Quality of Links Link Building Poor Jim had a rough week on the blog with his forray into politics. Luckily, he's re-emerged undamaged with an incredibly insightful entry on link numbers: It’s not always \"He with the most links\" who wins the game……often, \"He with the right li... Read this post By: Rand Fishkin September 1, 2006 Arguing with Link Moses - This Already Seems Like a Bad Idea Link Building I can't believe I'm about to do this, but I also can't resist. Eric Ward, aka \"Link Moses,\" aka \"The Link Building Expert,\" wrote a post last month about drinking the linkbait kool-aid and I'... Read this post By: Rand Fishkin August 28, 2006 Buying & Selling Text Link Ads Link Building I've been friendly with two of our industry's biggest purveyors of text link ads - TextLinkBrokers' Jarrod Hunt and Text-Link-Ads' Patrick Gavin - for the last couple years. With the relaunch of Jarrod's site and a relative lull in the antagonism towards paid link services, I thought it would be... Read this post E By: EGOL August 18, 2006 Brainstorming on .gov links :-) Link Building OK... I will share one of my best ideas for getting a .gov link if the folks who read it will share one of their best ideas. Your idea can be proven to work or one that you \"think\" will work. If you think it will work I might try it.In one of my previous careers I spent quite a few years as a manager at a governemnt agency. Government agency heads like... Read this post By: Rand Fishkin August 9, 2006 Spamming on the Square Link Building A new phrase seems to be catching fire at SES San Jose this year - \"Spamming on the Square.\" First off, a bit of background is in order; the phrase \"kidding on the square,\" popularized recently by Al Franken, refers to when an individual who pokes fun or makes jokes has a hint of seriousness b... Read this post By: Rand Fishkin July 17, 2006 10 Remarkably Effective Strategies for Driving Traffic Link Building In the last six months, we've been lucky enough to help quite a few companies and websites drive significant traffic to their sites. Many of these campaigns have been constructed around the goal of building search engine rankings, as this is our primary business, but we've also found that our ability has given us great power in the fields of brand-awareness and marketing overall. Thus, the foll... Read this post By: Rand Fishkin July 10, 2006 All the Different Ways to Calculate Link Numbers (and the Best One) Link Building If, like many SEOs, you're seeking to find a good way to tell exactly how many links you've got (or how many your competition has), this post is for you. There are dozens of link reporting methodologies, and I'll try to cover as many as I can remember: GoogleWith the crappiest numbers around, it's a wonder that anyone pays attention to them at all. Google themselv... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "Why Would You Display Your Text Link Ad Inventory?"
    },
    {
      "level": "H2",
      "text": "Free Linkbait Idea on Web Analytics"
    },
    {
      "level": "H2",
      "text": "Landing Pages for SEO"
    },
    {
      "level": "H2",
      "text": "A Long List of Competitive Link Searches"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Long List of Link Searches"
    },
    {
      "level": "H2",
      "text": "Ten Ways to Earn an .edu Link"
    },
    {
      "level": "H2",
      "text": "Email is Still the Key to a Successful Link Building Campaign"
    },
    {
      "level": "H2",
      "text": "Jim Boykin on Quantity vs. Quality of Links"
    },
    {
      "level": "H2",
      "text": "Arguing with Link Moses - This Already Seems Like a Bad Idea"
    },
    {
      "level": "H2",
      "text": "Buying & Selling Text Link Ads"
    },
    {
      "level": "H2",
      "text": "Brainstorming on .gov links   :-)"
    },
    {
      "level": "H2",
      "text": "Spamming on the Square"
    },
    {
      "level": "H2",
      "text": "10 Remarkably Effective Strategies for Driving Traffic"
    },
    {
      "level": "H2",
      "text": "All the Different Ways to Calculate Link Numbers (and the Best One)"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            IBrian\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}