{
  "url": "https://moz.com/blog/category/link-building/p43",
  "slug": "p43",
  "title": "Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin June 16, 2006 5 Rare & Valuable Link Building Tactics Link Building I've been thinking it's time for an \"old-school\" SEOmoz blog post. These are some of the rarer, but occassionally highly effective techniques for rooting out links in a challenging campaign. #1 - Mentioned without a LinkThis one is surprisingly effective. Your goal is to identify sites/pages that already mention your brand/product/service/website but hav... Read this post E By: EGOL May 6, 2006 Weigh in on Directory Submission - Do They Have Any Juice? Link Building If you go to webmaster forums one of the most common forms of advice given newbies with a brand new site is... \"Submit to the Directories\" - that will get you some quick backlinks (AKA some easy link juice). These directories will include your site for free or for a small inclusio... Read this post By: Rand Fishkin March 30, 2006 Paid Links Under Fire... Again Link Building So Matt's comments yesterday (he didn't pay me for a link, so I'm afraid I can't give one out) set off a treasure trove of commentary about the use of paid links. Matt's contention: Yes, if you sell links, you should mark them with the nofollow tag. Not doing so can affect your reputation in Google. Let me... Read this post By: Rand Fishkin March 22, 2006 Identifying the Linkerati Link Building Oftentimes, when I describe the concept of linkbait to clients, it's critical to also describe those folks who are the targets of linkbait - I'll call them the \"Linkerati\". Let's explore the culture of these most valued of web-dwelling souls: Bloggers - probably the most targetable and directly influenced folks, bloggers are an excellent so... Read this post By: Rand Fishkin March 19, 2006 Wikipedia Link Building Suggestion Link Building For anyone who uses Wikipedia's lax security to add links, let me make a suggestion - add your link in the \"discussion\" section for the page (example) and ask others to review whether the link you're providing will be pertinent or not. This way, you get a real, non-nofollow, indexable link from Wikipedia and yo... Read this post By: Rand Fishkin March 2, 2006 Perfect Example of How to Email a Blogger Link Building One of the best techniques for starting the ball rolling on a content-rich, high quality new site is to email bloggers in your industry and ask for their input. I got this one from Jon Kemp yesterday:Rand,I just wanted to write you and say that I have been an admirer of yours for about six months now, maybe more. I first got turned on to your web site for the tool... Read this post By: Rand Fishkin February 17, 2006 Everyone can Linkbait Link Building Yes, even those folks who run overly spammy credit card offers sites (of which there are hundreds of thousands if not millions) can use the tactic of linkbait. Just look at what Maeda Studio's John Maeda put together - ... Read this post By: Rand Fishkin February 4, 2006 PHP Code for Automating Submission to Digg, Del.icio.us & Furl Link Building eKstreme at Cre8asite pointed to his site's feature on the PHP code needed to create buttons for auto submission to the three social bookmarking sites. Very nice of you to share, eK!... Read this post By: Rand Fishkin January 25, 2006 Talking about LinkBait Link Building Everyone's on about linkbait these days. First Matt mentioned it, now Loren Baker's got a post and Andy's covering both. I thought I'd throw in my $0.02 real quick, as SEOmoz ... Read this post M By: mozUser1469147917838 January 23, 2006 Quest for budget SEO package (part 5): link building Link Building Both Michael and Rand have recently blogged about basic level link building and visibility and I’m about to chime in. Below are my top 5 tips to make link building process cost and resource efficient if you are a SEO services provider ... Read this post By: Rand Fishkin January 12, 2006 The Big, Bursty Links Link Building When I say \"big links\", I'm talking about the sites that drive incredible amounts of traffic to sites in a very short period. They include: Slashdot Yahoo! Picks Digg Del.icio.us/popular ... Read this post By: Rand Fishkin January 12, 2006 Adding Link Bait to Services Link Building SEOmoz has been very busy with requests for business lately, and I'm finding a lot of companies I'd actually love to work with. Thus, it's been neccessary to use both pricing and my own estimation of the achievability of projects and the good-naturedness of the client to help sort who to take on and who to refer. I've also started adding (as a component of the contracts) the development... Read this post By: Rand Fishkin December 9, 2005 Setting Goals is Critical to a Traffic Building Campgaign Link Building No matter what type of website you run, there's a bigger site in your niche (or globally on the web) that can send you a great number of visitors if you make the right moves. Making a list of those goals is part of a link/traffic builders respons... Read this post By: Rand Fishkin December 6, 2005 Content Relay Link Building This one comes via Donna; ContentRelay is a trading system for website content that allows publishers and writers to trade articles for links in a community fashion. The best part - it's free and according to the creators, always will be.... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Link Building"
    },
    {
      "level": "H2",
      "text": "5 Rare & Valuable Link Building Tactics"
    },
    {
      "level": "H2",
      "text": "Weigh in on Directory Submission - Do They Have Any Juice?"
    },
    {
      "level": "H2",
      "text": "Paid Links Under Fire... Again"
    },
    {
      "level": "H2",
      "text": "Identifying the Linkerati"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Wikipedia Link Building Suggestion"
    },
    {
      "level": "H2",
      "text": "Perfect Example of How to Email a Blogger"
    },
    {
      "level": "H2",
      "text": "Everyone can Linkbait"
    },
    {
      "level": "H2",
      "text": "PHP Code for Automating Submission to Digg, Del.icio.us & Furl"
    },
    {
      "level": "H2",
      "text": "Talking about LinkBait"
    },
    {
      "level": "H2",
      "text": "Quest for budget SEO package (part 5): link building"
    },
    {
      "level": "H2",
      "text": "The Big, Bursty Links"
    },
    {
      "level": "H2",
      "text": "Adding Link Bait to Services"
    },
    {
      "level": "H2",
      "text": "Setting Goals is Critical to a Traffic Building Campgaign"
    },
    {
      "level": "H2",
      "text": "Content Relay"
    }
  ],
  "author": "Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}