{
  "url": "https://moz.com/blog/category/paid-search-marketing-ppc/p5",
  "slug": "p5",
  "title": "Paid Search Marketing (PPC) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "C By: CPC Strategy April 17, 2013 Google Shopping Feed, Cost, and PPC Best Practices Paid Search Marketing (PPC) Google Shopping is an online shopping campaign which can really give merchants a headache. Here are some best practices and ways to ease that headache. Read this post By: Danny Richman March 5, 2013 How Google's Search Partner Network Could Be Damaging Your ROI Paid Search Marketing (PPC) Why would 69,340 people over a six-week period search for such an odd query as “media sales media publishing digital jobs”? Even if there was a valid explanation, why would 69,340 people suddenly start using this query when they had never used it in the past? A Search Query report prior to this date showed not a single person using this phrase in the previous two years! Read this post By: Will Craig February 4, 2013 How Google Has Made it so Difficult for New Local PPC Campaigns Paid Search Marketing (PPC) When I started out working in PPC and managing accounts I, like most people I’m sure, obsessed over quality scores. From the start it was obvious how important quality scores were but the problem was, for most new local PPC accounts targeting unbranded keywords, I couldn’t get above the quality score of 4... Read this post By: Tommy Griffith November 6, 2012 A Simple Guide to Adding the Google Remarketing Pixel to Your Site Paid Search Marketing (PPC) I recently added Google's Remarketing snippet to my website. While there are a number of great guides out there on what retargeting is and why it's so powerful, I found myself spending a lot of time getting lost in the Google Adwords UI and trying to set it up. Once I figured out how to do it, I wrote this super short guide on how to get it up and running. It will take you about 10 minutes. Read this post C By: Caroline Watts September 25, 2012 An Intermediate Retargeting Primer: How Psychographic Targeting and Retargeting Can Work Together Paid Search Marketing (PPC) If you’re anything like most attendees at this year's MozCon, Marty Weintraub's talk on psychographic targeting both fascinated and overwhelmed you. To get the most out of Marty's amazing, super-advanced content, you need to know something about retargeting. So, the ReTargeter marketing department thought it would be worthwhile to put together an intermediate retargeting primer explaining what you need to know to truly appreciate Marty's brilliance. Read this post By: Zachary Thompson August 8, 2012 6 Ways Google Ad Extensions Can Improve Your AdWords Campaign Paid Search Marketing (PPC) Most PPC managers know that ad extensions allow you to show additional information on your Google AdWords ads. But only a small minority of them actually use ad extensions to their full potential. That’s a shame, because ad extensions can be powerful tools for a variety of effects, including increasing CTR, boosting conversion rate and decreasing CPA. What’s more, your cost per click isn’t changed by implementing them. Read this post D By: Dan Roche June 12, 2012 The Ever Changing Faces of the PPC Manager Paid Search Marketing (PPC) PPC management has evolved over the years. Check out what you need to know in today's PPC world. Read this post By: Melina Engel April 2, 2012 Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know! Paid Search Marketing (PPC) As PPC managers, we need to account for every percentage point, every up and down, and ultimately the cost of every conversion. We need to squeeze infinitely more out of a continually shrinking per-keyword budget to optimize ROI. We track, collect, analyze, implement, and iterate at the most granular level. The bad things about our marketing platform can typically be cured by hard work and analysis. The one exception: your Keyword Quality Score. Read this post By: David Konigsberg March 5, 2012 Retargeting Hack for the Buying Cycle Paid Search Marketing (PPC) Retargeting, the process of targeting consumers and prospective clients based on their previous Internet actions, has become one of the more popular forms of online advertising lately. On top of it being wildly effective, it's also a great way of delivering a branding message to a specific set of visitors. Why do I recommend it? If you want a huge ROI, retargeting is the tactic for you. Read this post By: Joanna Lord February 7, 2012 10 Ways Paid Marketers Can Leverage Inbound Marketing Paid Search Marketing (PPC) It happened friends. After years of Rand exposing me to the many benefits of inbound marketing I am ready to admit it...[big gulp]...today's marketer needs to be doing more than paid marketing. In fact, I'd go as far as to say, if you are only doing paid marketing you are failing yourself and your company. THERE I SAID IT. I feel better. Way better actually. Read this post By: Joanna Lord January 24, 2012 Comparing the Top 4 Retargeting Companies Paid Search Marketing (PPC) For the past year retargeting has been getting some serious attention. I've been fortunate enough to speak on it at a variety of shows, brainstorm over coffee with some cool companies and even blog about it a few times. No matter who I am talking with or what the venue the number one question asked is \"Who should I use for retargeting?\" Read this post M By: Michael David January 10, 2012 Outsmarting Your Competition in High-Stakes PPC Markets Paid Search Marketing (PPC) Are you competing in a high-stakes PPC market with bids in the $25 to $40 range? If you are, don't simply fight your competition head on; if you do, you'll end up paying premium prices for clicks you might capture for far less. There are several shrewd approaches you can employ to side-step your less-vigilant competitors. We've learned a few valuable tricks that can earn you valuable clicks for less-than-premium prices. Read this post By: Joanna Lord January 3, 2012 Tool Review: Wordstream's PPC Grader Paid Search Marketing (PPC) In paid search there are a lot of rough Adwords accounts out there. You've seen them I'm sure. I know I've worked on them. We get brought in to assess the situation and make some big decisions around whether an account has potential or whether it would be better just to start fresh. This is one of the most common questions we get asked -- how am I doing? Read this post J By: Justin Vanning November 30, 2011 New Adwords Social Extension Displays Google +1's In PPC Ads Paid Search Marketing (PPC) Hey there Mozzers! Today I'm going to talk about how to link your new Google+ Business Page to your Google AdWords account so you can start utilizing the new social extension feature. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Paid Search Marketing (PPC)"
    },
    {
      "level": "H2",
      "text": "Google Shopping Feed, Cost, and PPC Best Practices"
    },
    {
      "level": "H2",
      "text": "How Google's Search Partner Network Could Be Damaging Your ROI"
    },
    {
      "level": "H2",
      "text": "How Google Has Made it so Difficult for New Local PPC Campaigns"
    },
    {
      "level": "H2",
      "text": "A Simple Guide to Adding the Google Remarketing Pixel to Your Site"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "An Intermediate Retargeting Primer: How Psychographic Targeting and Retargeting Can Work Together"
    },
    {
      "level": "H2",
      "text": "6 Ways Google Ad Extensions Can Improve Your AdWords Campaign"
    },
    {
      "level": "H2",
      "text": "The Ever Changing Faces of the PPC Manager"
    },
    {
      "level": "H2",
      "text": "Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know!"
    },
    {
      "level": "H2",
      "text": "Retargeting Hack for the Buying Cycle"
    },
    {
      "level": "H2",
      "text": "10 Ways Paid Marketers Can Leverage Inbound Marketing"
    },
    {
      "level": "H2",
      "text": "Comparing the Top 4 Retargeting Companies"
    },
    {
      "level": "H2",
      "text": "Outsmarting Your Competition in High-Stakes PPC Markets"
    },
    {
      "level": "H2",
      "text": "Tool Review: Wordstream's PPC Grader"
    },
    {
      "level": "H2",
      "text": "New Adwords Social Extension Displays Google +1's In PPC Ads"
    }
  ],
  "author": "CPC Strategy\n          \n            Danny Richman\n          \n            Will Craig\n          \n            Tommy Griffith\n          \n            Caroline Watts\n          \n            Zachary Thompson\n          \n            Dan Roche\n          \n            Melina Engel\n          \n            David Konigsberg\n          \n            Joanna Lord\n          \n            Joanna Lord\n          \n            Michael David\n          \n            Joanna Lord\n          \n            Justin Vanning"
}