{
  "url": "https://moz.com/blog/category/paid-search-marketing-ppc/p8",
  "slug": "p8",
  "title": "Paid Search Marketing (PPC) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin August 26, 2008 Headsmacking Tip #6 - Test with Paid Search Before You Target with SEO Paid Search Marketing (PPC) This may seem like old hat to many SEOs, but it's a tip that never fails to get an \"oh yeah!\" during client meetings. The concept is simple - in any given search engine optmization campaign, you are naturally going to form a list of high-traffic, (perceived) high value keywords that are an idealistic goal for your site to dominate. For a site like SEOmoz, those might be the highly compet... Read this post H By: Helene Hall August 11, 2008 How to Deal with the Problem Child in Your Adwords Campaign Paid Search Marketing (PPC) In my current role, I manage Google Adwords campaigns for a wide range of clients in a pretty diverse range of sectors – from charitable organisations to car insurance. Almost without exception every client has a keyword which I call the problem child. The problem child keyword is typically: very relevant i.e. - it expresses ... Read this post M By: MitchTurck July 16, 2008 \"Money Pit\" Users' Effect On PPC Budgets Paid Search Marketing (PPC) No worries if PPC isn't your bag... this article ties into SEO and general business tactics as well. If none of those things are your bag, then just skip to the bottom - I made a lolcat pic to appease you. Brats.I was reading Kate's post on Tightening PPC Ad Budgets and thought I'd chime in with my take on thos... Read this post H By: Helene Hall July 14, 2008 Adwords - Monitoring Your Impression Share Paid Search Marketing (PPC) Having been inspired by the fantastic paid search posts which I’ve been seeing on here recently, I decided to chime in with one of my own – hopefully you’ll find this useful :)What is impression share?You can calculate your impression share by dividing the total number of search queries relevant to your campaign by the total number of times your ... Read this post K By: Kate Morris July 10, 2008 Tightening Your PPC Spend Paid Search Marketing (PPC) This post came to mind after a day of further tightening down budgets. See I work in the financial area of the world and as we all know, the recession we are in is hitting there real hard. While some of these tips are more \"financial crisis\" based (and can be loosened in better times to get more long tail traffic), most are just good tips to be used on any campaign at any time. ... Read this post K By: Kate Morris July 8, 2008 Paid Search: Detaching from an Agency Paid Search Marketing (PPC) If you come to the point in your relationship with an agency that you think you want to bring your search marketing in house, it can get annoying to get your accounts back in your possession. Some just require a password change, but one in particular (Yahoo) can be very annoying. Please read this if you are an agency, thinking about working with an agency, or wanting to bring your marketing... Read this post M By: MikePiper July 7, 2008 The Best Adwords Report You Don't Use Paid Search Marketing (PPC) A few days back Tom Crichlow gave us a sweet Whiteboard Friday on PPC basics.One of his main points is that data is king. Even though my business partner and I are still Adwords rookies, I wanted to share a great report that has been especially helpful in increasing performance on any broad match keywords that you’re using.While in yo... Read this post M By: MatthewJohn June 30, 2008 Understanding Google AdWords Quality Score Paid Search Marketing (PPC) One of the most misunderstood concepts by new users of Google AdWords is the Quality Score formula. This post aims to clarify what Quality Score is, how it affects your campaign, what factors are used to formulate your Quality Score and how yo... Read this post J By: justFred May 28, 2008 ATTN: Hidden Column Saves You Money! (if you make it happy) Paid Search Marketing (PPC) In Google Adwords there is a hidden column. If you've never seen this column, it might be angry. Feeling like your budget is being eaten by some \"missing element\"? Do you know where your \"quality score\" is hiding? It could be hanging out in your pocket, burnin' your cash. It might be munchin' down a Benjamin right now... or buyin' a pitcher for the \"keyw... Read this post By: Gabriel Goldenberg April 21, 2008 Standing on the Shoulders of Goodman and Konefal Paid Search Marketing (PPC) I recently struggled with using Google AdWords' broad match (not in connection with this) and decided to contact two of the people I respect most on Pay-Per-Click advertising: Andrew Goodman and Amy Konefal. My problem stemmed from the fact tha... Read this post By: Rebecca Kelley March 25, 2008 Paid Search Lessons from David Szetela Paid Search Marketing (PPC) Today I sat in on a webinar taught by David Szetela, the founder of Clix Marketing. He gave some great tips about common PPC and paid search mistakes, and I thought I'd share them below. Don't mix search and content campaigns. David recommends turning off the content network and not mixing search and content... Read this post H By: Helene Hall March 24, 2008 The Shortcomings of the Long Tail Paid Search Marketing (PPC) I work for an online marketing agency, and we’ve been working on a paid search campaign with a niche online job board for some time now. Received wisdom suggests that in order to create a cost effective paid search campaign you should focus on long tail search terms as you’ll get more targeted traffic and cheaper clicks. Now, we work with clients from a wide ... Read this post J By: jwest5150 March 11, 2008 Google Ads for Free?!?!? Paid Search Marketing (PPC) You may have seen a promotion the last week or so for an eBook on sale through ClickBank which promises their new technique will allow you to have all of your Google AdWords ads run for free. Basically, their “talking” sales page states, “Just insert a simple piece of code onto your web site, landing page, etc. and get all of your Google ads for free.” I know wha... Read this post By: Rebecca Kelley February 5, 2008 When You Should Pause Your PPC Campaign Paid Search Marketing (PPC) After our dismal experiment with trying to track impressions, Rand's course of action was to have me dive in headfirst and manage our PPC campaign for our Premium memberships. I half-assed the campaigns in August '07 and retooled them in November, when we redesigned our landing page and added a few targeted pages. The clickt... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Paid Search Marketing (PPC)"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #6 - Test with Paid Search Before You Target with SEO"
    },
    {
      "level": "H2",
      "text": "How to Deal with the Problem Child in Your Adwords Campaign"
    },
    {
      "level": "H2",
      "text": "\"Money Pit\" Users' Effect On PPC Budgets"
    },
    {
      "level": "H2",
      "text": "Adwords - Monitoring Your Impression Share"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Tightening Your PPC Spend"
    },
    {
      "level": "H2",
      "text": "Paid Search: Detaching from an Agency"
    },
    {
      "level": "H2",
      "text": "The Best Adwords Report You Don't Use"
    },
    {
      "level": "H2",
      "text": "Understanding Google AdWords Quality Score"
    },
    {
      "level": "H2",
      "text": "ATTN: Hidden Column Saves You Money! (if you make it happy)"
    },
    {
      "level": "H2",
      "text": "Standing on the Shoulders of Goodman and Konefal"
    },
    {
      "level": "H2",
      "text": "Paid Search Lessons from David Szetela"
    },
    {
      "level": "H2",
      "text": "The Shortcomings of the Long Tail"
    },
    {
      "level": "H2",
      "text": "Google Ads for Free?!?!?"
    },
    {
      "level": "H2",
      "text": "When You Should Pause Your PPC Campaign"
    }
  ],
  "author": "Rand Fishkin\n          \n            Helene Hall\n          \n            MitchTurck\n          \n            Helene Hall\n          \n            Kate Morris\n          \n            Kate Morris\n          \n            MikePiper\n          \n            MatthewJohn\n          \n            justFred\n          \n            Gabriel Goldenberg\n          \n            Rebecca Kelley\n          \n            Helene Hall\n          \n            jwest5150\n          \n            Rebecca Kelley"
}