{
  "url": "https://www.similarweb.com/blog/author/anthony-occhipinti/",
  "slug": "anthony-occhipinti",
  "title": "Anthony T. Occhipinti Articles | Similarweb",
  "description": "Looking for articles written by Anthony T. Occhipinti? Check out all of Anthony T. Occhipinti's insightful articles on the Similarweb blog, enter now!",
  "content": "HomeBlogAnthony T. Occhipinti Senior Analyst Anthony T. Occhipinti Anthony joined Similarweb in January 2022. He has an asset management and finance background specializing in portfolio/data analytics and equity research. Anthony is a Kansas City native and an avid KC Chiefs fan. He also enjoys playing golf, traveling, cooking (recently learned how to make pasta from scratch) and spending time with family. He lives in New Jersey with his wife Renita, his children Alex, Caroline and Serena as well as his dog Enzo. Show more Insights LIV’in La Vida Golfa: LIV Golf vs the PGA Tour by Anthony T. Occhipinti 5 Min. Jun 30, 2022 Insights Jan 6th Hearings an Online Viewing Boon for C-Span Media & Entertainment News by Anthony T. Occhipinti 2 Min. Jun 22, 2022 Insights Netflix & Roku: Potential Merger Magic? Media & Entertainment News by Anthony T. Occhipinti 4 Min. Jun 22, 2022 Insights The Show Must Go On: Audiences Return to Movie Theaters Media & Entertainment News by Anthony T. Occhipinti 9 Min. Jun 8, 2022 Insights Brand Management on Amazon: Opportunities and Pitfalls Ecommerce News by Anthony T. Occhipinti 7 Min. May 25, 2022 Insights Zillow & Redfin Q1 2022 Earnings Preview by Anthony T. Occhipinti 4 Min. May 3, 2022 Insights Robinhood Might Need a Hero: Key Metrics Show Little Signs of Rebound in Q1 by Anthony T. Occhipinti 4 Min. Apr 25, 2022 Insights Apple Q2 2022 Earnings Preview by Anthony T. Occhipinti 5 Min. Apr 25, 2022 Insights Streaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth Media & Entertainment News by Anthony T. Occhipinti 10 Min. Mar 14, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Anthony T. Occhipinti"
    },
    {
      "level": "H3",
      "text": "LIV’in La Vida Golfa: LIV Golf vs the PGA Tour"
    },
    {
      "level": "H3",
      "text": "Jan 6th Hearings an Online Viewing Boon for C-Span"
    },
    {
      "level": "H3",
      "text": "Netflix & Roku: Potential Merger Magic?"
    },
    {
      "level": "H3",
      "text": "The Show Must Go On: Audiences Return to Movie Theaters"
    },
    {
      "level": "H3",
      "text": "Brand Management on Amazon: Opportunities and Pitfalls"
    },
    {
      "level": "H3",
      "text": "Zillow & Redfin Q1 2022 Earnings Preview"
    },
    {
      "level": "H3",
      "text": "Robinhood Might Need a Hero: Key Metrics Show Little Signs of Rebound in Q1"
    },
    {
      "level": "H3",
      "text": "Apple Q2 2022 Earnings Preview"
    },
    {
      "level": "H3",
      "text": "Streaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": ""
}