{
  "url": "https://www.similarweb.com/blog/author/jim-corridore/",
  "slug": "jim-corridore",
  "title": "Jim Corridore Articles | Similarweb",
  "description": "Looking for articles written by Jim Corridore? Check out all of Jim Corridore's insightful articles on the Similarweb blog, enter now!",
  "content": "HomeBlogJim Corridore Senior Analyst Jim Corridore Jim creates actionable insights in the travel, auto, consumer electronics, health/fitness and CPG/retail sectors. Prior to joining Similarweb, Jim was a 30-year Wall Street professional, who covered the industrials, transportation, technology and specialty retail spaces throughout his career, among others. From 2020-September 2021, Jim served as an industry analyst and senior content moderator at Guidepoint, an expert network company. He created events of interest to Wall Street and interviewed subject matter experts including former CEOs, CFOs and other executives and industry experts. He also previously held the position of Director of Industrials Research at S&P Global. Mr. Corridore joined CFRA in 2016 and S&P Global in 1988. He is a seven-time winner of the Wall Street Journal’s “Best on the Street” poll and has won several other awards for his stock-picking acumen. Mr. Corridore is a graduate of the State University of New York at Albany. Show more Insights Cruises: April 2023 Web Traffic Growth Decelerates to 9% from 52% in Q1 Cruise Line News by Jim Corridore 4 Min. May 9, 2023 Insights U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines Airline News by Jim Corridore 4 Min. May 8, 2023 Insights Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months by Jim Corridore 4 Min. May 4, 2023 Insights Airbnb Losing Market Share in Hotels and Accommodations Sector: US Web Traffic up 6% in Q1 Versus 18% Growth for Peer Group Travel News by Jim Corridore 4 Min. Apr 26, 2023 Insights Tesla Misses on Q1 Revenues and Earnings – Similarweb Data Shows Why Automotive News by Jim Corridore 3 Min. Apr 20, 2023 Insights Similarweb Hotels and Accomodations Update: US Web Traffic up 18% in Q1; up 28% in March Travel News by Jim Corridore 4 Min. Apr 17, 2023 Insights U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March Airline News Travel News by Jim Corridore 4 Min. Apr 11, 2023 Insights Cruises: “2023 Wave Season”: Q1 Rose 52%, With All Cruise Lines Seeing Growth Cruise Line News Travel News by Jim Corridore 3 Min. Apr 10, 2023 Insights Carvana Sees 50% Web Traffic Decline in March; Down 42% in Q1 While Most Peers Grow Automotive News by Jim Corridore 4 Min. Apr 6, 2023 Insights Yelp App Ranks 18th in Food & Drink, 353 Overall in U.S. Ecommerce News by Jim Corridore 4 Min. Apr 4, 2023 Insights Tesla Price Cut Drives Huge Increase In Sales Activity For Model Y and Model 3 Automotive News by Jim Corridore 3 Min. Mar 24, 2023 Insights Uber Dominates Bolt in the UK, with a 350% Lead in Monthly Active Users Travel News by Jim Corridore 4 Min. Mar 21, 2023 Show more Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Jim Corridore"
    },
    {
      "level": "H3",
      "text": "Cruises: April 2023 Web Traffic Growth Decelerates to 9% from 52% in Q1"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines"
    },
    {
      "level": "H3",
      "text": "Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months"
    },
    {
      "level": "H3",
      "text": "Airbnb Losing Market Share in Hotels and Accommodations Sector: US Web Traffic up 6% in Q1 Versus 18% Growth for Peer Group"
    },
    {
      "level": "H3",
      "text": "Tesla Misses on Q1 Revenues and Earnings – Similarweb Data Shows Why"
    },
    {
      "level": "H3",
      "text": "Similarweb Hotels and Accomodations Update: US Web Traffic up 18% in Q1; up 28% in March"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March"
    },
    {
      "level": "H3",
      "text": "Cruises: “2023 Wave Season”: Q1 Rose 52%, With All Cruise Lines Seeing Growth"
    },
    {
      "level": "H3",
      "text": "Carvana Sees 50% Web Traffic Decline in March; Down 42% in Q1 While Most Peers Grow"
    },
    {
      "level": "H3",
      "text": "Yelp App Ranks 18th in Food & Drink, 353 Overall in U.S."
    },
    {
      "level": "H3",
      "text": "Tesla Price Cut Drives Huge Increase In Sales Activity For Model Y and Model 3"
    },
    {
      "level": "H3",
      "text": "Uber Dominates Bolt in the UK, with a 350% Lead in Monthly Active Users"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": ""
}