{
  "url": "https://moz.com/blog/category/moz-tools/p11",
  "slug": "p11",
  "title": "Moz Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: David Mihm January 17, 2013 How I Use SEOmoz for Local Optimization Today Moz Tools As an SEOmoz PRO customer since the service launched in February 2007, I thought I’d give a quick little tour of how I’ve used SEOmoz’s existing tools for Local optimization in my consulting role at David Mihm, Inc. the past six years. I can’t wait to write Version Two of this post once we’ve got more specific Local functionality built! Read this post By: Carin Overturf January 11, 2013 January Mozscape Index is Live! Moz Tools The January Mozscape index is now live! Check out the fresh updates in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API. Read this post By: David Barts January 8, 2013 Visualizing Duplicate Web Pages Moz Tools Ever wonder how our dev team make decisions about updates? David Barts, our Custom Crawl and Development engineer, lays out how we used data visualization to test the effectiveness of a new duplicate-page heuristic (which is quite an exciting announcement!). Read this post By: Carin Overturf December 21, 2012 December Mozscape Index is Live! Moz Tools Happy Holidays!! The December Mozscape index is now live! The latest index has just been released and you will see fresh Mozscape data in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API. Read this post By: Carin Overturf November 28, 2012 Another November Index is Live! Moz Tools Our Big Data team is bringing you a special holiday treat this month: two Mozscape indices in the month of November! The second November index is now live, and you can find fresh Mozscape data in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API. Read this post By: George Andrews November 13, 2012 The Busy Developer's Guide to SEOmoz Bit Flags Moz Tools Mozscape is a combination of data and toolsets that provides link metrics for web sites and pages. The Mozscape API gives you access to these metrics. You can use the Mozscape API to provide clients with reports, to build useful tools, to track trends and gather statistics (BI), and much much more You can learn more about the Mozscape API on their website. Today I am going to focus on bit flags and will be using my personal website for all examples. Read this post By: Carin Overturf November 9, 2012 November Mozscape Index is Live! Moz Tools The November Mozscape index is now available! Check out the Mozscape data that is now fresh in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API. Read this post By: Rand Fishkin October 8, 2012 October's Mozscape Update Moz Tools It's that time of the month again! Mozscape's index is updated with fresh link information and Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API all have new data. This update featured some i... Read this post By: Rand Fishkin September 7, 2012 Using Followerwonk to Grow Your Twitter Account Whiteboard Friday | Moz Tools In this week's Whiteboard Friday, Rand speaks about using our Followerwonk tool to grow your Twitter account. Read this post By: Thomas McElroy September 6, 2012 Where Are My Rankings? Moz Tools The Riak nodes holding all of our rankings data had some issues that impacted the customer experience of rankings-data-related features. Here's the information on what happened and the steps we're taking to make it better now and in the future. Read this post By: Abe Schmidt September 5, 2012 Wednesday Webinar Series Moz Tools The Help Team is proud to announce a new weekly webinar series just for our community members: Wednesday Webinars! Read this post By: Andrew Dumont August 30, 2012 Following The Trend: Mozscape Gets Faster and Cleaner Moz Tools There's a trend emerging with Mozscape, and it's a good one. Updates are getting more regular and indexes are increasing in size. Today, we're happy to announce a few more awesome features to add to that list! Read this post By: Rand Fishkin August 14, 2012 Two Mozscape Updates in August! And More Info on Why PA/DA Fluctuate Moz Tools Just 14 short days ago, I wrote about the August Mozscape index update. Today, as part of our efforts to create shorter deltas between indices, I'm excited to announce that we have our fastest ever time between updates. There's new data right now in the Mozscape API (for which... Read this post By: Kenneth Martin August 14, 2012 Need Help with PRO? Introducing the Help Hub! Moz Tools At SEOmoz, we know that learning complex software applications can be time consuming and challenging, kind of like playing chess with a Wookie. Having well-written and comprehensive onboarding materials can help to decrease the learning curve, thus preventing droid dismemberment. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Tools"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Moz Tools"
    },
    {
      "level": "H2",
      "text": "How I Use SEOmoz for Local Optimization Today"
    },
    {
      "level": "H2",
      "text": "January Mozscape Index is Live!"
    },
    {
      "level": "H2",
      "text": "Visualizing Duplicate Web Pages"
    },
    {
      "level": "H2",
      "text": "December Mozscape Index is Live!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Another November Index is Live!"
    },
    {
      "level": "H2",
      "text": "The Busy Developer's Guide to SEOmoz Bit Flags"
    },
    {
      "level": "H2",
      "text": "November Mozscape Index is Live!"
    },
    {
      "level": "H2",
      "text": "October's Mozscape Update"
    },
    {
      "level": "H2",
      "text": "Using Followerwonk to Grow Your Twitter Account"
    },
    {
      "level": "H2",
      "text": "Where Are My Rankings?"
    },
    {
      "level": "H2",
      "text": "Wednesday Webinar Series"
    },
    {
      "level": "H2",
      "text": "Following The Trend: Mozscape Gets Faster and Cleaner"
    },
    {
      "level": "H2",
      "text": "Two Mozscape Updates in August! And More Info on Why PA/DA Fluctuate"
    },
    {
      "level": "H2",
      "text": "Need Help with PRO? Introducing the Help Hub!"
    }
  ],
  "author": "David Mihm\n          \n            Carin Overturf\n          \n            David Barts\n          \n            Carin Overturf\n          \n            Carin Overturf\n          \n            George Andrews\n          \n            Carin Overturf\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Thomas McElroy\n          \n            Abe Schmidt\n          \n            Andrew Dumont\n          \n            Rand Fishkin\n          \n            Kenneth Martin"
}