{
  "url": "https://moz.com/blog/category/moz-tools/p8",
  "slug": "p8",
  "title": "Moz Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: David Mihm July 21, 2015 Moz Local Officially Launches in the UK Local SEO | Moz Tools To all Moz Local fans in the UK, I'm excited to announce that your wait is over. As the sun rises \"across the pond\" this morning, Moz Local is officially live in the United Kingdom! Read this post By: Trevor Klein June 22, 2015 Your Daily SEO Fix: Week 5 SEO Basics | Moz Tools This is the fifth and final round-up of our 1-2 minute video tutorials to help you get the most out of Moz's tools. One last time, welcome back to your Daily SEO Fix! Read this post By: Rand Fishkin June 17, 2015 New Features in OSE's Spam Score & the Mozscape API Link Building | Moz Tools Introducing the Spam Score Histogram for Open Site Explorer. Visualize the distribution of potentially spammy links that show up in a site's link profile. Read this post By: Trevor Klein June 11, 2015 Your Daily SEO Fix: Week 4 SEO Basics | Moz Tools Here's the fourth round-up of our 1-2 minute video tutorials to help you get the most out of Moz's tools. Welcome back to your Daily SEO Fix! Read this post By: Trevor Klein June 4, 2015 Your Daily SEO Fix: Week 3 SEO Basics | Moz Tools Here's the third round-up of our 1-2 minute video tutorials to help you get the most out of Moz's tools. Welcome back to your Daily SEO Fix! Read this post By: Trevor Klein May 28, 2015 Your Daily SEO Fix: Week 2 SEO Basics | Moz Tools Last week, we began posting short video tutorials that help you all get the most out of Moz's tools. Today, we serve up five new videos in the second roundup of your Daily SEO Fix. Read this post By: Noam Chitayat May 27, 2015 Moz Local Dashboard Updates Moz Tools | Moz News Today, we're excited to announce some new features and changes to the Moz Local dashboard. We've updated your dashboard to make it easier to manage and gauge the performance of your local search listings. Read this post By: Trevor Klein May 21, 2015 Your Daily SEO Fix SEO Basics | Moz Tools We're excited to announce a new collection of video tutorials focused on tips and tricks with Moz tools, each in two minutes or less. Welcome to your Daily SEO Fix! Read this post By: David Mihm April 6, 2015 Check Your Local Business Listings in the UK Local SEO | Moz Tools | Moz News One of the most consistent refrains from the Moz community as we've released features over the last two years has been the desire to see Moz Local expand to countries outside the U.S. Today I'm pleased to announce that we’re embarking on our journey to global expansion with support for U.K. business listing searches in our Check Listing tool. Read this post By: Rand Fishkin April 3, 2015 Understanding and Applying Moz's Spam Score Metric Link Building | Moz Tools | Whiteboard Friday Since releasing the Spam Score feature in Open Site Explorer this week, a number of questions have come up about what it is and how to use it. In today's Whiteboard Friday, Rand takes the opportunity to clarify the answers to those questions. Read this post By: Nick Sayers April 1, 2015 Support 4.0: Using Snapchat for all of Moz's Support Branding | Moz Tools | Moz News Support 4.0 with Moz's new philosophy on using Snapchat for all customer inquiries. Read this post By: Rand Fishkin March 30, 2015 Spam Score: Moz's New Metric to Measure Penalization Risk Advanced SEO | Moz Tools Moz's Spam Score metric helps quantify the relative risk of penalization/banning by search engines using a series of correlated flags. This post helps explain where you can find Spam Score, how to use it, and the R&D behind its development. Read this post By: Rand Fishkin March 17, 2015 In-App Social & Contact Data - New in Open Site Explorer Link Building | Moz Tools We've just launched social accounts and contact data inside Open Site Explorer (initially in two sections), to help with link prospecting, analysis, and outreach. Discover more about how to use the feature and where to find it. Read this post By: Ellie Wilkinson February 12, 2015 How to Defeat Duplicate Content - Next Level Advanced SEO | Moz Tools Learn how to use Moz tools to identify and resolve duplicate content issues in this third installment of Next Level series. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Tools"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Moz Tools"
    },
    {
      "level": "H2",
      "text": "Moz Local Officially Launches in the UK"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Week 5"
    },
    {
      "level": "H2",
      "text": "New Features in OSE's Spam Score & the Mozscape API"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Week 4"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Week 3"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Week 2"
    },
    {
      "level": "H2",
      "text": "Moz Local Dashboard Updates"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix"
    },
    {
      "level": "H2",
      "text": "Check Your Local Business Listings in the UK"
    },
    {
      "level": "H2",
      "text": "Understanding and Applying Moz's Spam Score Metric"
    },
    {
      "level": "H2",
      "text": "Support 4.0: Using Snapchat for all of Moz's Support"
    },
    {
      "level": "H2",
      "text": "Spam Score: Moz's New Metric to Measure Penalization Risk"
    },
    {
      "level": "H2",
      "text": "In-App Social & Contact Data - New in Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "How to Defeat Duplicate Content - Next Level"
    }
  ],
  "author": "David Mihm\n          \n            Trevor Klein\n          \n            Rand Fishkin\n          \n            Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein\n          \n            Noam Chitayat\n          \n            Trevor Klein\n          \n            David Mihm\n          \n            Rand Fishkin\n          \n            Nick Sayers\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Ellie Wilkinson"
}