{
  "url": "https://www.similarweb.com/blog/insights/software-tech-news/monday-workplace-productivity/",
  "slug": "monday-workplace-productivity",
  "title": "Monday.com Grew Traffic 19% to 75.6 Million Visits in Q4 | Similarweb",
  "description": "Of the popular workplace productivity apps, Monday.com is holding up better than most in the face of company cost cutting. Click to see how",
  "content": "HomeBlogInsightsSoftware & Technology NewsMonday.com Grew Traffic 19% to 75.6 Million Visits in Q4 Insights Monday.com Grew Traffic 19% to 75.6 Million Visits in Q4 Start your free trial by David F. Carr 3 Min. February 8, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Of the popular cloud applications for workplace productivity, Monday.com is holding up better than most as economic pressures lead companies to reexamine their application portfolios and look for ways to cut costs. Monday.com is scheduled to report fourth quarter and fiscal year 2022 earnings on Monday, February 13. An analysis by Similarweb Investor Intelligence finds that Monday.com continues to show strength, even in the face of stiff competition and tough prior-year comparisons. Key takeaways Monday.com traffic grew by 19% year-over-year in Q4, while some competitors were shrinking. For example, traffic to trello.com was down 8.4%, traffic to asana.com was down 6.1%, and traffic to slack.com was down 3.4% over the same period. For the trailing 12 months that ended in January, traffic to Monday.com was up 27%, year over year, to 316 million. Monday.com shows growth in key metrics “Monday’s position as a relatively economical, multi-use solution may be a boon in a pressured spending environment as businesses re-evaluate their SaaS stack in search of cost cuts,” Similarweb analysts wrote in a Q4 research summary. Monday.com Self-Service Trial Activations “Collaboration software was among the first subsectors to face the impact of seat and vendor consolidation, which began in earnest in 3Q21,” the researchers wrote. As a result, Monday.com and its peers now face tougher comparisons with prior year periods. Despite that, Monday.com is one of a handful of these collaboration platforms that continues to show strong user growth. Monday.com is one of a handful of digital collaboration services growing traffic while many competitors have stalled Digital collaboration is a complex and crowded market, so deciding which other companies Monday.com should be compared with is a challenge all by itself. But Monday.com is seeing stronger traffic growth than, for example, either Slack (now part of Salesforce) or Trello (owned by Atlassian), or Asana. Notion is showing stronger growth, but that’s partly a factor of its status as a personal productivity app as well as a collaboration tool. Read more: Notion Tops the Ranks of Collaboration and Productivity Tools Room to grow Ranked by total traffic, Monday.com lags some established work management competitors like Slack, Trello, and Asana, as well as the upstart personal productivity and collaboration app Notion, but is more popular than Miro, Airtable, and Smartsheet. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. Image by nneem from Pixabay by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Software & Technology News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights WordPress.com and WP Engine Fight Over a Shrinking Pie Software & Technology News by David F. Carr 4 Min. Oct 1, 2024 Insights T-Mobile Acquires Mint Mobile – 2022’s Fastest-Growing US Mobile Service Provider Software & Technology News by Sneha Pandey 3 Min. Mar 30, 2023 Insights Digital 100 Technology & Services Winner: Snipfeed Software & Technology News by David F. Carr 3 Min. Jan 25, 2023 Insights Game Over: Google Shutting Down Stadia Software & Technology News by Sneha Pandey 3 Min. Sep 30, 2022 Insights SMB Cloud Software on the Rebound Software & Technology News by David F. Carr 3 Min. Sep 23, 2022 Insights Why Adobe Was Attracted to Fast-Growing Figma Software & Technology News by David F. Carr 3 Min. Sep 19, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Monday.com Grew Traffic 19% to 75.6 Million Visits in Q4"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Monday.com shows growth in key metrics"
    },
    {
      "level": "H3",
      "text": "Monday.com Self-Service Trial Activations"
    },
    {
      "level": "H2",
      "text": "Monday.com is one of a handful of digital collaboration services growing traffic while many competitors have stalled"
    },
    {
      "level": "H2",
      "text": "Room to grow"
    },
    {
      "level": "H3",
      "text": "WordPress.com and WP Engine Fight Over a Shrinking Pie"
    },
    {
      "level": "H3",
      "text": "T-Mobile Acquires Mint Mobile – 2022’s Fastest-Growing US Mobile Service Provider"
    },
    {
      "level": "H3",
      "text": "Digital 100 Technology & Services Winner: Snipfeed"
    },
    {
      "level": "H3",
      "text": "Game Over: Google Shutting Down Stadia"
    },
    {
      "level": "H3",
      "text": "SMB Cloud Software on the Rebound"
    },
    {
      "level": "H3",
      "text": "Why Adobe Was Attracted to Fast-Growing Figma"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}