{
  "url": "https://www.similarweb.com/blog/insights/software-tech-news/notion-productivity-collaboration/",
  "slug": "notion-productivity-collaboration",
  "title": "Notion Tops the Ranks of Collaboration and Productivity Tools | Similarweb",
  "description": "The Notion app for personal productivity and team collaboration has grown into a runway winner in web traffic, beating alternatives like Evernote and Trello",
  "content": "HomeBlogInsightsSoftware & Technology NewsNotion Tops the Ranks of Collaboration and Productivity Tools Insights Notion Tops the Ranks of Collaboration and Productivity Tools Start your free trial by David F. Carr 4 Min. August 29, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The Wall Street Journal called Notion “the Do-It-Yourself Productivity App Gen Z Is Going Gaga Over” – although we know Boomers and folks from other generations who are similarly impressed by its fun visual design and flexibility. The private company behind Notion is enjoying being cash flow positive and able to make acquisitions at a time when the free flow of venture capital money has slowed. Here are some measures of how this mashup of a wiki, a database, a business collaboration tool, and a personal productivity and note-taking tool has captured the web’s love and attention. Key takeaways Traffic to notion.so was up 40% year over year in July to 123 million visits, according to Similarweb estimates. That’s a slight slowdown from the triple-digit traffic gains of 2021, but it’s four times the traffic flowing to evernote.com, the site of an established leader in the note-taking/personal organizer software category. Traffic to the onboarding segment of notion.so, a good place to track the influx of new users getting oriented on how to use Notion, continues to grow by double-digits, year over year – although no longer at the triple-digit rates of late 2020 to early 2021. Desktop traffic to the onboarding page was up 12.6% year over year in July. As of July 2022, notion.so was attracting more traffic than other online collaboration tools such as slack.com, trello.com, asana.com, and many other SaaS domains for communication and collaboration apps. The growth story on mobile is not as clear. On Android, the metrics for daily active users were flat to down slightly for Notion in July – although competitor Evernote has seen steadier erosion of its audience, with daily active users down nearly 20% in July. Rapid ascent in web traffic Web traffic to notion.so has been climbing steadily, representing both new and prospective user visits and active use of the application. Notion has desktop clients for Windows and Mac, as well as for mobile, but can also be used as a browser-based app – making it convenient for those who sign in from work and home, using both personal and company-owned devices. Although Notion has ambitions as an enterprise online collaboration tool for teams, one of the things that have made it popular is its wealth of tools for both personal productivity and professional organization and planning. Competitors often mentioned as similar to Notion barely register on the chart above. Flexible and powerful Notion makes it easy to store and organize information in many different ways. During the research for this report, we used it to capture clippings about the app (and other topics) from many different sources. A standout among SaaS Collaboration apps Notion’s ascent also compares favorably to many other collaboration and productivity app domains, as of July ranking ahead of trello.com, asana.com, and monday.com, as well as slightly ahead of slack.com (not shown on the chart below because Similarweb classifies it as Communication rather than Collaboration). New user onboarding growing, but more slowly There are multiple ways of signing up for Notion, but every new desktop user lands on a set of onboarding pages providing examples of all the ways the tool can be put to work. The traffic growth story for this segment is also impressive (Similarweb Platform users can see it here). In late 2020 and early 2021, year-over-year traffic gains often topped 200% or even 300%. Those days are gone, but onboarding traffic still grew nearly 40% in February, and in July the year-over-year gain was 12.6%. Numbers are not as favorable on mobile Perhaps because it performs so well on the desktop, where the user has the opportunity to spread out and see more of the content they’ve gathered at a glance, Notion seems to be struggling to achieve performance as strong on mobile. On Android, Evernote still claims more than four times as many daily active users, even though for Evernote that active audience seems to be declining. By year-over-year comparisons, the DAU trend for Notion has been as positive as a 114% gain in daily active users in January and as negative as a 46% drop in April. In July, the trend in daily active users was essentially flat (down 0.07%) – at about 182,00, compared with over 759,000 for Evernote. Still winning fans after years of growth Notion has been on the market for six years, growing slowly but steadily. Within the timeframe we studied, it posted year-over-year traffic gains of over 100% and some months over 350% from Aug. 2020 to November 2021. More recently, growth has decelerated a bit, but traffic was still up 41% in July, much more than for its competition. Worth noting. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Citation: Please refer to Similarweb as a digital intelligence platform. If online, please link back to www.similarweb.com or the most relevant blog post. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. Image by Team Nocoloco on Unsplash by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Software & Technology News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights WordPress.com and WP Engine Fight Over a Shrinking Pie Software & Technology News by David F. Carr 4 Min. Oct 1, 2024 Insights T-Mobile Acquires Mint Mobile – 2022’s Fastest-Growing US Mobile Service Provider Software & Technology News by Sneha Pandey 3 Min. Mar 30, 2023 Insights Monday.com Grew Traffic 19% to 75.6 Million Visits in Q4 Software & Technology News by David F. Carr 3 Min. Feb 8, 2023 Insights Digital 100 Technology & Services Winner: Snipfeed Software & Technology News by David F. Carr 3 Min. Jan 25, 2023 Insights Game Over: Google Shutting Down Stadia Software & Technology News by Sneha Pandey 3 Min. Sep 30, 2022 Insights SMB Cloud Software on the Rebound Software & Technology News by David F. Carr 3 Min. Sep 23, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Notion Tops the Ranks of Collaboration and Productivity Tools"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Rapid ascent in web traffic"
    },
    {
      "level": "H2",
      "text": "Flexible and powerful"
    },
    {
      "level": "H2",
      "text": "A standout among SaaS Collaboration apps"
    },
    {
      "level": "H2",
      "text": "New user onboarding growing, but more slowly"
    },
    {
      "level": "H2",
      "text": "Numbers are not as favorable on mobile"
    },
    {
      "level": "H2",
      "text": "Still winning fans after years of growth"
    },
    {
      "level": "H3",
      "text": "WordPress.com and WP Engine Fight Over a Shrinking Pie"
    },
    {
      "level": "H3",
      "text": "T-Mobile Acquires Mint Mobile – 2022’s Fastest-Growing US Mobile Service Provider"
    },
    {
      "level": "H3",
      "text": "Monday.com Grew Traffic 19% to 75.6 Million Visits in Q4"
    },
    {
      "level": "H3",
      "text": "Digital 100 Technology & Services Winner: Snipfeed"
    },
    {
      "level": "H3",
      "text": "Game Over: Google Shutting Down Stadia"
    },
    {
      "level": "H3",
      "text": "SMB Cloud Software on the Rebound"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}