{
  "url": "https://ahrefs.com/blog/it/analisi-competitiva-parole-chiave/",
  "slug": "analisi-competitiva-parole-chiave",
  "title": "Analisi Competitiva delle Parole Chiave: Come Trovare le Parole Chiave dei Tuoi Concorrenti",
  "description": "L’analisi competitiva delle parole chiave è il processo che si occupa di identificare parole chiave rilevanti e di valore per le quali i tuoi concorrenti sono posizionati ma tu non lo sei.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Se i tuoi concorrenti sono proattivi con la SEO, probabilmente sono posizionati per parole chiave per le quali tu non lo sei.Anche se questo può sembrare negativo, in realtà, è qualcosa che puoi sfruttare a tuo vantaggio.Se i tuoi concorrenti hanno condotto una ricerca parole chiave e trovato argomenti che tu hai mancato, hanno fatto il lavoro duro al tuo posto. Puoi identificare nuove parole chiave semplicemente conducendo un’analisi competitiva.Ecco cosa imparerai in questo articolo:Cos’è l’analisi competitiva delle parole chiave?Perché dovresti condurne una?Come analizzare le parole chiave dei concorrentiCos’è l’analisi competitiva delle parole chiave?L’analisi competitiva delle parole chiave è il processo che si occupa di identificare parole chiave rilevanti e di valore per le quali i tuoi concorrenti sono posizionati ma tu non lo sei.Perché dovresti condurne una?Se i tuoi concorrenti fanno leva su parole chiave rilevanti e ottengono traffico da esse, queste sono pertinenti anche alla tua attività.Come analizzare le parole chiave dei concorrentiIl processo di analisi competitivo delle parole chiave è più o meno lo stesso sia che tu stia cercando nuovi argomenti da coprire o buchi in quelli esistenti.In questa sezione, ci concentreremo sullo scoprire nuovi argomenti di cui parlare.(Passa direttamente alla prossima sezione se vuoi solo trovare delle mancanze nei contenuti esistenti). Identifica i concorrentiUtilizza un tool di content gapCerca argomenti di valore per teValuta la difficoltà di posizionamento1. Identifica i concorrentiAnche se hai già un’idea di chi siano i concorrenti per la tua attività, è importante sapere che i concorrenti a livello di mercato non sempre coincidono con i concorrenti a livello di ricerca. Quando stai cercando di identificare contenuti rilevanti e di valore di cui parlare, è meglio analizzare la seconda categoria.Per illustrate le differenze fra i concorrenti a livello di mercato e di ricerca, considera ad esempio noi e backlinko.com. Noi guadagnamo vendendo strumenti per la SEO, mentre Brian Dean, il fondatore di Backlinko, guadagna vendendo corsi SEO. Nonostante lui non sia quindi un nostro concorrente a livello di mercato, lo è per quanto riguarda molte parole chiave, in quanto lottiamo per ottenere l’attenzione dello stesso pubblico.Ecco tre semplici metodi per identificare i concorrenti online.a) Conduci una ricerca su Google con ‘related’Related: è un operatore di ricerca Google che trova siti simili al tuo. Cerca related:iltuositoweb.comNota a margine.Va bene anche utilizzare una sottocartella o un sottodominio se cerchi concorrenti per una determinata sezione del tuo sito o blog.Questo metodo non sempre funziona. Se il tuo sito è piuttosto nuovo e non si posiziona per molte parole chiave, potresti ottenere pochi risultati. In ogni caso, assicurati di verificare i siti identificati manualmente prima di procedere al prossimo step. Se però quelli proposti da Google non ti sembrano validi concorrenti, ignorali e vai al passo successivo.b) Trova siti con parole chiave che si sovrappongono alle tueInserisci il tuo sito nel Site Explorer di Ahrefs e vai nel report Domini concorrenti. Ogni sito proposto si posiziona nei primi 10 posti per alcune delle tue stesse parole chiave, con quelli in alto che presentano il numero maggiore.Nota che anche questa tecnica non funziona benissimo se il tuo sito è nuovo e non si posiziona per molte parole chiave, in quanto cerca di identificare parole chiave in comune fra diversi domini. Non possono esserci parole chiave che si sovrappongono se il tuo sito non si posiziona per nulla.c) Trova siti che si posizionano per parole chiave per te di valoreSe nessuno dei metodi qui sopra porta buoni risultati, quello che puoi fare è inserire alcune parole chiave per te rilevanti e di valore all’interno del Keyword Explorer di Ahrefs e controllare il report chiamato Traffic Share by Domains. Questo identifica i siti che ottengono la maggior quantità stimata di traffico organico dalle parole chiave da te inserite.Questo metodo è il miglior approccio se:Il tuo sito ancora non si posiziona per molte parole chiaveStai cercando di identificare i concorrenti su degli specifici argomentiAd esempio, dato che i contenuti del nostro blog parlano principalmente di SEO, i metodi qui sopra tendono a identificare altri blog che trattano lo stesso argomento. Questo va bene se stiamo cercando buchi da coprire nella tematica della SEO, ma abbiamo recentemente iniziato a parlare anche di content marketing e blog. Per identificare i concorrenti per queste tematiche, potremmo inserire parole chiave come ‘content marketing’, ‘strategia contenuti’ e ‘calendario editoriale’ nel Keyword Explorer che identificare i siti che ottengono maggior traffico dalla ricerca organica.2. Utilizza uno strumento di content gapUno strumento di content gap serve a identificare parole chiave per la quali altri siti si posizionano ma non tu. La maggior parte degli strumenti SEO ne ha uno, ma dato che stai leggendo il nostro blog, ti mostreremo come funziona quello di Ahrefs.Ecco il processo:Inserisci il tuo sito all’interno del Site Explorer di Ahrefs e recati poi sullo strumento Gap di Contenuto.Inserisci i tuoi concorrenti dove c’è scritto “Mostra le parole chiave per le quali si posizionano gli obiettivi sottostanti”.Premi “Mostra le parole chiave” per vedere i risultati.Parole chiave per le quali i nostri concorrenti, ma non noi, sono posizionati.Se ti sembrano esserci troppe parole chiave da analizzare o alcune non ti sembrano tematicamente attinenti, gioca con il numero di intersezioni per vedere solo le parole chiave per cui un determinato numero di concorrenti si posiziona.PRO TIPSe vuoi vedere solo le parole chiave per cui i concorrenti si posizionano con una determinata sezione del loro sito, inserisci un sottodominio o una sottocartella al posto del dominio principale. Ad esempio, se stessimo conducendo un’analisi competitiva della parole chiave per il blog di Ahrefs, potremmo inserire concorrenti come Backlinko o Moz. Ma dato che siamo solamente interessati alla parte blog, dovremmo utilizzare moz.com/blog invece di moz.com per vedere tutte le URL che includono quello specifico prefisso.3. Cerca argomenti di valore per teÈ difficile che tu voglia posizionarti per qualsiasi argomento trattato dai tuoi concorrenti. Ecco alcune cose da tenere a mente quando scegli le parole chiave:a) Valore per la tua aziendaIl valore per la tua azienda è un punteggio che rappresenta il “valore” che quella parola chiave ha per la tua attività. Si tratta di un giudizio da dare. Chiediti quanto sia probabile che chi cerca quel determinato argomento diventi tuo cliente. Più alta è la probabilità, più lo è il “valore per la tua azienda” che ha tale parole chiave.Ad esempio, se vendi parti di computer, il ‘valore per la tua azienda’ di parole chiave come ‘hard drive 1tb vendita’ sarà piuttosto alto. D’altro canto, sarà piuttosto basso per qualcuno che cerca ‘cos’è un computer’, in quanto probabilmente non si tratta di utenti che vogliono costruirsene uno da soli.Noi di Ahrefs, assegnamo ad ogni parole chiave un valore compreso fra 0 e 3 per semplificarci il lavoro.b) Volume di ricercaIl volume di ricerca rappresenta il numero medio che una determinata parola chiave viene ricercata nel corso di un mese. Come regola generale, maggiore è il volume di ricerca, maggiore è il potenziale di traffico di un dato argomento. Nel report del Gap di Contenuto, c’è una specifica colonna per il volume di ricerca di fianco alla parola chiave.c) Potenziale di traffico organicoGuarda il volume di ricerca per questa parola chiave a confronto con il traffico stimato della pagina meglio posizionata per essa:Nonostante la parola chiave ottenga circa 7,2k ricerche al mese, la pagina meglio posizionata ottiene quasi 25x volte di traffico organico. Questo in quanto si posiziona per altre migliaia di parole chiave correlate, conosciute come parole chiave a coda lunga. Molte di queste sono solo modi meno popolari per ricercare la stessa cosa.Dare uno sguardo al traffico organico che le pagine meglio posizionate ottengono, è un modo molto più affidabile di giudicare il potenziale di una parola chiave rispetto al solo volume di ricerca. Consigliamo sempre di controllare questo dato prima di decidere se scegliere o meno una determinata parola chiave.Per fare questo con il lo strumento Content Gap, premi il bottone chiamato SERP e analizza la colonna relativa al traffico.4. Valuta la difficoltà di posizionamentoNon è sempre facile posizionarsi per le stesse parole chiave dei concorrenti. Ci sono molte ragioni per cui loro potrebbero posizionarsi più facilmente per una parola chiave rispetto a te. Quindi, prima di scegliere una parola chiave di getto, dovresti sempre analizzarne la difficoltà.La metrica chiamata Keyword Difficulty (KD) in Ahrefs dovrebbe essere abbastanza per fornirti un’idea della difficoltà. Puoi vederla nel report del Content Gap.Ma non dovresti affidarti esclusivamente a tale metrica o quella di qualsiasi altro strumento.Ecco altre tre cose da prendere in considerazione:1. Intento di ricercaL’intento di ricerca è il motivo per il quale le persone cercano una determinata parola chiave.Stanno cercando informazioni?Vogliono acquistare qualcosa?Stanno cercando un sito in particolare?Se il tuo contenuto non si allinea con l’intento di ricerca, le tue possibilità di posizionarti sono poche se non nulle.Google comprende l’intento di ricerca meglio di chiunque altro, quindi le pagine meglio posizionate fungono da filtro per comprendere l’intento di ricerca giusto.Ad esempio, tutti i risultati per “velocizzare windows 10” (o “speed up windows 10” in inglese) sono degli articoli di blog in formato elenco, mentre quelli per “corsair k70” sono tutte pagine prodotto da siti di ecommerce.I risultati per “velocizzare windows 10” (o “speed up windows 10” in inglese) sono tutti elenchi.I risultati per “corsair k70” sono tutte pagine prodotto.Sappi che a meno che non ci sia valore per te nel pubblicare dei contenuti che si allineino con l’intento di ricerca, non ha molto senso avere quella parola chiave come obiettivo. Ad esempio, se hai un blog che parla di computer, non ha molto senso avere come obiettivo una parola chiave come “corsair k70”, in quanto chi ricerca vuole compiere un acquisto. E non puoi avere una pagina prodotto su di un blog.Lettura consigliata: Cos’è l’Intento di Ricerca? Una Guida Completa per Principianti2. Autorevolezza del sitoJohn Mueller ha dichiarato pubblicamente che non utilizzano alcuna metrica relativa all’autorevolezza di un sito nei loro algoritmi.We don’t use domain authority. We generally try to have our metrics as granular as possible, sometimes that’s not so easy, in which case we look at things a bit broader (eg, we’ve talked about this in regards to some of the older quality updates).— 🍌 John 🍌 (@JohnMu) April 16, 2019 Non utilizziamo la domain authority. Generalmente facciamo in modo che le nostre metriche siano il più granulari possibile, talvolta non è semplice, ed in questi casi ci teniamo più larghi (es. Ne abbiamo parlato riguardo alcuni vecchi update che riguardavano la qualità).Ad ogni modo, i professionisti del settore sono divisi su questo fronte—alcuni credono che Google non sia esattamente trasparente. È indubbiamente semplice capire perchè quando si vedono i risultati per alcune parole chiave dominati quasi esclusivamente da alcuni brand.Ad Ahrefs, abbiamo una metrica chiamata Domain Rating (DR) che rappresenta il punteggio di autorevolezza di un sito in base alla forza del suo profilo backlink. Questo non viene preso in considerazione nel calcolo del KD ma, di norma, potresti avere più difficoltà a posizionarti per parole chiave dove sono presenti molti siti con un valore DR molto superiore al tuo.Puoi vedere il punteggio DR per i siti meglio posizionati nell’anteprima della SERP.Puoi vedere la DR del suo sito nel Site Explorer o utilizzando il nostro strumento gratuito per la verifica dell’autorevolezza.Lettura consigliata: Come Migliorare l’Autorevolezza del Tuo Sito (e il suo Domain Rating)3. Link di alta qualità provenienti da altri sitiI backlink sono un fattore di posizionamento ben noto.La Keyword Difficulty (KD) tiene conto del numero di link in entrata verso le pagine meglio posizionate, ma non della loro qualità. Vale quindi la pena controllare il profilo backlink delle pagine meglio posizionate prima di attaccare una parola chiave. Potresti scoprire come solitamente anche se una pagina riceve molti link, tanti di questi sono di bassa qualità—in questo caso è semplice posizionarsi meglio di questa pagina di quanto avevi inizialmente pensato.Ad esempio, guarda ai primi due risultati per “miglior stampante per casa” (o “best home printer” in inglese)—che ha un punteggio KD di 60: Sembrerebbe molto complicato competere in quanto la pagina meglio posizionata ha link da molti siti. Ma se verifichiamo i backlink con il Site Explorer di Ahrefs, possiamo notare come molti siano di bassa qualità o nofollow.Se vuoi far combaciare la tua pagina al giusto intento di ricerca e il tuo sito è abbastanza autorevole, probabilmente non avrai bisogno di così tanti link di qualità per posizionarti meglio di questa pagina.CONSIGLIO DA ESPERTIAnche se posizionarsi per una data parola chiave può sembrare difficile, non significa che non dovresti provarci. Devi solo essere realistico e dividere le parole chiave come obiettivi a lungo, medio e corto termine.Come condurre un’analisi competitiva delle parole chiave a livello di paginaCondurre un’analisi competitiva delle parole chiave a livello di pagina (invece che di dominio) può aiutarti a identificare dei buchi nei contenuti esistenti. Questi sono i casi in cui la tua pagina fallisce nel coprire un qualcosa che l’utente potrebbe voler sapere. Sistemare queste mancanze può aiutarti a:Posizionarti per un maggior numero di parole chiave a coda lungaPosizionarti meglio per la tua parola chiave principaleAd esempio, se guardiamo ai risultati meglio posizionati per “guest blogging”, la maggior parte di questi include una definizione.Sfortunatamente, noi non l’abbiamo inclusa nella nostra guida al guest blog. A meno che non copriamo quel ‘buco’, sarà difficile per noi posizionarci in alto per la parola chiave principale. E sicuramente non ci posizioneremo per parole chiave a coda lunga come “cos’è il guest blog” perché l’articolo non risponde alla domanda.Ma prima di sistemare le mancanze nei contenuti esistenti, devi trovarle… e puoi farlo utilizzando più o meno lo stesso processo che abbiamo visto sopra. La differenza principale sta nel fatto che devi condurre le analisi a livello di pagina.Quindi il primo passo da compiere è trovare le pagine che competono con noi in uno di questi modi: Cerca su Google la tua parola chiave principale.Le pagine meglio posizionate sono i tuoi concorrenti. Utilizza il report chiamato “Traffic share by pages” nel Keywords Explorer. Inserisci alcune parole chiave, fai poi click su “By pages” all’interno della sezione “Traffic share” nel menù a sinistra.Da lì, inserisci le URL dei tuoi concorrenti nello strumento per Content Gap e assicurati che la modalità sia impostata su “URL”. Rimuovi il tuo sito dalla sezione in basso e lascia il campo vuoto (solitamente si ottengono migliori risultati in questo modo).Molte delle parole chiave che vedrai saranno probabilmente altri modi per cercare la stessa cosa. Non preoccuparti di queste. Cerca le parola chiave che rappresentano delle sotto tematiche di cui sai di esserti dimenticato nel tuo contenuto.Non è necessario verificare la difficoltà per queste sotto tematiche; ti basta aggiungere nuove sezioni al tuo contenuto per riempire i vuoti.ConclusioniNon è una cattiva idea quella di ripetere un’analisi competitiva delle parole chiave una volta ogni tanto. È un ottimo modo per trovare argomenti a cui non hai pensato.In alternativa, una volta che sai chi sono i tuoi concorrenti, puoi impostare un alert per monitorare le nuove parole chiave per cui si posizionano—per le quali potresti farlo anche tu. A questo scopo, inserisci un nuovo alter per le parole chiave all’interno di Ahrefs Alerts. Inserisci un concorrente, scegli un Paese, il volume di ricerca, la frequenza degli alert, e sei a posto.Monitorare le nuove parole chiave per le quali i concorrenti si posizionano con Ahrefs Alerts.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Analisi Competitiva delle Parole Chiave: Come Trovare le Parole Chiave dei Tuoi Concorrenti"
    },
    {
      "level": "H2",
      "text": "Cos’è l’analisi competitiva delle parole chiave?"
    },
    {
      "level": "H2",
      "text": "Perché dovresti condurne una?"
    },
    {
      "level": "H2",
      "text": "Come analizzare le parole chiave dei concorrenti"
    },
    {
      "level": "H3",
      "text": "1. Identifica i concorrenti"
    },
    {
      "level": "H4",
      "text": "a) Conduci una ricerca su Google con ‘related’"
    },
    {
      "level": "H4",
      "text": "b) Trova siti con parole chiave che si sovrappongono alle tue"
    },
    {
      "level": "H4",
      "text": "c) Trova siti che si posizionano per parole chiave per te di valore"
    },
    {
      "level": "H3",
      "text": "2. Utilizza uno strumento di content gap"
    },
    {
      "level": "H3",
      "text": "3. Cerca argomenti di valore per te"
    },
    {
      "level": "H4",
      "text": "a) Valore per la tua azienda"
    },
    {
      "level": "H4",
      "text": "b) Volume di ricerca"
    },
    {
      "level": "H4",
      "text": "c) Potenziale di traffico organico"
    },
    {
      "level": "H3",
      "text": "4. Valuta la difficoltà di posizionamento"
    },
    {
      "level": "H4",
      "text": "1. Intento di ricerca"
    },
    {
      "level": "H4",
      "text": "2. Autorevolezza del sito"
    },
    {
      "level": "H4",
      "text": "3. Link di alta qualità provenienti da altri siti"
    },
    {
      "level": "H2",
      "text": "Come condurre un’analisi competitiva delle parole chiave a livello di pagina"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}