{
  "url": "https://ahrefs.com/blog/it/audit-contenuti/",
  "slug": "audit-contenuti",
  "title": "Come fare Un Audit Dei Contenuti Perfetto (Template Incluso)",
  "description": "Scopri nostro processo per fare un audit dei contenuti, che prevede la rivisitazione delle pagine con prestazioni basse.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Non tutti i post che pubblichi avranno successo.Anche se metti tutto il tuo cuore e l’anima nei tuoi contenuti, spesso non riuscirai a posizionarti, a convertire o a portare risultati alla tua attività. È frustrante.Ma non devi lasciare che queste pagine muoiano di una morte lenta e dolorosa. Puoi rivisitarle, capire cosa è andato storto e muoverti per migliorare le loro prestazioni. Questo è in poche parole cosa fa un content audit ed è una parte fondamentale di una strategia di contenuti di successo.Vediamo come realizzarne uno utilizzando il nostro template per l’audit dei contenuti e il processo interattivo.ContenutiPer WordPressIl nostro plugin SEO per WordPress automatizza e gestisce molti dei passaggi del processo riportato di seguito.Come fare un audit dei contenuti di un sito (il nostro processo)L’audit dei contenuti è pressoché sempre lo stesso e consiste nel cercare di capire se c’è qualcosa che frena i tuoi contenuti e come puoi migliorarli. Per farlo, hai bisogno di questi tre elementi:Un elenco di pagine web/URL da controllareUna solida* checklist per il controllo dei contenutiLo strumento perfetto per l’auditNota a margine. *Non posso non sottolineare quanto questo sia importante. La maggior parte dei processi di audit dei contenuti sono troppo semplici. Non inseriscono dati sufficienti e questo può portare a dei suggerimenti sbagliati.Puoi trovare URL gratuitamente e facilmente con un account su Ahrefs Webmaster Tools (AWT). Basta eseguire la scansione del tuo sito web con Site Audit, andare alla scheda “Bulk export” ed esportare “Internal HTML URLs, status code 200”.Puoi quindi semplicemente copiare e incollare gli URL (colonna “URL”) nel nostro template per il content audit:Detto questo, se hai migliaia di pagine, può richiedere molto tempo sottoporle tutte ad un audit. Tiu consiglio di seguire la regola 80/20 e di controllare il 20% delle pagine con il traffico organico o i backlink più importanti. Probabilmente otterrai l’80% dei risultati in questo modo.Troverai colonne per i backlink e il traffico organico stimato anche nell’esportazione di Site Audit. Basta copiarli e incollarli nel template, quindi filtrare per le pagine che soddisfano i requisiti minimi di traffico organico e backlink.Vuoi lavorare con numeri di traffico “reali”?Esporta i dati da Google Search Console (Prestazioni > Risultati della ricerca) e inserisci nel template per il content audit.A questo punto devi solo controllare le tue pagine seguendo il nostro processo interattivo per il controllo dei contenuti.Ecco come usarlo:1. Apri il processo in modalità Presenter (presentatore). (Puoi chiudere la finestra di visualizzazione come relatore.)2. Segui il processo per ogni pagina rispondendo alle domande con sì/no. Il processo cosa fare in base alle tue risposte. (Se non sai come rispondere, clicca su collegamento “Come controllare questo parametro?” per istruzioni.)3. Registra le azioni consigliate per ciascuna pagina selezionando le caselle di controllo nel foglio di calcolo del content audit. Ad esempio, se un consiglio è di aggiungere link interni e creare più backlink, seleziona quelle caselle.Una volta terminato, implementa le modifiche o passa il content audit ad un’altra persona del tuo team o ad un/una consulente. Ogni azione è collegata a un SOP o a una guida per semplificarne l’esecuzione.Di seguito sono riportate le domande che troverai nel nostro processo di controllo dei contenuti.Vuoi controllare i tuoi contenuti in blocco?Se utilizzi WordPress, il nostro plugin SEO automatizza molti (ma non tutti) i seguenti passaggi. In caso contrario, dovrai inserire tutti i dati in un foglio di calcolo e creare una logica per i consigli utilizzando il flusso di lavoro per l’audit dei contenuti.Se ti stai chiedendo perché non abbiamo creato noi stessi questo modello di controllo dei contenuti, è perché è praticamente impossibile farlo funzionare per tutti, poiché ognuno ha una configurazione leggermente diversa.Inoltre, estrarre dati da più fonti diventa davvero complicato rapidamente e piccole modifiche alle esportazioni o alla formattazione spesso causano problemi.La pagina riceve traffico organico?Vai al rapporto sui risultati di ricerca in Google Search Console e filtra per la pagina. Vedrai quanti clic ha ottenuto dalla ricerca organica negli ultimi 3 mesi.Se non hai configurato Search Console (suggerimento: dovresti, è gratuito), puoi inserire la pagina nel Site Explorer di Ahrefs o nel nostro strumento di controllo del traffico gratuito per una stima approssimativa.La pagina riceve traffico da un’altra fonte?Solo i tuoi dati possono rispondere a questa domanda.Se utilizzi Google Analytics, nel tuo account Google Analytics vai su Report > Ciclo di vita > Coinvolgimento > Pagine e schermate. Da qui, puoi filtrare una pagina particolare aggiungendo un filtro “Percorso pagina e classe schermata” e incollando lo slug dell’URL.Questo ti dirà se la pagina riceve traffico da fonti organiche o da altre fonti.Nota a margine. Se non utilizzi Google Analytics, puoi estrarre dati analitici da altri strumenti di analisi.La pagina è destinata principalmente alla ricerca organica?Abbastanza semplice. Se lo scopo principale della pagina è posizionarsi sui motori di ricerca, la risposta a questa domanda è “sì”. Se non è questo il motivo per cui hai creato la pagina, la risposta è “no”.La pagina è utile per un altro scopo?Non tutte le pagine necessitano di traffico per giustificare la propria esistenza. Ecco alcuni esempi di pagine che probabilmente dovrai sempre mantenere indipendentemente da quanto traffico ottengono:Termini di servizioPrivacyDisclaimerPagine di categoria o tagLanding page per PPC o emailTutto ciò che aiuta con le conversioni o la navigazione in altri modi (testimonianze, link dai social, etc.)Questo non è un elenco completo, ma rende l’idea.La pagina ha dei backlink?Inserisci l’URL nel Site Explorer di Ahrefs e controlla quanti domini di riferimento (collegamenti da siti esterni) ha:Se questo numero è superiore a zero, la pagina ha backlink.Nota a margine. Puoi anche usare il nostro tool gratuito per il controllo dei backlink per fare questo.La pagina è scansionabile e indicizzabile?Google non può indicizzare le pagine che non sono indicizzabili e le pagine che non sono sottoponibili a scansione vengono raramente indicizzate. Il modo più semplice per verificare a campione entrambe queste cose è con lo strumento Controllo URL in Google Search Console.Ecco cosa vuoi vedere nella scheda “Indicizzazione della pagina”:Scansione consentita? SÌIndicizzazione consentita? SÌCanonical dichiarato: [uguale all’URL della pagina o vuoto]Se questo è ciò che vedi e la pagina non viene reindirizzata (Google ti dice se questo è il caso, vedi sopra), allora è indicizzabile e scansionabile.La pagina ha avuto il tempo di avere successo?Le pagine raramente si posizionano da un giorno all’altro. Posizionarsi richiede tempo. Se sono trascorsi meno di 6 mesi da quando hai pubblicato o aggiornato in modo significativo una pagina, è possibile che abbia solo bisogno di più tempo per avere successo nella ricerca organica.Il posizionamento della pagina è una priorità?Nessuno ha risorse infinite, quindi non ha senso rompersi la schiena cercando di posizionare pagine che non contano molto. È necessario definire le proprie priorità.Non esiste una formula esatta per definire le priorità. Dipende dalla tua attività. Solitamente noi giudichiamo le pagine in base al loro potenziale commerciale e al potenziale di traffico di ricerca.Il potenziale aziendale considera quanto è facile presentare il tuo prodotto o servizio su una pagina.Ecco la scala che utilizziamo:Il Potenziale di Traffico (Traffic Potential) è la quantità di traffico di ricerca organica che la pagina potrebbe ottenere se si posizionasse al primo posto. Trovi questa metrica (e molte altre metriche SEO) nel Keywords Explorer di Ahrefs. Lo calcoliamo stimando la quantità totale di traffico di ricerca organica verso la pagina attualmente in alto sui motori di ricerca.La pagina potrebbe ottenere più traffico organico?Inserisci la parola chiave target della tua pagina nel Keywords Explorer di Ahrefs e controlla la metrica Potenziale di traffico (TP). Si tratta del traffico di ricerca organico stimato che la pagina in alto sulla SERP riceve da tutte le parole chiave per cui si posiziona, che di solito è un buon metro di giudizio per capire il TP dell’argomento.Se questo numero è superiore al traffico di ricerca stimato verso la tua pagina (nel Paese scelto), probabilmente otterrà più traffico. Puoi verificarlo inserendo l’URL della tua pagina nel Site Explorer di Ahrefs.Fai attenzione a queste stimePer alcune parole chiave, la pagina che si posiziona in alto non è quella migliore da cui ricavare il potenziale di traffico.Ad esempio, il potenziale di traffico per “google search console” in inglese è 33K. Ma se guardi da quale pagina deriva questa stima, è la pagina ufficiale di Google relativa a Search Console.Dato che difficilmente riuscirai a superare questa pagina, è meglio cercare una pagina simile alla tua nei risultati dei motori di ricerca e ricavarne potenziale di traffico. In questo caso, i primi quattro risultati sono tutte pagine ufficiali di Google, quindi questa guida nella posizione n. 9 è probabilmente quella che garantisce la stima più fedele del potenziale di traffico dell’argomento.Un’altra pagina del tuo sito è posizionata per gli stessi termini?Analizza il tuo sito con il Site Explorer di Ahrefs, vai al report sulle Parole Chiave Organiche, quindi filtra per “Solo URL multipli” e per la parola chiave che stai targetizzando. Se la parola chiave viene visualizzata nel rapporto, vuol dire che più pagine si posizionano per questa.La pagina è abbastanza unica da poter indirizzare anche altre parole?Avere più pagine posizionate per la stessa parola chiave non è sempre una cosa negativa. Se ogni pagina è molto diversa e si posiziona per i propri sottoargomenti, di solito può coesistere abbastanza felicemente con le altre.Per avere un’idea approssimativa di quanto siano diverse le pagine, guarda i loro titoli. Puoi visualizzarli facendo clic sul menu a discesa “SERP” e attivando “Solo target”.In questo caso, puoi vedere che entrambe le pagine sembrano abbastanza simili. Sono le definizioni della nostra metrica URL Rating (UR). Sulla base di ciò, la risposta alla domanda “La pagina è abbastanza unica da poter indirizzare anche altre parole?” probabilmente è “no”.Tuttavia, nel caso delle “parole chiave a coda corta”, le pagine che si posizionano sono molto diverse l’una dall’altra. Una è una pagina di definizione, mentre l’altra è un confronto tra parole chiave a coda lunga e coda corta.Sulla base di ciò, la risposta alla domanda “La pagina è abbastanza unica da poter indirizzare anche altre parole?” probabilmente è “sì”.La tua pagina è migliore della concorrenza?OK. Stiamo arrivando alle domande difficili perché ovviamente c’è un certo livello di soggettività in questo caso. Ci sono tantissimi elementi che potrebbero rendere “migliori” i contenuti del tuo sito, ma un buon punto di partenza è porsi queste due domande:Copre bene l’argomento?C’è qualcosa di unico in questo contenuto?Per rispondere alla prima domanda, puoi utilizzare la Competitive Analysis di Ahrefs. Basta inserire la tua pagina insieme a due o tre pagine che si posizionano in alto e che mirano allo stesso intento di ricerca e cliccare su “Compare”.Da qui, vai al rapporto Content Gap e cerca gli argomenti secondari che non hai trattato tra le parole chiave.Ad esempio, la parola chiave “affiliate marketing examples” (“esempi di marketing di affiliazione” in italiano) mi ha colpito quando ho analizzato la nostra guida all’affiliate marketing, poiché so che non abbiamo incluso esempi nel nostro post. Quindi è chiaro che potremmo trattare meglio l’argomento.Nota a margine. Anche gli strumenti di scrittura dei contenuti e gli strumenti per fare SEO on-page possono aiutare in questo processo. Ricorda che stai cercando argomenti che non hai trattato. Non preoccuparti delle piccole cose come il conteggio delle parole o la meta descrizione di una pagina. Un analisi dei contenuti di successo non significa analizzare tutto ma di concentrarsi sulle cose giuste.Per quanto riguarda la questione dell’unicità, non vedo qualcosa che possa distinguere il nostro post dagli altri, se guardo velocemente. Ci sono pochissimi dati o punti di vista unici, quindi c’è sicuramente spazio per miglioramenti su questo fronte.La tua pagina è ottimizzata bene per la SEO on-page?Si tratta di verificare le ottimizzazioni di base sulla pagina come un titolo e una meta descrizione accattivanti, un URL SEO-friendly, immagini ottimizzate, markup, ecc. Per semplificarti la vita, utilizza la checklist che trovi nella nostra guida alla SEO on-page.La pagina è linkata internamente se pertinente?I link interni sono collegamenti da una pagina del tuo sito a un’altra. Aiutano le pagine a posizionarsi condividendo il loro PageRank, quindi è logico assicurarsi che le pagine abbiano tutti i link interni rilevanti che possono avere.Se la tua pagina riceve già una discreta quantità di traffico di ricerca organico, puoi utilizzare lo strumento Opportunità di collegamenti interni nel Site Audit per verificare le opportunità che hai a disposizione. Basta impostare il filtro “Pagina di destinazione” sull’URL della tua pagina per cercare parole chiave per le quali si posiziona nel tuo sito.Ad esempio, se lo facciamo per il nostro elenco di esempi di content marketing, lo strumento suggerisce un link interno su “inspirational content” nel nostro post relativo agli obiettivi del content marketing:Se la tua pagina non riceve molto traffico, utilizza Page Explorer per eseguire una ricerca manuale per le menzioni di parole chiave pertinenti. Ecco come:Vai su Page ExplorerClicca sul filtro “Avanzate”.Aggiungi un filtro per “Testo della pagina” > “Contiene” > [parola chiave pertinente]Aggiungi un filtro per “Link in uscita interni” > “Non contiene” > [URL della pagina che stai controllando]Se uno di questi report mostra risultati, probabilmente ci sono pagine in cui puoi aggiungere link interni pertinenti. Quindi la risposta a questa domanda è “no”.Il profilo dei backlink della tua pagina è più forte rispetto alla concorrenza?I backlink sono uno dei principali fattori di ranking per Google, quindi avere un profilo di backlink più debole rispetto a quello dei tuoi concorrenti potrebbe frenare il posizionamento delle tue parole chiave.Per verificare la forza dei tuoi profili, inserisci l’URL della tua pagina nel Site Explorer di Ahrefs, clicca sulla scheda “Backlink profile”, quindi sull’opzione per aggiungere competitor e inserisci alcune pagine che si posizionano in alto.Puoi quindi confrontare i domini di riferimento di ciascuna pagina (link da siti) e il posizionamento degli URL (UR):In questo caso, sembra che il nostro profilo di backlink non ci stia trattenendo. La nostra pagina ha più domini di riferimento e un punteggio UR più alto rispetto ai nostri concorrenti.Ci sono vecchie pagine cancellate che potrebbero essere reindirizzate?Se hai vecchie pagine cancellate con backlink su un argomento simile, vale la pena reindirizzarle perché potrebbero aiutarti a potenziare la tua pagina.Ecco come trovare le pagine da reindirizzare:Inserisci il tuo sito nel Site Explorer di AhrefsVai al rapport Migliore per link Filtra le pagine con il codice HTTP “404 non trovato”Filtra per pagine con almeno un dominio di riferimentoAd esempio, se stessimo controllando il nostro post sul Domain Rating (DR), avrebbe senso reindirizzare questa vecchia pagina eliminata relativamente all’autorità del dominio:È la pagina più forte? No. Ha solo quattro domini di riferimento. Ma ogni piccolo aiuto è una vittoria facile.Pensi che la pagina potrebbe convertire di più?Se la tua pagina ha esaurito il suo potenziale di traffico, pensa se c’è qualcosa che puoi fare per renderla più preziosa per la tua attività. Potrebbe generare più conversioni, più conversioni assistite o svolgere in qualche modo un ruolo migliore nel percorso dell’utente?Questa non è la mia area di competenza, quindi sono sicuro che ci siano molti modi per migliorare le cose su questo fronte. Ma inizierei col pormi queste due domande:Potrei aggiungere eventuali inviti all’azione (CTA) pertinenti?Potrei vendere meglio il prodotto o il servizio nel contenuto?Ad esempio, di recente ho riscritto la mia guida su come farsi indicizzare da Google (l’originale era stata scritta nel 2019). Il motivo principale è che il nostro prodotto ha fatto molta strada da allora e ci sono più modi in cui può aiutare a risolvere il problema in questione.Ad un certo punto abbiamo anche aggiunto CTA ad alcuni dei nostri strumenti gratuiti, come questo sul nostro strumento di controllo dei backlink gratuito:Template per l’audit dei contenutiNel caso in cui te lo fossi perso sopra, ecco i template di cui hai bisogno:Template per l’audit dei contenutiProcesso interattivo per l’audit dei contenutiFAQsChe cos’è un audit dei contenuti?Un audit dei contenuti, o analisi dei contenuti, è l’analisi delle prestazioni dei contenuti del tuo sito per trovare opportunità di miglioramento. Molti audit dei contenuti si concentrano sulle prestazioni SEO, ma un audit completo tiene conto anche delle prestazioni aziendali e dell’utilità del contenuto.Perché è importante analizzare i contenuti?Un controllo dei contenuti è importante per capire cosa devi fare per migliorare le prestazioni di marketing dei contenuti del tuo sito. Ti aiuta a identificare le pagine che non rendono bene, il motivo per cui non lo fanno e come risolvere il problema. È una parte fondamentale di qualsiasi strategia di content marketing.L’audit dei contenuti riguarda solo i post del blog?No. Puoi controllare anche le landing page e altri tipi di pagine. Ricorda solo che alcune landing page sono necessarie indipendentemente dal loro rendimento (ad esempio, la pagina “About”).ConclusioniL’audit dei contenuti dovrebbe essere effettuata regolarmente in quanto rivela come migliorare le prestazioni del tuo sitoì (SEO ma non solo) e ti aiutano a raggiungere i tuoi obiettivi aziendali.Ricorda solo di non eliminare o reindirizzare mai il contenuto del sito a meno che tu non abbia la certezza che sia la migliore cosa da fare. Un audit dei contenuti di maggior successo necessita di equilibrio. Se non sai come farlo, assumi un professionista SEO o di content marketing che lo faccia per te.Hai domande? Scrivimi su X (Twitter). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Come fare Un Audit Dei Contenuti Perfetto (Template Incluso)"
    },
    {
      "level": "H2",
      "text": "Come fare un audit dei contenuti di un sito (il nostro processo)"
    },
    {
      "level": "H3",
      "text": "La pagina riceve traffico organico?"
    },
    {
      "level": "H3",
      "text": "La pagina riceve traffico da un’altra fonte?"
    },
    {
      "level": "H3",
      "text": "La pagina è destinata principalmente alla ricerca organica?"
    },
    {
      "level": "H3",
      "text": "La pagina è utile per un altro scopo?"
    },
    {
      "level": "H3",
      "text": "La pagina ha dei backlink?"
    },
    {
      "level": "H3",
      "text": "La pagina è scansionabile e indicizzabile?"
    },
    {
      "level": "H3",
      "text": "La pagina ha avuto il tempo di avere successo?"
    },
    {
      "level": "H3",
      "text": "Il posizionamento della pagina è una priorità?"
    },
    {
      "level": "H3",
      "text": "La pagina potrebbe ottenere più traffico organico?"
    },
    {
      "level": "H3",
      "text": "Un’altra pagina del tuo sito è posizionata per gli stessi termini?"
    },
    {
      "level": "H3",
      "text": "La pagina è abbastanza unica da poter indirizzare anche altre parole?"
    },
    {
      "level": "H3",
      "text": "La tua pagina è migliore della concorrenza?"
    },
    {
      "level": "H3",
      "text": "La tua pagina è ottimizzata bene per la SEO on-page?"
    },
    {
      "level": "H3",
      "text": "La pagina è linkata internamente se pertinente?"
    },
    {
      "level": "H3",
      "text": "Il profilo dei backlink della tua pagina è più forte rispetto alla concorrenza?"
    },
    {
      "level": "H3",
      "text": "Ci sono vecchie pagine cancellate che potrebbero essere reindirizzate?"
    },
    {
      "level": "H3",
      "text": "Pensi che la pagina potrebbe convertire di più?"
    },
    {
      "level": "H2",
      "text": "Template per l’audit dei contenuti"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Che cos’è un audit dei contenuti?"
    },
    {
      "level": "H3",
      "text": "Perché è importante analizzare i contenuti?"
    },
    {
      "level": "H3",
      "text": "L’audit dei contenuti riguarda solo i post del blog?"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}