{
  "url": "https://ahrefs.com/blog/it/basi-seo/",
  "slug": "basi-seo",
  "title": "Basi della SEO: una Guida per Principianti Verso il Successo - SEO Blog by Ahrefs",
  "description": "Le basi della SEO sono piuttosto semplici. E dato che la maggior parte dei proprietari dei siti non le conosce, approfondire le basi della SEO può protenderti verso il successo.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). In molti credono che la SEO sia troppo complessa e che non valga la pena imparare. Le basi della SEO sono invece piuttosto semplici. E con il 57,8% di tutto il traffico del web che proviene da Google, è indubbiamente qualcosa che vale la pena imparare se hai un sito.Se credi che le basi della SEO non siano abbastanza per posizionarti, stai sbagliando. La maggior parte delle persone che gestisce un sito ha conoscenze molto limitate in termini SEO, quindi imparare anche solo le basi può sicuramente aiutarti ad avere un vantaggio competitivo.Ecco cosa imparerai in questa guida:ContentsNota del redattoreNon hai mai sentito parlare di SEO prima d’ora? Comincia allora con la nostra guida alla SEO per principianti.Hai già un pò di esperienza? Allora passa direttamente al primo capitolo.Joshua HardwickHead of Content Guida SEO 1Come Funzionano i Motori di Ricerca 2Nozioni di base sulla SEO 3Ricerca delle parole chiave 4Contenuto SEO (EN) 5SEO on-page 6Link Building 7SEO tecnica Part 1Fondamenti della SEOPrima di cominciare assicuriamoci di capire le vere basi della SEO, inclusa la sua importanza e in che modo si rapporta agli altri canali di marketing.Perché la SEO è importante?La maggior parte del traffico del web proviene dai risultati organici di Google.Fonte: SparktoroI risultati organici di Google generano la maggior parte del traffico webPer dirla in altre parole: il traffico organico è in grado di generare più traffico di tutte le altre fonti combinate.Se hai letto la nostra guida che spiega come funzionano i motori di ricerca, sarai a conoscenza del fatto che Google e altri motori di ricerca scelgono quali pagine posizionare in base a centinaia di segnali. La SEO è importante perché cerca di ottimizzare questi segnali al fine di riuscire a posizionarsi meglio fra i risultati di ricerca organica.Quali sono i benefici della SEO?Posizionarsi più in alto nei risultati è sicuramente il beneficio più conclamato della SEO, ma il posizionamento è solo un mezzo per raggiungere un fine ben preciso. Molti dei benefici della SEO sono infatti correlati al traffico.1. La SEO porta più trafficoDato che la maggior parte delle persone tende a fare click su uno dei primi risultati fra quelli proposti dopo una ricerca, posizionarsi più in alto significa solitamente portare più traffico al proprio sito.Ad esempio, guarda i primi 3 risultati per “segnalare il sito ai motori di ricerca”. Utilizzando il Keyword Explorer di Ahrefs, possiamo notare come la pagina meglio posizionata sembra essere quella che ottiene più traffico organico, seguita poi dalla seconda, dalla terza, ecc…Un nostro studio ha riscontrato che queste affermazioni sono generalmente valide per più o meno tutte le ricerche, in quanto il posizionamento è strettamente correlato al traffico che una pagina riceve.2. La SEO porta traffico in maniera costantePosizionarsi sui motori di ricerca porta solitamente a ricevere traffico in maniera costante e passiva. Questo non è solitamente il caso per canali come i social media e l’email marketing, che sono caratterizzati spesso da picchi di traffico che svaniscono poi nel nulla.Questo succede perché i social media sono progettati per favorire contenuti freschi. Le email invece vengono spesso segnalate come lette, dimenticate o addirittura etichettate come spam. Dato che il numero di ricerche eseguite all’interno dei motori di ricerca tende ad essere costante mese dopo mese, il traffico tende a fare lo stesso, diventando quindi costante e passivo una volta che riesci a posizionarti.3. La SEO porta traffico ‘gratuito’Al contrario degli annunci a pagamento, il traffico proveniente dalla ricerca organica è ‘gratuito’.Questo è importante, in quanto fare sponsorizzazioni sui motori di ricerca può essere piuttosto costoso.Per fare un esempio, secondo i dati del Site Explorer di Ahrefs, il nostro blog ottiene 390k di visitatori ogni mese grazie ai motori di ricerca. Se dovessimo pagare Google per lo stesso quantitativo di traffico, ci costerebbe un totale stimato di $1M al mese.Certo, creare contenuti che si posizionino su Google non è gratuito—ma è solitamente meno costoso che pagare per degli annunci.Come si posiziona un sito su Google?La SEO aiuta a posizionarti in alto, ma non puoi farlo se Google non è a conoscenza dell’esistenza del tuo sito.Google è in grado di trovare il tuo sito in autonomia, ma ci sono alcuni benefici nel segnalare il tuo sito manualmente: Il sito viene scoperto più velocemente..La maggior parte dei nuovi siti non ottiene backlink da altri, e potrebbe quindi volerci tempo prima che Google ne scopra l’esistenza. Migliori il tuo sito web. Google Search Console fornisce consigli su come migliorare e ottimizzare il tuo sito web.Il primo passo per inviare il tuo sito a Google, è quello di identificare la tua sitemap.Le sitemap sono file che contengono una lista di tutte le pagine più importanti presenti sul tuo sito. Solitamente puoi trovare la tua inserendo una di queste due URL all’interno del tuo browser:sitoweb.com/sitemap.xmlsitoweb.com/sitemap_index.xmlSe non la trovi, vai su sitoweb.com/robots.txt, dove solitamente è indicata con un link.Se non la trovi nemmeno lì, potresti non averne una. Dai uno sguardo alla nostra guida su come creare una sitemap.Il secondo passo, è quello di creare un account gratuito su Google Search Console, e inviare poi la tua sitemap.Che cos’è SEO? Come ottimizzare per Motori di Ricerca quali GooglePerché la SEO è Importante: 9 Motivi Innegabili e Casi StudioCome Creare Una Sitemap XML (e Inviarla a Google)Come Segnalare il Tuo Sito ai Motori Di Ricerca9 Motivi per i Quali il Tuo Sito Non È su Google10 Metodi per Indicizzare il tuo sito su GooglePart 2Impostare una strategia SEO efficaceFar indicizzare il tuo sito ai motori di ricerca significa che entri in competizione, ma non di certo che vincerai facilmente. Ecco dove entra in gioco la SEO. La SEO è un processo continuo, che se fatto bene incrementa le tue possibilità di vincere nel corso del tempo.È molto più semplice fare SEO per bene quando il tuo sito è correttamente impostato per supportare la tua strategia SEO.Vediamo quindi come fare.Prendi un buon dominioUtilizza una piattaformaUtilizza un buon hostingCrea un’esperienza utente positivaStruttura il sito in modo logicoUtilizza delle URL sensateInstalla un buon plugin per la SEOPrendi un buon dominioNon andare nel panico se hai già registrato un dominio. Probabilmente andrà bene e non sarà un ostacolo ai tuoi sforzi SEO. Ma se non ne hai ancora scelto uno, ha senso tenere a mente questi due punti quando effettui la scelta:1. Nome dominioPer prima cosa, non preoccuparti di includere delle parole chiave. Il tuo dominio non deve essere qualcosa del tipo ristorantiitalianialondra.com per far sì che i motori di ricerca capiscano di cosa parli.Ecco alcuni attributi che caratterizzano un buon nome a dominio:È il nome della tua aziendaNon ha trattiniÈ breve e memorabile2) TLDTLD sta per top-level domain. È la parte che segue il nome, come .com, .org, o .it.John Mueller di Google ha detto che questi non fanno differenza in termini SEO. Per la maggior parte delle aziende però, solitamente il .com è la migliore scelta, in quanto è facilmente riconoscibile e fidato.Se sei una no-profit, .il org o il TLD del tuo Paese (.it nel nostro caso) va benissimo.Se invece fai affari solo in uno Stato al di fuori degli Stati Uniti, il tuo ccTLD (es., .it) funziona benone. Ti consiglio di non utilizzare TLD come .info e .biz, in quanto tendono ad essere associati con siti di bassa qualità. Non è però la fine del mondo se ne hai uno. Puoi comunque realizzare un ottimo sito che riesca a posizionarsi.Utilizza una piattaformaLa maggior parte delle persone non realizza il proprio sito programmando da zero con HTML e CSS. Utilizza invece una piattaforma. Questi sono software che consentono alle persone che non sono in grado di programmare di realizzare un sito, gestirne i contenuti con facilità e semplificare gli aspetti tecnici più complessi.Esistono due tipologie di piattaforme:Piattaforme hostedLe piattaforme di tipo hosted includono tutto sotto un unico tetto. Sono host del tuo sito web, mettono a disposizione design pronti all’uso che possono essere installati con facilità e ti consentono di creare e gestire i contenuti senza dover toccare nulla lato codice.Piattaforme self-hostedAnche le piattaforme self-hosted ti consentono di gestire e creare i contenuti senza dover mettere mano al codice. La differenza sta nel fatto che devi avere un host e installarle in maniera autonoma.Nota a margine. WordPress ha anche una soluzione hosted disponibile su wordpress.com.Quale tipo di piattaforma dovresti scegliere?La maggior parte dei professionisti della SEO, consiglia le soluzioni self-hosted e open source come WordPress, in quanto: Sono personalizzabili, dato che puoi modificare il codice sorgente nel modo in cui preferisci, ed esistono vaste community di sviluppatori che conosce a fondo queste piattaforme. Possono essere espanse grazie all’ampia disponibilità di milioni di plugin in grado di ampliarne le funzionalità, inclusi migliaia dedicati alla SEO.Quello che ti consigliamo noi, è quindi una piattaforma self-hosted come WordPress.In ogni caso, se per te la semplicità di utilizzo e un buon supporto non sono negoziabili, una soluzione hosted come Wix o Squarespace potrebbe essere la scelta migliore. La verità è che la maggior parte di queste piattaforme provvede abbastanza possibilità lato SEO per la maggior parte delle persone.Quindi non metterti sotto pressione per passare a WordPress se stai già utilizzando un’altra piattaforma.Utilizza un buon hostingI web host memorizzano una copia del tuo sito sui loro hard drive, in modo da renderlo disponibile a chiunque abbia una connessione a internet.Se utilizzi una piattaforma hosted per il tuo sito, hai molto poco controllo sul tuo hosting. Se utilizzi invece una soluzione self-hosted come WordPress, sta a te trovare un hosting.Quindi, come si fa a scegliere un buon hosting per la SEO?La maggior parte delle guide sostiene che un hosting dedicato sia una scelta migliore rispetto ad una soluzione condivisa. Questo è vero, ma non va ad impattare molto finchè il tuo sito non ottiene una tonnellata di traffico. Un hosting economico da un’azienda ben stabilita nel settore è abbastanza per la maggior parte delle persone; non esistono grosse differenze in termini di performance quando paghi pochi euro al mese per un hosting.In ogni caso, ecco alcuni punti importanti a cui prestare attenzione: Sicurezza. Assicurati che il tuo hoster ti dia accesso ad un certificato gratuito SSL/TLS o che supporti LetsEncrypt—una no-profit che rilascia certificati TLS. Posizione del server. Ci vuole tempo affinché i dati viaggino da un server al pc di un visitatore, quindi dovresti scegliere un host che abbia i suoi server nello stesso Paese dei tuoi visitatori. Supporto. Un supporto 24/7 è ideale. Prova a fare un test e vedere quanto sono disponibili chiedendo delucidazioni sui punti qui sopra prima di procedere all’acquisto.Nota a margine. Non preoccuparti troppo della locazione dei server. Se noti che la velocità è un problema, puoi sempre investire in una CDN (Content Delivery Network). Questa crea una copia del tuo sito che viene distribuita a diversi server sparsi per il mondo, in modo che le pagine vengano sempre caricate per il visitatore dal server più vicino. Impostare e utilizzare una CDN è al di fuori dello scopo di questa guida, ma ecco come farlo su WordPress.Crea un’esperienza utente positivaGoogle vuole posizionare le pagine che offrono ai visitatori un’esperienza positiva. Lo dicono all’interno della loro guida alla SEO:Dovresti creare un sito che porti benefici agli utenti, e ogni sorta di ottimizzazione dovrebbe avere lo scopo di fornire un’esperienza utente positiva.Ecco alcuni semplici modi per farlo:Usa HTTPSNon c’è nulla di peggio per i tuoi visitatori che avere i loro dati personali esposti a rischi e hacker. Fai sì che il tuo sito sia sempre crittografato utilizzando SSL/TLS.Scegli un design accattivanteNessuno vuole vedere un sito che sembra sia stato disegnato negli anni ‘90. Non serve ridisegnare il tuo sito ogni sei mesi, ma cerca di renderlo accattivante e in linea con il tuo brand.Assicurati che sia mobile-friendlyGoogle sostiene che ad oggi vengano effettuate più ricerche da mobile che da desktop, ed è quindi fondamentale avere un sito che sia fruibile da entrambe le tipologie di dispositivo.Utilizza un font di dimensioni leggibiliLe persone utilizzano qualsiasi tipo di device per navigare. Assicurati che il tuo contenuto sia leggibile su tutti.Evita pop-up e pubblicità invadentiTutti odiano le pubblicità, ma talvolta ne hai bisogno. Se questo è il caso, evita quelle troppo invadenti. Google fornisce dei consigli su cosa è accettabile e cosa non lo è qui.Assicurati che si carichi velocementeLa velocità di caricamento della pagina è un fattore di posizionamento sia su desktop che mobile. Questo non significa che il tuo sito deve caricarsi alla velocità della luce. Più è veloce e meglio è, ma Google ci informa come questo fattore influisca solo sui siti che “forniscono un’esperienza utente lentissima”.Struttura il sito in modo logicoSia i visitatori che i motori di ricerca devono essere in grado di navigare il sito in maniera semplice ed intuitiva, motivo per il quale è importante creare una gerarchia logica per i tuoi contenuti.Il modo più semplice per farlo, è quello di creare una mappa mentale.Ognuno dei rami della tua mappa mentale diventerà un link interno. Questi sono link da una pagina all’altra del tuo sito.I link interni sono cruciali sia per la UX che per la SEO per diversi motivi: Aiutano i motori di ricerca a scoprire le pagine nuove. Le pagine senza link interni raramente vengono infatti trovate e indicizzate. Aiutano a distribuire il PageRank nel tuo sito. Il PageRank è alla base dell’algoritmo di Google, e cerca di determinare il ‘valore’ di una pagina. Aiutano i motori di ricerca a comprendere di cosa parla la tua pagina. Per fare ciò Google analizza l’anchor text ed il testo circostante.Utilizza delle URL sensateLe URL sono importanti, in quanto aiutano i visitatori a comprendere il contesto della pagina.La maggior parte delle piattaforme ti dà il controllo completo sulla struttura delle tue URL. Queste sono le cinque principali opzioni in WordPress: Semplice: iltuosito.com/?p=123 Data e nome: iltuosito.com/2021/03/04/basi-della-seo/ Mese e nome: iltuosito.com/03/04/basi-della-seo/ Numerico: iltuosito.com/865/ Nome articolo: iltuosito.com/basi-della-seo/Se stai creando un nuovo sito da zero, ha senso impostare la struttura più semplice e descrittiva. Questa è probabilmente Nome Articolo.Utilizzare le date all’interno delle URL è una cattiva pratica, in quanto potresti voler aggiornare il contenuto in futuro.Se stai ottimizzando un sito esistente, è meglio non cambiare la struttura delle URL—anche se non stai utilizzando quella più ideale. Farlo potrebbe rompere il sito e questo avrà un profondo impatto sulla tua SEO.Installa un buon plugin per la SEOLa maggior parte delle piattaforme hosted include in maniera nativa alcune funzionalità SEO, ma questo non è il caso di WordPress. È virtualmente impossibile implementare anche le migliori pratiche SEO più basilari senza un plugin SEO. Esistono diversi plugin che puoi utilizzare. Noi usiamo Yoast, ma anche Rath Math è un’ottima scelta.L’installazione è semplice. Basta andare su:Plugins > Aggiungi nuovo > Fai una ricerca > Installa > AttivaEntrambi questi plugin aggiungono dei campi extra alle tue pagine e ai tuoi articoli. (Ne parliamo a fondo più avanti).Se stai utilizzando una piattaforma hosted come Wix o Squarespace, non c’è bisogno di installare plugin per fare degli aggiustamenti in termini SEO, in quanto forniscono già il necessario.Cos’è HTTPS? Tutto Quello Che Devi SapereStruttura di un Sito Web: Creare delle Solide Fondamenta per la SEOCome creare URL SEO friendly (Passo a Passo)Come Velocizzare il Tuo Sito WordPress in 20 Minuti15 Migliori Plugin WordPress SEO (Provati & Testati)Come Condurre un Audit Base per Migliorare la SEO e la UXPart 3Come fare SEOArrivati a questo punto, dovresti avere delle buone basi per garantirti i tuoi successi SEO. Ma questo è solo l’inizio. La SEO è un processo costante, diviso approssimativamente in quattro diversi ambiti:Ricerca parole chiaveSEO on-pageLink buildingSEO TecnicaAbbiamo pubblicato delle guide per principianti che si focalizzano su ognuno di questi ambiti, quindi non andremo nel dettaglio di ognuno di essi in queste righe. Invece ci concentreremo sulle basi con un approccio ad ampio spettro, in modo da farti comprendere perché ognuno di questi aspetti è importante, e come vanno a incastrarsi l’uno con l’altro.Ricerca parole chiaveLa ricerca di parole chiave è il processo che permette di identificare cosa i tuoi clienti ricercano, quanto traffico questi termini possono portarti e quanto è difficile posizionarti per essi. Esploriamo le basi di ognuno di questi passaggi.Trova le parole chiaveComprendere che cosa i tuoi potenziali clienti cercano è il primo passo nel processo di ricerca parole chiave. A meno che tu non conosca questi dati, non c’è modo di andare a creare pagine che si posizioneranno sui motori di ricerca riuscendo ad intercettare traffico di valore.Fare un brainstorming delle parole e delle frasi che definiscono il tuo settore è solitamente il miglior punto di partenza. Per un negozio di computer ad esempio, alcuni termini potrebbero essere:computerPCmaclaptopmacbookPuoi utilizzare queste parole chiave ‘seme’ per trovare poi altre idee. Inseriscile all’interno di uno strumento per la ricerca di parole chiave, come ad esempio il Keywords Explorer di Ahrefs e analizza uno dei report disponibili. Scorri i report alla ricerca di parole chiave che potrebbero avere valore per la tua azienda.Verifica il potenziale di trafficoPraticamente ogni strumento di ricerca parole chiave mostra una stima di quelli che sono i volumi di ricerca medi mensili per le parole chiave che vengono identificate, incluso il Keywords Explorer di Ahrefs.I volumi di ricerca sono solitamente un modo ragionevole per stimare il traffico potenziale di determinate parole chiave. Generalmente parlando, le pagine che intercettano parole chiave con alti volumi portano solitamente più traffico verso le pagine del tuo sito rispetto a quelle con volumi più bassi.Ma la ricerca di parole chiave non è a prova di idiota. Esistono casi in cui posizionarsi #1 per una parola chiave con un volume di 1.000 ricerche mensili può portare più traffico che posizionarsi #1 per una parola chiave con un volume mensile di 2.000 ricerche.Ad esempio, “segnalare il sito ai motori di ricerca” vs. “consigli SEO”.Anche se la prima ha un volume di ricerca maggiore, la seconda pagina ottiene più traffico organico.È quindi sempre un’ottima idea quella di dare uno sguardo alla stima del traffico organico che riceve la pagina meglio posizionata, al fine di farsi un’idea di quello che è il potenziale di traffico di una data parola chiave. Puoi fare ciò all’interno del Keywords Explorer.Analizzare la difficoltà di posizionamentoAnche se una parola chiave è particolarmente attinente alla tua azienda, ed ha un ottimo potenziale di traffico, non è detto che sia semplice posizionarsi.Ci sono molti fattori che definiscono la difficoltà di una parola chiave, ma il numero di siti pertinenti e prominenti che fornisce link alle pagine meglio posizionate è senza dubbio il più importante. Google ne parla all’interno della sua guida su come funziona la ricerca Google.Se altri siti pertinenti forniscono link ad una pagina, questo è un buon segnale che le informazioni sono di ottima qualità.Questo è uno dei motivi che ci ha portato a basare il punteggio di Keyword Difficulty di Ahrefs (KD) sul numero di link che puntano alle pagine meglio posizionate. Il KD è un punteggio assegnato ad ogni parola chiave che va da 1 a 100, ed è un ottimo punto di partenza per fare una stima della difficoltà di posizionamento per una determinata parola chiave.Ad ogni modo, è impossibile quantificare la difficoltà semplicemente con un numero a tre cifre, quindi non ti consigliamo di affidarti solo a questo. Parliamo nel dettaglio di come determinare la difficoltà di una parola chiave nella nostra guida alla ricerca parole chiave.SEO on-pageLa SEO on-page comprende la creazione del giusto contenuto in base alle aspettative di chi ricerca e la sua ‘ottimizzazione’ al fine di aiutare i motori di ricerca a comprendere meglio di cosa si tratti. La maggior parte delle persone crede invece che significhi piazzare delle parole chiave in maniera strategica. Nonostante questo faccia comunque parte del processo, non è sicuramente l’aspetto più importante.Diamo quindi uno sguardo alle basi di come ottimizzare una pagina per posizionarla sui motori di ricerca.Cambia il contenuto con l’intento di ricercaSe fallisci nel creare la tipologia di contenuto che chi ricerca si aspetta di trovare, le tue possibilità di posizionarti sono praticamente pari a zero. All’interno del settore, questo viene definito come allineare il tuo contenuto all’intento di ricerca.Google comprende quello che gli utenti vogliono vedere quando cercano meglio di chiunque altro, dunque il modo migliore per capire l’intento è quello di analizzare le pagine meglio posizionate nella ricerca per la tua parola chiave e identificare il filo conduttore.Ad esempio, i risultati per “SEO Tips” (in italiano: “consigli SEO”), sono tutti articoli di blog in formato lista. Mentre i risultati per “speakers” sono tutte pagine prodotto da siti di ecommerce.Questo ci dice che le persone che cercano “speakers” sono interessate all’acquisto mentre le persone che cercano “SEO tips” sono alla ricerca di informazioni. Se vogliamo posizionarci, dobbiamo tenere questi dati a mente e creare la tipologia di contenuto che meglio si allinea ad ogni intento.Slug descrittivi per le URLNel capitolo dedicato al setup di un sito a scopi SEO, abbiamo parlato dell’utilizzare una struttura logica per la URL. Per ogni pagina o articolo che pubblichi, devi anche impostare uno slug descrittivo—lo slug è la parte finale di una URL.Come farlo nel migliore dei modi dipende dalla sottocartella che precede lo slug.Poniamo caso che il tuo obiettivo in termini di parola chiave sia “jeans neri da uomo”. Se la tua URL non ha sottocartelle, o ha sottocartelle generiche come /blog/, imposta lo slug in modo che corrisponda alla tua parola chiave.iltuosito.com/jeans-neri-uomo/Se invece sono presenti sottocartelle ‘contestuali’, come /uomo/ o /jeans/, solitamente è meglio evitare ripetizioni in termini di parole chiave.iltuosito.com/uomo/jeans/neri/Scrivi un titolo efficaceI titoli sono i link blu che vengono mostrati nei risultati di ricerca.È una delle armi a tua disposizione per invogliare un utente a fare click sulla tua pagina, dunque è importante scriverne uno che sia il più efficace possibile.Il modo migliore di farlo, è allinearlo all’intento di ricerca.Ad esempio, se diamo uno sguardo ai titoli dei risultati meglio posizionati per “migliori speaker bluetooth”, possiamo notare due cose che accomunano quasi tutti i risultati: Tutti contengono l’anno. Questo ci fa comprendere che per chi ricerca è importante la freschezza del contenuto. Parlano molto della portatilità. Questo ci fa capire che si tratta di un attributo importante.Utilizzando queste informazioni a nostro vantaggio, questo potrebbe essere un buon titolo da utilizzare: Migliori Speaker Bluetooth (2021): i migliori per portabilitàOttimizza le immaginiLe immagini possono posizionarsi in Google Immagini e portare traffico al tuo sito. Noi abbiamo ottenuto migliaia di visite da Google attraverso Google Immagini negli ultimi tre mesi:Come si ottimizzano le immagini?Ecco come puoi farlo in 3 mosse: Rinominale in modo logico. I nomi dei file aiutano Google a comprendere l’immagine, quindi gatto.png è meglio di IMG_948493.png. Utilizza un alt text descrittivo. L’alt text è un codice che descrive le immagini in parole. Non è visibile all’utente, a meno che questo non utilizzi uno screen reader o l’immagine fallisca il caricamento. La maggior parte delle piattaforme ha un campo dove inserire l’alt text quando esegui l’upload di un’immagine. Comprimile. Usa un plugin come Shortpixel per comprimere le tue immagini al volo e migliorare la velocità della pagina.Link buildingI link provenienti da altri siti contano come ‘voti’, mostrando a Google che le persone sono entusiaste dei tuoi contenuti.Sono senza dubbio il più importante fattore di posizionamento, ma ottenerne di buoni non è sempre semplice.La maggior parte delle tattiche di link building ruota attorno alla creazione di contenuti eccezionali, che vengono poi notificati ai proprietari di altri siti e editor, fornendo loro un buon motivo per fornirti un link. Ma esistono altri modi per ottenere link.Diamo uno sguardo ad alcuni di questi.Guest bloggingIl guest blogging consiste nello scrivere un articolo per un altro sito. Ecco un guest post che Ryan Stewart ha scritto per il Blog di Ahrefs nel 2018.Se dai uno sguardo alla biografia dell’autore, noterai dei link verso il sito e i profili social di Ryan.La maggior parte dei siti consente all’autore di aggiungere il proprio sito in questo spazio.Uno dei modi più semplici per trovare delle potenziali opportunità di guest blogging, è il Content Explorer, un database di oltre 7 miliardi di pagine dove puoi effettuare delle ricerche. Ecco come:Cerca un tema per te rilevanteScegli “Nel titolo” dal menù a discesaControlla la scheda “Siti Web”In questo modo puoi identificare i siti che ottengono più traffico per la tematica scelta:Dato che questi siti hanno parlato della tematica da te scelta in passato, ci sono buone probabilità che siano propensi ad accettare un guest post su di un tema simile. Invia loro una mail e chiedi.Tecnica dello SkyscraperLa Tecnica dello Skyscraper consiste nell’ottenere link creando contenuti migliori di quelli che le persone stanno già fornendo dei link.Ecco il processo di base:Trova contenuti che ottengono tanti backlinkCrea qualcosa di miglioreChiedi alle persone di fornire link al tuo contenuto invece che a quello già presenteIl Content Explorer è probabilmente il metodo più veloce per trovare delle opportunità ‘grattacielo’. Cerca nuovamente una tema per te rilevante e filtra poi in base alla pagine con molti domini referral (ovvero altri siti che hanno link ad essi).Vai poi alla ricerca di contenuti che potresti migliorare o comunque scrivere meglio. Inserisci poi la loro URL nel Site Explorer di Ahrefs, e identifica tutti i backlink all’interno del report Backlink. Contatta poi i proprietari dei siti.Analizza i link della concorrenzaComprendere in che modo i concorrenti attraggono backlink è il miglior modo per creare una strategia di link building. Se identifichi degli schemi ricorrenti all’interno del loro profilo link, dovresti riuscire a capire quale tecnica di link building potrebbe essere la più efficace anche per il tuo sito web.Per farlo, cerca la tua parola chiave obiettivo all’interno del Keywords Explorer di Ahrefs e analizza la panoramica SERP. Cerca una pagina simile alla tua che abbia molti domini referral.Se facciamo questo per “basi della SEO”, vediamo molte pagine che ricevono tanti backlink.Se analizziamo il report chiamato Backlinks per una delle pagine, possiamo vedere dei trend fra i suoi backlink.In questo caso ad esempio, ce ne sono un po’ che provengono da alcune guide al blogging.Possiamo quindi compiere una ricerca all’interno del Content Explorer per trovare altre guide simili, per poi contattare gli autori e consigliare questa nostra guida come utile risorse alla quale creare un link.SEO TecnicaLa SEO Tecnica (spesso chiamata anche Technical SEO, dall’inglese), è il processo che mira ad aiutare i motori di ricerca come Google a trovare, comprendere e indicizzare le tue pagine. Può essere piuttosto complicata, e dato che abbiamo già parlato delle basi nel capitolo dedicato alle impostazioni del sito, non lo approfondiremo ulteriormente in queste righe.Per ora, ti consigliamo di creare un account gratuito su Ahrefs Webmaster Tools, impostando della scansioni periodiche del tuo sito. Queste scansioni analizzano il sito alla ricerca di 100+ problematiche SEO, inclusi molti problemi a livello tecnico.Se identifichi alcune problematiche tecniche che ti preoccupano sul tuo sito, ti consigliamo di leggere la nostra guida alla SEO tecnica, che ti aiuterà a sistemarle.Come Ricercare Parole Chiave Per La SEOSEO On-Page: Guida Completa per PrincipiantiLa Guida alla Link Building per Principianti SEO tecnica: Guida per PrincipiantiPart 4Come monitorare il tuo successo SEOArrivati a questo punto, dovresti avere una buona comprensione della SEO. Ma come puoi misurare e tracciare le performance derivanti dai tuoi sforzi? La risposta più ovvia, è quella di tracciare il volume di traffico che il tuo sito ottiene dalla ricerca organica.Se utilizzi Google Analytics, puoi analizzare il traffico organico andando su:Acquisizione > Tutto il traffico > Canali > Ricerca OrganicaSe non utilizzi Google Analytics, puoi verificare la stima del tuo traffico attuale e passato nel Site Explorer di Ahrefs.Se questo numero sta salendo, ci sono alte probabilità che tu stia facendo qualcosa nel modo giusto.Potresti anche monitorare il posizionamento della parole chiave nel Rank Tracker. Se ti stai posizionando #5 in un dato mese e #1 nel successivo, questo è un altro segnale che stai facendo le cose nel modo giusto.Ad ogni modo, nonostante non ci sia nulla di male nel monitorare traffico e posizionamento, si tratta solo di cosiddette vanity metrics, in quanto spesso non sono strettamente correlate ai tuoi obiettivi aziendali o di marketing.È meglio tracciare delle metriche che abbiano effettivamente un impatto sulla tua azienda.Diamo uno sguardo ad un paio di queste metriche.Monitora la Share of Voice (SoV) organicaLa SoV organica rappresenta la visibilità del tuo brand all’interno dei risultati di ricerca a confronto con quella della tua competizione. È importante, dato che esiste una relazione fra la SoV e la quota di mercato.Puoi tracciare la tua SoV all’interno del Rank Tracker Ahrefs. Aggiungi le parole chiave che sono importanti per la tua azienda e associa dei tag appropriati. Da lì, vai poi su: Competitors > OverviewSe non lo hai già fatto, aggiungi alcuni concorrenti. Analizza poi la scheda chiamata Visibility per vedere la percentuale di click ottenuta dal tuo sito a confronto con quella dei tuoi concorrenti sulle parole chiave tracciate.Traccia le conversioni da traffico organicoUna conversione accade quando un visitatore sul tuo sito compie una determinata azione. Questo potrebbe essere di tutto, dal fare click su di un link al compiere un acquisto.Se utilizzi Google Analytics, puoi tracciare le conversioni per gli acquisti per praticamente tutto. Puoi poi filtrare le conversioni per vedere solo quelle provenienti dal traffico organico, e confrontarle fra due diversi periodi per farti un’idea dell’impatto che i tuoi sforzi SEO stanno effettivamente portando.Tieni Traccia di Questi 3 KPI SEO per Prendere Migliori Decisioni di MarketingCos’è la Share of Voice? Come Misurarla nei Diversi CanaliPart 5Strumenti SEO gratuitiMolti strumenti per la SEO professionali costano oltre €100 al mese. Dato che questa guida copre solo le basi della SEO, potresti non essere ancora pronto a compiere questo tipo di investimento per l’acquisto di strumenti SEO molto potenti come Ahrefs. Ma non preoccuparti. Puoi comunque ottenere tanto dai diversi strumenti gratuiti per la SEO.Ecco alcuni di quelli più in voga, che possono aiutarti a coprire ognuno dei vari ambiti della SEO che abbiamo visto nel capitolo 4.Strumenti per la ricerca parole chiaveGoogle Keyword PlannerTrova idee per le parole chiave.Keyword GeneratorGenera centinaia di idee di parole chiave.SERP CheckerAnalizza il potenziale stimato di traffico per una determinata tematica in base ai primi tre risultati.Keyword Difficulty CheckerAnalizza il punteggio di Keyword Difficulty (KD) per una determinata parola chiave.Strumenti per la SEO on-page Yoast SEOAggiungi title e meta description alle pagine e agli articoli di WordPress.Ahrefs Webmaster ToolsTrova title, meta tags e alt text mancanti sul tuo sito.Strumenti per la link buildingBacklink Checker di AhrefsAnalizza i primi 100 backlink di una determinata pagina o sito.HARORicevi opportunità di link giornaliere (in realtà è un servizio piuttosto che uno strumento)GmailInvia email di contatto ai tuoi potenziali domini referral. Non serve uno strumento figo o apposito per farlo.Strumenti per la SEO tecnicaGoogle Search ConsoleTrova errori di indicizzazione, page speed e molto altro.Ahrefs Webmaster ToolsIdentifica 100+ problemi SEO sul tuo sito, inclusi molti aspetti tecnici.Per concludereTutte le informazioni qui sopra dovrebbero essere abbastanza come introduzione alle basi della SEO. Se vuoi approfondire ulteriormente i quattro ambiti discussi nel quarto capitolo, abbiamo delle guide per principianti per ognuno di essi.Ecco tutti i link (ti consigliamo di partire dalla ricerca parole chiave).Come Ricercare Parole Chiave Per La SEOSEO On-Page: Guida Completa per PrincipiantiLa Guida alla Link Building per PrincipiantiGuida per Principianti alla SEO tecnica Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Collaboratori Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Collaboratori",
  "headers": [
    {
      "level": "H1",
      "text": "Basi della SEO: una Guida per Principianti Verso il Successo"
    },
    {
      "level": "H2",
      "text": "Fondamenti della SEO"
    },
    {
      "level": "H3",
      "text": "Perché la SEO è importante?"
    },
    {
      "level": "H3",
      "text": "Quali sono i benefici della SEO?"
    },
    {
      "level": "H4",
      "text": "1. La SEO porta più traffico"
    },
    {
      "level": "H4",
      "text": "2. La SEO porta traffico in maniera costante"
    },
    {
      "level": "H4",
      "text": "3. La SEO porta traffico ‘gratuito’"
    },
    {
      "level": "H3",
      "text": "Come si posiziona un sito su Google?"
    },
    {
      "level": "H2",
      "text": "Impostare una strategia SEO efficace"
    },
    {
      "level": "H3",
      "text": "Prendi un buon dominio"
    },
    {
      "level": "H4",
      "text": "1. Nome dominio"
    },
    {
      "level": "H4",
      "text": "2) TLD"
    },
    {
      "level": "H3",
      "text": "Utilizza una piattaforma"
    },
    {
      "level": "H4",
      "text": "Piattaforme hosted"
    },
    {
      "level": "H4",
      "text": "Piattaforme self-hosted"
    },
    {
      "level": "H3",
      "text": "Utilizza un buon hosting"
    },
    {
      "level": "H3",
      "text": "Crea un’esperienza utente positiva"
    },
    {
      "level": "H4",
      "text": "Usa HTTPS"
    },
    {
      "level": "H4",
      "text": "Scegli un design accattivante"
    },
    {
      "level": "H4",
      "text": "Assicurati che sia mobile-friendly"
    },
    {
      "level": "H4",
      "text": "Utilizza un font di dimensioni leggibili"
    },
    {
      "level": "H4",
      "text": "Evita pop-up e pubblicità invadenti"
    },
    {
      "level": "H4",
      "text": "Assicurati che si carichi velocemente"
    },
    {
      "level": "H3",
      "text": "Struttura il sito in modo logico"
    },
    {
      "level": "H3",
      "text": "Utilizza delle URL sensate"
    },
    {
      "level": "H3",
      "text": "Installa un buon plugin per la SEO"
    },
    {
      "level": "H2",
      "text": "Come fare SEO"
    },
    {
      "level": "H3",
      "text": "Ricerca parole chiave"
    },
    {
      "level": "H4",
      "text": "Trova le parole chiave"
    },
    {
      "level": "H4",
      "text": "Verifica il potenziale di traffico"
    },
    {
      "level": "H4",
      "text": "Analizzare la difficoltà di posizionamento"
    },
    {
      "level": "H3",
      "text": "SEO on-page"
    },
    {
      "level": "H4",
      "text": "Cambia il contenuto con l’intento di ricerca"
    },
    {
      "level": "H4",
      "text": "Slug descrittivi per le URL"
    },
    {
      "level": "H4",
      "text": "Scrivi un titolo efficace"
    },
    {
      "level": "H4",
      "text": "Ottimizza le immagini"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H4",
      "text": "Guest blogging"
    },
    {
      "level": "H4",
      "text": "Tecnica dello Skyscraper"
    },
    {
      "level": "H4",
      "text": "Analizza i link della concorrenza"
    },
    {
      "level": "H3",
      "text": "SEO Tecnica"
    },
    {
      "level": "H2",
      "text": "Come monitorare il tuo successo SEO"
    },
    {
      "level": "H3",
      "text": "Monitora la Share of Voice (SoV) organica"
    },
    {
      "level": "H3",
      "text": "Traccia le conversioni da traffico organico"
    },
    {
      "level": "H2",
      "text": "Strumenti SEO gratuiti"
    },
    {
      "level": "H3",
      "text": "Strumenti per la ricerca parole chiave"
    },
    {
      "level": "H4",
      "text": "Google Keyword Planner"
    },
    {
      "level": "H4",
      "text": "Keyword Generator"
    },
    {
      "level": "H4",
      "text": "SERP Checker"
    },
    {
      "level": "H4",
      "text": "Keyword Difficulty Checker"
    },
    {
      "level": "H3",
      "text": "Strumenti per la SEO on-page"
    },
    {
      "level": "H4",
      "text": "Yoast SEO"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Strumenti per la link building"
    },
    {
      "level": "H4",
      "text": "Backlink Checker di Ahrefs"
    },
    {
      "level": "H4",
      "text": "HARO"
    },
    {
      "level": "H4",
      "text": "Gmail"
    },
    {
      "level": "H3",
      "text": "Strumenti per la SEO tecnica"
    },
    {
      "level": "H4",
      "text": "Google Search Console"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools"
    },
    {
      "level": "H2",
      "text": "Per concludere"
    }
  ],
  "author": "Joshua Hardwick  Sam Oh Joshua Hardwick Joshua Hardwick"
}