{
  "url": "https://ahrefs.com/blog/it/buone-pratiche-seo/",
  "slug": "buone-pratiche-seo",
  "title": "Le 12 buone pratiche SEO che tutti dovrebbero seguire",
  "description": "Migliora la SEO con queste buone pratiche per blog, e-commerce, negozi fisici e qualsiasi tipo di azienda",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti La maggior parte delle liste di buone pratiche SEO sono strapiene di consigli inutili e non aggiornati, oppure di fatti che riguardano solo una piccola percentuale dei lettori..Detto in altre parole, sono liste di consigli SEO, non di buone pratiche!Le buone pratiche dovrebbero essere seguite da tutti: da chi ha un blog, da chi gestisce un e‑commerce o da chi ha un negozio fisico.Nel post di oggi esamineremo le buone pratiche fondamentali da seguire in tutte le pagine del tuo sito.1. Usare il protocollo HTTPSIl protocollo HTTPS rende le pagine del tuo sito più sicure, perché crittografa le informazioni scambiate tra il visitatore e il server. È un fattore di ranking di Google dal 2014.Puoi capire se il tuo sito sta già usando HTTPS controllando la barra degli indirizzi del browser.Se prima dell’URL c’è l’icona di un lucchetto, significa che il protocollo HTTPS è già stato implementato.Se non c’è il lucchetto, devi installare un certificato SSL.Molti servizi di hosting offrono un certificato SSL nei loro pacchetti. Se il tuo host non lo offre, puoi sceglierne uno gratuito su LetsEncrypt.La buona notizia è che passare ad HTTPS è un lavoro che si fa una volta per tutte. Una volta installato, tutte le pagine del tuo sito dovrebbero essere sicure, comprese quelle che pubblicherai in futuro.2. Ottimizzare i tempi di caricamentoNessuno vuole visitare una pagina che impiega un sacco di tempo per caricarsi. Ecco perché la velocità di caricamento figura tra i fattori di ranking per la ricerca da desktop dal 2010 e da mobile dal 2018.Sulla velocità di caricamento del sito influiscono molti fattori, tra cui il sorgente del sito, la posizione del server e le immagini.Puoi farti un’idea di come si comportano le pagine usando lo strumento PageSpeed Insights di Google. Dopo aver scritto l’URL da analizzare, lo strumento ti restituirà un punteggio compreso tra 0 e 100, seguito da consigli per migliorare la pagina.Il limite dello strumento PageSpeed Insights è che puoi controllare solo una pagina alla volta.Per superarlo puoi iscriverti alla Google Search Console e controllare il rapporto Velocità. Questo rapporto ti fa vedere quali pagine si caricano lentamente da desktop e da mobile e ti spiega i motivi della lentezza.Alcuni dei problemi che causano la lentezza possono essere difficili da risolvere, quindi ti consigliamo caldamente di chiedere aiuto a uno sviluppatore (o a un esperto di SEO tecnica).Ecco alcuni consigli validi in generale per mantenere le pagine veloci:Usare un CDN. La maggior parte dei siti sono ospitati da un server in un’unica posizione. Quindi, per alcuni visitatori, i dati devono fare molta strada prima di apparire nel browser. Per percorrere molta strada impiegano più tempo. I CDN risolvono questo problema copiando le risorse critiche, come le immagini, su una rete di server sparsi per il mondo, in modo tale che le risorse siano sempre caricate da un server locale.Comprimere le immagini. I file immagine sono pesanti, quindi si caricano lentamente. Comprimendo le immagini, la dimensione del file diminuisce, quindi le immagini si caricano più velocemente. Ciò che conta è trovare un compromesso tra le dimensioni e la qualità.Usare lazy-loading. Lazy-loading defers the loading of offscreen resources until you need them. This means that the browser doesn’t need to load all of the images on a page before it’s usable.Usare il lazy loading. Il lazy loading rinvia il caricamento delle risorse offscreen fino a quando non diventano necessarie. Questo significa che il browser non dovrà necessariamente caricare tutte le immagini prima che la pagina diventi usabile.Usare un tema ottimizzato. Per il tuo sito scegli un tema ben ottimizzato con un sorgente efficiente. Per controllare l’ottimizzazione, scansiona la demo del tema con lo strumento PageSpeed Insights di Google.3. Trattare un topic con “potenziale di traffico di ricerca”La keyword research è una componente fondamentale della SEO. Non ha senso impiegare tempo, lavoro e risorse per cercare di posizionarsi per cose che nessuno cerca (a meno che si voglia semplicemente attrarre link).Poniamo ad esempio che tu venda tutorial per software. Non avrebbe senso cercare di posizionarsi per una keyword come “how do i make the font larger in coffee cup html editor” (“come si ingrandisce il font nell’editor html coffee cup”), perché non ha volume di ricerca…… e la pagina posizionata meglio non ottiene traffico dalla ricerca organica:Il volume di ricerca è un indicatore sensato per il potenziale di traffico di questa keyword, tuttavia può essere fuorviante.Dai un’occhiata a queste due keyword:La prima ha un volume di ricerca mensile maggiore, ma il risultato meglio posizionato ottiene soltanto un volume stimato di visite mensile dagli USA pari a 65…… contro le 191 visite registrate dalla pagina posizionata al primo posto per la keyword con volume minore:Questo avviene perché la pagina posizionata per la keyword con volume più basso fa parte di un topic più ampio e riceve traffico da altre keyword.Detto in altre parole, ci sono più persone che cercano un tutorial di Coffecup anziché una recensione.Riassumendo: il volume di ricerca è un buon modo per filtrare le keyword potenzialmente interessanti, ma devi sempre ricordarti di controllare il traffico stimato verso le pagine posizionate per poter capire meglio qual è il vero potenziale di traffico proveniente dalla ricerca.4. Rispondere all’intenzione di ricercaNessuno vuole ritrovarsi davanti a delle pagine di prodotto nella SERP corrispondente alla keyword “how to make a protein shake” (“come si fa un frullato proteico”).L’intenzione di chi fa una ricerca con quella keyword è quella di imparare qualcosa, non di comprare qualcosa.Google capisce l’intenzione di ricerca, ed è per questo che tra i risultati in cima alla SERP ci sono dei post di blog, e non delle pagine che vendono proteine in polvere.Per una query di ricerca come “buy protein powder” (“comprare proteine in polvere”) vale il ragionamento opposto.Le persone in questo caso non cercano la ricetta di un frullato proteico, ma vogliono comprare delle proteine in polvere. È per questo che la maggior parte dei primi 10 risultati in SERP è costituita da pagine di categoria di siti e‑commerce, e non da post di blog.Esaminare i primi risultati in SERP in questo modo può dirti molto sull’intenzione di ricerca che c’è dietro a una query, e questo può aiutarti a capire il tipo di contenuto che dovresti creare se desideri posizionarti.Esaminiamo una keyword un po’ meno ovvia: “best eye cream” (ovvero “miglior crema occhi”), che, secondo la stima, negli Stati Uniti viene cercata 21.000 volte al mese.Se vendi creme per gli occhi potrebbe sembrarti perfettamente logico cercare di posizionare una pagina di prodotto per questa keyword. Tuttavia i risultati in SERP raccontano una storia un po’ diversa:Quasi tutti sono dei post di blog costruiti a mo’ di lista, e non delle pagine di prodotto.Per avere una qualche possibilità di posizionarti per questa keyword, dovresti seguire il loro esempio.Capire l’intento di ricerca non vuol dire soltanto creare un certo tipo di contenuto. Bisogna anche tenere in considerazione il format del contenuto e la prospettiva da cui lo si crea.Per capire meglio questi due fattori, puoi leggere la nostra guida all’ottimizzazione secondo l’intenzione di ricerca.5. Scegliere un argomento più specificoLe keyword competitive spesso sono appannaggio di brand potenti con profili di backlink di tutto rispetto e risorse finanziarie pressoché illimitate.Dai un’occhiata al numero di domini che puntano alle pagine posizionate per “best credit card” (“miglior carta di credito”):I risultati sono dominati da grandi nomi come NerdWallet, Credit Karma e CreditCards.com e la media di domini (backlink da siti unici) che linkano ai primi cinque risultati supera i 300.Posizionarsi per questa keyword sul breve o sul medio periodo sarebbe impossibile per il 99% delle persone.Ecco perché una strategia vincente consiste nel cercare di posizionarsi per keyword più specifiche su cui si può dire la propria.In questo caso si potrebbe provare con una keyword come “best credit cards for lounge access” (miglior carta credito per accesso lounge):Il volume di ricerca e il potenziale di traffico organico sono molto inferiori rispetto a quelli per una keyword competitiva come “best credit cards” (“migliori carte di credito”), ma ci sono meno grandi nomi con cui competere e non avrai bisogno di così tanti backlink per posizionarti.Ma come si fa a trovare argomenti più specifici per cui posizionarti?Vai sul Keywords Explorer di Ahrefs’, cerca un topic generico e seleziona il rapporto “Phrase match”. Poi filtra selezionando le keyword con un punteggio di Keyword Difficulty basso: un punteggio inferiore a 20 è sufficiente come buon punto di partenza.Se i suggerimenti non sono rilevanti, usa il filtro “Include” per restringere la ricerca. Ad esempio filtriamo la lista in modo tale che comprenda solo le keyword che contengono la parola “best” (“migliore”).Poi puoi controllare la SERP per capire meglio il livello di difficoltà e di competitività.https://www.youtube.com/watch?v=jSOq3ysvBk86. Usare le keyword da posizionare in tre postiTutti i topic di ricerca hanno una keyword “principale”, che corrisponde alle parole più usate con cui le persone cercano l’argomento della pagina.Per un post che riguarda il modo per perdere peso in maniera naturale, ad esempio, la keyword principale è “lose weight naturally” (“perdere peso naturalmente”):Ecco i tre posti in cui dovresti inserire questa keyword:a) Tag TitleGoogle consiglia di scrivere tag Title che descrivano il contenuto della pagina in modo accurato. Se stai puntando a posizionarti per una keyword o una frase specifica, dovresti seguire questo consiglio.Questo inoltre dimostra a coloro che stanno facendo la ricerca che la pagina offre ciò che vogliono, perché è in linea con la loro ricerca.Si tratta di un fattore di ranking molto importante? Forse no, ma vale comunque la pena di implementarlo.Noi lo mettiamo in pratica in quasi tutti i post del nostro blog:Ricordati però di non forzare la keyword quando non ha senso. L’aspetto più importante di tutti rimane sempre la leggibilità.Ad esempio se la keyword da posizionare è “kitchen cabinets cheap” (“pensili cucina economici”), scritta così non ha senso come tag Title. Non aver paura di cambiare l’ordine delle parole o di inserire delle stop word per trasformarla in frase che abbia senso: Google è abbastanza intelligente da capire che cosa vuoi dire.b) Titolo (H1)Tutte le pagine dovrebbero avere un titolo H1 visibile su pagina, e il titolo dovrebbe comprendere la keyword da posizionare, purché abbia senso per il lettore.c) URLGoogle consiglia di costruire gli URL usando parole rilevanti per il contenuto della pagina.Usare la parola chiave che si sta tentando di posizionare spesso è il modo più semplice per ottenere questo risultato:7. Usare un URL breve e descrittivoGoogle consiglia di non usare URL lunghi perché potrebbero non essere graditi da chi compie le ricerche.Per questo motivo usare come URL le parole esatte con cui è formulata la query di ricerca non è sempre la cosa migliore.Immagina che la keyword che vuoi posizionare sia “how to get rid of a tooth abscess without going to the dentist” (“come curare un ascesso senza andare dal dentista”). Non solo curarsi da sé non è una buona idea, ma nei risultati di ricerca la frase rimarrà troncata.Togliendo le stop word e i dettagli non necessari, avrai un URL più breve e leggibile e riuscirai a mantenere visibili le parole importanti.Ciò detto puoi darci un taglio (no, non ai denti!) e descrivere la pagina in un modo ancor più breve, se necessario.Nota che, se il CMS che stai usando ha già una struttura degli URL predefinita brutta a vedersi, non è un grosso problema. Certamente non vale la pena fare mille salti mortali per risolverlo, perché Google al giorno d’oggi visualizza l’URL completo per sempre meno risultati di ricerca.8. Scrivere un titolo e una descrizione interessanti Ottimizzare per i motori di ricerca non significa soltanto migliorare i posizionamenti, ma anche indurre le persone a fare clic.Sia il tag title che la meta description compaiono nei risultati di ricerca: ecco perché devi scriverli in modo tale da renderli interessanti.ahrefs.com>blog>post-di-blogQuesto è il tag title28 Gen 2020 — Questa è la meta description. Google a volte la sostituisce con uno snippet scelto da lui, ma spesso mantiene la meta description che hai scelto tu.Nota a margine. Google non visualizza sempre nei risultati di ricerca il titolo e la descrizione scritti dall’utente. Spesso riscrive il titolo e sceglie una descrizione più appropriata della pagina da visualizzare nello snippet. Il tag title e la description in pratica sono il tuo sales pitch.Se nessuno dei due ha quel qualcosa in più, chi fa la ricerca farà clic su un altro risultato. Ma, oltre a comprendere la keyword da posizionare, in quali altri modi si può migliorare il CTR?Primo: cerca di mantenere il tag Title al di sotto dei 60 caratteri e le description sotto i 150 caratteriSecondo: formatta i Title come titoli e le description come testo.Terzo: il Title e la description devono rispecchiare le intenzioni di ricerca.Ad esempio quasi tutti i risultati per la keyword “best headphones” (“migliori cuffie”) specificano l’anno nei title e nelle description.Questo perché le persone vogliono un elenco di recensioni aggiornate, perché con il passare del tempo vengono messe in commercio sempre nuove cuffie.Quarto: usa le power words per generare più clic, senza dar l’impressione di star facendo del clickbaiting.Ricette per pancake morbidi e deliziosiPer scoprire come creare un titolo perfetto, puoi leggere qui o guardare questo video.https://www.youtube.com/watch?v=jqEoZsIOrYw9. Ottimizzare le immaginiComprimere le immagini è fondamentale per un caricamento rapido delle pagine, ma non è l’unico modo per ottimizzare le immagini per la SEO.C’è un’altra cosa che dovresti fare: aggiungere gli alt tag e usare nomi file descrittivi.Queste due azioni aiutano Google a capire le immagini e questo può servire per posizionare le pagine per keyword long tail nella ricerca web e nella ricerca per immagini.Alt text is extremely helpful for Google Images — if you want your images to rank there. Even if you use lazy-loading, you know which image will be loaded, so get that information in there as early as possible & test what it renders as.— 🍌 John 🍌 (@JohnMu) September 4, 2018L’alt text è molto utile per Google Immagini, se vuoi che le tue immagini si posizionino. Anche se usi il lazy loading, sai quale immagine viene caricata e hai l’informazione a disposizione il prima possibile per farti un’idea di come sarebbe resa l’immagine.Non sottostimare l’importanza di Google Immagini. A noi è servito per farci trovare da più di 5.500 clic negli ultimi tre mesi:Tipo di ricerca: ImmaginiData: ultimi 3 mesiClic totaliImpression totali:Ottimizzare i nomi file è semplice. Basta descrivere l’immagine a parole e separare le parole con dei trattini alti.Ecco un esempio:Nome file: l-uomo-più-figo-del-mondo.jpgPer i tag alt, bisogna fare la stessa cosa, usando gli spazi anziché i trattini alti.<img src=\".../l-uomo-più-figo-del-mondo.jpg\" alt=\"l’uomo più figo del mondo\">L’alt text è importante non solo per Google, ma anche per chi visita il sito.Se un’immagine non si carica, il browser mostrerà a schermo il tag alt per spiegare quale sarebbe dovuto essere il contenuto dell’immagine:Intermezzo: outreach o spam?Ecco un’e‑mail che ho ricevuto l’altro giorno:email di outreach fatta con un templateTu come la chiameresti? Mail di outreach o SPAM?Inoltre circa 8,1 milioni di persone negli Stati Uniti soffrono di disturbi della vista e magari usano uno screen reader che riconosce e legge ad alta voce gli alt tag.Ti consigliamo di leggere: Image SEO: 12 Actionable Tips (for More Organic Traffic)10. Scrivere contenuti approfonditiIn precedenza abbiamo ricordato che il volume di ricerca non è sempre un buon predittore del traffico da organico potenziale, perché molte pagine ottengono traffico anche dalle ricerche long tail.Ad esempio questa pagina è posizionata in cima alla SERP per “best laptop brands” (“migliori marche portatili”)…… ma è anche nelle prime dieci posizioni per più di 300 altre keyword come “best computer brands” (“migliori marche di computer”) e “is lenovo a good brand” (“Lenovo è una buona marca”):Non c’è niente di strano in questo.La nostra ricerca su tre milioni di query di ricerca ha scoperto che in media la pagina al primo posto in SERP per una keyword si posiziona nelle prime 10 posizioni per circa 1.000 altre keyword.Come si fa a posizionarsi per diverse query di ricerca? Bisogna creare un contenuto più approfondito.Attenzione però: non stiamo parlando della lunghezza del contenuto, ma del fatto di affrontare sottoargomenti rilevanti che le persone effettivamente cercano. Questo discorso vale soprattutto per il contenuto SEO informativo, come i post dei blog, ma può anche essere utile per altri tipi di contenuti.Ecco tre modi per trovare i sottoargomenti:a) Cercare le keyword rilevanti nelle pagine posizionate meglioSe esaminiamo una delle pagine meglio posizionate per “best laptop brands” (“migliori marche di portatili”) vediamo keyword rilevanti come “dell”, “hp”, “quality” (“qualità”), “reliability” (“affidabilità”) e “hardware”.b) Esaminare anche i risultati delle Ricerche correlatePer la keyword “best laptop brands” (“migliori marche di portatili”) vediamo diverse domande che vertono sull’affidabilità.Ricerche correlateQuali sono le marche di portatili più affidabili?Quali sono le 5 migliori marche di portatili?Qual è la marca di portatili migliore del 2019?Quale marca di portatili dura più a lungo?c) Fare un’analisi del Content GapCopia gli URL delle prime tre pagine meglio posizionate nello strumento Content Gap di Ahrefs’. Lascia vuoto il campo in basso e fai clic su “Show keywords”.Quest’analisi mostra le altre query per cui sono posizionate una o più delle pagine più in alto in SERP.Deseleziona le intersezioni 1 e 2 per rifinire ulteriormente i risultati.11. Aggiungere link interni da altre pagine rilevantiI link interni sono quelli che collegano tra loro diverse pagine dello stesso sito.In generale più link ha una pagina (sia da sorgenti esterne che interne) più alto è il suo PageRank. Questa è la fondamenta dell’algoritmo di ranking di Google e rimane importante ancora oggi.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理／경리” Illyes (@methode) February 9, 2017Lo sapevate che dopo 18 anni usiamo ancora il PageRank (e centinaia di altri segnali) per il posizionamento? Volete sapere come funziona?Sfortunatamente Google ha smesso di rendere pubblici i risultati del PageRank nel 2016, quindi ora non c’è più modo di calcolarli. Tuttavia l’URL Rating di Ahrefs’ è una metrica simile, che correla con i posizionamenti.I link interni inoltre aiutano Google a capire di che cosa parla la pagina.Most links do provide a bit of additional context through their anchor text. At least they should, right‽— 🍌 John 🍌 (@JohnMu) November 23, 2017La maggior parte dei link forniscono un po’ di contesto aggiuntivo con l’anchor text. O almeno dovrebbero, vero?Fortunatamente la maggior parte dei CMS aggiunge di default link interni verso le nuove pagine da almeno un’altra pagina del sito. “La pagina del sito” in questione può essere la barra del menu, la homepage del blog o qualche altra pagina.Tuttavia una buona pratica da seguire è quella di aggiungere link interni da altre pagine rilevanti tutte le volte che si pubblica qualcosa di nuovo.Per farlo è sufficiente cercare su Google usando il comando site:tuodominio.com [argomento della pagina]Questo comando restituirà le pagine più rilevanti del tuo sito che riguardano quell’argomento:Cerca i posti giusti per aggiungere link interni nelle pagine più adatte!Puoi anche trovare opportunità per creare link interni nel Site Explorer di Ahrefs’. Copia e incolla il tuo dominio, poi vai al rapporto “Best by Links” che visualizza tutte le pagine del tuo sito ordinate per URL Rating:Cerca le pagine rilevanti e aggiungi i link interni quando lo ritieni necessario e opportuno.Per approfondire: Internal Links for SEO: An Actionable Guide12. Ottenere più backlinkI backlink sono le fondamenta dell’algoritmo di Google e rimangono uno dei fattori di ranking più importanti.Lo conferma anche Google nella sua pagina “come funziona la ricerca”, quando afferma:Se altri siti rilevanti per l’argomento linkano alla pagina, è un buon indice che l’informazione della pagina sia di alta qualità.Ma tutto ciò che dice Google va verificato…La nostra ricerca effettuata su più di un miliardo di pagine dimostra che esiste una correlazione evidente tra il traffico organico e il numero di siti che linkano a una pagina:Ricordati che stiamo parlando di qualità, e non di numeri puri e semplici.Dovresti puntare a costruire backlink da pagine e siti autorevoli e rilevanti.Per capire com’è fatto un buon backlink può dare un’occhiata qui o guardare questo video:https://www.youtube.com/watch?v=E3mDlVutW_oUn’ultima cosa…Le buone pratiche sono un buon punto di partenza, ma spesso da sole non bastano per posizionarsi. Esistono altri fattori di ranking importanti da tenere a mente e altri modi per migliorare la SEO.Se ti trovi ancora in alto mare e stai lottando per posizionarti, leggi questo post o guarda questo video:https://www.youtube.com/watch?v=Rm1MbJneLSITradotto da Elisa Bruno. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Le 12 buone pratiche SEO che tutti dovrebbero seguire"
    },
    {
      "level": "H2",
      "text": "1. Usare il protocollo HTTPS"
    },
    {
      "level": "H2",
      "text": "2. Ottimizzare i tempi di caricamento"
    },
    {
      "level": "H2",
      "text": "3. Trattare un topic con “potenziale di traffico di ricerca”"
    },
    {
      "level": "H2",
      "text": "4. Rispondere all’intenzione di ricerca"
    },
    {
      "level": "H2",
      "text": "5. Scegliere un argomento più specifico"
    },
    {
      "level": "H2",
      "text": "6. Usare le keyword da posizionare in tre posti"
    },
    {
      "level": "H3",
      "text": "a) Tag Title"
    },
    {
      "level": "H3",
      "text": "b) Titolo (H1)"
    },
    {
      "level": "H3",
      "text": "c) URL"
    },
    {
      "level": "H2",
      "text": "7. Usare un URL breve e descrittivo"
    },
    {
      "level": "H2",
      "text": "8. Scrivere un titolo e una descrizione interessanti"
    },
    {
      "level": "H2",
      "text": "9. Ottimizzare le immagini"
    },
    {
      "level": "H2",
      "text": "10. Scrivere contenuti approfonditi"
    },
    {
      "level": "H3",
      "text": "a) Cercare le keyword rilevanti nelle pagine posizionate meglio"
    },
    {
      "level": "H3",
      "text": "b) Esaminare anche i risultati delle Ricerche correlate"
    },
    {
      "level": "H3",
      "text": "c) Fare un’analisi del Content Gap"
    },
    {
      "level": "H2",
      "text": "11. Aggiungere link interni da altre pagine rilevanti"
    },
    {
      "level": "H2",
      "text": "12. Ottenere più backlink"
    },
    {
      "level": "H2",
      "text": "Un’ultima cosa…"
    }
  ],
  "author": "Joshua Hardwick"
}