{
  "url": "https://ahrefs.com/blog/it/come-scegliere-le-parole-chiave-per-la-seo/",
  "slug": "come-scegliere-le-parole-chiave-per-la-seo",
  "title": "Come Scegliere le Parole Chiave Giuste per la SEO",
  "description": "Le parole chiave che scegli possono garantirti il successo nella SEO o distruggerla. Ecco come scegliere le parole chiave corrette in quattro mosse.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Le parole chiave che scegli possono far decollare la tua SEO o ostacolarla totalmente.Se scegli in maniera giusta le parole chiave, produrrai contenuti che possono potenzialmente attrarre traffico organico di valore mese dopo mese. Se scegli quelle sbagliate, il tuo contenuto attrarrà poco traffico, o nulla.Come si fa quindi a scegliere le giuste parole chiave per la SEO?Molte persone tendono a complicare eccessivamente il processo, ma la realtà dei fatti è che non è così difficile.Ecco come farlo in quattro mosse:Trova parole chiave con potenziale di traffico organicoAssicurati di creare contenuti che si allineino all’interno di ricercaAssicurati che la parola chiave abbia “potenziale aziendale”Assicurati di posizionarti per la parola chiave1. Trova parole chiave con potenziale di traffico organicoA meno che le persone stiano attivamente cercando una parola chiave, non ha senso cercare di intercettarla. Questo in quanto posizionarsi per una parola chiave che nessuno cerca non porterà alcun traffico. Semplicemente non ha potenziale.Per identificare le parole chiave che le persone ricercano, hai bisogno di un tool per fare keyword research.Google ne ha uno gratuito chiamato Keyword Planner. È piuttosto semplice da utilizzare: inserisci un argomento e tira fuori automaticamente idee di parole chiave pertinenti assieme ai relativi volumi di ricerca.Ad esempio, ecco alcune idee ed i relativi volumi che ci fornisce inserendo “cibo per cani”, o “dog food” in inglese:Sfortunatamente, Google Keyword Planner ha un difetto maggiore: mostra solo i volumi di ricerca sotto forma di intervalli, non i volumi di ricerca effettivi (a meno che tu non abbia annunci attivi).Alcuni di questi intervalli sono poi piuttosto grandi. Come puoi notare alcune delle parole chiave qui sopra cadono in un intervallo compreso fra 10K e 100K. Questo rende molto complicato capire a quali parole chiave dare priorità, in quanto l’intervallo è piuttosto ampio. La parola chiave potrebbe ottenere 10k ricerche mensili, oppure 40k, 80, 100k, non c’è modo di saperlo.Per ottenere una stima più accurata dei volumi di ricerca, hai bisogno di un tool di terze parti come il Keywords Explorer. Questo tool funziona in maniera simile a GKP. Inserisci un argomento/parola chiave seed, e ti mostra idee di parole chiave insieme ai corrispondenti volumi di ricerca mensili.La differenza sta nel fatto che le stime dei volumi sono molto più precise, e solitamente sono presenti anche più idee rispetto a GKP.Ad esempio, se inseriamo nuovamente “cibo per cani” (o “dog food” in inglese), e andiamo ad analizzare poi il report chiamato Matching terms, otteniamo oltre 416,000 idee assieme ai volumi di ricerca e altri dati:In generale, le parole con i volumi di ricerca più alti hanno un maggiore potenziale di traffico. Posizionandoti però in cima per alcune parole chiave, potresti ottenere più traffico di quello che immagini, indipendentemente dal volume di ricerca.Ad esempio, ecco i volumi di ricerca per “miglior cibo per cani” (o “best dog food” in inglese).69K. Piuttosto alto.Ma se scorri fino alla panoramica SERP noterai che la stima del traffico potenziale dalla pagina meglio posizionata è in realtà molto più alto:La pagina meglio posizionata ottiene infatti una stima di 144,298 visite organiche mensili. Questo è più del doppio del volume di ricerca stimato per “miglior cibo per cani” (o “best dog food” in inglese).D’altro canto però, alcune parole chiave porteranno molto meno traffico di quello che ti aspetti, indipendentemente dai loro volumi. Ad esempio, la parola chiave “cibo per cuccioli” (o “puppy food” in inglese), ha un volume di ricerca di 22K……ma la pagina meglio posizionata ottiene solo una stima di 7K visite mensili:Quindi, quando stai cercando una parola chiave con potenziale di traffico, non fare mai affidamento in maniera esclusiva sul volume di ricerca. Controlla anche quanto traffico ottiene la pagina meglio posizionata, in quanto è una stima migliore del potenziale di traffico per quell’intera tematica.2. Assicurati di creare contenuti che si allineino all’intento di ricercaParlando in maniera piuttosto generica, chi ricerca vuole compiere una delle seguenti tre azioni quando inserisce qualcosa su Google:Imparare qualcosaAcquistare qualcosaTrovare uno specifico sitoQuesto prende il nome di intento di ricerca (ovvero l’intento che si cela dietro la ricerca dell’utente).Quando scegli le parole chiave da intercettare, è importante scegliere solo parole chiave per le quali sei in grado di produrre contenuti che si allineino all’intento di ricerca. Questo in quando Google non posizionerà tipologie di contenuti che non combaciano con quello che l’utente cerca.Per alcune parole chiave, l’intento di ricerca è piuttosto ovvio analizzando la keyword stessa. Se qualcuno cerca “come addestrare un cane” su Google, è chiaro che vuole informazioni, e non acquistare qualcosa. Dovrai quindi creare con molta probabilità un articolo di blog per posizionarti per quella parola chiave, non una pagina di vendita dove proponi i tuoi servizi di addestramento cani.Per altre parole chiave però, l’intento di ricerca è un po’meno… ovvio.Prendiamo ad esempio la parola chiave “proteine in polvere vegane” (o “vegan protein powder” in inglese). La persona che cerca vuole acquistare proteine in polvere vegane, scoprire quali siano le migliori e le peggiori o qualcos’altro?Il modo migliore per scoprirlo e rispondere alla domanda, è analizzare i risultati di ricerca.Se facciamo ciò, possiamo vedere che virtualmente tutti i risultati di ricerca sono articoli di blog che listano le migliori proteine in polvere. È quindi chiaro che tutti quelli che ricercano vogliono informazioni, e non acquistare.A meno che tu non abbia un blog, questa non è probabilmente una parola chiave per la quale tu puoi posizionarti.Analizziamo i risultati per un’altra parola, “cuccia per cani” (o “dog kennel” in inglese):In questo caso, praticamente tutti i risultati meglio posizionati sono pagine di categoria da ecommerce ben conosciuti. È quindi chiaro che chi ricerca voglia acquistare. Non ha quindi senso andare dietro a questa parola chiave a meno che tu non abbia un ecommerce che vende casette per cani e che tu possa creare una specifica pagina categoria.Diamo uno sguardo ai risultati per un’altra parola chiave, “cibo per cani chewy” (o “chewy dog food” in inglese):Questa volta, i risultati sono tutti da uno specifico brand: Chewy. Diventa chiaro che chi ricerca sta cercando uno specifico sito. Non hai quindi possibilità di posizionarti per questa parola chiave, in quanto non sei quel brand.Stiamo solo analizzando l’intento di ricerca in maniera superficiale in questo caso, quindi leggi l’articolo qui sotto se vuoi approfondire la questione.Lettura consigliata: Intento di Ricerca: la Guida Completa per Principianti3. Assicurati che la parola chiave abbia “potenziale aziendale”Il “potenziale aziendale” descrive quanto lucrativo sarebbe posizionare la tua azienda per una determinata parola chiave.Se l’intento di ricerca richiede una pagina prodotto o categoria, rispondere alla domanda è piuttosto semplice. Basta chiederti se vendi il prodotto o una sua variante. Se la risposta è sì, la parola chiave ha potenziale aziendale.Se però l’intento di ricerca richiede un articolo di blog o un’altra forma di informazioni, la domanda diventa un pò più complicata. Questo in quanto devi considerare se puoi riuscire a promuovere il tuo prodotto o servizio in maniera naturale all’interno del contenuto.Ad esempio, per Ahrefs, una parola chiave come “come fare una keyword research” ha un alto potenziale aziendale, in quanto vendiamo un tool SEO che aiuta le persone a fare keyword research. È facile per noi promuovere il nostro prodotto all’interno di un articolo simile senza suonare troppo promozionali. (Hai probabilmente notato che lo abbiamo fatto anche in questo articolo).Ma una parola chiave come “come installare Google Analytics” ha un “basso potenziale aziendale” per Ahrefs. Il motivo è che non c’è modo di proporre il nostro prodotto in quella tematica. Il nostro tool non può aiutare le persone ad installare Google Analytics. Quindi anche se l’articolo sarebbe in tema con la nostra audience, il potenziale aziendale è basso.Ecco la scala che utilizziamo per identificare il potenziale aziendale per un articolo di blog:Ricordati che scegliere parole chiave con potenziale aziendale non significa che tu debba rendere il contenuto promozionale. Al contrario. Dovresti scegliere parole chiave dall’alto potenziale aziendale in modo che ogni menzione e proposta relativa al tuo prodotto o servizio sia utile e aiuti la tua audience a risolvere il proprio problema.4. Assicurati di posizionarti per la parola chiaveIn teoria, chiunque può posizionarsi per qualsiasi parola chiave con il giusto sforzo.Ma la realtà dei fatti è che posizionarsi per alcune parole chiave è più difficile di altre, specialmente nel breve e medio periodo. Dovresti quindi farti un’idea della difficoltà per la parola chiave scelta prima di provare a inseguirla.Il modo più semplice per dare un confronto in relazione alla difficoltà di posizionamento per le parole chiave è utilizzando un punteggio di keyword difficulty. La maggior parte dei tool SEO ne possiede uno, e il nostro è chiaramente chiamato proprio Keyword Difficulty (KD).Puoi vedere i punteggi KD affianco alle parole chiave nel Keywords Explorer:Ogni tool SEO misura il punteggio di difficoltà per una data parola chiave in modo differente. Noi basiamo il nostro sul numero di backlink che ricevono le pagine meglio posizionate. In altre parole, maggiore è il punteggio KD di una parola chiave, maggiore è il numero di backlink di cui avrai bisogno per posizionarti sulla prima pagina di Google.Puoi filtrare le parole chiave in base al punteggio KD all’interno del Keywords Explorer. Quindi, se vuoi vedere solo quelle a bassa difficoltà, imposta il valore massimo del filtro su di un valore come ad esempio 10:È importante menzionare che ci sono molti altri fattori che contribuiscono alla reale difficoltà di posizionamento per una parola chiave, e non dovresti quindi fare affidamento solo ai punteggi che ti vengono forniti dai tool SEO. Questi punteggi esistono per farti avere un’idea e aiutarti ad identificare parole chiave a bassa difficoltà in base ad alcuni criteri. Nel nostro caso, questo è il numero di backlink di cui hai probabilmente bisogno per competere.Se vuoi approfondire quali sono gli altri fattori che dovresti considerare quando cerchi parole chiave a bassa competizione, dai uno sguardo alla risorsa qui sotto.Lettura consigliata: Come Trovare Parole Chiave a Bassa Competizione nella SEOConclusioneScegliere le giuste parole chiave per la SEO non è così complicato. Devi identificare parole chiave per le quali:Il potenziale di traffico è elevato.Il potenziale aziendale è elevato.Puoi creare contenuti che si allineano agli intenti di ricerca.Hai effettivamente la possibilità di posizionarti.Potrebbe volerci un pò a filtrare tutte le parole chiave per trovare quelle giuste, ma è sicuramente fattibile.Per il dettaglio completo sul processo di keyword research, guarda questo video o leggi la nostra guida per principianti alla keyword research. Entrambe le risorse spiegano i principi fondamentali della keyword research e come condurne una dall’inizio alla fine.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Come Scegliere le Parole Chiave Giuste per la SEO"
    },
    {
      "level": "H2",
      "text": "1. Trova parole chiave con potenziale di traffico organico"
    },
    {
      "level": "H2",
      "text": "2. Assicurati di creare contenuti che si allineino all’intento di ricerca"
    },
    {
      "level": "H2",
      "text": "3. Assicurati che la parola chiave abbia “potenziale aziendale”"
    },
    {
      "level": "H2",
      "text": "4. Assicurati di posizionarti per la parola chiave"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Joshua Hardwick"
}