{
  "url": "https://ahrefs.com/blog/it/come-cercare-parole-chiave-con-google-trends/",
  "slug": "come-cercare-parole-chiave-con-google-trends",
  "title": "Come cercare le parole chiave con Google Trends: 7 metodi efficaci",
  "description": "Google Trends è spesso sottostimato quando si ricercano le parole chiave. Impara ad usare le funzionalità meno note di questo strumento.",
  "content": "Nick Churick Nick è il nostro vero “Communications Manager” @Ahrefs (per quello che può significare) e, casualmente, è anche piuttosto bravo a scrivere. Per cui eccolo qua: ora è diventato un collaboratore regolare del nostro blog. Contenuti Sono sicuro che, se hai effettuato una ricerca di parole chiave, hai utilizzato Google Trends per conoscere l’interesse di una data parola. Tuttavia, ancora molte persone che lavorano nel settore SEO non utilizzano tutto il potenziale di questo tool straordinario.Per questo motivo abbiamo deciso di scrivere un articolo dedicato a Google Trends.In questo articolo, descriveremo alcuni metodi interessanti per aiutarti nella ricerca di parole chiave e definire la strategia di content marketing, grazie a Google Trends.Come prima cosa, iniziamo a definire cos’è Google Trends (e cosa non è).Ecco tutto quello che devi sapere sui dati usati da Google Trends (e come vengono usati)…Quando ho iniziato a preparare questo articolo, mi son reso conto che in Internet circolano dei dubbi riguardo i dati di Google Trends. Molti pensano che i grafici visualizzati da Trends siano la rappresentazione diretta del volume di ricerca delle query nel tempo (come quella che puoi vedere nel tool Google Keyword Planner). Non è una definizione esatta del funzionamento.Permettimi di mostrarti i grafici dei trend delle parole chiave “flowers” in Google Trends e GKP:Nota a margine. Non puoi più visualizzare questi grafici in Google Keyword Planner almeno che tu non spenda una certa somma con le pubblicità AdWords.Come puoi vedere, i grafici si assomigliano abbastanza, ma non sono identici.Mentre Google Keyword Planner mostra i volumi di ricerca assoluti, Google Trends mostra la popolarità relativa di una query ricercata. Qui c’è la spiegazione fornita da Google Trends Help Center: Google Trends adatta i dati di ricerca per facilitare il confronto tra le diverse query. I valori vengono divisi per il numero totale di ricerche nel tempo ed area geografica rappresentata, per comparare la popolarità relativa. In altre parole, la popolarità relativa è il rapporto tra il volume di ricerca di una query e la somma del volume di ricerca di tutte le query possibili. I valori che ne risultano vengono scalati in una gamma da 0 a 100 in proporzione a tutte le ricerche analizzate. Google Trends elimina le ricerche ripetute dalla stessa persona in un breve lasso di tempo per fornirti un valore più realistico. Ed è importante notare che Google Trends mostra solamente i dati dei termini più usati (i bassi volumi vengono visualizzati a 0).Ecco il grafico di Google Trends per la query “Facebook” nei precedenti 12 mesi (negli USA):Per farti vedere come Google Trends crea il grafico “Interesse nel tempo”, facciamo finta che io abbia le stesse informazioni che ha Google (purtroppo, non ho i dati precisi).I numeri che userò qui non hanno la pretesa di essere precisi perché non lo sono. Ci servono solamente come assunzioni per simulare il funzionamento del tool.Ipotesi 1: il numero totale di ricerche al mese su Google è di circa 10 miliardi. (Fonte)Ipotesi 2: il volume di ricerca della query “Facebook” negli USA è 83 milioni (secondo Ahrefs Keywords Explorer)Qui c’è la tabella che ho creato per questa simulazione:Per realizzare un grafico allo stesso modo in cui lo fa Google Trends, devi seguire questi passaggi:Calcolare la popolarità relativa come rapporto tra il volume di ricerca della query e il totale delle ricerche.Scalare questi valori proporzionalmente per ottenere un valore massimo di 100.Inserire i punti nel grafico.Questo esempio ci insegna 2 cose:La popolarità di ricerca di un termine cambia a seconda del volume delle ricerche (vedi May 2017 — June 2017). E’ abbastanza ovvio, vero?La popolarità di ricerca di un termine cambierà al variare del numero totale delle ricerche, anche se il volume di ricerca della query rimane costante (vedi June 2017 — July 2017 nel mio esempio qui sopra).Ora puoi vedere che la popolarità visualizzata da Google Trends non è sempre correlata al volume della ricerca della query. Lo è, in molti casi.Per esempio, se prendi la parola chiave “Star Wars”, noterai che lo stesso picco (dicembre 2015) apparirà su Google Trends ed anche su Ahrefs Keywords Explorer.Questo accade nonostante Keywords Explorer mostri i trend dei volumi di ricerca, mentre Google Trends mostri la “popolarità” dei trend (come spiegato sopra).Ora lascia che ti mostri come potresti (e dovresti) usare Google Trends nelle attività di marketing online ed in particolare durante la ricerca di parole chiave.Preferisci un video? Guardalo qui.https://www.youtube.com/watch?v=wJxwrsBlohoOppure, continua a leggere.1. Identificare trend stagionali… quindi creare (e promuovere) contenuti nel momento ESATTO!Avrai capito che i volumi di ricerca per alcune parole chiave sono variabili in base al periodo.Ad esempio, guarda i dati di Google Trends per la parola chiave “umbrella” negli Stati Uniti.E qui i risultati per l’Australia:Puoi notare che la ricerca “umbrella” raggiunge il picco di popolarità nel mese di giugno, mentre in Australia il picco è in dicembre. Corrispondono ai mesi di inizio della stagione piovosa nei rispettivi paesi, e le persone si informano per cercare riparo dalla pioggia.Se la tua attività è di tipo stagionale, puoi verificare rapidamente i periodi di picco massimo e minimo analizzando le query di ricerca rilevanti su Google Trends.Con queste informazioni, puoi utilizzare due strategie:Creare contenuti rilevanti in coincidenza dei momenti di picco: Ad esempio, se vivi in Australia e vendi ombrelli, potrebbe aver senso la creazione di una “guida per prepararti alla stagione delle piogge” con la pubblicazione a dicembre. Dopo tutto, è il periodo nel quale i tuoi potenziali clienti ricercano frequentemente tali informazioni.Ottimizza le pagine con contenuti rilevanti prima del picco: Ipotizziamo che tu abbia già una “guida per prepararti alla stagione delle piogge” o magari anche una pagina dell’ecommerce con ombrelli in vendita. Avrebbe senso dare priorità all’ottimizzazione di queste pagine con un paio di mesi di anticipo rispetto al picco previsto (es.: 2–3 mesi prima di dicembre, se sei in Australia). Per esempio, potresti iniziare una campagna di link building ad ottobre—questa ti darà una spinta nel ranking in corrispondenza del periodo di maggiori ricerche.2. EVITA gli “unicorni delle parole chiave” controllando le distorsioni date dai picchi di popolaritàSe stai cercando di definire un buon argomento per i tuoi prossimi contenuti, non scrivere neanche una parola prima di aver controllato l’argomento con Google Trends.Dovrai cercare di evitare di perder tempo per argomenti con interesse decrescente.Ad esempio, secondo Keywords Explorer di Ahrefs, il termine “fidget spinner” ha un volume medio di ricerca di +900K.Mentre il termine “yoyo” ha una media di ricerche di soli 47K.Considerando che il valore di Keyword Difficulty (KD) di entrambe le parole chiave è simile, ha senso concentrarsi solamente a contenuti per il termine “fidget spinner”, giusto?EHM, NO.Ecco un confronto di entrambi i termini in Google Trends.Puoi notare che c’è stata una grande fiammata nella popolarità per “fidget spinner” a maggio 2017.Da allora, l’interesse è drasticamente calato—attualmente è quasi nullo.Dall’altro lato, l’interesse per i yoyo (adoro gli yoyo) è rimasto stabile.In effetti, se guardi attentamente, noterai che “yoyo” ora è più popolare del termine “fidget spinner”.3. Trova argomenti rilevanti che sono di moda PROPRIO ORA… ed usali a tuo vantaggioGrazie alle Tendenze di Ricerca, puoi trovare le query di ricerca che hanno avuto un balzo significativo di popolarità nelle ultime 24 ore (per ogni area geografica).Ma perché dovresti usare questi dati?Mettiamo il caso tu stia curando un blog di persone famose, le celebrity.E’ il 4 marzo 2018, controlli le Tendenze di Ricerca e trovi questo:Sembra che siano di moda le ricerche sugli Oscar!Ma se questi argomenti siano popolari, significa che sei arrivato tardi?Non è necessariamente vero.Ecco il grafico dei trend di ricerca per la frase “Oscars” per 7 giorni, tra il 2 marzo e il 9 marzo:Puoi notare che il 4 marzo—giorno in cui l’argomento era in tendenza su Google Trends—non era il giorno del picco; lo è il 5 marzo.Dal 6 marzo l’argomento è poi sensibilmente sceso.Anche se sembra che la finestra dell’opportunità sia molto piccola, in realtà l’opportunità c’è.Ma non è sempre così.A volte capita che Google Trends mette in evidenza gli argomenti di tendenza il giorno della raggiunta del picco massimo.Ad esempio, il termine “mother’s day” non è diventata una ricerca di tendenza fino all’11 marzo.Ma siccome l’11 marzo era il Mother’s Day (almeno qui in UK). l’interesse è immediatamente crollato dal giorno successivo.In questo caso specifico, almeno che tu non avessi già preparato dei contenuti in anticipo per il Mother’s Day, sarebbe stato troppo tardi.Quindi, come si fa a capire se una ricerca in tendenza ha già raggiunto il suo picco?Beh, se consideriamo un termine che verosimilmente è di tendenza con frequenza annuale, guarda al picco ottenuto l’anno precedente.Ad esempio, il Mother’s Day nel 2017 è avvenuto il 23 marzo. Di nuovo, ti invito a vedere il giorno di raggiunta del picco.Cercando nelle serie storiche, puoi fare delle previsioni per capire se un argomento crescerà o calerà.4. Usa i dati Google Trends per pianificare il calendario editorialeGuardiamo attentamente ai dati Google Trends per il termine “Oscars”.Se visualizziamo le ricerche in un lasso di tempo di 5 anni, possiamo vedere che il picco si verifica più o meno nello stesso periodo ogni anno; all’inizio del mese di marzo.Questo avviene perché gli Oscar si svolgono ogni anno a marzo.Quindi se hai un sito web sul gossip delle celebrity, considera la possibilità di annotarlo nel calendario dei contenuti.Poi assicurati di produrre dei contenuti su questo argomento a marzo di ogni anno.(So a cosa stai pensando…questo esempio era banale, giusto? Voglio dire, se stai gestendo un sito di gossip e celebrity, probabilmente il tema è già trattato). Prendiamo in esame un esempio meno ovvio:Qui sopra, puoi vedere un picco che ha frequenza grossomodo mensile.Indovina la query di ricerca?“Full moon.”Con questa informazione, come potresti adattare il calendario editoriale? Di sicuro, pubblicare un nuovo post ogni mese dedicato alla luna piena non avrebbe senso, sei d’accordo?Certo, ma potresti creare UN articolo e poi aggiornarlo con nuove informazioni ogni mese 🙂Questo è ciò che fa Space.com con il loro calendario della luna piena.Tutto ciò che devono fare è aggiornare alcune date ed informazioni ogni mese.Probabilmente non è molto impegnativo, ma permette ai contenuti di essere sempre aggiornati con le ultime novitàNOTA DEL REDATTOREVuoi vedere un esempio ancora meno ovvio?Controlla i dati Google Trends per “vestiti spaventosi”.C’è un picco nella popolarità di questa ricerca ad ottobre di ogni anno (Halloween).Qual è il mio consiglio per questo termine?Pubblicare “XX vestiti più spaventosi del 20XX” ogni anno a metà ottobre. (Oppure aggiorna il post già pubblicato l’anno precedente).Facile, ma efficace. 🙂Joshua HardwickHead of Content5. Usa le “ricerche correlate” per trovare NUOVE idee per parole chiave (ED in caso RUBARNE ai tuoi concorrenti)Grazie a Google Trends puoi conoscere le query utilizzate dalle persone che cercano le tue parole chiave.Ad esempio, chi cerca “sneakers” solitamente cercherà anche “Nike” o “Adidas”.Nota a margine. Ci sono 2 opzioni disponibili per le query associate in Google Trends: “Più cercate” ed “In aumento”. Se vuoi conoscere le differenze tra queste 2 opzioni, clicca sul punto interrogativo vicino a “Query associate” nel l’interfaccia di Google Trends (suggerimento: puoi guardare lo screenshot qui sopra per vedere dov’è).Questo metodo è molto utile sia per trovare nuove parole chiave (es., a quelle a cui non avevi ancora pensato), sia per aiutarti a conoscere meglio i bisogni dei tuoi potenziali clienti e la loro “search journey”.Ma puoi andare anche un passo oltre e scoprire le query associate delle query associate.Qui ad esempio ci sono le query associate a “sneakers Nike” (una delle query associate della ricerca precedente).E puoi andare ancora oltre.Puoi annotarti le query suggerite da Google Trends ed usarle come parole chiave seme in Keywords Explorer. Così potrai disporre di ulteriori idee per le parole chiave.Da qui puoi applicare filtri di ricerca per Search Volume e Keyword Difficulty (KD) per individuare le migliori opportunità.consiglio: utilizza le query associate per individuare i concorrenti, poi crea un post della tipologia “tu vs. concorrente” per creare contenuti a tuo vantaggioLe persone probabilmente inseriranno il nome del tuo brand su Google.Ed oltre a te, quali concorrenti stanno cercando?Ecco come scoprirlo:Inserisci il nome del tuo brand su Google Trends, e guarda le query associate.Qui ci sono le query associate al termine “Ahrefs”.Si nota che le persone stanno cercando anche 3 dei nostri concorrenti.Queste persone sono, con molta probabilità, potenziali clienti di Ahrefs nel momento di scelta del loro servizio.Avrebbe quindi molto senso educare queste persone mostrando come Ahrefs si pone favorevolmente rispetto alla concorrenza.Potremo farlo creando alcuni post della tipologia “Ahrefs vs. concorrente” (es., “Ahrefs vs. Moz”).Infatti, abbiamo pianificato la creazione di questo tipo di contenuti in futuro. Al momento siamo concentrati con altri progetti, molto più importanti.Ecco un esempio da Asana di questo tipo di articoli.6. Verifica ESATTAMENTE quali province ed aree geografiche CERCANO i tuoi prodotti o servizi (e crea una strategia SEO localizzata)Google Trends ti permette di controllare dove (es.: paese, città, area) una query di ricerca è maggiormente usata.Queste informazioni sono la risposta ad una domanda fondamentale: dove sono maggiormente richiesti i tuoi prodotti o servizi?Vediamo dove c’è la maggior richiesta di stufe elettriche negli USA.Stati del Nord. Il che risulta abbastanza ovvio.E se volessimo avere i dati relativi alle città? Si possono avere, sempre con Google Trends.(Qualcuno da Portland? Com’è il meteo lassù?)E come si possono usare queste informazioni?Ecco un paio di idee:Mira a queste aree con PPC (es., AdWords) — Non sprecare soldi mirando a tutti gli Stati Uniti con Google AdWords. Attiva campagne pubblicitarie per le città e le aree solamente dove risiedono i tuoi potenziali clienti.Crea contenuti utili pensati specificatamente per i residenti di queste aree — Es., “Abiti a Seattle? Ecco come risparmiare sulle bollette per il riscaldamento il prossimo inverno”.Google Trends inoltre ti permette di confrontare come cambia l’interesse per una query di ricerca in base alla località (mi vergogno di aver scoperto questa possibilità solamente da qualche giorno).Per accedervi, clicca i 3 puntini nel lato destro di un riquadro di ricerca ed applica dei filtri rilevanti:Nello screenshot qui sotto, puoi vedere un esempio perfetto del concetto di “popolare” in Google Trends:Il volume di ricerca della query “Star Wars” è ovviamente molto più grande negli USA rispetto ad UK. Ma i grafici sono quasi identici. Significa che Star Wars ha la stessa popolarità in queste aree geografiche.consiglio: Usa questa tattica per scoprire le opportunità SEO localizzateImmagina di essere un commercialista che opera in Florida.Come fai a conoscere dove i tuoi servizi sono maggiormente richiesti?Semplice. Cerca “commercialista” in Google Trends, filtra per stato, poi controlla il dettaglio per “regione”.(Puoi anche controllare all’interesse per “città” per una visione più dettagliata).Ora che conosci dove i tuoi servizi sono maggiormente richiesti, puoi usare queste informazioni per la priorità delle azioni SEO. Es., potresti decidere di creare landing page dedicate ai residenti di Miami o Gainesville.Potresti inoltre usare queste informazioni per un piano di espansione delle tue attività—è davvero potente.7. Affina la tua strategia SEO video analizzando COSA le persone cercano su YouTubeGoogle possiede YouTube, ma ciò non significa che la popolarità di una query di ricerca è uguale in entrambe le piattaforme. Anzi, sicuramente non lo è.Per una dimostrazione, ecco i dati di ricerca sul web da Google Trends per “HTML tutorial” dal 2008.Puoi vedere molto chiaramente che la popolarità di questa query è caduta in maniera consistente.E qui c’è il grafico della tendenza per YouTube.Si, con Google Trends si possono filtrare i risultati di YouTube—selezionando “Ricerca di YouTube” nel menù a tendina)Curiosamente, qui troviamo i valori opposti—la popolarità su YouTube è in crescita.Sembra che le persone stanno sempre più utilizzando YouTube per cercare manuali di HTML.Quindi varrà la pena creare un video YouTube per cercare di comparire nelle ricerche di questo termine.Usa Ahrefs Keywords Explorer per ulteriori verificheSembra molto sensato che le persone cerchino il termine “HTML tutorial” maggiormente su YouTube rispetto a Google.Ma in alcuni casi, potresti mettere in dubbio la validità dei dati.Per verificare sia vero che le persone preferiscono i video rispetto ai contenuti scritti, inserisci la query su Ahrefs’ Keywords Explorer. E controlla l’anteprima della SERP.Se vedi dei video nei risultati di Google, ci sono buone probabilità che Google conosca la preferenza di chi cerca nel trovare contenuti video per quell’argomento.In questo modo puoi assicurarti che per quella query c’è un volume di ricerca decente su YouTube.ConclusioniGoogle Trends non è stato pensato per chi fa SEO e contenuti. Ma ora hai visto quanto può essere d’aiuto. Sicuramente esistono altri strumenti focalizzati esclusivamente nella ricerca di parole chiave e contenuti per il marketing. Ma non hanno le funzionalità specifiche di Trends.E sicuramente nessun altro strumento ti darà le ultime informazioni sulle ricerche in tendenza in tempo reale.Usi Google Trends come strumento di marketing? Non vedo l’ora di conoscere le tue tattiche ed i tuoi trucchetti.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Nick Churick Nick è il nostro vero “Communications Manager” @Ahrefs (per quello che può significare) e, casualmente, è anche piuttosto bravo a scrivere. Per cui eccolo qua: ora è diventato un collaboratore regolare del nostro blog.",
  "headers": [
    {
      "level": "H1",
      "text": "Come cercare le parole chiave con Google Trends: 7 metodi efficaci"
    },
    {
      "level": "H2",
      "text": "Ecco tutto quello che devi sapere sui dati usati da Google Trends (e come vengono usati)…"
    },
    {
      "level": "H2",
      "text": "1. Identificare trend stagionali… quindi creare (e promuovere) contenuti nel momento ESATTO!"
    },
    {
      "level": "H2",
      "text": "2. EVITA gli “unicorni delle parole chiave” controllando le distorsioni date dai picchi di popolarità"
    },
    {
      "level": "H2",
      "text": "3. Trova argomenti rilevanti che sono di moda PROPRIO ORA… ed usali a tuo vantaggio"
    },
    {
      "level": "H2",
      "text": "4. Usa i dati Google Trends per pianificare il calendario editoriale"
    },
    {
      "level": "H2",
      "text": "5. Usa le “ricerche correlate” per trovare NUOVE idee per parole chiave (ED in caso RUBARNE ai tuoi concorrenti)"
    },
    {
      "level": "H2",
      "text": "6. Verifica ESATTAMENTE quali province ed aree geografiche CERCANO i tuoi prodotti o servizi (e crea una strategia SEO localizzata)"
    },
    {
      "level": "H2",
      "text": "7. Affina la tua strategia SEO video analizzando COSA le persone cercano su YouTube"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Nick Churick"
}