{
  "url": "https://ahrefs.com/blog/it/come-promuovere-il-tuo-blog/",
  "slug": "come-promuovere-il-tuo-blog",
  "title": "Come promuovere il tuo blog: 7 strategie fondamentali",
  "description": "Qui ho raccolto 7 strategie per promuovere il tuo blog. Le ho provate e testate tutte personalmente in diversi blog dal 2010 ed hanno avuto successo.",
  "content": "Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim Contenuti Hai appena pubblicato un nuovo articolo del blog ed ora non hai idea di come promuoverlo? Vediamolo assieme.Sono autore di blog dal 2010 e, credetemi quando dico che ho provato, più di quanto avrei dovuto, diverse strategie di promozione dei contenuti. Alcune hanno funzionato alla grande, ma la maggior parte di loro sono miseramente fallite.Quindi, in questo articolo, vi insegnerò come promuovere efficacemente il vostro blog con le sole 7 strategie fondamentali di cui ad oggi mi fido ciecamente. Solo sette? Tim, ma che dire di quella lista con più di 100 tattiche di promozione dei contenuti che ho tra i miei segnalibri? Blogger scettico Tempo sprecato! Le strategie in questo articolo sono tutto quello che devi sapere per far decollare il tuo blog. Tim, sei sicuro che le tue strategie saranno rilevanti per il mio blog su “qualunque_argomento”? Quello che ha funzionato per te potrebbe non funzionare nel mio settore.Blogger un po’ meno scettico, ma non davvero convinto Lascia che ti rassicuri.Nei miei quasi dieci anni di blogging, ho lavorato con tutti i tipi di blog:blog per servizi SaaS;blog per negozi e‑commerce;blog nella nicchia del web design;blog nella nicchia della fotografia;blog affiliati Amazon;blog personali;Ecc.Quindi sono sicuro al 100% che le 7 strategie qui sotto funzioneranno per qualsiasi blog tu voglia promuovere.I titoli dei paragrafi potrebbero sembrare semplici ed ovvi, ma scommetto che ciò che troverai scritto sotto non è ciò che ti aspetti.Come con questo primo:1. Utilizza la pubblicità FacebookPer favore non dirmi che non hai il budget per la promozione dei contenuti. Se non paghi con i tuoi soldi, paghi con il tuo tempo.Lasciami chiarire il mio punto di vista con un esempio:Immagina di aver scelto “Quora marketing” come strategia di promozione dei blog che vuoi testare. Ora è necessario:Trovare alcune discussioni Quora rilevanti dove puoi inserire i tuoi articoli;Scrivere alcune risposte di qualità (in modo che non vengano cancellate dai moderatori);Aggiungere il link ai tuoi articoli del blog all’interno delle tue risposte.Quindi ecco cosa voglio che tu faccia: vai e lascia almeno dieci risposte utili su Quora, e includi un link ad uno dei tuoi articoli del blog in ognuno di essi. Aspetterò mentre finisci.…Hai fatto quello che ho detto? Certo che no. Questo perché scrivere dieci risposte di qualità su Quora può facilmente richiedere più di 2 ore del tuo tempo.Ora, quanto pensi che valga il tuo tempo? Una semplice ricerca di “copywriting” su UpWork mi dà una tariffa oraria di $50/ora:Ma anche se vi valutate ad un modesto $15/ora, 2 ore del vostro tempo valgono $30.Ora comprendi il mio punto di vista?La maggior parte delle persone vogliono imparare “strategie di promozione gratuite di contenuti” perché non vogliono pagare per la promozione. Ma quello che spesso non si rendono conto è che, in realtà, nessun metodo di promozione dei contenuti è gratuito a causa di qualcosa che si chiama costo-opportunità.Ecco la migliore definizione che ho trovato:Il costo-opportunità è un termine economico che si riferisce al valore di ciò a cui bisogna rinunciare per scegliere qualcos’altro. In poche parole, è un valore della strada non intrapresa. In questo esempio, il costo-opportunità è di $ 30‑e.s., il denaro che avresti potuto guadagnare se avessi lavorato quelle 2 ore.Torniamo agli annunci Facebook.Qui ad Ahrefs, siamo in grado di ottenere clic da Facebook per meno di $ 0,30 ciascuno. Il che significa che $ 30 si traducono in più di 100 click garantiti per il nostro articolo.E quanti click pensi che quelle 10 risposte di Quora ti porteranno?È come ad un gioco d’azzardo. Forse 10? Forse 500? Forse zero.Dalla mia esperienza personale, è necessario spendere almeno 5 ore su Quora ogni settimana per ottenere ~ 100 clic alla fine del mese. Quindi facciamo i conti:5 (ore settimanali) * 4,35 (settimane medie in un mese) * $ 15 (tariffa oraria presunta) = $326,25 (per 100 click da Quora).Ora tocca a te decidere: vuoi passare il tuo tempo cercando di ottenere traffico da Quora (o utilizzando qualsiasi altro promettente metodo di promozione di contenuti “gratuiti”), o preferisci investire un po’ di soldi negli annunci di Facebook e passare quelle preziose ore di lavoro su qualcos’altro?Non fraintendetemi. Non sto cercando di dissuaderti dall’usare Quora per promuovere i tuoi articoli del blog. Qui ad Ahrefs, pubblichiamo risposte su Quora ogni settimana.…..…che comporta un discreto traffico di ritorno.Il mio obiettivo qui è quello di convincervi che avete il budget per promuovere i vostri contenuti con gli annunci di Facebook perché libera un bel po’ del vostro tempo prezioso, speso meglio altrove.Ancora non sei convinto? Considera questo:Se non puoi giustificare la spesa di 30 dollari per promuovere il tuo articolo, come puoi giustificare le innumerevoli ore trascorse a scriverlo?Ecco alcune risorse per aiutarti a diventare un professionista degli annunci su Facebook:La guida completa per iniziare con gli annunci su Facebook19 strategie pubblicitarie su Facebook per raggiungere i tuoi obiettivi più sfidanti Come costruire un funnel per Facebook che converte — la lavagna del venerdìSuggerimento dall’espertoQui ad Ahrefs, abbiamo una serie di articoli che ottengono costantemente click a basso costo dal “pubblico freddo” su Facebook. Invece di avere un budget fisso una tantum per promuovere questi articoli, assegniamo un budget mensile ricorrente per continuare a promuoverli a sempre più persone.Per essere sicuri di non mostrare lo stesso articolo alle stesse persone più di tre volte, teniamo d’occhio la nostra frequenza degli annunci.PS: All’inizio volevo chiamare questa sezione “traffico a pagamento” ed includere annunci su Twitter, LinkedIn Ads, Quora Ads, ecc. Ma queste piattaforme non hanno mai realmente funzionato per noi. Il costo per clic (CPC) sembra sempre alto. Pertanto, non posso raccomandarvele con leggerezza.2. Promuovi al tuo pubblico esistenteE’ una fregatura!Vedo troppi blogger (aziende?) che limitano le loro attività di promozione dei contenuti al pubblico di persone che già le conoscono.Se questo è tutto ciò che stai facendo per promuovere i tuoi contenuti, non andrai lontano.Ora, con gli annunci di Facebook, puoi facilmente creare un “pubblico negativo” di persone che hanno già visitato il tuo sito web e pagare solo per i clic di persone che non hanno mai sentito parlare di te. In questo modo puoi ingrandire efficacemente il tuo pubblico ed esporre i tuoi contenuti ad un numero sempre maggiore di persone nel tempo.Ma cosa succede quando invii il tuo articolo solo ad una lista dei tuoi iscritti esistenti, o con persone che ti seguono su Twitter, Facebook o LinkedIn?Stai riportando sempre le stesse persone sul tuo sito web (e sempre più spesso)!Beh, il problema dove sarebbe? Alla fine, ciò che succederà è la piacevole condivisione da parte del tuo pubblico dei nuovi contenuti ad altre persone (con tweet, condivisioni, messaggi diretti, ecc.), giusto? Non proprio.Primo e importante — se hai già un pubblico ampio, non staresti leggendo il mio articolo sulla promozione del tuo blog in questo momento.Secondo — il numero di abbonati alle email—o follower su Twitter, fan di Facebook, etc.—è arbitrario. Questo perché è molto improbabile che tu possa raggiungere anche il 30% di queste persone con il tuo articolo appena pubblicato.Terzo — la maggior parte delle persone che vedrà il tuo articolo non lo leggerà neppure per intero, per non parlare dei tweet o della condivisione ad un amico. Il tuo articolo dovrà essere davvero eccezionale per fargli venire voglia di farlo.In altre parole, ottenere una notevole quantità di traffico come risultato della condivisione tramite passaparola dei vostri articoli è incredibilmente difficile. Tim, mi stai davvero dissuadendo dall’inviare una email di aggiornamento alla mia sudata lista di iscritti? Sicuro di essere sano di mente? Ti capisco al 100%. Dovresti sempre promuovere ogni nuovo articolo del blog al tuo pubblico esistente. Alcuni dei tuoi fan comunque amplificheranno i tuoi contenuti con tweet e condivisioni con i propri amici.Ma non rimanerci deluso. Non tutti i tuoi fan lo faranno—in realtà, la maggior parte non lo farà.Ti faccio vedere qualche numero reale dietro il pubblico di Ahrefs così da capire quanto puoi sperare (realisticamente) di crescere con il tuo:Lista emailAbbiamo oltre 53k persone iscritte alla lista email. Questi sono i tassi di apertura e click per una delle nostre migliori campagne:La maggior parte delle nostre newsletter ha una percentuale di click tra il 3% ed il 4%.Nota a margine.Alcuni blogger consigliano di creare un segmento di iscritti alla newsletter che non hanno aperto la prima email, ed inviare nuovamente la newsletter cambiando l’oggetto—per avere un tasso di apertura maggiore. Potrebbe essere un trucco da utilizzare una tantum per qualche articolo davvero importante, da non ripetere ogni volta che si pubblica qualcosa di nuovo. E’ un metodo sicuro per annoiare i fan più leali. Inoltre, siccome alcuni email client disattivano il tracking, potresti trovarti inavvertitamente a spedire nuovamente l’email a chi l’aveva già letta, e questo è il metodo più sicuro per annoiare i tuoi lettori.Consigli dall’espertoOgni volta che una nuova persona si iscrive alla tua newsletter, è altamente probabile che non abbia letto tutti i migliori contenuti che hai già pubblicato nel blog.Qui in Ahrefs abbiamo una semplice sequenza automatizzata che invia una dozzina dei nostri migliori articoli ad ogni nuovo iscritto.Puoi vedere che le percentuali di apertura e click di queste due email sono abbastanza alte. Per questo ti consigliamo di fare lo stesso, ma ricordati di non forzare troppi articoli nella sequenza perché questo porta ad una “paralisi da analisi” e le persone non faranno alcun click.Twitter & LinkedIn followerAbbiamo oltre 30k follower su Twitter, ma raramente l’”engagement” dei nostri tweet supera i 400. Corrisponde al 1,3% dei nostri follower su Twitter. E questo “engagement” non comporta neppure a “click nel nostro sito web”.In altre parole, è poco probabile ricevere molto traffico grazie al solo effetto dei tweet dei tuoi articoli ai tuoi follower.Esiste un piccolo trucco, abbiamo implementato la strategia “ricircolo dei contenuti” sia su Twitter che su LinkedIn, ed abbiamo notato una crescita notevole ed immediata:Il concetto è molto semplice: non condividere i tuoi nuovi articoli del blog nei social media solamente una volta—condividili almeno un paio di volte modificando leggermente il messaggio.Potresti anche condividere lo stesso articolo più volte se ne estrai differenti messaggi e li trasformi in tweet/aggiornamenti autonomi, come abbiamo fatto qui:#SEO tip 32: Update your content regularly…and get a BIG traffic boost!Regularly update old/archive content to keep it fresh, relevant and “rankworthy”. 📈📈📈https://t.co/hjdvViYB05— Ahrefs (@ahrefs) December 25, 2018#SEO tip 33: Fix your broken backlinks for an INSTANT SEO boost 🚀Use the “Best by links” report in Ahrefs Site Explorer to find broken pages with a ton of links.Then: fix them and enjoy that sweet, freshly reclaimed link juice! 📈https://t.co/hjdvViYB05— Ahrefs (@ahrefs) January 1, 2019FacebookLa nostra pagina aziendale Facebook è seguita da circa 75k fan. Questa è la reach (il numero di persone che hanno visto ogni post almeno una volta) dei nostri 5 articoli più recenti:Faccio io il conto al posto tuo: la reach media di tutti e 5 gli articoli è di 12.780.Ma devi considerare che questo numero include anche la reach a pagamento—e.s., la reach dalle campagne pubblicitarie attive. Se la scorporiamo dal totale, la media cala a 7.106.Significa che abbiamo raggiunto meno del 10% della nostra audience.Onestamente, non sono sorpreso da questi risultati. Tutti sanno che Facebook è una piattaforma “pay to play”.Ed il metodo “pay to play” è esattamente quello che ti consigliamo di fare. L’uso di Facebook Ads è una delle migliori tattiche disponibili di promozione dei contenuti, come discusso precedentemente in questa guida.Nota a margine.Alcuni blogger consigliano di connettersi con la propria audience tramite Facebook Messenger visto che la percentuale di engagement è solitamente maggiore dell’email marketing. Noi non l’abbiamo ancora testato, di conseguenza non posso dire quanto ciò sia vero. Tuttavia, non puoi evitare la legge dei sh***y clickthroughs—e quindi l’efficacia del marketing con Facebook Messenger è destinata a calare molto rapidamente.Notifiche in-appEro così frustrato dai risultati dei 3 canali appena menzionati che ho convinto il nostro CEO ad aggiungere le notifiche in-app per i nuovi contenuti all’interno del nostro servizio:Ma delle decine di migliaia di utenti giornalieri attivi di Ahrefs, solo poche migliaia cliccano ad ogni notifica. Quindi non hai nemmeno il controllo completo dell’attenzione delle persone all’interno della tua app.Al giorno d’oggi, essere letti dai tuoi fans è incredibilmente difficile. La cosa migliore da fare è usare più canali possibili per raggiungerli. I visitatori del tuo blog non dovrebbero far fatica a capire come iscriversi agli aggiornamenti tramite newsletter, o come seguirti su Twitter, o se sei presente su Facebook.Assicurati che ogni pagina del blog abbia un elenco dei metodi possibili per rimanere in contatto con te. Puoi mettere i link nella barra laterale, nel footer, o entrambi—che è quello che fa Intercom nel suo blog:Ma allo stesso tempo, non fare troppo affidamento alla tua audience di fan e follower. Dovresti lavorare nelle strategie di promozione del blog che ti aiutano a raggiungere sempre nuove persone—non solamente la fanbase esistente.PS: Abbiamo provato anche le notifiche del browser (con VWO Engage). Le abbiamo sospese quasi subito perché le percepiamo come troppo intrusive ed irritanti per i nostri visitatori.3. Crea contenuti meritevoli di essere condivisiVolevo iniziare l’articolo con questa strategia, ma avevo paura che tu avresti alzato gli occhi al cielo e chiuso l’articolo immediatamente. Non ho alcun dubbio che tu sia stanco del solito consiglio sul “creare contenuti di valore”.Ma ora che hai letto cosa avevo da dire riguardo le 2 strategie precedenti, spero mi darai una possibilità per spiegarti meglio cosa intendo.Creare eccellenti contenuti meritevoli di essere condivisi è essenziale per il successo del tuo blog.Coinvolgi i tuoi lettori,Eccedi con il valore che puoi dare,Accendi in loro l’emozione……e parleranno ovunque del tuo blog!Un esempio concreto: questo tizio che ha condiviso un mio articolo su PageRank su Hacker News, ha avuto 66 punti e 57 commenti.E questi ragazzi che su Reddit consigliano il blog di Ahrefs (e tutte le persone che votano i loro commenti):Non ci sono “trucchi del marketing” dietro questi casi. Non sono un prodotto del nostro dipartimento marketing. Questi commenti li hanno fatti sostenitori appassionati. Tutto quello che dobbiamo fare affinché ciò accada è la pubblicazione costante di articoli utili nel nostro blog ed utilizzare le altre 6 strategie di questa lista per promuoverli.In altre parole, creare contenuti di qualità è la più decisiva delle strategie di promozione dei contenuti.Ma cosa si intende per “contenuti ottimi/di qualità/sorprendenti/eccezionali”?A molti blogger piace pensare che qualsiasi cosa pubblichino sia incredibile. Ti racconto una breve storia di quando anch’io ero uno di quei blogger arroganti…Nel 2015, scrissi una lunga guida alla scrittura strategica nel mio blog personale. Mi ha preso almeno 3 settimane per completarla, e dentro ho stipato tutto quello che sapevo riguardo la creazione di contenuti scritti.Pensavo fosse un vero capolavoro.Ma ecco cosa mi scrisse Rand Fishkin quando gli chiesi di twittare quell’articolo:Quattro anni più tardi, abbiamo pubblicato un articolo nel blog di Ahrefs riguardo la nostra esperienza sulle pubblicità nei podcast: “Abbiamo speso $51,975 nelle pubblicità podcast: ecco tutto quello che abbiamo imparato”.Rand l’ha twittato, nonostante nessuno di noi abbia chiesto a lui di farlo.Superb post on podcast advertising — the ups and downs of *real life* process from @itsrbek: https://t.co/6DHzboqU6X— Rand Fishkin (@randfish) November 21, 2018Quindi perché il primo articolo non era “abbastanza unico” per Rand, mentre il secondo lo era?Nell’articolo che Rand non ha twittato, non avevo fatto nulla se non ripetere gli stessi consigli da praticamente ogni altro articolo sull’argomento. Era lunghissimo. Era straripante di ottimi consigli. Aveva anche una infografica carina. Ma come Rand aveva (giustamente) detto, nulla nell’articolo era davvero una novità.Nell’articolo che Rand ha twittato, non c’è alcun suggerimento copiato altrove. Tutto è al 100% esclusivo e basato solamente sulla nostra esperienza con la pubblicità podcast.Ora mettiti nei panni di Rand. Essendo una figura di spicco nel settore, difficilmente condividerà sempre gli stessi consigli. Ha già visto tutto. Il primo articolo non è interessante e motivante per essere condiviso. Ecco perché ha twittato il secondo articolo e non il primo.Nota a margine. Questo tweet non è un caso unico. Rand ha twittato alcuni articoli dal blog di Ahrefs nei precedenti 2 anni. Questo è solamente l’esempio più recente.L’insegnamento più importante di questa storia è:Riciclare i contenuti che hai visto negli altri blog non ti porterà lontano. Piuttosto, pubblica qualcosa di unico ed intrigante, ed il supporto che riceverai dagli altri nel tuo settore ti stupirà.E questa non è solo una prerogativa di brand affermati come Ahrefs con un budget e risorse per creare contenuti autentici. Subito dopo il mio insuccesso con la “guida alla scrittura strategica”, ho pubblicato un breve articolo di ricerca sull’efficacia del guest blogging:Per raccogliere le informazioni per questo articolo, ho contattato più di 500 blogger ed ho chiesto ad ognuno di loro di condividere con me i dati di traffico. Poi ho elaborato i numeri in Excel ed ho creato qualche grafico carino. Nulla di speciale, ma era qualcosa che nessuno aveva fatto prima.Il risultato? Quell’articolo è andato benissimo. Con link da oltre 85 siti differenti, la pagina è la seconda per numero di link di tutto il mio blog:Il mio messaggio è il seguente: tutti sono in grado di creare contenuti fantastici ed originali che faranno la differenza nel settore. Bisogna investire moltissimo tempo ed impegno per realizzare cose che non sono ancora state fatte da altri.Consigli dall’espertoCercare quali articoli dei tuoi concorrenti ha ricevuto il maggior numero di backlink è un buon metodo per trovare idee meravigliose per il tuo blog. Per farlo, incolla l’URL del blog del tuo concorrente su Site Explorer di Ahrefs e vai al report Best by links.Questo è quello che troverai per il blog di Ahrefs:Tramite il report della classifica link di Ahrefs Site Explorer.Guardando a quali articoli hanno più link da altri siti (Referring domains), è evidente che le nostre guide più dettagliate ed i nostri casi studio hanno avuto maggior successo.Prova a creare questo report dei tuoi concorrenti e vedi cosa ha funzionato per loro.Non c’è una miglior strategia di promozione del blog della pubblicazione di contenuti che trasformino ogni lettore in un cartellone pubblicitario umano—e.s., persone che lo promuoveranno ad ogni opportunità.Il contenuto è condivisibile quando per ogni nuovo visitatore attirato dall’articolo (tramite Facebook Ads, risposte di Quora, SEO, o altro), c’è una grande possibilità che lo dica ad un paio di amici, e probabilmente si creerà una piccola “fiammata di viralità”.Consiglio dall’espertoRicordati che una carenza di capacità di copywriting può rovinare anche l’articolo con i contenuti più brillanti.Se vuoi far colpo sulle persone con il tuo contenuto, devi imparare a scrivere bene.Non mi sento di darti alcun suggerimento valido sul copywriting perché non mi ritengo l’Hemingway nella nicchia del digital marketing. Ma posso consigliarti 2 persone interessanti che seguo e dalle quali imparo molto:Neville Medhora (ed il suo famoso Kopywriting Kourse)Jon MorrowJoanna WiebeMa in tutta onestà, creare contenuti davvero esclusivi potrebbe non essere abbastanza per convincere le persone a condividerli.Ottimo ≠ degno di condivisioneForse dovrai studiare la psicologia alla base dei contenuti degni di condivisione così da capire meglio come crearli. Forse il modo migliore per iniziare è la lettura di un fantastico libro di Jonah Berger dal titolo “Contagious: Why Things Catch On”.4. Traffico da GoogleMolto spesso, il traffico del tuo articolo di blog appena pubblicato assomiglia a questo:Crediti per l’immagine: Rand FishkinOra te lo spiego meglio:Hai inviato il nuovo articolo alla lista newsletter e l’hai condiviso nei social per ottenere il primo flusso di visitatori;Poi i tuoi fan hanno sparso un po’ la voce condividendo l’articolo ad amici e colleghi;Poi metti un po’ di soldi su Facebook Ads per raggiungere nuove persone.E dopo?La tua audience ha già visto l’articolo;Anche i loro amici l’hanno visto;Sei senza budget per Facebook Ads.Significa che nessun altro leggerà mai alcun tuo articolo?Beh, non è così se riesce a scalare Google:Questo screenshot mostra il traffico reale di un nostra guida alle parole chiave pubblicata nel 2016.Puoi notare che il traffico a questo articolo non è calato dopo lo spunto iniziale. E’ continuato a crescere. Poi lo abbiamo completamente riscritto e rilanciato in aprile del 2017, e questo ci ha aiutati a far ulteriormente crescere il traffico.Questa è la forza del SEO.Consiglio dall’espertoSe stai scrivendo un blog da un anno o più, è probabile che alcuni dei tuoi articoli abbiano già scalato le posizioni di Google ed abbiano del traffico consistente ogni mese.Questo è bene. Ma stai perdendo delle opportunità se non riesci a convogliare quel traffico maggiormente all’interno del tuo blog.Noi dopo aver pubblicato un nuovo articolo nel blog di Ahrefs, ci torniamo sopra per vedere se possiamo linkarlo da alcuni dei nostri articoli pubblicati precedentemente. Lo facciamo soprattutto perché a Google piace quando le pagine hanno link interni rilevanti da altre pagine del tuo sito.Ma per noi è anche un metodo efficace per canalizzare il traffico da articoli più datati ad articoli più recenti.Ma da dove si comincia per il SEO?Bene, ad un livello base ci sono 3 semplici passi:Capire a cosa è interessato il lettore ideale del tuo blog (e.s., ricerche di Google);Scrivere un articolo sull’argomento e assicurandoti che sia migliore degli altri già pubblicati in materia;Ricevere link a quell’articolo da altri siti web.Semplice.Molti blogger conoscono il proprio pubblico così bene che non devono nemmeno fare ricerca di parole chiave per capire di cosa parlare. E nemmeno link building perché hanno molti follower nel proprio settore che saranno felici di creare link agli articoli appena pubblicati.Ma se non sei uno dei rari fortunati per i quali il SEO è un passatempo, dovrai investire un po’ di tempo per studiare SEO e Content Marketing.Consiglio dall’espertoProva a cercare i blog più conosciuti nella tua nicchia per scoprire quali dei loro articoli hanno il maggior traffico da Google. Inserisci qualsiasi blog di riferimento di un settore su Site Explorer di Ahrefs e vai al report Top pages.Ecco com’è per il nostro blog:Come puoi vedere abbiamo la maggior parte del traffico organico dal nostro articolo degli strumenti gratuiti di ricerca parole chiave—riceve 76.000 visitatori al mese da Google ed è fonte del 36% del volume di traffico di tutto il blog.Fai una prova tu stesso per vedere quali articoli dei tuoi competitor ricevono il maggior traffico dai motori di ricerca.Consiglio di iniziare da questo articolo. Spiega come siamo stati in grado di incrementare il traffico del blog di Ahrefs del 1.136% (e migliaia di clienti) in meno di 3 anni.Se senti l’urgenza di imparare ancora, controlla la nostra homepage del blog dove abbiamo indicato i nostri migliori articoli, il nostro canale YouTube, e la Ahrefs Academy.Investiamo tantissimo nei contenuti, per questo siamo sicuri tu possa trovare tutti i materiali per l’apprendimento necessari ad iniziare a crescere il traffico nel tuo blog.5. Contattare persone rilevantiAmmettiamo che il tuo blog sia nuovo. Hai registrato un dominio da circa una settimana, e stai iniziando a scrivere il tuo primo articolo.Mi dispiace comunicarti che la strategia di promozione del blog seguente con te non funzionerà:Strategia #1 — Il tuo budget per Facebook Ads all’inizio è basso, e quindi lo esaurirai molto presto.Strategia #2 — Non hai un pubblico al quale promuovere il tuo articolo. Non c’è nessuno che può fare passaparola.Strategia #4 — Non puoi nemmeno sperare di ricevere traffico a breve perché prima devi guadagnarti i link da altri siti. E questo necessita un po’ di tempo e di impegno.Queste erano le notizie brutte.La buona notizia è che non c’è nessuno che ti vieti di mettere tutto il tuo impegno e risorse nella strategia #3—creare contenuti degni di essere condivisi.Ed una volta che hai pubblicato quell’articolo fantastico, perché non segnalarlo alle persone del tuo settore che HANNO un grande pubblico e che HANNO molto traffico costante ai loro siti?Nel Digital Marketing, lo chiamiamo “outreach”.La chiave per un outreach di successo è chiedere a te stesso la seguente domanda ogni volta che stai mandando una nuova email: Perché a quella persona dovrebbe interessare quello che sto scrivendo nella email? Se hai un motivo valido per guadagnarti la loro attenzione, tutto dovrebbe filare liscio. Altrimenti, stai solamente disturbando un sacco di persone con la tua email.Queste sono le 2 principali “scuse” che devi considerare per fare outreach:1. Hai menzionato quella persona (o il suo lavoro) nel tuo articolo.A ciascuno piace vedere elogiato il proprio lavoro.Purtroppo, le persone più famose nel tuo settore sono così elogiate che probabilmente non prestano alcuna attenzione alle migliaia di segnalazioni che ricevono giornalmente—comprese le tue. Se non hai una connessione prioritaria con loro, è probabile che non ti risponderanno.Consiglio dall’espertoUn metodo intelligente per stringere relazioni con le persone più influenti nel tuo campo è l’utilizzo dei canali dove loro maggiormente si aspettano di trovarti:Hanno una sezione per i commenti sotto gli articoli del blog?Fanno delle domande ai loro follower su Twitter?Hanno un gruppo Facebook collegato al loro brand?Ecco un bell’esempio:Precedentemente in questo articolo, ho consigliato il Kopywriting Kourse di Neville Medhora. Ho avuto dei contatti con Neville in alcune occasioni in passato, quindi probabilmente gli invierò una email per avvisarlo di averlo menzionato qui. Penso ci sia una ragionevole buona possibilità che lui twitterà il mio articolo. (Nessun problema, Neville, in ogni caso continuerò a consigliarti).Ma ho anche consigliato Joanna Wiebe subito dopo Neville. Anche con Joanna in passato ho avuto contatti, ma solo brevi occasioni. Per questo motivo, onestamente non mi aspetto che lei condividerà il mio lavoro con i suoi follower. A meno che lei legga questo articolo dall’inizio alla fine e le interessi davvero.Il che mi porta alla mia seconda, molto più efficace, scusa per l’outreach…2. Il tuo articolo contiene qualcosa di veramente innovativo che quella persona non conosce, ma è molto interessata all’argomento.Ti ricordi di come Rand Fishkin ha twittato il nostro articolo sulla pubblicità podcast senza che noi lo abbiamo neppure contattato?E’ avvenuto per 2 ragioni:Era veramente interessato all’argomento in oggetto (pubblicità podcast)Il nostro articolo conteneva informazioni uniche e nuove anche per lui.Non ci sono trucchi per fare in modo che le persone più influenti del settore ti promuovano. Devi fare un lavoro eccezionale.Ecco perché ogni volta che il team marketing di Ahrefs invia email di outreach per la promozione dei nostri contenuti, ci concentriamo nella promozione del singolo articolo, evitando subdole richieste di condivisione su Twitter.Puoi notare che l’email qui sopra mostra cosa c’è di unico nel nostro articolo e perché il destinatario dovrebbe dedicare attenzione. Non chiediamo mai al destinatario di condividere il nostro articolo, e nemmeno chiediamo di creare dei link.Ma anche se spendiamo molto tempo, impegno, e risorse per creare ottimi contenuti, selezionare il meglio delle email per l’outreach, selezionando attentamente i destinatari, i risultati non sono entusiasmanti:Lo screenshot non mostra quanti tweet o link abbiamo ottenuto. Mostra semplicemente la percentuale di aperture e risposta. E questo è intenzionale. Il nostro primo obiettivo non è avere un tweet o un link dalla persona che abbiamo contattato, ma piuttosto di farla interessare così tanto al nostro contenuto da leggerci.I tweet ed i link seguono in maniera naturale:Via Ahrefs Site ExplorerQuesta in sintesi è l’outreach per i blogger. L’unica cosa che è rimasta senza risposta è dove trovare nuovi target per fare outreach. Trovi un approfondimento sulla nostra guida dettagliata sull’outreach blog per fare promozione ed ottenere link.6. Essere attivi nelle community rilevantiHai notato cosa ho fatto?Molte guide sulla promozione del blog avrebbero modificato questa strategia in “promuovi il tuo blog nelle community rilevanti”.Spero la differenza sia chiara.Le community online esistono per le persone che vogliono avere discussioni interessanti attorno ad un argomento particolare o per aiutarsi tra loro su particolari problemi. Il momento nel quale i membri della community iniziano a promuovere sé stessi ed i loro prodotti è il momento nel quale quella community cessa di esistere.Queste sono le regole della community per il gruppo Facebook riservato ai clienti Ahrefs:Non puoi decidere di entrare nella nostra community su Facebook per iniziare a distribuire link al tuo blog. Ma cosa PUOI fare è diventare un membro attivo della nostra community e dispensare i link nelle conversazioni rilevanti se saranno d’aiuto agli altri membri della community.Non moderiamo link nelle conversazioni (che siano auto-promozionali o meno) fintantoché sono rilevanti ed utili.Quindi invece di consigliarti di trovare tutte le community online rilevanti (gruppi Facebook, forum online, canali Slack, etc.) nel tuo ramo e bombardarli di link al tuo blog, posso solamente consigliarti di parteciparvi.Hai notato che non ti ho nemmeno consigliato di “diventare un membro attivo”? Perché o hai il piacere di essere parte di una community ed aiutare le altre persone oppure non entrarci.Si Quan (che è un membro del nostro team marketing) va a promuovere il nostro contenuto in un gruppo Facebook perché lì è un membro attivo e sa bene che la community apprezzerà.Ecco qualche consiglio su dove cercare community rilevanti alle quali partecipare:Ricerca su Facebook. Possono essere gruppi di fan o blogger famosi nella tua nicchia, gruppi di clienti o brand di settore, o semplicemente gruppi d’interesse specifico.Trova subreddit rilevanti. Se esiste un subreddit delle persone che vogliono photoshoppare arti negli uccelli, sono sicuro che ne esiste uno per qualsiasi cosa tu stia scrivendo nel blog.Trova forum rilevanti. Cerca su Google “la_tua_nicchia forum” e ci sono buone probabilità che troverai qualcosa.Oltre a questi, per molti settori sono abbastanza comuni siti web dedicati a radunare persone con interessi in comune. Alcuni esempi famosi sono:Product Hunt (producthunt.com)Hacker News (news.ycombinator.com)Growth Hackers (growthhackers.com)Stack Overflow (stackoverflow.com/)Ecc.Purtroppo, non posso mostrarti alcun dato specifico su come la promozione dei nostri contenuti su community dedicate abbia portato traffico al nostro blog. Appena iniziamo a misurare ed impostare degli obiettivi (e.s., numero x di lead al mese), la nostra partecipazione a queste community smetterà di essere divertente e sincera, e le persone forse inizieranno ad odiarci.Ma quello che so per certo è che abbiamo avuto alcuni buoni clienti dalle community dove membri del nostro team marketing (me incluso) sono attivi:7. Adattamento su diverse piattaformeQuesto è il nostro articolo che spiega come realizzare un audit SEO di un sito web in 16 semplici passi.E qui c’è il nostro video che parla dello stesso argomento con oltre 5,000 visualizzazioni su Youtube:https://www.youtube.com/watch?v=YXlrTkVCqQsCon l’adattamento del nostro articolo del blog in un video condiviso su YouTube, siamo stati in grado di catturare ulteriori 5 mila paia di occhi. Non male, vero?Ora, potresti dire che Sam (il nostro uomo dei video) ha una attrezzatura video professionale, capacità uniche di presentazione, accesso ai migliori editor video, ed oltre 30k iscritti a YouTube, mentre tu non hai mai creato alcun video in vita tua.Bene, guarda questo (sono davvero imbarazzato nel condividerlo, ma comunque…):https://www.youtube.com/watch?v=rVyU2KT3Dr0Questo è uno dei primi video che ho pubblicato per il nostro nuovo canale YouTube circa 4 anni fa. Ho utilizzato il mio iPhone ed una app economica di editing per il montaggio.Questo (osceno) video ad oggi ha oltre 125k visualizzazioni.Quindi mentre stai cercando delle scuse per non riproporre i tuoi contenuti in un formato diverso, uno dei tuoi competitor sta dicendo “Screw It, Let’s Do It”.Parlando di formati differenti, questo è un esempio di come noi prendiamo un articolo dal nostro blog e lo riproponiamo per la pubblicazione su Medium:Il nostro articolo si è posizionato al #2 nella classifica dei “più popolari” su Medium lo stesso giorno della pubblicazione.Hai bisogno di altre idee per trasformare il contenuto in formati differenti per aumentarne la distribuzione?Noi siamo in fase di trasformazione di un nostro articolo del blog in una presentazione SlideShare perché alcune di loro hanno avuto un altissimo numero di visualizzazioni:Ho notato anche che alcuni dei miei articoli di questo blog Ahrefs mi hanno offerto la possibilità di essere intervistato nei podcast dove ho discusso dello stesso argomento. Esempio: articolo VS podcast.Lo ripeto, se vuoi avere successo nel riproporre e ripubblicare i tuoi contenuti su piattaforme differenti, l’articolo originale dev’essere davvero ottimo e unico. E ci riporta di nuovo alla nostra Strategia #3, “creare contenuti degni di essere condivisi”.E’ stato bellissimo. Rifacciamolo!Questa frase da Perennial Seller di Ryan Holiday mi ha illuminato la mente: Creare più lavoro è una delle tecniche di marketing più efficaci di sempre. Puoi intuire come puoi declinare quando si tratta della promozione del tuo blog?Dopo aver pubblicato un articolo fantastico ed aver avuto un sacco di successo, la miglior cosa che tu possa fare per promuovere ulteriormente il tuo blog è la pubblicazione di un altro ottimo contenuto.E’ davvero così semplice! #sarcasticoLa generazione continuativa di buoni lavori è ciò che spinge il tuo blog ai vertici della tua categoria, e non i migliori trucchi di promozione dei contenuti (comunque questo articolo è valido).Ed ho un altra frase illuminante da Ryan Holiday per chiudere questo articolo: La promozione non è ciò che crea le cose di successo—è solo il modo in cui le persone ne vengono a conoscenza.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Come promuovere il tuo blog: 7 strategie fondamentali"
    },
    {
      "level": "H2",
      "text": "1. Utilizza la pubblicità Facebook"
    },
    {
      "level": "H2",
      "text": "2. Promuovi al tuo pubblico esistente"
    },
    {
      "level": "H3",
      "text": "Lista email"
    },
    {
      "level": "H3",
      "text": "Twitter & LinkedIn follower"
    },
    {
      "level": "H3",
      "text": "Facebook"
    },
    {
      "level": "H3",
      "text": "Notifiche in-app"
    },
    {
      "level": "H2",
      "text": "3. Crea contenuti meritevoli di essere condivisi"
    },
    {
      "level": "H2",
      "text": "4. Traffico da Google"
    },
    {
      "level": "H2",
      "text": "5. Contattare persone rilevanti"
    },
    {
      "level": "H3",
      "text": "1. Hai menzionato quella persona (o il suo lavoro) nel tuo articolo."
    },
    {
      "level": "H3",
      "text": "2. Il tuo articolo contiene qualcosa di veramente innovativo che quella persona non conosce, ma è molto interessata all’argomento."
    },
    {
      "level": "H2",
      "text": "6. Essere attivi nelle community rilevanti"
    },
    {
      "level": "H2",
      "text": "7. Adattamento su diverse piattaforme"
    },
    {
      "level": "H2",
      "text": "E’ stato bellissimo. Rifacciamolo!"
    }
  ],
  "author": "Tim Soulo"
}