{
  "url": "https://ahrefs.com/blog/it/come-ottenere-piu-visualizzazioni-su-youtube/",
  "slug": "come-ottenere-piu-visualizzazioni-su-youtube",
  "title": "14 Comprovati Modi per Ottenere Più Visualizzazioni su YouTube",
  "description": "Queste sono le tattiche che abbiamo utilizzare per generare sul nostro canale oltre 6.1 milioni di visualizzazioni.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Da quando siamo entrati a far parte di Youtube, abbiamo accumulato oltre 6.1 milioni di visualizzazioni.Non ci credi? Guarda i dati del nostro canale.In questo articolo ti mostro 14 diverse tattiche che ci hanno aiutato ad ottenere più visualizzazioni su YouTube.Trova una nicchiaCrea video su argomenti che le persone cercanoPosiziona i tuoi video su GoogleAumenta il tuo CTR con un titolo efficaceCrea una miniatura accattivanteScrivi una descrizione intriganteOttieni più visualizzazioni dai video consigliati sfruttando le playlistIncorpora i tuoi video su forum che portano trafficoIncorpora i tuoi video nei post del tuo blogUsa le schermate finali e le schedeAggiungi i Timestamp per visualizzare i “key moments” su GooglePubblica i video nel momento migliore per la tua audienceAggiungi dei tag rilevanti al videoOttieni delle visualizzazioni che interagiscono con il video grazie alle Ads di Youtubehttps://www.youtube.com/watch?v=iwkUlTl2Iow1. Trova un nicchiaYouTube guadagna profitti dalla pubblicità. Di conseguenza, è nel loro interesse tenere le persone sulla piattaforma, così da potergli mostra un maggior numero di annunci.Questo è il motivo per il quale consigliano video correlati nella sidebar. Ad esempio, se guardi un video che parla di come cucinare una costata di manzo, la maggior parte dei video consigliati nella sidebar contiene altre ricette di carne su come cucinare altri tagli.Se ci pensi, questo ha senso.Se vuoi sapere come cucinare una costata di manzo, potresti essere intrigato dal come cucinare una bistecca di filetto in crosta !Quello a cui dovresti far caso però, è che molti dei video consigliati provengono dallo stesso canale del video che stai guardando.Questo è un punto molto importante, perché uno dei modi più semplici per ottenere più visualizzazioni, è quello di invogliare gli utenti a guardare altri video del tuo canale.Come puoi riuscirci?Nonostante non ci sia una garanzia di riuscita in questo caso, puoi incrementare le tue possibilità creando dei video correlati fra di loro per il tuo canale. Ecco perché è importante verticalizzare il canale su di una specifica nicchia.Quindi non creare un semplice canale di cucina. È un argomento troppo ampio. Piuttosto, crea un canale che parla di barbeque e grigliate. Questo aumenta la possibilità di apparire nella sidebar quando qualcuno guarda i tuoi stessi video—riuscendo così a portare più visualizzazioni.Questo è esattamente quello che abbiamo fatto noi. I nostri primi video nel 2015 erano concentrati sulla link building e l’ottimizzazione per i motori di ricerca (SEO):Chiaramente non devi essere così verticale su di un singolo argomento per sempre.Man mano che ottieni più visualizzazioni, aumenterai anche gli iscritti. Dato che gli stessi iscritti verranno notificati dei nuovi video indipendentemente dalla tematica, puoi permetterti di allargare un pò il campo. Tornando all’esempio di prima, potresti voler espandere e creare video su come marinare una bistecca o preparare dei contorni.Questo è praticamente quello che abbiamo fatto noi. Nonostante il nostro focus principale sia comunque la SEO, abbiamo cominciato a produrre video su tematiche vicine, come ad esempio blogging, content marketing, video marketing e affiliate marketing:2. Crea video su argomenti che le persone cercanoUno dei peggiori errori che i novizi fanno è quello di creare video “protagonistici”, come ad esempio “L’attrezzatura Che Utilizzo”.A meno che tu non abbia un gran seguito, come iJustine, la verità è che non importa a nessuno chi sei o cosa fai.Quindi, un modo migliore per creare contenuti è quello di focalizzarsi su quello che le persone cercano ed ha potenziale di portare traffico. Nonostante le persone non siano interessate a quale attrezzatura io utilizzo, potrebbero comunque essere interessate a dei consigli generali su come scegliere una videocamera.La parola chiave “best camera for YouTube” (in Italiano: “La migliore telecamera per YouTube”), viene cercata circa 3,400 volte al mese negli Stati Uniti, e 6,100 volte globalmente.Di conseguenza se miri a creare contenuti intorno a tematiche con alti potenziali di traffico puoi ottenere molte visualizzazioni sui tuoi video. Questo funziona anche se hai 0 iscritti.Come trovi queste tematiche?Il modo più semplice è utilizzare il YouTube Keyword tool di Ahrefs—che fra l’altro è gratuito.Inserisci una parola o una frase rilevante, ed il tool ti mostrerà fino a 150 parole chiave ed il relativo volume di ricerca.Vuoi ancora più suggerimenti?Utilizza il Keywords Explorer di Ahrefs per tirar fuori idee dal nostro database di oltre 800 milioni di parole chiave di YouTube.Una volta che hai fatto con la ricerca delle parole chiave per il tuoi video, dovrai imparare come posizionare i tuoi video su YouTube. Per farlo, guarda questo video:https://www.youtube.com/watch?v=NY3y0V9UDwM3. Posiziona i tuoi video su GoogleVuoi sapere una cosa?Google ci ha portato oltre 230,000 visualizzazioni sul nostro canale YouTube nel corso degli ultimi 12 mesi circa.Come? Perchè i video di YouTube certe volte si posizionano anche su Google.Ad esempio, guarda ai risultati di ricerca per la parola chiave “how to make scrambled eggs” (in Italiano: “come fare le uova strapazzate”). Google mostra un carosello di video Youtube fra i risultati di ricerca.Ora la domanda è, come trovi degli argomenti che abbiano il potenziale per farti ottenere del traffico da Google?Semplice. Trova video che ottengono già traffico da Google e crea dei tuoi video che trattino gli stessi argomenti. Puoi fare questo utilizzando il Content Explorer di Ahrefs, un database di oltre un miliardo di pagine con tanto di metriche SEO.Comincia cercando qualcosa del genere: site:youtube.com inurl:watch title:argomentoOrdina i risultati in base al traffico organico da “high” a “low” e dovresti così vedere una lista di video rilevanti che ottengono traffico da Google.Ad esempio, il video della ricetta Amritsari Chole Masala, ottiene un traffico stimato di 1,900 visitatori mensili da Google. Niente male.Una volta che hai trovato una lista di argomenti che vale la pena coprire, il passo successivo è quello di creare video “ottimizzati” che si posizioneranno su Google.Come si fa?Leggi questo post e guarda il seguente video:https://www.youtube.com/watch?v=BObU_VCwnvY4. Aumenta il tuo CTR con un titolo efficaceNon importa quanto in alto si posizionino i tuoi video, non otterrai nessuna visualizzazione se nessuno ci clicca sopra.Questo è il motivo per cui devi scrivere un titolo che invogli a fare click.Con questo non intendiamo che tu debba creare un titolo clickbait del tipo “Questo Trucco Ci Ha Fatto Ottenere 15 Milioni di Visualizzazioni In 1 Ora”. Nonostante questo potrebbe portare click, è difficile che tu possa mantenere la promessa, e questo farebbe crollare la fiducia che gli utenti hanno verso il tuo canale.Quindi, come fare per scrivere dei buoni titoli su YouTube ? Ecco alcuni consigli:Includi la parola chiave principale. Lo studio condotto da Briggsby mostra che ci sono dei benefici nel mettere la parola chiave principale all’interno del titolo. Questo combacia perfettamente con i consigli proposti da YouTube stesso che suggerisce di includere dei termini di ricerca rilevanti nel tuo titolo.Sii conciso. YouTube tronca i titolo che sono troppo lunghi. Cerca di essere conciso.Concentrati sui benefici. Urla al mondo il motivo per cui qualcuno dovrebbe guardare il tuo video.5. Crea una miniatura accattivanteMigliorare il tuo CTR non consiste nella sola ottimizzazione del titolo. Devi anche creare una miniatura che attiri l’attenzione.Ad esempio, dai uno sguardo alle miniature del nostro canale:Le abbiamo create con l’intenzione di farle risaltare.Ecco alcuni consigli per creare delle miniature che portino i visitatori a fare più click:Non scegliere semplicemente un frame del tuo video. Di solito non è gradevole graficamente e spesso nemmeno rilevante al contenuto. Piuttosto creare un’apposita versione che riesca a richiamare l’attenzione di chi naviga.Utilizza un’immagine congruente. Assicurati che la tua miniatura dimostri graficamente che il video può aiutare il visitatore a risolvere il suo problema. Se ad esempio il tuo video spiega “come fare il nodo alla cravatta”, dovresti mostrare una cravatta annodata.Sfrutta il contrasto.YouTube è prevalentemente bianco, rosso e grigio. Evita questi colori in quanto saranno troppo omogenei rispetto agli altri risultati.Utilizza del testo descrittivo sull’immagine. Di solito noi scegliamo una breve frase che completi il titolo. Ad esempio il nostro video che spiega come imparare la SEO ha le parole “Learn SEO” (in Italiano: “Impara la SEO”) nella miniatura.6. Scrivi una descrizione intriganteNon sono solo il titolo e la miniatura ad apparire nei risultati di ricerca di YouTube. Viene infatti visualizzata anche la prima frase della descrizione del video.Dato che questo può influire sul CTR, dovresti provare a farla il più attraente possibile.Detto questo, nonostante le prime linee del testo siano le più importanti, non trascurare il resto della tua descrizione. È un’occasione per incoraggiare i tuoi visitatori a guardare più video, iscriversi al tuo canale e molto altro.Ecco la descrizione per il nostro video che parla di SEO nel 2020:Utilizziamo una formula generale per tutte le nostre descrizioni:1–2 frasi avvincenti che invogliano l’utente al clickUn link per iscriversi (Basta aggiungere ?sub_confirmation=1 alla URL del canale per creare un link di iscrizione);Link a video Youtube correlati presenti sul nostro canaleUna lunga descrizione del video (di solito fra 500‑1000 parole);Timestamps per i passaggi più importanti del video (guarda anche il consiglio #11);Un’altro link per iscriversi;Link ai profili socialNiente di complicato.Ecco un template se vuoi utilizzare anche tu questo formato.7. Ottieni più visualizzazioni dai video consigliati sfruttando le playlistLe visualizzazioni correlate sono quelle provenienti da chi visualizza e clicca su uno dei video presenti nella sidebar.Abbiamo già parlato di come puoi aumentare le le tue possibilità di apparire nella sidebar. Ma c’è una seconda cosa di cui dobbiamo parlare, ovvero la sezione “Prossimi video”.Questo è un trono che vuoi rivendicare.La motivazione è semplice: il video che si trova in “Prossimi video” viene riprodotto automaticamente quando quello attuale è finito.C’è però un problema: se il tuo canale è piccolo o nuovo, è molto difficile ottenere visualizzazioni correlate a partire dai video di altri utenti. Quindi se hai appena iniziato con YouTube, dovrai fare in modo di focalizzarti sul posizionarti nei “Prossimi video” suoi tuoi stessi video.Come? Usa una playlist.Una playlist delle serie ti consente di etichettare una playlist come un set di video che dovrebbero essere visti insieme.Pensa ad esempio a come Netflix fa ciò con le stagioni e gli episodi del tuo show preferito. Guardare i video nell’ordine sbagliato non avrebbe infatti molto senso.Per creare una playlist delle serie, vai sulla tua playlist, clicca su “impostazioni playlist”, poi “impostazioni avanzate” e scegli “Imposta come serie ufficiale per questa playlist”.Per un effetto ancora migliore, imposta i video in ordine cronologico. Questo perché quando le persone guardano i video nel giusto ordine possono aumentare le possibilità di accaparrarsi il posto in “Prossimi video”.8. Incorpora i tuoi video su forum che portano trafficoCon molta probabilità, su forum e siti di risposte le persone pongono continuamente domande a cui i tuoi video possono rispondere.Ad esempio, ecco una domanda su Quora a cui uno dei nostri video YouTube può rispondere—e che abbiamo quindi deciso di incorporare nella risposta:Traduzione: Quali sono le migliori 3 tecniche di onpage SEO nel 2018?Il trucco in questo caso non è rispondere a tutte le domande. È infatti necessario trovare discussioni rilevanti che ottengono traffico da Google con consistenza.Puoi fare questo con il Site Explorer di Ahrefs.Copia ed incolla la URL di un sito molto utilizzato come ad esempio Quora, o un forum di settore più specifico come WarriorForum per la SEO. A questo punto clicca sul report Pagine Migliori per vedere le discussioni che ricevono più traffico.Ecco il risultato del processo applicato a Quora:Qui puoi anche inserire una parola chiave o una frase rilevante e di tuo interesse (come ad esempio “ricetta”, o “recipe” in inglese) nella sezione “Includi” per filtrare i risultati e vedere quelli più rilevanti.Scorri poi fra i risultati alla ricerca di domande rilevanti alle quali puoi rispondere.Ad esempio diciamo che la domanda sul “miglior modo per sostituire le uova nella ricetta del pane di mais” sembri promettente. Ora non resta che cliccare sulla piccola freccia in basso, selezionare “Overview” e poi “Organic Search” per vedere il traffico organico di quella pagina nel corso del tempo.Quello che vogliamo vedere è un flusso costante di traffico organico mese dopo mese come quello qui sotto:Queste sono le domande a cui vale la pena rispondere, dato che la possibilità che esse ci portino traffico in maniera consistente è alta.Lettura consigliata: Marketing su Quora: Milione di Visualizzazioni Generate. Ecco Come Replicare il Nostro Successo.9. Incorpora i tuoi video nei post del tuo blogIl nostro post sull’affiliate marketing ottiene circa 12,000 visite mensili.Dato che abbiamo anche un video su questo argomento, lo abbiamo incorporato, generando così 2,553 visualizzazioni extra fino ad oggi.Non male, vero?Detto con chiarezza quello che ti stiamo dicendo è questo: se hai un blog, dovresti incorporare i tuoi video nei contenuti che sono rilevanti.Come fai a sapere in quali pagine incorporare i tuoi video?Il modo migliore è affidarsi al buon senso. Se hai un video che tratta lo stesso argomento di cui parli nel tuo post, allora dovresti incorporarlo.Un’altra opzione consiste nel cercare pagine ad alto traffico che possono generare visualizzazioni per i tuoi video su YouTube direttamente da Google Analytics o Google Search Console.Se non hai Google Analytics o Google Search Console configurati, puoi inserire il dominio nel Site Explorer di Ahrefs e guardare il report delle Pagine Migliori per vedere quelle che ottengono più traffico organico10. Usa le schermate finali e le schedeLe schermate finali sono miniature che puoi aggiungere nella parte finale del video.Le schede, d’altro canto, sono delle slide che puoi aggiungere in qualsiasi punto del video.Puoi utilizzarle per consigliare altri video e playlist, aggiungere sondaggi o anche link verso un sito web.È bene notare che, nonostante mandare traffico verso il proprio sito sia allettante, è meglio far rimanere gli utenti su YouTube.Dall nostra esperienza possiamo infatti affermare che avere sessioni più lunghe di visualizzazione dei video porta benefici molto più grandi che qualche visita al proprio sito.Se di solito non aggiungi schermate finali e schede ai tuoi video, è il momento di cominciare. Non è un processo che prende troppo tempo, e utilizzandole siamo riusciti ad accumulare decine di migliaia di visualizzazioni sui nostri video.11. Aggiungi i Timestamp per visualizzare i “key moments” su GoogleGoogle talvolta mostra i cosiddetti “key moments” nei risultati di ricerca:I key moments consentono agli utenti di saltare su dei punti predefiniti e di interesse presenti nel tuo video.Chiaramente, Google è più portato a mostrare questi “key moments” se aggiungi dei Timestamp e delle etichette nella descrizione dei tuoi video Youtube.Un Timestamp non è altro che un modo per contrassegnare una particolare sezione del tuo video utilizzando il formato [ore]:[minuti]:[secondi]. Le etichette sono invece delle brevi e concise descrizioni delle sezioni demarcate dai Timestamp.Nota a margine. Puoi ignorare [ore] se non ti serve. Ecco come aggiungerli:Ad esempio dai uno sguardo ai timestamps e alle etichette presenti sul nostro video che parla di SEO per YouTube:Questi timestamp portano il visitatore a specifiche sezioni del video. Ad esempio, cliccando su 13:01 si viene portati nella parte del video in cui Sam descrive come effettuare delle ottimizzazioni direttamente sul video.E sembra che queste ottimizzazioni funzionino. Google mostra infatti i “key moments” per la query di ricerca “how to rank YouTube videos” (in Italiano: “come posizionare video su YouTube”).Ecco alcuni consigli per aggiungere i timestamps e le etichette:Posiziona ogni timestamp su una nuova linea,e specifica la relativa etichetta sulla stessa linea.Elenca i timestamp in ordine cronologico. Ad esempio, non inserire il timestamp a 15:24 prima di quello a 11:33.Scrivi etichette concise e descrittive. Google tende a troncare quelle troppo lunghe. Quindi, spiega semplicemente di cosa parla quella sezione, invece di fare un abuso di parole chiave.Allinea il frame del video con il nome dell’etichetta. Se la tua etichetta si chiama “Tagliare la cipolla”, prova ad aggiungere il timestamp nel momento in cui stai tagliando la cipolla nel video.12. Pubblica i video nel momento migliore per la tua audienceIl momento migliore è quello in cui la tua audience guarda video. Puoi identificare i momenti di picco utilizzando il nuovo report di YouTube: “Quando i tuoi spettatori sono su YouTube”.Nota a margine. Questo report è nuovo ed in fase sperimentale da parte di YouTube. Ti consigliamo di pubblicare circa un’ora prima del picco, piuttosto che durante. Questo da ai nostri potenziali spettatori tempo di scoprire e guardare i nostri video, portandoci così un maggior numero di visualizzazioni.Ad esempio, un buon momento per pubblicare i nostri video è intorno alle 8–9 di sera nel nostro orario locale di Singapore.Se non hai abbastanza visualizzazioni giornaliere per far funzionare questo report a dovere, puoi provare ad utilizzare questi timeslot generali, cortesia di Frederator Networks.I migliori orari per pubblicare su Youtube Lunedì Martedì Mercoledì Giovedì Venerdì Sabato Domenica14–16 14–16 14–16 12–15 12–15 9–11 9–11Fonte: https://ahrefs.com/blog/youtube-seo/13. Aggiungi dei tag rilevanti al videoC’è evidenza nel fatto che i tag su YouTube non siano importanti. Dato però che ci vogliono davvero pochi secondi per inserirli, vale la pena farlo—potrebbero comunque aiutare un paio di persone in più a trovare il tuo video.Il processo a 3 step che utilizziamo qui a Ahrefs per identificarli è il seguente:Prima di tutto, imposta un tag con la tua parola chiave principale.Le linee guida ufficiali di YouTube per i tag dicono di “utilizzare le parole e le frasi che hanno più senso per i tuoi video”, di conseguenza è piuttosto logico cominciare con la parola chiave principale.Ad esempio, se dovessimo aggiungere dei tag per il nostro video sulla content promotion (in Italiano: promozione dei contenuti), il primo sarebbe proprio “content promotion”:Come seconda cosa, aggiungi parole chiave comuni e rilevanti prese dai video che si posizionano meglio.Per trovarle più facilmente puoi utilizzare delle estensioni come vidIQ e TubeBuddy. Installane una, cerca la parola chiave di tuo interesse su YouTube, apri 3–5 video che ti sembrano attinenti alla ricerca e identifica i tag che hanno in comune.Ad esempio tag come “content promotion plan”,”how to promote your content”, e “how to promote your blog”, appaiono in tutti i video dei nostri competitor sulla content promotion. Di conseguenza li aggiungeremo anche noi al nostro.Come terza cosa, aggiungi invece delle parole chiave rilevanti che hanno volume di ricerca.Il modo più semplice per fare questo è quello di incollare i tags trovati nel punto precedente all’interno del Keyword Explorer, avendo l’accortezza di impostare come motore di ricerca Youtube. Scandaglia poi la lista alla ricerca di quelli che hanno volume di ricerca.Nel nostro caso, “blogging”,”content marketing”, e “content marketing strategy” sono affini al nostro video, quindi abbiamo deciso di aggiungere anche questi.Parliamo di questo processo nel dettaglio all’interno della nostra guida ai tag su YouTube..14. Ottieni delle visualizzazioni che interagiscono con il video grazie alle Ads di YoutubeSe hai budget, il metodo migliore per ottenere più visualizzazioni è quello di pagarle. Per fare ciò devi utilizzare gli annunci su YouTube.A dirla tutta, è qualcosa con cui noi abbiamo sperimentato per un pò. Lo facciamo impostando come target le parole chiave che su YouTube ci stanno già portando visualizzazioni.Il motivo è semplice: non vogliamo visualizzazioni tanto per averle. Quello che cerchiamo sono visualizzazioni che coinvolgano le persone.Dato che questi video producono già lunghi tempi di visualizzazione, con molta probabilità chi trova il video dagli annunci lo guarderà fino alla fine. E sempre queste persone potrebbero decidere di guardare altri video, dato che hanno trovato utile il primo.Per prima cosa apri il report chiamato “Sorgenti di traffico” su YouTube analytics e clicca su Ricerca di YouTube.Qui puoi vedere un report che mostra le parole chiave che hanno portato più visualizzazioni suoi tuoi contenuti e la loro durata media.Come puoi osservare qui sopra, “seo” e “seo tutorial” producono ottimi tempi di visualizzazione per noi. Abbiamo quindi creato un annuncio che ha come target proprio queste parole chiave.A 0.07 centesimi di dollaro, è un modo piuttosto economico per avere più visualizzazioni.Considerazioni FinaliNon dimenticarti di sfruttare anche la tua audience esterna a YouTube. Se hai un database di email o un seguito sui social media, assicurati di condividere i tuoi video anche con loro.Infine, chiedi ai tuoi visitatori di condividere i tuoi video. Si, è un metodo piuttosto abusato, ma non c’è nulla di male ad aggiungerlo alla parte finale dei tuoi video.Basta non fare troppo spam e “chiedere” di condividere in ogni minuto del video.Pensi che ci siano altre tattiche efficaci di cui non ho parlato ? Fammelo sapere su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "14 Comprovati Modi per Ottenere Più Visualizzazioni su YouTube"
    },
    {
      "level": "H2",
      "text": "1. Trova un nicchia"
    },
    {
      "level": "H2",
      "text": "2. Crea video su argomenti che le persone cercano"
    },
    {
      "level": "H2",
      "text": "3. Posiziona i tuoi video su Google"
    },
    {
      "level": "H2",
      "text": "4. Aumenta il tuo CTR con un titolo efficace"
    },
    {
      "level": "H2",
      "text": "5. Crea una miniatura accattivante"
    },
    {
      "level": "H2",
      "text": "6. Scrivi una descrizione intrigante"
    },
    {
      "level": "H2",
      "text": "7. Ottieni più visualizzazioni dai video consigliati sfruttando le playlist"
    },
    {
      "level": "H2",
      "text": "8. Incorpora i tuoi video su forum che portano traffico"
    },
    {
      "level": "H2",
      "text": "9. Incorpora i tuoi video nei post del tuo blog"
    },
    {
      "level": "H2",
      "text": "10. Usa le schermate finali e le schede"
    },
    {
      "level": "H2",
      "text": "11. Aggiungi i Timestamp per visualizzare i “key moments” su Google"
    },
    {
      "level": "H2",
      "text": "12. Pubblica i video nel momento migliore per la tua audience"
    },
    {
      "level": "H2",
      "text": "13. Aggiungi dei tag rilevanti al video"
    },
    {
      "level": "H2",
      "text": "14. Ottieni delle visualizzazioni che interagiscono con il video grazie alle Ads di Youtube"
    },
    {
      "level": "H2",
      "text": "Considerazioni Finali"
    }
  ],
  "author": "Si Quan Ong"
}