{
  "url": "https://ahrefs.com/blog/it/come-scrivere-un-titolo/",
  "slug": "come-scrivere-un-titolo",
  "title": "Come Scrivere un Titolo Irresistibile in 3 Semplici Mosse",
  "description": "Un titolo efficace cattura l’attenzione del lettore e lo spinge a cliccare descrivendo il contenuto. Impara come scrivere un titolo accattivante in questa guida.",
  "content": "Brett G. Friedman Creativo data-driven, amante del tè, nerd delle parole, e proprietario di BrettGFriedman.com, l’indirizzo online che chiamo casa. Contenuti Anche se hai scritto il miglior articolo al mondo per il tuo blog, nessuno lo leggerà senza un titolo efficace.Perchè?Perché il click te lo devi guadagnare ed è proprio questo il compito del titolo.In questo articolo imparerai come scrivere un titolo irresistibile che riesca ad attrarre i visitatori senza essere un clickbait.Ma prima…Cos’è un titoloPerché i titolo sono importanti?Come scrivere un titolo in 3 mosse4 consigli per scrivere un titoloCos’è un titoloIl titolo è un’intestazione, un nome.Un buon titolo assolve a tre scopi:Cattura l’attenzione del lettoreRende il lettore abbastanza curioso da farlo cliccareDescrive accuratamente il contenutoSe riesci a fare tutte e tre le cose in una sola frase, otterrai i tanto agognati lettori.Perché i titolo sono importanti?Un buon titolo porta le persone verso il tuo articolo. A dirla tutta, nella maggior parte dei casi, il tuo titolo sarà l’unico fattore che porterà le persone a decidere se il tuo articolo è uno di quelli che vale la pena leggere. I titoli tendono inoltre a competere per l’attenzione dell’utente in diversi modi, a seconda della piattaforma sulla quale appaiono.Sui social mediaIl tuo articolo è inserito all’interno di uno scroll infinito di notizie allarmanti, post scritti dalle personalità più popolari tra la tua audience e annunci pensati per spingere le loro menti dal browsing all’acquisto. Ricorda che le persone hanno una soglia dell’attenzione molto sottile. Il tuo titolo deve battersi e vincere contro tutti questi competitor che sono ben allenati.Negli oggetti delle emailIn media, un impiegato d’ufficio riceve 112 email al giorno. Anche se solo il 10% di queste sono newsletter con link verso degli articoli, la maggior parte delle persone non ne leggerà 12 al giorno. Ne sceglieranno poche, solo quelle più intriganti, basandosi sul titolo.Nei risultati di ricercaLa maggior parte dei siti riceve circa 2/3 del traffico da Google. Un buon titolo aumenterà la probabilità che chi cerca clicchi sulla tua pagina e non sul resto dei risultati.Come scrivere un titolo in 3 mosseScrivere un titolo non è così complicato. Puoi imparare le basi seguendo un sistema composto da tre passaggi. Tieni però alcune cose a mente man mano che ci lavori: Scrivi un titolo per chi cerca su Google,in quanto, molto probabilmente come detto prima, sarà il canale che ti porterà più traffico. Solitamente è meglio scrivere il titolo prima dell’articolo e questo sistema segue proprio questo approccio. Detto questo, puoi comunque utilizzare ogni passaggio per rifinire e migliorare i titoli già esistenti. Dovresti evitare titoli clickbait e tenere a mente i reali contenuti del tuo articolo man mano che applichi i passaggi qui sotto. Spesso scrivere un titolo dopo aver scritto l’articolo porta a sovrastimare quello che il lettore otterrà dalla sua lettura. E se l’articolo non porta quello che promette, allora è un’esca (clickbait).Ma il tuo articolo sarà in grado di portare risultati. Perché puoi fare affidamento sulla guida approfondita di Rebekah Bek 😉Ora andiamo a scrivere il titolo!Scegli un formatoScegli il giusto angleRendilo umano1. Scegli un formatoPoniamo caso che tu stia scrivendo un articolo riguardo le migliori proteine in polvere. Uno qualsiasi di questi formati potrebbe funzionare come titolo: Listicle: Le 10 Migliori Proteine in Polvere per Mettere sù Muscoli nel 2021 Infoguida: Come Scegliere le Migliori Proteine in Polvere per Te Tutorial: Migliori Proteine in Polvere: Scegliere le Migliori in 6 Mosse Articolo con la tua opinione: Esiste Davvero un Qualcosa Come le Migliori Proteine in Polvere? La Scienza Dice No Recensione: Recensione di Optimum Nutrition Gold Standard: le Migliori Proteine in Polvere Confronto: Optimum Nutrition vs. MyProtein: Quali Sono le Migliori Proteine in Polvere?Ricorda però, per la maggior parte dei siti la fonte di traffico più importante è Google. Non dovresti quindi semplicemente scegliere un formato per il tuo titolo in base a quello che ti sembra il migliore. Dovresti invece scegliere quello che chi ricerca si aspetta di trovare per avere più possibilità di posizionarti.Come si fa?Dai uno sguardo alle pagine meglio posizionate per la tua parola chiave principale su Google, e trova l’angolo dominante. Puoi vedere come i primi 3 risultati per “migliori proteine in polvere” (o “best protein powder” in inglese) siano tutti dei listicle.Tieni a mente che i risultati di Google sono personalizzati in base a fattori come la tua posizione e la cronologia di ricerca. Per ovviare a questo, utilizza la Toolbar SEO di Ahrefs attraverso una finestra in incognito per simulare una ricerca dal Paese e nella lingua che ti interessano.Considera anche che la tipologia di titolo che funziona meglio dipende dall’argomento. Anche se un listicle è la scelta ideale per un articolo sulle migliori proteine in polvere, un titolo del tipo “come fare” è meglio per un articolo come quello che stai leggendo in questo momento. Il tuo argomento potrebbe anche aver bisogno di un’opinione personale da parte tua. Tutto dipende dai dati della tua ricerca.PRO TIPSe stai scrivendo un titolo per un articolo esistente che non rispetta il search intent dominante nei risultati di ricerca, verifica la possibilità di cambiare la prospettiva del contenuto con delle piccole modifiche. Ad esempio, puoi trasformare velocemente un tutorial in un listicle spostando alcune parole:Scrivi un Ottimo Titolo: un Sistema a Sei Passaggi→6 Modi per Scrivere un Ottimo Titolo2. Dai un angolo vincenteOra che hai scelto il formato giusto, devi trovare l’angle dei contenuti meglio posizionati.Utilizzando gli stessi articoli del passaggio precedente, vai alla ricerca di parole che li rendono unici. Quando analizzi un listicle ad esempio, la maggior parte di questi comincia con “# Migliori Proteine in Polvere per…”Quello che viene dopo il “per” è quel che in gergo viene chiamato “angle”. Nel caso delle “migliori proteine in polvere”, l’angle dominante è il sesso, ad esempio “per gli Uomini” o “per le Donne”.Ma nella SERP sono presenti anche altre opzioni, come:“Per una migliore alimentazione”“Per qualsiasi dieta”“Per te”Quando scegli un angle, devi trovare il giusto bilanciamento fra quello che gli utenti vogliono trovare e quello di cui puoi parlare nel tuo articolo. Se sei un esperto e sai che un angle specifico ha più senso rispetto ad un altro, dovresti optare per quello.Se non esiste un angle dominante o questo non è particolarmente ovvio, concentrati sul beneficio principale, un qualcosa che mette in risalto il tuo prodotto/servizio o semplicemente qualcosa su cui nessuno si è ancora concentrato, ma che i tuoi lettori vogliono ottenere.Ad esempio:“Per perdere peso” “Per avere più muscoli”“Per fare massa”Una volta che hai la base del tuo titolo, ovvero formato e angle, devi fare un’ultima cosa…3. Rendilo umanoPer colpire davvero i lettori, devi rendere il tuo titolo più umano.Se sei un essere umano tu stesso, questo non dovrebbe risultare complicato. Utilizza aggettivi o modi di dire che utilizzeresti per descrivere casualmente l’articolo al tuo migliore amico.Quindi, invece di un qualcosa come “Le 10 migliori proteine in polvere per perdere peso”, potresti scrivere:“Le 10 migliori proteine in polvere per perdere peso senza sforzi”“Le 10 migliori proteine in polvere per perdere i chili di troppo”“Le 10 migliori proteine in polvere per ottenere il fisico”Per rendere questo processo più semplice, utilizza il linguaggio dei tuoi utenti. In ogni settore infatti c’è un gergo specifico, e questo è solitamente il modo in cui le persone “che sanno” parlano delle loro cose preferite. Se hai un pò di tempo a disposizione, leggi più articoli che puoi sull’argomento.Puoi anche fare un giro sui social media che parlano dell’argomento di tuo interesse. Reddit, Twitter e LinkedIn sono ottimi per trovare le frasi e parole specifiche di una community. Alcuni sub-reddit forniscono addirittura un Wiki o un Glossario con la definizione delle parole chiave più importanti.Wiki per r/fitnessUtilizzando queste informazioni, potresti optare per un titolo come “17 Proteine in Polvere Che Ti Aiuteranno A Raggiungere La tua quota di Macro Nutrienti” o “14 Proteine in Polvere Facili e Veloci da Preparare e Consumare”.4 consigli per scrivere un titoloScegliere il giusto formato, angolo e “renderlo umano” è già un ottimo processo “di base” per scrivere un buon titolo.Detto questo, dopo anni passati a scrivere titoli, abbiamo altri 4 consigli per te.1. Rendilo più concretoPiù il tuo titolo è specifico, più sarà semplice da leggere. Più è semplice da leggere, più le persone lo apprezzeranno. Più le persone lo apprezzano, più saranno le probabilità che ci clicchino.È semplice, la specificità proviene da cose tangibili, facenti parte del mondo reale.Ad esempio, invece di scrivere “Proteine in Polvere per Prendere Peso”, prova “15 Gustose Proteine in Polvere per Aiutarti a Prendere Mezzo Chilo Di Massa Muscolare a Settimana”.2.Sorprendi e fai divertireSe il tuo scopo è quello di ottenere traffico da fonti diverse dai motori di ricerca, come ad esempio i social, far combaciare il tuo search intent potrebbe non essere così importante. Potresti quindi avere un impatto maggiore dicendo qualcosa di interessante e inusuale per far in modo che le persone si fermino e clicchino.Non esiste una formula in questo caso; tutto dipende dal conoscere la tua audience, il linguaggio che utilizza e cosa potrebbe funzionare in base ai loro interessi.3. Suscita curiositàFornisci informazioni a tutti, tranne a quelli che vuoi rendere curiosi, come ad esempio “Tutti quanti lo stanno facendo tranne te!”. Assicurati però di poter tener fede a quanto dici all’interno del tuo articolo, altrimenti sarà solamente l’ennesimo esempio di clickbait.Testa delle varianti per il titoloQuando condividi il tuo articolo sui social o altre piattaforme, puoi scegliere un titolo differente. Testa delle variazioni sul tema principale per vedere se qualcuno di questi titoli otterrà più click, like, commenti e condivisioni. Utilizzalo poi come titolo principale.ConclusioniCreare un titolo d’impatto non è fantascienza. È scienza del marketing, il che significa che è piuttosto semplice. Infatti, se utilizzi il sistema a tre passaggi mostrato sopra, sarai in grado di tener testa ai migliori autori nel tuo settore.Una volta pronto a diventare il miglior autore di titoli in circolazione, leggiti i classici del copywriting. Tutti contengono delle formule per scrivere titoli basate su prove empiriche e supportate da diverse teorie.Questi sono i cinque libri da cui ho imparato di più: Scientific Advertising di Claude Hopkins. Ha introdotto il concetto di ‘copy testing’ fornendo un dettaglio dei titoli più di successo utilizzati nel marketing a risposta diretta intorno al 1923. Tested Advertising Methods di John Caples. I metodi di Claude Hopkins revisionati dopo un decennio. Include le formule per scrivere titoli più di successo che funzionano ancora passato quasi un secolo dalla pubblicazione. Breakthrough Advertising di Eugene Schwartz.Introduce l’idea di ‘Brand Awareness’ e come fare marketing ad ogni livello in cui si trova il consumatore. The Wizard of Ads di Roy Williams. Questo è un libro più moderno oltre ad essere uno dei miei preferiti che fornisce alcuni degli approcci più unici al copywriting. Great Leads di Michael Masterson. Si concentra esclusivamente su come scrivere quella prima linea di copy che avrà l’impatto più grande sulla tua audience.Una volta che sei diventato un esperto nello scrivere titoli, puoi ottimizzare il resto del tuo articolo seguendo la magica guida al copywriting SEO di Sì Quan Ong.Sentiti libero di Contattarmi su Twitter per inviarmi un messaggio (ma usa un buon titolo!).Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Come Scrivere un Titolo Irresistibile in 3 Semplici Mosse"
    },
    {
      "level": "H2",
      "text": "Cos’è un titolo"
    },
    {
      "level": "H2",
      "text": "Perché i titolo sono importanti?"
    },
    {
      "level": "H3",
      "text": "Sui social media"
    },
    {
      "level": "H3",
      "text": "Negli oggetti delle email"
    },
    {
      "level": "H3",
      "text": "Nei risultati di ricerca"
    },
    {
      "level": "H2",
      "text": "Come scrivere un titolo in 3 mosse"
    },
    {
      "level": "H3",
      "text": "1. Scegli un formato"
    },
    {
      "level": "H3",
      "text": "2. Dai un angolo vincente"
    },
    {
      "level": "H3",
      "text": "3. Rendilo umano"
    },
    {
      "level": "H2",
      "text": "4 consigli per scrivere un titolo"
    },
    {
      "level": "H3",
      "text": "1. Rendilo più concreto"
    },
    {
      "level": "H3",
      "text": "2.Sorprendi e fai divertire"
    },
    {
      "level": "H3",
      "text": "3. Suscita curiosità"
    },
    {
      "level": "H3",
      "text": "Testa delle varianti per il titolo"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Brett G. Friedman"
}