{
  "url": "https://ahrefs.com/blog/it/come-usare-ahrefs/",
  "slug": "come-usare-ahrefs",
  "title": "Come Utilizzare Ahrefs: 11 Modi D’Uso Per Principianti",
  "description": "Vuoi sapere come utilizzare Ahrefs per migliorare la tua SEO? Dai un'occhiata a questi 11 modi per usare il tool in maniera efficace.",
  "content": "Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim Contenuti Ahrefs include molti strumenti e funzionalità che possono aiutarti a migliorare i tuoi sforzi nella SEO e nel marketing. Ma per chi inizia, la nostra piattaforma SEO può sembrare estremamente complessa.Quindi se non hai esperienza nell’utilizzo di strumenti SEO come Ahrefs, in questa guida troverai 11 esempi su come utilizzare facilmente e velocemente il nostro strumento per un riscontro immediato.In questo articolo troverai informazioni sui seguenti argomenti:1. Scopri il traffico organico dei tuoi concorrenti 2. Scopri quali pagine portano traffico organico ai tuoi concorrenti 3. Studia cosa cercano le persone su Google 4. Misura l’intero potenziale di traffico organico di un argomento 5. Individua i problemi SEO che danneggiano le prestazioni del tuo sito 6. Stima la difficoltà di posizionamento di qualsiasi parola chiave 7. Scopri quali sono i backlink dei tuoi concorrenti 8. Scopri quali sono i contenuti più apprezzati dei tuoi concorrenti 9. Monitora il tuo ranking per migliaia di parole chiave 10. Trova le lacune nella tua content strategy 11. Trova centinaia di potenziali link di qualità in pochi secondi1. Scopri il traffico organico dei tuoi concorrentiTutti coloro che gestiscono aziende e attività vogliono sapere come stanno andando i loro concorrenti.Stanno ricevendo più traffico di me?Il loro traffico sta crescendo o è fermo?Posso batterli considerando il mio attuale tasso di crescita o devo fare di più?Il Site Explorer di Ahrefs ti aiuta a rispondere a queste domande mostrandoti quanto traffico organico ottengono i tuoi concorrenti e permettendoti di confrontare il tuo traffico con il loro.Come si vede dallo screenshot qui sopra, il nostro sito web (ahrefs.com) riceve oltre 1 milione di visite al mese da Google. Nel 2019 abbiamo superato uno dei nostri principali concorrenti (moz.com) in termini di traffico organico.Ci sono però due cose importanti da sapere:Ahrefs segnala solo il traffico organico di un sito web. Non tiene conto del traffico diretto, del traffico da referral, del traffico dei social network, ecc. I numeri di traffico in Ahrefs sono stime. Queste stime spesso si discostano un po’ dai numeri effettivi che vedi in Google Search Console. Questa discrepanza dovrebbe però essere coerente per tutti i siti all’interno di un settore specifico.Ti faccio un esempio per illustrarti meglio questo punto.Mettiamo il caso che Ahrefs mostri il 20% in meno di traffico organico rispetto a quello che, secondo Google Search Console, riceve il tuo sito. Ciò significa che il nostro strumento probabilmente sottostima anche il traffico dei tuoi concorrenti del 20%.LO SAPEVI?Secondo un recente studio condotto da AuthorityHacker, le stime del traffico di Ahrefs sono risultate le più accurate e coerenti se comparate con tutte quelle rilasciate dalle principali piattaforme SEO.2. Scopri quali pagine portano traffico organico ai tuoi concorrentiDopo aver identificato quanto traffico organico ottengono i tuoi concorrenti, il passaggio successivo è studiare quali sono le pagine dalle quali arriva la maggior parte di quel traffico.Il Site Explorer di Ahrefs ti aiuta a trovare una risposta in pochi minuti. Ti basta aprire la voce Pagine e vedrai un elenco delle pagine dei tuoi concorrenti ordinate in base a quanto traffico organico ottengono.Ad esempio, il 33,3% di tutto il traffico di ricerca di questo blog arriva da cinque articoli:Puoi ricavare molte informazioni sulle strategie di marketing e di business dei tuoi concorrenti studiando le loro pagine più performanti:Quali pagine portano la maggior parte del traffico organico?Quanto traffico organico è diretto alla home page rispetto ad altre pagine?Quanto traffico organico ottengono le loro pagine di prodotto?A quali fasi del percorso di acquisto si riferiscono con quelle pagine?Studiare ciò che funziona per i tuoi concorrenti ti aiuterà a prendere decisioni di marketing migliori in fase di pianificazione della tua strategia.3. Studia cosa cercano le persone su GoogleUna delle chiavi per aumentare il tuo traffico da Google è studiare le ricerche popolari nel tuo settore. In questo modo potrai creare contenuti su argomenti che le persone cercano. Questo, in gergo SEO, è ciò che viene chiamato fare keyword research o ricercare le parole chiave. Lo strumento Keywords Explorer di Ahrefs ti consente di valutare la popolarità di qualsiasi chiave di ricerca e ti aiuta a scoprire migliaia di parole chiave pertinenti da prendere come riferimento per i tuoi contenuti. Per esempio la parola chiave “bitcoin” è cercata una media di 6,5 milioni di volte al mese su Google, solo negli Stati Uniti. E il suo volume di ricerca globale è pari a 25 milioni al mese.Se gestisci un sito web che si occupa di criptovalute, sono certo che non ti sognerai mai di posizionarti al primo posto su Google per la parola chiave “bitcoin”. La concorrenza è troppo agguerrita e questo rende letteralmente impossibile posizionarsi per quella parola chiave.Ma ci sono centiana e centinaia di ricerche che contengono la parola “bitcoin” per le quali anche un sito nuovo di zecca potrebbe essere in grado di posizionarsi.Il report Matching terms in Keywords Explorer suggerisce ben 558.968 parole chiave che contengono la parola “bitcoin”, ordinate in base al volume di ricerca mensile:LO SAPEVI?Ahrefs ha il più grande database di parole chiave con volumi negli Stati Uniti. Ad ottobre 2021, conteneva oltre 4 miliardi di parole chiave (con milioni di nuove query aggiunte ogni mese).Potrebbe anche interessarti il rapporto sui Related terms in Keywords Explorer, che mostra parole chiave in qualche modo rilevanti per la parola “bitcoin” ma che non necessariamente contengono quella parola al loro interno:4. Misura l’intero potenziale di traffico organico di un argomentoQuando selezioniamo le parole chiave su cui investire, tendiamo a considerare il loro volume di ricerca mensile come un’indicazione della quantità di traffico di ricerca che possono portarci.In realtà il volume di ricerca di una singola parola chiave può essere piuttosto fuorviante perché le pagine web non si classificano mai per una sola parola chiave.Stando al nostro studio, una pagina che si classifica al primo posto per alcune parole chiave si classificherà in alto anche per circa un migliaio di altre parole chiave simili, le quali chiaramente genereranno traffico.Ad esempio, diamo un’occhiata alla parola chiave “submit website to search engines”, in inglese.È cercata solo 450 volte al mese negli Stati Uniti, secondo Keywords Explorer.Ma se scorriamo verso il basso fino al rapporto relativo alla SERP Overview (Panoramica della SERP), notiamo che la pagina al primo posto per questa parola chiave (che sembra provenire da questo stesso blog) riceve 5.893 visite solo negli Stati Uniti e si posiziona per un totale di 1.224 parole chiave.Ecco alcune di queste parole chiave “extra” per le quali si classifica al primo posto e da cui riceve traffico:Come puoi vedere, “submit website to search engines” è solo uno dei tanti modi in cui le persone cercano. E se la tua pagina si posiziona in alto per questa query di ricerca, inevitabilmente si posizionerà bene e otterrà traffico organico anche da tutte le altre varianti.Ecco perché è importante non prendere decisioni SEO basate esclusivamente sul volume di ricerca di una singola parola chiave.Dovresti prendere l’abitudine di esaminare le pagine in alto su Google e vedere quanto traffico organico totale ottengono da tutte le varianti legate ad una specifica parola o frase.Nel Keywords Explorer di Ahrefs trovi una metrica utile per questo, che si chiama Traffic potential.Questo dato mostra quanto traffico ottiene in totale la pagina che si posiziona al primo posto per la tua parola chiave, che spesso è un numero molto più approfondito e fattibile rispetto al volume di ricerca di quella parola chiave.5. Individua i problemi SEO che danneggiano le prestazioni del tuo sito Google ha messo insieme una lista di consigli che coloro che gestiscono un sito dovrebbero seguire per fare in modo che il loro sito sia ottimizzato per il motore di ricerca.Ed è un vero peccato se il tuo sito non riceve il traffico che merita a causa di fastidiose problematiche tecniche SEO.La funzionalità di Site Audit di Ahrefs ti aiuterà a fare in modo che questo non accada. Infatti è pensata per analizzare il tuo sito e individuare più di 120 problemi SEO comuni, dandoti consigli dettagliati su come risolverli.Puoi anche impostare un audit del sito periodico e monitorare il tuo punteggio SEO Health (Health Score) nel tempo. Ciò è particolarmente utile quando ci sono molte persone nella tua azienda che possono apportare modifiche al tuo sito e, così facendo, potrebbero creare danni accidentali.6. Stima la difficoltà di posizionamento di qualsiasi parola chiaveAlcune parole chiave sono incredibilmente facili da piazzare su Google, mentre altre sono praticamente impossibili, anche per siti grandi e autorevoli. Ma come fai a sapere come potrebbero comportarsi le varie parole chiave?All’interno del Keywords Explorer di Ahrefs è presente un dato chiamato Keyword Difficulty (KD) che valuta ogni parola chiave su una scala da 0 a 100; il valore 100 indica che la parola è difficile.Come puoi vedere nello screenshot qui sopra, la parola chiave “marketing” in inglese ha un punteggio KD di 79, che è considerato “super difficile”.E c’è anche una breve spiegazione proprio sotto questo numero:Crediamo che avrai bisogno di backlink da circa 329 siti per apparire nelle prime 10 posizioni per questa parola chiave.Analizziamolo frase per frase perché spiega come funziona il dato di KD. “Crediamo”: la nostra metrica KD è solo una stima. Google utilizza centinaia di diversi fattori di ranking, che variano a seconda della query di ricerca. Nessuno strumento può essere accurato al 100% nel prevedere la difficoltà di posizionamento di una parola chiave. “Avrai bisogno di backlink da circa 329 siti”: sappiamo per certo che i backlink da altri siti sono uno dei segnali di ranking più importanti per Google. È abbastanza improbabile che tu riesca a superare i siti in alto nella prima pagina a meno che tu non ottenga più backlink (o link di qualità superiore) rispetto a quelli che sono già ai primi posti nella SERP. “Apparire nelle prime 10 posizioni”: non c’è assolutamente modo di prevedere se ti posizionerai mai al primo posto per una parola chiave. Ma posizionarsi tra i primi 10 è molto più facile da prevedere.Detto ciò, non consigliamo ai nostri clienti di prendere importanti decisioni SEO basate solo su questo semplice numero a due cifre. La difficoltà di posizionamento di una parola chiave è infatti molto più complessa da analizzare e decifrare.Il dato KD di Ahrefs è incredibilmente utile quando si filtrano migliaia di idee per le parole chiave e si cerca il cosiddetto “elemento vincente”.Per esempio ci sono quasi 2 milioni di query di ricerca nel database di Ahrefs che contengono la parola “marketing”. Ma solo 29.000 di loro hanno un punteggio KD inferiore a 5 (cioè molto facile da posizionare su Google).Ma non innamorarti troppo delle parole chiave con KD basso. Se alcune parole chiave hanno un punteggio KD alto, non significa che vanno evitate. Significa solo che ci vorrà molto lavoro per fare in modo che si posizionino per bene in Google. E prima inizi a lavorarci, prima otterrai risultati.7. Scopri quali sono i backlink dei tuoi concorrentiUno dei compiti più comuni di chi si occupa di SEO è capire quali sono i backlink dei siti che si posizionano più in alto su Google (e come ottenere gli stessi backlink per la propria pagina).Il Site Explorer di Ahrefs è uno strumento assolutamente indispensabile per lavorare a questo aspetto. Basta prendere la pagina posizionata al primo posto per la parola chiave desiderata, inserire l’indirizzo nello strumento e visualizzare il rapporto dei Backlinks.Ad esempio, 526 pagine (provenienti da siti unici) linkano il risultato in prima posizione su Google per la parola chiave “SEO training course” (in inglese):Anche noi di Ahrefs abbiamo il nostro “Corso SEO” e anche noi vogliamo posizionarci bene per la parola chiave scelta. Quindi essere in grado di trovare tutte le pagine che hanno inserito un link alle pagine dei nostri concorrenti SEO è incredibilmente prezioso.A questo punto non dovremmo fare altro che contattare i proprietari di quei siti e chiedere loro di inserire un link al nostro corso di formazione SEO insieme a quello che stanno già menzionando. Se riusciamo a ottenere link da queste pagine, questo ci aiuterà a posizionarci più in alto per quella specifica parola chiave.LO SAPEVI?Ahrefs ha il più grande database di link esistenti. Ci impegniamo molto per scansionare frequentemente il nostro database di backlink in modo che i nostri dati rimangano sempre aggiornati. Inoltre, non segnaliamo i collegamenti che non sono più presenti.8. Scopri quali sono i contenuti più apprezzati dei tuoi concorrentiSe vuoi aumentare l’autorità del tuo sito web agli occhi di Google, devi pubblicare i contenuti che altre persone vogliono linkare nei loro siti.Ma come fai a sapere a cosa sono interessate le persone del tuo settore?Facile! Basta studiare i siti dei tuoi principali concorrenti e vedere quali delle loro pagine ha ottenuto più link organici. Puoi farlo inserendo i loro siti nel Site Explorer e visualizzando il report Migliore per link.Ad esempio, queste sono le pagine più linkate di questo blog:Come puoi vedere, 3 dei primi 5 articoli più linkati sul blog di Ahrefs (esclusa la nostra home page) sono studi con dati. Ciò suggerisce che le ricerche con i dati sono ciò che attira i backlink da persone nel settore del marketing digitale e della SEO.Fai una prova con i siti dei tuoi principali concorrenti e sono sicuro che troverai le tipologie di pagine (o risorse) che attirano il maggior numero di backlink nel tuo settore.LO SAPEVI?Ahrefs ha il secondo crawler più attivo dopo quello di Google e questo ci consente di scoprire nuovi backlink e aggiungerli al nostro database molto più velocemente rispetto a qualsiasi altro strumento SEO.9. Monitora il tuo ranking per migliaia di parole chiaveAnche se è nuovo, ci sono buone probabilità che il tuo sito venga indicizzato da Google per parecchie parole chiave. Potrebbe non necessariamente posizionarsi in prima pagina, ma ci sono altre nove pagine di risultati di ricerca entro i quali potrebbe essere nascosto.Il report sulle Parole chiave organiche che si trova in Site Explorer ti mostrerà quasi tutte le parole chiave per le quali il tuo sito si posiziona su Google.Ad esempio, il mio blog personale abbandonato da tempo è ancora al primo posto per moltissime parole chiave:E posso facilmente vedere la mia intera cronologia in termini di ranking per ognuna di queste parole chiave se clicco su “Posizione”:In modo simile, puoi inserire il sito di un tuo concorrente nel Site Explorer e vedere tutte le parole chiave per le quali si posiziona insieme alla cronologia relativa al ranking.E se hai un elenco delle tue parole chiave più importanti che vuoi tenere d’occhio, puoi aggiungerle al Rank Tracker di Ahrefs.10. Trova le lacune nella tua content strategyUna “lacuna” nella strategia di content marketing si verifica quando i tuoi concorrenti si posizionano tutti per parole chiave importanti che portano loro del traffico prezioso mentre il tuo sito non ha pagine che si concentrano su quelle parole chiave.Per aiutarti a risolvere questo problema, è presente un rapporto all’interno del Site Explorer chiamato “Content Gap.” Cerca le parole chiave per le quali tutti i tuoi concorrenti si posizionano, ma per le quali tu non ti posizioni.Ecco i risultati se inseriamo il nostro blog e tre dei blog dei nostri concorrenti:Come puoi vedere, ci sono alcune parole chiave ad alto volume per le quali due o tre dei nostri concorrenti si posizionano bene, mentre il nostro blog non appare da nessuna parte.Prova questo con alcuni dei tuoi concorrenti e vedi se riesci a trovare alcuni argomenti importanti che vorresti e dovresti trattare sul tuo sito.11. Trova centinaia di potenziali link di qualità in pochi secondiMettiamo il caso che tu stia facendo SEO per un’app che si occupa di produttività. Non sarebbe utile avere a disposizione un elenco di siti che hanno menzionato le parole “app produttività” da qualche parte nei loro contenuti?È proprio a questo che serve il Content Explorer di Ahrefs. Ti basta fare una ricerca per “productivity app” (in inglese) e otterrai un elenco di oltre 78.000 pagine che menzionano questa frase da qualche parte nel loro contenuto.Probabilmente non hai bisogno di così tanti contenuti. Nessun problema. Puoi utilizzare i filtri all’interno del Content Explorer per ridurre quell’elenco solo alle pagine migliori:Valutazione del dominio: da 40 a 90Traffico del sito: minimo 1kLingua ingleseEscludi sottodominiEscludi le home pageUna pagina per dominioFiltra i risultati esplicitiQueste impostazioni ti lasceranno con 3.000 pagine invece delle 78.000 iniziali. E puoi sempre restringere ulteriormente la tua ricerca se hai bisogno di ridurre ulteriormente il tuo elenco di potenziali link.ConclusioniQuesti 11 modi per usare semplicemente e fattivamente Ahrefs sono stati selezionati pensando ai neofiti della SEO.La maggior parte dei modi per utilizzare Ahrefs qui presentati sono basilari, ma ciò non significa che siano inefficaci e ti lasceranno a bocca aperta nel momento in cui inizierai ad utilizzarli!.Hai qualche domanda? Contattami su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Come Utilizzare Ahrefs: 11 Modi D’Uso Per Principianti"
    },
    {
      "level": "H2",
      "text": "1. Scopri il traffico organico dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "2. Scopri quali pagine portano traffico organico ai tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "3. Studia cosa cercano le persone su Google"
    },
    {
      "level": "H2",
      "text": "4. Misura l’intero potenziale di traffico organico di un argomento"
    },
    {
      "level": "H2",
      "text": "5. Individua i problemi SEO che danneggiano le prestazioni del tuo sito"
    },
    {
      "level": "H2",
      "text": "6. Stima la difficoltà di posizionamento di qualsiasi parola chiave"
    },
    {
      "level": "H2",
      "text": "7. Scopri quali sono i backlink dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "8. Scopri quali sono i contenuti più apprezzati dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "9. Monitora il tuo ranking per migliaia di parole chiave"
    },
    {
      "level": "H2",
      "text": "10. Trova le lacune nella tua content strategy"
    },
    {
      "level": "H2",
      "text": "11. Trova centinaia di potenziali link di qualità in pochi secondi"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Tim Soulo"
}