{
  "url": "https://ahrefs.com/blog/it/consigli-blog/",
  "slug": "consigli-blog",
  "title": "17 consigli (testati) per blogger agli inizi",
  "description": "Impara dalla nostra esperienza: abbiamo fatto crescere il blog di Ahrefs, superando i 270.000 visitatori in pochi anni. Ecco alcune cose che avremmo voluto sapere quando eravamo agli inizi.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Hai iniziato a scrivere un blog ma nessuno ti legge? Vediamo come risolvere il problema.Nel 2015 ho iniziato a scrivere insieme ai miei amici un blog dedicato alla breakdance (che ora non esiste più).Eravamo completamente digiuni di blogging e di SEO, ma siamo riusciti a raggiungere le 3.000 visite organiche al mese nel momento di massima crescita.Qui abbiamo smesso di lavorare sul blogOggi lavoro in Ahrefs, e il blog aziendalenegli ultimi anni è cresciuto fino a raggiungere le 270.000 visite mensili da organico stimate.In questi anni ho imparato molte cose su come si fa ad ottenere più traffico organico su un blog.E in questo posto condividerò alcuni dei consigli che vorrei mi avessero dato quando ero agli inizi.Partiamo.1. Scegli una nicchiaStatista stima che nel 2020 il numero di blogger negli Stati Uniti raggiungerà i 31,7 milioni. Solo negli Stati Uniti!Questo significa che se se apri un blog oggi avrai un mucchio di concorrenza.Per fortuna c’è un modo per distinguersi dalla massa e per attirare lettori verso il tuo blog.Scegli una nicchia.Sì, ma che cosa vuol dire in concreto?Significa concentrarsi su un argomento iperspecializzato e diventare l’esperto più accreditato di quell’argomento.Ad esempio se inizi un blog che parla di viaggi, potresti concentrarti solo sui viaggi che hanno come meta il Regno Unito. Se inizi un blog che parla di lavoro e azienda, forse il modo migliore per iniziare è quello di concentrarti sui lavori da casa per genitori che non hanno troppo tempo.Poi, quando il blog avrà ingranato, potrai tornare a divagare e a trattare argomenti più ampi.In Ahrefs abbiamo fatto esattamente così. Abbiamo iniziato concentrandoci solo sulla SEO e cercando di coprire questo argomento meglio di chiunque altro. Questo ha contribuito a dare il via al nostro scatto di crescita iniziale.Gli analytics di quando eravamo agli iniziSolo nel 2018 abbiamo iniziato a trattare argomenti più ampi come le idee di marketing e l’advertising tramite podcast.E non solo noi abbiamo fatto così: molti altri blogger famosi hanno iniziato nello stesso modo.Il blog di Mark Manson in origine riguardava la sfera maschile e il dating. Ramit Sethi, fondatore di I Will Teach You To Be Rich, ha iniziato il suo blog scrivendo di argomenti all’incrocio tra la psicologia e la finanza personale.La lezione è chiara: se vuoi iniziare in crescendo, devi scegliere una nicchia.2. Scrivi di argomenti che vengono cercati dalla genteIl 51% di tutto il traffico diretto a siti proviene dalla ricerca organica. E questo significa che, se vuoi che il tuo blog abbia dei buoni risultati, devi scrivere di argomenti che la gente cerca.La domanda è: ma come si trovano questi argomenti?La risposta: usa un tool per la ricerca delle keyword per generare le idee.Ad esempio puoi inserire una keyword in AnswerThePublic, uno strumento gratuito che ti restituirà le richieste correlate che le persone cercano su Google.Risultati per la keyword “mal di schiena”I tool gratuiti per la ricerca delle keyword sono moltissimi: non hai che l’imbarazzo della scelta.Sfortunatamente questi strumenti sono eccezionali per trovare le idee, ma la maggior parte di essi non mostra le metriche relative alle keyword, come il volume di ricerca mensile e questo è un problema, perché è inutile scrivere su un argomento quando quasi nessuno lo cerca.La soluzione? Usa uno strumento professionale per la ricerca delle keyword, come il Keywords Explorer di Ahrefs, in cui puoi visualizzare un’ampia selezione di idee accompagnata dalle metriche importanti relative alle keyword.(“quanta caffeina c’è nel caffè”, “quanta caffeina in una tazza di caffè”, “come fare il caffè freddo”…)3. Affronta gli argomenti migliori dei tuoi concorrentiNon sarebbe fantastico se potessi vedere quali degli articoli dei tuoi concorenti ricevono più traffico e potessi cercare di replicare il loro successo?Puoi farlo.Molti blog mettono in evidenza i loro articoli migliori, in questo modo:Articoli popolari.La guida definitiva ai prodotti per capelli da uomo (tutti i tipi spiegati bene)25 consigli dell’esperto per la cura dei capelli degli uomini: come prenderti cura dei capelliBeardbrand non è in vendita su Amazon.Come far crescere la barba in fretta: l’unica guida di cui hai bisognoChe cos’è l’olio per la barba e come si usa?Da qui è relativamente semplice cercare di capire le keyword che il blog sta cercando di posizionare: basta esaminare gli URL e i titoli.Ad esempio, se faccio clic sull’articolo “La guida definitiva ai prodotti per capelli da uomo”, posso ipotizzare che Beardbrand stia cercando di affrontare il topic “prodotti per capelli da uomo” o “prodotti per capelli”.guida-prodotti-capelliLa guida definitiva ai prodotti per capelli da uomo (tutti i tipi spiegati bene)In questo processo non c’è poi molto di numerico. Non abbiamo idea di come Beardbrand selezioni questi post tra i “popolari” e non possiamo dire se portino traffico oppure no.Un modo migliore per ottenere queste informazioni, è fare copia e incolla del dominio del concorente nel Site Explorer di Ahrefs, poi andare sul report “Top Pages (Pagine migliori)” per vedere quali articoli portano più traffico organico al blog.Traffico mensile stimato per ciascun post.Ad esempio vediamo che l’articolo di Beardbrand sugli stili delle barbe ottiene una stima di 8.717 visite organiche mensili. Tra le 3260 keyword per cui è posizionato, è la keyword “stili di barbe” che indirizza più traffico verso il sito.Questo è un buon modo per trovare buoni argomenti su cui scrivere.4. Sii consapevole dell’intenzione di ricercaGoogle vuole fornire a chi lo utilizza i risultati più rilevanti per le query di ricerca. Questo significa che, se vuoi posizionarti bene su Google, e ottenere traffico organico passivo, devi fornire il risultato più rilevante per la query di ricerca.Tradotto: devi creare un contenuto che risponda al search intent (cioè all’intenzione di ricerca).E come si fa a capire qual è l’intenzione di ricerca?Per fortuna Google lavora per mostrare i risultati di ricerca più rilevanti e tu puoi usare questo fatto a tuo vantaggio. Dai un’occhiata ai primi 10 risultati per l’argomento che hai scelto e guarda quali tipi di pagine sono posizionate.Ad esempio ecco i primi risultati in SERP per “coffee maker” (macchina per il caffè).A un primo esame, la maggior parte delle pagine meglio posizionate sono pagine di categoria che vendono tipi diversi di macchine per il caffè. In questo caso potrai anche scrivere un contenuto bellissimo, ma sarà difficile posizionarsi con un post di blog.Confronta i risultati con quelli per la keyword “caffè con caffettiera francese”.Come vedi, la maggior parte delle pagine posizionate meglio sono articoli che spiegano come si fa il caffè con una caffettiera francese.Per posizionarti per questa keyword, probabilmente dovrai creare qualcosa di simile, cioè una guida che spiega come si fa.Per saperne di più sull’intenzione di ricerca, puoi leggere qui una guida introduttiva.5. Crea un contenuto che valga la pena di essere condivisoQuattro anni fa il nostro Responsabile Marketing Tim ha scritto un articolo epico da 5.000 parole sulla scrittura strategica. Poi ha contattato Rand Fishkin, un influencer nella nicchia SEO/marketing per farglielo vedere, sperando che l’avrebbe ricondiviso con il suo pubblico.Rand gli ha detto di no.Il motivo? Il post era lungo, ma non conteneva nulla di unico. Si trattava di consigli già presenti sul web, semplicemente rimaneggiati.Ciao Tim, l’articolo sembra molto completo e approfondito ma, mentre lo leggevo per sommi capi (lo ammetto: non ho letto tutti i paragrafi), non ho visto poi così tante considerazioni uniche. È una buona rassegna e sono sicuro che sarà utile a diverse persone, ma sono molto selettivo nelle mie condivisioni social.Grazie ancora per il tuo importante contributo a Moz e in bocca al lupo per tutto!Quattro anni dopo, Rand ha tweettato il nostro post sull’advertising tramite podcast anche se non siamo stati noi a presentarglielo direttamente.Superb post on podcast advertising — the ups and downs of *real life* process from @itsrbek: https://t.co/6DHzboqU6X— Rand Fishkin (@randfish) November 21, 2018Un post eccellente sull’advertising via podcast: i pro e i contro di un processo con un *esempio reale” raccontato da @itsrbekPerché quella volta l’ha condiviso? Semplice! Noi avevamo lavorato sull’argomento, conoscevam i pro e i contro delle sponsorizzazioni via podcast ed eravamo in grado di presentare un punto di vista unico che nessun altro aveva.In poche parole, valeva la pena di condividere il nostro articolo.“Bisogna creare contenuti fantastici” non è un suggerimento utilizzabile nella pratica. Ma, come dice Seth Godin, cercare di creare un contenuto che valga la pena di ricordare e notare è un’idea più semplice da mettere in pratica quando si lavora.Con quest’idea in mente, è anche molto più facile dire se davvero hai qualcosa di meraviglioso per le mani.Il tuo articolo è unico?Hai presentato idee, opinioni o punti di vista inediti?Le persone citeranno o linkeranno il tuo articolo?La gente lo condividerà o ne parlerà?Se la risposta è un sì netto a tutto, benissimo! Se no, ritorna alla scrivania e rimetti mano al contenuto. È sempre possibile aggiungere un punto di vista unico, inserendo dei dati, facendo dei sondaggi o semplicemente acquisendo esperienza.6. Cura la leggibilità dei postTim una volta mi ha detto:A nessuno piace leggere. Tutti leggono perché vogliono trovare le informazioni. Se potessero scaricarle nel cervello, lo farebbero.Tim Soulo, CMO AhrefsIn effetti nessuno fa la fila per leggere il tuo articolo. In realtà tutti preferirebbero guardare Netflix piuttosto che leggere il tuo post sul blog.Quindi il lavoro che devi fare in qualità di scrittore è quello di aiutarli a decidere di iniziare a leggere. Come affermava il famoso copywriter Bond Halbert “una buona scrittura consente di leggere senza sforzo”.Per realizzare questo risultato, devi imparare a scrivere testi leggibili. Il libro migliore che ho trovato su quest’argomento è il libro sull’editing di Bond Halbert (in copertina parla di pubblicità, ma i consigli che dà possono essere applicati a qualsiasi forma di scrittura).Ecco alcuni consigli che ho applicato al mio modo di scrivere dopo aver letto questo libro.Usare paragrafi brevi. Bond chiama questa strategia “dare sollievo agli occhi”. I paragrafi lunghi scoraggiano i lettori, mentre i paragrafi brevi li invitano alla lettura. I tool come Hemingway facilitano questo compito.Spezza le frasi lunghe. Di solito le persone leggono mentalmente, quindi le frasi lunghe rendono difficile seguire il testo. Spezza le frasi trovando i punti in cui hai usato “e”, “perché” e “che”.Inserisci contenuti multimediali. I video, le immagini e le GIF ti aiutano a illustrare meglio quel che vuoi dire senza aggiungere parole.Usa la formattazione. Il grassetto il corsivo, le citazioni e gli elenchi spezzano il contenuto e aiutano a mettere in evidenza punti specifici.Leggiti ad alta voce. Ti aiuterà a trovare i punti in cui il contenuto non scorre bene o è noioso.7. Scrivi dei titoli straordinariIn media la gente legge cinque volte in più il titolo che il corpo del testo.David Ogilvy, Author Confessions of an Advertising ManMolte persone scoprono i contenuti tramite la ricerca o i social e probabilmente decidono quale contenuto leggere basandosi sul titolo.Il titolo quindi diventa la parte del contenuto più importante. Dovresti imparare come scrivere titoli irresistibili che catturano l’attenzione e attirano l’interesse e la voglia di saperne di più.Tuttavia questo non significa che sei tenuto a scrivere con uno stile acchiappaclic. Vuol semplicemente dire che dovresti capire come funzionano i titoli e come scriverene di buoni.Ecco qualche consiglio:Esamina alcuni dei blog più popolari sul web e osserva come creano i loro titoli. Tim Ferriss probabilmente non si identifica come marketer ma sicuramente sa come scrivere titoli che attraggono i lettori (ad esempio “Da geek a freak: come sono riuscito a mettere su 15 kg di muscoli in 4 settimane” è un gran bel titolo).Usa formule che funzionano. La maggior parte dei titoli sono variazioni di formule con efficacia dimostrata. Scopri quali sono e usale bene.Usa l’analizzatore di titoli di CoSchedule. Non sei sicuro di aver scritto un titolo che funzioni? Fai un controllo con questo tool gratuito.8. Scrivi una buona introduzioneGuarda come scrivevo le introduzioni una volta:Alla cieca.Queste sono le parole esatte che userei se qualcuno mi chiedesse come si allenano i b‑boys e le b‑girlsEd è la verità.La maggior parte dei b‑boy che conosco si allena alla cieca.Si approccia all’allenamento senza un progetto. Senza obiettivi da raggiungere. Senza metriche che assicurano che l’allenamento avrà successo. […] Erano parole messe lì a caso. I miei lettori probabilmente premevano il tasto “indietro” prima di riuscire a pronunciare le parole “hip hop”!II lavoro del titolo è quello di portare il lettore a leggere la prima frase. Poi sta all’introduzione catturare la sua attenzione e portarlo a leggere tutto il post.Se l’introduzione è lunga, noiosa o suona troppo accademica è il momento di cambiare approccio.In Ahrefs seguiamo (a grandi linee) quella che definiamo la formula “APP”.Primo passaggio: ci Allineiamo. Nel giro di una o due frasi, devi far capire ai lettori che capisci il problema che stanno affrontando.Ecco un esempio tratto da uno dei nostri post:Stai cercando di far crescere il tuo canale YouTube e di attrarre più visualizzazioni?In questo modo i lettori sentiranno che provi empatia per loro e ti immedesimi nelle sfide che affrontano.Poi Presenta il tuo articolo come soluzione.Di’ ai lettori che hai trovato la soluzione al loro problema. In alternativa puoi anche spiegare la soluzione più in breve possibile senza anticipare tutto. Dai in pasto qualcosa ai lettori per indurli all’approfondimento.Quest’immagine è tratta dallo stesso esempio precedente:Il “trucco” è affrontare argomenti che vengono cercati.Infine abbiamo la Prova di fiducia.Il momento della proof è quando spieghi ai lettori il motivo per cui dovrebbero aver fiducia in te. Dopotutto magari è la prima volta che si imbattono nel tuo blog. Devi dimostrare il tuo successo, l’esperienza o la competenza.Ad esempio:Questo è l’approccio che ci ha aiutati a far crescere il nostro canale YouTube da circa 10.000 a più di 200.000 visualizzazioni mensili in circa un anno. Nello stesso periodo abbiamo anche avuto più di 50.000 nuovi iscritti.9. Fai della semplice SEO onpageLa SEO onpage è la pratica di ottimizzare i contenuti in modo che si posizionino più in alto nei risultati di ricerca.Tipicamente la SEO onpage comprende best practices semplici, come queste:Inserire la keyword la posizionare nel titolo, nella meta description nei tag H1. Questo serve a indicare a chi fa la ricerca che la tua pagina è il risultato più rilevante per la sua query.Usare URL brevi e descrittivi. Un URL descrittivo ti fa capire che cosa ti devi aspettare da una pagina (ad esempiohttps://ahrefs.com/blog/seo-tips/ è ovviamente un post di consigli SEO.) Chi compie la ricerca quasi certamente farà clic su un risultato che mostra che cosa dovrebbe aspettarsi dalla pagina.Nota a margine. Se usi WordPress, installare un plugin come Yoast SEO ti faciliterà di molto il compito quando dovrai mettere in pratica i consigli precedenti. La SEO onpage vuol dire molto di più che inserire keyword a corrispondenza secca nel testo. È importante anche la presenza di parole e di frasi correlate.Google lo conferma quando afferma:.Pensaci: quando cerchi la parola “cani” probabilmente non vuoi trovare una pagina che ripeta la parola “cani” centinaia di volte. Tenendo a mente questo fatto, gli algoritmi controllano se una pagina contiene altro contenuto rilevante oltre la parola “cani”, ad esempio foto o video di cani o addirittura un elenco di razze.La domanda è: come si ottimizzano le correlate?Se stai scrivendo di qualcosa su cui sai già molto, probabilmente non dovrai ottimizzare. Intendo dire che è molto probabile che inserirai parole e frasi rilevanti per il contesto senza nemmeno rendertene conto.Tuttavia se non sei un esperto dell’argomento che tratti, ecco un trucco carino:Fai copia e incolla dell’indirizzo delle pagine meglio posizionate per la tua keyword nello strumento Content Gap di Ahrefs, controllando di aver selezionato la modalità “URL” dal menu a discesa.Ecco alcune delle pagine posizionate meglio per la keyword “migliori proteine in polvere”:Facendo clic su Cerca vedrai le keyword per cui una o più di queste pagine sono posizionate nei primi 100 risultati:Scorrendo la lista, possiamo iniziare a raccogliere parole, frasi e sottoargomenti che forse potremmo voler citare in un post dedicato alle migliori proteine in polvere. Ad esempio: siero di latte in polvere, proteine isolate, integratori, bulk powders e brand specifici come optimum nutrition.Ricordati che questa ricerca non c’entra nulla con il fatto di riempire il contenuto di keyword: serve a trovare le cose che la gente si aspetta di trovare in una pagina che parla di [inserire l’argomento per cui vuoi posizionarti].Vuoi saperne di più sulla SEO onpage? Leggi questa guida passo a passo.10. Ottieni dei feedback sul tuo modo di scriverePer scrivere il mio primo post sul blog di Ahrefs ci ho messo un mese.Non ero io che procrastinavo. Erano le mie bozze che venivano sempre fatte a pezzi dai nostri editor Tim e Josh.Tutti i post sul nostro blog sono soggetti a questo tipo di esame. Leggiamo a turno i contenuti dei colleghi e ciascuno dà il proprio feedback. Identifichiamo le parti che potrebbero essere aggiunte/tolte, i punti che potrebbero essere chiariti, le frasi che potrebbero essere scritte meglio, ecc.Non ho dubbi che è proprio per questo motivo che la gente continua a consigliare il nostro blog.Secondo me Ahrefs attualmente ha il miglior contenuto ed è il miglior strumento per la SEO.Ci preoccupiamo sempre di far sapere ai lettori che quello che stanno leggendo non è il lavoro di una persona sola, ma di molte persone che collaborano insieme alla creazione di un contenuto di valore.Articolo di: Si Quan Ong. Hanno collaborato:Non ignorare questo consiglio solo perché lavori al tuo blog da solo. Ryan Holiday la dice in poche parole:Nessuno crea una prima bozza perfetta. E nessuno crea seconde bozze migliorate senza l’intervento di qualcun altro.Ryan Holiday, Bestselling authorSe vuoi creare un lavoro eccezionale, hai bisogno dell’input di qualcun altro. Magari di tua moglie, di tuo marito, oppure di un collega. Puoi chiedere sui social se qualcuno ha voglia e tempo di aiutarti, oppure puoi partecipare a una community dedicata alla correzione e al miglioramento delle bozze.L’input degli altri renderà il tuo lavoro molto molto migliore.11. Contatta le persone che ammiriHai mai notato che i blogger famosi si conoscono sempre tutti?Non è un caso.Fare blogging è un lavoro difficile ed è faticoso da fare da soli. Ma, con l’aiuto degli altri, diventa gestibile.È per questo motivo che i blogger più smart si contattano a vicenda e creano relazioni tra di loro. Si danno consigli, offrono aiuto e si pubblicizzano l’uno con l’altro.Così continuano a crescere giorno dopo giorno, anno dopo anno.Tu dovresti fare come loro.Più gente conosci, migliore diventa il tuo lavoro, perché più persone esperte possono offrire input al tuo contenuto. Possono contribuire con suggerimenti e punti di vista, promuoverti o offrirti dei link e condividere il tuo contenuto con i loro follower.Non farti scoraggiare dalla loro fama o dal numero enorme di follower che hanno. Tutti i blogger famosi che conosci all’inizio non erano nessuno. Ma ciò che ha fatto fare loro il salto di qualità è stata la volontà di superare le paure e di mettere da parte il loro ego e cercare di entrare in contatto con quelli più bravi di loro.Questi blogger ti capiscono. Saranno più che felici di aiutarti, ma solo se userai le strategie giuste.Quali sono queste strategie?Leggi il nostro post su come fare rete se sei un blogger per imparare come si fa.12. Crea una lista di e‑mailHai una pagina Facebook? Buona fortuna, perché Facebook può chiuderla da un giorno all’altro.Hai un canale YouTube? Possono cancellarti quando vogliono.Se ti stai creando un pubblico di follower su una piattaforma di terze parti, non lamentarti se poi vieni cancellato o la portata della tua visibilità viene limitata.Il miglior modo per superare questo limite è costruire una lista di e‑mail.Sei tuoi fan si sono iscritti al tuo servizio, puoi comunicare con loro quando ti pare.Come si costruisce una lista di e‑mail?Ci vogliono due ingredienti: il traffico e qualcosa di valore da dare.Se stai seguendo i consigli in questo post, probabilmente inizierai a ottenere traffico verso il tuo blog. Quindi il passaggio successivo è convincere i visitatori a iscriversi alla tua lista.Per farlo devi offrire qualcosa in cambio dell’iscrizione. Noi di Ahrefs la facciamo semplice, rendendo visibile un box alla fine dell’articolo.Ti è piaciuto? Non perderti il nostro prossimo articolo!Scrivi la tua e‑mailIscrivitiSicuramente il nostro articolo è piaciuto (il lettore è arrivato fino alla fine), quindi ci offriamo di spedirgli direttamente nella casella di posta degli altri contenuti sul genere di quello che gli è piaciuto.Ma il mondo è pieno di opportunità. Puoi offrire un ebook gratuito, la versione PDF del post, un corso via e‑mail, tutto ciò che ti pare.Ti serve solo un po’ di creatività.13. Promuovi il tuo contenuto nelle community onlineLe community online rilevanti sono quelle in cui si riunisce il tuo pubblico target. Possono essere sui gruppi Facebook, su Slack, su Reddit, nei forum, eccQuesta era la strategia principale che ho usato per far ingranare il mio blog sulla breakdance:Ciao, ho scritto questa guida approfondita per i b‑boy agli inizi perché su Internet non c’era. La guida riguarda le aspettative che nutri sulla breakdance, il mindset, l’allenamento e diverse altre domande importanti a cui di solito i b‑boy non rispondonoSpero che ti sarà utile!A giudicare dai commenti, è stata accolta molto bene.Sembra facile, vero?In realtà non è stata una passeggiata, infatti quel che non si vede dallo screenshot è il duro lavoro che ho fatto prima di inviare un post. Per poter inviare un post del genere, ho dovuto diventare un membro attivo, partecipare alle discussioni e offrire aiuto.Solo in quel momento il mio contenuto è stato accettato e incoraggiato.Se tutto ciò che ti va di fare è unirti ad alcuni gruppi, postare qualche link e sparire, non stupirti se vieni kickato o bannato.Ma se vuoi farlo come si deve, questo commento del mio amico Nathan Collier che gestisce il gruppo Facebook Content Marketing Lounge ti guiderà:]Gestisco il gruppo Facebook The Content Marketing Lounge (quello con lo screenshot qui sopra, con la condivisione di Si Quan). È una piccola parte di quest’articolo, ma mi sento di aggiungere il mio punto di vista come admin del gruppo e di condividere qualche consiglio su come ottenere il “permesso” di postare nei gruppi come il mio.#1: costruisci una relazione con l’adminParliamo di Si Quan: sono felice di poterlo definire un collega e un amico. L’ho conosciuto perché era attivo nel mio gruppo, rispondeva alle domande, cercava di aiutare gli altri e in generale era il tipo di membro che tutti gli admin di gruppi vorrebbero avere.Ecco perché gli ho “dato il permesso” di promuovere il contenuto di Ahrefs sul gruppo. Si è guadagnato la mia fiducia e so che posta unicamente contenuto utile ai membri del mio gruppo.Inoltre non cerca di approfittare della relazione che abbiamo. Non è sul mio gruppo per postare OGNI SANTO post del blog di Ahrefs. 🙂Il consiglio migliore che posso darvi sui gruppi è quello di costruire una relazione con l’admin. Se sei attivo, l’admin lo noterà. Ma non farti problemi a mandargli un messaggio privato e a chiedergli come potresti essergli utile in altro modo. Io sono contento di ricevere messaggi di questo genere e di costruire nuovi contatti con marketer intelligenti.#2: mi piacerebbe lasciare le persone libere di postareNon do praticamente a nessuno il permesso di postare link come questo. È addirittura una regola scritta nella descrizione del gruppo. Il gruppo ha soltanto 4.000 membri, ma ho bannato (no, non sto scherzando) molte centinaia di persone perché hanno postato link senza chiedermi il permesso. Ho bannato senza avvisare prima: ho cliccato su “ban” e stop. Non ho tempo per fare da babysitter alle persone che cercano di spammare sul gruppo.Ma c’è un segreto: mi piacerebbe lasciare le persone libere di postare. Sono sempre alla ricerca di informazioni di valore che aiutino i membri del gruppo nel lavoro o nella professione.Ho dovuto scrivere la regola “niente pubblicità”, perché la maggior parte dei contenuti sono la solita minestra riscaldata.Faccio delle eccezioni per i contenuti eccezionali. Se vuoi capire che cosa intendo per “eccezionale”, quest’articolo è un buon esempio di ciò che cerco. È il tipo di contenuto che stimola la discussione: la cosa più importante per il creatore di un gruppo.#3 Gli admin tengono a mente l’engagementTengo sempre a mente l’algoritmo di Facebook. Solo perché ho un gruppo con 4.000 membri, non vuol dire che 4.000 persone vedono ciò che posto.Ho notato che più è attivo il gruppo nel suo complesso, migliori sono i numeri relativi alla distribuzione nelle mie statistiche. In altre parole, un gruppo attivo (in generale) significa che Facebook distribuirà il contenuto prodotto da me a un pubblico più ampio quando lo posto.14.Scrivi guest post per altri blogRamit Sethi afferma che il guest post che ha scritto sul blog di Tim Ferriss è quello che l’ha aiutato a trasformare il suo libro in un bestseller.Se vuoi svoltare e farti conoscere, non limitarti a scrivere solo per il tuo blog. Sfrutta l’autorità e il pubblico degli altri blog per ottenere traffico e link e per costruire il tuo brand.Probabilmente però ti chiederai: per quale motivo dovrebbero lasciarmelo fare?Semplice. La maggior parte dei blog popolari si basano su contenuto di valore. Ma creare contenuto di valore con costanza è difficile. Quindi se ti offri di scrivere un articolo eccezionale per loro gratuitamente perché dovrebbero dirti di no?Ora, la maggior parte dei blogger trovano opportunità di guest blogging proprio in questo modo. Usa gli operatori di ricerca avanzata, come questi di Google:[il_tuo_argomento] “scrivi per noi”[il_tuo_argomento] “guest post”[il_tuo_argomento] “guest article”[il_tuo_argomento] “diventa un autore”[il_tuo_argomento] inurl:contribuisciIn questo modo intercetterai i blog che stanno cercando attivamente dei collaboratori.fitness “scrivi per noi”Tuttavia non dovresti cercare solo i siti con le pagine “scrivi per noi”.Se un blog in precedenza ha affrontato topic rilevanti, probabilmente è aperto alla collaborazione con guest post su argomenti simili, anche se non ha una pagina “scrivi per noi”.Per trovare questi siti, inserisci una parola o una frase rilevante nello strumento Content Explorer di Ahrefs, poi deseleziona la modalità “one article per domain”, per evitare di contattare lo stesso sito due volte.essere genitori — Nel titolo100 Meme sull’essere genitori che ti faranno ridere per ore15 fumetti comici sull’essere genitori più veri del vero12 frasi potenti sull’essere genitori che ti aiuteranno a parlare meglio con i tuoi figliSei preoccupato che i siti più autorevoli non ti diano il permesso di contribuire? Usa il filtro Domain rating per restringere l’elenco a quelli per cui ti sentiresti a tuo agio a scrivere.Per iniziare concentrati sui blog con DR compreso tra 21 e 70. Quando sarai diventato più esperto e avrai già diversi guest post tra le cartucce da sparare, lanciati verso i blog più grandi.15. Aggiorna i contenuti vecchiMan mano che vai avanti nel viaggio del blogging, i tuoi pensieri, le opinioni e quello che sai cambieranno. Scoprirai sempre più cose sul tuo settore, imparerai cose nuove e migliorerai lo stile di scrittura.Non faresti un bel servizio al tuo pubblico se non aggiornassi il contenuto più vecchio in modo che rifletta le nuove conoscenze e idee che hai accumulatoInoltre aggiornare il contenuto è vantaggioso lato SEOPensaci: persino se sei primo in SERP, i tuoi concorrenti potrebbero cercare di rubarti il posto. Oppure Google potrebbe “spingere verso il basso” i tuoi risultati perché ritiene che il tuo contenuto non sia aggiornato.Quindi dovresti cercare di mantenere il contenuto fresco e aggiornato.È quello che cerchiamo di fare sempre in Ahrefs.I absolutely love how @ahrefs new Content Explorer tool exposes how much our team works on updating/republishing our old content VS publishing new stuff 😇 💪Do you know any other blogs that are so committed to keeping their content fresh & awesome? 🙂 pic.twitter.com/SIGbEQpWW9— Tim Soulo (@timsoulo) March 27, 2019È davvero una figata come il nuovo tool Content Explorer riesca a mettere in evidenza quanto il nostro team lavori sull’aggiornamento/ripubblicazione del nostro contenuto vecchio VS la pubblicazione di contenuti nuovi. Conosci altri blog che siano così impegnati a mantenere il contenuto fresco e degno di nota?Ad esempio recentemente abbiamo aggiornato il post su come si fa a portare traffico al sito, e abbiamo registrato un’impennata del traffico organico.Aggiornamento del postSe hai installato Google Analytics puoi vedere facilmente le pagine verso cui il traffico che sta diminuendo. Se non ce l’hai, copia e incolla l’URL di alcune delle pagine vecchie nel Site Explorer di Ahrefs e dai un’occhiata al grafico del traffico organico nel report “Overview”.Il traffico sta diminuendoSpesso la diminuzione si verifica perché parti del contenuto perdono freschezza (ad esempio gli screenshot, i processi, le statistiche, i link, l’anno del titolo, ecc).La soluzione è aggiornare le sezioni vecchie. Tuttavia in alcuni casi scoprirai che è necessario riscrivere l’articolo da zero (e anche questa è una cosa che facciamo spesso).Scopri di più su come si fa a mantenere il contenuto up to date nella nostra guida al contenuto evergreen.16. Tieni un blocco appuntiSecondo Ryan Holiday, il blocco appunti è: “… una risorsa centralizzata o deposito di idee, citazioni, aneddoti, osservazioni e informazioni in cui ti imbatti nella vita e nel tuo percorso di formazione. Lo scopo di questo blocco appunti e tenere traccia e organizzare queste perle per usarle in un secondo momento nella vita, nel lavoro, nella scrittura, quando parli a un pubblico o come e dove vuoi.”Perché dovresti avere e usare un blocco appunti?Per due motivi:Hai notato che cito un mucchio di persone in questo post? Il blocco appunti rende le citazioni molto più semplici e veloci.Ci saranno sicuramente giorni in cui sarai bloccato. Giorni in cui rimani lì a fissare il documento vuoto per ore e non hai uno straccio di idea: dai un’occhiata veloce al blocco appunti, che ti aiuterà a farti venire l’ispirazione e a stimolare le idee per scrivere.Come si crea un blocco appunti?Io faccio così: il mio blocco appunti si trova su Notion, un’app di project management.Format per il blocco appunti ispirato dal mio amico Sam Thomas Davies.Quando leggo un libro, sottolineo un sacco di cose. Quando ho finito di leggere, trasferisco le parti sottolineate in una pagina nuova nella categoria corrispondente.Se ho bisogno di qualcosa, posso navigare facilmente la categoria che mi serve per trovarlo.17. Scrivi tutti i giorniCome ha fatto James Clear a diventare uno dei blogger più famosi del mondo e poi un autore di bestseller?Con la pratica.Per quattro anni ha preso l’impegno di pubblicare un articolo al giorno, dal lunedì al giovedì, tutte le settimane. Questo processo gli ha consentito di affinare le capacità di scrittura, ha fatto diventare popolare il suo blog e alla fine gli ha fruttato una proposta per scrivere un libro, che è diventato Atomic Habits.Dopotutto non è un segreto: i blog si fanno scrivendo.Ma per scrivere bene devi fare tanta pratica.Non devi creare un capolavoro al giorno. Concentrati sul creare l’abitudine di mettere qualcosa su carta ogni giorno. Non deve esser necessariamente un blog: può essere un aggiornamento di stato di Facebook, un tweet, un commento a un blog, un’e‑mail o qualcos’altro.Quando tenevo il blog sulla breakdance, facevo il possibile per scrivere un’e‑mail al giorno (dal lunedì al venerdì) alla mia lista.È stato uno degli esercizi migliori che io abbia mai fatto per la mia scrittura.Più fai pratica, migliore diventerà il tuo contenuto.Considerazioni finaliCreare e seguire un blog è un lavorone! Devi pubblicare con costanza, promuovere gli articoli, fare rete e fare un sacco di altre cose.La buona notizia è che non sei l’unico e non sei da solo.Molti blogger (come noi) hanno dovuto affrontare gli stessi alti e bassi. E, con l’esperienza fatta sulla loro pelle, hanno tracciato una strada che anche tu puoi seguire.Tutto ciò che devi fare è mettere in pratica questi consigli e metterti al lavoro.Domande? Puoi farmele nei commenti oppure su Twitter.Tradotto da Elisa Bruno. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "17 consigli (testati) per blogger agli inizi"
    },
    {
      "level": "H2",
      "text": "1. Scegli una nicchia"
    },
    {
      "level": "H2",
      "text": "2. Scrivi di argomenti che vengono cercati dalla gente"
    },
    {
      "level": "H2",
      "text": "3. Affronta gli argomenti migliori dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "4. Sii consapevole dell’intenzione di ricerca"
    },
    {
      "level": "H2",
      "text": "5. Crea un contenuto che valga la pena di essere condiviso"
    },
    {
      "level": "H2",
      "text": "6. Cura la leggibilità dei post"
    },
    {
      "level": "H2",
      "text": "7. Scrivi dei titoli straordinari"
    },
    {
      "level": "H2",
      "text": "8. Scrivi una buona introduzione"
    },
    {
      "level": "H2",
      "text": "9. Fai della semplice SEO onpage"
    },
    {
      "level": "H2",
      "text": "10. Ottieni dei feedback sul tuo modo di scrivere"
    },
    {
      "level": "H2",
      "text": "11. Contatta le persone che ammiri"
    },
    {
      "level": "H2",
      "text": "12. Crea una lista di e‑mail"
    },
    {
      "level": "H2",
      "text": "13. Promuovi il tuo contenuto nelle community online"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "14.Scrivi guest post per altri blog"
    },
    {
      "level": "H2",
      "text": "15. Aggiorna i contenuti vecchi"
    },
    {
      "level": "H2",
      "text": "16. Tieni un blocco appunti"
    },
    {
      "level": "H2",
      "text": "17. Scrivi tutti i giorni"
    },
    {
      "level": "H2",
      "text": "Considerazioni finali"
    }
  ],
  "author": "Si Quan Ong"
}