{
  "url": "https://ahrefs.com/blog/it/consigli-content-marketing/",
  "slug": "consigli-content-marketing",
  "title": "17 Consigli Pratici per Fare Content Marketing nel 2022",
  "description": "Ecco per te 17 suggerimenti per migliorare la tua strategia di content marketing e ottenere più visitatori, lead e vendite.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Non riesci a far funzionare la tua strategia di content marketing?Non preoccuparti. Ecco per te 17 suggerimenti che miglioreranno i tuoi risultati con il content marketing e ti permetteranno di ottenere più traffico, più lead e più vendite: Definisci per chi vuoi creare contenutiScegli argomenti con potenziale di traffico di ricercaTratta gli argomenti affrontati dalla concorrenzaDai priorità agli argomenti in base al loro “potenziale commerciale”Lavora sull’intento di ricercaCrea un calendario editoriale Promuovi i tuoi contenutiCrea immagini condivisibiliRiproponi i tuoi contenutiAggiungi link triggerAggiorna i tuoi contenutiContatta bloggerFai valere le tue opinioniProponi idee e punti di vista diversiNon ossessionarti sul conteggio delle paroleCrea diversi tipi di contenutiCrea un hub di contenuti1.Definisci per chi vuoi creare contenutiUn’agenzia che si occupa di ottimizzazione del tasso di conversione (CRO), scrive di CRO e attira altri professionisti CRO. Ma i professionisti CRO non hanno bisogno di servizi CRO. Quindi il blog dell’agenzia non attira contatti utili e l’agenzia sostiene che il content marketing non funziona.Ma se l’agenzia CRO avesse fatto qualche passo indietro per capire tutto sul suo pubblico ideale, avrebbe avuto chiaro che tipo di contenuto creare. Non “tattiche CRO avanzate”, ma “come ottimizzare la tua home page per ottenere più lead”.Ecco perché il primo passo quando si crea una content strategy è avere chiaro in mente per chi si stanno creando contenuti.Se sai già a chi ti rivolgi, assicurati di metterlo per iscritto e condividerlo con tutto il tuo team. Altrimenti, usa il modello qui sotto per mettere a fuoco questo punto.Letture consigliate: Come Creare Buyer Persona Dettagliate per la tua Attività [Template Gratuito]2. Scegli argomenti con potenziale di traffico di ricercaIl traffico dalla posta elettronica o dai social media è un grande impulso, ma è di breve durata.Traffico che ottieni velocemente Zero trafficoSe invece crei contenuti su argomenti che le persone cercano su Google hai la certezza che l’interesse nei confronti di questi argomenti è costante. Finché il tuo articolo si posiziona su Google, riceverai traffico organico passivo e rilevante.Traffico che ottieni velocemente Traffico passivoEcco come trovare questo tipo di argomenti:Vai sul Keywords Explorer di AhrefsInserisci delle parole chiave pertinentiClicca sul report dei Termini corrispondenti Passa alla casella DomandeQui troverai oltre 300.000 potenziali argomenti di cui scrivere. Sfoglia la lista e scegli quelli rilevanti per il tuo sito.Letture consigliate: Ricerca Parole Chiave: la Guida di Ahrefs per Principianti3. Tratta gli argomenti affrontati dalla concorrenzaNon sarebbe fantastico se sapessi quale degli articoli dei tuoi concorrenti riceve più traffico in modo da poter replicare il loro successo?Ho un’ottima notizia: puoi saperlo!Ecco come:Vai sul Site Explorer di AhrefsInserisci l’indirizzo di un tuo concorrenteVai su Pagine Migliori Vedrai tutte le pagine classificate in base al traffico organico, oltre alla parola chiave responsabile della maggior parte del traffico per ciascuna pagina.Ad esempio, possiamo vedere che l’articolo di Beardbrand sugli stili di barba riceve circa 105.000 visite organiche al mese. La parola chiave che invia più traffico è “stili di barba” (beard styles in inglese).Se lavorassimo ad un negozio di e‑commerce concorrente, potremmo affrontare anche noi questo argomento.4. Dai priorità agli argomenti in base al loro “potenziale commerciale”Il traffico di ricerca da solo è una vanity metric. Se non migliora la tua attività (ad esempio generando più lead o più guadagni), incrementare il traffico di ricerca è inutile.In Ahrefs, valutiamo gli argomenti utilizzando il “potenziale commerciale”.Associare il “potenziale commerciale” con il “potenziale di traffico di ricerca” ci mantiene concentrati sulla creazione di contenuti che portano effettivamente a una crescita.Questo è il motivo per cui il nostro blog ruota attorno alla SEO e al marketing dei contenuti, e non ad argomenti come la “ricerca di immagini inversa”.Anche se reverse image search in inglese è una query di ricerca popolare (~1,5 milioni di ricerche mensili) e ha il potenziale per generare tonnellate di traffico, non ha nulla a che fare con il nostro prodotto (potenziale commerciale “0”).5. Lavora sull’intento di ricercaL’obiettivo di Google è fornire ai propri utenti i risultati di ricerca quanto più pertinenti per qualsiasi query di ricerca. Quindi, per posizionarti in alto su Google, devi dimostrare di essere il risultato di ricerca più pertinente.Ciò significa fare in modo che il tuo contenuto corrisponda all’intento di ricerca, ovvero al motivo per cui qualcosa viene cercato.Possiamo vedere i risultati organici (SERPs) su Google per capire l’intento di ricerca. Fallo cercando su Google la tua parola chiave, quindi analizza le pagine in cima alla classifica per verificare i tre elementi di seguito.A. Tipo di contenutoI tipi di contenuto di solito rientrano in una di queste cinque categorie: post del blog, prodotto, categoria, landing page o video. Ad esempio, se cerchiamo “come imparare l’hangul” in inglese, possiamo vedere che i primi risultati sono principalmente video.Se vuoi classificarti per questa parola chiave, probabilmente dovrai creare un video.B. Formato del contenutoIl formato del contenuto si applica principalmente ai post del blog, poiché di solito sono istruzioni, elenchi, notizie, opinioni o recensioni.Ad esempio, i risultati migliori per la parola “migliori allenamenti a casa” in inglese sono per lo più elenchi puntati:Al contrario, i risultati migliori per “come imparare la grammatica coreana” in inglese sono principalmente istruzioni e guide:Per avere maggiori possibilità di posizionarti devi seguire quanto fatto dagli altri.C. Punto di vista del contenutoIl punto di vista del contenuto si riferisce all’elemento caratterizzante del contenuto stesso. Ad esempio, le persone che cercano “come fare la sangria” in inglese stanno cercando una ricetta facile.Letture consigliate: Che Cosa si Intende per Intento di Ricerca? La Guida Completa per Principianti6. Crea un calendario editorialeTeniamo traccia di tutto ciò che pubblichiamo utilizzando un calendario dei contenuti:Ciascuna voce del calendario elenca anche informazioni su un singolo contenuto, ad esempio:ArgomentoAutoreCollaboratoriStatoScadenzaImmaginiURLCategoriaE via dicendo.In questo modo tutti sono allineati sull’intero processo di gestione dei contenuti. Sia chi scrive che gli altri collaboratori sanno a che punto sono, quando è la scadenza e cosa dovrà essere fatto in seguito.Questo è il motivo per cui negli ultimi anni siamo stati in grado di pubblicare due o più post sul blog ogni settimana.Anche se sei un content marketer che lavora in autonomia, un calendario dei contenuti ti permette di lavorare coerentemente sul processo di pubblicazione. Non più scrivere solo quando l’ispirazione colpisce ma impegnati pianificando e pubblicando.Letture consigliate: Come Creare un Calendario Editoriale7. Promuovi i tuoi contenutiSe non fai vedere i tuoi contenuti a persone a cui possono interessare, i tuoi contenuti appena pubblicati saranno praticamente invisibili.In Ahrefs, promuoviamo ogni contenuto che pubblichiamo. Il minimo che facciamo è:Inviare nuovi post del blog ai nostri iscritti alla newsletter;Condividere il post su tutti i nostri account social (Facebook, Twitter, LinkedIn);Metterci in contatto con le persone che menzioniamo nei nostri contenuti;Pubblicare annunci pubblicitari (Facebook, Twitter, Quora, etc.).Dovrai fare almeno questo per far leggere i tuoi contenuti, ma se il tuo sito è nuovo devi fare ancora di più. Ti consigliamo di seguire questo elenco per la promozione dei contenuti:https://www.youtube.com/watch?v=PoVYweKH4ck8. Crea immagini condivisibiliSiamo grandi sostenitori della creazione di immagini personalizzate per i nostri contenuti. Queste immagini aiutano a semplificare concetti complessi e migliorano la leggibilità dei nostri articoli.Una delle nostra grafiche personalizzate.Inoltre sono contenuti straordinari da condividere sui social media. Anche in una nicchia “noiosa” come la SEO, immagini come questa possono diventare virali.Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021Le nostre immagini sono create dai nostri illustratori interni. Ma per realizzare delle immagini personalizzate, non c’è bisogno di spendere una fortuna. Non devono essere opere d’arte per essere condivisibili. Per esempio il popolare blog WaitButWhy utilizza solo figure stilizzate e cartoni animati disegnati a mano. Strumenti come Canva semplificano la creazione di queste grafiche.Prima di pubblicare, dai un’occhiata ai tuoi contenuti. Scegli le sezioni all’interno delle quali un’immagine personalizzata può aggiungere “valore” per esempio per illustrare meglio un concetto, portare avanti la narrazione, mantenere il contenuto divertente, etc.9. Riproponi i tuoi contenutiTrasforma i contenuti esistenti in nuovi formati e condividili su piattaforme diverse.Per esempio noi abbiamo trasformato la nostra guida all’influencer marketing in un video e il nostro video per aumentare gli iscritti su YouTube in un post.Abbiamo anche:Trasformato un post in un thread per Twitter;Trasformato video di YouTube in tweet;.Trasformato posts in contenuti per Instagram.Come dice il content marketer Ross Simmonds,“Crea una volta, distribuisci per sempre”.10. Aggiungi link triggerI link sono uno dei tre fattori maggiori per il posizionamento secondo Google. Se vuoi che i tuoi contenuti si posizionino in alto, hai bisogno di link.Un modo, fatta eccezione per la pratica del link building, è l’inserimento di “link trigger” (il motivo per cui le persone vogliono linkare un determinato contenuto) nel tuo contenuto in fase di scrittura. Questo non solo renderà più facile raggiungere e creare link, ma aiuterà anche ad attirarli naturalmente.Ecco come si fa:Vai sul Keywords Explorer di AhrefsCerca la tua parola chiave e scorri fino alla panoramica della SERPTrova un articolo simile con molti domini di riferimentoClicca sul numero corrispondente alla colonna BacklinkControlla la colonna Anchor and target URL per trovare elementi ricorrentiAd esempio, se lo facciamo per il post di Backlinko (alias Brian Dean) sul copywriting SEO, vediamo che parecchie persone hanno linkato l’articolo per via di alcuni suggerimenti unici di cui Brian ha scritto: metodo APP, bucket brigade, ecc.Se scriviamo sullo stesso argomento, dobbiamo includere anche dei suggerimenti esclusivi per il copywriting SEO.11. Aggiorna i tuoi contenutiIl contenuto può “andare a male”. Le informazioni possono diventare obsolete, l’intento di ricerca della parola chiave può cambiare e il tuo posizionamento peggiorare.Quando ciò accade, devi aggiornare i tuoi contenuti.Devi aggiornare tutto? No, soprattutto se hai centinaia di post sul blog come succede nel nostro caso. Al contrario devi dare la priorità a degli articoli rispetto ad altri. Fallo seguendo questo diagramma di flusso:In alternativa, puoi anche utilizzare il nostro plugin SEO gratuito per WordPress per controllare il tuo sito e trovare i post con basse prestazioni. Quindi segui la guida qui sotto per scoprire il modo migliore per ripubblicare i tuoi contenuti.Letture consigliate: Ripubblicare Contenuti: Come Aggiornare Vecchi Articoli per la SEO12. Contatta bloggerIl cosiddetto blogger outreach è il processo per mettere il tuo prodotto o contenuto di fronte a blogger e giornalisti rilevanti per la tua nicchia inviando loro e‑mail personalizzate.L’obiettivo: convincere le persone con accesso a un vasto pubblico a parlare di te e a linkare il tuo sito.Contattare i blogger non è spam ma non è bello ricavare le e‑mail di tutte le persone del tuo settore e contattarle chiedendo l’inserimento di un link al tuo sito.Pensa ad una tattica che lavora sul lungo termine. Chiaramente vuoi qualcosa da queste persone altrimenti non le contatteresti. Ma vuoi anche fare rete, fare in modo che il tuo brand o prodotto sia sempre presente nella loro mente e fare amicizia con loro. Invece che farsi terra bruciata per un solo tweet, sarebbe meglio puntare a costruire un rapporto che un domani potrebbe tradursi in qualcosa di fruttuoso: una collaborazione, una partnership, ecc.Quindi, come si fa a raggiungere un blogger di alta qualità?Abbiamo scritto una guida completa su come farlo (e farlo anche su larga scala) che ti consiglio di leggere.Letture consigliate: Blogger Outreach: Come Farlo in Maniera Sistematica13. Fai valere le tue opinioniVogliamo tutti che i nostri contenuti si posizionino su Google e generino traffico organico. Ma puoi spingerti troppo oltre seguendo questa logica e molti siti, oggi, lo fanno. Ecco perché le SERP sono disseminate di contenuti che si assomigliano tra loro.Non dimenticare: il posizionamento è solo una parte dell’equazione. Lo scopo finale è che il lettore consumi i tuoi contenuti e acquisti ciò che stai vendendo. Se sei solo uno dei tanti, non c’è motivo di iscriversi alla tua mailing list, avviare la prova gratuita del tuo prodotto o acquistarlo. Devi distinguerti.Distinguersi significa condividere un’opinione. Wirecutter si distingue da tutti gli altri siti con affiliazioni perché condivide opinioni. Ad esempio, ecco la migliore padella antiaderente, il miglior auricolare wireless, la migliore fotocamera DSLR, ecc.Condividiamo regolarmente le nostre opinioni anche sul nostro blog. Ad esempio, il mio collega, Michal Pecanek, ha dichiarato con sicurezza che ci sono alcune popolari metriche SEO che non contano affatto. Ulteriori approfondimentiLe Opinioni Non Sono Facoltative nel Content MarketingPerché Wirecutter Vince Su Tutti: Contenuti con un Punto di Vista14. Proponi idee e punti di vista diversiLa finanza non è proprio il mio genere. Eppure ho letto quasi tutti gli articoli dello scrittore finanziario Morgan Housel. Lo faresti anche tu, dopo aver letto uno dei suoi contenuti:Sta scrivendo di finanza, ma non lo fa in maniera noiosa e usando il tipico linguaggio di Wall Street. Ti educa da diverse angolazioni: storia, psicologia, biologia, spazio e guerra. La finanza è semplicemente la tela su cui dipinge; i suoi pennelli sono le lenti che usa per introdurti all’argomento.Il tuo settore potrebbe essere “noioso”, ma non lasciare che anche i tuoi contenuti lo siano.Trova un punto di vista diverso da utilizzare per guardare al tuo settore in un modo nuovo. Ad esempio, Animalz ha scritto di content marketing dal punto di vista di un buco nero.Come scrive Morgan:La chiave della persuasione è insegnare alle persone qualcosa di nuovo utilizzando qualcosa che già conoscono. Questo è fondamentale quando si scrive. I lettori vogliono imparare qualcosa di nuovo e imparano meglio quando riescono a mettere in relazione un nuovo argomento con qualcosa che conoscono.15. Non ossessionarti sul conteggio delle paroleLeggere una ricetta oggi significa finire l’equivalente di “Guerra e pace” di Lev Tolstoj prima di imparare finalmente a cucinare quel piatto per il quale si impiegherebbero solo tre minuti.Google’s ranking bias for recipe sites that share the chef’s entire life story via an Ayn Rand novel length of content prior to the actual recipe knows no bounds. Esp on mobile just give us the recipe I’m trying to shop not learn the history of the universe.— Adam Singer (@AdamSinger) October 2, 2019Ciò accade a causa della credenza popolare secondo cui gli articoli più lunghi migliorano il traffico organico. Ma in base al nostro studio su 900 milioni di pagine, esiste una moderata correlazione negativa tra il conteggio delle parole e il traffico organico per i post più lunghi di 2.000 parole.In altre parole, un post di 10.000 parole in media ottiene meno traffico di ricerca rispetto ad un post di 2.000 parole in media.Quindi smettila di ossessionarti sul conteggio delle parole. Nessuno vuole leggere contenuti più lunghi se non c’è necessità di farlo. Copri in profondità quanto necessario, elimina gli aspetti non importanti e vai al punto.16. Crea diversi tipi di contenutiNon puoi aspettarti che ogni contenuto che crei raggiunga tutti gli obiettivi del tuo content marketing. Proprio come nella finanza, è necessario diversificare.A seconda degli obiettivi e delle priorità della tua attività, potresti aver bisogno di quanto segue:Contenuti ottimizzati per la SEOContenuti linkbaitContenuti pensati per migliorare le vendite Contenuti per migliorare la tua leadershipE tanto altro.Anche se il posizionamento su Google è importante per noi, i contenuti pensati per il posizionamento organico non sono l’unica cosa che creiamo. Pubblichiamo anche studi basati su dati (per leadership e link), update sui prodotti (per mantenere i nostri utenti attivi interessati), opinioni (per leadership) e strumenti gratuiti (per generare lead dirette). Letture consigliate: Rischio vs. Rendimento: Come Creare Contenuti Diversificati 17. Crea un hub di contenutiDi recente abbiamo organizzato le nostre migliori guide gratuite all’interno di un grande contenitore per tutti i nostri lettori. Questo tipo di organizzazione è conosciuta con il nome di hub di contenuti. Gli hub di contenuti sono raccolte di contenuti interconnessi e tutti legati a un argomento. Ecco come appare un content hub, in teoria:Poiché il nostro blog viene visualizzato in ordine cronologico inverso, una pagina come questa aiuta i nostri lettori a scoprire più contenuti in modo organizzato.Se hai un numero incredibile di contenuti di valore, prendi in considerazione la creazione di pagine hub per collegarli.Letture consigliate: Content Hub per la SEO: Come Ottenere Più Traffico e LinkConclusioniSpero che questo post ti abbia fornito una serie di suggerimenti utili per il tuo content marketing da applicare alla tua attività.Ho dimenticato qualche consiglio importante? Condividi i tuoi con me su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "17 Consigli Pratici per Fare Content Marketing nel 2022"
    },
    {
      "level": "H2",
      "text": "1.Definisci per chi vuoi creare contenuti"
    },
    {
      "level": "H2",
      "text": "2. Scegli argomenti con potenziale di traffico di ricerca"
    },
    {
      "level": "H2",
      "text": "3. Tratta gli argomenti affrontati dalla concorrenza"
    },
    {
      "level": "H2",
      "text": "4. Dai priorità agli argomenti in base al loro “potenziale commerciale”"
    },
    {
      "level": "H2",
      "text": "5. Lavora sull’intento di ricerca"
    },
    {
      "level": "H3",
      "text": "A. Tipo di contenuto"
    },
    {
      "level": "H3",
      "text": "B. Formato del contenuto"
    },
    {
      "level": "H3",
      "text": "C. Punto di vista del contenuto"
    },
    {
      "level": "H2",
      "text": "6. Crea un calendario editoriale"
    },
    {
      "level": "H2",
      "text": "7. Promuovi i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "8. Crea immagini condivisibili"
    },
    {
      "level": "H2",
      "text": "9. Riproponi i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "10. Aggiungi link trigger"
    },
    {
      "level": "H2",
      "text": "11. Aggiorna i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "12. Contatta blogger"
    },
    {
      "level": "H2",
      "text": "13. Fai valere le tue opinioni"
    },
    {
      "level": "H2",
      "text": "14. Proponi idee e punti di vista diversi"
    },
    {
      "level": "H2",
      "text": "15. Non ossessionarti sul conteggio delle parole"
    },
    {
      "level": "H2",
      "text": "16. Crea diversi tipi di contenuti"
    },
    {
      "level": "H2",
      "text": "17. Crea un hub di contenuti"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}