{
  "url": "https://ahrefs.com/blog/it/consigli-di-marketing/",
  "slug": "consigli-di-marketing",
  "title": "17 Facili Consigli di Marketing per le Piccole Imprese",
  "description": "Ecco una lista di 17 consigli di marketing facilmente applicabili al tuo business che miglioreranno la tua piccola impresa aiutandoti ad ottenere più clienti.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Non riesci a far funzionare il marketing per la tua piccola impresa? Non preoccuparti. Ecco una lista di 17 consigli che ti aiuteranno a migliorare il tuo marketing e ottenere più clienti.Conosci il tuo targetMigliora ciò che funzionaElimina le tattiche che non funzionanoCrea una mailing list Prenditi cura dei tuoi iscritti (Nutrili)Scegli il posizionamento giusto per il tuo prodottoIscriviti a Google My BusinessFai SEO per le pagine esistentiApri un blog incentrato sul tuo prodottoAggiorna i contenuti regolarmenteRiproponi i contenuti su diversi canaliFai includere il tuo prodotto nelle liste ‘miglior X per Y’Regala i tuoi prodottiMettici la facciaLavora con gli influencerSpingi i post migliori sui socialLavora con altri1.Conosci il tuo targetTAR Productions, un’azienda di produzione video, ha circa 260–1,300 visitatori mensili diretti verso i propri migliori articoli. Eppure, l’azienda non stava ricevendo nessun lead di qualità dal traffico generato.Quando l’agenzia di content marketing Grow and Convert ha investigato la questione, il problema è diventato banale:I loro articoli parlavano della produzione video, ma i loro clienti non si occupavano di produrre video.Invece di attrarre i loro clienti ideali, i loro contenuti attraevano altre aziende impegnate nella produzione video—che chiaramente non avevano la minima intenzione di acquistare i loro servizi.Un esempio dei contenuti di TAR Productions indirizzati all’audience sbagliata.Molte piccole aziende fanno lo stesso errore. Invece di creare contenuti per il loro target ideale, creano contenuti per altri utenti simili a loro. Ad esempio, un’agenzia di CRO che parla di CRO, tende ad attrarre altri esperti di CRO, mentre uno studio fotografico che parla di come scattare foto fantastiche tende ad attrarre fotografi amatoriali.Devi comprendere esattamente chi è il tuo target, e intercettarlo efficacemente. Se hai svolto una ricerca di mercato e creato le customer persona, non dovrebbe essere troppo complicato. Sai già chi stai cercando di raggiungere.Ad esempio, se hai uno studio fotografico a Singapore, un potenziale cliente in target potrebbe essere:Coppie di millennial (25–35) che vivono a Singapore e stanno per sposarsi.Non hai ancora qualcosa del genere? Nessun problema. Usa la guida qui sotto per creare delle persona per la tua azienda.Lettura consigliata: Come Creare delle Buyer Persona Dettagliate per la tua Azienda [Template Gratuito]2. Migliora ciò che funzionaNon è possibile mettere a punto ed eseguire ogni singola tattica di marketing esistente perché nessuno ha a disposizione risorse infinite.Questo è il motivo per cui è cruciale allocare le tue risorse di marketing nel modo giusto.Il modo migliore per farlo consiste nel comprendere quali sono le tattiche che stanno funzionando al momento e spendere di più su queste. Successivamente, potrai scalare il canale creando delle procedure operative standard (SOP, dall’inglese standard operating procedure), assumendo più persone, investendo negli strumenti necessari e così via. Se qualcosa ti genera un ritorno, impegnati di più su quello.Per comprendere quali canali stanno funzionando, devi tracciare dei KPI di marketing. Se lo stai già facendo, perfetto, altrimenti non è mai troppo tardi per iniziare. Tool gratuiti come Google Analytics e Ahrefs Webmaster Tools rendono semplice tracciare cosa sta funzionando e cosa no.Un’alternativa semplice potrebbe anche essere quella di chiedere ai tuoi clienti dove ti hanno trovato online:Il nostro canale #registrations su Slack ci tiene informati su come i nuovi iscritti ci hanno trovato.3. Elimina le tattiche che non funzionanoCome ha senso investire di più su quello che funziona, ha senso investire meno su quello che non funziona. Non provare a forzare un canale per cercare di farlo funzionare per la tua azienda. Utilizza le tue risorse in modo saggio.4. Crea una mailing listOgni settimana, inviamo una newsletter a 120,000+ iscritti con tutti i contenuti che abbiamo pubblicato quella stessa settimana.La nostra newsletter.Questi iscritti non sono utenti selezionati casualmente. Sono persone che hanno espressamente manifestato la volontà di ricevere i nostri contenuti.Come abbiamo fatto? Semplice, abbiamo creato una mailing list.Le email sono quasi la preistoria in termini di internet, ma sono sorprendentemente affidabili come strumento di marketing. Le piattaforme social possono impattare deliberatamente la tua reach, ma le email ti consentono di comunicare con il tuo pubblico in qualsiasi momento.Per creare una mailing list, devi avere qualcosa che convinca i visitatori del tuo sito ad iscriversi. Il modo più semplice è offrire qualcosa in cambio della loro iscrizione. La maggior parte dei siti offre un eBook, un corso e, qualche volta, uno sconto. Noi abbiamo un modulo di iscrizione molto semplice:Puoi fare lo stesso o anche altro—il mondo è tuo.5. Prenditi cura dei tuoi iscritti (Nutrili)Alla fine, il numero degli iscritti è solo un numero. Gli utenti non compreranno magicamente da te solo perché si sono iscritti alla tua newsletter. Devi interagire e prenderti cura di loro, e questo significa inviare email regolarmente. Ma cosa dovresti inviare, e quanto spesso?La risposta è diversa per ogni realtà.Ciò che conta è definire delle aspettative in anticipo, e lavorare per raggiungerle.Ad esempio, sul nostro blog, promettiamo di inviare degli aggiornamenti settimanali con i nostri contenuti a chiunque si iscrive—ed è esattamente quello che facciamo. Una volta a settimana, inviamo una newsletter con tutti i contenuti che abbiamo pubblicato quella settimana. In altre parole, diamo ai nostri iscritti esattamente quello che abbiamo promesso.La tua “promessa” potrebbe essere diversa dalla nostra. Qualsiasi cosa sia, assicurati di portarla a termine.6. Scegli il posizionamento giusto per il tuo prodottoPer la maggior parte dei potenziali clienti, tu non sei diverso dai tuoi competitor. Dopotutto, non sei l’unica palestra o l’unico ristorante in giro. Quindi non c’è motivo per loro di scegliere proprio te.A meno che tu non dia loro un perché.Nel marketing, questo viene chiamato “posizionamento”.Il tuo posizionamento dovrebbe rendere chiaro e lapalissiano ai potenziali clienti perché il tuo prodotto o servizio è diverso e perché dovrebbero curarsene.Se fallisci in questo, nessuno comprerà da te.Il posizionamento non è qualcosa che si può fare in un giorno, e non basterebbe un libro per parlarne (infatti ne esistono migliaia sull’argomento!). Ma il modo più pratico è quello di leggere Obviously Awesome e applicare il framework illustrato passo dopo passo.Ecco alcuni punti chiave che abbiamo estratto per te:Comprendi chi sono i tuoi clienti (Consiglio numero 1!).Crea un team dedicato al posizionamento e allinea tutti i team/dipartimenti.Crea una lista delle tue alternative in termini di competitor.Comprendi quali attributi e caratteristiche rendono il tuo prodotto/servizio unico.Comprendi il reale valore di queste caratteristiche e peculiarità—cosa fanno di unico per i tuoi clienti?Trova un segmento di mercato che renda il tuo valore ovvio.Cattura tutto quello che hai da dire sul tuo posizionamento in un documento evergreen che può essere condiviso fra tutti i team.7. Iscriviti a Google My BusinessGoogle My Business è uno strumento gratuito che consente ai proprietari di aziende di creare, gestire e ottimizzare il loro profilo Google Business. Fare questo aiuta a posizionarsi meglio all’interno delle ricerche pertinenti di Google—sia sul web che su Google Maps.Per ottimizzare il tuo profilo servono probabilmente 30 minuti, ed è quindi qualcosa che dovresti fare assolutamente—specialmente se offri i tuoi servizi a clienti locali.Segui la guida qui sotto per creare un profilo ben ottimizzato in 30 minuti.Lettura consigliata:Come Ottimizzare le Tue Schede Google My Business in 30 Minuti8. Fai SEO per le pagine esistentiIl 53.3% di tutto il traffico dei siti proviene dalla ricerca organica. Ed il 76% delle persone che cercano sul loro smartphone un servizio nelle vicinanze visitano un negozio nello stesso giorno.Tradotto: se vuoi più clienti da oggi, devi posizionarti su GoogleMa non puoi semplicemente creare delle pagine web e sperare di posizionarti. Secondo il nostro studio compiuto su di un miliardo di pagine, il 90.63% delle pagine ottiene zero traffico da Google.Il motivo principale è che queste pagine non sono ottimizzate per i motori di ricerca. Se vuoi posizionarti in alto su Google, devi fare search engine optimization (SEO)Parlando in modo molto generale, questo significa: Sapere quello che i tuoi clienti stanno cercando. Fai una keyword research per comprendere quali argomenti vengono cercati dai tuoi clienti. Ottimizzare le tue pagine. Segui queste best practice SEO per far capire a Google che la tua pagina è la migliore. Far sì che le persone linkino alle tue pagine, sia organicamente che attraverso una strategia di link outreach.Per approfondire la SEO, puoi leggere la nostra guida per principianti alla SEO, o seguire il nostro corso SEO gratuito.9. Apri un blog incentrato sul tuo prodottoIl blog di Ahrefs ottiene un traffico stimato di 238,000 visitatori al mese, solamente da Google:Oltre al passaparola, il blog rappresenta per noi la seconda più grande fonte di nuovi clienti. Come abbiamo fatto?a) Abbiamo intercettato argomenti con potenziale di traffico e potenziale aziendaleLa SEO non è solo valida per le pagine esistenti; ma anche per i nuovi contenuti. Quindi, se vuoi che i tuoi articoli di blog generino traffico in maniera costante e passiva, devi intercettare argomenti che hanno il potenziale di portare traffico.Seguire il consiglio #8 dovrebbe averti dato uno chiara idea di come fare una keyword research, ma ecco una veloce dimostrazione su come trovare idee per argomenti da trattare sul tuo blog se vendi tè online:Inserisci una parola chiave pertinente (come “tè” o “tea” in inglese) all’interno del nostro Keyword Generator gratuito.Clicca sulla tab chiamata Questions.Scorri la lista alla ricerca di parole chiave e ordinale in base al loro ‘potenziale aziendale’.Ecco quello che utilizziamo in Ahrefs: b) Crea contenuti fantastici e promuovi il tuo prodotto al loro internoQuesto video spiega come creare un contenuto fantastico che si posizioni:https://www.youtube.com/watch?v=8BdZ0dUu7VQMa ecco un’altra cosa cruciale che facciamo:Ci assicuriamo di utilizzare il nostro prodotto all’interno di ogni articolo di blog che scriviamo. (Probabilmente lo avrai già notato, no?)In questo modo, i nostri lettori non imparano solo a risolvere il loro problema, ma a risolvere il loro problema utilizzando il nostro prodotto.Includere il tuo prodotto senza sembrare solamente dei venditori è davvero una questione di abilità nel copywriting, ma scegliere il giusto argomento di cui parlare è già la metà del lavoro. Questo è il motivo per cui poniamo così tanta attenzione nello scrivere contenuti con potenziale aziendale, in quanto ci consentono di parlare del nostro prodotto in maniera semplice e naturale.Ulteriori approfondimentiCreazione dei Contenuti: la Guida Completa per PrincipiantiCosa Sono i Contenuti SEO? Come Scrivere Contenuti che si PosizionanoCome Scrivere un Articolo di Blog (che le Persone Vogliano Leggere) in 9 Mosse17 consigli (testati) per blogger agli inizi10. Aggiorna i contenuti regolarmenteNon tutti i contenuti che pubblichi si posizioneranno al primo tentativo. Questo è okay. Puoi sempre provare di nuovo. Riscrivi e ripubblica.Noi lo facciamo in Ahrefs. Se dai uno sguardo al numero di articoli che abbiamo pubblicato attraverso il Content Explorer di Ahrefs, puoi notare che abbiamo pubblicato 80 dei 300+ articoli almeno una volta:Se hai centinaia di articoli come noi, non puoi però di certo ripubblicare tutto. Questo è il motivo per cui dovresti dare priorità ai tuoi sforzi.Il seguente diagramma spiega come potresti fare:Puoi utilizzare il nostro plugin SEO WordPress gratuito per analizzare il tuo sito alla ricerca di articoli che non performano bene. Poi segui la guida qui sotto per imparare come ripubblicare al meglio i tuoi contenuti.Lettura consigliata: Ripubblicare Contenuti: Come Aggiornare Vecchi Articoli Blog per la SEO11. Riproponi i contenuti su diversi canaliOgni contenuto che creiamo richiede un incredibile sforzo in termini di tempo. Sarebbe uno spreco premere ‘pubblica’ e dimenticarsi di lui. Al contrario, vogliamo utilizzarlo il più possibile. E per farlo trasformiamo il nostro contenuto in diversi formati.Ad esempio, abbiamo pubblicato la nostra checklist SEO e poi l’abbiamo resa nota in un tweet. Poi, due mesi dopo, abbiamo twittato la stessa checklist, ottenendo molta attenzione:Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021 Poi l’abbiamo trasformata in un post su Linkedin.Forte, vero?Lo facciamo sempre. Che sia trasformare un video in un articolo di blog o un articolo di blog in una discussione Twitter, spingiamo ogni singolo contenuto al massimo.12. Fai includere il tuo prodotto nelle liste ‘miglior X per Y’Non importa cosa tu faccia nel mondo, ci sarà sempre una lista “miglior X per Y” nel tuo settore.Eccone una per i migliori cafè a Londra:Se inseriamo la pagina all’interno del Site Explorer di Ahrefs, possiamo vedere come questa ottenga 483 visite organiche ogni mese.Se esistono liste del genere per la tua azienda, devi farti includere. Altrimenti, stai perdendo potenziale traffico, brand awareness e clienti.Puoi identificare liste pertinenti al tuo settore utilizzando il Content Explorer di Ahrefs:Cerca qualcosa di rilevante (ad esempio, “miglior [tipologia di attività] [zona]”).Seleziona In Title dal dropdown Cerca.Setta il filtro della lingua su Italiano.Imposta il filtro “Live & Broken” su Only live.Aggiungi un filtro “Traffico della pagina” con un valore minimo di 100.Spunta Exclude homepage.Scorri le liste per vedere se sei incluso. Se non lo sei contatta i siti e cerca di farti includere.13. Regala i tuoi prodottiTutti amano ricevere un prodotto gratuito, ma per far sì che i cosiddetti freebies funzionino come strumento di marketing, devi offrire qualcosa che attragga i potenziali clienti.Questo è l’errore che troppi marketer compiono. Mettono in palio qualcosa di completamente slegato da quello che fanno—come un iPhone o un iPad—per poi chiedersi perché nessuna delle persone raggiunte si trasformi in un cliente pagante.Noi di Ahrefs, creiamo delle versioni gratuite dei nostri tool SEO premium per attrarre le persone giuste.Ad esempio, abbiamo un backlink checker gratuito che ottiene un traffico stimato di 177K visite al mese organicamente:(Ecco il resto dei nostri tool SEO gratuiti, nel caso volessi buttarci un occhio.)Chiaramente, non devi essere un’azienda che sviluppa software per creare tool gratuiti.Ad esempio, crunch fornisce servizi di contabilità e mette a disposizione un calcolatore gratuito dello stipendio netto.I tool gratuiti, sono una delle varie tattiche che puoi utilizzare nel mondo del “gratis”.Puoi offrire prodotti all’interno di un contest o una lotteria, due ottimi modi per creare brand awareness e al contempo popolare una mailing list. Questo è quello che ho fatto secoli fa quando abbiamo lavorato per una startup. Ho collaborato con un’altra azienda per offrire il loro prodotto, promuovendolo e poi scambiando tra di noi la lista email.Offri campioni gratuiti del tuo prodotto, merchandising o sponsorizza eventi dando una pizza/birra gratis—non ci sono limiti all’immaginazione.14. Mettici la facciaLe persone non comprano dalle aziende; comprano dalle persone.Questo è il motivo per il quale non dovresti aver paura di metterti in gioco e rappresentare il tuo brand e la tua azienda.Ti vergogni? Ecco cosa puoi fare.Prendi uno dei tuoi più fidati dipendenti e rendilo il volto della tua azienda.Per Ahrefs, questo è il caso del nostro CMO, Tim Soulo—che si è costruito un bel seguito nel corso degli anni.Hey @timsoulo — huge fan of Ahrefs’ content and product marketing! It’s been a big influence on our work here at Charlie. I would love to learn more about the processes behind the great work your produce, how you’re scaled those processes and built your team over time.— Matt Wallace (@matt__wallace__) January 7, 2021 Come risultato, ci ha portato un bel pò di clienti:Ecco altri esempi di founder/dipendenti che hanno spinto in avanti l’azienda diventando il volto del brand: Justin Mares (Kettle & Fire) Eric Bandholz (Beardbrand) Carrie Rose (Rise at Seven) Steve Ballmer (Microsoft)15. Lavora con gli influencerNon hai dipendenti carismatici?Nessun problema. Puoi sempre lavorare con gli influencer.Gli influencer sono persone che hanno a disposizione un audience attiva e di buone dimensioni (solitamente sui social media) e l’abilità di influenzare la propria audience nel compiere un’azione.Puoi lavorare con loro in singole campagne o rendendoli dei brand ambassador.Non deve essere per forza una strategia costosa. Nessuno ti sta chiedendo di far ballare Jackie Chan per il tuo annuncio. Puoi sempre lavorare con nano e micro influencer per far partire la tua campagna. La loro audience potrebbe essere piccola, ma questi influencer hanno la forte possibilità di influenzare la loro audience ad acquistare il tuo prodotto.Leggi la guida qui sotto per muovere i primi passi nell’influencer marketing. Lettura consigliata: Influencer Marketing nel 2021: Definizione, Esempi e Tattiche16. Spingi i post migliori sui socialLa nostra checklist SEO ha ottenuto oltre 1,000 like e retweet:Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021Tutto questo traffico è organico?No. Abbiamo visto che stavamo performando bene, quindi abbiamo deciso di spingere la checklist con delle Ads.Puoi fare anche tu lo stesso. Se uno dei tuoi post sui social funziona bene, puoi dargli una spintarella. In questo modo, puoi raggiungere più persone, creare brand awareness e ottenere più clienti.17. Lavora con altriNel 2018, abbiamo lavorato con Buffer, un tool per pianificare i post sui social media creando un webinar intitolato “Come Ottenere Traffico Verso il Sito con Contenuti Evergreen e Social Media Marketing”.https://www.youtube.com/watch?v=xn2XCFqREbUNon siamo entrati in competizione fra di noi. Noi volevamo intercettare principalmente dei SEO, e Buffer dei social media marketer. I due gruppi cadono sotto un unico ombrello—digital marketer—e i digital marketer possono utilizzare entrambi i tool contemporaneamente.Questo ci ha reso perfetti per una collaborazione.Puoi fare lo stesso. Cerca altre aziende che hanno un’audience simile ma che non competono direttamente con te. Ad esempio, potresti avere un brand di cibi salutari e fare una partnership con una palestra di zona.In questo modo, potrete entrambi sfruttare le reciproche audience. Win-win.ConclusioneSpero di averti fornito alcune idee utili e testabili nell’immediato sulla tua attività.Mi sono dimenticato di condividere qualche consiglio di marketing interessante? Se hai qualcosa da aggiungere, fammelo sapere su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "17 Facili Consigli di Marketing per le Piccole Imprese"
    },
    {
      "level": "H2",
      "text": "1.Conosci il tuo target"
    },
    {
      "level": "H2",
      "text": "2. Migliora ciò che funziona"
    },
    {
      "level": "H2",
      "text": "3. Elimina le tattiche che non funzionano"
    },
    {
      "level": "H2",
      "text": "4. Crea una mailing list"
    },
    {
      "level": "H2",
      "text": "5. Prenditi cura dei tuoi iscritti (Nutrili)"
    },
    {
      "level": "H2",
      "text": "6. Scegli il posizionamento giusto per il tuo prodotto"
    },
    {
      "level": "H2",
      "text": "7. Iscriviti a Google My Business"
    },
    {
      "level": "H2",
      "text": "8. Fai SEO per le pagine esistenti"
    },
    {
      "level": "H2",
      "text": "9. Apri un blog incentrato sul tuo prodotto"
    },
    {
      "level": "H3",
      "text": "a) Abbiamo intercettato argomenti con potenziale di traffico e potenziale aziendale"
    },
    {
      "level": "H3",
      "text": "b) Crea contenuti fantastici e promuovi il tuo prodotto al loro interno"
    },
    {
      "level": "H2",
      "text": "10. Aggiorna i contenuti regolarmente"
    },
    {
      "level": "H2",
      "text": "11. Riproponi i contenuti su diversi canali"
    },
    {
      "level": "H2",
      "text": "12. Fai includere il tuo prodotto nelle liste ‘miglior X per Y’"
    },
    {
      "level": "H2",
      "text": "13. Regala i tuoi prodotti"
    },
    {
      "level": "H2",
      "text": "14. Mettici la faccia"
    },
    {
      "level": "H2",
      "text": "15. Lavora con gli influencer"
    },
    {
      "level": "H2",
      "text": "16. Spingi i post migliori sui social"
    },
    {
      "level": "H2",
      "text": "17. Lavora con altri"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Si Quan Ong"
}