{
  "url": "https://ahrefs.com/blog/it/consigli-digital-marketing/",
  "slug": "consigli-digital-marketing",
  "title": "19 Semplici Consigli di Marketing Digitale Che Funzionano",
  "description": "Implementa questi semplici ma efficaci suggerimenti di marketing digitale per migliorare la tua attività.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Cerchi suggerimenti di marketing digitale semplici ma efficaci? Sei nel posto giusto.Preparati a implementare i suggerimenti di seguito per migliorare i tuoi risultati:Definisci obiettivi di marketing SMARTTraccia i KPI giustiProgetta una struttura semplice e logica per il tuo sitoDefinisci chiaramente il tuo posizionamentoCrea un account su Google BusinessPunta ad argomenti con bassa concorrenzaCostruisciti un seguito sui socialCrea una mailing listPunta ad argomenti con traffico proveniente dalla ricerca“Ruba” parole chiave alla concorrenzaCrea una pagina di tipo vsCrea una pagina con delle statisticheUtilizza HAROPunta ai featured snippetPosiziona i tuoi video su GoogleLancia campagne a pagamento su piattaforme meno popolariDelega compiti noiosiAumenta lo sforzo su ciò che porta risultatiDifferenziati1. Definisci 1 o 2 obiettivi di marketing SMART annualiQual è la prima cosa che fai quando inizi a pianificare una vacanza? Decidi dove andare, ovvero la destinazione.Funziona allo stesso modo nel marketing. Per andare da qualche parte, devi prima decidere dove vuoi andare. Non puoi sapere se hai raggiunto la tua destinazione se non ne scegli una.Ciò significa sapere quali obiettivi di marketing stai cercando di raggiungere.E non puoi essere vago nel farlo, per esempio dichiarare di voler “Aumentare le vendite del 30%” perché non saresti di aiuto a nessuno, in primis a te. Al contrario, devi creare obiettivi seguendo la metodologia SMART:Specific (Specifico): Indica chiaramente il risultato desiderabile stabilendo il chi, cosa, quando, quanto, ecc;Measurable (Misurabile): Deve essere in grado di monitorare i progressi con gli indicatori chiave di prestazione (KPI);Achievable (Raggiungibile): Sii audace con i tuoi obiettivi, ma anche realistico; utilizza la crescita attuale come parametro di riferimento;Relevant (Pertinente): Assicurati che ogni obiettivo si sposi con la tua strategia generale di marketing e di business;Timely (Definito a livello temporale): Stabilisci un lasso di tempo per raggiungere l’obiettivo.Ad esempio, un potenziale obiettivo di marketing per il nostro blog potrebbe essere:Aumentare il traffico organico da 300.000 a 700.000 utenti entro la fine del 2022.Letture consigliate: Obiettivi di Marketing: Come Definirli (Con Esempi)2. Traccia i KPI giusti per i tuoi obiettivi di marketingIl GPS ti dice se stai andando nel modo giusto quando viaggi. Ma qual è il GPS che ti guida quando fai marketing?Sono i tuoi KPI. Dopo aver deciso i tuoi obiettivi (cioè la tua destinazione), i KPI ti dicono se stai andando nella giusta direzione.Ma non tutti i KPI sono uguali. Probabilmente non ti interessa quanti chilometri hai percorso. Vuoi solo sapere se ti stai avvicinando o allontanando. Lo stesso vale per il marketing. Ci sono molti KPI che puoi monitorare, ma la maggior parte sono semplicemente metriche di vanità.Hai solo bisogno di trovare quelli che ti indicano se stai andando nella giusta direzione. Leggi l’articolo qui sotto per scoprire quali KPI valgono il tuo tempo.Letture consigliate: 7 KPI di Marketing Che Vale La Pena Tracciare3. Utilizza una struttura semplice e logica per il tuo sitoPersone e motori di ricerca potrebbero avere difficoltà a trovare pagine su un sito Web disorganizzato. Quindi di solito è meglio utilizzare una struttura del sito Web piatta in cui tutte le pagine si trovano a non più di pochi clic dalla home page.Ti consigliamo di fare in modo che la maggior parte delle tue pagine non si trovi a più di quattro clic dalla home page. Se ci sono pagine a più di sei clic di distanza, prendi in considerazione l’idea di avvicinarle alla tua home page per semplificare il loro utilizzo da parte dei visitatori e dei motori di ricerca.Letture consigliate: Struttura di un Sito Web: Creare delle Solide Fondamenta per la SEO 4. Definisci chiaramente il posizionamento della tua aziendaAnche nella piccola Singapore ci sono centinaia di palestre e centri fitness. Perché qualcuno dovrebbe scegliere la tua attività rispetto agli altri?Non lo faranno, a meno che tu non spieghi loro perché.Questa operazione si chiama posizionamento. E quando dichiari il tuo posizionamento, devi spiegare chiaramente che prodotto o servizio offri, perché è diverso e perché è importante per i tuoi clienti target.È impossibile insegnarti come creare un posizionamento in un articolo (ci vorrebbe un libro!), quindi ti consiglio vivamente di leggere “Obviously Awesome” di April Dunford, una guida per creare il posizionamento perfetto.Ecco qualche nota utile:Scopri chi sono i tuoi clienti miglioriFai un elenco dei tuoi concorrentiScopri gli attributi e le caratteristiche che rendono unico il tuo prodotto/servizioScopri cosa questi attributi e caratteristiche possono fare per i tuoi clientiTrova un mercato di riferimento che sia interessato a questi elementi5. Crea un account su Google BusinessSe sei un’azienda locale che si occupa di clienti locali, devi assolutamente avere un profilo su Google Business. La rivendicazione di questo profilo ti aiuta a posizionarti meglio nelle ricerche Google pertinenti, sia nella ricerca web che in Google Maps.Ottimizzare Google My Business è facile e richiede solo 30 minuti del tuo tempo. Per questo è qualcosa che dovresti fare al più presto, per iniziare subito a raccoglierne i frutti. Segui la guida qui sotto per scoprire come creare un profilo ottimizzato.Letture consigliate: Come Ottimizzare le Tue Schede Google My Business in 30 Minuti6. Punta ad argomenti con bassa concorrenzaLo scrittore esperto di finanza Morgan Housel scrive: La chiave è riconoscere che il lungo periodo è solo una raccolta di brevi periodi e che catturare la crescita a lungo termine significa gestire il breve periodo in maniera tale da garantirti un futuro. In poche parole, se non riesci a sopravvivere adesso non riuscirai a sopravvivere sul lungo periodo. Quindi, anche se vuoi posizionarti per le parole chiave più preziose per la tua attività, ci vorrà del tempo. Nel frattempo, inizia a posizionarti per le parole chiave a bassa concorrenza.Si tratta di parole chiave per le quali puoi posizionarti senza troppi sforzi. Di solito non hai bisogno di molti link esterni o di avere un sito con molta autorità per posizionarti e ottenere traffico organico per il tuo sito web.Come trovi queste parole chiave? Guarda questo video per scoprire come:https://www.youtube.com/watch?v=s7hR-i6Go4cLetture consigliate: Come Trovare Parole Chiave a Bassa Competizione nella SEO7. Costruisciti un seguito su un social networkDevi iniziare a farti notare su TikTok o restare su Instagram? Devi creare più 🧵 su Twitter o scrivere post particolari su LinkedIn? E perché non puntare su qualche nuova piattaforma? Qualunque sia, scegline una. Non entrare su un social solo perché è la moda del momento.Il fascino di essere presenti su più piattaforme social media è enorme. Ma non cedere a questa tentazione. Fare bene su ogni piattaforma significa creare contenuti che si adattano alla piattaforma stessa e per farlo devi avere tempo e spendere risorse.Ci vuole molto lavoro, anche solo per riproporre contenuti già pronti. Gary Vee te lo fa sembrare semplice, ma perché ha un gruppo di persone che lo aiuta. Se gestisci tutto tu, non potrai replicare i suoi risultati dall’oggi al domani.Quale social network dovresti scegliere? Questo dipende dal tuo obiettivo di marketing (suggerimento numero 1). Se il tuo pubblico di destinazione è su Twitter e ti avvicina al tuo obiettivo, allora questa è la piattaforma su cui vuoi essere.Dopo aver creato un forte seguito, espanditi su altre piattaforme. Ad esempio, Instagram è in circolazione dal 2010, ma noi abbiamo aperto solo di recente il nostro account.8. Crea una mailing listAnche se consigliamo di creare un seguito su un social, ricorda sempre che quel pubblico non ti apparterrà mai e che la piattaforma ti sta “mettendo” in prestito i follower. Se all’improvviso vuole toglierteli, può farlo. Ma l’e-mail è diversa: sei tu a gestire l’elenco di contatti e nessuno può limitarti. Quindi, anche se la creazione di una lista di e‑mail sembra un consiglio del 2005, non è un cattivo consiglio.Tutte le aziende dovrebbero avere una mailing list.Il modo più semplice per crearne una è offrire qualcosa ai potenziali abbonati in cambio della loro iscrizione. Questo “qualcosa” può essere qualsiasi cosa: un eBook, un corso, uno sconto o altro.Noi di Ahrefs, abbiamo un semplice “iscriviti”:9. Punta ad argomenti con traffico proveniente dalla ricercaSe vuoi posizionarti su Google, l’argomento che vuoi trattare deve essere quello che le persone stanno cercando. Ha senso, vero? Tuttavia, la maggior parte delle aziende inizia a bloggare creando un articolo e pregando che si posizioni.La speranza non è una strategia. Devi essere sempre intenzionale. Devi fare in modo che i tuoi articoli si posizionino. Per fare ciò, devi prendere in considerazione gli argomenti con potenziale di traffico di ricerca.Come trovi questi argomenti? Ecco come:Vai sul Keywords Explorer di AhrefsInserisci una parola che ti interessa e che è rilevante per quello che faiClicca sulla voce Termini corrispondentiClicca sulla casella DomandeCome puoi vedere, abbiamo trovato (nel nostro caso in inglese) ben 197.000 argomenti di cui potremmo occuparci. A questo punto non ci resta che selezionare quelli che sono più rilevanti e metterli da parte. Letture consigliate: Keyword Research: La Guida per Principianti di Ahrefs10. “Ruba” parole chiave alla concorrenzaImmagina di poter capire per quali parole chiave si posiziona la tua concorrenza in modo da poter replicare la loro strategia.Bene, puoi farlo. Ecco come:Vai sul Site Explorer di Ahrefs’Inserisci l’URL di un competitorVai su Pagine MiglioriQui, troverai tutte le pagine dei tuoi concorrenti in base alla quantità di traffico organico che ricevono, più la parola chiave che invia a ciascuna pagina la maggior parte del traffico.Guarda l’elenco e scegli le parole che sono più rilevanti per la tua attività.11. Crea una pagina di tipo vsI tuoi clienti vogliono il massimo quando spendono i loro soldi. Quindi confronteranno te e i tuoi concorrenti. Ancora una volta, piuttosto che lasciare al caso, devi essere tu a prendere l’iniziativa.Crea una pagina “vs” in cui confronti i pro e i contro tra la tua attività e quella di un’azienda concorrente.Come fai a sapere con chi ti confrontano i tuoi clienti? Ecco come scoprirlo:Vai sul Keywords Explorer di AhrefsInserisci il nome del tuo brandVai su Termini CorrispondentiNel menu Termini scegli “vs” (o qualsiasi altra parola che implica una comparazione)Se lo facciamo per il nostro brand ci rendiamo conto che le persone ci confrontano con Moz, SEMRush e Majestic.A questo punto, la maggior parte delle aziende creerà pagine di confronto separate per ciascun concorrente. Tuttavia, abbiamo deciso di fare qualcosa di diverso e abbiamo creato una pagina vs che si occupa di tutti in un solo colpo. Un solo articolo o più di uno, la decisione spetta a te. 12. Crea una pagina con delle statisticheI giornalisti spesso hanno bisogno di sostenere le loro argomentazioni con i dati. Tuttavia, non sempre hanno accesso a queste informazioni. Quindi cercano i dati online per menzionare e linkare la fonte da dove hanno reperito i datiAd esempio, nel 2020, Ahrefs è stato citato da Bloomberg per via dei nostri dati sulle ricerche top su Google.Ma non tutti hanno accesso a dati univoci. Quindi un modo per aggirare questo problema è curare un elenco di statistiche per il tuo settore.Questo è quello che abbiamo fatto quando abbiamo creato la nostra pagina con le statistiche SEO. Da allora, ci siamo posizionati al primo posto per la ricerca “Statistiche SEO” (in inglese) e abbiamo accumulato ~2,4K link da ~1,1K siti unici.Scopri come l’abbiamo fatto:https://www.youtube.com/watch?v=eTF6OBwidhc&list=PLvJ_dXFSpd2u_ABxIRO6RVK3ucKyzn96YLetture consigliate: Link Building: Come Abbiamo Ottenuto Link Esterni con una Pagina di Statistiche 13. Prova HAROI giornalisti non hanno solo bisogno di dati ma anche di approfondimenti di esperti. Ed è per questo che Help a Reporter Out (HARO) esiste. Se sei un esperto del tuo settore, puoi diventare una fonte di informazioni. Iscriviti, monitora le richieste nella tua categoria e rispondi il prima possibile con informazioni preziose.Il mio collega Michal Pecánek ha moltissima esperienza con HARO e questi sono alcuni dei suoi suggerimenti che ti permetteranno di incrementare le tue possibilità di ottenere una menzione tramite questa piattaforma:Scegli la pubblicazione giusta: cerca di evitare quelle che non sono autorevoli;Sii esigente: devi rispondere solo alle richieste in cui puoi davvero fornire ottime informazioni;Rispondi il più velocemente possibile: molte persone monitorano la tua stessa nicchia, quindi rispondi il più rapidamente possibile;Chiedi aiuto: non esitare a coinvolgere i colleghi se sono più qualificati per rispondere;Attieniti alle richieste: non deviare dal formato richiesto dall’autore.Letture consigliate: 9 Tattiche per Fare Pubbliche Relazioni con Esempi di Campagne14. Punta ai featured snippetSe hai cercato qualcosa su Google e hai visto questo…… vuol dire che hai visto quello che viene chiamato featured snippet.Riuscire a entrare in un feature snippet significa scavalcare tutti gli altri siti e saltare in prima posizione. E puoi farlo senza dover avere nuovi link o riscrivere i tuoi contenuti.Il modo più semplice per iniziare è sfruttare i contenuti che già hai. Ecco come:Vai sul Site Explorer di AhrefsInserisci il tuo indirizzoVai su Ricerca OrganicaFiltra per featured snippet (selezionando anche “where target doesn’t rank for”) nel filtro SERP features FIltra per le posizioni #2–10 usando il filtro Posizione Otterrai un elenco di opportunità per rubare la posizione dei tuoi concorrenti che appaiono nei featured snippet.Quindi, come si fa a provare a posizionarsi nei featured snippet con un contenuto?Abbiamo creato una guida passo passo che ti mostra come rielaborare i tuoi contenuti in modo da avere le migliori possibilità di entrare in questa posizione. Leggila cliccando qui sotto.Letture consigliate: Come Ottimizzare per i Featured Snippet di Google 15. Posiziona i tuoi video su GoogleI video di YouTube si posizionano su YouTube. Ovvio. Ma sapevi che i video di YouTube si posizionano anche su Google?Il nostro canale YouTube ha ottenuto oltre 200.000 visualizzazioni da Google nell’ultimo anno:Per riuscirci, devi posizionarti per argomenti che hanno queste caratteristiche:Potenziale in termini di traffico di ricerca: le persone cercano questi argomenti su YouTube e Google;Interesse per i video: persone che preferiscono guardare un video invece di leggere.Come trovare questi argomenti?Vai sul Content Explorer di AhrefsCerca: site:youtube.com inurl:watch title:topicOrdina i risultati per Traffico della paginaFacendo così otterrai un elenco di video YouTube pertinenti che ricevono traffico di ricerca organico da Google. Visualizza l’elenco di quelli rilevanti per la tua attività, quindi crea un video in modo che si posizioni:https://www.youtube.com/watch?v=BObU_VCwnvYLetture consigliate: SEO per Video: Come Posizionare i Tuoi Video di YouTube Su Google 16. Lancia campagne a pagamento su piattaforme meno popolariTutti conoscono Facebook, Instagram e Google Ads che sono i punti di riferimento quando si tratta di annunci a pagamento. Ma non dimenticare che anche YouTube, Twitter, Quora e persino TikTok hanno piattaforme pubblicitarie. Se il tuo pubblico di destinazione si trova su queste piattaforme, e queste piattaforme si adattano ai tuoi obiettivi di marketing, vale la pena prenderle in considerazione.Noi, per esempio, pubblichiamo regolarmente annunci su YouTube.If you create YT tutorials that feature your product, consider spending 💰 on ads. Doesn’t have to be a lot. In July, we spent 154.62 SGD (~112.75 USD) for 174.8 hours of watch time (10,488 minutes).That’s $0.01/min or $0.65/hour. Name a cheaper medium for relevant/focused attn— Sam Oh (@samsgoh) August 16, 2020 E lo facciamo anche su Quora:17. Delega compiti noiosiSi dice che non si dovrebbe mai fare la stessa cosa due volte. Se ti ritrovi a fare una cosa più e più volte, e questa cosa non ti diverte, vuol dire che puoi esternalizzarla e delegarla,Alcune attività possono essere completate facilmente con lo strumento giusto. Ad esempio, invece di “copiare e incollare” le bozze su WordPress, noi le carichiamo semplicemente utilizzando Wordable.Per altre attività, potresti dover assumere liberi professionisti o personale a tempo pieno. Crea procedure operative standard (SOP), assumi e forma le persone che utilizzano tali documenti e perfeziona il tuo sistema.Scopri come esternalizzare le tue attività di marketing utilizzando il seguente framework (è pensato per chi si occupa di SEO ma può essere utilizzato su qualsiasi canale di marketing):Letture consigliate: Come Esternalizzare Le Attività SEO 18. Aumenta lo sforzo su ciò che porta risultatiNell’applicazione dei suggerimenti di questo post, tieni d’occhio ciò che funziona. Fai lo stesso per i canali e le tattiche esistenti che hai utilizzato e che stai utilizzando.Quindi, investi su quelli che funzionano in modo che generino qualcosa di più.È proprio quello che abbiamo fatto noi di Ahrefs. Abbiamo iniziato con il blog. E quando abbiamo capito che stava funzionando, l’abbiamo ampliato assumendo più persone per scrivere, creando standard operativi, ecc. E poiché sapevamo che il content marketing sarebbe stato perfetto per noi, abbiamo iniziato a investire nella creazione di ancora più contenuti, questa volta su YouTube.Le nostre entrate ricorrenti annuali (ARR) a otto cifre parlano chiaro.19. DifferenziatiPablo Picasso una volta disse: “I bravi artisti copiano, i grandi artisti rubano”.Ispirati da questa citazione, i marketer hanno iniziato a copiarsi a vicenda. Se esiste una strategia che funziona tutti la seguono, a volte senza tener conto delle proprie necessità.In alcuni casi questo approccio funziona ma nella maggior parte dei casi si finisce per rendere il mercato pieno di imitazioni e copie.I guess there’s a new trend in SaaS homepage design 😆 pic.twitter.com/5qhQOCVBi5— Tim Soulo 🇺🇦 (@timsoulo) July 12, 2019Il marketing è tutto basato sul concetto di differenziazione. Ecco perché hai bisogno di una strategia di posizionamento. Ecco perché devi creare una pagina “vs”. Lo scopo è arrivare prima della concorrenza. Ma se sei uguale agli altri, non c’è motivo per cui il tuo prodotto o servizio debba essere scelto.Penso che non ci sia nulla di sbagliato nel seguire le pratiche che funzionano ma prova ad aggiungere il tuo tocco. Ad esempio, guarda la nostra homepage e la nostra pagina vs.Quello che abbiamo utilizzato non è originale, ma abbiamo sempre cercato di essere diversi.ConclusioniSpero che questo post ti abbia fornito una serie di spunti da testare per la tua attività. Ho dimenticato qualche suggerimento interessante? Se hai qualcosa da condividere, contattami su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "19 Semplici Consigli di Marketing Digitale Che Funzionano"
    },
    {
      "level": "H2",
      "text": "1. Definisci 1 o 2 obiettivi di marketing SMART annuali"
    },
    {
      "level": "H2",
      "text": "2. Traccia i KPI giusti per i tuoi obiettivi di marketing"
    },
    {
      "level": "H2",
      "text": "3. Utilizza una struttura semplice e logica per il tuo sito"
    },
    {
      "level": "H2",
      "text": "4. Definisci chiaramente il posizionamento della tua azienda"
    },
    {
      "level": "H2",
      "text": "5. Crea un account su Google Business"
    },
    {
      "level": "H2",
      "text": "6. Punta ad argomenti con bassa concorrenza"
    },
    {
      "level": "H2",
      "text": "7. Costruisciti un seguito su un social network"
    },
    {
      "level": "H2",
      "text": "8. Crea una mailing list"
    },
    {
      "level": "H2",
      "text": "9. Punta ad argomenti con traffico proveniente dalla ricerca"
    },
    {
      "level": "H2",
      "text": "10. “Ruba” parole chiave alla concorrenza"
    },
    {
      "level": "H2",
      "text": "11. Crea una pagina di tipo vs"
    },
    {
      "level": "H2",
      "text": "12. Crea una pagina con delle statistiche"
    },
    {
      "level": "H2",
      "text": "13. Prova HARO"
    },
    {
      "level": "H2",
      "text": "14. Punta ai featured snippet"
    },
    {
      "level": "H2",
      "text": "15. Posiziona i tuoi video su Google"
    },
    {
      "level": "H2",
      "text": "16. Lancia campagne a pagamento su piattaforme meno popolari"
    },
    {
      "level": "H2",
      "text": "17. Delega compiti noiosi"
    },
    {
      "level": "H2",
      "text": "18. Aumenta lo sforzo su ciò che porta risultati"
    },
    {
      "level": "H2",
      "text": "19. Differenziati"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}