{
  "url": "https://ahrefs.com/blog/it/content-writing/",
  "slug": "content-writing",
  "title": "Che Cos’È Il Content Writing? 13 Suggerimenti Per Creare Contenuti",
  "description": "Abbiamo creato centinaia di contenuti e sappiamo come farlo. Ecco 13 cose che abbiamo imparato nel corso degli anni.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Noi di Ahrefs scriviamo molti contenuti. Abbiamo oltre 320 post sul blog e più di 200 video pubblicati sul nostro canale YouTube, la maggior parte dei quali con uno script.Inutile dire che sappiamo qualcosina relativamente alla creazione di contenuti che il tuo pubblico vuole leggere.In questo post, tratteremo 13 best practice che puoi applicare ai tuoi contenuti. Ma prima, alcune nozioni di base:Che cosa si intende per content writing?Perché il content writing è importante?Le migliori pratiche di content writingChe cosa si intende per content writing?Il content writing, o scrittura di contenuti, è il processo di ricerca, pianificazione, scrittura, modifica e pubblicazione di contenuti per il Web. Può trattarsi di un post sul blog, lo script di un video, una pagina per vendere qualcosa. Insomma, tutto ciò che viene pubblicato online.Perchè il content writing è importante?La scrittura è importante perché i contenuti hanno il potere di aiutarti ad attrarre e fidelizzare i clienti.Questa pratica è anche chiamata content marketing ed è per questo che stai leggendo un articolo sul content writing sul blog di Ahrefs. Informandoti sull’importanza e sulle migliori pratiche per la scrittura di contenuti, speriamo di aumentare la conoscenza, l’interesse e la richiesta per il nostro prodotto.Le migliori pratiche di content writingOgnuno ha la propria opinione su come scrivere i migliori contenuti. Le pratiche che condivido di seguito sono semplicemente quelle che abbiamo riscontrato funzionare nel corso degli anni e ci hanno aiutato ad ottenere risultati nella creazione di contenuti.1. Utilizza un templateNon è necessario iniziare a scrivere contenuti da zero. La maggior parte dei contenuti rientra infatti in tipologie predefinite: liste, guide su come fare qualcosa, recensioni e tanto altro. Per questo motivo, esistono modelli già pronti che puoi usare come base.Noi per esempio stiamo utilizzando un template proprio per questo post.Come fai a scegliere il modello da usare?Dipende dal tuo obiettivo. Ma se vuoi che il tuo contenuto scritto abbia ottime possibilità di posizionarsi in alto su Google e di attrarre traffico organico, devi scegliere quello che meglio si allinea a ciò che vuoi raggiungere e a cosa si aspettano gli utenti.Ad esempio, se cerchi “content writing” (in inglese) su Google (cosa che probabilmente hai già fatto), noti subito che in alto si posizionano parecchi post. Ecco perché abbiamo scelto questo template: i risultati in alto permettono di valutare cosa vogliono vedere gli utenti quando si trovano davanti un contenuto che risponde a questa ricerca e, di conseguenza, permettono di capire quali sono i formati che è più probabile che vengano premiati da Google.2. Crea uno schema che funzionaSe è vero che un modello è sufficiente per farti partire, potresti comunque non sapere esattamente di cosa scriverai.Ad esempio, raggiungeremmo il blocco degli scrittori abbastanza rapidamente se provassimo a scrivere questo post dall’inizio alla fine senza definire uno schema.Ecco lo schema di questo articolo:Come abbiamo scelto i punti da inserire? Alcuni sono nostri ma abbiamo anche preso ispirazione dalle pagine nelle posizioni in alto su Google. Più specificamente, abbiamo cercato temi e punti comuni tra di loro per capire quali erano le domande a cui le persone stavano cercando risposte e quali i consigli che stavano cercando.Ad esempio, utilizzando il rapporto on-page gratuito nella SEO Toolbar di Ahrefs, possiamo vedere un paio di argomenti comuni nei sottotitoli delle pagine più importanti.Noterai andando avanti nella lettura di questo post che abbiamo incluso punti simili.3. Fai in modo che sia interessante da condividereLe persone condividono i contenuti per diversi motivi. Jonah Berger ne evidenzia alcuni nel suo libro “Contagious”. Eccoli:Si condividono contenuti che rafforzano il proprio punto di vista e fanno sembrare migliori;Si condividono contenuti che stimolano emozioni, per esempio felicità, paura, etc;Si condividono elementi legati ad eventi che stanno accadendo;Si condividono contenuti di valore o utili;Si condividono contenuti già condivisi da altri.Concentriamo la nostra attenzione sul punto numero 5.Ottenere alcune condivisioni iniziali è la chiave per mettere in moto questo meccanismo e un modo per farlo è inserire “attivatori di condivisione” nei tuoi contenuti, i cosidetti trigger.Puoi trovare questi “attivatori di condivisione” spulciando i profili di backlink di una pagina simile alla tua, poiché anche i link sono una forma di condivisione.Ecco come fare:Vai sul Keywords Explorer di AhrefsCerca un argomento di cui stai scrivendoVai alla SERP overviewTrova un articolo simile con molti domini di riferimentoClicca sul numero che trovi sotto la colonna BacklinksControlla la colonna Anchor and target URL per trovare dei punti di contatto tra tutti i linkAd esempio, se lo facciamo per il post di Big Commerce sull’affiliate marketing, vediamo che alcuni siti lo hanno linkato per via delle statistiche menzionate (probabilmente perché attivano la tipologia di condivisione che abbiamo visto nel punto 1 della lista di cui sopra).Se stai scrivendo sullo stesso argomento, menzionare queste statistiche o delle statistiche simili potrebbe aumentare le condivisioni del tuo articolo.4. Utilizza un punto di vista unicoOgni giorno vengono pubblicati più di 3,5 milioni di post sui blog. Se vuoi che i tuoi diventino competitivi devi distinguerti e per farlo devi affrontare l’argomento scelto da un angolo unico.Ecco un esempio. La procrastinazione non è un argomento nuovo ma il post di Tim Urban su questo tema è uno dei più popolari sul suo sito (e magari sull’intero web!). Come mai? Perché l’ha affrontato da un angolo che nessuno aveva mai considerato in precedenza.Piuttosto che parlare dei pericoli della procrastinazione, ha deciso di spiegare perché rimandiamo usando simpatiche illustrazioni: la scimmia della gratificazione istantanea, il mostro della paura, ecc.Sebbene non ci siano modi infallibili per trovare “punti di vista”, ecco alcuni modelli mentali che puoi prendere in considerazione: Esperienza personale: hai provato a fare qualcosa? Racconta la tua esperienza e cosa hai imparato. Noi l’abbiamo fatto nei nostri post sull’email outreach e sulle certificationi SEO. Autorità: hai esperienza nel settore e sei in grado di offrire spunti unici? Fallo! Se non hai l’esperienza necessaria, intervista qualcuno che ce l’ha. Noi l’abbiamo fatto nel nostro post sulle penalità di Google. Opinioni esterne: chiedi i pareri di alcune persone che si occupano di ciò di cui vuoi scrivere, come abbiamo fatto noi nell’articolo sulla descrizione del lavoro per le posizioni nella SEO. Dati: fornisci prove e utilizza numeri quando parli di argomenti popolari nella tua nicchia. Guarda per esempio i nostri studi sul link building reciproco e sulla lunghezza dei post sui blog. Andare controcorrente: Cosa succede se fai il contrario di quello che hanno fatto gli altri?5. Sii credibileNon aspettarti che le persone ti credano fin dall’inizio. Spiega loro perché dovrebbero farlo. Perché tu tra tutte le persone?Sei un esperto del settore? Hai le credenziali per dimostrarlo? C’è qualcuno che può garantirlo per te?Hai dati o prove a sostegno delle tue affermazioni?Hai fatto la cosa che hai affermato? L’hai già provata?Come puoi vedere, la maggior parte delle domande riguardano il tuo punto di vista. L’angolo che scegli per il tuo contenuto ti aiuterà a stabilire la credibilità di cui hai bisogno. Ma non fermarti qui. Rendilo esplicito.Scorri fino all’introduzione di questo post. Te l’ho detto che abbiamo un sacco di esperienza nella creazione e pubblicazione di contenuti.Hai visto cosa ho fatto, proprio adesso? 😉6. Mostra fatti, non paroleDare consigli è facile. Ma devi anche evitare che chi legge brancoli nel buio. Mostra loro esattamente cosa intendi e come va fatto. Includi sempre esempi di ciò di cui stai parlando.Ad esempio, nel nostro articolo sulla creazione di obiettivi SEO, non ti diamo solo la struttura ma ti facciamo 3 esempi di obiettivi e di come possono essere definiti.7. Scrivi un titolo accattivanteLe persone non cliccheranno sul tuo post se il titolo è noioso e poco interessante.Devi quindi creare titoli irresistibili che catturino l’attenzione delle persone e le spingano a volerne sapere di più.Come? Usa la nostra formula in tre passaggi: Scegli un formato: il formato che scegli per il tuo contenuto (elenco, guida, recensione, etc.) determinerà l’aspetto del tuo titolo; Aggiungi un punto di vista unico: se hai scelto il tuo punto di vista (vedi punto 3), assicurati di farlo sapere subito al tuo potenziale lettore; Umanizzalo: usa aggettivi o figure retoriche che useresti per descrivere l’articolo al tuo migliore amico.Letture consigliate: Come Scrivere Un Titolo Irresistibile in 3 Passaggi8. Utilizza la formula PAS per la tua introduzioneI titoli convincono le persone a cliccare; le introduzioni le convincono a leggere.Usa quella che in inglese viene chiamata “formula PAS” (Problem-Agitate-Solve) ovvero “Crea Panico, Crea Ansia, Risolvi il Problema” per creare un’introduzione avvincente. Noi la usiamo abbastanza regolarmente sul nostro blog.Come funziona? Inizi descrivendo il problema:Quindi crei ansia scavando ancora di più nel problema:Infine dai a chi legge la soluzione perfetta:9. Semplifica la lettura del post Non c’è niente di più scoraggiante di un muro di testo.Se il tuo articolo si presenta in questo modo, la gente scapperà. Dividilo e sistemalo.Un contenuto funziona se è semplice da leggere. La formula che in inglese si chiama ASMR può essere un ottimo modo per semplificare la lettura: Annota: includi note a margine, virgolette, caselle di richiamo e altri elementi; Sentenze e paragrafi corti: utilizza un editor (in inglese esiste l’Hemingway editor), per semplificare le frasi troppo contorte; Multimedia: utilizza video, immagini, GIF e tweet per illustrare il tuo argomento; Rileggi il tuo contenuto a voce alta: identifica le parti del testo che non sono scorrevoli.10. Scrivi come parliLa scrittura di contenuti Web è amichevole e personale. È come parlare con una persona amica. Non c’è bisogno di usare paroloni o scrivere come se stessi pubblicando sull’enciclopedia.Il tuo obiettivo è comunicare, non impressionare le persone con le tue parole da vocabolario. Quindi mantieni la calma e scrivi come parli.11. Fai leggere il contenuto ad un’altra personaSiccome l’hai scritto tu, rischi di non riuscire a valutare correttamente il tuo lavoro e di non trovare errori. Ecco perché l’opinione di una seconda persona può essere preziosa.Ogni post e script video di Ahrefs è sottoposto a questo controllo. Ci alterniamo per leggere le bozze degli altri e per lasciare feedback. Indichiamo problemi di logica, legati al flusso poco scorrevole del contenuto, ad eventuali passaggi poco chiari, a frasi mal formulate e così via.Facciamo anche sapere ai nostri lettori che ogni articolo non è opera di una sola persona ma che è lo sforzo di molte persone che lavorano insieme per renderlo eccezionale.Anche se lavori in autonomia, puoi ricevere feedback da un’altra persona. Potrebbe essere il tuo partner, la tua famiglia o anche colleghi e colleghe di altri team. Se necessario, puoi chiedere aiuto ad altri writer. Il loro contributo renderà il tuo lavoro molto migliore.12. Rispondi alle domande della genteSe le persone cercano risposte alle loro domande, vuol dire che sono quegli gli argomenti di cui devi scrivere. Il modo più semplice per trovare queste domande è usare un software gratuito per la ricerca delle parole chiave. Ecco come fare: Vai sullo strumento gratuito per le parole chiave di AhrefsInserisci un argomento generico relativo alla tua nicchia o al tuo sito (e.g., caffè, tè)Seleziona QuestionsIn questo modo vedrai un elenco di domande relative all’argomento che hai inserito. Queste domande sono elencate in base al volume di ricerca, ovvero, in media, quante volte al mese le persone cercano la tua parola chiave in una data zona.Più alto è il volume di ricerca, più persone chiedono informazioni su quella specifica questione.Sfoglia l’elenco e prendi nota di tutte le domande pertinenti a cui potresti potenzialmente rispondere con un post sul blog.Letture consigliate: Ricerca Parole Chiave: La Guida di Ahrefs Per Principianti13. Crea una lista di risorse utiliCome puoi trovare costantemente punti di vista e idee uniche per i tuoi contenuti?La risposta più semplice è che come writer devi cercare continuamente spunti. Che si tratti di libri, video di YouTube, articoli o podcast, dovresti consumare contenuti di continuo e aumentare le tue conoscenze nel tuo campo.Allo stesso tempo, dovresti raccogliere tutte le risorse in un unico posto. Che cosa intendo?Ryan Holiday ha definito il commonplace book, ovvero quello che noi definiamo archivio delle risorse, in questo mdoo:… una risorsa centralizzata o un raccoglitore di idee, citazioni, aneddoti, osservazioni e informazioni che ti colpiscono mentre stai facendo altro. Lo scopo di questo archivio è registrare e organizzare queste idee per un uso successivo in qualunque cosa tu faccia. Grazie a questa risorsa, non dovrai cercare idee quando è il momento di scrivere e ti basterà estrarle dall’elenco che hai compilato.Personalmente, ho creato un un archivio su Notion. Ecco come appare:Questo è il mio primo punto di riferimento prima di redigere uno qualsiasi dei miei post sul blog.ConclusioniPer scrivere contenuti straordinari, devi scrivere.Ma se aspetti che l’ispirazione ti arrivi prima di metterti a lavoro, non pubblicherai mai nulla. Ti consiglio invece di definire un calendario dei contenuti, ovvero un programma relativo a quando vuoi pubblicare nuovi contenuti e che tipo di contenuti vuoi pubblicare.Stabilire delle scadenze ti aiuterà, eviterà la procrastinazione e ti obbligherà a pubblicare.Come disse una volta il famoso drammaturgo Somerset Maugham:”Scrivo solo quando l’ispirazione colpisce. Fortunatamente suona alle nove ogni mattina”. Mi sono perso qualche consiglio importante per la scrittura di contenuti? Fammi sapere su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "Che Cos’È Il Content Writing? 13 Suggerimenti Per Creare Contenuti"
    },
    {
      "level": "H2",
      "text": "Che cosa si intende per content writing?"
    },
    {
      "level": "H2",
      "text": "Perchè il content writing è importante?"
    },
    {
      "level": "H2",
      "text": "Le migliori pratiche di content writing"
    },
    {
      "level": "H3",
      "text": "1. Utilizza un template"
    },
    {
      "level": "H3",
      "text": "2. Crea uno schema che funziona"
    },
    {
      "level": "H3",
      "text": "3. Fai in modo che sia interessante da condividere"
    },
    {
      "level": "H3",
      "text": "4. Utilizza un punto di vista unico"
    },
    {
      "level": "H3",
      "text": "5. Sii credibile"
    },
    {
      "level": "H3",
      "text": "6. Mostra fatti, non parole"
    },
    {
      "level": "H3",
      "text": "7. Scrivi un titolo accattivante"
    },
    {
      "level": "H3",
      "text": "8. Utilizza la formula PAS per la tua introduzione"
    },
    {
      "level": "H3",
      "text": "9. Semplifica la lettura del post"
    },
    {
      "level": "H3",
      "text": "10. Scrivi come parli"
    },
    {
      "level": "H3",
      "text": "11. Fai leggere il contenuto ad un’altra persona"
    },
    {
      "level": "H3",
      "text": "12. Rispondi alle domande della gente"
    },
    {
      "level": "H3",
      "text": "13. Crea una lista di risorse utili"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}