{
  "url": "https://ahrefs.com/blog/it/content-hub/",
  "slug": "content-hub",
  "title": "Content hub per la SEO: come ottenere più traffico e link con i topic cluster",
  "description": "I content hub sono collezioni di contenuti riguardanti diversi aspetti dello stesso argomento e legati da link reciproci. Scopri perché sono utili alla SEO e come crearne uno.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti A prima vista la maggior parte dei content hub sembrano pagine come tutte le altre.Ecco un content hub di Zapier sul lavoro da remoto:Può sembrare abbastanza anonimo, ma in realtà è stato costruito in modo strategico per approfittare della struttura del sito e per portare più traffico, più link e più authority.E sembra proprio che abbia funzionato!In questa guida affronteremo questi temi:Che cosa sono i content hubPerché sono utili in chiave SEOCome creare un content hubEsempi di content hubhttps://www.youtube.com/watch?v=nIbJI1kCxrUChe cosa sono i content hub?I content hub sono collezioni di contenuti riguardanti diversi aspetti dello stesso argomento e legati da link reciproci.Sono composti da tre parti:Hub page/contenuto pillar: guida di livello superiore su un topic ampio.Pagine secondarie/contenuto cluster: guide più approfondite che riguardano parti del topic principale.Link ipertestuali: collegano la hub page e le pagine secondarie. La hub page linka tutte le pagine secondarie e ciascuna pagina secondaria linka la hub page.Nota a margine. La nostra immagine è tratta da quella contenuta nella guida di Hubspot ai cluster di topic.Diamo un’occhiata alla guida ai chatbot di Drift per vedere come funzionano i content hub nella pratica.Ecco la hub page:La pagina affronta l’argomento ampio “chatbot”, e spiega che cosa sono i chatbot, quali vantaggi hanno e come si crea un chatbot.Però non tratta questi argomenti in modo approfondito: taglia corto, e lo fa apposta a farlo.Questo perché i dettagli sui singoli sottoargomenti sono contenuti nelle pagine secondarie:Pagina secondaria di Drift che riguarda il funzionamento dei chatbot.Pagina secondaria di Drift che riguarda i vantaggi dei chatbotOgni pagina secondaria contiene un link che riporta alla hub page…Pagina secondaria di Drift che riguarda i vantaggi dei chatbot.… e, viceversa, nella hub page ci sono link a tutte le pagine secondarie:I risultati di questo approccio parlano da soli: Drift ha attratto più di 500 link alla hub page e ha visto crescere il traffico organico fino a 6.400 visite mensili stimate.Perché i content hub sono utili lato SEO?L’utilità dei content hub va oltre la semplice buona organizzazione dei contenuti: i content hub sono anche utili dal punto di vista della SEO.1. Maggior “topical authority”Connettere la hub page e le pagine secondarie usando link interni rilevanti crea relazioni semantiche tra le varie parti del contenuto. Questo può essere utile ad aumentare quella che viene definita “topical authority” (un sito ha topical authority maggiore quando Google lo considera più autorevole di altri rispetto a un certo argomento o topic).Google esamina anche gli anchor text interni per riuscire a capire l’argomento della pagina.Most links do provide a bit of additional context through their anchor text. At least they should, right‽— 🍌 John 🍌 (@JohnMu) November 23, 2017 [La maggior parte dei link dà una qualche informazione in più sul contesto con l’anchor text. O almeno dovrebbe farlo, vero?]2. Maggior link authorityLe pagine di un hub linkate strategicamente beneficiano tutte dei backlink reciproci, per via del meccanismo di funzionamento del PageRank. I backlink fanno aumentare la “link authority” di una pagina, che poi viene trasmessa parzialmente alle altre pagine dell’hub tramite i link interni.Google ha smesso di rendere pubblici i PageRank nel 2016, quindi non c’è più modo di controllare il PageRank di una pagina. Tuttavia esistono metriche SEO basate su principi simili, come l’URL Rating di Ahrefs che abbiamo scoperto essere ben correlate con il traffico organico.URL rating (UR) vs Traffico organicoURL rating (UR) medioTraffico da ricerca organica(secondo ricerca effettuata su circa 14 milioni di pagine web dal Content Explorer di Ahref)3. Maggior engagementGli hub fanno aumentare la probabilità che i visitatori consumino diverse pagine di contenuto, perché molte pagine rilevanti sono collegate tra di loro. Quest’aspetto è vantaggioso non solo per la user experience, ma anche perché può mandare segnali di engagement positivi a Google. Alcuni SEO ritengono che migliori addirittura il posizionamento.4. Maggior valore percepitoAvere un sacco di risorse su un argomento, organizzate in modo ordinato e spesso presentate con un design personalizzato, fa aumentare il valore percepito dai visitatori. Questo spesso si trasforma in un maggior numero di backlink, perché di solito le persone preferiscono linkare alla risorsa migliore e più utile che riguarda un argomento.Come creare un content hubCreare un content hub non è difficile: per crearlo basta seguire tre semplici passaggi.1. Raccogliere argomenti per le hub pagePrendi carta e penna, fai un bel brainstorming e prendi nota di tutti gli argomenti che ti vengono in mente.Se hai difficoltà a trovare delle idee, vai sul Keyword Explorer di Ahrefs, cerca un topic ampio collegato alla tua nicchia e poi vai sul rapporto Phrase match.Ad esempio se vendi vini online prova a cercare la keyword “wine” (vino).In questo rapporto vedrai un sacco di idee, ma non tutte potranno essere usate per le hub page.Scegli idee che:abbiano un intento informativoabbiano il potenziale di generare traffico di ricercasiano sufficientemente genericheEsaminiamo ognuna di queste caratteristiche.Ha intento informativoStiamo creando un content hub, quindi dobbiamo scegliere un topic con intento informativo.Il modo migliore per capire se un topic ha natura informativa è esaminare i primi 10 risultati in SERP.Ad esempio la maggior parte dei risultati per la keyword “wine and spirits” (vino e alcolici) sono pagine di e‑commerce: questo ci dice che chi compie la ricerca è in modalità acquisto e non in modalità apprendimento.Per “barcelona wine bar” (wine bar Barcellona), la maggior parte dei risultati sono locali, cioè riferiti alla città di Barcellona, quindi nemmeno questo è un buon topic da scegliere.Ora dai un’occhiata ai risultati per “types of wine” (tipi di vino):La maggior parte di questi risultati sono post e articoli di blog, quindi sappiamo che le persone desiderano ottenere informazioni.Ha potenziale di traffico organicoCreare un content hub richiede un sacco di lavoro, quindi dovresti controllare che l’argomento abbia la potenzialità di instradare verso i tuoi contenuti una discreta quantità di traffico organico.Il volume di ricerca è un un buon indicatore, ma può essere fuorviante.Ad esempio negli Stati Uniti la keyword “wine grapes” (uve da vino) ottiene 3.900 ricerche mensili:Ma se guardiamo su Keywords Explorer il traffico mensile stimato verso la pagina in cima alla SERP, è di molto inferiore a 3.900 ricerche.Questo quindi a prima vista sembrerebbe un topic discreto per l’hub, perché potremmo creare tante sottopagine quante sono i tipi di uva da vino, ma in realtà non vale la pena di sfruttarlo, perché il traffico potenziale è abbastanza scarso.È ampioGli argomenti specifici non vanno bene per le hub page perché non ci sono sottoargomenti su cui scrivere. D’altro canto, però, è importante non scegliere un argomento troppo ampio.Come regola generale, cerca argomenti che abbiano tra i cinque e i venti sottoargomenti.In base ai risultati di ricerca nel momento in cui sto scrivendo, “types of red wine” (tipi di vino rosso) potrebbe essere un buon argomento, perché sembra che ci siano solo otto tipi di vino rosso principali.Potremmo ampliare il discorso e creare una hub page riguardante i “types of wine” (tipi di vino)?Certo, ma probabilmente non staremmo ad elencarli, perché i tipi di vino sono centinaia. Avrebbe più senso elencare quelli più conosciuti e creare delle pagine secondarie che li riguardino.I creatori di questo sito hanno seguito esattamente quest’approccio:2. Scegliere sottoargomenti rilevantiQui la cosa fondamentale è scegliere sottoargomenti strettamente correlati al topic prescelto.Ad esempio se l’argomento della hub page è “come si fa il vino”, non avrebbe molto senso creare una pagina secondaria sui vari tipi di bicchieri per il vino.Una buona pagina secondaria deve ampliare le informazioni su un argomento correlato.Ecco alcuni modi per trovare gli argomenti per le pagine secondarie:Esaminare le pagine posizionate meglio per l’argomento che hai sceltoMettiamo di voler creare un hub sull’argomento “how to make wine” (come si fa il vino). Possiamo estrarre i sottoargomenti dalle pagine meglio posizionate in questo momento per quella query.Ad esempio questa pagina fa fa praticamente tutto il lavoro al posto nostro:Guida dettagliata in 5 passaggi per fare il vino per tutti, con la storiaFare il vinoStep 1 — Raccogliere l’uvaStep 2 — Pestare l’uvaStep 3 — FermentazioneStep 4 — ChiarificazioneStep 5 — Invecchiamento e imbottigliamentoPossiamo percorrere i 5 passaggi nella hub page, poi andare più nel dettaglio nelle pagine secondarie.Ricordati soltanto di controllare il potenziale di traffico dei sottoargomenti nel Keyword Explorer prima di usarli: è totalmente inutile scrivere su sottoargomenti che nessuno cerca!Cercare le altre keyword per cui si posizionano le pagine in cima alla SERPIncolla la keyword principale nel Keyword Explorer di Ahrefs e poi fai clic sul rapporto “Also rank for”.Questo rapporto contiene tutte le keyword per cui sono anche posizionate tra i primi 100 risultati di ricerca le pagine nelle prime 10 posizioni in SERP.Se guardiamo questo report per “how to make wine” (come si fa il vino), vediamo alcuni sottoargomenti utili, come “wine making equipment” (attrezzature per fare il vino) e “wine fermentation” (fermentazione del vino).Per scoprire che cosa potrebbe andare bene per le pagine secondarie e che cosa invece no basta usare il buonsenso.Cercare un elencoSe stai pensando di usare il formato elenco per la tua hub page, il modo più semplice per scoprire i sottoargomenti è quello di ricavare le idee più popolari da un elenco già esistente.Cerca su Google un elenco, poi copia o riutilizza tutto ciò che compare al suo interno.Incolla le idee nel Keywords Explorer per vedere quali sono le più popolari.Scegli da 5 a 20 idee tra le più rilevanti e popolari per costruire le pagine secondarie.Dare un’occhiata a WikipediaWikipedia è una fonte di informazioni ben organizzate su praticamente qualsiasi argomento, quindi è un buon posto per trovare i sottoargomenti.È sufficiente cercare su Google il topic principale e poi aggiungere la stringasite:wikipedia.org.Cerca nel’indice i sottocontenuti rilevanti: probabilmente troverai un sacco di idee.3. Creare i linkLa hub page dovrebbe linkare le pagine secondarie e, viceversa, le pagine secondarie dovrebbero linkare la hub page.Molti degli hub che incontrerai usano design personalizzati per realizzare i collegamenti.Ad esempio tutte le pagine dell’hub di Drift dedicato ai chatbot sono linkate da un indice con design personalizzato.Il meccanismo del collegamento in questo caso è bello da vedere e ha senso dal lato utente, ma non deve per forza sempre essere così. Dopotutto alcuni non hanno le risorse per creare design complicati per i loro hub!In altre parole, se ti trovi a creare degli hub ma hai un budget limitato, va perfettamente bene usare dei link normali.Chi ha progettato Yoga Journal ha fatto esattamente così.La hub page contiene dei link normali che portano alle pagine secondarie…… e le pagine secondarie contengono dei link normali che portano alla hub page:Magari non sarà la soluzione ottimale dal punto di vista grafico, ma dal punto di vista strutturale il risultato è identico ai content hub con design elaborati prodotti dai grandi brand.Si può sempre aggiungere un design personalizzato in un secondo momento… quando si inizierà a ricevere traffico!Come velocizzare il processoIl problema della creazione dei content hub è che richiede molto tempo e fatica. Bisogna creare molto contenuto, e il contenuto costa, sia in termini di tempo che di denaro.La soluzione? Sfruttare il contenuto già esistente!Ecco come:Se hai un sito fatto così…… l’unica cosa che devi fare è scrivere un post per la nuova hub page e linkarlo ai post esistenti.Ad esempio noi abbiamo molte pagine che riguardano problemi di SEO tecnica, come i redirect, i canonical, i tag hreflang, il file robots.txt e i contenuti duplicati.Adesso sono disperse in modo casuale sul blog. Ma potremmo fare così:Creare un post sulla SEO tecnica che funga da hubCostruire link che partano da quel post e portino a tutte le pagine esistentiCosì per creare un content hub basterebbe creare un solo contenuto nuovo.Esempi di content hubPrima di concludere, vorrei condividere rapidamente alcuni dei migliori content hub che mi è capitato di vedere, per darti qualche idea.Keto for Beginners — DietDoctorChatbot Learning Centre — DriftWine 101: Beginners Guide — WineFollyPaleo 101: The Ultimate Guide To The Paleo Diet — Ultimate Paleo GuideYoga Pose Finder — Yoga JournalPer concludereQuest’articolo è interamente centrato su un solo tipo di content hub, il cui modello è anche noto come “hub and spoke”. Tuttavia ci sono molti tipi diversi di content hub.Detto questo, i content hub non vanno bene per tutte le situazioni. In alcuni casi non ci sono abbastanza sottoargomenti.Ad esempio se il tuo sito riguarda un argomento ampio come lo sport, ci sono abbastanza sottoargomenti per creare diversi content hub. Ma questo discorso probabilmente non vale per un sito che riguarda un argomento meno ampio, come il pattinaggio su ghiaccio per bambini.Se pensi di voler ricorrere a questa strategia, ricordati di quest’aspetto.Hai delle domande? Contattami su Twitter.Tradotto da Elisa Bruno. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Content hub per la SEO: come ottenere più traffico e link con i topic cluster"
    },
    {
      "level": "H2",
      "text": "Che cosa sono i content hub?"
    },
    {
      "level": "H2",
      "text": "Perché i content hub sono utili lato SEO?"
    },
    {
      "level": "H3",
      "text": "1. Maggior “topical authority”"
    },
    {
      "level": "H3",
      "text": "2. Maggior link authority"
    },
    {
      "level": "H3",
      "text": "3. Maggior engagement"
    },
    {
      "level": "H3",
      "text": "4. Maggior valore percepito"
    },
    {
      "level": "H2",
      "text": "Come creare un content hub"
    },
    {
      "level": "H3",
      "text": "1. Raccogliere argomenti per le hub page"
    },
    {
      "level": "H4",
      "text": "Ha intento informativo"
    },
    {
      "level": "H4",
      "text": "Ha potenziale di traffico organico"
    },
    {
      "level": "H4",
      "text": "È ampio"
    },
    {
      "level": "H3",
      "text": "2. Scegliere sottoargomenti rilevanti"
    },
    {
      "level": "H4",
      "text": "Esaminare le pagine posizionate meglio per l’argomento che hai scelto"
    },
    {
      "level": "H4",
      "text": "Cercare le altre keyword per cui si posizionano le pagine in cima alla SERP"
    },
    {
      "level": "H4",
      "text": "Cercare un elenco"
    },
    {
      "level": "H4",
      "text": "Dare un’occhiata a Wikipedia"
    },
    {
      "level": "H3",
      "text": "3. Creare i link"
    },
    {
      "level": "H2",
      "text": "Come velocizzare il processo"
    },
    {
      "level": "H2",
      "text": "Esempi di content hub"
    },
    {
      "level": "H2",
      "text": "Per concludere"
    }
  ],
  "author": "Joshua Hardwick"
}