{
  "url": "https://ahrefs.com/blog/it/content-marketing/",
  "slug": "content-marketing",
  "title": "Content Marketing: una Guida Completa per il 2021",
  "description": "Il content marketing ti aiuta ad attrarre, coinvolgere, convertire e mantenere clienti che non potresti raggiungere in altro modo. Impara subito come cominciare.",
  "content": "Fio Dossetto Content marketing editor. Grande fan di Ahrefs. Impegnato nell’aiutare le persone a creare contenuti fantastici che aiutano la propria audience. Contenuti Il content marketing ti aiuta ad attrarre, coinvolgere, convertire e trattenere clienti che non potresti raggiungere in altro modo. E non è mai stato così in voga—se non lo stai facendo, è molto probabile che i tuoi concorrenti si siano attivati già su questo fronte.Questa guida ti aiuterà a capire cos’è il content marketing, come spiegarne i benefici ai tuoi amici e colleghi marketers e come iniziare. Abbiamo incluso idee e consigli da parte di 15 esperti di content marketing per darti un vantaggio di partenza per il 2021.Vedremo:Cos’è il content marketing?Perché il content marketing è importante?3 obiezioni comuni fatte al content marketing30+ tipi di content marketing5 esempi di content marketing efficace15 consigli di content marketing dagli esperti che puoi utilizzare quest’annoCos’è il content marketing?Il content marketing è un processo di creazione e distribuzione di contenuti al fine di attrarre e mantenere clienti, in modo da aumentare il proprio fatturato e, in ultima analisi, far crescere il tuo business.Noi di Ahrefs abbiamo una strategia di content marketing semplice ed efficace: creiamo articolo approfonditi per il nostro blog e video YouTube che insegnano ai clienti potenziali e quelli esistenti come risolvere problemi legati alla crescita del traffico del proprio sito utilizzando i nostri strumenti. Ci affidiamo principalmente alla Search Engine Optimization (SEO) per portare traffico al nostro sito, che al momento attuale ottiene ~400.000 visite organiche al mese:Il blog e Youtube funzionano bene per Ahrefs, ma potrebbero esserci altri formati di content marketing che puoi utilizzare a seconda del tuo pubblico, delle tue risorse, e dei tuoi obiettivi (ne parleremo più in fondo all’articolo).Perché il content marketing è importante?Il content marketing ti offre l’opportunità di attrarre, coinvolgere, convertire e trattenere i tuoi clienti. Abbiamo almeno 5 ottime motivazioni per investire in questo canale:Creare consapevolezza e attrarre potenziali clientiCoinvolgere il tuo pubblico e costruire una reputazioneConvertire i clientiMigliorare la fedeltà e il mantenimentoIl content marketing offre un interesse composto (ed è economico nel lungo termine)Approfondirò ognuno di questi punti con degli esempi legati al modo in cui facciamo content marketing ad Ahrefs; nella sezione dedicata agli esempi invece, ne troverai altri provenienti anche da altri settori.1. Il content marketing ti aiuta a creare consapevolezza e attrarre potenziali clientiQuando le persone hanno un problema che vogliono risolvere, o un desiderio che vogliono esprimere, non prenderanno in considerazione i tuoi prodotti se non sanno della tua esistenza. Il content marketing è un modo per assicurarti che ti possano scoprire.Ad esempio, ad Ahrefs aiutiamo le persone ad ottenere più traffico verso i loro siti web. Non ci sono molte probabilità che queste persone cerchino però direttamente “Ahrefs” all’interno di Google, in quanto non conoscono ancora i nostri strumenti; solitamente iniziano la loro ricerca cercando su Google qualcosa di simile all’obiettivo che vogliono raggiungere, come ad esempio “portare traffico al sito web”. Utilizzando il content marketing, possiamo apparire per tale ricerca, e formare una connessione mentale iniziale fra Ahrefs ed il problema che l’utente sta cercando di risolvere.2. Il content marketing ti aiuta a coinvolgere il tuo pubblico e costruire una reputazioneSolo perchè qualcuno sa della tua esistenza, non significa che sceglierà i tuoi prodotti o il tuo brand. Ma apparire con dei contenuti interessanti e coinvolgenti la seconda, terza, quarta volta che qualcuno cerca delle idee o soluzioni migliora le tue possibilità.Proseguendo con l’esempio precedente, poniamo caso che qualcuno abbia scoperto la SEO, e ora stia cercando qualcosa di più specifico come “come fare una ricerca parole chiave”. Dato che abbiamo scritto un articolo a riguardo e siamo posizionati nella parte alta di Google, troveranno il nostro sito—di nuovo.Stessa cosa su YouTube. Abbiamo un video relativo alla ricerca parole chiave, in modo che gli utenti che cercano questa tematica non possono fare altro che trovarsi di fronte al nostro brand.La nostra guida di 10 minuti sulla ricerca parole chiaveSe questa persona segue i link interni o continua a cercare, troverà con molta probabilità il nostro Keyword Generator Tool, che aiuta ad identificare migliaia di idee di parole chiave gratuitamente, fornendo un assaggio di quello che Ahrefs può fare (e sì: anche gli strumenti gratuiti sono un ottimo esempio di content marketing).3. Il content marketing ti aiuta a convertire i clientiAnche quando un potenziale cliente ti conosce a sa cosa offri, potrebbe comunque avere delle obiezioni che lo bloccano dallo sceglierti. Questo è esattamente il contesto nel quale il content marketing può dare una spintarella finale e convincere le persone a diventare tue clienti. Ad esempio, Ahrefs non è l’unico strumento per la SEO sul mercato, ed i nostri potenziali clienti potrebbero voler vedere un confronto delle funzionalità presenti rispetto a quelle dei nostri concorrenti prima di iscriversi. Abbiamo quindi creato un contenuto che si basa proprio su questo confronto, e che le persone possono trovare cercando su Google il nostro nome contro quello di un concorrente (ad esempio, “Ahrefs vs. Moz”).Se abbiamo fatto un buon lavoro e risposto bene a tutte le obiezioni, considerando tutto quello che già sanno sul nostro conto, la CTA con il nostro periodo di prova a $7 dovrebbe rappresentare l’ultima piccola spinta necessaria di cui hanno bisogno: 4. Il content marketing ti aiuta a migliorare la fedeltà e il mantenimentoL’obiettivo finale del content marketing è quello di aumentare le vendite e alimentare la crescita di un business, ed è quindi molto più che concludere una singola vendita: aiuta anche i tuoi clienti attuali a essere coinvolti ed informati su tutte le novità, migliorando il mantenimento e la fedeltà verso il tuo brand.Ad Ahrefs, non creiamo degli articoli dedicati per questo scopo. Dato che poniamo sempre l’attenzione sul risolvere uno specifico problema e migliorare le abilità di chi legge, i nostri contenuti funzionano per i clienti sia attuali che potenziali. Abbiamo però anche una sezione di aiuto dedicata che è più specifica per i nostri attuali utenti, dove li aiutiamo a capire i dati che vedono all’interno del nostro strumento e in che modo possono beneficiarne. Questo è importante per il mantenimento, perchè se non riescono a capire il valore che gli stiamo dando, sarà difficile che continuino a pagare per il nostro strumento mese dopo mese.5. Il content marketing offre un interesse composto (ed è economico nel lungo termine)Al contrario di altri canali come quello della pubblicità a pagamento che smette di funzionare nel momento in cui tagli i fondi, il content marketing offre un interesse composto in termini di ritorno sull’investimento iniziale.Semplificando parecchio le cose, se oggi spendi €1.000 in annunci per portare 100 click verso il tuo blog, dovrai spenderne altri €1.000 domani per ottenere lo stesso risultato. Ma se spendi €1.000 nel creare ed ottimizzare un contenuto, lo stesso contenuto potrà continuare a portare traffico verso il tuo sito per mesi o addirittura anni a seguito della sua pubblicazione.Nel nostro caso il nostro blog si posiziona per 170.000 parole chiave, portandoci un traffico stimato di 358.000 visite al mese. Se dovessimo provare ad ottenere lo stesso risultato attraverso gli annunci a pagamento, dovremmo spendere una stima di $992.000 al mese — una cifra che non si avvicina minimamente a quello che spendiamo per creare i nostri contenuti.Lettura consigliata: Come Creare una Strategia Vincente di Content Marketing in 9 Passi3 obiezioni comuni fatte al content marketing, e come rispondere A questo punto, dovresti essere convinto della forza del content marketing—ma questo non significa che il tuo reparto marketing o i tuoi investitori lo siano. Esistono una serie di obiezioni comuni che tendono a saltare fuori quando si discute di content marketing, e potresti dover saper rispondere in maniera adatta per far approvare tale strategia ai progetti che segui:La pubblicità a pagamento attrae più traffico e clienti velocementeCi vuole troppo tempo per vedere i risultatiIl ROI è difficile da misurare1. La pubblicità a pagamento attrae più traffico e clienti velocementeLa pubblicità a pagamento è indubbiamente più veloce (e costosa) per generare traffico: nel momento in cui inizi a pagare, il tuo annuncio è di fronte agli occhi delle persone e, dando per scontato che l’obiettivo sia giusto, il traffico inizierà ad arrivare.In ogni caso, almeno nella maggior parte delle volte, gli annunci a pagamento mandano le persone verso pagine che sono alla fine del tuo funnel di marketing, e che sono disegnate per convertire immediatamente, come ad esempio le landing page o le pagine prodotto. Inviando del traffico su questa pagine, protesti generare delle vendite, ma solo dalle persone che sono già pronte ad acquistare—perdendoti tutto il resto del traffico.Per fare un esempio, se qualcuno cerca “come portare traffico al sito”, è molto probabile sia intento ad imparare (e non acquistare). Nonostante potremmo far girare degli annunci per questa parola chiave e mandare gli utenti su una specifica landing page, molto probabilmente si tratterebbe di uno spreco di denaro, in quanto le persone non saranno molto propense all’acquisto.Al contrario, il content marketing ci aiuta ad attrarre, coinvolgere e convertire i clienti attraverso tutto il funnel. E un risultato secondario di ciò è rappresentato dalla riconoscibilità del brand e dalla fiducia che otteniamo, in modo che quando le persone saranno pronte a comprare, i nostri annunci a pagamento saranno con molta probabilità molto più efficaci.Un annuncio Facebook che promuove la nostra guida all’analisi dei concorrentiInvece di rimanere bloccati in un’eterna battaglia per capire se siano meglio le pubblicità a pagamento o il content marketing, la soluzione più intelligente consiste nel capire come utilizzare entrambe per portare risultati sia sul lungo che sul corto periodo.2. Ci vuole troppo tempo per vedere i risultati Se definisci i risultati esclusivamente come vendite e contatti allora si: il content marketing impiega più tempo a portare risultati rispetto ad altri canali come la pubblicità a pagamento (guarda l’obiezione numero 1).Solo perché qualcosa impiega più tempo non significa che non abbia senso farla. Ad esempio, è più semplice guidare facendo il giro di una montagna piuttosto che costruire una galleria. Ma una volta che hai costruito la galleria, puoi guidarci attraverso in una frazione del tempo, ogni volta che dovrai farlo.Il content marketing è simile: ci vuole del tempo per costruire e impostare tutto, ma una volta fatto diventa una fonte costante di vendite e contatti. Inoltre, una volta che hai creato il tuo pubblico, il content marketing può portare risultati molto più veloci che iniziare da zero.3. Il ROI è difficile da misurare Il ROI esatto del content marketing è indubbiamente arduo da misurare; dovresti costruire un modello di attribuzione molto complesso per tracciare l’influenza e l’impatto dei contenuti attraverso tutto il funnel, isolando ogni singola variabile.Ad ogni modo, esistono delle specifiche metriche che puoi tracciare in ogni fase del tuo funnel di marketing, utilizzandole per un calcolo parziale del ROI:Fonte: CMI.Allo stesso modo, stimare il ROI portato dal content marketing guidato dalla SEO non è complicato. Puoi dare uno sguardo al traffico potenziale e al valore delle pagine meglio posizionate per calcolare quanto ti verrebbe a costare scrivere, pubblicare e promuovere un articolo mettendolo a confronto con il traffico che questo potrebbe portarti nel tempo.Lettura consigliata: il nostro CMO, Tim Soulo, spiega il valore del content marketing.Tipi di content marketingEsistono tantissime tipologie di content marketing che puoi utilizzare:Articoli di blogPodcastVideoInfograficheStrumenti gratuitiSchemiEbookLista di controllo…e l’elenco continua. Potresti essere tentato dal fare un po’ di tutto nella speranza di raggiungere più persone. Ti consigliamo però di prendere un approccio più strategico: concentrati sui due o tre formati che potrebbero avere l’impatto maggiore sulla tua attività.Per noi, il blog rappresenta il nostro cavallo di battaglia. Sappiamo che il nostro pubblico di professionisti SEO, marketer e blogger cerca le informazioni di cui ha bisogno su Google, di conseguenza ci assicuriamo di creare dei contenuti sempreverdi che si posizionino e portino traffico coerente con l’obiettivo al nostro sito. E dato che talvolta è più semplice spiegare alcuni concetti in un video, specialmente se stiamo cercando di dimostrare come funziona il nostro strumento, ne abbiamo creato alcuni da incorporare all’interno dei nostri articoli, che carichiamo poi anche su YouTube.Se sai che il tuo pubblico utilizza principalmente Google per trovare soluzioni ai propri problemi, potresti replicare il successo del nostro blog utilizzando la SEO per portare traffico ai tuoi contenuti seguendo questi 3 passi:Trova argomenti rilevanti alla tua attivitàCrea i contenutiPromuovili1. Trova argomenti rilevanti alla tua attivitàPensa a quello che le persone potrebbero cercare all’interno di Google per trovarti: queste sono le tue parole chiave seme. Ad esempio, se vendi accessori per la fotografia analogica, un punto di partenza potrebbe essere “rullino da 35mm”.Inserisci questa parola chiave all’interno del Keyword Explorer di Ahrefs, e poi dai uno sguardo al report chiamato Questions, che contiene idee correlate sotto forma di domande. Scrivi e salva ogni domanda alla quale potresti rispondere creando un articolo sul blog.Lettura consigliata: Come Ricercare Parole Chiave Per La SEO2. Crea le giuste tipologie di contenutiUna volta che hai scelto una parola chiave, assicurati che il contenuto che andrai a scrivere combaci con le aspettative di chi lo ricerca. Questo si chiama intento di ricerca, e può essere determinato dando uno sguardo alle pagine posizionate in alto:In questo esempio, noterai come i risultati sono guide passo-passo che includono uno specifico angolo ‘a casa’—il che ci dice che la maggior parte delle persone che cerca questo argomento sono con molta probabilità fotografi amatoriali e non professionisti, dunque il tuo contenuto dovrebbe avere un angolo simile.Quando è rilevante, dovresti mostrare i tuoi prodotti nel modo più naturale possibile all’interno dell’articolo. Ad esempio, nel loro articolo che parla di come sviluppare un rullino a casa, B&H Photo Video ti guida attraverso un processo passo-passo, fornendo al contempo i link a pagine prodotto correlate.Nota del redattoreIn praticamente tutti i nostri contenuti, inclusa questa guida, aggiungiamo degli screenshot presi dalla dashboard di Ahrefs, in modo da mostrarti come utilizzare il nostro strumento per raggiungere i tuoi obiettivi.Joshua HardwickHead of ContentLettura consigliata: Cos’è la SEO Copywriting?3. Promuovi i tuoi contenutiUna volta che il tuo contenuto è online, puoi inviarlo al tuo pubblico, come ad esempio la tua mailing list o le persone che ti seguono sui social. Nel nostro caso, spendiamo anche qualche centinaio di dollari per promuovere l’articolo con gli annunci a pagamenti su Facebook e Twitter:Questi non sono gli unici modi in cui promuoviamo i nostri contenuti: guarda questo elenco di controllo sulla promozione dei contenuti per raggiungere ancora più persone.5 esempi di content marketing efficaci dai quali imparareAvere un blog è un ottimo modo per creare contenuti che attraggono il tuo pubblico di riferimento, ma altri formati possono essere altrettanto efficaci—dipende tutto dal tuo pubblico e come questo preferisce cercare e fruire le informazioni. Ecco cinque esempi di content marketing efficace diversi dai soliti blog:I video YouTube di Fix.comLa community Facebook di NaturaliciousIl podcast di 15FiveIl foglio delle attività e la stanza dei giochi virtuale di MattelI corsi all’interno dell’academy di Balsamiq1. I video Youtube di Fix.comPanoramica → 30k iscritti su YouTube, 16 milioni di visualizzazioni video. Cosa fanno → Fix.com è un ecommerce che vende pezzi di ricambio per elettrodomestici, e utilizza dei video-istruzioni su YouTube per educare i clienti attuali e quelli potenziali. Fornendo utili video passo-passo, Fix.com riesce ad affermare la sua competenza, ottenere fiducia e semplificare il processo di ricerca dei clienti, che sanno così di cosa hanno bisogno.Perchè funziona → Molte delle SERP Google relative a ricerche del tipo istruzioni (come fare qualcosa) hanno un video come risultato principale, e Fix.com riesce quindi a massimizzare la propria esposizione mantenendosi attivo su YouTube.I video e gli articoli creati da Fix.com sono sempreverdi, riuscendo a portare traffico per diversi anni (che di conseguenza rende questa strategia di content marketing molto efficace e con costi piuttosto contenuti).Come puoi fare lo stesso → L’approccio di Fix.com funziona bene sei hai un prodotto o un servizio che risolve un problema specifico (in questo caso, un elettrodomestico non funzionante). Usa la ricerca di parole chiave per determinare di che tipo di aiuto abbia bisogno il tuo pubblico, e crea dei contenuti nel formato che possa essere per loro migliore.2. La community Facebook di NaturaliciousPanoramica → 11k membri all’interno del gruppo Facebook.Cosa fanno → Naturalicious, un produttore di prodotti per capelli naturali e biologici, ha una community privata su Facebook chiamata ‘The Nation’, che viene gestita dalla fondatrice e CEO Gwen Jimmere.Perchè funziona → Con delle sessioni live e delle procedure dettagliate, The Nation offre supporto ai propri clienti in modo che questi possano ottenere il massimo dai prodotti di Nutralicious. In aggiunta, il gruppo crea un senso di comunità all’interno della quale i membri si supportano e si aiutano a vicenda, condividendo piccoli trucchi di bellezza, consigli e incoraggiamenti.Come puoi fare lo stesso → L’approccio di Nutraliacious è ideale per le aziende con un obiettivo demografico ben preciso (in questo esempio, donne di colore e/o donne con una specifica tipologia di capelli). Creando una community, puoi avere una conversazione attiva con i tuoi clienti attivi e quelli potenziali, avendo anche l’opportunità di capire cosa è particolarmente importante per loro, associando inoltre i tuoi prodotti o servizi con la community stessa.3. Il podcast 15FivePanoramica → 220 backlink, 165 parole chiave organiche verso la landing page del podcast Cosa fanno → 15Five è una piattaforma di gestione degli impiegati che aiuta i manager ad avere team contenti e motivati al lavoro. All’interno del loro podcast Best-Self Management, i fondatori di 15Five intervistano i leader delle aziende migliori e i relativi reparti delle risorse umane per ottenere informazioni e consigli ispirazionali che aiutano a costruire una cultura aziendale di gran qualità.Perché funziona→ Il podcast si concentra sul problema principale che il software da loro realizzato risolve: supportare gli impiegati ed i team al lavoro in modo che possano dare il loro meglio. Utilizzando il formato dell’intervista, ottengono ispirazione e consigli, creando associazioni forti fra il brand 15Five e la sfida di creare team performanti ed efficaci.Oltre a questo, la landing page del loro podcast si posiziona in prima pagina per “management podcast”, ponendosi così di fronte direttamente alla loro pubblico ideale:Come puoi fare lo stesso → L’approccio di 15Five funziona bene se la tua audience target ascolta i podcast e il tuo business è connesso ad uno specifico hobby, stile di vita, ambizione o lavoro da svolgere. Invitando degli esperti, posizioni il tuo brand come esperto della conoscenza di quel determinato settore, sfruttando allo stesso tempo il pubblico dei tuoi ospiti per ottenere più visibilità.4. Il foglio delle attività e la stanza dei giochi virtuale di MattelIl foglio delle attività e la stanza dei giochi virtuale di MattelPanoramica → 21k backlink, 4.800 condivisioni Facebook. Cosa fanno → Durante il mese di Marzo 2020, il produttore di giocattoli Mattel (conosciuto per Barbie, Hot Wheels ed il brand Fisher-Price) ha risposto al COVID-19 creando una stanza dei giochi virtuale con giochi gratuiti e un PDF di attività scaricabile per bimbi e famiglie.Perchè funziona→ Con la sua risorsa d’intrattenimento gratuita, Mattel ha attratto una grossa copertura mediatica ottenendo backlink che hanno portato traffico referral. Il foglio delle attività rinforza la posizione di Mattel come brand leader nel settore dell’intrattenimento, aiutando i loro clienti (in questo caso, i genitori) ad avere una vita più semplice.Come puoi fare lo stesso→ Crea contenuti che permettano alle persone di provare una parte dei tuoi prodotti gratuitamente. Il nostro webmaster tool è un esempio calzante: fornisce ai proprietari dei siti un accesso (limitato) a due dei nostri prodotti più conosciuti: Site Explorer & Site Audit. Non significa mettere tutto a disposizione, ma solo una parte per fornire un valido aiuto—che può porre il brand in una posizione di favore quando un potenziale cliente vorrà compiere un acquisto in futuro.5. I corsi all’interno dell’academy di BalsamiqPanoramica → 8k parole chiave organiche, 12k visite organiche al mese, $24.9k di valore del traffico mensile.Cosa fanno → Lo strumento di wireframing chiamato Balsamiq ha creato una academy per educare e fornire risorse utili ai clienti potenziali e attuali.Perché funziona→ La Balsamiq Wireframing Academy incrementa la consapevolezza del brand attraverso delle risorse da cui imparare che sono ottimizzate per apparire in SERP su ricerche correlate come “cos’è un wireframe” o “approccio content-first”. Queste sono due tipiche ricerche effettuate da qualcuno nelle fasi iniziali del funnel, e per Balsamiq si tratta di un’opportunità per stabilire un primo punto di contatto con un potenziale cliente.Come puoi fare lo stesso → L’approccio di Balsamiq funziona a meraviglia se il tuo prodotto è progettato per utenti esperti o che hanno una particolare abilità. Fornendo dei corsi completi puoi aiutare i principianti ad imparare le specifiche abilità che possono usare per ottenere valore dal tuo prodotto, formando al contempo delle figure esperte nel settore in cui operi. Anche noi utilizziamo un approccio simile con dei corsi gratuiti nella nostra Ahrefs Academy.Lettura consigliata: 7 Esempi di Content Marketing a cui Ispirarsi (e Come Replicarli)15 consigli di content marketing dagli esperti che puoi utilizzare quest’annoNon esiste un modo universale per fare content marketing, e abbiamo quindi pensato che fosse una buona idea quella di chiudere questa guida con una selezione di persone che fanno del content marketing il loro pane quotidiano.Abbiamo chiesto ad alcuni esperti provenienti da differenti settori di rispondere alla seguente domanda: “In base alla tua esperienza, qual è quella SINGOLA cosa che consigli di fare a marketers ed aziende per avere una strategia di content marketing eccezionale l’anno prossimo?” Noterai come alcuni dei consigli si contraddicono l’un l’altro—ed è proprio questo il bello del content marketing: puoi seguire strade completamente diverse e comunque avere successo perchè dipende tutto da cosa funziona per il tuo pubblico.Ecco le persone a cui abbiamo chiesto consiglio: Al Chen, Solutions Architect, Coda Lauren Hall, Brand Marketing Associate, Privy Tom Cox, Content Marketer, Preply Joei Chan, Content Director, 360Learning Olivia Blazevic, Content Marketing Manager, Candlefox Aazar Ali Shad, Head of Growth, Userpilot Fio Dossetto, che ha scritto l’articolo che stai leggendo Alina Benny, Content Lead, Nextiva Tracey Wallace, Director of Marketing, MarketerHire Hiba Amin, Marketing Manager, Soapbox Tim Soulo, CMO, Ahrefs Stephanie Bregman, CMO, Manly Bands Fadeke Adegbuyi, Senior Content Marketing Manager, Doist Louis Grenier, Founder, EveryoneHatesMarketers Len Markidan, Chief Marketing Officer, PodiaConduci delle ricerche e parla con i tuoi clientiPrima di lavorare su qualsiasi contenuto, conduci delle ricerche con l’aiuto dei tuoi cliente/utenti attuali, o con quelli potenziali. Avrai modo di ottenere delle informazioni sul profilo ideale del tuo cliente (ICP, ideal customer profile, in inglese) e che problema il tuo pubblico di riferimento crede che il tuo prodotto o servizio risolva.Quando inizi a creare dei contenuti, utilizza le parole e le frasi che il tuo ICP ha utilizzato durante il processo di ricerca. Puoi chiaramente alterarli un po’ conducendo una ricerca all’interno del Keyword Explorer di Ahrefs per assicurarti che le parole chiave scelte abbiano dei buoni volumi di ricerca, o verificare se ce ne siano altre da includere. Nulla è meglio dei risultati ottenuti dal parlare con i clienti in modo da creare contenuti che risuonino con loro.Al Chen, Solutions Architect CodaRiproponi i tuoi contenutiDovresti sempre valutare nuove e creative possibilità per riproporre i contenuti che hai già a disposizione. Ricorda: le persone sono pigre. Più facile rendi per loro il consumo dei tuoi contenuti, meglio è. Il che significa che la maniera in cui presenti le cose è molto importante. Hai modo di prendere le informazioni più preziose contenute nel tuo blog e trasformarle in un libro? Se hai un podcast, hai una guida ai migliori episodi per i nuovi ascoltatori? Non lasciare al tuo pubblico il compito di farsi strada fra i tuoi contenuti. L’esperto sei tu—e dovresti occuparti delle cose più complicate tu stesso.Lauren Hall, Brand Marketing Associate PrivyConcentrati sulle persone che hanno bisogno di te, ma non ne sono ancora consapevoliSpesso, noi creatori, ci concentriamo sul produrre contenuti attorno a ricerche con alti volumi, ignorando le parole chiave che le persone utilizzano per cercare prodotti come il nostro.Trova le parole chiave con l’aiuto del team PPC e facendo sessioni di brainstorming su tutti i bisogni che il tuo prodotto risolve. A Preply, offriamo delle lezioni private online con dei tutor: abbiamo quindi dei contenuti riguardo ai “corsi online d’inglese” che parlano anche di alcuni dei nostri concorrenti, in quanto non siamo l’unica piattaforma per imparare le lingue. Gli utenti vogliono infatti sentirsi liberi di valutare tutte le opzioni e operare le loro scelte, e abbiamo riscontrato che essere trasparenti porta più persone verso le nostre pagine prodotto.Lavora intelligentemente e non duramente. Vedrai poi i risultati del come un contenuto ‘eccezionale’ dovrebbe essere misurato: dai nuovi clienti e dall’impatto diretto sul proprio business.Tom Cox, Content Marketer PreplyProva ed esegui diversi formati, capendo quali funzionano meglio per i tuoi obiettiviIl mondo del marketing cambia velocemente, e i contenuti devono adattarsi costantemente. La crescita avviene in modo diverso quando ad esempio si passa da 0 a 1 rispetto a partire da una fase di scale-up per arrivare ad essere un unicorno (termini utilizzati per identificare alcuni tipi di aziende). I contenuti devono adattarsi al momento temporale in cui stai operando, e la strategia dietro di essi dovrebbe essere revisionata più volte l’anno.All’inizio di quest’anno, ero concentrato sull’ottenere traffico, lavorando su SEO e contenuti facenti parte della fase iniziale del funnel. Ho raggiunto questi obiettivi, ma mi sono creato un nuovo problema: le conversioni. Ora ho quindi un autore a tempo pieno per lavorare sui contenuti appartenenti alle fasi più basse del funnel, migliorando così le nostre email post vendita.Un altro esempio: pensavamo di aver trovato la ciliegina sulla torta con i webinar, in quanto stavano funzionando in maniera eccellente per la lead generation. Abbiamo quindi pensato che se li avessimo raddoppiati avremmo ottenuto il doppio dei risultati. Non ha funzionato. Abbiamo ottenuto rendimenti decrescenti.Si tratta solo di un modo molto lungo per dire: ogni volta che raggiungi un traguardo, crei nuove sfide, e hai bisogno di nuovi contenuti o strategie per risolverle.Joei Chan, Content Director 360LearningAppellati ai valori del tuo pubblico Costruire un brand degno di fiducia che riesca a connettersi con i consumatori sarà importantissimo nel 2021. Essere ‘esposti’ al tuo brand non è abbastanza — gli utenti vogliono qualcosa che vada oltre la soluzione al loro problema. Vogliono essere coinvolti con le aziende che condividono i loro stessi valori. Brand che si sono guadagnati la loro fiducia. L’affinità di brand cattura questa nuova idea del costruire un brand avendo dei promotori ‘coinvolti’, piuttosto che un pubblico passivo.Per rafforzare l’affinità di brand, stiamo esplorando l’idea di creare contenuti di forma lunga e attraente, che siano interessanti per il nostro pubblico di nicchia e i suoi valori, costruendo relazioni di valore. Si tratta di creare quei ‘super-fan’ che diventeranno portavoce per il tuo brand, costruendo per te una vera e propria community.Olivia Blazevic, Content Marketing Manager CandlefoxSfrutta i micro-formatiOra come ora, siamo spinti ad avere contenuti corti e dritti al punto. Il content marketing ruota tutto attorno al fornire ispirazione alle persone, dando loro valore: se il nostro scopo è quello di dare agli utenti valore quando ne hanno bisogno, e nel modo più rapido possibile, dobbiamo cominciare a pensare ai micro-contenuti. Meno è meglio certe volte.Pensa a come questo principio potrebbe essere applicato ai video: YouTube sta diventando un motore di ricerca, e sempre più persone lo utilizzano per cercare informazioni. Credo che ogni articolo di blog dovrebbe essere trasformato in un breve e conciso video.Aazar Ali Shad, Head of Growth UserpilotNon fare affidamento solo sulle tatticheLe tattiche relative al content marketing e i relativi formati utilizzati variano, i canali vanno e vengono, ma ci sono alcune cose che non cambiano mai—e sono proprio quelle su cui dovresti concentrarti. Segui questi 3 passi:Comincia da una fase di diagnosi, dove comprendi a chi ti stai rivolgendo, che problemi stai cercando di risolvere per questo pubblico attraverso i tuoi contenuti e definisci le sfide e le opportunità con cui ti troverai faccia a facciaContinua con una fase strategica, dove definisci l’approccio che andrai ad utilizzare con il tuo pubblicoTermina con le specifiche tattiche che utilizzerai per portare al termine la tua strategia. Queste potrebbero essere diverse nel 2021 rispetto a quelle utilizzare nel 2015, come “dovremmo concentrarci sulla SEO e i contenuti lunghi” o “dovremmo fare delle storie su Instagram”La diagnosi precede la strategia, la quale precede le tattiche utilizzate. Troppo spesso i marketer saltano a piedi dritti nelle tattiche (…perché è divertente), a discapito però delle due fasi precedenti—e con un colpo di fortuna, potrebbero anche esserci dei successi temporanei, ma non si tratta sicuramente di un modo ripetibile e affidabile per creare contenuti che durino nel tempo ed abbiano un forte impatto.Fio Dossetto, who also wrote the article you’re readingOttimizza i contenuti esistentiNon abbiamo bisogno di nuovi contenuti. Se senti qualcuno dire che servono più blog, più landing page e una “regolare pubblicazione” in modo da poter sovrastare i tuoi concorrenti, SCAPPA!Ecco i due punti chiave:Non puoi rispondere immediatamente con un si o un no per confermare o confutare una domanda del genere, apparentemente innocua. La maggior parte dei leader che chiede una cosa del genere, si trova o sotto pressione da parte dei dirigenti dell’azienda che vogliono intraprendere la guerra del traffico, oppure non hanno ancora scoperto che la forza della SEO è nel lungo termine.Dati. Ti servono dati sui contenuti meno performanti o opportunità lungimiranti. Cerca di avere un piano per quei contenuti di bassa qualità che hanno acquisito poche visita, link o coinvolgimento di qualche sorta.Una volta che il primo punto è stato discusso, ed il secondo implementato, è più semplice spiegare perchè preferire l’ottimizzazione ai nuovi contenuti. Ottimizzare e lucidare i vecchi contenuti è importante tanto quanto crearne di nuovi.Alina Benny, Content Lead NextivaUsa un approccio olistico L’elenco delle specifiche sui contenuti sono un’ottima risorsa per creare contenuti che si posizioneranno eccellentemente fornendo ai tuoi copywriter un punto di partenza (a nessuno piace cominciare con una pagina bianca). Nel 2021, il tuo reale pubblico diventerà ancora più importante — il che significa andare oltre gli elenchi. Pensa alla SEO a più ampio spettro, includendo una sitemap strategica, contenuti che supportino tale mappa, e modi non intrusivi per costruire un elenco di utenti e ottenere dati propri.La fine dei cookie di terze parti è vicina, e quelli che investono ora fortemente nella SEO ed in nuovi approcci e tattiche legate ai contenuti (inclusa la creazione di contatti) saranno meglio preparati al regno dei dati di prima parte, nel quale ci troveremo catapultati nel 2022, quando Google Chrome smetterà di accettare cookie di terze parti.Tracey Wallace, Director of Marketing MarketerHireCrea prodotti incentrati sui contenutiTrova un modo per trasformare i tuoi prodotti in contenuti azionabili. Non solo questi hanno l’opportunità di catture molte parole chiave a coda lunga, ma funzionano benissimo come punti di conversione.Ad esempio, a Soapbox, uno dei valori aggiunti del nostro prodotto risiede nella nostra enorme libreria di schemi per agende. Per nostra fortuna, le persone che cercano questa tipologia di schemi hanno maggiori possibilità di essere convertiti in utenti sia con il piano gratuito che con quello a pagamento. Abbiamo quindi creato degli schemi di agende incentrate sulla ricerca organica, in modo da permetterci di posizionarci per un ampio ventaglio di parole chiave a coda lunga che portino traffico di alta qualità verso il nostro sito. Abbiamo anche replicato l’esperienza con un’altra libreria.Per farla breve, il mio consiglio è quello di identificare i punti più importanti e di valore del tuo prodotto, in modo da trasformarli e distribuirli sotto forma di contenuti.Hiba Amin, Marketing Manager SoapboxConsiglio per chi scrive contenuti: agisci come un giornalista Il mio consiglio è: agisci come un giornalista. I giornalisti infatti provano a raccogliere informazioni dalle persone che hanno un conoscienza un pò più profonda della tematica rispetto a loro, e spesso sperimentano. Alcuni sono capaci di mangiare da McDonald per un mese al solo fine di scrivere un articolo, o altri ancora si infiltrano nelle vite dei gruppi criminali e provano a vivere come loro. Non devi arrivare a quel punto, ma la cosa importante da capire è che i giornalisti che hanno vinto premi nella loro carriera sono quelli che vogliono creare lavori che aiutino e impressionino, e non semplicemente scrivere pezzi alla pari di tutto il resto dei giornalisti che scrivono la stessa cosa con parole diverse. Non agire come una persona che sta scrivendo degli articoli: sii come un giornalista che deve lavorare per produrre una storia che non sia solo delle lettere premute su di una tastiera.Tim Soulo, CMOTell your story consistentlyLe aziende devono avere un budget per i contenuti creativi e avere un approccio comprensivo su tutti i canali di marketing. Manly Band ha un intero team di creativi dietro il brand che aiuta a comunicare la nostra storia in maniera efficace attraverso ogni customer journey, indipendentemente se ci vedono sulla TV, Facebook, Google o attraverso un’email.Stephanie Bregman, CMO Manly BandsSviluppa empatia verso il tuo pubblicoScrivere con l’intento di ricerca in mente e al contempo inserire il tuo prodotto o servizio come soluzione è un atto di equilibrio.Prima di cominciare a scrivere un articolo, cerca di creare empatia verso il tuo lettore — pensa a che tipo di informazioni ha già a disposizione, cosa dovrebbe sapere e, infine, le informazioni da fornire per risolvere il suo problema. Usa Google (o un tool avanzato per la SEO come Ahrefs!) per vedere dove ti posizioni al momento per la parola chiave di tuo interesse, cercando di capire in che modo puoi rispondere alla domanda dell’utente Usa la ricerca di Twitter per trovare discussioni correlate ai tuoi termini di ricerca, e annota le domande e le preoccupazioni delle persone, includendo le risorse che condividono Usa Reddit per scoprire conversazioni rilevanti al tuo settore e comprendere di cosa una persona che ricerca un determinato argomento ha veramente bisognoQueste strategia aiutano i marketer a scavare a fondo quando si tratta di scrivere contenuti utili che convertano.Fadeke Adegbuyi, Senior Content Marketing Manager DoistCrea contenuti radicalmente differentiC’è sempre più confusione online, ne sei consapevole. Tutti “creano contenuti”. Come puoi far sì che i tuoi si distinguano? Sviluppa un’ossessione per il tuo “minimum viable market”. No, non devi fare marketing per tutti. Parla ai tuoi migliori clienti; quelli con cui ti piace lavorare maggiormente e che ti portano la maggior parte dei profitti. Comprendi le loro specifiche sfide e problemi. Queste dovrebbero saltar fuori durante le vostre conversazioni. Cerca di essere specifico. È molto più semplice creare il miglior contenuto al mondo per una domanda particolarmente specifica. Abbraccia la tua unicità. Cerca di capire che contenuti esistono già, crea un elenco degli argomenti trattati ma anche dei formati utilizzati, e del tono di voce… Questo rappresenta il tuo status quo. Rimuovi tutto quello che va contro gli scopi e i valori aziendali, tutto quello che ai tuoi clienti non piace e tutto ciò che non contribuisce a risolvere una specifica problematica. Aggiungi con attenzione qualcosa che vada contro lo status quo che hai identificato. Aggiungi qualcosa che aiuti il tuo “minimum viable market” a raggiungere i propri obiettivi in maniera un po’ più semplice, veloce e rapida. Prenditi dei rischi. Non puoi creare contenuti eccezionali senza rischiare. Vai a destra quando gli altri vanno a sinistra. Non prendere rischi è l’opzione più rischiosa. Se non lo fai, nessuno noterà i tuoi contenuti.Louis Grenier, Founder EveryoneHatesMarketersCorri dei rischiPrenditi dei grandi rischi. Per quanto futile possa sembrare, non c’è MAI stato un periodo migliore per provare qualcosa di nuovo. Nonostante negli anni più normali sia sufficiente adattarsi alle regole dei migliori contenuti presenti nel tuo settore, non esiste ancora nessuno che possa scrivere sul proprio curriculum “Ho lanciato con successo una campagna di content marketing man mano che il mercato è uscito dalla pandemia”…Non esiste un manuale delle istruzioni, usa quindi questa scusa per scrivere il tuo. Cerca di essere creativo su come informare, aiutare e compiacere il tuo mercato man mano che approcciamo la normalità. La tua proposta che fino all’anno scorso non aveva nessuna probabilità (“perché troppo rischiosa”) di essere ascoltata? Ora è il suo momento. Len Markidan, Chief Marketing Officer PodiaContinua ad imparareVuoi continuare ad imparare il content marketing? Siamo qui per te. Ecco alcune delle nostre risorse preferite che puoi leggere e guardare per continuare ad imparare:Come Creare una Strategia Vincente di Content Marketing in 9 PassiPerché il Content Marketing è Importante? 5 MotiviChe cos’è il content marketing B2B? 7 casi di successo5 Tipologie Vincenti di Content Marketing per Crescere il Tuo Business Strategia di Content Marketing per Ottenere Contatti e Vendite (guardalo su YouTube) Cos’è e Come Fare Content Marketing Che Spacca a Costi Contenuti (guardalo su YouTube)Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Content Marketing: una Guida Completa per il 2021"
    },
    {
      "level": "H2",
      "text": "Cos’è il content marketing?"
    },
    {
      "level": "H2",
      "text": "Perché il content marketing è importante?"
    },
    {
      "level": "H3",
      "text": "1. Il content marketing ti aiuta a creare consapevolezza e attrarre potenziali clienti"
    },
    {
      "level": "H3",
      "text": "2. Il content marketing ti aiuta a coinvolgere il tuo pubblico e costruire una reputazione"
    },
    {
      "level": "H3",
      "text": "3. Il content marketing ti aiuta a convertire i clienti"
    },
    {
      "level": "H3",
      "text": "4. Il content marketing ti aiuta a migliorare la fedeltà e il mantenimento"
    },
    {
      "level": "H3",
      "text": "5. Il content marketing offre un interesse composto (ed è economico nel lungo termine)"
    },
    {
      "level": "H2",
      "text": "3 obiezioni comuni fatte al content marketing, e come rispondere"
    },
    {
      "level": "H3",
      "text": "1. La pubblicità a pagamento attrae più traffico e clienti velocemente"
    },
    {
      "level": "H3",
      "text": "2. Ci vuole troppo tempo per vedere i risultati"
    },
    {
      "level": "H3",
      "text": "3. Il ROI è difficile da misurare"
    },
    {
      "level": "H2",
      "text": "Tipi di content marketing"
    },
    {
      "level": "H3",
      "text": "1. Trova argomenti rilevanti alla tua attività"
    },
    {
      "level": "H3",
      "text": "2. Crea le giuste tipologie di contenuti"
    },
    {
      "level": "H3",
      "text": "3. Promuovi i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "5 esempi di content marketing efficaci dai quali imparare"
    },
    {
      "level": "H3",
      "text": "1. I video Youtube di Fix.com"
    },
    {
      "level": "H3",
      "text": "2. La community Facebook di Naturalicious"
    },
    {
      "level": "H3",
      "text": "3. Il podcast 15Five"
    },
    {
      "level": "H3",
      "text": "4. Il foglio delle attività e la stanza dei giochi virtuale di Mattel"
    },
    {
      "level": "H3",
      "text": "5. I corsi all’interno dell’academy di Balsamiq"
    },
    {
      "level": "H2",
      "text": "15 consigli di content marketing dagli esperti che puoi utilizzare quest’anno"
    },
    {
      "level": "H3",
      "text": "Conduci delle ricerche e parla con i tuoi clienti"
    },
    {
      "level": "H3",
      "text": "Riproponi i tuoi contenuti"
    },
    {
      "level": "H3",
      "text": "Concentrati sulle persone che hanno bisogno di te, ma non ne sono ancora consapevoli"
    },
    {
      "level": "H3",
      "text": "Prova ed esegui diversi formati, capendo quali funzionano meglio per i tuoi obiettivi"
    },
    {
      "level": "H3",
      "text": "Appellati ai valori del tuo pubblico"
    },
    {
      "level": "H3",
      "text": "Sfrutta i micro-formati"
    },
    {
      "level": "H3",
      "text": "Non fare affidamento solo sulle tattiche"
    },
    {
      "level": "H3",
      "text": "Ottimizza i contenuti esistenti"
    },
    {
      "level": "H3",
      "text": "Usa un approccio olistico"
    },
    {
      "level": "H3",
      "text": "Crea prodotti incentrati sui contenuti"
    },
    {
      "level": "H3",
      "text": "Consiglio per chi scrive contenuti: agisci come un giornalista"
    },
    {
      "level": "H3",
      "text": "Tell your story consistently"
    },
    {
      "level": "H3",
      "text": "Sviluppa empatia verso il tuo pubblico"
    },
    {
      "level": "H3",
      "text": "Crea contenuti radicalmente differenti"
    },
    {
      "level": "H3",
      "text": "Corri dei rischi"
    },
    {
      "level": "H2",
      "text": "Continua ad imparare"
    }
  ],
  "author": "Fio Dossetto"
}