{
  "url": "https://ahrefs.com/blog/it/creare-una-go-to-market-strategy/",
  "slug": "creare-una-go-to-market-strategy",
  "title": "Come Creare una Go-To-Market Strategy in 8 Mosse",
  "description": "Una go-to-market strategy è un piano aziendale per lanciare un nuovo prodotto o servizio sul mercato.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti La maggior parte dei nuovi prodotti è destinata al fallimento—lo sappiamo tutti. Migliore è il modo in cui prepari te e il tuo prodotto al lancio, migliori sono le possibilità di sfuggire a questa triste statistica.La go-to-market strategy è il metodo che ti permette di lanciare un prodotto sul mercato e di apportare modifiche allo stesso prima che sia troppo tardi.In questo articolo, imparerai:Cos’è una go-to-market (GTM) strategyDifferenze fra una GTM strategy, una strategia di marketing e un business planL’importanza di avere una GTM strategyCome costruire una go-to-market strategyCos’è una go-to-market (GTM)Una go-to-market (GTM) strategy è un piano aziendale atto a lanciare un nuovo prodotto o servizio sul mercato. In breve, la GTM identifica il prodotto/servizio che offrirai, su quale mercato, a quale prezzo, in quale modo e, in genere, tutto ciò che è richiesto per il suo lancio.GTM strategy vs strategia di marketing vs business planQuesti termini vengono spesso utilizzati come sinonimi nonostante non rappresentino lo stesso concetto. Ecco un veloce confronto fra una go-to-market strategy, una strategia di marketing e un business plan:Perché avere una GTM strategy è importante?In un mondo ideale, senza competizione e frizioni esterne, potresti lanciare un prodotto con un clic e poi annunciarlo con un tweet. Tutti potrebbero conoscere il tuo prodotto e tutti vorrebbero comprarlo. Sfortunatamente le cose non stanno proprio così, quindi diamo uno sguardo al motivo per cui hai bisogno di una GTM strategy.1. Imposta la tua strategia per la crescitaImpostare la tua strategia per la crescita significa che devi identificare i migliori scenari per il lancio del tuo prodotto e comprendere come sfruttare le opportunità che ti si presentano.Quando sviluppi la tua go-to-market strategy, devi accertarti che:Il prodotto risolva i problemi della tua audience principale.Esista domanda per il tuo prodotto e possibilmente ci sia ancora più domanda in futuro.I tuoi clienti siano capaci di comprendere il valore del tuo prodotto (e che siano in grado di poterlo acquistare).I profitti derivanti dal prodotto consentano alla tua azienda di crescere.La tua azienda non stia entrando in un mercato eccessivamente saturo.Il tuo prodotto abbia dei chiari punti di differenziazione e vantaggi rispetto alla concorrenza.L’azienda sia pronta a sostenere una crescita sul piano operativo (o almeno avere un piano di scalabilità).2. Limitare i rischiAl contrario, se devi limitare i rischi con la go-to-market strategy, dovrai identificare i peggiori scenari e comprendere come evitarli.Quali sono i rischi?Se il lancio del tuo prodotto è un flop, potrebbe essere difficile recuperare terreno per il tuo prodotto o brand, in quanto delle cattive recensioni potrebbero influire negativamente sul tuo prodotto o brand. Anche se questa evenienza potrebbe non danneggiare giganti come Microsoft e Apple, la maggior parte delle aziende non ha budget illimitati.3. Allineare tutta l’azienda sul lancio del prodottoPreparare il lancio di un prodotto è spesso un processo che si perde fra tutte le operazioni che un’azienda deve compiere ogni giorno. Qual è il momento migliore, se non quello di un lancio, per allineare tutti i dipartimenti di un’azienda? Non esistono altri modi per gestire le aspettative di un lancio.Allineare l’azienda significa mettere tutti a conoscenza del lancio del prodotto, in modo che tutti siano pronti a premere il grande bottone rosso con su scritto “start”.In questo modo si possono evitare i classici problemi come ad esempio: “il reparto marketing non ci ha fornito il materiale” o “il reparto commerciale non aveva idea di cosa stesse vendendo”, o ancor peggio, avere gli addetti al servizio clienti che cercano disperatamente risposte all’interno dell’azienda. Non ci saranno più drammi.4. Valutare e mettere in sicurezza le risorsePrima ancora di contemplare il lancio di qualsiasi prodotto o servizio, devi assicurarti di avere abbastanza tempo e denaro per supportare le tue tattiche. Una go-to-market strategy garantisce tutto questo in maniera formale.Come costruire una go to market strategyNon puoi prevedere tutto. Nessuno può. Ma ci sono molti fattori che puoi prevedere e dei quali puoi modificare gli esiti quando lanci un prodotto. Quindi, invece che reinventare tutto il processo, diamo uno sguardo a come creare una go-to-market strategy attorno a dei principi conosciuti, passo dopo passo.Identifica il tuo mercato (e anche i tuoi competitor)Identifica i tuoi clientiDefinisci il posizionamento ed il prezzo del prodottoDefinisci il messaggio attorno al prodotto e le tattiche di marketing principaliDefinisci la distribuzione del prodottoSincronizza il reparto marketing, il reparto commerciale e il supporto clientiDetermina il budget, l’arco temporale e le risorse necessarieDefinisci le metriche per misurare il tasso di successo1. Identifica il tuo mercato (e anche i tuoi competitor)Una ricerca di mercato è un buon punto di partenza. Prima riesci a farla, meglio è. Ad ogni modo, si tratta di un processo davvero importante che richiede molte risorse. Abbiamo scritto un altro articolo che tratta l’argomento.Ti riporto un paio di punti chiave da quell’articolo così da poterti permettere di andare avanti.Per prima cosa, il 90% della possibilità di successo dipende dall’avere in mano i dati giusti. Devi raccogliere e analizzare i dati della ricerca primaria (quella svolta da te) e secondaria (quella svolta da altri e disponibile a te per consultazione). La ricerca secondaria include report di mercato, statistiche di mercato, whitepapers, ecc… ed è il modo meno costoso (relativamente) e più veloce per ottenere dati sul tuo mercato.Ad esempio, se sei all’interno del settore della stampa 3D, dovresti mettere le mani sul Wohlers Report, che fornisce “un’analisi condotta a livello mondiale della produzione additiva (o AM, dall’inglese “additive manufacturing”) e di stampanti 3D”. Wohler’s Report—un esempio di ricerca di mercato secondaria per il mercato della stampa 3D.Questi report offrono una prospettiva ad ampio spettro sul mercato e una panoramica dell’ambiente circostante nel quale ti trovi.In secondo luogo, nessuna ricerca di mercato è completa senza un’analisi dei competitor. Davvero, si tratta di un fattore essenziale. Un’analisi dei competitor ti dice quello che i competitor stanno facendo e ti indica se si stanno muovendo correttamente o no, o se proprio non si stanno muovendo. Ecco una guida per aiutarti a condurne una.Alla fine della tua analisi competitiva, dovresti essere in grado di condurre un’analisi di tipo SWOT.Ecco un esempio di analisi SWOT per un tool immaginario di email marketing:Oltre ai metodi e alle tipologie di ricerche di mercato menzionate qui sopra, ti incoraggio a trarre delle deduzioni anche della ricerca primaria. Condurre una ricerca primaria può portare a intuizioni uniche e aiutarti a comprendere dove si trova la parte di mercato inesplorata e dall’alto potenziale. Per fare questo, devi lavorare con questionari, sondaggi e focus group.Per identificare i punti chiave di una ricerca di mercato, prendi ad esempio la tabella qui sotto. L’abbiamo riempita con dei dati fittizi per il settore della stampa 3D. Puoi riempirla con i dati provenienti dalla tua ricerca, in questo modo sarai pronto per il passo successivo: il processo della GTM.2. Identifica i tuoi clientiUna volta che ti sei fatto un’idea del mercato nel quale ti trovi, puoi ora muoverti un “gradino più in basso” e cercare di comprendere chi saranno i tuoi clienti.A seconda delle tue risorse, ci sono due modi in cui puoi identificare i tuoi clienti: Il metodo scientifico. Parla con i potenziali clienti (in base alla ricerca condotta in precedenza). Questi potrebbero essere i tuoi lead, i follower sui social media o semplicemente le persone che sai potrebbero essere interessate al tuo prodotto. Potresti anche utilizzare servizi come SurveyMonkey, UserTesting, o Remesh per raggiungere queste persone. L’ipotesi ragionata. Se non puoi parlare direttamente ai potenziali clienti, devi essere creativo. Il trucco consiste nell’utilizzare i dati dei tuoi competitor e “arricchirli” con altre fonti. Ad esempio, il tuo competitor potrebbe pubblicare un case study citando un cliente che puoi identificare su LinkedIn. Puoi anche cercare i dati di settore in base al ruolo che quella persona ricopre all’interno dell’azienda. Potresti scoprire, ad esempio, che la ricerca organica è la sua priorità numero 1 in termini di spesa, secondo un questionario condotto sui CMO.Tipicamente, quello che dovresti ottenere da questo passaggio è una buyer persona—una persona immaginaria creata da te che rappresenti le caratteristiche comuni ai tuoi clienti (un archetipo). Sappi che il tuo mercato di riferimento potrebbe avere diverse buyer persona.Ecco un esempio di quella che potrebbe essere una buyer persona per Ahrefs:Una buyer persona ti aiuta a visualizzare il buyer journey, comprendere meglio i tuoi potenziali clienti, e enfatizzare le loro sfide e i loro obiettivi.Puoi utilizzare la buyer persona come aiuto per organizzare e comunicare i punti chiave riguardo i tuoi potenziali clienti. Se stai cercando più informazioni su questo argomento, ecco una guida dettagliata su come creare una buyer persona.Se ti trovi in un contesto B2B, vale la pena mappare anche il processo decisionale all’interno della tipologia di azienda che rappresenta il tuo cliente. Questo prende il nome di buying center e ti aiuta a determinare verso chi dirigere il tuo prodotto o servizio quando fai marketing. Initiator: chi inizia il processo di acquisto User: il reale utilizzatore finale del prodotto Influencer: convince altri della bontà del prodotto Decider: approva l’acquisto Buyer: possiede il budget Approver: reparto di management che amplia la portata dell’iniziativa Gatekeeper: controlla il flusso di informazioniAd esempio, poniamo caso che il tuo pubblico siano le agenzie SEO. Il buying center potrebbe essere molto simile a questo: Initiator: SEO manager senior User: SEO manager, content marketing manager, SEO analyst Influencer: direttore del content marketing Decider: head of SEO. Buyer: operations specialist Approver: CEO Gatekeeper: operations specialist3. Definisci il posizionamento ed il prezzo del prodottoIl posizionamento del prodotto ed il relativo prezzo costituiscono la base del modo in cui il mercato percepisce il tuo prodotto. Se sviluppati correttamente, lavorano in sincronia per migliorare l’adozione del tuo prodotto. Posizionamento del prodottoIl posizionamento è un concetto evergreen nel marketing. Si tratta di un termine coniato verso la fine degli anni ‘60 da Jack Trout e, successivamente, discusso all’interno del libro bestseller da lui scritto insieme a AI Ries, “Positioning: The Battle for Your Mind”.Secondo Trout e Ries, per posizionare un prodotto (o brand) devi assicurarti che i consumatori possano associare immediatamente quel prodotto a uno specifico beneficio o un piccolo set di benefici.Perché solo uno o un piccolo insieme di benefici? Perché all’interno della nostra “rumorosa” società, i prodotti e i brand hanno bisogno di messaggi particolarmente semplificati per risaltare.Diamo uno sguardo a qualche esempio di posizionamento. Questo è probabilmente uno degli esempi più spettacolari e famosi di sempre—da parte della Avis, azienda di noleggio auto:Fonte: Businessinsider.comQuando fu pubblicato questo annuncio, Avis era il numero #2 nel settore dei noleggi auto. Avis ha usato questo aspetto negativo a suo vantaggio.Slack è un altro buon esempio di posizionamento di prodotto…Sin dall’inizio, Slack ha posizionato il suo prodotto come un tool anti-email proponendo questo angolo narrativo in ogni occasione:Fonte: cmo.com.auQuesto è il posizionamento descritto in breve. Non si tratta di creare qualcosa di nuovo o differente; si tratta di manipolare quello che il prospect ha già in mente. Il tool più utile quando sviluppi il tuo posizionamento è la mappa percettiva (chiamata anche mappa del posizionamento). Una mappa percettiva illustra il posizionamento dei prodotti (o dei brand) all’interno della mente dei clienti.Per crearne una, devi identificare i giusti attributi (chiamati dimensioni) che definiscono lo spazio all’interno del quale si trova il prodotto, e posizionare poi i prodotti all’interno di quello spazio.Il miglior modo possibile per creare una mappa percettiva (in maniera scientifica) è analizzare i fattori che impattano sulle decisioni di acquisto dei clienti e chiedere ad un campione di prospect di valutare i prodotti in base a questi fattori. Solitamente potrai posizionare tutto in una mappa bidimensionale.Fonte: edenkleiman.comNestlé ha commissionato la mappa percettiva qui sopra per aiutarsi a commercializzare una nuova barretta di cioccolato sul mercato (case study). La mappa mostra il modo in cui i consumatori percepiscono la concorrenza fra i vari cioccolatini in Nuova Zelanda. Ad esempio, in questo caso, la barretta al cioccolato fondente di Lindt al peperoncino è stata etichettata come una scelta esotica e da adulti mentre, la Milkybar, come una scelta più tradizionale per un’audience più giovane. Quando posizioni un prodotto, assicurati di avere questi requisiti: Il tuo cliente ideale ha a cuore il tuo posizionamento. Non può essere un qualcosa di unico ma non pertinente. Altrimenti non funzionerebbe. La tua azienda è decisa ad evidenziare le caratteristiche del prodotto per quel posizionamento. Su cosa si baserà il tuo posizionamento, il tuo vantaggio competitivo, il motivo per cui i clienti dovrebbero crederti e le giuste caratteristiche che deve avere il tuo prodotto? I competitor non lo stanno sfruttando pienamente. Ma tu sì.PrezzoIl prezzo del prodotto dovrebbe essere funzionale al tuo posizionamento. Se vuoi che i consumatori ti vedano come una scelta abbordabile, il tuo prezzo dovrebbe riflettersi su tale scelta. Chiaramente un nuovo prodotto deve essere prima di tutto profittevole per l’azienda (a meno che tu non stia facendo uno stunt fuori di testa per massacrare i competitor). Se vuoi approfondire l’aspetto di profittabilità correlata al pricing, leggi questo articolo. Per ora concentriamoci sull’aspetto del prezzo collegato al marketing.Un utile esercizio per aiutarti a determinare il prezzo giusto è identificare dove il tuo prodotto si trova in relazione a prezzo e benefici (guarda la tabella qui sotto). Mentre lo fai, puoi anche mappare i tuoi competitor. Generalmente, le strategie vincenti sono quelle in verde.4. Definisci il messaggio del prodotto e il focus del marketingOra è giunto il momento di capire cosa comunicare ai potenziali clienti e quali tattiche e canali utilizzare. Messaggio del prodottoIl messaggio comunicato dal prodotto cattura l’attenzione del tuo pubblico di riferimento e lo educa.Dal punto di vista operativo, il messaggio del prodotto è il centro strategico della tua comunicazione con i clienti. È la matrice di ogni messaggio che sarà creato per il tuo pubblico, che si tratti di un singolo annuncio digitale, un messaggio in una campagna di PR, del training riguardo il prodotto o dei contenuti sulle pagine web.Qui sotto troverai un esempio di framework da utilizzare nella creazione di un messaggio per il tuo prodotto riempito con i dati del nostro. Sentiti libero di utilizzarlo e, se necessario, moltiplicarlo per il numero di buyer persona a tua disposizione.Per massimizzare l’efficacia del documento, dovresti ottenere una revisione anche dal reparto vendite, dal reparto sviluppo e anche da quello legale.PRO TIPQuando fai questa attività, concentrati su ciò che ti rende unico, cerca di essere conciso e diretto e assicurati di non cercare di adattare il messaggio a tutti.Tattiche di marketing principali“Se lo crei, i clienti verrano da soli”.Io non ci conterei.I mercati sono pieni zeppi di soluzioni per praticamente tutti i consumatori, e i consumatori sono spesso sovraccaricati di informazioni. Devi avere un fattore che ti permetta di emergere—ed è qui che le tattiche di marketing entrano in gioco.Le tattiche di marketing sono delle attività che possono aiutarti a raggiungere i tuoi obiettivi di marketing. Sono dei mezzi per ottenere un fine.Per quanto mi riguarda, ci sono due strade che puoi percorrere quando sviluppi le tue tattiche di marketing: Copia gli altri. Scopri quello che fanno le aziende simili alla tua per lanciare il loro prodotti, o prendi ispirazione da aziende/marketer che ammiri. Guarda i risultati che hanno ottenuto e quello che hanno dovuto investire per arrivare lì. Poi stravolgi, migliora e utilizza tutto a tuo vantaggio. Sii creativo e sviluppa qualcosa di personale e unico.Parliamo ora del primo approccio: copiare gli altri.Prima di tutto, non deve esserci vergogna nel copiare gli altri. Prendi il content marketing come esempio. Chi è stato il primo? Michelin? John Deere? Nessuno lo sà, e a nessuno importa. Quello di cui si preoccupano le persone è solo se funziona o meno.Al giorno d’oggi, migliaia di aziende utilizzano il content marketing, inclusi noi. Questa discussione su Twitter spiega la posizione di Ahrefs rispetto al content marketing:Let’s talk about the “ROI of Content Marketing.”Far too often us marketers get challenged with this question by our boss (or our client):- How do I know that my investment in content will guarantee a positive return? …& how can I *MEASURE* it? [Read more..]— Tim Soulo 🇺🇦 (@timsoulo) March 23, 2021 Parliamo del ROI del Content Marketing.; Troppo spesso noi marketer veniamo sfidati dal nostro capo (o cliente) con questa domanda: Come posso sapere che il mio investimento sui contenuti mi garantirà un ritorno certo? …come posso MISURARLO?Puoi copiare (o “rubare”):Canali usati per la promozioneTool utilizzati per il marketingFormati degli annunciMateriale di marketingTipologie di contenutiLayout dei siti web (ma non dai tuoi competitor diretti)Tattiche SEONon dovresti probabilmente copiare:Copywriting creativo (titoli, copy degli annunci, slogan ecc.)Loghi e altri elementi che appartengono all’identità del brandValue propositionOra parliamo della seconda opzione: essere creativi.Essere creativi significa saper guardare da diverse prospettive, pensando in modi alternativi.Abbiamo parlato di alcune tattiche creative di marketing qui e qui.Se vuoi inventarti delle nuove tattiche da zero, prova a guardare le cose da una prospettiva diversa.Per farlo, devi darti degli obiettivi—dei numeri approssimativi vanno bene in questo caso—e decodificare un modo per raggiungerli.Ad esempio, poniamo il caso che tu voglia convertire 2,000 clienti nei due anni successivi al lancio del prodotto. Prima che questo accada, quali requisiti devi raggiungere? In che modo potrai ottenere quei 2,000 clienti? In altre parole:Cosa devono scoprire e sperimentare del tuo prodotto per far sì che lo acquistino?Dove possono scoprire l’esistenza del tuo prodotto e provarlo?Da dove provengono i clienti e qual è la prima cosa che dovrebbero sapere?Quante persone devi raggiungere per convertire i 2,000 che ti sei dato come obiettivo?Ulteriori approfondimenti16 Tattiche di Marketing che Funzionano nel 202110 Tattiche Di Lead Generation Che Funzionano (Con Esempi)5. Definisci la distribuzione del prodottoLa distribuzione è il processo che consiste nel rendere disponibile un bene o un servizio al consumatore.Per non complicare le cose, possiamo segmentare i canali di distribuzione in base alla tipologia di prodotto: digitale o fisico.Prodotti digitali Proprietario/diretto. Puoi acquistare il tuo software solamente dal tuo sito. Puoi controllare l’intera esperienza e non devi pagare terze parti (eccetto per il gateway di pagamento). Questo è probabilmente il modello più comunemente utilizzato. App store e marketplace. Il tuo software è disponibile solo (o principalmente) attraverso dei servizi di terze parti come l’App Store di Apple o la piattaforma di integrazione utilizzata, come il marketplace Atlassian. Le commissioni dipendono dalla piattaforma, dal 5% per il primo anno fino al 30% del fatturato totale in seguito. Programmi partner. Paghi una commissione (o fornisci altri benefit) ai partner che promuovono la tua azienda (affiliate marketing) o agisci come servizio partner (Xero a quanto pare ottiene il 50% degli introiti dai programmi partner). Questo è solitamente un canale ausiliario. OEM. Il tuo prodotto è utilizzato in un altro prodotto. Ad esempio, Amazon AWS fa da backend per molti servizi conosciuti, incluso Netflix.Prodotti fisici Distribuzione diretta. Vendi direttamente ai clienti, online o nei negozi fisici. Tutti gli introiti sono tuoi e hai un contatto diretto con i clienti. Al contrario dei prodotti digitali, i produttori di hardware raramente si affidano a questo come canale principale. Solitamente infatti utilizzano un mix composto da diversi canali. Distribuzione (intensiva) di massa.Offri i tuoi prodotti in più posti possibili. Puoi aspettarti che un distributore trattenga fino al 40% dei proventi. Distribuzione selettiva. Il tuo prodotto è venduto solo in negozi selezionati—solitamente quelli specializzati nella tua nicchia possono offrire un valore aggiunto, come ad esempio un supporto clienti di alta qualità. Distribuzione esclusiva. Puoi firmare un’esclusiva con uno o due partner che hanno il diritto esclusivo di vendere il tuo prodotto in una particolare zona (solitamente questo significa escludere da quei luoghi anche le vendite dirette). OEM. Il tuo prodotto è utilizzato in un altro prodotto. Pensa al “Intel Inside” e Windows preinstallati sulla maggior parte dei PC.Come puoi vedere, l’architettura del tuo prodotto solitamente ne definisce anche la distribuzione. Ad esempio, le app create per specifiche piattaforme, hanno solo un modo per essere distribuite, mentre solitamente i prodotti di tipo SaaS hanno una distribuzione diretta.Un altro fattore che può determinare la tua distribuzione è il mercato stesso, come ad esempio le abitudini dei consumatori e la tua concorrenza. Se tutti sul mercato sfruttano un modello di distribuzione basato sulle terze parti, sarà complicato penetrare il mercato facendo esclusivamente affidamento sulle vendite dirette. E sì, questo vale anche per Apple:Fonte: 9to5mac.comDetto questo, la maggior parte delle volte avrai modo di sperimentare e utilizzare diversi modelli. Come nel caso di Xero, nel quale il prodotto viene distribuito sia in maniera diretta che attraverso degli intermediari. O puoi anche mixare la distribuzione di massa con l’OEM, come fa Intel con i suoi processori.In ogni caso, considera i costi e i benefici di ogni modello di distribuzione quando lo scegli. Ogni scenario di distribuzione indiretta porterà via una fetta di fatturato, ma potrebbe aumentarlo sul lungo termine, offrendo il prodotto a più persone.6. Sincronizza marketing, reparto commerciale e team di supportoMan mano che ci avviciniamo alla fine del processo di creazione di una go-to-market strategy, noterai che la parte più complessa è già passata. Tutto quello che discuteremo da adesso in poi dipenderà più da fattori esterni che interni.Prima di tutto, devi allineare il reparto marketing, vendite e supporto clienti per il lancio del prodotto.Dato che ogni organizzazione è differente, non ti darò dei consigli specifici. Invece, mi piacerebbe offrirti alcuni spunti che hanno funzionato per me quando ho lanciato nuovi prodotti o funzionalità importanti: Lavora il più possibile con gli altri dipartimenti. Questo è fondamentale quando sviluppi una GTM strategy (in ogni parte del processo). Fai delle interviste interne (ma non in maniera formale) e parla con le persone per ottenere spunti e idee. Raccogli i requisiti degli altri dipartimenti. Chiedi al resto del team di cosa hanno bisogno per supportare il lancio del prodotto. Crea la “fonte di verità”. Questa è la documentazione fondamentale che serve da risorsa a cui fare riferimento per ogni funzionalità futura del prodotto. Alcuni esempi includono comunicati stampa, manuali del prodotto (o un manuale online), tabelle relative ai prezzi, linee guida per la comunicazione e FAQ.7. Determina il budget, l’arco temporale e le risorse necessarieLanciare un prodotto sul mercato richiede tempo, risorse e budget. Devi definire questi tre aspetti in anticipo se vuoi essere pronto a lanciare il tuo prodotto sul mercato senza andare in bancarotta o senza dover perseguire strategie che ti richiederanno risorse che non hai.È meglio svolgere queste attività insieme ad altri dipartimenti, specialmente quelli strategici.Se stai lavorando con un budget fisso, allocare tempo e risorse è un processo piuttosto immediato. Dividi il budget fra le strategie di marketing e dividi le strategie fra i vari membri del team per assicurarsi che tutto venga eseguito in tempo.Se hai maggiore flessibilità in queste tre aree, avrai bisogno di fare delle stime in modo da partire con il progetto. Ecco alcune opzioni: Utilizza i dati dei progetti simili. Ad esempio, il budget dalle strategie GTM precedenti. Utilizza delle variabili conosciute. Ad esempio, potresti prendere il tuo CAC e moltiplicarlo per il numero di clienti che ti aspetti di attrarre nel corso del primo anno. Elenca quello di cui hai bisogno e sommalo. Il trucco è quello di essere il più specifici possibile quando si stimano i diversi elementi di budget, tempo e risorse. Fortunatamente, esistono degli strumenti che ci vengono incontro: Google Sheets o Excel, template già pronti all’uso all’interno dei tool di project management (come Monday.com) e calcolatori online come Eastimate o Simplestimate. Calcola una media per avere un pò di margine. Si chiama metodo di stima a tre punti. Prendi tre diverse stime e calcola una media. Le tue tre stime possono essere: uno scenario ottimistico, uno conservativo e uno pessimistico. Lo scenario conservativo potrebbe essere calcolato con uno dei metodi qui sopra. Gli altri scenari saranno invece modifiche accuratamente pensate dello scenario conservativo.8. Definisci le metriche per misurare il tasso di successoLe tue metriche di successo collegano fra di loro i tuoi obiettivi e quello che la tua azienda può controllare e misurare per raggiungere i tuoi obiettivi. Esistono due linee di pensiero che puoi prendere in considerazione quando definisci le metriche per la tua go-to-market strategy.La prima linea di pensiero suggerisce di misurare le metriche principali attraverso tutto il customer journey per avere più dettagli e controllo possibili.Ad esempio, potresti basare le tue metriche di successo sul modello del volano. In questo modello, misuri le tre fasi principali del customer journey: attrarre, interagire e nutrire. La crescita avviene come “prodotto di scarto” ottenuto dalla ottimizzazione di queste tre metriche. Questo è il modo in cui HubSpot è cresciuta come azienda (dopo aver abbandonato il vecchio modello del più classico funnel), e anche il modo in cui Jeff Bezos ha delineato la strategia di crescita per Amazon.La seconda linea di pensiero è quella di tracciare solo una o poche metriche “realmente utili”. Alcuni esempi includono le conversioni (o vendite), crescita del fatturato, e il Net Promoted Score (NPS).Se, in ogni caso, senti di aver bisogno di una soluzione personalizzata per la tua GTM strategy, ecco una guida su come sviluppare le tue metriche di successo.Lettura consigliata: 25 Metriche di Marketing che Dovresti TracciareConclusioneCreare una go-to-market strategy richiede molto lavoro e capacità. Ad ogni modo, non esiste modo migliore per rendere più sicuro il lancio di un prodotto. Direi che è addirittura meglio avere una strategia GTM che è solamente “okay” piuttosto che non averne una.Mantieni la calma e prosegui con la tua strategia GTM. Quando avrai svolto tutti i passaggi, avrai uno strumento in grado di aumentare le possibilità di successo del tuo lancio, e che consentirà a te e al tuo team di dormire sereni durante le fasi più stressanti del lancio.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "Come Creare una Go-To-Market Strategy in 8 Mosse"
    },
    {
      "level": "H2",
      "text": "Cos’è una go-to-market (GTM)"
    },
    {
      "level": "H2",
      "text": "GTM strategy vs strategia di marketing vs business plan"
    },
    {
      "level": "H2",
      "text": "Perché avere una GTM strategy è importante?"
    },
    {
      "level": "H3",
      "text": "1. Imposta la tua strategia per la crescita"
    },
    {
      "level": "H3",
      "text": "2. Limitare i rischi"
    },
    {
      "level": "H3",
      "text": "3. Allineare tutta l’azienda sul lancio del prodotto"
    },
    {
      "level": "H3",
      "text": "4. Valutare e mettere in sicurezza le risorse"
    },
    {
      "level": "H2",
      "text": "Come costruire una go to market strategy"
    },
    {
      "level": "H3",
      "text": "1. Identifica il tuo mercato (e anche i tuoi competitor)"
    },
    {
      "level": "H3",
      "text": "2. Identifica i tuoi clienti"
    },
    {
      "level": "H3",
      "text": "3. Definisci il posizionamento ed il prezzo del prodotto"
    },
    {
      "level": "H4",
      "text": "Posizionamento del prodotto"
    },
    {
      "level": "H4",
      "text": "Prezzo"
    },
    {
      "level": "H3",
      "text": "4. Definisci il messaggio del prodotto e il focus del marketing"
    },
    {
      "level": "H4",
      "text": "Messaggio del prodotto"
    },
    {
      "level": "H4",
      "text": "Tattiche di marketing principali"
    },
    {
      "level": "H3",
      "text": "5. Definisci la distribuzione del prodotto"
    },
    {
      "level": "H4",
      "text": "Prodotti digitali"
    },
    {
      "level": "H4",
      "text": "Prodotti fisici"
    },
    {
      "level": "H3",
      "text": "6. Sincronizza marketing, reparto commerciale e team di supporto"
    },
    {
      "level": "H3",
      "text": "7. Determina il budget, l’arco temporale e le risorse necessarie"
    },
    {
      "level": "H3",
      "text": "8. Definisci le metriche per misurare il tasso di successo"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Mateusz Makosiewicz"
}