{
  "url": "https://ahrefs.com/blog/it/eat-seo/",
  "slug": "eat-seo",
  "title": "Che cos’è E‑A-T? Perché è importante per la SEO",
  "description": "E-A-T è un acronimo per definire competenza, autorevolezza ed affidabilità. Alcuni dicono sia un fattore di posizionamento, ma è davvero così?",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Tutti hanno iniziato a parlare di E‑A-T da Agosto del 2018, e da allora è menzionato in centinaia di articoli.Alcuni di questi articoli ci stanno dicendo che è un importante fattore di ranking……mentre altri ci dicono che non lo è:Quindi dov’è la verità?In questa guida, risponderemo a queste domande:Che cos’è E‑A-T?Quanto E‑A-T è importante?Quanto è valutato E‑A-T?E‑A-T è un fattore di posizionamento?I siti web hanno un punteggio E‑A-T?Come migliorare e dimostrare l’E‑A-TChe cos’è E‑A-T?E‑A-T significa competenza, autorevolezza, ed attendibilità (expertise, authoritativeness, and trustworthiness). Proviene dalle Linee Guida della Valutazione di Qualità della Ricerca di Google—un documento di 168 pagine utilizzato dai valutatori di qualità umani per verificare la qualità dei risultati di ricerca di Google.Google ha pubblicato online questo documento nel 2013 per “aiutare i webmaster a capire cosa cerca Google in una pagina web”.Quanto E‑A-T è importante?E‑A-T è importante per tutte le query, ma per alcune più di altre.Se stai cercando per delle foto simpatiche di gattini, allora E‑A-T probabilmente non è così importante. L’argomento è soggettivo, e non è un grosso problema se vedrai un gatto che pensi non sia carino.Se stai cercando la giusta dose di aspirina mentre sei incinta, d’altro canto, allora E‑A-T diventa assolutamente importante. Quando Google analizza un contenuto su questo argomento scritto da un autore sconosciuto, pubblicato da un sito web non fidato che manca di autorevolezza, allora le probabilità che il contenuto sia impreciso o fuorviante sono alte.Vista la natura delle informazioni che si sta cercando, non si tratta di spiacevoli inconvenienti—ma di informazioni potenzialmente mortali.E‑A-T è importante anche per query come “come aumentare la fiducia per credito”. E qui, consigli da sconosciuti e improvvisati sono quasi sicuramente non degne e non ci si dovrebbe fidare.Google chiama questo genere di argomenti come YMYL (I Tuoi Soldi o La Tua Vita — Your Money or Your Life):Alcune tipologie di pagine od argomenti potrebbero impattare potenzialmente il futuro personale nelle sfere della felicità, salute, stabilità finanziaria, o sicurezza.Noi chiamiamo questo tipo di pagine “I Tuoi Soldi o la Tua Vita (Your Money or Your Life”, o YMYL.Se il tuo sito è basato su un argomento YMYL, allora dimostrare E‑A-T diventa fondamentale.Quanto è valutato E‑A-T?Competenza, autorevolezza, ed attendibilità sono concetti simili—ma non identici. Ognuno è valutato indipendentemente utilizzando diversi set di criteri.CompetenzaCompetenza significa avere un alto livello di conoscenza e capacità in uno specifico campo. E’ valutato in modo primario a livello di contenuto, non a livello di organizzazione o sito web. Google cerca per contenuti creati da un esperto in materia.Per gli argomenti YMYL, ciò significa esperienze formali, qualifiche, ed istruzione del creatore di contenuti. Per esempio, un dottore commercialista è maggiormente qualificato per scrivere sulla preparazione di imposta rispetto a qualcuno che ha letto qualche articolo su r/personalfinance.Le competenze formali sono importanti per gli argomenti YMYL come gli ambiti medici, finanziari, o di consulenza legale.Per gli argomenti non YMYL, si tratta di dimostrare esperienze rilevanti ed “esperienze quotidiane”.Alcuni temi richiedono minori esperienze formali. […] Se sembra che la persona che ha creato il contenuto ha il tipo e quantità di esperienze per essere un “esperto” nel tema, valuteremo questa “esperienza quotidiana” e non penalizzeremo la persona/pagina web/sito web per non avere l’addestramento o l’educazione “formale” nel tema.Google dice inoltre che l’”esperienza quotidiana” è sufficiente per alcune tematiche YMYL. Per esempio, prendi una query tipo “come ci si sente ad avere il cancro”. Qualcuno che sta convivendo con la malattia è più titolato di rispondere a questa domanda rispetto ad un dottore qualificato con anni di esperienza.C’è anche la possibilità di avere l’esperienza quotidiana in argomenti YMYL. Per esempio, ci sono forum e pagine di supporto per persone con determinate problematiche. Condividere esperienze personali è una forma di esperienza quotidiana.AutorevolezzaL’autorità si basa sulla reputazione, in particolare nei confronti di altri esperti ed influencer dello stesso settore. Molto semplicemente, quando gli altri considerano un sito web o una persona come una fonte di informazioni su un argomento, si tratta di autorevolezza.Per valutare l’autorevolezza, si cerca nel web per informazioni sulla reputazione di un sito web o di un individuo.Utilizza la ricerca sulla reputazione per capire cosa pensano di un sito web le persone comuni o gli esperti. Guarda le recensioni, le referenze, i consigli dagli esperti, articoli dei magazine, ed altre informazioni credibili create/scritte da individui a riguardo del sito web.Ai valutatori è richiesta la ricerca tra le fonti indipendenti.Quando cerchi informazioni sulla reputazione, cerca tra fonti che non siano scritte o create dal sito web stesso, o dalla persona in questione.Wikipedia è una buona fonte di informazioni citata da Google.Gli articoli di Wikipedia possono aiutarti a conoscere una azienda e possono includere delle specifiche informazioni sulla reputazione, ad esempio premi ricevuti ed altri tipi di riconoscimenti, come problematiche o controversie.E’ importante ricordare che l’autorevolezza è un concetto relativo. Se Elon Musk e Tesla sono fonti autorevoli per informazioni riguardanti i veicoli elettrici, hanno pochissima se non nulla autorevolezza sulla SEO.Succede anche che alcune persone e siti web abbiano l’unicità dell’autorevolezza per alcuni specifici argomenti. Ad esempio, la fonte più autorevole dei testi delle canzoni dei Coldplay è il loro sito web ufficiale. E la fonte più autorevole per le informazioni sulla qualità della carne di manzo negli U.S.A. è l’USDA.AttendibilitàLa fiducia si basa sulla legittimità, trasparenza ed accuratezza del sito web e dei suoi contenuti.I valutatori guardano molte cose per valutare l’attendibilità, inclusa la segnalazione di chi è la persona responsabile dei contenuti. Questo è molto importante per le query YMYL, ma viene applicato anche alle query non-YMYL.I siti web YMYL esigono un alto livello di fiducia, quindi spesso devono fornire informazioni su chi sia il responsabile dei contenuti del sito.E’ importante anche avere sufficienti informazioni di contatto, in particolare per i negozi online e gli argomenti YMYL.Se un negozio online o un sito web con transazioni finanziarie pubblica solamente un indirizzo email e un indirizzo fisico, potrebbe essere difficile da contattare in caso di aiuto per problemi sulla transazione. Allo stesso modo, molti altri tipi di siti web YMYL richiedono una gran livello di fiducia pubblica.I valutatori tengono anche conto dell’accuratezza del contenuto.Per articoli di notizie e pagine informative, il contenuto principale di alta qualità deve avere un’accuratezza fattuale all’argomento e deve avere il supporto dell’opinione degli esperti dove tale consenso esiste.La citazione di fonti autorevoli è parte del processo.[un articolo] con una quantità significativa di informazioni accurate e referenze esterne autorevoli può facilmente essere valutato nella parte alta.Ma ricorda comunque che la fiducia, così come l’autorevolezza, è un concetto relativo. Le persone ed i siti web non possono essere percepiti come affidabili in tutte le aree. Siamo una fonte autorevole sul SEO, non sul bodybuilding.E‑A-T è un fattore di posizionamento?Più o meno, almeno da quanto dice Danny Sullivan, Public Liason of Search di Google:Is E‑A-T a ranking factor? Not if you mean there’s some technical thing like with speed that we can measure directly.We do use a variety of signals as a proxy to tell if content seems to match E‑A-T as humans would assess it.In that regard, yeah, it’s a ranking factor.— Danny Sullivan (@dannysullivan) October 11, 2019Confuso? Te lo spiego meglio.Come vedi, per alcuni essere un “fattore di ranking” significa essere qualcosa di tangibile che un computer può valutare e capire.Probabilmente l’esempio più ovvio è il numero di backlink ad una pagina.Google scansiona il web in lungo e in largo così può sapere quanti backlink hanno la maggior parte delle pagine. Possono creare facilmente un algoritmo che classifichi le pagine per il numero di maggiori backlink.Il problema con la competenza, autorevolezza ed attendibilità—che restano qualità desiderabili di ogni contenuto—sono fondamentalmente dei concetti umani. Non puoi dire ad un computer di classificare in alto le pagine con un miglior E‑A-T perché lui comprende solo bit e byte.Ecco la soluzione di Google a questo problema:Primo, gli ingegneri del motore di ricerca trovano miglioramenti all’algoritmo per aumentare la qualità dei risultati di ricerca.Secondo, mostrano i risultati di ricerca ai Valutatori di Qualità sia con che senza le implementazioni dei cambiamenti. Il loro lavoro è dare feedback a Google, e loro non sanno quale è la versione che stanno valutando.Terzo, Google utilizza i feedback per decidere se i miglioramenti proposti hanno un impatto positivo o negativo nei risultati di ricerca. Se i risultati sono positivi, la modifica viene implementata.Con questa metodologia, gli ingegneri in Google sono in grado di capire i segnali tangibili di allineamento con E‑A-T e di conseguenza ne modificano gli algoritmi di ranking.Google spiega di più di questo processo qui, e in questo video:https://www.youtube.com/watch?v=J5RZOU6vK4QBen Gomes, Vice Presidente della Ricerca in Google, ha offerto una fantastica versione tldr; di quanto detto sopra in una intervista per CNBC nel 2018:Puoi vedere alle linee guida dei valutatori come alla direzione di dove vuoi vada l’algoritmo. Non ti dicono come l’algoritmo classifichi i risultati, ma mostrano fondamentalmente cosa l’algoritmo dovrebbe fare.I siti web hanno un punteggio E‑A-T?No. (Finalmente una domanda che ha una risposta netta).“EAT and YMYL are concepts introduced for Quality Raters to dumb down algorithm concepts. They are not ‘scores’ used by Google internally.“ #Pubcon @methode Followup: There is no EAT algorithm.— Grant Simmons (@simmonet) October 10, 2019Questa risposta è abbastanza ovvia quando comprendi come Google valuta E‑A-T, ed il ruolo dei valutatori di Qualità. Ma conviene comunque ribadirlo:Google non assegna al tuo sito web alcun punteggio E‑A-T.Detto questo, ci sono comunque metodi per aumentare la tua competenza, autorevolezza e attendibilità agli occhi dei Valutatori di Qualità.Come migliorare e dimostrare l’E‑A-TPrimo, è importante capire che dimostrare e migliorare E‑A-T sono cose diverse.Non puoi dimostrare E‑A-T se non ce l’hai—e questo è il primo ostacolo da superare.Si crede che la carenza di E‑A-T sia il motivo della caduta a precipizio di molti siti YMYL nell’Agosto 2018 quando Google ha condiviso il suo odiato aggiornamento “medico”.Siccome molti di questi siti non aveva alcun E‑A-T fin dall’inizio, il traffico è crollato quando l’aggiornamento principale è stato implementato aumentando l’abilità di Google di scovare E‑A-T con l’algoritmo.Se avevi uno di questi siti, o vuoi salvaguardare il tuo futuro, impegnarsi per migliorare e dimostrare meglio il tuo E‑A-T a Google è una buona mossa.Ecco alcuni modi per farlo:1. Genera più linkMalgrado i link non siano menzionati nelle Linee Guida della Valutazione di Qualità della Ricerca di Google, Gary Illyes, analista Google Webmaster Trend, ha detto che E‑A-T è basato soprattutto su link e menzioni da siti autorevoli.I asked Gary about E‑A-T. He said it’s largely based on links and mentions on authoritative sites. i.e. if the Washington post mentions you, that’s good.He recommended reading the sections in the QRG on E‑A-T as it outlines things well.@methode #Pubcon— Marie Haynes (@Marie_Haynes) February 21, 2018Secondo Marie Haynes, ha detto anche che Google è molto bravo a capire quali link sono importanti, quindi assicurati di dare priorità alla costruzione di link di alta qualità piuttosto che a quelli di bassa qualità.Leggi qui di più, o guarda questo video:https://www.youtube.com/watch?v=E3mDlVutW_o2. Mantieni ed aggiorna i contenutiSe stai scrivendo di argomenti YMYL come consigli medici o finanziari, allora mantenere i contenuti aggiornati è cruciale per dimostrare E‑A-T.Consigli finanziari, legali, fiscali ecc. con alta rilevanza E‑A-T dovrebbero arrivare da fonti affidabili ed essere mantenuti ed aggiornati regolarmente.Consigli ed informazioni mediche al alta rilevanza E‑A-T dovrebbero essere scritte o prodotte con uno stile professionale e dovrebbero essere editati, revisionati ed aggiornati con frequenza regolare.E per gli argomenti non-YMYL?Le Linee Guida di Google non ne parlano specificatamente, ma crediamo sia comunque importante. Dopo tutto, come può una pagina essere affidabile se confonde i lettori con informazioni non aggiornate?3. Verifica i fattiLe Linee Guida sulla Qualità di Google dicono che gli articoli di informazione devono avere una accuratezza fattuale per dimostrare un alto livello di E‑A-T.Articoli di attualità con alto E‑A-T dovrebbero essere prodotti con professionalità giornalistica—dovrebbero contenere contenuti di fattuale accuratezza […]Lo stesso vale per il contenuto scientifico; dovrebbe essere di accuratezza fattuale ed allineato al consenso della comunità scientifica.Pagine di informazione ad alto E‑A-T su argomenti scientifici dovrebbero essere prodotti da persone od organizzazioni con esperienza scientifica adeguata e rappresentare il consenso scientifico riconosciuto su argomenti dove tale consenso esiste.E quindi, per quanto riguarda gli altri argomenti?Sebbene le Linee Guida Google non parlino di accuratezza se non nel contesto dell’E‑A-T, possiamo assumere che sia importante perché il documento le cita oltre 50+ volte.Quindi, il nostro consiglio è di controllare i fatti che riguardano i vostri contenuti, idealmente con fonti autorevoli di cui Google si fida come Wikipedia e Wikidata.Devi anche assicurarti di citare fonti legittime.4. Aumenta le recensioniGoogle dice ai Valutatori di Qualità di usare le recensioni online come fonte di informazioni reputazionali sul business, che significa fiducia ed autorevolezza.Per le aziende, ci sono molte fonti per le recensioni e informazioni sulla reputazione- […] Puoi provare a cercare su siti specifici per trovare le recensioni.Molte persone rifiutano di farlo, e spesso cercano di semplificare troppo le cose focalizzandosi su un particolare sito di recensioni—ovvero il Better Business Bureau.Il motivo per cui ciò accade è ovvio, perché le linee guida sulla valutazione dice cose come:Per favore considera le recensioni molto basse sul sito BBB come evidenza di una reputazione negativa.Tuttavia, considerare le recensioni su BBB come fattore di posizionamento sono state largamente smentite.Piuttosto, concentrati per avere più recensioni positive online, su vari siti che contato—e.s., i siti che le persone usano e dei quali si fidano del tuo settore. Per un ristorante, potrebbe essere TripAdvisor, oppure un blog di cibo locale famoso.5. Ingaggia espertiC’è abbondanza di esperti in ogni settore, quindi perché non ingaggiarli per scrivere per il tuo sito?E’ una richiesta quasi perentoria se ti occupi di tematiche YMYL.L’esperienza formale è importante per argomenti YMYL, ad esempio consigli medici, finanziari o legali.Ma ingaggiare esperti con esperienza formale non è necessario per argomenti non-YMYL.Invece, puoi ingaggiare persone con dei risultati misurabili nel tuo settore, o chi è già ben conosciuto nel creare contenuti di alta qualità sull’argomento.L’esperienza potrebbe essere meno formale per argomenti come ricette o intrattenimento. Una pagina rilevante di cucina potrebbe essere il sito web di uno chef professionista, o potrebbe essere un video di un creatore di contenuti che crea videi di cucina di alta qualità su YouTube ed è uno dei più conosciuti e famosi creatori di contenuti per ricette nella sua nicchia.Se non puoi permetterti di ingaggiare persone, puoi sempre intervistare un esperto o chiedere di scrivere un guest post per il tuo sito.Noi lo abbiamo fatto per la nostra guida alle penalità Google:6. Dimostra le tue credenzialiA molte persone non piace mostrarsi, ma quando si tratta di dimostrare E‑A-T a Google, è esattamente ciò che devi fare. Se hai un PhD, hai parlato in qualche famosa conferenza di settore, o hai vinto un premio prestigioso, fallo sapere al mondo (e a Google).Ci sono due posti ovvi dove farlo. Il primo è la bio dell’autore.Il secondo è la tua pagina “Chi siamo” o “Team”:Ricorda, lo devi fare per dimostrare la tua esperienza, autorevolezza, ed affidabilità a Google. Non esagerare o abbellire la verità.Potresti anche prendere in considerazione l’uso dello schema markup per fornire informazioni sui tuoi risultati ed esperienze in un modo più strutturato.<script type=\"application/ld+json\"> { \"@context\": \"http://www.schema.org\", \"@type\": \"Person\", \"name\": \"Mark Zuckerberg\", \"alumniOf\": [ { \"@type\": \"CollegeOrUniversity\", \"name\": \"Harvard University\", \"sameAs\": \"https://en.wikipedia.org/wiki/Harvard_University\" }, ], 7. Mostra i dettagli di contattoLe aziende che non forniscono ai visitatori sufficienti metodi di contatto o informazioni per l’assistenza potrebbero essere percepite come non affidabili. Questo è particolarmente vero per le pagine YMYL.Per siti web con pagine YMYL, come le banche online, ci si aspetta di trovare molte informazioni che riguardano il sito, incluse informazioni dettagliate sull’assistenza clienti. […] Gli utenti devono avere un modo per fare domande o chiedere aiuto quando succede un problema.La nostra opinione è che le aziende legittime devono mostrare almeno l’indirizzo, il numero di telefono, l’indirizzo email, e i metodi di contatto.Ma, se sei un blogger solitario che lavora da casa?Non preoccuparti, i Valutatori di Qualità Google non ti daranno penalizzazioni se non mostri il tuo indirizzo di casa o fornisci un supporto clienti 24/7. Sarebbe irragionevole. Le Linee Guida Google dicono che il livello di trasparenza atteso dipende dal sito.Per esempio, i siti web umoristici potrebbero non aver bisogno del livello di dettaglio nelle informazioni di contatto che ci si aspetta dal sito di una banca online.8. Procurati una pagina WikipediaWikipedia ha poche menzioni nelle Linee Guida Google, e ai Valutatori di Qualità è detto di guardare specificatamente nell’enciclopedia per aiutarsi nella valutazione delle reputazioni.Articoli dei quotidiani ed articoli di Wikipedia possono aiutarti ad avere informazioni su una azienda e possono includere informazioni specifiche sulla reputazione, come premiazioni ed altri riconoscimenti, oppure problematiche e controversie.Ma, c’è un problema: avere una pagina Wikipedia è difficile. Davvero difficile.A meno che tu non sia una autorità nel tuo settore, che significa avere molta copertura da fonti affidabili ed indipendenti, avere una pagina Wikipedia è praticamente impossibile. Neanche noi ce l’abbiamo.Tuttavia, se credi che la tua attività ha guadagnato abbastanza autorevolezza da garantirsi una pagina Wikipedia, e non ce l’hai ancora, è importante cercare di ottenerla.Per tutti noi, la cosa migliore da fare è essere citati in una pagina Wikipedia esistente.Sfortunatamente, anche questo non è facile. Mentre è possibile editare pagine Wikipedia, suggerimenti autopromozionali sono solitamente rimossi. Detto questo, vale la pena provare se hai risorse davvero genuine che possono aggiungere valore ad un particolare articolo su Wikipedia.9. Guadagna più citazioniCitazioni da siti web molto famosi nel settore possono aiutarti ad aumentare l’autorevolezza—ovviamente se sono positive. Ai Valutatori di Qualità è detto di guardare a queste quando giudicano la reputazione di un sito web e di un autore. Cerca recensioni, riferimenti, raccomandazioni da esperti, articoli di quotidiani, ed altre informazioni credibili create/scritte da individui sul sito web.Per esempio, quando il mio nome è citato negli editoriali del Search Engine Journal, potrebbe essere d’aiuto nel dimostrare la mia autorevolezza nell’argomento SEO.Il problema è che avere citazioni autorevoli è come un terno al lotto. Le citazioni aumentano l’autorevolezza, ma hai bisogno di autorevolezza per avere citazioni.Detto questo, ci sono un paio di cose che puoi fare.La prima cosa è pubblicare analisi e dati che altri nel tuo settore useranno come riferimento.La seconda è usare un servizio come HARO per connetterti con i giornalisti.ConclusioniE‑A-T è importante per la SEO, ed è qualcosa a cui dovresti dedicare tempo per migliorarla—specialmente se scrivi di argomenti YMYL.Si tratta di un processo di 2 parti.Sii legittimo. Assumi esperti. Prenditi cura dei clienti. Segui gli aspetti aziendali. Definisci i valori.Lavora per dimostrare i tuoi valori ed esperienze a Google.Sembra semplice, e lo è; solamente chiede del tempo e dell’impegno.Se sembra noioso, ricorda che Google non ha alcun obbligo. Avere un sito web non significa necessariamente che tu abbia diritto di essere indicizzato in cima. Se ci sono lì fuori dei contenuti migliori e più autorevoli, o concorrenti con prodotti o servizi migliori, allora Google, giustamente, proverà a dirottare il traffico lì—e non al tuo.A parte le indicazioni morali potenzialmente indesiderate, vale anche la pena notare che Google cambia frequentemente le Linee Guida per i Valutatori, quindi è probabile che i criteri E‑A-T cambino e si evolvano nel tempo.Domande? Idee? Raggiungimi su Twitter.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Che cos’è E‑A‑T? Perché è importante per la SEO"
    },
    {
      "level": "H2",
      "text": "Che cos’è E‑A-T?"
    },
    {
      "level": "H2",
      "text": "Quanto E‑A-T è importante?"
    },
    {
      "level": "H2",
      "text": "Quanto è valutato E‑A-T?"
    },
    {
      "level": "H3",
      "text": "Competenza"
    },
    {
      "level": "H3",
      "text": "Autorevolezza"
    },
    {
      "level": "H3",
      "text": "Attendibilità"
    },
    {
      "level": "H2",
      "text": "E‑A-T è un fattore di posizionamento?"
    },
    {
      "level": "H2",
      "text": "I siti web hanno un punteggio E‑A-T?"
    },
    {
      "level": "H2",
      "text": "Come migliorare e dimostrare l’E‑A-T"
    },
    {
      "level": "H3",
      "text": "1. Genera più link"
    },
    {
      "level": "H3",
      "text": "2. Mantieni ed aggiorna i contenuti"
    },
    {
      "level": "H3",
      "text": "3. Verifica i fatti"
    },
    {
      "level": "H3",
      "text": "4. Aumenta le recensioni"
    },
    {
      "level": "H3",
      "text": "5. Ingaggia esperti"
    },
    {
      "level": "H3",
      "text": "6. Dimostra le tue credenziali"
    },
    {
      "level": "H3",
      "text": "7. Mostra i dettagli di contatto"
    },
    {
      "level": "H3",
      "text": "8. Procurati una pagina Wikipedia"
    },
    {
      "level": "H3",
      "text": "9. Guadagna più citazioni"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}