{
  "url": "https://ahrefs.com/blog/it/elenco-di-controllo-seo/",
  "slug": "elenco-di-controllo-seo",
  "title": "La Checklist SEO Indispensabile Nel 2024 [Con Template]",
  "description": "Seguire questo elenco di controllo SEO ci ha aiutato a portare il traffico del nostro blog a oltre 640.000 visite mensili organiche.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Ricordare ogni attività SEO che devi svolgere per il tuo sito è un incubo. Ecco perché hai bisogno di una checklist SEO.Il punto è che le checklist SEO pensate per tutti non sono molto utili in quanto tengono conto del tuo sito o delle tue priorità SEO.Questo è il motivo per cui ne abbiamo creata uno completamente personalizzabile su Google Sheets:Vediamo come configurarla e utilizzarla (non è necessario un account Google Analytics).Scarica il template della checklist SEOTi basta cliccare qui e creare una copia del file.ContenutiCome impostare e utilizzare la nostra checklist SEOPer iniziare, crea una copia del template della checklist nel tuo Google Drive e configura i settaggi L’operazione richiede circa 30 secondi e richiede di rispondere a due domande.Su quale piattaforma o CMS funziona?Per quali aspetti della SEO vuoi vedere le attività? (Deseleziona quelli che non ti interessano)E questo è tutto. La tua checklist SEO personalizzata è pronta nella scheda “Checklist”.Qui vedrai gli elementi della lista divisi in tre segmenti:Da fare una voltaDa fare periodicamenteDa fare ogni volta che pubblichi una nuova paginaQuesto non vuol dire completare tutto ciò che è presente in questa checklist SEO oggi. Puoi iniziare con le attività una tantum, poi con quelle periodiche e così via.IniziamoNota a margine. Le attività presenti in questa checklist coprono molti aspetti. Si tratta fondamentalmente di una checklist SEO tecnica, per i contenuti, per la SEO off page e per la SEO on page consolidata in un solo document. Il suo scopo è migliorare la tua strategia SEO e aiutarti a posizionarti più in alto sui motori di ricerca.Attività da fare una voltaEcco le attività SEO che devi completare una sola volta.Installa un tema SEO-friendlyIl tema del tuo sito ne cambia l’aspetto. Oggi, praticamente tutti i temi di Shopify, Wix e WordPress sono abbastanza SEO-friendly. Ma se desideri utilizzare un tema di terze parti, è meglio eseguire alcuni rapidi controlli:È ottimizzato per i dispositivi mobili? Carica la demo del tema sul tuo telefono e guarda come appare.È veloce? Testa la home page demo nello strumento PageSpeed Insights di Google. Più alto è il punteggio, meglio è.Funziona su diversi browser? Prova la demo su Chrome, Firefox e Safari.Ha buone recensioni? La maggior parte dei marketplace mostra le recensioni dei temi.Viene aggiornato regolarmente? In caso contrario potrebbero esserci problemi di sicurezza. Ancora una volta, la maggior parte dei marketplace di temi mostrerà quando è stato aggiornato l’ultima volta.Determina la struttura del tuo sitoAvere un sito con una struttura logica aiuta i visitatori a navigare nel tuo sito. Garantisce inoltre che Google possa trovare tutte le pagine. Questo è importante, poiché Google non può posizionare le pagine di cui non è a conoscenza.Decidere la struttura è abbastanza facile. Basta abbozzare una mappa mentale:Ogni ramo sulla mappa dovrebbe essere un collegamento interno per consentire ai motori di ricerca e ai visitatori di navigare tra le pagine.Le persone spesso saltano questo passaggio quando configurano un sito, quindi vale la pena farlo anche se il tuo sito è già attivo e funzionante.Ulteriori approfondimentiStruttura di un Sito Web: Creare delle Solide Fondamenta per la SEOUtilizza una struttura descrittiva per gli URLPer i nuovi siti è opportuno utilizzare fin dall’inizio una struttura URL chiara e descrittiva. Questo perché gli URL aiutano gli utenti a capire di cosa tratta una pagina quando appare nei risultati di ricerca.La maggior parte delle piattaforme per creazione di siti lo fanno automaticamente, ad eccezione di WordPress. Non chiedermi perché, ma per impostazione predefinita vengono utilizzati ID univoci come questo: website.com/?p=123.Fortunatamente, questo è abbastanza facile da cambiare. Basta andare su Settings > Permalinks > Post name.Non modificare questo parametro per i siti esistenti. Può fare molto più male che bene. È meglio lasciarlo così anche se stai utilizzando una struttura tutt’altro che ideale.Installa un plugin SEO Se utilizzi WordPress, avrai bisogno di un plug-in SEO che ti aiuti a ottimizzare varie cose tra cui la sitemap e i meta tag (ne parleremo più avanti).Ecco alcune opzioni (hai bisogno solo di una di queste):Yoast SEORank MathThe SEO FrameworkProbabilmente non è necessario farlo se utilizzi una piattaforma come Shopify. La maggior parte delle piattaforme integra elementi per gestire le basi della SEO di default.Configura Google Search ConsoleGoogle Search Console, proprio come Google Analytics, è uno strumento gratuito per monitorare le prestazioni di ricerca organica del tuo sito. Da qui puoi:Visualizzare le parole chiave per le quali ti posizioniControllare le posizioni su GoogleTrova errori sul sitoInvia le sitemap del sitoSegui queste istruzioni rilasciate da Google per configurare Google Search Console.Ulteriori approfondimentiCome utilizzare Google Search Console per migliorare la SEOConfigura Bing Webmaster ToolsBing Webmaster Tools è l’equivalente di Google Search Console. È qualcosa che utilizzerai sempre? Probabilmente no, poiché la ricerca di Bing non è qualcosa su cui si concentra la maggior parte dei SEO. Ma non fa comunque male configurarlo, poiché prima o poi potresti aver bisogno dei dati.Impara a configurarlo qui.Crea e invia una sitemapLe sitemaps indicano ai motori di ricerca dove trovare le pagine importanti del tuo sito. Questo è importante, poiché possono scansionare o indicizzare le pagine solo se sanno che esistono.Ecco come appare la sitemap del nostro blog:Di solito puoi trovare la tua sitemap sotto uno di questi URL:/sitemap.xml /sitemap_index.xml /sitemapSe non riesci a trovarlo, controlla il file robots.txt (dominio.com/robots.txt), poiché la sua posizione è spesso elencata proprio qui:Se continui a non trovarla, probabilmente non ne hai una e devi crearla. Se la trovi, devi inviarla a Google. La mia guida qui sotto ti insegna come fare entrambe queste cose.Ulteriori approfondimentiCome Creare Una Sitemap XML (e Inviarla a Google)Assicurati che il tuo sito sia indicizzabileLe persone non cercano all’interno di tutto ciò che è disponibile online quando usano Google. Cercano nell’indice delle pagine di Google. Se la tua pagina non è indicizzabile, Google non può indicizzarla e non verrà visualizzata nei risultati di ricerca.Fortunatamente, Google può indicizzare tutte le pagine a meno che tu non gli dica che non è consentito. Sfortunatamente, è un errore abbastanza comune impedire a Google di indicizzare tutto, soprattutto nel caso di nuovi siti o in seguito a migrazioni.Ecco come trovare le pagine che Google non può indicizzare gratuitamente con Ahrefs Webmaster Tools (AWT):Scansiona il tuo sito con Site AuditVai al rapporto Tutti i problemiControlla l’errore per “Noindex page in sitemap”Le sitemap elencano le pagine che desideri che i motori di ricerca indicizzino. Se queste pagine hanno un meta tag robots “noindex” o x‑robots-tag, c’è un problema. Devi rimuovere queste pagine dalla sitemap o eliminare il tag noindex dalla pagina.Ulteriori approfondimentiRobots Meta Tag e X‑Robots-Tag: tutto quello che devi sapereAggiungi lo schema markup alla tua home pageLo schema markup è un codice strutturato che aiuta i motori di ricerca a comprendere e rappresentare meglio il tuo sito nei risultati di ricerca. Consigliamo a tutti i siti di aggiungere il markup Organizzazione o Persona alla propria home page.Fortunatamente, la maggior parte delle piattaforme per la pubblicazione di siti e dei plug-in SEO all-in-one rendono questa operazione semplice. Non è necessario scrivere alcun codice.Ad esempio, se utilizzi Yoast in WordPress, puoi in “Site representation”:Tutto quello che devi fare è scegliere se sei un’organizzazione o una persona, quindi inserire dettagli come il nome della tua organizzazione e i collegamenti ai profili social. Il plugin scriverà e aggiungerà il markup per te.Per verificare che tutto funzioni correttamente, analizza la tua home page usando lo strumento di convalida dello schema. Dovresti vedere il codice:Assicurati che il tuo sito sia ottimizzato per i dispositivi mobiliL’ottimizzazione per i dispositivi mobili è da anni un fattore di ranking perché la maggior parte delle ricerche avviene su dispositivi mobili. Puoi verificare se e quanto il tuo sito è ottimizzato per i dispositivi mobili con il rapporto Usabilità mobile in Google Search Console.Assicurati di utilizzare HTTPSHTTPS è stato confermato come un fattore di ranking, anche se non importante come altri.Se il tuo sito web utilizza HTTPS, l’icona del “lucchetto” apparirà nel tuo browser:Se non lo vedi, dovrai installare un certificato TLS.Molte piattaforme web e host ti offrono questo certificato gratuitamente. In caso contrario, puoi ottenerne uno gratuito da Let’s Encrypt (devi però assicurarti che il tuo host lo supporti).Assicurati che il tuo sito sia accessibile da un dominioI visitatori non dovrebbero essere in grado di accedere al tuo sito da più parti in quanto questa situazione può causare problemi ai crawler dei motori di ricerca, nonché problemi di indicizzazione e sicurezza.Per verificare che tutto sia in ordine, analizza queste quattro versioni del tuo sito con httpstatus.io: http://tuodominio.comhttp://www.tuodominio.comhttps://tuodominio.comhttps://www.tuodominio.comSe tutto va bene, tre di loro dovrebbero reindirizzare a una delle versioni HTTPS:Se ciò non accade, devi impostare reindirizzamenti 301 permanenti.Ulteriori approfondimentiRedirect 301 per SEO: Tutto quello che Devi SapereAssicurati che il tuo sito si carichi velocementeLa velocità della pagina è un fattore di ranking sul desktop dal 2010 e sui dispositivi mobili dal 2018.In passato Google ha utilizzato vari segnali per misurare la velocità della pagina, ma oggi utilizza solo i Core Web Vitals.Puoi controllare gratuitamente le prestazioni Core Web Vitals del tuo sito usando l’Ahrefs Webmaster Tools (AWT): Scansiona il tuo sito con Site AuditVai su PrestazioniVai sulla sezione “Core Web Vitals”Se vedi molte parti colorate di rosso, probabilmente il tuo sito ha bisogno di essere sistemato.Ulteriori approfondimentiCosa Sono I Core Web Vitals E Come Migliorare Le PrestazioniNota a margine. Per visualizzare i Core Web Vitals in AWT, dovrai connetterti all’API PageSpeed Insights di Google. Ci vogliono solo un minuto o due. Troverai le istruzioni passo passo nel Site Audit.Installa un plugin per la compressione delle immaginiLa compressione delle immagini riduce le dimensioni dei file delle immagini e migliora la velocità della pagina.Se utilizzi una piattaforma web come Wix o Shopify, non devi preoccuparti poiché comprimono automaticamente le immagini. Ma se utilizzi WordPress, dovrai installare un plug-in per la compressione delle immagini come ShortPixel.Nota a margine. ShortPixel ti consente di comprimere gratuitamente fino a 100 immagini al mese.Attiva un Google Business Profile gratuitoGoogle Business Profiles appare nelle ricerche locali di Google e in Google Maps.Se la tua attività ha un negozio o serve una zona specifica, la creazione di un profilo aziendale su Google è la cosa migliore che puoi fare per la tuo SEO. Puoi registrarti qui gratuitamente. Basta inserire quante più informazioni possibili per aumentare le tue possibilità di posizionarti e apparire.Copia i backlink dei tuoi concorrentiI backlink sono link al tuo sito che arrivano da altri siti e sono uno dei principali fattori di ranking di Google. Esistono molti modi per ottenerne di più (link building), ma il miglior punto di partenza è copiare i link dei tuoi concorrenti.Esistono molti modi per farlo, ma cercare i collegamenti alle directory dei concorrenti è un buon punto di partenza.Ecco come farlo:Vai sul Site Explorer di AhrefsInserisci l’URL della tua home pageSeleziona “URL Esatto”Vai Link IncrociatiInserisci i siti di alcuni dei tuoi competitorImposta la modalità di ricerca per tutte le pagine su “URL”Clicca su “Mostra opportunità di backlink”Di solito è abbastanza facile individuare le directory locali e di settore nell’elenco:Se pensi che sarebbe utile avere la tua attività elencata in una di queste directory, registrati per un account e crea un profilo. Riceverai anche un link.Ulteriori approfondimentiCome trovare i backlink dei tuoi concorrenti (e averli anche tu)Attività da fare periodicamenteEcco le attività SEO che dovresti completare durante la configurazione del tuo sito e anche periodicamente.Sistema le pagine rotteI link rotti possono avere un impatto negativo sull’esperienza dell’utente e interrompere il flusso di “autorità” all’interno e intorno al tuo sito.Per trovare gratuitamente i link rotti sul tuo sito, utilizza Ahrefs Webmaster Tools.Scansiona il tuo sito con Site AuditVai su Internal pagesClicca “Issues”Cerca gli errori “404”Ecco come gestire i link rotti:Ulteriori approfondimentiCome trovare e correggere i link rotti (per recuperare il prezioso “Link Juice”)Aggiorna i contenuti in declinoIl posizionamento sui motori di ricerca tende a calanre nel tempo se non si tengono le pagine aggiornate. Ciò è particolarmente vero per gli argomenti per cui gli utenti cercano nuove informazioni.Ecco come trovare le pagine che essere aggiornate con Google Search Console:Vai su Search resultsClicca sul filtro “Data” e seleziona la modalità “Compara”Seleziona “Compara gli ultimi 6 mesi con il periodo precedente” Clicca su ApplyAnalizza la voce “Pages” nella tabellaOrdina i risultati per “Differenza nei clic” dal più basso al più altoAd esempio, il nostro elenco delle principali ricerche su Google ha ricevuto oltre 75.000 visite organiche in meno negli ultimi sei mesi rispetto ai sei mesi precedenti. Ciò è probabilmente dovuto al fatto che gli utenti che effettuano ricerche desiderano un elenco aggiornato, ma l’ultima volta che abbiamo aggiornato la pagina è stato qualche mese fa.Ulteriori approfondimentiRipubblicare Contenuti: Come Aggiornare Vecchi Articoli Blog per la SEOAnalizza i gap di contenutoUn’analisi del gap di contenuto ti permette di trovare le parole chiave per le quali i tuoi concorrenti si posizionano ma tu no. Questi spesso indicano argomenti su cui avrebbe senso creare contenuti.Ecco come farla usando Ahrefs:Vai su Competitive AnalysisInserisci l’indirizzo del tuo sitoInserisci alcuni concorrentiClicca su “Compare”Vedrai quindi le parole chiave per le quali almeno un concorrente si posiziona tra i primi 10, ma tu non ti posizioni affatto.Ad esempio, tre dei nostri concorrenti si posizionano tra i primi 10 risultati per “rankbrain”:Questo è probabilmente un argomento che dovremmo considerare di trattare.Ulteriori approfondimentiCome eseguire un’efficace analisi del gap dei contenuti per la SEO [Video]Aggiorna il tuo Google Business ProfileSe ti è mai capitato di arrivare in un ristorante e trovarlo chiuso nonostante Google dica che è aperto, sai già quanto è importante mantenere aggiornato il profilo della tua attività su Google. Dato che ci vogliono solo pochi minuti ogni 2 mesi, non vale la pena rischiare recensioni negative.Ecco alcune cose da controllare ogni volta:Orari di aperturaOrari di apertura festivi (es. Natale)Numero di telefonoProdotti e serviziTi consiglio inoltre di utilizzare la funzione “post” per mantenere aggiornati i follower sulla tua attività.Ad esempio, questo bar ha un post relativo al loro prossimo mercatino di Natale:(Pianificazione piuttosto impressionante, considerando che ho scritto questo articolo a luglio)Verifica la presenza di altri problemi tecniciCentinaia di problemi tecnici possono danneggiare il tuo sito e possono comparire in qualsiasi momento. Ecco perché è estremamente importante controllarli periodicamente e risolvere eventuali problemi importanti che si presentano.Puoi farlo gratuitamente usando il Site Audit nel Ahrefs Webmaster Tools. Basta scegliere l’opzione per eseguire scansioni pianificate durante l’impostazione del progetto (settimanale o mensile è perfetto per la maggior parte dei siti).Site Audit eseguirà quindi la scansione del tuo sito per oltre 140 potenziali problemi SEO. Lo farà periodicamente in base alla pianificazione impostata e ti invierà avvisi via email sui nuovi problemi:Se clicchi su “View” su qualsiasi problema, entrerai sul Site Audit e vedrai gli URL interessati:È quindi possibile cliccare sul bottone “Why and how to fix” per sapere come affrontare ciascun problema.Attività da fare per ogni paginaEcco le attività SEO da completare ogni volta che aggiungi nuove pagine al tuo sito che vuoi si posizionino in alto sui motori di ricerca.Trova una parola chiave principale su cui puntareOgni pagina del tuo sito web dovrebbe avere come target una parola chiave principale. Dovresti eseguire periodicamente una ricerca delle parole chiave per trovare argomenti pertinenti, ma è anche importante assicurarti di scegliere come target la parola chiave migliore ogni volta che pubblichi una nuova pagina.Ad esempio, supponiamo che tu stia scrivendo un post sulle migliori proteine in polvere. Esistono molti modi in cui le persone possono cercare, ad esempio:quali sono le migliori proteine in polverei migliori integratori proteicii migliori frullati proteiciQuale di queste parole chiave dovrebbe essere il tuo target principale, se possibile?Fortunatamente, c’è un modo semplice per capirlo. Cerca il tuo argomento nel Keywords Explorer di Ahrefs e guarda l’Argomento Principale. Si tratta di solito del n modo più popolare per cercare la stessa cosa.Nota a margine. L’Argomento Principale non è infallibile al 100%. Mostra semplicemente la parola chiave che invia la maggior parte del traffico dei motori di ricerca alla pagina che si posiziona in alto per la tua parola chiave. Di solito questa è la parola chiave migliore da scegliere come target, ma non è sempre vero quindi non lasciare che questo dato prevalga sul buon senso.Ulteriori approfondimentiCome Ricercare Parole Chiave Per La SEOValuta l’intento di ricercaLe persone tendono a voler vedere uno di questi tipi di contenuti quando cercano su Google (o su un altro motore di ricerca):Post su un blogStrumenti interattiviVideoPagine di categoriaPagina prodottoCapire che tipo di contenuti vogliono vedere le persone che cercano la tua parola chiave vuol dire valutare il loro intento di ricerca. Questo è un passaggio fondamentale se vuoi avere buone possibilità di posizionarti, poiché Google vuole posizionare i contenuti che gli utenti cercano.Come si fa?Cerca il tipo di contenuto più comune tra i risultati in cima su Google.Ad esempio, gli strumenti interattivi dominano la prima pagina per i “giorni tra le date” (“days between dates”). Ma i video dominano la prima pagina per “Excel per principianti” (“excel for beginners”):Da qui, ti consigliamo di approfondire l’intento per comprendere il formato e l’angolo migliore per il tuo contenuto. Scopri di più a riguardo nella guida di seguito.Ulteriori approfondimentiIntento di Ricerca nella SEO: Cos’è e Come OttimizzarloValuta le tue possibilità di posizionarti su GoogleComprendere la facilità o la difficoltà di posizionamento di una parola chiave ti aiuta a dare priorità all’opportunità e a definire aspettative realistiche.Per una stima molto approssimativa, puoi utilizzare il punteggio Difficoltà delle Parole Chiave presente nel Keywords Explorer.Basta non fare affidamento interamente su questo numero, poiché tiene conto solo dei backlink. Altri fattori possono indicare una parola chiave difficile da posizionare, per esempio:Backlink di alta qualità alle pagine che si posizionano più altoElevata rilevanza dei siti che si posizionano più altoPresenza soprattutto di grandi marchi nella top 10Tipo di contenuto dominante che non hai le risorse per creareUlteriori approfondimentiDifficoltà delle parole chiave: come stimare le tue possibilità di posizionartiRicerca ciò che le persone vogliono sapereSupponiamo che vuoi voglia posizionarti per la parola chiave inglese “affiliate marketing”. Dall’analisi dell’intento risulta chiaro che gli utenti stanno cercando un post su un blog. Ma cosa vogliono sapere nello specifico? Questa è la domanda a cui devi rispondere se vuoi produrre i migliori contenuti agli occhi di Google.Un modo per rispondere a questa domanda è cercare punti in comune tra le pagine più in alto su Google.Ad esempio, tutte le pagine che puntano a questa parola chiave e che si posizionano in alto includono una definizione:Funziona, ma può richiedere molto tempo.Spesso è più rapido eseguire un’analisi del gap di contenuto a livello di pagina sulle pagine ch si posizionano più alto per trovare le parole chiave per le quali si posizionano. Alcune di queste spesso puntano ai sottoargomenti trattati nelle pagine.Ecco come farla con Ahrefs: Vai sullo strumento Competitive AnalysisInserisci l’URL della tua pagina come destinazione (aggiungi l’URL che intendi utilizzare se non hai ancora creato la tua pagina)Inserisci gli URL di alcune pagine che si posizionano in alto come targetClicca su “Compare”Da lì, vai al rapporto Content Gap e cerca le parole chiave che rappresentano i sottoargomenti:Ottimizza i tuoi titoli e sottotitoliGoogle esamina titoli e sottotitoli per comprendere meglio il contenuto di una pagina. Per questo sono posti perfetti dove includere parole chiave target correlate ai tuoi contenuti.Ad esempio, questo sarebbe un modo logico per strutturare una pagina su frutta e verdura:H1: Frutta e Verdura H2: FruttaH3: MeleH3: AranceH2: VerduraH3: CaroteQuesto non solo ti porta naturalmente a includere parole chiave nei titoli e nei sottotitoli, ma rende i tuoi anche contenuti più facili da leggere.Attira i lettori con un’introduzione (solo per post del blog)Se non riesci a convincere i lettori che la tua pagina offre ciò che desiderano in pochi secondi, questi premeranno il pulsante “Indietro”. Si tratta di una scelta negativa perché se non leggono i tuoi contenuti, non eseguiranno azioni sul tuo sito, non li condivideranno o non li linkeranno.La formula PAS è un buon punto di partenza per un’introduzione interessante.Ad esempio, supponiamo che stiamo scrivendo un post su come cucinare la bistecca perfetta.Inizieremo descrivendo il problema:Quini creeremo urgenza:Infine sveleremo la soluzione: Modifica il contenuto per semplificarlo Negli Stati Uniti, il 50% della popolazione legge al di sotto del livello di lettura di terza media. Non sappiamo se questo sia vero anche altrove ma la regola per cui è bene essere semplici vale sempre.Per questo motivo, dovresti mantenere le cose semplici a meno che tu non voglia alienare 1 visitatore su 2. Questo significa:Usare frasi e paragrafi breviUsare parole e frasi sempliciEvitare un linguaggio ricco di parole ed espressioni particolari o allusiveHemingway è uno strumento gratuito basato su browser che può aiutare in questo. Assegna un voto al tuo contenuto e suggerisce miglioramenti.Inserisci link alle risorse pertinentiLe persone spesso pensano che linkare altri siti sia in qualche modo dannoso per la SEO. Questo non è vero. Probabilmente non aiuterà molto la tua SEO, ma non la danneggerà (a meno che tu non link siti loschi).Ecco le parole di John Mueller, di Google, al proposito:Linkare altri siti è un ottimo modo per dare valore ai tuoi utenti. Spesso, i link aiutano gli utenti a saperne di più, a controllare le tue fonti e a capire meglio in che modo i tuoi contenuti sono rilevanti per le loro domande.Questo significa che devi inserire per forza dei link esterni nei tuoi contenuti? No. Significa semplicemente che devi aggiungerli se e quando ha senso, ad esempio se hai bisogno di fare riferimento a una fonte.Rendi i contenuti più facili da fruire grazie alle le immaginiNessuno vuole leggere un muro di testo. È troppo e può portare le persone ad abbandonare la pagina. Le immagini aiutano a risolvere questo problema suddividendo il testo e favorendo la comprensione visiva.Non solo: le immagini possono posizionarsi su Google Immagini e inviare ancora più traffico verso il tuo sito.Ad esempio, secondo Search Console, Google Immagini ha inviato al nostro blog quasi 20.000 visite organiche negli ultimi tre mesi:Senza dubbio questo numero sarebbe ancora più alto se fossino in una nicchia molto ricca visivamente come il cibo o il design.Detto questo, non inserire immagini casuali nei tuoi contenuti solo per il gusto di farlo. Sforzati di utilizzare immagini che servano effettivamente a uno scopo e aiutino i lettori a visualizzare l’argomento.Ottimizza le tue immaginiSe hai già eseguito le operazioni “da una volta” presenti in questa checklist SEO, dovresti aver già installato un plug-in di compressione delle immagini. Ma ci sono un paio di altre ottimizzazioni delle immagini che dovresti fare pagina per pagina:Assegna un nome descrittivo alle immagini: non utilizzare nomi di file di immagine generici come IMG_875939.png o Screenshot-2021–06-01. Utilizza nomi di file descrittivi come black-puppy.png o eiffel-tower.jpgAggiungi testo alternativo descrittivo: il testo alternativo sostituisce un’immagine sulla pagina quando non riesce a caricarsi. È utile anche per chi utilizza lettori di schermo. Scopri di più qui.Ulteriori approfondimenti15 Consigli SEO Per Incrementare Il Traffico OrganicoImposta un titolo e una meta descrizione accattivantiTitoli e meta descrizioni vengono visualizzati nei risultati di ricerca di Google per aiutare gli utenti a capire di cosa tratta la pagina.Nota a margine. Google utilizza le meta descrizioni per lo snippet descrittivo nei risultati di ricerca il 62,78% delle volte. Il resto del tempo utilizza qualcos’altro dalla pagina. Ciò rende il titolo di gran lunga più importante della meta descrizione.È consigliabile includere la parola chiave target (o una variante simile) nel titolo dove ha senso. Oltre a ciò, è necessario fare in modo che il titolo e la meta descrizione siano il più avvincenti possibile.Ecco alcuni consigli:Mantienili brevi: meno di 70 caratteri per il tag del titolo e meno di 160 per la meta descrizione. Ciò aiuta a prevenire il troncamentoCorrispondenza all’intento di ricerca: fai capire agli utenti che hai ciò che stanno cercandoNon fare clickbait: sii onesto su cosa c’è nella tua pagina. Non fare promesse eccessive.Includi l’anno: nel tag del titolo per gli argomenti che richiedono freschezza.CONSIGLIOSe hai difficoltà a trovare un titolo o una meta descrizione convincente, prova a chiedere a ChatGPT di fare il lavoro per te:Ulteriori approfondimentiCome Scrivere Titoli Ottimizzati SEOCome Scrivere la Meta Description PerfettaImposta un breve slug descrittivoLo slug è l’ultima parte dell’URL:Google dice di utilizzare parole pertinenti ai tuoi contenuti. Questo aiuta anche gli utenti a capire di cosa tratta la tua pagina prima di cliccare.Il modo più semplice per farlo è impostare lo slug sulla parola chiave target:https://ahrefs.com/blog/seo-checklist/Tuttavia, questo non ha sempre senso. Dipende dalla struttura dell’URL.Per esempio il nostro glossario SEO ha come target la parola chiave “glossario SEO” in inglese. Ma poiché lo abbiamo pubblicato su ahrefs.com/seo, abbiamo utilizzato solo glossario per lo slug e non glossario SEO per evitare inutili ripetizioni della parola “SEO”.Inoltre, più brevi sono e meglio è perché gli URL lunghi tendono ad essere troncati nelle SERP:Ulteriori approfondimentiCome creare URL SEO friendlyAggiungi il markup dei dati strutturati per i rich snippetGli schema markup possono influire sul modo in cui le tue pagine appaiono nei risultati di ricerca.Ad esempio, ecco una pagina che attualmente è classificata come “ricetta impasto per pizza” in inglese:Le valutazioni a stelle, il numero delle revisioni e il tempo di preparazione vengono visualizzati tutti grazie al markup.Se desideri avere diritto a questo tipo di “risultati avanzati”, ecco un elenco completo delle funzionalità creato da Google, insieme ai dati strutturati che devi utilizzare.Dal punto di vista dell’implementazione, puoi scrivere tu il markup e aggiungerlo alla tua pagina oppure utilizzare un plugin che lo crei per te. Yoast funziona con alcuni di questi.Ulteriori approfondimentiRich Snippet: Cosa Sono e Cosa Fare Per Averli?Aggiungi un sommario (solo post del blog)Un sommario offre collegamenti rapidi a diverse sezioni della pagina.Aggiungerli ai post più lungh ha senso per aiutare la navigazione degli utenti. Possono anche aiutarti a ottenere sitelink nei risultati di ricerca:Ulteriori approfondimentiCosa Sono i Sitelink? Come Poterli InfluenzareAggiungi link interni alla nuova paginaI link interni aiutano Google a trovare le pagine del tuo sito e a comprenderne l’argomento.La maggior parte delle piattaforme per siti aggiungono automaticamente link interni alle nuove pagine dalle loro pagine “genitori”, ma puoi potenziare ulteriormente le nuove pagine aggiungendo link interni più contestuali.Ad esempio, quando pubblichiamo nuovi post sul blog, WordPress li linka automaticamente internamente nella home page del nostro blog:Questo è positivo, ma probabilmente ci sono molti altri posti in cui avrebbe senso linkare questo post. Aggiungendo altri collegamenti interni, possiamo indirizzare più persone a questa guida e dire a Google quanto pensiamo sia importante.Ecco come trovare opportunità di link interni gratuitamente con Ahrefs Webmaster Tools (AWT):Scansiona il tuo sito con Site AuditVai su Page ExplorerCerca la tua parola chiave target nel “Testo della pagina” di altre pagineSi tratta quindi semplicemente di visitare le pagine, cercare la parola chiave presenti al loro interno e aggiungere un collegamento contestuale se e dove ha senso.Eccone uno che abbiamo aggiunto dal nostro elenco di strumenti gratuiti per la ricerca di parole chiave:Promuovi i tuoi contenuti facendo outreach (facoltativo)Le persone non possono linkare i tuoi contenuti se non sanno che esistono. Ecco perché vale la pena fare attività di link building, soprattutto se stai cercando di posizionarti per una parola chiave competitiva.Esistono molti modi per farlo, ma la Reverse Skyscraper Technique è un buon punto di partenza.Ecco come funziona:Trova pagine concorrenti e di qualità inferiore con backlinkChiedi invece alle persone che linkano questi contenuti di linkare i tuoiPer trovare pagine concorrenti con backlink, inserisci semplicemente la tua parola chiave nel Keywords Explorer di Ahrefs e scorri fino alla panoramica SERP:Quindi visita le pagine e individua i motivi per cui i tuoi contenuti sono migliori, ad esempio:Il loro contenuto è impreciso e obsoletoNon spiegano le cose nel dettaglioIl loro design è pessimoSi tratta quindi semplicemente di proporre il tuo link come sostituto a chiunque abbia linkato quella pagina. Per trovare questi siti, inseriti la pagina nel Site Explorer di Ahrefs e controlla il report Backlink.Ulteriori approfondimentiCome ottenere backlink: 15 tattiche che funzionanoConclusioniLa SEO è un processo continuo ed è impossibile includere tutto ciò che è importante in un’unica checklist SEO definitiva. Detto questo, se lavori sugli elementi della checklist che ti ho presentato sarai sulla buona strada per posizionarti più in alto. Probabilmente sarai anche molto più avanti della concorrenza. Questo è tutto ciò che conta.Se vuoi sapere di più su come utilizzare fattivamente la checklist SEO, consulta il nostro corso di formazione SEO gratuito.Vuoi ancora più idee per fare SEO? Leggi i nostri consigli.E se cerchi strumenti per fare SEO, controlla la nostra lista di strumenti SEO gratuiti. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "La Checklist SEO Indispensabile Nel 2024 [Con Template]"
    },
    {
      "level": "H2",
      "text": "Come impostare e utilizzare la nostra checklist SEO"
    },
    {
      "level": "H2",
      "text": "Attività da fare una volta"
    },
    {
      "level": "H3",
      "text": "Installa un tema SEO-friendly"
    },
    {
      "level": "H3",
      "text": "Determina la struttura del tuo sito"
    },
    {
      "level": "H3",
      "text": "Utilizza una struttura descrittiva per gli URL"
    },
    {
      "level": "H3",
      "text": "Installa un plugin SEO"
    },
    {
      "level": "H3",
      "text": "Configura Google Search Console"
    },
    {
      "level": "H3",
      "text": "Configura Bing Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Crea e invia una sitemap"
    },
    {
      "level": "H3",
      "text": "Assicurati che il tuo sito sia indicizzabile"
    },
    {
      "level": "H3",
      "text": "Aggiungi lo schema markup alla tua home page"
    },
    {
      "level": "H3",
      "text": "Assicurati che il tuo sito sia ottimizzato per i dispositivi mobili"
    },
    {
      "level": "H3",
      "text": "Assicurati di utilizzare HTTPS"
    },
    {
      "level": "H3",
      "text": "Assicurati che il tuo sito sia accessibile da un dominio"
    },
    {
      "level": "H3",
      "text": "Assicurati che il tuo sito si carichi velocemente"
    },
    {
      "level": "H3",
      "text": "Installa un plugin per la compressione delle immagini"
    },
    {
      "level": "H3",
      "text": "Attiva un Google Business Profile gratuito"
    },
    {
      "level": "H3",
      "text": "Copia i backlink dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "Attività da fare periodicamente"
    },
    {
      "level": "H3",
      "text": "Sistema le pagine rotte"
    },
    {
      "level": "H3",
      "text": "Aggiorna i contenuti in declino"
    },
    {
      "level": "H3",
      "text": "Analizza i gap di contenuto"
    },
    {
      "level": "H3",
      "text": "Aggiorna il tuo Google Business Profile"
    },
    {
      "level": "H3",
      "text": "Verifica la presenza di altri problemi tecnici"
    },
    {
      "level": "H2",
      "text": "Attività da fare per ogni pagina"
    },
    {
      "level": "H3",
      "text": "Trova una parola chiave principale su cui puntare"
    },
    {
      "level": "H3",
      "text": "Valuta l’intento di ricerca"
    },
    {
      "level": "H3",
      "text": "Valuta le tue possibilità di posizionarti su Google"
    },
    {
      "level": "H3",
      "text": "Ricerca ciò che le persone vogliono sapere"
    },
    {
      "level": "H3",
      "text": "Ottimizza i tuoi titoli e sottotitoli"
    },
    {
      "level": "H3",
      "text": "Attira i lettori con un’introduzione (solo per post del blog)"
    },
    {
      "level": "H3",
      "text": "Modifica il contenuto per semplificarlo"
    },
    {
      "level": "H3",
      "text": "Inserisci link alle risorse pertinenti"
    },
    {
      "level": "H3",
      "text": "Rendi i contenuti più facili da fruire grazie alle le immagini"
    },
    {
      "level": "H3",
      "text": "Ottimizza le tue immagini"
    },
    {
      "level": "H3",
      "text": "Imposta un titolo e una meta descrizione accattivanti"
    },
    {
      "level": "H3",
      "text": "Imposta un breve slug descrittivo"
    },
    {
      "level": "H3",
      "text": "Aggiungi il markup dei dati strutturati per i rich snippet"
    },
    {
      "level": "H3",
      "text": "Aggiungi un sommario (solo post del blog)"
    },
    {
      "level": "H3",
      "text": "Aggiungi link interni alla nuova pagina"
    },
    {
      "level": "H3",
      "text": "Promuovi i tuoi contenuti facendo outreach (facoltativo)"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}