{
  "url": "https://ahrefs.com/blog/it/esternalizzare-la-seo/",
  "slug": "esternalizzare-la-seo",
  "title": "Come esternalizzare la SEO (framework semplice)",
  "description": "Impara a sistematizzare ed esternalizzare qualsiasi task SEO usando un framework semplice in tre passaggi.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Se stai a sentire quello che dice la gente, sembra che esternalizzare la SEO sia un sogno. Tu trascorri le tue giornate a sorseggiare dei cocktail sulla spiaggia mentre altri fanno il lavoro sporco al posto tuo.Ma la gente spesso si dimentica di dire che esternalizzare bene è difficile.Non puoi limitarti ad assumere la prima persona che trovi senza offrire alcuna formazione, e poi semplicemente ordinare un altro mojito. Esternalizzare la SEO con successo implica creare dei sistemi, assumere delle persone capaci e imparare a gestirle efficacemente.In questa guida imparerai come sistematizzare ed esternalizzare la SEO usando un framework semplice in soli tre passaggi.Ma prima riepiloghiamo le basi…Che cosa vuol dire esternalizzare la SEO?Perché esternalizzare?Come esternalizzare la SEO (framework in 3 passaggi)Che cosa vuol dire esternalizzare la SEO?Esternalizzare la SEO comporta assumere dei freelance, delle agenzie o dei dipendenti temporanei per aiutare a scalare le operazioni per posizionarsi meglio sui motori di ricerca.Perché esternalizzare?Esternalizzare ti libera del tempo per concentrarti su questioni più importanti e ti aiuta a dedicare più tempo a questioni dove il tuo contributo è più importante. Ad esempio può trattarsi della gestione dei collaboratori dipendenti, della crescita del business o anche solo della supervisione della strategia SEO a un livello più alto.Tra gli altri benefici dell’esternalizzazione ricordiamo:Diminuzione della monotoniaRiduzione del carico di lavoroMaggior facilità di scalare il proprio business.Come esternalizzare la SEOTutti fanno SEO in modo diverso, quindi non ha molto senso spiegare come esternalizzare compiti singoli come la ricerca delle keyword o la link building. Analizzerò invece un framework semplice che puoi usare nella maggior parte delle situazioni.Creare delle procedureAssumere dei freelanceGestire e perfezionarePasso 1. Creare delle procedureLe procedure sono dei documenti dettagliati che spiegano come svolgere un compito dall’inizio alla fine. Quando dico dettagliati, intendo proprio dire dettagliati.Ecco come potrebbe essere la procedura del lavaggio dei capelli:Accendi la doccia.Usa la bocchetta della doccia per inumidire i capelli.Prendi il flacone dello shampoo.Spremi lo shampoo sulla mano.Friziona lo shampoo nei capelli.Risciacqua con la bocchetta della doccia.Spegni la doccia.Asciuga i capelli con un asciugamano.La maggior parte delle aziende più grandi del mondo si basa sulle procedure per far sì che le cose funzionino come devono. Prendi ad esempio McDonald’s. In tutti i suoi ristoranti, i cibi hanno lo stesso sapore e l’esperienza è praticamente identica. Puoi ordinare un Big Mac dovunque tu sia e le parole successive che sentirai saranno sempre: “Vuole il menù?”Questo perché McDonald’s ha delle procedure dettagliate che garantiscono la coerenza in ciascuno delle migliaia di ristoranti.Ma la coerenza non è l’unico vantaggio dato dalla creazione delle procedure.Ce ne sono altri cinque:Rendono più facile assumere nuove persone. Questo è utile perché i freelancer hanno la fama di essere poco efficienti, quindi probabilmente dovrai assumere e formare nuove persone che ti aiutino di tanto in tanto.Aiutano a tenere in riga i freelancer che già lavorano per te. Se qualcuno si prende un periodo di vacanza o non lavora per un po’, le procedure sono un modo pratico per aiutarlo a tornare nel flusso del lavoro.Aiutano a far fare le cose nel modo giusto. Hai documentato esattamente come deve essere svolto ciascun compito, quindi le cose andranno meglio e più velocemente.Ti evitano di dover rispondere milioni di volte alle stesse domande. La maggior parte dei nuovi assunti farà le stesse domande. Se riesci a riconoscere quali sono, puoi inserirle nelle procedure e non dovrai più sentire la frase: “Come faccio a fare questa cosa?”.Ti aiutano ad affinare i processi. Di questo parleremo meglio nel seguito.Sembra un lavoro titanico, e in effetti lo è. È un’impresa non banale che richiede un mucchio di tempo e fatica, quindi probabilmente non dovresti provare a esternalizzare tutta la SEO in un colpo solo.Invece puoi provare a scegliere un aspetto della SEO, scomporlo in sottotask e poi creare una procedura per ciascuno dei sottotask.Ad esempio se inizi con la link building, puoi scomporla in tattiche come la rivendicazione delle citazioni senza link, la broken link building e la Skyscraper technique. Poi puoi scomporre ciascuna di queste tattiche in macropassaggi, come il prospecting, la ricerca delle email e l’outreach.Scomporre le cose in task e sottotask in Google Docs.Una volta terminato questo passaggio, crea delle procedure per ogni task.Come? Ripercorri ogni step e documenta il processo nei dettagli. Se dovessi creare una procedura per rivendicare le citazioni senza link in Ahrefs, sarebbe fatta così:Nota a margine. Ecco un link alla procedura dell’esempio.Spetta a te decidere se vuoi creare delle procedure scritte o video. Solo non dare per scontato che le persone che assumi sappiano che cosa ti aspetti o abbiano esperienza nella SEO. Specifica sempre bene ogni singolo dettaglio fino al punto di visualizzazione.Se vuoi fare più in fretta, registra dei video e assumi qualcuno che li converta in procedure scritte.Tieni traccia di tutto linkando le procedure dal tuo documento.Passo 2. Assumere dei freelanceLa maggior parte delle persone cerca di assumere un solo freelance per fare tutto. È un errore perché compiti diversi richiedono competenze diverse, ed è comune che la qualità del lavoro si deteriora se lo si spalma troppo.Per questo motivo, è meglio raggruppare i task in base alle competenze e assumere più persone in base al tipo di competenza.Ad esempio, anche se abbiamo suddiviso il link building in varie tattiche, c’è molta somiglianza nei loro sottotask. È chiaro che probabilmente abbiamo bisogno di una persona per il prospecting, di un’altra per trovare informazioni di contatto, un’altra per inviare le e‑mail di outreach e un’altra ancora per scrivere un guest post di tanto in tanto.Raggruppiamo i sottotask per colore.Nota che se stai cercando di esternalizzare tutto avrai bisogno di qualcuno che gestisca tutto e che tenga i freelancer sulla buona strada. Tuttavia, se è la prima volta che gestisci un progetto in outsourcing, ti consiglio, per iniziare, di assumere tu il ruolo di manager. Si può iniziare ad esternalizzare una volta che si ha un’idea più chiara di cosa comporta ogni aspetto della gestione.In ogni caso, il processo da qui in poi è lo stesso:Per prima cosa, prendi ogni gruppo di task e pensa alle competenze e all’esperienza che richiede. È meglio raggruppare i task a seconda delle competenze “che bisogna avere assolutamente” e che “bisognerebbe avere ma non sono obbligatorie”.Ad esempio ecco come potrebbe essere il set di competenze per un dirigente che si occupa di outreach:Competenze che deve avere assolutamente:Buone capacità di comunicazione scrittaBuone capacità relazionaliBuone capacità organizzativeCompetenza con Google Docs/SheetsSaper scrivere velocemente al PCCompetenze che dovrebbe avere ma non sono obbligatorie:Esperienza con PitchboxComprensione di base di ciò che comporta l’outreach lato SEOEsperienza nel fare outreach per la SEOIn un secondo momento puoi creare annunci di lavoro da queste descrizioni su un sito dedicato ai freelance come UpWork e iniziare ad assumere delle persone.È così semplice come sembra?Ovviamente no. Il processo di assunzione potrebbe occupare da solo tutto un altro post del blog, e proprio per questo non entrerò troppo nei dettagli. Ti lascio però alcuni consigli essenziali:Inizia con un task di prova retribuito. Se qualcuno sembra promettente, non credergli sulla parola. Assumilo per un compito una tantum retribuito e valuta il suo lavoro. La maggior parte delle persone promette tanto ma poi messa alla prova non mantiene, quindi questo è un primo passo necessario.Assumi dei candidati per un periodo di prova. Se il freelance sembra ancora promettente dopo il primo incarico, assumilo per un periodo limitato e vedi come vanno le cose. Metti in conto però un livello di frustrazione e lentezza esasperante. Se l’auto di qualcuno si rompe tre volte alla settimana, probabilmente non sarà la migliore per un noleggio a lungo termine.Assumere velocemente, licenziare velocemente. È estremamente improbabile che il tuo primo ingaggio si riveli la soluzione giusta per la tua attività, quindi non perseverare inutilmente se la cosa non funziona. Non ha senso portare avanti una relazione che non funziona. È meglio per tutti se la tronchi non appena ti rendi conto che non sta funzionando.Passo 3. Gestire e perfezionareAnche se stai esternalizzando solo un aspetto della SEO come il link building, è comunque una cosa complicata da gestire con un sacco di parti in movimento. Ecco perché ti serve uno strumento per il project management per tenere traccia di tutto.In giro ce ne sono un sacco, ma ti consiglio di sceglierne uno che abbia le tavole kanban come Trello. Puoi usarlo per creare una linea di produzione visuale per ogni task.Ecco come potrebbe essere per una delle nostre tattiche di link building:Come puoi vedere, la prima colonna è per le SOP. Questo facilita i freelancer nel compito di trovare velocemente le istruzioni di cui hanno bisogno. Le altre colonne sono sottotask. L’idea è che ogni volta che si inizia una nuova campagna, il manager crea una scheda nella prima colonna e tagga la persona responsabile del task.Quella persona sarà poi responsabile di spostare la scheda nella colonna successiva una volta completata e di etichettare la persona giusta per mantenere il processo in movimento.Il modo migliore per garantire un flusso di lavoro scorrevole in questo caso è quello di includere questo passaggio come ultima istruzione nelle procedure.Ora, è importante rendersi conto che ci sono alcuni aspetti negativi nella creazione di un sistema così efficiente, uno dei quali è la sensazione tra i freelancer di essere “l’ennesimo ingranaggio della macchina”. È possibile scongiurare questo rischio facendo uno sforzo per mantenersi in contatto con loro regolarmente e facendo in modo che sappiano di essere un membro prezioso della squadra.Questo non significa necessariamente chiedere loro cosa hanno fatto nel fine settimana o cosa mangiano per cena, ma piuttosto fare loro domande del genere:C’è qualcosa nel tuo lavoro che posso aiutarti a chiarire?Hai incontrato delle difficoltà questa settimana?Come lavori insieme agli altri membri del team?Probabilmente rimarrai sorpreso da alcune delle risposte che ti daranno. A volte ti renderai conto che hanno equivocato la natura del loro task per tutto il tempo, mentre altre volte potrebbero suggerirti dei modi per migliorare i tuoi processi.Se questo dovesse accadere, non esitare a modificare le tue procedure. È un modo fantastico per migliorarle gradualmente nel tempo e rendere più efficienti tutti i membri della tua organizzazione.Dovresti anche tenere d’occhio le tue attività quotidiane. C’è un modo di dire piuttosto conosciuto che dice che non si dovrebbe mai fare la stessa cosa due volte. Se ti trovi a ripetere qualcosa più e più volte, ovviamente si tratta di un task che può essere sistematizzato ed esternalizzato.Considerazioni conclusiveTutto ciò che abbiamo detto è solo uno dei modi possibili per esternalizzare la SEO. Ci sono senza dubbio molte persone che esternalizzano i processi con successo usando un framework completamente diverso, e questo va bene. Il tuo lavoro come imprenditore è quello di trovare il framework che funziona nel tuo caso, metterlo in pratica e perfezionare continuamente le cose con il passare del tempo.Hai delle domande o dei suggerimenti? Fammelo sapere su Twitter.Tradotto da Elisa Bruno. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Come esternalizzare la SEO (framework semplice)"
    },
    {
      "level": "H2",
      "text": "Che cosa vuol dire esternalizzare la SEO?"
    },
    {
      "level": "H2",
      "text": "Perché esternalizzare?"
    },
    {
      "level": "H2",
      "text": "Come esternalizzare la SEO"
    },
    {
      "level": "H3",
      "text": "Passo 1. Creare delle procedure"
    },
    {
      "level": "H3",
      "text": "Passo 2. Assumere dei freelance"
    },
    {
      "level": "H3",
      "text": "Passo 3. Gestire e perfezionare"
    },
    {
      "level": "H2",
      "text": "Considerazioni conclusive"
    }
  ],
  "author": "Joshua Hardwick"
}