{
  "url": "https://ahrefs.com/blog/it/falsi-miti-seo/",
  "slug": "falsi-miti-seo",
  "title": "10 falsi miti sulla SEO",
  "description": "I falsi miti sulla SEO possono portarti a perdere tempo e soldi preziosi su cose che non miglioreranno la SEO. Questo post raccoglie e combatte alcuni falsi miti diffusi sulla SEO.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti La maggior parte dei miti sono innocui. I chewing gum ci mettono sette anni per essere digeriti. Gli squali non si ammalano di cancro. I fulmini non colpiscono mai due volte lo stesso posto..Purtroppo lo stesso non si può dire della maggior parte dei miti che riguardano la SEO. Nella migliore delle ipotesi sono leggermente fuorvianti. Nel peggiore dei casi portano a sprecare tempo prezioso, denaro e risorse per cose che mai miglioreranno la SEO.Quindi sfatiamo insieme una volta per tutte qualche mito sulla SEO piuttosto diffuso.La SEO è mortaLa SEO è una cosa che si fa una volta per tutteGoogle posiziona solo i contenuti “freschi”Le parole chiave long tail sono più facili da posizionareI contenuti duplicati ti penalizzanoI segnali sociali aiutano il posizionamentoLa pubblicità PPC non può aiutarti a migliorare il posizionamentoIl PageRank non ha più importanzaLa SEO riguarda solo il posizionamentoLa ricerca delle parole chiave non è importante1. La SEO è mortaForse questa è più una sciocchezza che un mito, ma vale comunque la pena di metterla a tacere una volta per tutte.Il giornalismo pigro ama piangere regolarmente la morte di molte cose, e la SEO non fa eccezione. Secondo il Content Explorer di Ahrefs, questa frase è stata scritta 3.367 volte dal giugno 2016.In media, sono 66 volte al mese.Quindi mettiamo le cose in chiaro una volta per tutte:La SEO. Non. È. Morta.Come facciamo a saperlo? Beh, ecco il traffico da ricerca organica del nostro blog degli ultimi tre mesi:2,1 milioni di visite… tutte dalla “SEO”.Allora perché la gente continua a dire che la SEO è morta?Le ragioni sono di mille tipi diversi, ma la motivazione più importante che viene attualmente sollevata riguarda la prevalenza crescente di risposte come questa nei risultati di ricerca:Questo risultato ha un impatto negativo sul numero di clic sui risultati della ricerca? Certamente. Se esaminiamo questa query nel Keywords Explorer di Ahrefs, vediamo solo 1.200 clic su un volume di ricerca mensile stimato di 14.000. Questo significa che le persone cliccano solo l’8% delle volte.Ma questo non significa che la SEO sia morta. Da questa parola chiave è ancora possibile ottenere dei clic, e Google mostra comunque le risposte nei risultati della ricerca solo per alcune parole chiave.La verità è che finché i motori di ricerca esisteranno, verranno utilizzati e mostreranno risultati organici che si possono influenzare in qualche modo, allora la SEO non sarà morta.2. La SEO è una cosa che si fa una volta per tutteLa SEO è un po’ come andare in palestra. Va bene saltare un allenamento qua e là, ma le cose cominciano presto ad andare male se si rimane a casa a mangiare patatine troppo spesso. (Fidati, so come funziona…)Ecco che cosa succede quando si inizia a trascurare la SEO:Prima di questo periodo, stavo ottimizzando attivamente il sito. Poi ho iniziato a trascurarlo e ho spostato la mia attenzione su altre cose. Come puoi vedere, il traffico ha iniziato a diminuire lentamente nei mesi successivi.Ci sono diverse ragioni per cui questo può accadere:i tuoi concorrenti ti superano (lavorando con costanza alla loro SEO;si cominciano a perdere backlink a causa della “rottura dei link”;il tuo contenuto perde di “freschezza” (vedremo tra un po’ che cosa vuol dire).Ecco perché la maggior parte dei professionisti SEO (74,71%) richiede un acconto mensile per i propri servizi, piuttosto che una tariffa oraria o una tariffa una tantum. Sanno che la SEO è un processo che richiede continuità e che i loro clienti devono fare un investimento a lungo termine per vedere i risultati.Questo vale in assoluto per tutti i siti? No. Ci sono rari casi in cui un sito, pur trascurato per anni, può continuare ad attirare traffico costante mese dopo mese.Ecco un esempio:Questo sito è stato aggiornato per l’ultima volta nel 2011, ma continua a ottenere circa 500 visite organiche al mese.3. Google posiziona solo i contenuti “freschi”Ripubblicare i contenuti è una cosa che facciamo spesso. Se filtriamo i post ripubblicati sul blog con Content Explorer di Ahrefs, troviamo 136 post ripubblicati dal 2016.Perché allora investiamo così tanto impegno nel mantenere aggiornati i nostri contenuti se la freschezza dei contenuti è un mito?La “freschezza” è un fattore di posizionamento che dipende dalla query di ricerca. Ciò significa che per alcune query di ricercaè più importante che per altre. Tutto dipende dal fatto che la freschezza del contenuto abbia o meno un impatto sulla qualità del contenuto.La SEO è in continua evoluzione, quindi la freschezza è importante per molte query di ricerca relative alla SEO.Ad esempio ecco cosa è successo quando per mesi non abbiamo aggiornato il nostro elenco delle ricerche più frequenti su Google:Come puoi vedere il traffico è calato per mesi, ma poi si è ripreso praticamente da un giorno all’altro quando abbiamo rinfrescato e ripubblicato il contenuto. Questo perché le ricerche più frequenti su Google cambiano continuamente, quindi chi legge questo contenuto si aspetta risultati “freschi”.Viceversa la freschezza non è particolarmente importante per una ricerca del tipo “come si fa a legare una cravatta”, perché si tratta di un processo che non cambia mai. Ecco perché Google è felice di posizionare nelle prime tre posizioni tre pagine che sono state aggiornate per l’ultima volta nel 2013.4. Le parole chiave long tail sono più facili da posizionareLa maggior parte delle persone pensa che le parole chiave long tail siano composte da molte parole, ma questo non è del tutto corretto. Le parole chiave long tail sono query con un basso volume di ricerca individuale. Il numero di parole non ha importanza.Ad esempio, entrambe queste query (“qual è il cibo giusto da mangiare per perdere peso” e “perdere peso”) sono parole chiave long tail:Ma il fatto è questo: anche se le parole chiave long tail ricevono poche ricerche mensili, di solito non sono più facili da posizionare rispetto alle loro controparti più popolari.Ad esempio guarda i punteggi di Keyword Difficulty di queste parole chiave (“come perdere peso” e “migliore dieta fai da te per perdere peso in fretta”):Nonostante la notevole differenza nei volumi di ricerca mensili, i punteggi sono all’incirca gli stessi. Questo perché la query a basso volume è ciò che ci piace chiamare una “parola chiave long tail di supporto”. In altre parole è un modo meno frequente di cercare un argomento popolare.Di solito non più facile posizionare queste parole chiave long tail, perché Google quasi sempre posiziona lo stesso insieme di risultati come per la parola chiave “principale”.Ora, in tutta onestà, c’è un altro tipo di parola chiave long tail che invece tende ad essere più facile da posizionare. Si tratta di quelle che ci piace chiamare “long tail che hanno un topic”. Puoi fare la loro conoscenza nella nostra guida completa alle parole chiave long tail.5. I contenuti duplicati ti penalizzanoHai un contenuto duplicato quando una copia esatta o quasi esatta di un contenuto appare in diversi posti, sullo stesso sito o in più siti diversi.Ad esempio entrambi questi URL ti portano allo stesso post:https://buffer.com/library/social-media-manager-checklist/https://buffer.com/resources/social-media-manager-checklist/Google ha ribadito in varie occasioni che non c’è nessuna penalità per i contenuti duplicati, ma questo mito continua ancora regolarmente a girare.Tuttavia, anche se i contenuti duplicati non ti penalizzano, possono causare problemi alla SEO, ad esempio:URL indesiderati o poco amichevoli nei risultati di ricerca;diluizione del backlink;spreco di crawl budget;contenuti raccolti da scraping o syndicated che si posizionano meglio dei tuoi.Se temi di avere contenuti duplicati sul tuo sito, esegui un crawl con lo strumento Site Audit di Ahrefs e controlla il report Duplicate content. Se vedi che ci sono dei cluster di duplicati esatti o di quasi duplicati, potrebbe valere la pena di risolvere il problema.Impara come si fa nella nostra guida per principianti ai contenuti duplicati.6. I segnali sociali aiutano il posizionamentoNon è inverosimile pensare che più i tuoi contenuti vengono condivisi su siti come Facebook, Twitter e Pinterest, più alto sarà il loro posizionamento. Dopotutto se un mucchio di persone condivide qualcosa, quel qualcosa essere interessante, prezioso e degno di essere posizionato, no?Forse è così, ma secondo John Mueller di Google, i segnali sociali non hanno un impatto diretto sui posizionamenti.https://www.youtube.com/watch?v=WszvyRune14#t=1192Questo probabilmente perché i segnali sociali sono incredibilmente facili da manipolare. Seriamente, fatti un giro su Fiverr. Può averne migliaia per pochi dollari.Ma se questo è vero, perché molte ricerche mostrano una correlazione tra le condivisioni e le menzioni sui social e il posizionamento?Non c’è una ragione definitiva per questo fatto, ma noi pensiamo che questi siano i due fattori che contribuiscono in modo più significativo:Più azioni di condivisione portano a una maggiore esposizione, e questo spesso porta a più backlink (che sono un fattore di posizionamento).Le pagine che si posizionano bene su Google ricevono più traffico, e alcuni dei visitatori condivideranno i contenuti sui social media.7. La pubblicità PPC non può aiutarti a migliorare il posizionamentoSiamo chiari: pagare Google per gli annunci non influenzerà direttamente il posizionamento. In fondo sono un complottaro come tanti, ma Google non migliorerà il tuo posizionamento perché gli stai riempiendo le tasche.Tuttavia questo non significa che la pubblicità PPC non possa indirettamente aiutarti a migliorare il posizionamento.E questo perché le pubblicità PPC possono aiutarti ad attirare backlink.Non ci credi? Di recente abbiamo speso 1.246 dollari su Google ads con l’intenzione di creare dei link a uno dei nostri post del blog. Il risultato? Abbiamo ottenuto backlink da undici nuovi siti.Ora questo non significa che si possa gestire una campagna di PPC qualsiasi e veder arrivare i backlink in automatico. La campagna deve avere una strategia.Scopri come abbiamo fatto in questo video:https://www.youtube.com/watch?v=Uz2bGhdnJN08. Il PageRank non ha più importanzaIl PageRank è il fondamento di Google. Esamina la quantità e la qualità dei backlink per giudicare il valore di una pagina.Google ha confermato che il PageRank è ancora un fattore di ranking nel 2018:DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (@methode) February 9, 2017Ma, da quando Google nel 2016 ha smesso di rendere pubblici i punteggi del PageRank, alcuni pensano che noi SEO non dovremmo più parlare di questa metrica:“Onestamente credo che CHIUNQUE nel 2018 non dovrebbe parlare del PageRank se non in contesti che si riferiscono al PageRank come storia passata. L’ultimo update ufficiale del PageRank è stato a gennaio/febbraio del 2013, più di 5 anni fa. In anni Internet, è come parlare di quando i primi esseri umani hanno lasciato l’Africa. Non ci sono buone ragioni per parlare di una metrica che da anni non ha ricevuto nessun update ufficiale e ora può essere trattata solo in via ipotetica. Adesso ci sono delle metriche migliori di cui vale la pena di parlare e che sono misurabili. Questo articolo non dovrebbe mai essere stato scritto e onestamente per quanto mi riguarda avete perso molta credibilità, perché ne avete parlato come di qualcosa che bisognerebbe tenere in considerazione. Dovreste eliminarlo e mandare una mail in cui vi scusate per aver parlato di cose vecchie, in un contesto che invece dovrebbe essere rilevante per l’attualità.”Quest’argomentazione ha senza dubbio qualche merito. Dopotutto non ha molto senso parlare di una metrica che non possiamo più vedere. Ma il fatto è che il PageRank è rimasto un segnale di ranking, il che significa che ottenere link di alta qualità alle tue pagine è ancora importante.Un ulteriore supporto al nostro punto è dato dal fatto che l’URL Rating (UR) di Ahrefs è ben correlato con il traffico di ricerca:Se non avete familiarità con l’URL rating, si tratta la nostra metrica di autorità a livello di pagina che funziona su principi simili, ma non identici, alla formula originale del PageRank di Google.9. SEO riguarda solo il posizionamentoTutti vogliono posizionarsi al primo posto, ma di solito è perché presuppongono che il risultato meglio posizionato sia quello che riceve più traffico. Tuttavia questo non è sempre vero. Il nostro studio su 100.000 query di ricerca mostra che la pagina meglio posizionata ottiene il maggior traffico di ricerca solo il 49% delle volte.Perché? Perché la maggior parte delle pagine riceve traffico da molte parole chiave, non da una sola.Ad esempio dai un’occhiata alle pagine meglio posizionate per “high protein diet” (dieta ad alto contenuto proteico). La pagina in seconda posizione ottiene più traffico stimato rispetto alla pagina in prima posizione perché si posiziona per più parole chiave che vengono effettivamente cercate.La lezione qui è che è il momento di smettere di angosciarsi per ottenere la prima posizione su Google e iniziare invece a concentrarsi sul traffico.Potete leggere di più su come si fa qui, ma le basi sono queste:Tratta l’argomento in modo approfondito.Costruisci più backlink per aumentare l’ ”autorità” a livello di pagina.Scrivi un contenuto che corrisponda all’intenzione di ricerca.10. La ricerca delle parole chiave non è importanteDato che la maggior parte delle pagine si posiziona per centinaia o migliaia di parole chiave, non c’è da meravigliarsi che alcune persone pensino che la ricerca delle parole chiave sia superata. Che senso ha ottimizzare per una sola parola chiave quando probabilmente si ottiene traffico da centinaia di keyword?Questo ragionamento ha un problema: la popolarità di una parola chiave di solito rispecchia il potenziale di traffico di ricerca complessivo dell’argomento.Prendi ad esempio queste due parole chiave (“ricerca keyword” e “local seo”):La seconda parola chiave ha la metà del volume di ricerca della prima. E se guardiamo il traffico stimato per ogni pagina posizionata al primo posto, vediamo che il page ranking per le parole chiave con maggior volume di ricerca ottiene molto più traffico organico.Nota a margine.Il volume di ricerca è di solito un buon indicatore del potenziale di traffico, ma non sempre. Tim spiega di più su quest’argomento qui.La ricerca delle parole chiave aiuta anche a garantire che stai ottimizzando per il modo più popolare in cui l’argomento viene cercato. Questo è importante se vuoi attirare più traffico organico possibile sulla tua pagina.Leggi la nostra guida completa alla ricerca delle parole chiave per saperne di più su come si fa la ricerca delle parole chiave in modo corretto.Considerazioni conclusiveQuesto elenco di falsi miti sulla SEO è completo? Direi di no. Questi sono solo alcuni di miti più frequenti che mi è capitato di incontrare più volte, quindi è utile metterli a tacere.Ho dimenticato qualche altro falso mito fastidioso? Dimmelo su Twitter.Tradotto da Elisa Bruno. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "10 falsi miti sulla SEO"
    },
    {
      "level": "H2",
      "text": "1. La SEO è morta"
    },
    {
      "level": "H2",
      "text": "2. La SEO è una cosa che si fa una volta per tutte"
    },
    {
      "level": "H2",
      "text": "3. Google posiziona solo i contenuti “freschi”"
    },
    {
      "level": "H2",
      "text": "4. Le parole chiave long tail sono più facili da posizionare"
    },
    {
      "level": "H2",
      "text": "5. I contenuti duplicati ti penalizzano"
    },
    {
      "level": "H2",
      "text": "6. I segnali sociali aiutano il posizionamento"
    },
    {
      "level": "H2",
      "text": "7. La pubblicità PPC non può aiutarti a migliorare il posizionamento"
    },
    {
      "level": "H2",
      "text": "8. Il PageRank non ha più importanza"
    },
    {
      "level": "H2",
      "text": "9. SEO riguarda solo il posizionamento"
    },
    {
      "level": "H2",
      "text": "10. La ricerca delle parole chiave non è importante"
    },
    {
      "level": "H2",
      "text": "Considerazioni conclusive"
    }
  ],
  "author": "Joshua Hardwick"
}