{
  "url": "https://ahrefs.com/blog/it/funnel-marketing/",
  "slug": "funnel-marketing",
  "title": "Funnel Di Marketing: Cos'È, Come Funziona e Come Si Crea",
  "description": "Il funnel di marketing è essenziale per capire il percorso dell'acquirente e ti aiuta a migliorare il tuo marketing in ogni fase.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Sapere come funziona un funnel di marketing può aiutarti a capire eventuali problemi e migliorare la tua strategia di marketing.In questa guida ti spiegherò tutto ciò che devi sapere sul funnel di marketing.Let’s get started.ContenutiCos’è un funnel di marketing?Il funnel di marketing è il metodo per definire il percorso dell’acquirente. Mostra come le persone passano dal conoscere il tuo brand a diventarne clienti.Chiaramente gli utenti passano da una fa se all’altra, abbandonandone alcune, perché non tutti quelli che che conoscono il tuo marchio diventeranno automaticamente clienti. Ecco il motivo della forma ad imbuto.Le fasi del funnel di marketingIl funnel di marketing si basa sul modello Awareness-Interest-Desire-Action (AIDA), sviluppato per la prima volta nel 1898 da E. St. Elmo Lewis, un sostenitore della pubblicità.Awareness (Consapevolezza) – Quando l’utente viene a conoscenza del tuo marchio, prodotto o servizio.Interest (Interesse) – Quando l’utente esprime interesse per il tuo prodotto o servizio.Desire (Desiderio) – Quando l’utente valuta il tuo prodotto o servizio. Questa fase è anche conosciuta come “Considerazione”.Action (Azione) – Quando l’utente diventa cliente. Questa fase è nota anche come “Conversione”.Analizziamo singolarmente le varie fasi del funnel.1. AwarenessLa fase di Awereness/Consapevolezza è quella in cui l’utente scopre per la prima volta il tuo marchio.Ad esempio, potrebbe cercare qualcosa su YouTube, trovare il tuo video e guardarlo:A queasto punto, sa che esisti.2. InterestLa fase di interesse si verifica quando l’utente inizia a interagire con il tuo marchio.Ad esempio, potrebbe guardare altri video, iscriversi al tuo canale YouTube, visitare il tuo sito ed iscriversi alla tua newsletter.Ora sa cosa fai o vendi ed è interessato.3. DesireLa fase del Desiderio (conosciuta anche come Considerazione) avviene quando l’utente valuta il tuo prodotto o servizio.Solo perché sa chi sei e cosa fai non significa che automaticamente sceglierà il tuo prodotto. Valuterà le alternative, leggerà le recensioni, parlerà con amici e familiari e confronterà prezzi e caratteristiche.Ad esempio, Ahrefs stima centinaia di ricerche mensili per le recensioni di del whisky Talisker:4. ActionLa fase di azione si verifica quando l’utente ha deciso di acquistare da te.Ti ha scelto e ha aggiunto il tuo prodotto al carrello.Il tuo obiettivo è rendere semplice finalizzare la scelta e cliccare su “acquista”.Perché il funnel di marketing è importante?Le persone non seguono la canalizzazione in modo lineare. Possono andare avanti e indietro, rimanere in una fase senza progredire e altro ancora.È impossibile per qualsiasi team di marketing pianificare le infinite variazioni che potrebbero verificarsi nel funnel.Dunque il funnel di marketing semplifica il percorso del cliente e funge da modello mentale per le aziende per adattare il proprio marketing permettendoti di eseguire tattiche di marketing specifiche in ogni fase.Se non ti focalizzi in maniera intenzionale, alcune fasi del tuo funnel di marketing potrebbero venir trascurate e potresti ritrovarti con dei “buchi” in grado di portare ad un tasso di abbandono maggiore del previsto (ovvero, un funnel “che perde”).Ad esempio, potresti indirizzare molto traffico al tuo sito ma, pur facendolo, potresti notare che nessuno degli utenti si iscrive alla tua newsletter. Il funnel di marketing può aiutarti a lavorare su questo problema, permettendoti di risolverlo.Come creare un funnel di marketingOgni azienda ha uno specifico percorso del cliente e, quindi, un funnel di marketing. Quindi, in teoria, non puoi “creare” un funnel di marketing: puoi solo modificarlo e migliorarlo.In pratica, “creare” un funnel di marketing significa pianificare attività di marketing in ogni fase. Per facilitare l’implementazione, molti esperti di marketing semplificano ulteriormente la canalizzazione in tre fasi:Top of the funnel (TOFU) – Awareness (Consapevolezza)Middle of the funnel (MOFU) – Interest (Interesse)Bottom of the funnel (BOFU) – Desire e Action (Desiderio e Azione)Ecco le tattiche che puoi implementare in ogni fase:1. Top of funnel (TOFU)La parte superiore dell’imbuto è la fase di Consapevolezza. Il tuo obiettivo è “aprire il funnel”, ovvero presentare il tuo brand a quante più persone rilevanti possibile.Ecco alcuni modi per farlo:Scegli come target le parole chiave TOFUI tuoi potenziali clienti stanno quasi sicuramente cercando informazioni relative a ciò che vendi su Google. Quindi il tuo scopo è che il tuo sito sia visibile nei risultati di ricerca.Nella fase di Awareness, ti consigliamo di creare parole chiave legate ai contenuti che i tuoi clienti target probabilmente cercheranno all’inizio del loro viaggio.Ad esempio, ecco come potrebbe essere il percorso di un potenziale cliente di Ahrefs, un set di strumenti completo per l’ottimizzazione delle pagine per i motori di ricerca (SEO):Come puoi vedere, le persone nella fase di Awareness non sanno che esistiamo e potrebbero anche non sapere che la SEO è la soluzione al loro problema. Potrebbero invece cercare qualcosa di più ampio, ad esempio come ottenere traffico sul loro sito.Quindi, prendendo di mira queste parole chiave, possiamo introdurre gli utenti alla SEO e, quindi, al nostro brand.Ecco come trovare le parole chiave TOFU:Vai sul Keywords Explorer di AhrefsInserisci le parole legate alla fase iniziale del funnel (per Ahrefs, saranno parole chiave come “traffico blog” e “traffico sito web” ovvero, in inglese secondo l’esempio sotto, “blog traffic” e “website traffic”)Vai sul report Termini CorrispondentiDa qui, ti consigliamo di scorrere l’elenco per trovare parole chiave legate al tuo sito. Ad esempio, potremmo probabilmente scegliere come target questa parola chiave per Ahrefs:Attingi al pubblico di altre personeAlcune persone nel tuo settore hanno già un vasto pubblico di lettori, ascoltatori e spettatori fedeli. Puoi sfruttarlo ed esporre il tuo brand a questo gruppo di persone. Ad esempio, il nostro chief marketing officer, Tim Soulo, è spesso ospite di podcast:https://www.youtube.com/watch?v=7d5HVT6kgU0Ecco come puoi trovare potenziali opportunità per podcast:Trova un podcast interessante nella tua nicchiaVai sul Site Explorer di AhrefsInserisci l’indirizzo del sito del podcastVai sul report BacklinkNel filtro “Titolo della pagina di riferimento”, cerca “episodio”Le apparizioni nei podcast non sono l’unico modo. Puoi partecipare a un webinar, presentare a una conferenza, scrivere un guestpost o co-creare contenuti.Us gli annunciChe si tratti di annunci o sponsorizzazioni di YouTube, migliaia di brand si sono fatti conoscere tramite gli annunci pubblicitari.È una delle tattiche più provate e testate per costruire la brand awareness.Se hai il budget, è un ottimo modo per attirare l’attenzione sul tuo marchio.2. Middle of funnel (MOFU)La parte centrale dell’imbuto è la fase di interesse. Il tuo obiettivo è catturare l’interesse delle persone, coltivarlo e convincerle che il tuo è il prodotto giusto per loro.Ecco alcuni modi per farlo:Scegli come target le parole chiave MOFUIn questa fase, il nostro cliente target sa cos’è il SEO. Sa anche di aver bisogno di uno strumento SEO.Quindi creare contenuti per la parte centrale della canalizzazione significa prendere di mira argomenti relativi a:Strumenti SEOStrumenti per ogni aspetto della SEO (ad esempio strumenti di ricerca di parole chiave, strumenti per backlink, etc)Versioni gratuite degli strumenti (ad esempio, controllo backlink gratuito).Ecco come trovare queste parole chiave:Vai sul Keywords Explorer di AhrefsInserisci le parole legate alla fase centrale del funnel (ad esempio “seo,” “backlink,” “keyword”)Vai sul report Termini CorrispondentiNel filtro “Includi”, aggiungi termini come “strumento”, “strumenti”, “controllore”, “calcolatrice” (nel nostro esempio in inglese)Guarda l’elenco e scegli le parole chiave pertinenti.Invita le persone a iscriversi alla tua newsletterQualcuno può indicare il proprio interesse per il tuo brand in vari modi. Tuttavia, non sono tutti: esiste una gerarchia di valore per ciascuna piattaforma:What do you think the conversion rate is between followers on different platforms?Like I think a Twitter follower is more valuable than an Instagram follower, which is more valuable than a Facebook follower… but what’s the ratio? Where does TikTok rank?— Nat Eliason (@nateliason) December 6, 2020 L’e-mail è l’ ”indicazione di interesse” con il valore più alto. È un permesso esplicito da parte di qualcuno di accedere alla propria casella di posta.Il tuo scopo è assicurarti che i visitatori del tuo sito si iscrivano alla tua newsletter. Utilizza gli inviti all’azione per incoraggiarli a iscriversi. Noi, ad esempio, abbiamo una casella di iscrizione alla nostra newsletter in ogni post del blog e che segue lo scorrimento del post in lettura: Puoi aggiungere incentivi per spingere all’azione, proprio come fa Intercom che offre un prodotto gratuito da scaricare a chi si iscrive:Non dimenticare di creare una sequenza di “benvenuto” per presentare il tuo brand, prodotto, servizio o contenuto dopo la registrazione. Ad esempio, chi si iscrive alla nostra newsletter riceve un’email di “benvenuto” che introduce i migliori contenuti del nostro blog:Ottieni più recensioniSecondo un sondaggio del 2023 di PowerReviews:Il 93% degli acquirenti afferma che le valutazioni e le recensioni influiscono sull’acquisto o meno di un prodottoIl 91% delle persone legge sempre le recensioniIl 45% dei consumatori non acquisterà un prodotto se non sono disponibili recensioniNon commettere errori: le recensioni sono importanti. Il tuo scopo è quindi ottenere più recensioni sulle piattaforme più popolari nella tua nicchia. Potrebbe trattarsi di Google Reviews, TrustPilot o, se ti occupi di software, G2:Il modo migliore per ottenere recensioni elevate è creare un ottimo prodotto e offrire un’esperienza straordinaria ai tuoi clienti.Tuttavia, anche i clienti molto soddisfatti potrebbero non ricordarsi di lasciare una recensione, quindi ti consigliamo di chiederne una quando si presenta l’occasione. Ad esempio, un buon momento è dopo che hanno utilizzato il tuo prodotto o servizio (ad esempio, Airbnb chiede recensioni al termine del soggiorno).Infine, che siano buone o cattive, ti consigliamo di rispondere sempre alle recensioni. Uno studio di Harvard Business Review ha rilevato che rispondere alle recensioni produce valutazioni complessive migliori.Il mio collega Andrei Țiț risponde a tutte le recensioni del nostro prodotto:Insegna agli utenti come utilizzare il tuo prodottoTim una volta ha detto:La mia teoria è che le persone non scelgono il tuo prodotto e poi imparano come usarlo. È il contrario. Prima imparano come utilizzare il tuo prodotto e poi lo scelgono perché sanno già come usarlo.Usa i tuoi contenuti per aiutare le persone a capire come utilizzare il tuo prodotto nella loro vita quotidiana e lavorativa. Se vedono il tuo prodotto in azione, possono immaginare come usarlo.Tim Soulo, CMO AhrefsAd esempio, i nostri articoli e video su YouTube mettono in risalto il nostro set di strumenti. Mettiamo a disposizione anche numerosi corsi completi gratuiti che spiegano come risolvere i problemi SEO con il nostro set di strumenti:Offri una versione gratuita del tuo prodottoVedere per credere, si dice. Ma utilizzare il prodotto è l’unico modo per fare in modo che resti nella mente dei tuoi clienti. Ecco perché le aziende alimentari offrono campioni gratuiti: basta un assaggio per decidere se lo comprerai.Noi di Ahrefs offriamo versioni gratuite del nostro set di strumenti:Strumenti Ahrefs Webmaster – Accesso gratuito al Site Explorer e al Site Audit.Strumenti SEO Gratuiti – Vari strumenti gratuiti che ti aiuteranno nella ricerca di parole chiave, nella creazione di link e altro ancora.Se i potenziali clienti consumano i nostri contenuti e sono in grado di utilizzare i nostri strumenti gratuiti, noi saremo al primo posto nella loro mente quando e se decideranno di acquistare.3. Bottom of funnel (BOFU)La parte inferiore dell’imbuto è costituita dalle fasi Desiderio e Azione. Il tuo obiettivo è:Convinci i potenziali clienti a scegliere il tuo prodottoConvertirli in clienti pagantiEcco alcuni modi per farlo:Scegli come target le parole chiave BOFUIn questa fase, le persone stanno valutando. Si confrontano, chiedono ad amici e familiari e leggono recensioni. .Quindi creare contenuti per questa fase significa prendere di mira parole chiave di tipo comparativo. Ecco come trovarle:Vai sul Keywords Explorer di AhrefsInserisci il tuo brand e/o i tuoi concorrentiVai sul report Termini CorrispondentiNel filtro “Includi”, aggiungi termini come “vs”, “versus”, “recensione”, “recensioni” (nel nostro esempio in inglese)Crea una pagina di confrontoI tuoi potenziali clienti confronteranno tutte le soluzioni possibili. Puoi prendere il controllo della narrazione creando una pagina di confronto.In genere, la maggior parte delle aziende crea un confronto fianco a fianco in cui la loro soluzione vince “per convenienza”. A noi questa pratica standard non piace quindi abbiamo deciso di fare qualcosa di nuovo: includere recensioni e sondaggi di terze parti e discutere le funzionalità che solo il nostro set di strumenti ha.Rispondi alle loro obiezioni nella fase finaleParla con l’assistenza clienti, il team di vendita e gli account manager. Scopri cosa impedisce alle persone di acquistare. Ti consigliamo di creare contenuti che affrontino ciascuno di questi problemi.Dai alle persone un’ultima “spinta”Dai ai potenziali clienti un motivo convincente per acquistare adesso.Una tattica comune è quella di sfruttare l’urgenza. Ad esempio, Booking.com ti dice se è rimasta solo una stanza:Quindi, se le iscrizioni al tuo corso stanno per chiudersi o un prodotto sta per esaurirsi, avvisa i potenziali clienti.Un avvertimento: non fingere. Perderai la fiducia dei tuoi clienti.Metriche del funnel di marketingQuando costruisci la tua canalizzazione o funnel, devi assegnare delle metriche a ciascuna fase. Questo ti permetterà di migliorare la canalizzazione e a risolvere le situazioni in cui il funnel viene abbandonato dall’utente. La metrica esatta da misurare dipende dalla tua strategia, ma ecco alcune idee:MetricaDescrizioneTop of funnel (TOFU)UtentiIl numero di visitatori unici del tuo sito.Traffico organicoIl numero di clic sul tuo sito provenienti dai motori di ricerca (ad esempio Google).Posizionamento parole chiave (TOFU)Le posizioni organiche del tuo sito nei risultati di ricerca per le parole chiave TOFU.Middle of funnel (MOFU)Valutazioni in stelleLa quantità e la qualità delle recensioni su diverse piattaforme come Google Reviews.Tasso di crescita mensile delle persone abbonateLa differenza % tra il numero di persone abbonate alla newsletter dall’inizio di un mese a quello successivo.Posizionamento parole chiave (MOFU)Le posizioni organiche del tuo sito nei risultati di ricerca per le parole chiave MOFU.Bottom of funnel (BOFU)ConversioniUna conversione avviene quando una persona che visita il tuo sito completa un’azione che stai monitorando (ad esempio, acquista il tuo prodotto).Ritorno dell’investmento (ROI)La misura dell’impatto che una campagna o un canale ha avuto sulle entrate dell’azienda (ad esempio, le inserzioni di Facebook).Posizionamento parole chiave (BOFU)Le posizioni organiche del tuo sito nei risultati di ricerca per le parole chiave BOFU.Puoi monitorare la maggior parte di queste metriche tramite strumenti come Google Analytics, Google Search Console e Ahrefs.Ulteriori approfondimenti25 Metriche Di Marketing Da Monitorare 10 Metriche SEO Che Hanno Senso (E 4 Che Non Ne Hanno)Domande FrequentiAlcune domande frequenti sul funnel di marketing.Qual è la differenza tra un funnel di marketing B2B e B2C?La differenza è che, nel B2C, i clienti solitamente navigano da soli nel funnel. Nel B2B sono coinvolti più persone nella fase decisionale, quindi più persone si muovono attraverso il funnel.Di conseguenza, le tattiche di marketing utilizzate in ciascuna fase saranno diverse. Ad esempio, nel B2B, la fase Desiderio o Azione può coinvolgere fortemente i venditori, ma questo sarà improbabile nel B2C.C’è differenza tra un funnel di marketing e uno di vendita?Sono la stessa cosa e si tratta solo di termini usati in modo intercambiabile.Tuttavia, potrebbero esserci differenze nel modo in cui le responsabilità vengono suddivise tra i team di marketing e di vendita. Ad esempio, tradizionalmente, i team di marketing sono responsabili della parte superiore del funnel, mentre i team di vendita sono responsabili della parte inferiore del funnel (e il MOFU è diviso tra i due team).Dove si posizionano fidelizzazione e sostegno?Alcuni esperti di marketing ritengono che il modello esistente sia incompleto perché si concentra esclusivamente sulla conversione di un cliente potenziale in un cliente reale. Dopotutto, la saggezza convenzionale del marketing afferma che è più economico fidelizzare i clienti che acquisirne di nuovi.Quindi vengono aggiunte altre due fasi al funnel:Fidelizzazione: il cliente acquista ripetutamente da te.Advocacy: il cliente consiglia il tuo marchio ad altre persone.Esempi di tattiche per queste due fasi sono:Fidelizzazione: In Ahrefs, abbiamo una community riservata ai soli clienti in cui le persone possono incontrarsi, porre domande e offrire feedback sul nostro set di strumenti.Advocacy: Prendi in considerazione la creazione di un programma referral in modo che sia più facile per i tuoi clienti segnalare il tuo prodotto ai loro amici.ConclusioniLa canalizzazione è un modello per analizzare e migliorare il tuo marketing.Modificare il funnel è un processo senza fine. Ma questa è la parte divertente del marketing. Continua a sperimentare e troverai modi per migliorare i tuoi risultati.Hai domande o commenti? Scrivimi su Twitter o Threads.Tradotto da Veruska Anconitano Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "Funnel Di Marketing: Cos’È, Come Funziona e Come Si Crea"
    },
    {
      "level": "H2",
      "text": "Cos’è un funnel di marketing?"
    },
    {
      "level": "H2",
      "text": "Le fasi del funnel di marketing"
    },
    {
      "level": "H3",
      "text": "1. Awareness"
    },
    {
      "level": "H3",
      "text": "2. Interest"
    },
    {
      "level": "H3",
      "text": "3. Desire"
    },
    {
      "level": "H3",
      "text": "4. Action"
    },
    {
      "level": "H2",
      "text": "Perché il funnel di marketing è importante?"
    },
    {
      "level": "H2",
      "text": "Come creare un funnel di marketing"
    },
    {
      "level": "H3",
      "text": "1. Top of funnel (TOFU)"
    },
    {
      "level": "H4",
      "text": "Scegli come target le parole chiave TOFU"
    },
    {
      "level": "H4",
      "text": "Attingi al pubblico di altre persone"
    },
    {
      "level": "H4",
      "text": "Us gli annunci"
    },
    {
      "level": "H3",
      "text": "2. Middle of funnel (MOFU)"
    },
    {
      "level": "H4",
      "text": "Scegli come target le parole chiave MOFU"
    },
    {
      "level": "H4",
      "text": "Invita le persone a iscriversi alla tua newsletter"
    },
    {
      "level": "H4",
      "text": "Ottieni più recensioni"
    },
    {
      "level": "H4",
      "text": "Insegna agli utenti come utilizzare il tuo prodotto"
    },
    {
      "level": "H4",
      "text": "Offri una versione gratuita del tuo prodotto"
    },
    {
      "level": "H3",
      "text": "3. Bottom of funnel (BOFU)"
    },
    {
      "level": "H4",
      "text": "Scegli come target le parole chiave BOFU"
    },
    {
      "level": "H4",
      "text": "Crea una pagina di confronto"
    },
    {
      "level": "H4",
      "text": "Rispondi alle loro obiezioni nella fase finale"
    },
    {
      "level": "H4",
      "text": "Dai alle persone un’ultima “spinta”"
    },
    {
      "level": "H2",
      "text": "Metriche del funnel di marketing"
    },
    {
      "level": "H2",
      "text": "Domande Frequenti"
    },
    {
      "level": "H3",
      "text": "Qual è la differenza tra un funnel di marketing B2B e B2C?"
    },
    {
      "level": "H3",
      "text": "C’è differenza tra un funnel di marketing e uno di vendita?"
    },
    {
      "level": "H3",
      "text": "Dove si posizionano fidelizzazione e sostegno?"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}