{
  "url": "https://ahrefs.com/blog/it/google-e-parziale/",
  "slug": "google-e-parziale",
  "title": "Caso Studio: Google è Parziale Verso Alcuni Siti di Notizie?",
  "description": "Google è stato accusato di essere parziale diverse volte nel corso degli scorsi anni. Abbiamo quindi studiato i siti di news Conservatori e Liberali più visitati alla ricerca di indizi.",
  "content": "Patrick Stox Patrick Stox è Product Advisor, Technical SEO e Brand Ambassador di Ahrefs. E’ tra gli organizzatori di Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference, e moderatore di /r/TechSEO. Contenuti Recentemente il CEO di Google, Sundai Pichar, è stato chiamato a testimoniare di fronte al Congresso degli Stati Uniti d’America riguardo una possibile parzialità all’interno dei loro algoritmi. Questa non è la prima volta che Google viene accusato di una cosa del genere, e probabilmente non sarà nemmeno l’ultima. Google sostiene di essere imparziale, nonostante molti facenti parte del partito dei Conservatori sostengono che Google abbia dei pregiudizi nei loro confronti. Con la nostra esperienza nella search engine optimization (SEO) e la grossa mole di dati a disposizione di Ahrefs, abbiamo voluto provare ad identificare eventuali parzialità da parte di Google analizzando e mettendo a confronti i dati relativi a siti di news Conservatori e Liberali. Se non conosci Ahrefs, dovresti sapere che siamo uno dei migliori SEO tool ed abbiamo a disposizione un ammonto davvero elevato di dati riguardanti il web.MetodologiaRisultatiMetodologiaGoogle apporta centinaia di modifiche e miglioramenti ai propri algoritmi ogni anno. La maggior parte di questi non viene notata perchè piuttosto piccola, ma ogni tanto ce ne sono alcuni particolarmente grandi chiamati ‘core’ update che impattano una grossa percentuale dei risultati di ricerca.Dato che Google dichiara il rilascio di questi update più corposi, abbiamo pensato di poter analizzare il traffico organico dei giornali Conservatori e Liberali prima e dopo questi updates, cercando di evidenziare eventuali parzialità.Ad esempio, ecco la stima del traffico organico per il sito di Fox news dal 2015 ad oggi. Ogni linea tratteggiata rappresenta un Google Core Update:Analizzare solo i dati di un unico sito non ci dice però molto; abbiamo quindi fatto la stessa cosa per i più famosi siti dei giornali Conservatori e Liberali. Abbiamo preso la lista da AllSides Media Bias Ratings (che da una valutazione dei giornali in base al favoreggiamento di destra o sinistra politicamente parlando). Ecco la lista dei siti che abbiamo scelto:Siti di news Conservatori:New York PostThe Last RefugeDrudge ReportThe FederalistOrange County RegisterThe Epoch TimesWashington TimesChristian Broadcasting NetworkNational ReviewTownhallThe Mark Levin ShowThe Rush Limbaugh ShowBreitbartNewsmaxThe National InterestThe Gateway PunditRedStatePJ MediaWashington ExaminerFox NewsChristian TodayZero HedgeThe Daily CallerTheBlazeThe Daily WireSiti di news Liberali:VoxU.S. News & World ReportThe Washington PostCNNBustleNBC NewsHollywood ReporterLos Angeles TimesYahoo NewsAl JazeeraRolling StoneHuffPostThe VergeThe New York TimesABC NewsTIMECBS LocalThe GuardianBloombergNPRCBS NewsThe AtlanticPoliticoUnivisionPrima di parlare dei risultati, mi sento in dovere di dire un paio di cose riguardo i dati di Ahrefs. Abbiamo infatti milioni di parole chiave e tantissimi altri dati sui journey degli utenti. Questi vengono da noi utilizzati per ottenere una stima del traffico organico guardando alle diverse parole chiave che le persone cercano, la posizione che il sito occupa nei risultati di ricerca e dove gli utenti cliccano. Per quanto riguarda i Core Updates, abbiamo deciso di prendere in considerazione il traffico relativo all’inizio del loro rilascio e 14 giorni dopo di questo. In questo modo abbiamo dato tempo a Google di applicare tutti i cambiamenti e le modifiche del caso attraverso i suoi diversi datacenter. Attendere 14 giorni dà inoltre modo ai nostri dati di riflettere i cambiamenti portati dall’update.I nostri dati sono stati inoltre normalizzati in modo che il volume tenga conto di un media degli ultimi 12 mesi, in modo da prendere in considerazione anche le stagionalità delle ricerche, fatta eccezione per quelle relative alle elezioni, dato che non avvengono ogni anno. Un’altra cosa da tenere a mente, è che i nuovi avvenimenti ed eventi non vengono evidenziati immediatamente, ma solo una volta che questi diventano piuttosto popolari ed i journey degli user sono stati analizzati.RisultatiDal 2015 ad oggi, abbiamo notato una decrescita del traffico organico per i siti appartenenti ad entrambe le categorie durante i Core Update di Google.Contrazione totale del traffico per i Conservatori: -2.65% Contrazione totale del traffico per i Liberali: ‑1.78%Questi due numeri sono piuttosto vicini fra di loro e non hanno particolare significanza statistica, considerando che stiamo prendendo in considerazione 50 siti su un periodo di 6 anni. Se prendiamo sotto esame l’impatto che gli update hanno avuto fino alle elezioni del 2016, possiamo vedere come questo sia stato praticamente identico. Prendendo in considerazione il periodo che va fino alle elezioni del 2020, è possibile invece notare come fino a circa un anno fa l’impatto sia stato pressoché identico, ma sembra che l’update più recente abbia avuto un impatto più positivo per i siti Conservatori.Se guardiamo invece ai dati individualmente, è possibile notare come sia i siti Conservatori che Liberali abbiamo avuto impatti sia positivi che negativi nel corso dei Core Update di Google. Lo schema qui sotto ed i relativi diagrammi a scatola e baffi ( box-plot se preferite), mostrano i siti più performanti in ogni categoria, e sono aggiornati in base ai dati di ogni singolo Update. È possibile quindi vedere come ogni volta ci siano stati siti perdenti ed altri vincenti in ogni singola categoria. Solitamente la variazioni che i siti subiscono nel corso degli update hanno a che fare con la qualità degli stessi più che altro.Anche se non possiamo affermare con certezza che non ci siano parzialità da parte di Google nei risultati di ricerca, possiamo certamente dire che nel corso degli ultimi 6 anni i Core Updates di Google non hanno favoreggiato nessuno.Esiste parzialità a livello di traffico?Una delle cose che ci ha colpito è che i siti Liberali ricevono decisamente più traffico di quelli Conservatori.Ora la domanda è quindi, perché questi ottengono più traffico? Potrebbe questo essere un segno della parzialità di Google che si riflette sui dati in nostro possesso? Proviamo a capire da dove deriva questa differenza in traffico.Numero di contenutiQuando analizziamo il numero di pagine indicizzate, possiamo notare come le fonti Liberali hanno 8 volte il numero di pagine dei siti Conservatori. Il grafico che ne deriva è infatti praticamente identico a quello che abbiamo visto qui sopra relativo al traffico. Di conseguenza, i siti Liberali hanno più possibilità di posizionarsi rispetto ai Conservatori.Traffico Brand e no-BrandIl traffico Brand ottenuto da CNN e Fox News è pressoché identico, il che evidenzia un numero simile di persone che cercano specificatamente queste fonti fra i risultati di ricerca. Tuttavia il traffico brand della CNN è una porzione più piccola rispetto al totale se paragonato con Fox News, questo perchè hanno più contenuti. CNN ha infatti circa ~2.5 il numero di pagine indicizzate di Fox News, ed ha quindi più possibilità di posizionarsi.Il 40% circa del traffico della CNN è brand, che corrisponde a circa 32.5 milioni di visite organiche mensiliIl 67% circa del traffico di Fox News è brand, che corrisponde a circa 33 milioni di visite organiche mensiliAltre spiegazioni per le differenze di trafficoCon i soli dati provenienti da Google, è arduo capire con certezza da cosa scaturisca questa differenza in traffico. Potrebbe essere che i Conservatori tendano ad utilizzare meno Google. O ancora che questi tendano a informarsi maggiormente tramite televisione, app e social. Tutte queste ipotesi potrebbero essere vere, ma senza ulteriori dati non è possibile confermare nulla.Altri modi in cui avremmo potuto trovare imparzialitàSe avessimo analizzato query specifiche, sono certo che avremmo potuto trovare qualche segno di possibile parzialità. Tuttavia compiendo ricerche specifiche, subentra un livello di parzialità aggiuntivo dato proprio dalla stessa persona che compie la ricerca. I dati sono piuttosto complessi, e servirebbe un buon metodo per giudicare quanto una pagina o un contenuto è affine ad una determinata query. Sfortunatamente, questo sarebbe particolarmente difficile e soggettivo, per cui abbiamo deciso di non seguire tale strada.Avremmo anche potuto analizzare i dati relativi ai link o i link provenienti da altri siti. Ma anche in questo caso i dati sarebbero stati parziali, in quanto è normale per i siti meglio posizionati e con più contenuto ricevere anche un maggior numero di link. Abbiamo già dimostrato ciò nel nostro studio relativo alla crescita dei backlink.Avremmo potuto esaminare esempi specifici suggeriti dal sistema autocomplete di Google, ma siamo a conoscenza del fatto che tendono a rimuovere molti termini negativi da tale lista. Questa cosa è già un pregiudizio di per sé e di conseguenza sarebbe difficile fare osservazioni in merito.ConclusioniC’è un livello minimo di pregiudizio e parzialità in tutto. Anche se i nostri dati non mostrano segni di parzialità a seguito dei Core Update di Google, questo non significa che eventi del genere non siano successi nel corso degli anni. Di conseguenza sarebbe un azzardo fare affermazioni in entrambi i casi.Hai domande su questo studio? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Patrick Stox Patrick Stox è Product Advisor, Technical SEO e Brand Ambassador di Ahrefs. E’ tra gli organizzatori di Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference, e moderatore di /r/TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Caso Studio: Google è Parziale Verso Alcuni Siti di Notizie?"
    },
    {
      "level": "H2",
      "text": "Metodologia"
    },
    {
      "level": "H3",
      "text": "Siti di news Conservatori:"
    },
    {
      "level": "H3",
      "text": "Siti di news Liberali:"
    },
    {
      "level": "H2",
      "text": "Risultati"
    },
    {
      "level": "H3",
      "text": "Esiste parzialità a livello di traffico?"
    },
    {
      "level": "H4",
      "text": "Numero di contenuti"
    },
    {
      "level": "H4",
      "text": "Traffico Brand e no-Brand"
    },
    {
      "level": "H4",
      "text": "Altre spiegazioni per le differenze di traffico"
    },
    {
      "level": "H3",
      "text": "Altri modi in cui avremmo potuto trovare imparzialità"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Patrick Stox"
}