{
  "url": "https://ahrefs.com/blog/it/grafico-conoscenza-google/",
  "slug": "grafico-conoscenza-google",
  "title": "Il Grafico di Conoscenza Google Spiegato: Come Influenza la SEO",
  "description": "Il Grafico di Conoscenza Google è una base di conoscenza di entità e di relazioni tra esse. Impara a trarne vantaggio e migliora la SEO.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti Se hai già visto qualcosa di simile a questo nei risultati di ricerca…Scheda di Conoscenza per la query “età harrison ford”.… allora hai già potuto sperimentare i benefici del Grafico di Conoscenza Google (Google Knowledge Graph).Che cos’è un grafico di conoscenza? Come funziona? E come puoi trarne dei vantaggi per aumentare la visibilità del brand e migliorare la SEO?Ecco cosa imparerai in questa guida:Che cos’è il Grafico di Conoscenza GoogleCome influenza la ricercaCome entrare nel Grafico di ConoscenzaCome suggerire modifiche al tuo Pannello di ConoscenzaChe cos’è il Grafico di Conoscenza?Il Grafico di Conoscenza Google è una base di conoscenza composta da entità e da relazioni tra esse.Che cos’è una entità? E’ qualsiasi oggetto o concetto che può essere identificato distintamente. Include cose tangibili come persone, luoghi, organizzazioni, e cose intangibili come i colori, i concetti, e le emozioni.Le entità sono collegate dai puntatori, che ne descrivono la relazione tra loro.Memorizzare dati del genere del mondo reale aiuta Google a capire i significati delle query di ricerca, che offriranno risultati più rilevanti per chi esegue la ricerca.Il Grafico di Conoscenza Google come influenza la ricerca e la SEO?In linea di massima, il Grafico di Conoscenza è un fattore positivo sia per gli utenti che per chi cura la SEO. Gli utenti hanno risultati di ricerca più rilevanti, e chi cura il SEO ha maggior traffico di contenuti rilevanti.Ma non sono tutte rose e fiori. Ci sono anche degli aspetti negativi.Ecco i 4 aspetti della ricerca influenzati dal Grafico di Conoscenza, in positivo e in negativo:Google capisce meglio l’intento di ricercaI link sono ottimi per valutare la qualità di una pagina, ma non la sua rilevanza alla query di ricerca.Questo va bene fino a che le query di ricerca assomigliano al linguaggio del contenuto. Google usa segnali di qualità come i link per indicare il miglior contenuto dal suo indice.Ma le persone non cercano sempre in questo modo. Descrivono le cose in maniera differente.Ecco dove interviene il Grafico di Conoscenza, che permette a Google di andare oltre l’accoppiamento delle parole chiave e fornire risultati più rilevanti.Ad esempio, prendiamo la query “piccolo ometto verde con spada laser”:Malgrado noi non abbiamo mai menzionato Star Wars, Google comunque capisce cosa stiamo cercando e ci fornisce una risposta.Lo stesso è vero per la query “altri film attore han solo”:Qui, non solamente i risultati sono rilevanti, ma Google mostra inoltre le connessioni nel Grafico di Conoscenza e ci fornisce un entità carosello che soddisfa la nostra query.Google gestisce meglio le ricerche vocaliCon l’Assistente Google oggi inserito in oltre un miliardo di dispositivi, e con circa il 70% delle richieste effettuate in linguaggio naturale, capire le ricerche vocali è più importante che mai per Google.Come viene in aiuto il Grafico di Conoscenza in questo caso?Permette a Google di riconoscere le entità e gli attributi delle query in linguaggio naturale. Pensa solo per un momento al modo nel quale tu digiti le query di ricerca rispetto al modo in cui parli abitualmente. Sì, è diverso.Guarda, ad esempio, a questa query:Siccome “Han Solo” e “Star Wars” sono entità strettamente connesse nel Grafico della Conoscenza, per Google è facile fornire la risposta che stavi cercando.Nota a margine.Google inoltre tiene in considerazione le tue ultime ricerche nelle ricerche vocali. Se chiedi “quale attore ha recitato come Han Solo in Star Wars” e poi “quanti anni ha”, Google saprà che “ha” è riferito a Harrison Ford.Maggiore visibilità ed autorità per il brandGoogle mostra i dati del Grafico di Conoscenza nelle funzionalità della SERP come i Pannelli di Conoscenza e le Schede di Conoscenza.Cosa ti serve saperlo?Significa che se riesci a raggiungere il Grafico di Conoscenza con il tuo brand, avrai un vantaggio nel territorio della SERP, visibilità, e probabilmente anche autorevolezza e fiducia tra chi cerca.Potresti trovare il tuo logo che spunta in SERP per query non legate al brand.Meno click nei risultati di ricercaSecondo gli ultimi studi da Rand Fishkin, per oltre il 50% delle ricerche non segue alcun click.Parte di questo motivo è legato al Grafico di Conoscenza, che aiuta Google a rispondere a molte più query direttamente nella SERP.Guarda ad una query come “seo cos’è”:Google mostra un Pannello di Conoscenza con dati presi dal Grafico di Conoscenza.Per chi fa SEO, questo potrebbe essere un problema. Se le persone non stanno cliccando nei risultati di ricerca, allora potenzialmente avrai poco o nessun traffico organico—anche se sei in prima posizione.Come puoi risolvere questa situazione?Puoi evitare di porti come obiettivo le parole chiave con una bassa frequenza di click-through organica.Per esempio, il 58% delle ricerche per “seo cos’è” non ha click…… quindi anche se il Pannello di Conoscenza influisce nel CTR, è comunque una buona parola chiave.Ma non si può dire lo stesso di una query come “John Legend età”, dove solamente l’8% delle ricerche ha un click.Come entrare nel Grafico di Conoscenza di GoogleDovrebbe essere ora chiaro che gli aspetti positivi di essere nel Grafico di Conoscenza sorpassano quelli negativi, ma come si può entrare?Anche se non ci sono sistemi definiti, ci sono alcune cose che puoi fare per aumentare le possibilità.1. Incrementa le tue PR ed i link buildingInnanzitutto partiamo con la cosa più difficile. E’ molto facile essere inclusi come entità nel Grafico di Conoscenza di Google se su internet si parla della tua azienda.Menzioni da testate giornalistiche—Forbes, TechCrunch, ecc—suggeriscono a Google che potresti essere un’entità da considerare. Tuttavia, riconosco che può essere difficile per molte PMI e non bisogna per questo mollare. E’ possibile essere inclusi anche senza queste risorse.2. Usa lo schema markup nel tuo sitoSchema.org è il markup ufficiale raccomandato per i dati strutturati. E’ un argomento separato, quindi metterò solamente in evidenza alcuni aspetti che potrebbero aiutare la tua attività ad entrare nel Grafico di Conoscenza di Google.Usa il markup organizationAssicurati di utilizzare almeno le proprietà name, logo, URL e sameAsIncludi tutti i tuoi profili social e possibilmente le pagine Wikidata e Wikipedia come riferimenti sameAsValida il markupIl seguente è il markup organization che noi utilizziamo:<script type=\"application/ld+json\"> { \"@context\": \"http://schema.org\", \"@type\": \"Organization\", \"name\": \"Ahrefs\", \"url\": \"https://ahrefs.com\", \"logo\": \"https://ahrefs.com/images/logo/logo_180x80.jpg\", \"email\": \"[email protected]\", \"sameAs\" : [ \"https://www.wikidata.org/wiki/Q84051347\", \"https://www.facebook.com/Ahrefs\", \"https://www.linkedin.com/company/ahrefs\", \"https://twitter.com/ahrefs\", \"https://www.youtube.com/channel/UCWquNQV8Y0_defMKnGKrFOQ\" ], \"contactPoint\" : [ { \"@type\" : \"ContactPoint\", \"contactType\" : \"customer service\", \"email\": \"[email protected]\", \"url\": \"https://ahrefs.com\" } ] } </script> 3. Iscriviti a Google My BusinessSe hai una attività con indirizzo fisico, è indispensabile creare un profilo GMB. Ti aiuta a dare visibilità al brand ed autorevolezza sia nelle ricerche che in Google Maps perché ti inserisce nelle ricerche locali che assomigliano al Pannello di Conoscenza.Tuttavia, iscriversi a Google My Business non garantisce l’inclusione nel Grafico di Conoscenza. Ho ricercato i bar e ristoranti più famosi nei dintorni con le API del Grafico di Conoscenza e solamente alcuni sono contrassegnati come entità.In ogni caso, fornire a Google dati strutturati nella sezione GMB può aumentare le probabilità di essere inclusi nel Grafico di Conoscenza.Ma assicurati di utilizzare gli stessi dati (nome, indirizzo, numero di telefono, ecc.) sia nel tuo sito web che nei social media.4. Crea una voce wikidata.orgWikidata memorizza i dati strutturati per Wikipedia ed altri siti web Wikimedia. Ti consiglio caldamente di iniziare con la creazione di una voce Wikidata se non hai altre presenze in Wikimedia.Una grande porzione dei dati del Grafico di Conoscenza Google fanno affidamento a Wikidata, e vorrei anche dire che avere un profilo li è più importante rispetto a Wikipedia.E, a differenza di Wikipedia, creare una voce su Wikidata è un processo semplice e diretto. Comunque, dovrai sempre attenerti alle loro regole, specialmente la policy di Rilevanza.Naviga nel portale di aiuto di Wikidata per capire come funziona la piattaforma, e guarda questo video sull’aggiunta e la modifica delle voci. Dovresti poi essere pronto a contribuire al più grande database strutturato open-source.5. Procurati una pagina WikipediaNota come ho usato procurati piuttosto che crea. Puoi provare a crearti la tua pagina Wikipedia, ma devi essere sicuro di attenerti alle raccomandazioni e alle linee guida.In breve, fai riferimento solamente a informazioni di valore oggettivo che possono essere controllate da fonti affidabili. E soprattutto, devi rispettare la policy di Rilevanza già menzionata nel paragrafo in precedenza.E’ il motivo che ti spinge ad essere menzionato nei media mainstream ed altre fonti autorevoli.Ti raccomando inoltre di non provare scorciatoie o raggiri poco chiari. Io una volta ho assistito al tentativo di riottenere in profilo cancellato a causa di auto-promozione, ed anche i link da TechCrunch e riferimenti da Hacker News non sono stati sufficienti.La cosa migliore da fare è promuoverti così bene che qualcuno estraneo alla tua attività crei una pagina Wikipedia su di te.6. Rimani consistenteQuesto è un consiglio tipico del marketing, mi focalizzerò sulle entità ponendoti un quesito:Come potremmo chiedere a Google di mostrare ai suoi utenti informazioni rilevanti ed accurate sul tuo brand e i tuoi prodotti se la tua presenza online è ambigua ed inconsistente?Questo va oltre i 5 consigli appena esposti. Resta consistente con qualsiasi cosa quando si tratta della tua presenza online.Come suggerire modifiche al tuo Pannello di ConoscenzaI Pannelli di Conoscenza di Google non sono perfetti. A volte mostrano informazioni errate, e potrebbe accadere anche al Pannello del tuo brand.Come si risolve?Reclama il tuo Pannello di Conoscenza e richiedi di essere verificato cliccando il bottone in basso.Una volta verificato, vedrai un bottone “Suggerisci una modifica” a fianco al Pannello di Conoscenza ogni volta che avrai fatto login con un account associato.Assicurati solamente di seguire la documentazione ufficiale Google quando suggerisci modifiche o rimozione di informazioni.ConclusioniForse avrai notato che il Pannello di Conoscenza Ahrefs al momento non è nulla di spettacolare. Ed il motivo è che prima di scrivere questo articolo, non ce l’avevamo. Ho utilizzato i consigli scritti sopra per ottenerlo.Ciò che è sembrato avere il maggior impatto è stata la creazione di una pagina Wikidata appropriata, che abbiamo collegato alla proprietà sameAs del nostro markup Organization. La nostra pagina Wikidata è stata indicizzata lo stesso giorno in cui abbiamo aggiornato lo schema Organization, ed è trascorsa quasi una settimana prima che comparisse il Pannello di Conoscenza.Al di là della nostra esperienza, i Grafici di Conoscenza e le entità sono tra noi ormai da un po’ di tempo, e diventeranno sempre più importanti. Google è già pronto per la “indicizzazione entità-first”, quindi comprendere l’argomento è cruciale per il SEO contemporaneo.Se hai qualche domanda o conferma su questo affascinante argomento, sentiti libero di raggiungermi su Twitter.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Il Grafico di Conoscenza Google Spiegato: Come Influenza la SEO"
    },
    {
      "level": "H2",
      "text": "Che cos’è il Grafico di Conoscenza?"
    },
    {
      "level": "H2",
      "text": "Il Grafico di Conoscenza Google come influenza la ricerca e la SEO?"
    },
    {
      "level": "H3",
      "text": "Google capisce meglio l’intento di ricerca"
    },
    {
      "level": "H3",
      "text": "Google gestisce meglio le ricerche vocali"
    },
    {
      "level": "H3",
      "text": "Maggiore visibilità ed autorità per il brand"
    },
    {
      "level": "H3",
      "text": "Meno click nei risultati di ricerca"
    },
    {
      "level": "H2",
      "text": "Come entrare nel Grafico di Conoscenza di Google"
    },
    {
      "level": "H3",
      "text": "1. Incrementa le tue PR ed i link building"
    },
    {
      "level": "H3",
      "text": "2. Usa lo schema markup nel tuo sito"
    },
    {
      "level": "H3",
      "text": "3. Iscriviti a Google My Business"
    },
    {
      "level": "H3",
      "text": "4. Crea una voce wikidata.org"
    },
    {
      "level": "H3",
      "text": "5. Procurati una pagina Wikipedia"
    },
    {
      "level": "H3",
      "text": "6. Rimani consistente"
    },
    {
      "level": "H2",
      "text": "Come suggerire modifiche al tuo Pannello di Conoscenza"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Michal Pecánek"
}