{
  "url": "https://ahrefs.com/blog/it/idee-content-marketing/",
  "slug": "idee-content-marketing",
  "title": "11 Idee di Content Marketing Efficaci for 2021 (Con Esempi)",
  "description": "Il tempo è limitato e per avere successo devi investire correttamente nei contenuti. Ecco 11 potenti idee di content marketing da cui iniziare.",
  "content": "Priscilla Tan Si occupa di testi per startup SaaS in ambito B2B. Ama le poke bowl e gli abiti vintage. Contenuti Un giorno è così breve che non vuoi perdere tempo con contenuti non di qualità.Ecco per te 11 potenti idee di content marketing che puoi utilizzare già da oggi:Pubblica un guest post 10XCrea tweet a cascataCrea una newsletter interessante per chi è iscrittoOspita dei webinarCrea checklist, modelli o strumenti utiliMetti a disposizione la tua esperienzaPubblica ricerche originaliCresci grazie ai contenuti generati dagli utentiColtiva i contatti con un corso via e‑mailCrea una pagina comparativaRiproponi i tuoi contenuti1. Pubblica un guest post 10XPer guest posting si intende scrivere un post per un altro blog.Probabilmente hai già sentito parlare di questa tattica, poiché è tutt’altro che nuova. Ma con così tante persone che hanno deciso di adottarla, oggi ha perso la sua efficacia a meno che tu non faccia davvero uno sforzo.È qui che entra in gioco il guest posting 10X.Il guest posting 10X è una tattica che consiste nello scrivere un post per altri siti che è almeno 10 volte migliore dell’attuale post in cima alla pagina per quell’argomento.Ecco un esempio di un guest post 10X scritto da Ryan Stewart:In questo post, invece di rielaborare informazioni generali sulla vendita di servizi SEO come fa la maggior parte degli altri post sull’argomento, Ryan offre un punto di vista basato sull’esperienza personale.I vantaggi più importanti legati alla scrittura di un guest post 10X includono: Visibilità: è improbabile che le persone condividano un post se contiene le stesse informazioni che hanno letto mille volte, ma è probabile che condividano un “10X” che offre nuovi spunti. Visite: le persone raramente si interessano a contenuti mediocri, quindi il tuo guest post 10X attirerà probabilmente più visite di un post “normale”. Questo è un bene per la SEO e per il sito su cui l’articolo è pubblicato. Posizionamento: il tuo guest post potrebbe posizionarsi per la parola chiave scelta e inviare un flusso costante di lead o clienti.Il post di Ryan ha ottenuto tutti questi benefici.Ha ottenuto tonnellate di condivisioni:Centinaia di backlink:E fino a poco tempo fa si trovava in cima alla prima pagina di Google per la parola (in inglese) “SEO services”:Se hai voglia di dare una possibilità al guest posting 10X, ecco un modo semplice per trovare siti per cui scrivere:Vai su Content ExplorerInserisci un argomento simile a quello di cui vuoi scrivereCambia la modalità di ricerca in Nel TitoloPremi CercaFiltra i risultati provenienti da siti Web con oltre 10.000 visite organiche al meseControlla la scheda Siti WebSe vuoi scrivere un guest post 10X sulla ricerca di parole chiave, puoi cercare un argomento simile, per esempio “link building”. L’idea è che questi siti saranno probabilmente interessati a un guest post su un argomento simile a uno che hanno già trattato.Letture consigliate: Guest Blogging per SEO: Come Ottenere Link di Qualità Costantemente2. Crea tweet a cascata Il cosidetto “tweetstorm” è una rapida successione di tweet su un argomento che di solito viene scritto come un thread.Eccone uno del nostro CMO, Tim Soulo:Let’s talk about the “ROI of Content Marketing.”Far too often us marketers get challenged with this question by our boss (or our client):- How do I know that my investment in content will guarantee a positive return? …& how can I *MEASURE* it? [Read more..]— Tim Soulo 🇺🇦 (@timsoulo) March 23, 2021Dai un’occhiata ai tweetstorm popolari e noterai che sono conclusioni su contenuti esistenti o approfondimenti di esperti che fanno parlare nella community di riferimento.Perché includere tweetstorm nella tua strategia di content marketing?Innanzitutto, perchè sono incredibilmente facili da creare. Scrivi i tuoi pensieri, scomponili in blocchi, twitta e il gioco è fatto.In secondo luogo, e forse ancora più importante, i tweetstorm popolari possono portare a una seria esposizione e generare molte conversazioni. Questo può portare a più follower, clienti, insomma tante cose buone.Ecco un modo semplice per creare un tweetstorm che parlerà direttamente al tuo pubblico di riferimento:Vai su Content ExplorerInserisci il tuo sitoOrdina i risultati per condivisioni TwitterIn questo modo potrai vedere quale dei tuoi contenuti ha il maggior numero di condivisioni su Twitter:Tutto quello che devi fare è estrarre gli elementi chiave da questi contenuti e riutilizzarli in un tweet.Letture consigliate: Come Creare un Tweetstorm di Animalz3. Crea una newsletter interessante per chi è iscrittoLe newsletter hanno la reputazione di essere noiose. La colpa è dei marketer che trattano questo canale come un megafono per contenuti promozionali.Quando promuovi contenuti che nessuno vuole leggere, corri il rischio che le persone annullino l’iscrizione. Inclusi i tuoi clienti.I bassi tassi di apertura delle e‑mail possono indicare che il tasso di abbandono è dietro l’angolo. Poiché circa il 15,8% delle persone annulla l’iscrizione a causa di contenuti irrilevanti, dobbiamo andare oltre la promozione dei risultati della nostra azienda quando utilizziamo le newsletter così da coltivare lead e fidelizzare i clienti.Come si fa?Segmenta i tuoi iscritti in base al loro comportamento e background (ad esempio, cosa leggono, da dove provengono, ecc.). Puoi farlo automaticamente nella maggior parte dei software di e‑mail marketing.Questa è una e‑mail inviata da HubSpot agli studenti della sua accademia:Hai visto come è personalizzata in base ai corsi seguiti dalla persona in ordine cronologico?Questo è il tipo di personalizzazione che vuoi implementare nelle tue newsletter via e‑mail.4. Ospita dei webinarSe vuoi rendere il tuo marketing dei contenuti più interattivo e potenzialmente migliorarne l’efficacia in termini di costi, prova i webinar. L’80% di chi si occupa di marketing dice che questi eventi online riducono il loro costo per lead.E già che ci sei, invita degli ospiti come relatori o co-conduttori per aumentare la viralità del tuo webinar.Wynter, una piattaforma che si occupa di go-to-marketing, ospita una serie mensile di eventi virtuali con i migliori professionisti provenienti da vari settori.Ecco un tweet del fondatore Peep Laja. Guarda come ha taggato i suoi ospiti per spargere la voce sulle future sessioni formative.I Mi piace e i retweet dei suoi ospiti e di altri utenti di Twitter hanno ulteriormente amplificato la portata dell’evento.5. Crea checklist, modelli o strumenti utiliQuando leggiamo guide pratiche incredibilmente lunghe, spesso rimaniamo bloccati su cosa fare dopo.È qui che le checklist, i modelli e gli strumenti tornano utili: infatti sono questi a guidare i tuoi lettori a fare il passo successivo.Ci sono molti pro e contro nel creare questo tipo di prodotti e nel regalarli alle persone. Rendili disponibili previa iscrizione all’e-mail e in questo modo puoi creare la tua lista di contatti e segmentare i tuoi iscritti. Rendili disponibili liberamente e potenzialmente aumenterai la partecipazione e il posizionamento SEO organico.Ma come decidere quali checklist, modelli e strumenti creare?Basta individuale ciò che le persone cercano:Vai su Keywords ExplorerInserisci da due a tre parole chiave “generiche” relative al tuo settoreClicca su CercaVai al rapporto sui Matching TermsFai clic sul filtro Include, aggiungi parole come “calcolatore”, “strumento” e “modello”, quindi attiva “Any word”In questo modo vedrai tutti i contenuti che gli utenti stanno cercando.Ad esempio, se vendi software di contabilità, probabilmente inserirai parole chiave “generiche” come “tasse” e “dividendo”. Questo rivelerà parole chiave come “calcolatore delle tasse”, “strumento fiscale dell’irs” e molte altre che ottengono migliaia di ricerche mensili (nell’esempio di seguito, in inglese):6. Metti a disposizione la tua esperienza Immagina di spiegare al tuo mercato di riferimento come utilizzare il prodotto o il servizio che offri passo dopo passo gratuitamente. Una strategia del genere ti porterebbe ad un fallimento, senza se e senza ma, vero?Sbagliato! Infatti la maggior parte delle persone non sarà disposta a fare nessuno sforzo per fare il lavoro autonomamente e probabilmente avranno l’interesse ad assumere l’azienda che sa già cosa sta facendo e che lo sta facendo egregiamente: la tua!Per esempio 99designs ha creato una guida dettagliata spiegando come progettare un logo passo dopo passo:Questa guida è al primo posto per “come progettare un logo” (in inglese) e riceve circa 39.900 visite mensili dalla ricerca organica, secondo il nostro strumento Site Explorer:Anche se tutti i lettori potrebbero seguire la guida e progettare un logo accattivante, ci impiegherebbero molto tempo e fatica. La maggior parte probabilmente assumerà qualcuno che lo faccia per loro.99designs lo sa, quindi offre il suo servizio di creazione di loghi alla fine del post: Per replicare questa tattica per la tua attività, scrivi un post sul blog insegnando ai potenziali clienti come fare ciò che fa la tua attività. Quindi ottimizza quel post per posizionarti in alto su Google.Letture consigliate: Come Posizionarsi in Alto su Google (in 6 Passaggi)7. Pubblica ricerche originaliGiornalisti e blogger (come me) sono costantemente alla ricerca di statistiche a sostegno degli articoli che scrivono. E quando trovano una statistica rilevante proveniente una fonte credibile, di solito la menzionano e la legano a chi l’ha diffusa.Ad esempio, TechCrunch ha citato, ripreso e collegato a noi la nostra ricerca originale sugli snippet in primo piano in questo post:Questo studio ha ricevuto più di 7.000 backlink da 1.640 siti Web unici (domini di riferimento), secondo il nostro Site Explorer:Questi backlink non solo aiutano a migliorare le nostre prestazioni SEO, ma dimostrano anche che, grazie alla nostra ricerca originale, migliaia di siti hanno citato il nostro brand.Ora probabilmente ti starai chiedendo: “È possibile pubblicare ricerche originali con un budget ridotto?”La risposta è sì, ed ecco alcune opzioni convenienti per ottenere dati utili:Analizza i tuoi iscritti alla posta elettronicaAnalizza il tuo pubblico su TwitterAnalizza le comunità attive (ad es. Subreddit o gruppi Facebook)Collabora con un’azienda non concorrente che condivide il tuo pubblicoSe il reperimento e la pubblicazione di ricerche originali ti sembrano operazioni troppo complesse, prova a rielaborare le statistiche esistenti come abbiamo fatto noi nella nostra lista di statistiche SEO statistics. In questo modo otterrai molti dei vantaggi che otterresti pubblicando ricerche originali.Letture consigliate: Un Esempio Concreto di Link Building: Come Abbiamo Ottenuto Backlinks con una Pagina di Statistiche (e Abbiamo Ottenuto la Posizione #1)8. Cresci grazie ai contenuti generati dagli utentiIl 79% delle persone sostiene che i contenuti generati dagli utenti (UGC) influiscano notevolmente sulle loro decisioni di acquisto, quindi devi assolutamente considerare di incorporarli nella tua strategia di content marketing.Ecco alcuni modi per farlo:Condividi le foto degli utenti sui social mediaCondividi casi di studio con la tua mailing listCondividi storie di successo con i potenziali acquirentiCondividi le recensioni dell’azienda o dei prodotti sul tuo sito webPuoi vedere un esempio di UGC sulla nostra pagina “vs” dove condividiamo i risultati di popolari sondaggi del settore:Poiché Ahrefs è risultato in testa a tutti questi sondaggi, questo contenuto UGC funge da prova e aumenta la fiducia dei potenziali clienti in una fase chiave del processo di acquisto.Tuttavia, questo non è l’unico modo in cui puoi utilizzare gli UGC.Ad esempio, Buffer ha utilizzato UGC per far crescere il suo account Instagram di quasi il 400% in un anno.Letture consigliate: Come I ontenuti Generati dagli Utenti Hanno Fatto Crescere il Nostro Account Instagram del 400% in Un Anno9. Coltiva i contatti con un corso via e‑mailLe liste di posta elettronica devono essere alimentate. Un modo per farlo è creando un corso da inviare via posta elettronica, una serie di piccole e‑mail educative da inviare nell’arco di pochi giorni o settimane.Ecco un interessante esempio da Outfunnel:In questo corso via e‑mail di 10 giorni, il co-fondatore e CEO Andrus Purde condivide i suoi migliori consigli sull’e-mail marketing B2B, dalla definizione degli obiettivi al miglioramento delle prestazioni.Verso la fine del corso e‑mail, Andrus invita a prenotare una chiamata di consulenza e ad iscriversi alla sua newsletter mensile via e‑mail.Quello che Andrus fa è coltivare potenziali lead dando loro del valore in anticipo. Invece di chiedere alle persone di acquistare qualcosa nel momento in cui si iscrivono, offre valore e dimostra la sua esperienza inviando loro un corso gratuito in posta elettronica.Puoi replicare questo approccio praticamente per qualsiasi prodotto o servizio, in qualsiasi settore: Se sei un commercialista, crea un corso e‑mail che insegni ai nuovi lavoratori autonomi come organizzare le tasse in autonomia; Se sei un giardiniere, crea un corso e‑mail che insegni ai proprietari di case come prendersi cura dei loro giardini; Se sei un professionista della SEO, crea un corso e‑mail che insegni agli imprenditori come posizionare il proprio sito web più in alto su Google.Le possibilità sono infinite.10. Crea una pagina comparativaUna pagina comparativa confronta il tuo prodotto o servizio con quelli dei tuoi concorrenti.Questo è un esempio specifico di una pagina in cui paragoniamo Ahrefs ad altri due famosi strumenti:Le pagine comparative sono estremamente utili perché le persone che le utilizzano sono pronte per l’acquisto. Semplicemente non sono sicure se acquistare il tuo prodotto o servizio o quello dei tuoi concorrenti. Quindi una pagina comparativa ben organizzata può farli pendere nella tua direzione e tu puoi chiudere la vendita.Come fai a sapere a quali concorrenti ti stanno confrontando le persone che cercano un prodotto o servizio?Utilizza lo strumento per la ricerca di parole chiave:Inserisci il nome della tua azienda in Keywords ExplorerVai sul report Matching TermsAggiungi il filtro “vs” in IncludeSe lo facciamo per Ahrefs, possiamo vedere che ci sono due concorrenti principali a cui le persone ci paragonano:Questi sono i concorrenti sui quali abbiamo creato la nostra pagina “vs”.11. Riproponi i tuoi contenutiProprio come un prodotto, il contenuto non è qualcosa che viene creato una volta e poi lasciato andare.Devi infatti sempre ampliare ulteriormente la portata dei tuoi contenuti per attirare più potenziali clienti.Il tuo pubblico di destinazione probabilmente preferisce un mix di mezzi. Alcuni preferiscono i post sul blog, altri potrebbero gravitare verso brevi video. Quindi cerca ciò che piace ai tuoi clienti e riutilizza i tuoi contenuti nei loro formati preferiti.Prendi i punti chiave inseriti in una guida lunga e trasformali in post di Instagram.Trasforma una ricerca in un corso e‑mail di cinque giorni o in un episodio per il tuo podcast.Hai appena acquisito tantissimi contatti grazie ad un webinar di 20 minuti? Espandilo e riutilizzalo in un e‑book.Qui ad Ahrefs, abbiamo riproposto la nostra guida alle parole chiave a bassa concorrenza e…… in un video per YouTube.Letture consigliate: Ripubblicare Contenuti: Come Aggiornare Vecchi Post per Ottenere Vantaggi SEO ConclusioniSia che tu voglia attirare lead senza creare un pubblico da zero o amplificare i tuoi contenuti esistenti per raggiungere più potenziali clienti, queste 11 idee ti aiuteranno a raggiungere i tuoi obiettivi. Quale di queste idee vuoi provare al più presto? Parliamone su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "11 Idee di Content Marketing Efficaci for 2021 (Con Esempi)"
    },
    {
      "level": "H2",
      "text": "1. Pubblica un guest post 10X"
    },
    {
      "level": "H2",
      "text": "2. Crea tweet a cascata"
    },
    {
      "level": "H2",
      "text": "3. Crea una newsletter interessante per chi è iscritto"
    },
    {
      "level": "H2",
      "text": "4. Ospita dei webinar"
    },
    {
      "level": "H2",
      "text": "5. Crea checklist, modelli o strumenti utili"
    },
    {
      "level": "H2",
      "text": "6. Metti a disposizione la tua esperienza"
    },
    {
      "level": "H2",
      "text": "7. Pubblica ricerche originali"
    },
    {
      "level": "H2",
      "text": "8. Cresci grazie ai contenuti generati dagli utenti"
    },
    {
      "level": "H2",
      "text": "9. Coltiva i contatti con un corso via e‑mail"
    },
    {
      "level": "H2",
      "text": "10. Crea una pagina comparativa"
    },
    {
      "level": "H2",
      "text": "11. Riproponi i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Priscilla Tan"
}