{
  "url": "https://ahrefs.com/blog/it/intento-ricerca/",
  "slug": "intento-ricerca",
  "title": "Intento di Ricerca nella SEO: Cos'è e Come ottimizzarlo",
  "description": "L'intento di ricerca è il motivo dietro una query. Per posizionarsi bene, è fondamentale creare contenuti in linea con l’intento di ricerca.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti L’intento di ricerca è il motivo dietro una ricerca. In altre parole, è ciò che l’utente cerca quando utilizza un motore di ricerca come Google.In questa guida imparerai tutto quello che devi sapere sull’intento di ricerca e su come ottimizzare i tuoi contenuti per fare in modo che rispondano a questo.Non sai come iniziare con la ricerca parole chiave? Leggi la nostra Guida per principianti alla ricerca parole chiaveContenutiPerché l’intento di ricerca è importante per la SEO?Google dà priorità alla pertinenza nei risultati di ricerca. Quindi, se vuoi posizionarti su Google, i tuoi contenuti devono essere il risultato più pertinente per la ricerca. Innanzitutto, ciò significa creare contenuti in linea con l’intento di ricerca del tuo target.Ad esempio, se cerchi “miglior suv” in inglese su Google.com, noterai che tutti i risultati sono classifiche e recensioni di SUV, non la pagina di un’auto in particolare.Questo perché Google sa che l’intento dell’utente è prima imparare e poi potenzialmente acquistare.L’ottimizzazione per l’intento di ricerca può portare ottimi risultati. Abbiamo ottenuto il 516% di traffico in più in meno di sei mesi apportando una modifica a una delle nostre pagine.La pagina non si posizionava bene perché mancava uno strumento gratuito. Per allinearlo alle aspettative degli utenti per la ricerca “backlink checker”, dovevamo aggiungere quello strumento.Come trovare e ottimizzare per l’intento di ricercaI SEO solitamente raggruppano le parole chiave in uno di questi tre gruppi di intenti di ricerca:Intento informativo: gli utenti vogliono imparare qualcosaIntento transazionale: gli utenti vogliono acquistare qualcosaIntento di navigazione: gli utenti cercano un sito specificoQuesti intenti di ricerca sono generalmente troppo ambigui per essere utili.Ad esempio, la query “miglior friggitrice ad aria” è informativa, poiché gli utenti che effettuano le ricerche vogliono chiaramente imparare, non acquistare. Ma questo non ti dice nulla su ciò che realmente vogliono.Vogliono un post o un video?Vogliono un elenco delle migliori opzioni o un unico consiglio e recensione?Danno valore a qualcosa in particolare quando cercano consigli?È impossibile soddisfare l’intento di ricerca del pubblico se non si conoscono le risposte a queste domande. E se non soddisfi le intenzioni, le tue possibilità di posizionarti sono scarse o nulle.Questo è il motivo per cui abbiamo ideato un modo nuovo (e, si spera, migliore) per capire le intenzioni di ricerca.Ecco i passaggi:Step 1. Allinea i tuoi contenuti alle “tre C dell’intento di ricerca”Per cominciare, devi identificare le tre C dell’intento di ricerca per la tua parola chiave target e assicurarti che il tuo contenuto sia in linea con quello. Le tre C sono:Contenuto: tipoContenuto: formatoContenuto: angoloL’idea è che quando si creano contenuti per l’intento di ricerca, ha più senso seguire la massa. Ad esempio, se la maggior parte delle pagine sono guide pratiche, crea una guida pratica. Naturalmente, ciò non significa che devi copiarli interamente.Vediamo il processo in dettaglio.1. Tipo di contenutoSi riferisce al “tipo” di contenuto dominante nei risultati di ricerca e solitamente è uno dei seguenti:Blog postVideoPagina prodottoCategoriaLanding pageAd esempio, dai un’occhiata ai migliori risultati di ricerca per “miglior friggitrice ad aria” in inglese usando Keywords Explorer di Ahrefs. Solo osservando i titoli, possiamo vedere che il tipo di contenuto dominante è un post del blog.Ciò significa che gli utenti non si aspettano di vedere pagine in cui i produttori di friggitrici spiegano perché il loro prodotto è il migliore. Vogliono l’opinione di qualcuno che ha testato le diverse opzioni disponibili sul mercato prima di effettuare l’acquisto.Ulteriori approfondimentiCome Lavorare sulle Parole Chiave Usando I Blog Post (e Ottenere Traffico Organico)2. Formato del contenuto Si riferisce al “formato” dominante delle pagine che si posizionano in alto. In genere, il formato del contenuto si applica ai post del blog.Tra i formati più comuni ci sono:Guide “come si”Tutorial passo dopo passoElenchiOpinioniRecensioniComparazioniNell’esempio della “miglior friggitrice ad aria”, il formato di contenuto dominante è l’elenco. Basta guardare i titoli:Ciò significa che gli utenti desiderano un elenco di consigli, non solo un singolo consiglio o una singola recensione.3. Angolo del contenuto L’angolo del contenuto si riferisce al punto di vista unico dei post e delle pagine che si posizionano in alto. Offre informazioni su ciò che gli utenti apprezzano quando eseguono questa particolare ricerca.Nel nostro esempio, “2023” è l’angolo di contenuto dominante (ovvero, i migliori prodotti dell’anno in corso). Ancora una volta, è evidente semplicemente guardando i titoli.Ciò significa che gli utenti cercano consigli aggiornati. E ha senso, dato che vengono lanciate continuamente nuove friggitrici ad aria.Step 2. Trova sottoargomenti da trattare nei tuoi contenutiPer soddisfare l’intento di ricerca degli utenti, devi coprire l’argomento per intero. Includere i sottoargomenti che gli utenti potrebbero aspettarsi è un ottimo modo per farlo.Ecco due modi per trovare gli argomenti secondari principali.1. Visita le pagine in alto sui motori di ricercaGli aspetti comuni tra le pagine che si posizionano in alto possono darti indizi su ciò che gli utenti si aspettano di vedere per un determinato argomento.Ad esempio, visitando alcuni post di blog che si posizionano in alto relativi alla “miglior friggitrice ad aria”, si nota che questi consigliano i migliori prodotti nelle rispettive categorie.Una delle categorie più comuni è una piccola friggitrice ad aria ideale per una persona.La presenza di diverse categorie di prodotti suggerisce che le persone potrebbero avere esigenze diverse quando si tratta di questo articolo. Pertanto, è probabilmente una buona idea includere categorie di prodotti simili nel contenuto.2. Esegui un’analisi del gap di contenuto a livello di paginaL’analisi del gap dei contenuti è un modo semplice e automatizzato per trovare argomenti secondari e punti chiave in comune. Funziona elencando parole chiave comuni per le pagine analizzate che si posizionano in alto.Ad esempio, facciamo un’analisi del gap di contenuto per la parola chiave “miglior friggitrice ad aria” in Ahrefs, sempre in inglese. Per farlo, dobbiamo inserire la parola chiave nel Keyword Explorer di Ahrefs e aprire alcune pagine che si posizionano in alto e che presentano lo stesso intento nel report Content Gap.In questo modo possiamo vedere un elenco di query di ricerca comuni. Alcune probabilmente costituiranno ottimi sottotitoli o punti da trattare nella nostra pagina. Ecco un estratto dall’analisi del gap di contenuto:Quindi, in un elenco delle migliori friggitrici ad aria in inglese per il mercato americano, alcune delle cose che potresti voler includere sono queste:Best budget optionBest option based on capacity (small/large, quart capacity)Best smart air fryer Consiglio ProAlcuni SEO utilizzano la volatilità della ricerca come elemento per determinare la chiarezza dell’intento di ricerca.Per valutare la volatilità della ricerca, incolla la tua parola chiave nel Keywords Explorer di Ahrefs, quindi scorri verso il basso fino al grafico della cronologia delle posizioni SERP e imposta i filtri su “Top 50” e “ultimi 6 mesi”.Le parole chiave con fluttuazioni minime o nulle in termini di posizionamento nel tempo sono una buona scelta poiché hanno un intento di ricerca chiaro…Bassa volatilità SERP per la frase chiave “come scrivere un curriculum” in inglese.… mentre le parole chiave con molte fluttuazioni sembrano essere meno “affidabili” perché l’intento di ricerca cambia frequentemente.Elevata volatilità della SERP per la parola chiave “mercurio” in inglese.ConclusioniL’intento di ricerca è uno dei fattori di ranking più importanti.Se non riesci a dare agli utenti ciò che vogliono, le tue possibilità di posizionarti saranno scarse o nulle.Lo abbiamo visto più e più volte con i contenuti che pubblichiamo qui sul blog di Ahrefs.Se vuoi posizionarti a lungo termine, comprendere l’intento di ricerca è fondamentale.Devi fare in modo che la tua missione sia di offrire agli utenti ciò che desiderano. Se ragioni in questo modo, Google (e probabilmente anche altri motori di ricerca) quasi sicuramente ti ricompenserà.Hai domande o commenti? Contattami su Twitter o Mastodon. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Collaboratori Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Collaboratori",
  "headers": [
    {
      "level": "H1",
      "text": "Intento di Ricerca nella SEO: Cos’è e Come ottimizzarlo"
    },
    {
      "level": "H2",
      "text": "Perché l’intento di ricerca è importante per la SEO?"
    },
    {
      "level": "H2",
      "text": "Come trovare e ottimizzare per l’intento di ricerca"
    },
    {
      "level": "H3",
      "text": "Step 1. Allinea i tuoi contenuti alle “tre C dell’intento di ricerca”"
    },
    {
      "level": "H4",
      "text": "1. Tipo di contenuto"
    },
    {
      "level": "H4",
      "text": "2. Formato del contenuto"
    },
    {
      "level": "H4",
      "text": "3. Angolo del contenuto"
    },
    {
      "level": "H3",
      "text": "Step 2. Trova sottoargomenti da trattare nei tuoi contenuti"
    },
    {
      "level": "H4",
      "text": "1. Visita le pagine in alto sui motori di ricerca"
    },
    {
      "level": "H4",
      "text": "2. Esegui un’analisi del gap di contenuto a livello di pagina"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Mateusz Makosiewicz, Joshua Hardwick"
}