{
  "url": "https://ahrefs.com/blog/it/lifecycle-marketing/",
  "slug": "lifecycle-marketing",
  "title": "La Guida al Lifecycle Marketing per Principianti",
  "description": "Il lifecycle marketing è il processo che integra tutti i canali di comunicazione supportando l’utente in tutte le fasi del processo di acquisto.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti I clienti sono diversi l’uno dall’altro.Poiché si trovano a differenti stati del percorso d’acquisto rispondono a diversi messaggi. Avere un solo messaggio, e diffonderlo a tutti, non funziona e potrebbe persino disincentivare alcuni utenti.Quello di cui hai bisogno è una strategia che tenga conto della fase in cui si trovano i clienti. Solo in questo modo puoi creare e personalizzare un messaggio.Come farlo?Puoi adottare quello che viene chiamato lifecycle marketing (o marketing del ciclo di vita). In questo post imparerai quanto segue:Che cosa si intende per lifecycle marketing Come creare una strategia di lifecycle marketingTattiche per il lifecycle marketingChe cosa si intende per lifecycle marketing?Il lifecycle marketing è il processo che permette di legare il tipo di comunicazione che un cliente desidera vedere al processo di acquisto o fruizione dei contenuti.In genere, il ciclo di vita del cliente consiste in sei fasi di alto livello, simili a quelle del funnel di marketing:Consapevolezza/Awareness: un potenziale cliente scopre tutto sul tuo brand;Impegno: il tuo potenziale cliente interagisce con il tuo brand e scopre di più su ciò che offri;Considerazione: il tuo potenziale cliente valuta la tua offerta e decide se può fare al caso suo; Acquisto: il tuo potenziale cliente decide di acquistare da te; Supporto: supporti il cliente assicurandoti che tragga il massimo valore e soddisfazione dal suo acquisto;Fedeltà: il tuo cliente ama il tuo brand, acquista da te ripetutamente e/o parla di te agli altri.L’idea alla base del marketing del ciclo di vita è stata sviluppata da Infusionsoft (ora Keap) per promuovere il suo software di email marketing. Oggi, il concetto continua ad essere associato all’email marketing.Tuttavia, i clienti non interagiscono con un’azienda solo tramite e‑mail. Quindi possiamo espandere l’ambito del lifecycle marketing ad altri canali di marketing.Come creare una strategia di lifecycle marketingPer creare una strategia di marketing del ciclo di vita utilizzeremo questo framework, per gentile concessione di Barilliance, che si compone di 3 fasi:TriggerMessaggiCanaleScopriamoli nel dettaglio.1. TriggerI trigger sono condizioni predefinite che determinano quando un messaggio di marketing deve essere presentato a un cliente. Queste condizioni sono allineate con le sei fasi del ciclo di vita del cliente.Poiché le sei fasi del ciclo di vita del cliente sono abbastanza generali, suddividiamole in segmenti più specifici che possono fungere da trigger:Utenti potenziali che non hanno mai sentito parlare del tuo brand [Awareness]Nuovi visitatori del sito [Awareness]Nuovi iscritti all’e-mail [Coinvolgimento]Utenti potenziali che stanno confrontando prodotti/servizi [Considerazione]Utenti che hanno abbandonato il carrello [Considerazione]Clienti per la prima volta [Acquisto]Clienti una tantum [Supporto]Clienti abituali [Fedeltà]Praticamente, qualsiasi azione del cliente può essere trasformata in un trigger.2. MessaggioIl messaggio è quello che invii ai tuoi clienti.Non fare l’errore di inviare loro qualsiasi cosa: infatti i clienti non solo devono essere interessati al messaggio ma devono anche poterlo immediatamente legare al trigger per il quale è stato generato. Ad esempio, potresti voler inviare un promemoria via e‑mail agli utenti che hanno abbandonato il carrello, ovvero a coloro che hanno abbandonato la fase di Considerazione.3. CanaleÈ qui che viene inviato il messaggio. Può essere qualsiasi canale di marketing: e‑mail, social, chat dal vivo, YouTube, ecc.Tattiche per il lifecycle marketingVediamo come applicare il framework che abbiamo appena presentato alla realtà. Useremo i segmenti che abbiamo creato come esempi di come si lavora con il lifecycle marketing.1. Utenti potenziali che non hanno mai sentito parlare del tuo brandTrigger: I clienti si rendono conto di avere un problema e cercano la soluzione su GoogleMessaggio: Educa i tuoi clienti su come risolvere il problemaCanale: Search engine optimization (SEO)I clienti non acquistano da te se non sanno che esisti. E la scoperta di solito avviene perché i clienti scoprono prima di avere un problema che devono risolvere.Quando ciò accade, passano da Google. Ciò significa che se vogliamo che potenziali clienti ci trovino, dobbiamo posizionarci su Google. Non solo, dobbiamo capire quali problemi stanno cercando e che tipo di parole stanno usando.Per farlo, possiamo utilizzare uno strumento di ricerca per parole chiave. Ecco come:Vai sul Keywords Explorer di AhrefsInserisci alcuni termini relativi a ciò che stai vendendo (e.g., “caffè,” “cappuccino,” “caffè in grani,” ecc)Clicca su Termini correlati Seleziona le DomandeA seguito di questa ricerca, che noi abbiamo condotto in inglese, troverai oltre 300.000 potenziali argomenti. Guarda l’elenco e scegli quelli che sono rilevanti per il tuo sito web. Quindi crea contenuti che si posizionano per questi argomenti.Letture consigliate: Keyword Research: La Guida di Ahrefs per Principianti2. Nuovi visitatori dal sitoTrigger: Utenti che arrivano sul tuo sito per la prima volta dopo aver scoperto i tuoi contenutiMessaggio: Iscrizione alla newsletterCanale: E‑mailDopo aver scoperto i tuoi contenuti, la maggior parte delle persone se ne andrà e non tornerà mai più. Quindi, se vuoi che continuino a interagire con i tuoi contenuti e il tuo brand, devi convincerli a rimanere o tornare di nuovo sul tuo sito web.Ci sono molti modi per farlo, incluso convincerli a seguirti sui social. Secondo me, l’e-mail è il canale migliore poiché ti permette una comunicazione diretta al contrario delle piattaforme social che possono rimuoverti in qualsiasi momento.Tuttavia, una persona che visita il tuo sito non lascerà le proprie informazioni di contatto se non vedrà un beneficio nel farlo. Per questo devi convincerli, e ci sono diversi modi per farlo, Noi per esempio lo facciamo in maniera semplice chiedendo loro di iscriversi alla nostra newsletter per ricevere un riassunto dei contenuti ogni settimana:Gli di e‑commerce tendono ad offrire degli sconti come incentivo:Mentre i blogger preferiscono regalare eBook gratuiti:3. Nuovi iscritti all’e-mailTrigger: Utenti che si sono iscritti alla newsletterMessaggio: Una serie di messaggi di benvenuto per presentare brand, contenuti e catalogo/prodottiCanale: E‑mailUna volta che il potenziale cliente si iscrive alla tua newsletter, devi fare seguito alle tue promesse: inviare un codice sconto, un eBook, ecc. Ma oltre a fare questo, devi anche utilizzare questa iscrizione come opportunità per continuare a coinvolgerlo e fare in modo che si interfacci sempre di più con i tuoi contenuti (o, se gestisci un e‑commerce, con il tuo catalogo di prodotti).Ad esempio, dopo aver confermato l’iscrizione, l’agenzia di marketing Demand Curve invia un’e-mail con una serie di risorse da controllare:Dr. Rhonda Patrick invia una serie di e‑mail distribuite su più giorni dove presenta i suoi contenuti premium, che fornisce gratuitamente:4. Utenti potenziali che stanno paragonando le offerteTrigger: I clienti stanno confrontando prodotti/offerte su GoogleMessaggio: Confronti tra caratteristiche, confronti tra prodottiCanale: SEOI clienti sono sempre alla ricerca del miglior rapporto qualità-prezzo. Quindi, anche se conoscono il tuo marchio, faranno sempre confronti. Uno dei modi in cui lo fanno è cercare su Google il tuo brand e i tuoi concorrenti.Ecco come scoprire con chi ti confrontano i tuoi clienti:Vai sul Keywords Explorer di Ahrefs Inserisci il nome del tuo brand Vai su Termini correlatiAlla voce Temini, clicca su “vs”Qui per esempio possiamo vedere i diversi brand con cui i nostri clienti ci mettono a confronto. Sta a te decidere se creare una pagina o singole pagine per ogni concorrente. Noi di Ahrefs abbiamo creato una pagina “versus”:Piuttosto che confrontare fianco a fianco delle funzionalità e decidere quali sono le migliori e chi vince il confronto, abbiamo deciso di presentare sondaggi indipendenti e parlare delle funzionalità che solo il nostro set di strumenti ha.5. Utenti che hanno abbandonato il carrelloTrigger: I clienti aggiungono i prodotti al carrello ma non completano l’acquistoMessaggio: Completare l’acquistoCanale: E‑mail, retargetingDurante il processo di acquisto, i clienti possono procrastinare o esitare. Iniziano aggiungendo i tuoi prodotti al carrello, ma lo abbandonano a metà perché sono distratti, hanno un’altra questione di cui occuparsi, sono sorpresi dal prezzo totale o sono infastiditi da un elemento presente nel tuo processo di pagamento.Secondo uno studio di Statista di marzo del 2021 quasi l’80% degli ordini di acquisto online viene lasciato a metà.I carrelli abbandonati vanno bene se i clienti ritornano. Ma molti non lo fanno e Sleeknote ha notato che gli e‑commerce perdono circa 18 miliardi di dollari ogni anno a causa dell’abbandono del carrello.Ciò significa che hai bisogno di un modo per finalizzare queste vendite.Il metodo più comune è inviare un’e-mail a coloro che hanno abbandonato il carrello. Ecco un esempio di Bonobos, un marchio di abbigliamento maschile:Fonte: Really Good Emails.Le e‑mail inviate per evitare il fenomeno del carrello abbandonato non si limitano solo ai marchi di e‑commerce. Puoi utilizzare queste e‑mail per qualsiasi transazione incompleta, in qualsiasi settore. Ad esempio, eccone una di CodeAcademy, una scuola di programmazione online:Oltre all’e-mail, puoi anche fare il retargeting di questi clienti utilizzando gli annunci sui social media. In questo modo, mentre navigano sul Web, verrà loro ricordato di completare l’acquisto rimasto a metà.6. Clienti per la prima voltaTrigger: I clienti acquistano il tuo prodottoMessaggio: Come ottenere il meglio dal tuo prodottoCanale: E‑mail, in-app, chat live, social media, video, content marketingOffri ai tuoi nuovi clienti un’esperienza fantastica e diventeranno fedeli promotori del tuo brand. Un modo per farlo è offrire supporto e insegnamento: insegna loro come utilizzare al meglio il tuo prodotto in modo che siano motivati ​​a rimanere o ad acquistare ancora.In Ahrefs, oltre all’onboarding in-app, inviamo anche e‑mail con varie risorse che abbiamo creato per aiutare i clienti a ottenere di più dal nostro prodotto. Ciò include una breve spiegazione sulle potenzialità del nostro set di strumenti, un’introduzione alla nostra knowledge base e tutorial in-app, oltre a ricordare loro che possono parlare con il personale di supporto nella chat live ogni volta che hanno bisogno di aiuto.Condividiamo anche con loro i migliori contenuti presenti sul nostro blog e sul nostro canale YouTube, molti dei quali riguardano i diversi modi per utilizzare i nostri strumenti ed eseguire delle strategie e tattiche:Infine, li invitiamo anche a unirsi al nostro gruppo Facebook riservato ai clienti, Ahrefs Insider, in modo che possano interagire con altri SEO di alto livello per consigli, tattiche e soluzioni per i loro problemi:L’istruzione e il supporto non si limitano solo alle aziende software-as-a-service (SaaS) come la nostra. Anche i brand di e‑commerce possono farlo. Dai un’occhiata, ad esempio, a come Beardbrand crea contenuti per supportare i propri clienti:Se vendi abbigliamento da donna, puoi per esempio mostrare ai tuoi clienti come abbinare stili diversi per le diverse stagioni. Oppure se vendi scarpe da ginnastica puoi spiegare ai tuoi clienti come prendersene cura (soprattutto se parliamo di scarpe scamosciate!), pulirle e abbinarle a stili diversi (o anche allacciarle in modo diverso!).7. Clienti una tantumTrigger: I clienti hanno acquistato il tuo prodotto solo una voltaMessage: Sconto per un nuovo acquistoChannel: E‑mail, retargetingIl trigger di cui sopra serve a prevenire l’abbandono. Ma non importa quanto ci provi, alcuni clienti comunque smetteranno di acquistare da te. Tuttavia, puoi fare in modo che una percentuale di loro torni.Il retargeting può funzionare bene. Usa gli annunci per ricordare loro che non hanno più acquistato da te e invitali a controllare di nuovo ciò che offri.Anche l’e‑mail funziona. Drew Sanocki ha aiutato a trasformare il marchio di streetwear KarmaLoop in modo che passasse dal fallimento all’acquisizione. Uno degli strumenti utilizzati furono gli sconti per riconquistare i clienti una tantum.Drew spiega la strategia in modo più dettagliato qui. Ma fondamentalmente, l’idea è stata quella di inviare sconti crescenti nel tempo ai clienti che non avevano acquistato da qualche tempo.Nel momento in cui il cliente acquista, però, non gli vengono più inviati degli sconti. In questo modo non trascini il tuo marchio verso il basso per colpa dei costanti sconti (uno dei motivi per cui KarmaLoop era sull’orlo del fallimento).8. Clienti abitualiTrigger: Clienti che acquistano ripetutamente e frequentemente i tuoi prodottiMessaggio: Iscriviti al programma VIPCanale: E‑mail, in-app, in-storeAi clienti che amano il tuo prodotto dovrebbero essere date maggiori opportunità di acquistare e acquistare spesso. È per questo una buona idea invitarli ad un programma fedeltà o VIP.Ad esempio, Beauty Insider di Sephora è uno dei programmi fedeltà di maggior successo in circolazione. Ne fanno parte 25 milioni di persone che da sole garantiscono l’80% delle vendite annuali di Sephora. Il programma Beauty Insider funziona a livelli in modo da incoraggiare i clienti fedeli ad acquistare di più per passare al livello superiore:Essere un membro di Very Important Beauty (VIB) è importante per coloro che fanno parte della comunità di Sephora. Non solo ricevono premi e sconti, ma hanno anche accesso a prodotti ed eventi esclusivi. Tanto che esiste anche un’orgogliosa comunità VIB su YouTube:ConclusioniI segmenti e i trigger che ho presentato non sono esaustivi.In base alla tua attività, puoi adottare un approccio più granulare e creare ancora più segmenti. E per ogni segmento, puoi considerare più trigger.L’assenza di un’azione può essere un fattore scatenante. Ad esempio, un potenziale cliente che si unisce alla tua lista e‑mail ma non apre le ultime cinque e‑mail può essere il trigger necessario per inviare un nuovo e più coinvolgente messaggio.Che ne pensi? Ho dimenticato di citare qualcosa sul lifestyle marketing? Fammelo sapere su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "La Guida al Lifecycle Marketing per Principianti"
    },
    {
      "level": "H2",
      "text": "Che cosa si intende per lifecycle marketing?"
    },
    {
      "level": "H2",
      "text": "Come creare una strategia di lifecycle marketing"
    },
    {
      "level": "H3",
      "text": "1. Trigger"
    },
    {
      "level": "H3",
      "text": "2. Messaggio"
    },
    {
      "level": "H3",
      "text": "3. Canale"
    },
    {
      "level": "H2",
      "text": "Tattiche per il lifecycle marketing"
    },
    {
      "level": "H3",
      "text": "1. Utenti potenziali che non hanno mai sentito parlare del tuo brand"
    },
    {
      "level": "H3",
      "text": "2. Nuovi visitatori dal sito"
    },
    {
      "level": "H3",
      "text": "3. Nuovi iscritti all’e-mail"
    },
    {
      "level": "H3",
      "text": "4. Utenti potenziali che stanno paragonando le offerte"
    },
    {
      "level": "H3",
      "text": "5. Utenti che hanno abbandonato il carrello"
    },
    {
      "level": "H3",
      "text": "6. Clienti per la prima volta"
    },
    {
      "level": "H3",
      "text": "7. Clienti una tantum"
    },
    {
      "level": "H3",
      "text": "8. Clienti abituali"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}