{
  "url": "https://ahrefs.com/blog/it/link-building-local/",
  "slug": "link-building-local",
  "title": "9 Semplici Tattiche di Link Building Local",
  "description": "Se vuoi posizionare meglio su Google la tua azienda local hai bisogno di backlink. Scopri 9 modi per ottenere backlink local in questo articolo.",
  "content": "Patrick Stox Patrick Stox è Product Advisor, Technical SEO e Brand Ambassador di Ahrefs. E’ tra gli organizzatori di Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference, e moderatore di /r/TechSEO. Contenuti Qualsiasi studio e sondaggio condotto a livello SEO sul posizionamento local e il map pack mostra come i link siano uno dei principali fattori di posizionamento. Se vuoi quindi posizionare meglio su Google la tua azienda local o quella del tuo cliente hai bisogno di backlink.In questa guida ti mostrerò nove modi per generare backlink local, ma prima, partiamo dalle basi…Cos’è la local link buildingCome stimare il numero di link di cui hai bisognoCome ottenere link localCos’è la local link buildingLa local link building è il processo che consiste nel creare backlink pertinenti a livello contestuale o locale verso uno determinato sito. L’obiettivo è quello di portare traffico e utenti verso il sito, oltre a cercare di farlo posizionare meglio per ricerche locali e le relative mappe.Come stimare il numero di link di cui hai bisognoLa maggior parte delle azienda non ha bisogno di molti link per posizionarsi nelle ricerche locali. Puoi analizzare la panoramica della SERP all’interno del Keywords Explorer e noterai che raramente vedrai aziende con più di 150 domini referral posizionati in prima pagina:Puoi utilizzare il Keyword Explorer per farti un’idea della competizione per le parole chiave che ti interessano. Ti basta analizzare la panoramica della SERP per vedere quanti link, le pagine meglio posizionate, ottengono.Come ottenere link localCome con ogni altra tipologia di link building, ottenere link local richiede molta ricerca, duro lavoro, perseveranza e creatività. Ecco nove tattiche di link building local con cui iniziare:Ottieni link da altri siti posizionatiOttieni i link dei tuoi competitorRecupera i link persiCrea contenuti pertinenti alla tua zonaOttieni citazioni localPersegui altre opportunità di link localRecupera le menzioni senza linkAcquista delle aziende, o almeno il loro sitoAggiungi dei link interni1. Ottieni link da altri siti posizionatiQuesta è una tattica che talvolta viene chiamata Barnacle SEO. Consiste semplicemente nel cercare alcuni termini a te pertinenti su Google e tentare poi di ottenere link dai siti che vengono mostrati nei risultati di ricerca.Probabilmente non riuscirai a ottenere link dai tuoi competitor, ma cerca di identificare i vari aggregatori o i siti simili a directory. Quando le persone cercano un’azienda, tendono ad utilizzare questa tipologia di siti. Solitamente puoi apparire su questi semplicemente iscrivendoti e aggiungendo la tua azienda. Si tratta di un modo semplice e veloce per assicurarti di essere considerato e ottenere del valore diretto per la tua azienda.2. Ottieni i link dei tuoi competitorSe guardi la sovrapposizione in termini di link ricevuti dai tuoi competitor, potrai probabilmente scoprire molte opportunità contestuali e locali. Puoi farlo in maniera semplice con il Link Intersect. Aggiungi il tuo sito e quello dei tuoi competitor all’interno del tool, e vedrai quali siti linkano i tuoi competitor (ma non te).Quello che troverai sono probabilmente molti link specifici alla tua nicchia e molte directory. Molti si riferiscono a parte di queste directory con il termine citazioni locali, e queste tendono ad includere dettagli riguardo la tua azienda come il nome, l’indirizzo e il numero di telefono.3. Recupera i link persiI siti cambiano nel corso degli anni, e spesso capita di avere link che vanno verso pagine non più raggiungibili. Creando dei redirect dalle vecchie versioni delle pagine alle nuove, puoi recuperare i link persi ed il loro relativo valore. Ecco come farlo:Incolla il tuo dominio nel Site ExplorerVai sul report Migliori per linkAggiungi un filtro di risposta HTTP “404 not found”Solitamente ordino il report per “Domini Referral”4. Crea contenuti pertinenti alla tua zonaLa creazione di contenuti è il processo che consiste nel trovare argomenti atti ad attrarre la tua audience di riferimento per poi pianificare, creare e pubblicare contenuti su tali tematiche. Per i contenuti local, prova a pensare a ciò che è pertinente alla tua azienda e utile ai tuoi potenziali clienti. Potresti ideare contenuti del tipo “quali sono le migliori piante per la tua zona”, “quali animali da compagnia sono i più diffusi” o magari semplicemente i prezzi dei tuoi servizi nella tua zona.Anche se è piuttosto improbabile che questa tipologia di contenuti attragga molti link in maniera naturale, questi tendono a performare bene facendo outreach tramite email.5. Ottieni citazioni localAbbiamo già visto come identificare alcune di queste opportunità attraverso il Link Intersect. Ci sono molti altri servizi in grado di fornire citazioni locali, ma oltre ai siti che trovi nel tuo mercato di riferimento, questi sono quelli ai quali potresti pensare di iscriverti se lavori negli Stati Uniti. Molti di loro infatti forniscono dati ad altri siti, e vengono quindi considerate le citazioni più importanti da ottenere.Principali aggregatori per gli Stati UnitiData AxleLocalezeFoursquareAltri aggregatori importanti:Google My BusinessBingApple MapsFacebookYelpYellowpagesDunn & BradstreetTomTom6. Persegui altre opportunità di link localQuesti sono tutti i link provenienti da altri siti incentrati sulla tua zona. Ci sono molte opportunità se ti metti a cercare, e scriverò un articolo dedicato sull’intero processo per identificarli. Per ora, mi limiterò a fornirti una lista di idee:Università e Istituti (es. annunci di lavoro, borse di studio, sponsor sportivi, sponsor di club privati, risorse per gli studenti)Siti e directory specifici per cittàGiornali, podcast e magazine localiSiti che hanno un focus sulla regione o le aree circostantiGruppi delle community local (es. Reddit, gruppi Facebook, Nextdoor, etc.)Sponsorizzazioni generiche (es., eventi sportivi, gare, incontri, beneficienza, etc.)Local awardsPuoi fare leva anche sulle tue relazioni esistenti. Questo potrebbe includere cose come testimonial o case study per i fornitori o gli affiliati. Potrebbe anche significare eventuali rapporti che hai con parrocchie, gruppi di commercianti o anche persone. Nutrire l’ego delle persone funziona bene a livello locale se vuoi fare cose come raccogliere i pareri degli esperti.7. Recupera le menzioni senza linkLe menzioni del tuo brand senza link sono quelle in cui qualcuno parla della tua azienda o delle persone che ci lavorano ma che non linkano al tuo sito. Avrai più successo con questa tattica se sei in una nicchia che ottiene copertura dalle notizie come ad esempio se sei un avvocato o se la tua azienda o le persone che ci lavorano sono già attive nella community.Abbiamo un’intera guida per trovare le menzioni senza link che può aiutarti in questo processo.8. Acquista delle aziende, o almeno il loro sitoAnche se questo è un evento più raro e non frequente, le fusioni e le acquisizioni avvengono anche a livello locale. Occasionalmente puoi identificare aziende che vendono il loro sito esistente o lasciano scadere il proprio dominio. Acquisendo, puoi sfruttare la potenza di due siti entrambi posizionati, o uno più grande meglio posizionato. Queste opportunità sono piuttosto rare a livello locale e sono stato in grado di fare ciò poche volte nella mia carriera. Se trovi però la giusta opportunità, può avere davvero molto valore ed impatto.9. Aggiungi dei link interniAnche il tuo sito è local e hai controllo su di esso. I link interni sono una tattica di link building molto potente. Dai uno sguardo a questa guida per trovare le opportunità di link sotto questo punto di vista.ConclusioneNella mia esperienza, le persone vogliono spesso saltare le tattiche base di link building per passare a quelle più trendy o divertenti, ma queste spesso sono più rischiose e meno ripaganti. Prima concentrati sulle basi, poi sfrutta le tattiche più creative man mano che la tua azienda cresce.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Patrick Stox Patrick Stox è Product Advisor, Technical SEO e Brand Ambassador di Ahrefs. E’ tra gli organizzatori di Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference, e moderatore di /r/TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Semplici Tattiche di Link Building Local"
    },
    {
      "level": "H2",
      "text": "Cos’è la local link building"
    },
    {
      "level": "H2",
      "text": "Come stimare il numero di link di cui hai bisogno"
    },
    {
      "level": "H2",
      "text": "Come ottenere link local"
    },
    {
      "level": "H3",
      "text": "1. Ottieni link da altri siti posizionati"
    },
    {
      "level": "H3",
      "text": "2. Ottieni i link dei tuoi competitor"
    },
    {
      "level": "H3",
      "text": "3. Recupera i link persi"
    },
    {
      "level": "H3",
      "text": "4. Crea contenuti pertinenti alla tua zona"
    },
    {
      "level": "H3",
      "text": "5. Ottieni citazioni local"
    },
    {
      "level": "H3",
      "text": "6. Persegui altre opportunità di link local"
    },
    {
      "level": "H3",
      "text": "7. Recupera le menzioni senza link"
    },
    {
      "level": "H3",
      "text": "8. Acquista delle aziende, o almeno il loro sito"
    },
    {
      "level": "H3",
      "text": "9. Aggiungi dei link interni"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Patrick Stox"
}