{
  "url": "https://ahrefs.com/blog/it/link-building/",
  "slug": "link-building",
  "title": "La Guida alla Link Building per Principianti - SEO Blog by Ahrefs",
  "description": "Tutto quello che devi sapere sulla link building per la SEO. Cos’è, come funziona, cosa rende un link buono e come ottenerne di più.",
  "content": "Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim I link sono la moneta del web. I siti che ne hanno molti sono etichettati come “autorevoli” e sono ripagati con posizionamenti migliori all’interno di Google. I siti che non ne hanno, sono invece destinati all’oscurità.Se hai appena iniziato con la SEO, comprendere la link building può essere complicato.Alcuni esperti SEO ti diranno di creare contenuti eccezionali e aspettare che i link arrivino in maniera spontanea o naturale (come vengono chiamati nel settore), altri insistono che inviare proposte via email sia la soluzione, mentre altri ancora ti risponderanno con un sorriso criptico ed una sola parola: PBN.Chi dovresti ascoltare?Come accade spesso nel mondo della SEO, la risposta corretta è: “dipende”. Nella link building non esiste un approccio univoco, e la tua scelta in termini di tattica dipende dal settore nel quale sei coinvolto, il tuo sito, le tue risorse ed i tuoi obiettivi.Ho per caso reso le cose ancora più complicate di come non lo fossero già?Nessun problema. Abbiamo creato questa guida alla link building mettendoci nei panni di un principiante, assicurandoci di renderla piena di consigli che puoi mettere in pratica fin da subito.Che dici, iniziamo?Contents Guida SEO 1Come Funzionano i Motori di Ricerca 2Nozioni di base sulla SEO 3Ricerca delle parole chiave 4Contenuto SEO (EN) 5SEO on-page 6Link Building 7SEO tecnica Part 1Basi della link buildingDato che questa è una guida per principianti, è logico iniziare dalle basi.Cos’è la link building?La link building è il processo per il quale si ottengono link da altri siti verso le pagine del tuo sito, al fine di posizionare queste più in alto fra i risultati di ricerca Google.In generale, puoi riassumere la maggior parte delle strategie di link building “white hat” a questi due semplici passi:Crea qualcosa che attragga l’attenzione delle persone (e di conseguenza a cui valga la pena fornire un link);Mostra quel qualcosa alle persone che possiedono un sito (e che quindi possono fornire un link).Perchè la link building è importante?Secondo Andrey Lipattsev di Google, i link sono uno dei tre più importanti fattori di posizionamento su Google. Se vuoi quindi che le pagine del tuo sito si posizionino in alto nelle ricerche, ci sono molte probabilità che avrai bisogno di link. Google (e gli altri motori di ricerca), vedono i link provenienti da altri siti come una sorta di “voto”. Questi voti li aiutano a identificare quali pagine riguardo uno specifico tema (fra le migliaia di quelle esistenti) sono degne di posizionarsi in cima ai risultati di ricerca.Come regola generale, le pagine con un maggior numero di backlink tendono a posizionarsi meglio fra i risultati di ricerca. Questo è stato studiato approfonditamente da molte aziende SEO, e la correlazione fra il numero link che una pagina riceve e la posizione di questa fra i risultati di ricerca Google è sempre stata molto forte.Secondo il nostro studio, le pagine che ricevono link da più siti tendono ad ottenere un maggior volume di traffico.Quindi i link sono importanti, questo è chiaro.Ma perché è così importante “costruirli”?Dopotutto, i siti tendono a creare dei link fra di loro in maniera spontanea, giusto? Hai solo letto alcuni paragrafi di questa guida e hai probabilmente visto che ho già inserito link a due diverse pagine.In un mondo ideale, la migliore pagina riguardo un determinato argomento otterrebbe il maggior numero di link e si posizionerebbe #1 su Google. Mentre le pagine di bassa qualità non otterrebbero così tanti link e si posizionerebbero più in basso. Ma non viviamo in un modo ideale. E ci sono sempre almeno due motivi principali per cui le pagine con più link non sono necessariamente le migliori:1. Il Circolo Vizioso della SEOImmagina come io abbia scelto le pagine a cui ho fornito link qui sopra. Credi che io abbia studiato migliaia di risultati simili per poi prendere le migliori pagine di ogni argomento? Certo che no. Ho condotto una veloce ricerca su Google cercando quello che volevo inserire come link, aperto un paio di risultati fra quelli meglio posizionati per assicurarmi che dicessero quello che volevo, e ho inserito il link a quelli che sembravano assolvere al compito al meglio.E questo è il modo in cui le due migliori pagine si sono appena assicurate nuovi link, rafforzando ancor più il loro posizionamento su Google.Noi lo chiamiamo “Il Circolo Vizioso della SEO”. Abbiamo condotto uno studio per provare come si tratti di una cosa reale.Già nel momento in cui viene pubblicata, la tua magnifica pagina ha uno svantaggio enorme contro quelle già posizionate per lo stesso argomento in cima a Google. E se vuoi rompere il circolo vizioso, devi essere proattivo nell’acquisire dei backlink verso di essa.2. I tuoi concorrenti stanno, con molta probabilità, facendo link buildingPoniamo il caso che la tua pagina abbia ottenuto molti link spontanei (senza quindi fare link building) e ora si posiziona #1 su Google per la sua tematica.Indovina? La pagina di qualcun altro era posizionata #1 prima della tua. E il suo proprietario cercherà di ottenere di nuovo la prima posizione costruendo nuovi link di qualità verso di essa.E lo stesso vale per il proprietario della pagina in posizione #3, che era prima in posizione #2. Sicuramente non sono contenti e cominceranno a costruire nuovi link come rimedio.E nonostante la tua pagina possa essere dieci volte migliore delle loro (che dovrebbe essere il motivo per cui ha ottenuto così tanti link naturali), i tuoi concorrenti possono comunque scavalcarti se sono abili abbastanza nella link building.Hai due opzioni, la prima è non fare nulla e lamentarti di come il mondo sia ingiusto, la seconda è rimboccarti le maniche e contrattaccare.I link non sono la risposta a tuttoDa questo capitolo introduttivo potrebbe sembrare come per posizionarti #1 su Google tutto quello di cui hai bisogno sia costruire più link rispetto alle pagine che al momento si trovano in quella posizione.E anche se questo è vero fino a un certo punto, in realtà le cose sono un pò più complicate di così.Tralasciando il fatto che non tutti i link siano uguali (ne parleremo meglio nel Capitolo 3), i motori di ricerca tengono in considerazione molte altre variabili quando posizionano le pagine. E il mix di queste variabili potrebbe dipendere dalla tipologia di query di ricerca per la quale ti vuoi posizionare. Se acquisisci molti link verso le tue pagine ma i tuoi posizionamenti continuano ad essere scarsi, non prendertela con questa guida per averti tratto in inganno. Investiga altri fattori di posizionamento che potrebbero essere la causa delle tue scarse prestazioni in termini di posizionamento.Part 2Come acquisire linkCi sono molte tattiche e strategie che possono aiutarti ad ottenere più link da altri siti verso le tue pagine. In questo capitolo imparerai quali sono, la logica dietro di esse, e quanto è rischioso utilizzarle.Concettualmente, la maggior parte delle tecniche e delle strategie di link building fa parte di uno dei seguenti gruppi: Aggiunta, Richiesta, Acquisto, Guadagno e Conservazione.1. Aggiungere linkSe puoi recarti su di un sito che non ti appartiene, e inserire manualmente un link, questo è quello che si chiama link “aggiunto”. Le tattiche più comuni in questa categoria sono le seguenti: Invio a business directory;Creazione dei profili social;Commenti nei blog;Post su forum, community e siti di Domande&Risposte;Creazione di annunci di lavoro;ecc.Costruire link attraverso queste tattiche è molto semplice da fare. E proprio per questo motivo, questi link tendono ad avere poco valore agli occhi di Google (in certi casi possono addirittura essere segnalati come SPAM).A parte ciò, questi link solitamente non danno molto in termini di vantaggi competitivi. Se puoi recarti su di un sito e piazzare un link manualmente, nulla proibisce ai tuoi concorrenti di fare lo stesso.Ad ogni modo, non dovresti ignorare completamente queste strategie. Ognuna può portare un beneficio alla tua azienda che va oltre la questione dell’acquisizione dei link.Mi spiego meglio con un paio di esempi:Inviare il sito a business directoryDovresti resistere alla tentazione di inviare il tuo sito ad ogni singola directory per aziende che trovi solo per ottenere un link. Concentrati invece su quelle che sono ben conosciute, hanno traffico e potrebbero quindi portare visitatori sul tuo sito.Ad esempio, se sei il titolare di una piccola impresa e sei venuto a conoscenza di una directory dove gli imprenditori simili a te riescono a generare lead, dovresti assolutamente inserire lì anche il tuo sito. Quel singolo link porterebbe molto più ‘valore a livello SEO’ rispetto all’inclusione del sito su tutte le altre directory generiche che hai trovato su qualche forum che parla di SEO.Crea profili social per la tua aziendaÈ una buona pratica quella di reclamare il nome del tuo brand su tutte le principali piattaforme social (Twitter, YouTube, SlideShare, Instagram e simili). Altrimenti qualcuno potrebbe fregarti i nomi una volta che il tuo brand finisce sui loro radar.È per questa motivazione che il nostro team ha “ahrefscom”, invece di “ahrefs” su Instagram. Qualcuno ci ha rubato lo username e non siamo riusciti a farlo nostro—per ora. La nostra pagina profilo su Instagram, che contiene un link verso il nostro sito.Non ci siamo mai impegnati nel promuovere il nostro profilo Instagram, ma questo ottiene comunque link da oltre 70 siti. Questo la rende un’ottima e “forte” pagina dalla quale ricevere un link (parleremo del valore di questi link nel Capitolo 3):Screenshot preso dal Site Explorer di Ahrefs.Commenti nei blogLasciare degli utili commenti sull’articolo di qualcun’altro è un ottimo modo per farsi notare e avviare una relazione con loro (che potrebbe poi portare ad una serie di ottime conseguenze). Ma inviare commenti con il solo scopo di ottenere un link verso il tuo sito farà sì che i proprietari dei blog inizino ad odiarti.Inoltre i commenti dei blog sono spesso nofollow (ovvero, potrebbero non contare come “voto”). Quindi, se stai pensando di lasciare un commento solo per inserire un link verso il tuo sito—non farlo.Spero che questi tre esempi ti diano una buona idea di come “aggiungere” link ad altri siti senza cadere nella pratica dello SPAM.Nota a margine.Mentre sei alla ricerca di modi per “aggiungere” link ad altri siti, potresti trovarti di fronte a tattiche che parlano di “web 2.0” e “siti di bookmarking”. Questi funzionavano 15 anni fa, ma oggi sono solo una perdita di tempo.2. Richiedere linkCome il nome suggerisce, questo si riferisce a quando contatti il proprietario di un sito dal quale vuoi ottenere un backlink con una buona motivazione per cercare di fornire un link al tuo sito.La “buona motivazione” è essenziale per questo gruppo di tattiche. Alle persone che contatti non importa di te e del tuo sito (a meno che tu non sia una sorta di celebrità), e non hanno quindi nessun incentivo per il quale dovrebbero aiutarti.Quindi, prima di chiedere loro un link, chiedi a te stesso: “Cosa posso mettere sul tavolo per LORO?”.Ecco alcune tattiche e strategie di link building che appartengono a questa categoria, insieme alle relative “buone motivazioni” su cui si basano: Guest blog — creare contenuti utili per il loro sito; Tecnica del Grattacielo — mostra loro una migliore risorsa di quella a cui stanno fornendo un link ora; Inserimento link — mostra loro una risorsa con più informazioni riguardo qualcosa che hanno toccato brevemente; Ego bait- letteralmente “esca dell’ego”, menziona loro o il loro lavoro nel tuo contenuto mettendoli in buona luce; Testimonianza& Casi studio- lascia dei feedback positivi riguardo il loro lavoro o il loro prodotto; Scambi di link — uno scambio di link che deve essere reciproco; Link building pagina risorse- mostra loro una buona risorsa che sia in linea con quelle esistenti nel loro elenco; Broken link building- aiutali a sistemare un link “morto” presente sulla loro attuale pagina; Link building delle immagini- chiedi loro di menzionarti per aver utilizzato una tua immagine; Menzioni senza link- chiedi di rendere la menzione del tuo brand “cliccabile”; Cambio del link — chiedi di modificare un link esistente; HARO(& richieste dai giornalisti) — fornisci un “parere esperto” per il loro articolo; PR- fornisci una storia intrigante su cui possano scrivere un articolo;Tutte queste strategie sono stimolanti, vero? Non appena invii la tua prima email sarai però messo di fronte alla dura realtà—la tua “buona motivazione” non è buona abbastanza:Il tuo guest post non è abbastanza buono;La tua risorsa non è particolarmente unica;Il tuo Grattacielo non è alto abbastanza;Ecc.Per far si che queste tattiche siano efficaci, devi creare contenuti realmente eccezionali che porterebbero le persone a fornire link ad essi anche spontaneamente. O, in alternativa, avere molta autorevolezza e credibilità nel tuo spazio, in modo che possa compensare per la poca notorietà della tua pagina.Un commento nel nostro caso studio sulla link building che suggerisce come sia più semplice chiedere dei link quando sei riconosciuto globalmente a livello di brand.Visto quanto sia arduo persuadere persone che non conosci a fornirti un link, molti tecnici SEO hanno cercato di trovare dei modi per rendere tutto più allettante:Offrendosi di condividere i contenuti su Twitter & Facebook;Offrendosi di promuovere il loro contenuto all’interno di una newsletter;Offrendo accesso gratuito ad un prodotto o servizio premium;Offrendo un link in cambio;Offrendo dei soldi;Ma offrire questa sorta di “benefici extra”, ci porta nella zona grigia di quello che viene definito come “schema di link” secondo le linee guida di Google:Ecco fatto. Il modo legittimo di richiedere link ha un tasso di successo piuttosto basso, e non appena provi ad “addolcire la proposta”, entri nel campo minato di Google.A questo punto, potrebbe sembrare che io ti stia dissuadendo dall’utilizzare le tattiche e le strategie proposte in questo gruppo. In realtà non è così. Sto solo cercando di darti delle corrette aspettative, in modo che tu possa continuare senza demordere anche dopo non aver ricevuto risposta a seguito dell’invio della tua decima email. Servono davvero molti sforzi per utilizzare queste tattiche senza andare contro le linee guida di Google.Ti condivido un utile “stratagemma” che ho imparato da Adam Enfroy mentre conducevo delle ricerche per scrivere questa guida. Prima di provare a contattare Pat Flynn, Adam ha fornito link al suo sito da almeno dieci guest post che ha scritto per alcuni blog molto conosciuti (cosa che ha casualmente menzionato nella sua email di contatto).“Sdebitarsi in anticipo” è un buon modo per descrivere quello che ha fatto in questo caso. Adam non ha contattato Pat chiedendo “Mi intervisteresti nel tuo podcast SPI se ti faccio ottenere dieci link di qualità?”. Si è portato avanti ed ha costruito 10 link di qualità per Pat indipendentemente da quello che sarebbe successo dopo.Per farla breve, Adam è riuscito ad ottenere un’intervista nel podcast chiamato SPI. E sono certo che il suo “sdebitarsi in anticipo” abbia giocato un ruolo in tutto questo.3. Acquistare linkPrima di entrare nel dettaglio di questa sezione, mettiamo le cose in chiaro: noi non ti consigliamo di acquistare link!Nel migliore dei casi, probabilmente sprecherai molti soldi su pessimi link che avranno un impatto pari a zero sul tuo posizionamento; nel caso peggiore il tuo sito verrà penalizzato.In ogni caso, ti metteremo in una posizione di svantaggio se non discutessimo del fatto che molte persone nel campo della SEO “acquistano” link in tutti i modi possibili, senza pagarne le conseguenze.Detto questo, non ti insegneremo come acquistare link mitigando i rischi, piuttosto, ti educheremo sui modi più rischiosi di farlo.Private Blog NetworksConosciute anche come PBN, sono gruppi di siti creati e mantenuti per un solo scopo: essere una fonte di link.I link dalle PBN funzionano ancora in alcune nicchie. Ma nel corso degli anni passati abbiamo visto alcuni dei più convinti sostenitori delle PBN smettere pian piano di utilizzarle. È diventato così rischioso che non ne vale più la pena.Quindi se qualcuno ti offre di acquistare link da una PBN (o costruire una PBN per te), dovresti dire di “no”.FiverrEsistono centinaia di offerte su Fiverr che offrono link “naturali, contestuali, di alta-autorevolezza e white hat”. Offrono ogni tipologia di garanzia possibile che questi link siano leciti e faranno schizzare il tuo sito in cima a Google in un batter d’occhio.Evitali. Anche se un tuo amico li ha provati e hanno funzionato. Le migliori agenzie di link building non offrono i loro servizi su Fiverr.Venditori di link SPAMSe hai un sito e hai al suo interno i tuoi dati di contatto, prima o poi riceverai delle email che ti propongono l’acquisto di link. Come questa:Se hai a caro il tuo sito almeno un po’, non acquistare link da queste persone. Segnala le email come SPAM e tanti saluti.Nota a margine. Potresti anche ottenere delle email da agenzie di link building legittime che ottengono link solo con strategie white hat. Sono certo che riuscirai a distinguere un’agenzia lecita da un venditore spam.Alla fine, l’acquisto di link è piuttosto diffuso fra chi si occupa di SEO, nonostante molto dipenda dal settore in cui ti trovi. Anche se i tuoi concorrenti pagano per i loro link, non devi necessariamente farlo anche tu. Non devi per forza violare le linee guida di Google per posizionarti bene e ottenere traffico. 4. Guadagnare Link”Guadagni” un link quando altre persone creano un link alla tua pagina senza che tu abbia chiesto loro di farlo. Questo chiaramente non succede a meno che tu non abbia qualcosa di formidabile che i proprietari di altri siti vogliono menzionare sulle loro pagine.Le persone non possono però fornire link a qualcosa se non sanno che questa cosa esiste. Non importa quanto fantastica sia la tua pagina, devi investire in qualcosa per promuoverla. Più persone vedono la tua pagina, più aumentano le probabilità che qualcuno crei un link.Ecco alcune tattiche e strategie che fanno parte di questa categoria:Linkbait (o risorse per link);Studi di dati, infografiche, mappe, questionari, riconoscimenti; Podcast / interviste / contenuti da esperti; Promozione dei contenuti;ecc.Guadagnare dei link è indubbiamente il modo più semplice ed efficace di ottenerli.Preferirei investire il mio tempo e i miei soldi nel creare pagine di valore che generino passaparola e ottengano link in maniera naturale, piuttosto che lavorare ad una scoraggiante sequenza di selezione ed invio di email sperando di ottenere link per qualche pagina mediocre.Considera questo blog come un esempio. Tre dei cinque articoli che hanno più link (esclusa l’homepage) sono degli studi compiuti su alcuni dati (dei linkbait):Gli articoli che hanno più link del blog di Ahrefs con i dati delSite Explorer.Potresti controbattere dicendo che per Ahrefs è facile ottenere link in maniera spontanea con un linkbait, visto che abbiamo:Molti dati proprietari, che possiamo utilizzare per fare i nostri studi di settore;Un team di professionisti molto bravi, che può aiutare nel creare risorse di valore;Un brand di cui le persone si fidano e che conferisce credibilità a tutti i nostri lavori;Un pubblico piuttosto vasto al quale promuovere i nostri contenuti (facendo partire il passaparola).Anche se queste cose ci aiutano tremendamente, nessuna è un requisito per guadagnare link. Chiunque può creare contenuti degni di attenzione e ottenere link se si ha una passione per l’argomento trattato e un pò di determinazione.Nel 2015, ho passato ore a intervistare 500 blogger riguardo il “ROI del guest blog”. Ho poi pubblicato questa “ricerca” sul mio blog personale, generando link da oltre un centinaio di siti. Circa il doppio del mio articolo che aveva più link in quel periodo.Il numero totale di link potrebbe non sembrarti così elevato, ma si trattò di un gran successo per me all’epoca—un singolo blogger senza un brand, un vasto pubblico o molti soldi alle spalle.Ma cosa succede se non riesci a farti venire in mente idee per creare delle risorse che siano in grado di stimolare l’interesse delle persone nel tuo settore e quindi farti guadagnare dei link spontanei? O se ad esempio hai copiato l’idea di un’altra persona che però non sta funzionando come speravi?In quel caso, vale la pena impegnare del tempo per acquisire una migliore conoscenza del settore in modo da avere un’idea più chiara di quello che potrebbe piacere. Non sprecare il tuo tempo a cercare strategie di link building magiche per riuscire a guadagnare link verso contenuti che sono noiosi—in quanto non funzionerà.5. Conservare i LinkCome il nome suggerisce, quest’ultimo gruppo di tattiche si concentra sul mantenere i link che hai duramente conquistato. Qualcuno potrebbe dire che ripristinare un link perso non possa contare come “link building”. Ma alla fine delle giornata “un dollaro risparmiato è un dollaro guadagnato”.Esistono solo due modi per conservare i link: Recuperare i link; Sistemare le pagine 404 che hanno link.Vediamoli brevemente entrambe.Recuperare i linkI link non durano per sempre. La pagina che ti sta fornendo il link potrebbe venir aggiornata, de-indicizzata o eliminata. In risultato è che il tuo link da quella pagina potrebbe smettere di esistere.Un link perso verso uno dei nostri articoli del blog. Dati presi dal Site Explorer.Questo è il motivo per il quale è una buona idea avere sott’occhio il proprio profilo backlink e ricevere delle notifiche quando uno di questi scompare. In questo modo puoi contattare il proprietario del sito e provare a ripristinare il link verso il tuo sito.Sistemare le pagine 404 che hanno linkAnche le pagine sul tuo sito possono scomparire. Che si tratti di un errore o di un qualcosa fatto intenzionalmente, alcune pagine potrebbero venir cancellate. E dato che i link che puntano ad una pagina 404 non sono di alcun beneficio per la SEO, è consigliabile risolvere il problema.Per trovare le pagine 404 che ricevono link, apri il report “Migliore per link” all’interno del Site Explorer e filtra poi per “404 not found”:Sembra che noi stessi abbiamo qualche articolo non più esistente all’interno del blog di Ahrefs che riceve backlink.Tutto quello che devi fare in questo caso è ripristinare la pagina o creare un redirect 301 verso una pagina rilevante e attinente del tuo sito.nota importanteEsiste dell’evidenza che suggerisce come Google continui a passare una parte del valore del link ad una pagina anche dopo che questo link viene rimosso. Questo fenomeno è conosciuto come “link eco” o “link fantasma” e porta le persone a non preoccuparsi troppo di monitorare i link persi.Ecco il nostro parere sulla questione. Se perdi un link importante che stava portando visitatori al tuo sito, o aveva lo scopo di rinforzare la “social proof”, dovresti assolutamente tentare di ripristinarlo. Nella maggior parte dei casi però, faresti meglio a impiegare le tue energie verso l’acquisizione di nuovi link piuttosto che rincorrere i vecchi.Come Ottenere Backlink: 7 tatticheCome Far Partire una Campagna di Link Building VelocementeGuida all’Outreach per Blogger9 Lezioni sull’OutreachQual è il Costo dell’Acquistare dei Link?Part 3Cosa rende un link buono?Hai appena imparato i diversi modi di costruire link verso il tuo sito. Quello che devi ricordare è che i backlink sono solo un mezzo per raggiungere un fine. Il motivo per il quale li stai costruendo, è perchè funzionano un po’ come dei “voti” che aiutano Google ad identificare le pagine più degne di essere posizionate in cima ai risultati di ricerca. Non tutti i “voti” però sono uguali fra di loro.Nessuno sa esattamente il modo in cui Google misura il valore di ogni singolo link. Ma ci sono alcuni concetti generali per valutare i link che la comunità SEO reputa validi.AutorevolezzaRilevanzaAnchor textNofollow vs followPosizioneDestinazione1. AutorevolezzaImmagina che un tuo amico abbia appena lanciato un blog e ti abbia fornito un link da questo in uno dei suoi recenti articoli. Non è nulla di che, giusto?Ma cosa succede se il New York Times pubblica un articolo con un link al tuo sito? Questo è qualcosa di cui potresti indubbiamente andar fiero.Il punto è che percepiamo questi due siti come due diversi livelli di “autorevolezza”. Il New York Times è una pubblicazione famosa in tutto il mondo, di cui si fidano milioni di persone. Il nuovo blog del tuo amico invece, è tanto se già riceve qualche visita.Quindi, in che modo Google misura l’ ”autorevolezza” di un sito (o una pagina) che ti sta fornendo un link? Se i link contano come voti, è giusto dire che una pagina che ne riceve molti può esprimere un voto piuttosto forte con un link ad un’altra, giusto?Questo è uno dei principi fondamentali dell’algoritmo relativo al PageRank, che i creatori di Google, Larry Page e Sergey Brin, hanno ideato nel 1996.Esisteva addirittura un plugin per browser che mostrava il punteggio PageRank di qualsiasi pagina web con una scala da 0 a 10. Intorno al 2014, Google ha però deciso di interrompere tale plugin, lasciando la comunità SEO in una mare di dubbi riguardo a quanto “autorevole” sia ogni pagina web.Per fortuna, molti strumenti SEO hanno sviluppato delle metriche di autorevolezza proprietarie basate sui link, che si ispirano proprio su alcuni degli stessi principi su cui si fonda l’originale algoritmo del PageRank.Le metriche di autorevolezza che abbiamo qui su Ahrefs sono il Domain Rating (DR) e la URL Rating (UR). Entrambe misurate su di una scala che va da 0 a 100.Le metriche UR e DR della homepage di Ahrefs, dati presi da Site Explorer.Lo URL Rating della nostra Homepage è 87, il che significa che si tratta di una pagina di alta autorevolezza. Mentre il Domain Rating di ahrefs.com è 90, che è considerato molto alto (nytimes.com è DR 94).Nota a margine.Alcuni professionisti SEO analizzano anche il volume di traffico di un sito per stimare la sua “autorevolezza”. La logica è semplice: se Google posiziona un sito in cima ai risultati di ricerca facendogli ottenere traffico, considera quello stesso sito come piuttosto autorevole.Come regola generale, i professionisti SEO si impegnano nell’ottenere link da siti e pagine che hanno un’alta autorevolezza, perché questi sono i link che hanno più probabilità di aiutare le loro pagine a posizionarsi più in alto su Google.Ma questo significa che dovresti evitare di ottenere link da siti e pagine con una bassa autorevolezza? No. Questi link non sono “cattivi” in nessun modo. Hanno solo meno “peso” agli occhi di Google, e quindi hanno una minore capacità di influenzare il posizionamento.Il modo corretto per utilizzare queste metriche relative all’autorevolezza quando fai link building, è quello di stimare quanto tempo e sforzo devi investire per ottenere un link da uno specifico sito.Se un tuo amico ti chiede di scrivere un articolo molto approfondito di 10.000 parole per il suo nuovo blog (DR10), il link che ottieni non vale lo sforzo. Ma se hai l’opportunità di fare la stessa cosa per il NY Times (DR94), allora dovresti assolutamente farlo.Un’ultima cosa. Alcune persone sono eccessivamente ossessionate dalle loro metriche relative all’autorevolezza. Fino ad arrivare al punto di chiedere al nostro team di supporto domande del genere:Devo aumentare la UR, cosa devo fare o cambiare?Se stai facendo link building per “aumentare la UR” stai puntando all’obiettivo sbagliato. Dovresti fare link building con lo scopo di posizionarti più in alto su Google. Ancora meglio, dovresti ottenere link per aiutare i visitatori di un sito a scoprire il tuo.2. RilevanzaPoniamo caso che tu abbia un blog sul caffè sul quale hai pubblicato una recensione del tuo macina caffè preferito. In un secondo momento, due tuoi amici decidono di creare un link a questo articolo. Uno dal suo “Le 10 migliori ricette con il caffè”, l’altro da “10 Consigli per Risparmiare Soldi”.Quale delle due pagine conta come miglior voto agli occhi di Google (dando per scontato che le pagine abbiano la stessa autorevolezza)?Quella più rilevante e pertinente!D’altronde preferiresti avere dei consigli riguardo il caffè da un appassionato di cibo e bevande piuttosto che un esperto di finanza, giusto?I professionisti della SEO credono che il concetto di rilevanza si applichi anche a livello di sito. Ed è presente dell’evidenza per questo concetto all’interno della pagina “how search works” di Google:Se altri siti prominenti sulla tematica forniscono link ad una pagina, questo è un buon segnale che quelle informazioni sono di alta qualità.Il che significa che dovresti sforzarti di ottenere link da siti che sono in qualche modo pertinenti al tuo, invece di cogliere ogni singola opportunità che ti capita a tiro.3. Anchor textNel caso in cui non fossi familiare con questo termine, con “anchor text” si intendo la porzione di testo dove puoi fare click che ti rimanda su un’altra pagina.Nella maggior parte dei casi, l’anchor text descrive il contenuto della pagina a cui si riferisce il link. Dai uno sguardo al link che ho inserito qualche paragrafo precedente:Non dovrebbe quindi essere una sorpresa il fatto che Google utilizzi queste parole nell’anchor text per capire meglio le parole chiave per cui la pagina del link dovrebbe posizionarsi. Google, all’interno del suo brevetto originale, ne parla piuttosto esplicitamente: […] Google impiega un numero di tecniche per migliorare la qualità dei risultati di ricerca, incluso pagerank, anchor text, e prossimità delle informazioni.Quindi come si fa a sfruttare l’anchor text quando si fa link building?Beh…non puoi. Più cerchi di controllare il modo in cui le varie pagine ti forniscono link cercando di utilizzare le “parole giuste” all’interno degli anchor text dei tuoi link, più sono le probabilità che Google ti penalizzi per questo motivo.Inoltre la maggior parte delle tecniche white hat di link building generalmente non ti permette il controllo sull’anchor text, il che in realtà aiuta a non darti la zappa sui piedi.4. Nofollow vs follow”Nofollow” è un attributo che dice a Google che la pagina che sta fornendo il link non vuole esprimere un voto verso la pagina di destinazione.Ecco come si utilizza l’attributo nel codice HTML:Storicamente, Google non contava come voti i ‘link nofollow’ (o così hanno detto). Poi, nel 2019, hanno cambiato a favore di un modello diverso, dove alcuni link ‘nofollow’ potrebbero comunque influenzare i tuoi posizionamenti.Hanno anche introdotto due nuovi attributi con lo stesso annuncio: rel=“UGC” — dovrebbe essere applicato ai contenuti generati dagli user, come commenti del blog, e post dei forum. rel=“sponsored” — dovrebbe essere applicato lì dove il link è parte di un annuncio, uno sponsor o un’altra forma di compensazione. Come regola generale, vuoi ottenere dei link di tipo “follow”, (ovvero che non contengono alcuno degli attributi menzionati sopra), dato che sono quelli che dovrebbero contare come voti.In ogni caso, se ti trovi di fronte all’opportunità di ottenere un link nofollow rilevante da una pagina autorevole, dovresti comunque farlo.Un buon esempio è costituito da Wikipedia, dove tutti i link in uscita sono nofollow. Ottenere un link da Wikipedia è estremamente arduo, motivo per il quale molti SEO sono convinti che tali link siano piuttosto di valore agli occhi di Google.5. PosizioneIl brevetto di Google chiamato ‘reasonable surfer’, parla di come la probabilità di un link di ottenere un click influisce su quanta autorevolezza questo passi. E la posizione di un link sulla pagina è una delle cose che può influire sul CTR.Poniamo caso che esista una pagina costituita da tre blocchi: contenuto, barra laterale e footer. Come regola generale, i link all’interno del contenuto ottengono più click, in quando solitamente questo blocco riceve la maggior parte dell’attenzione dei visitatori.Un’altra cosa che può influenzare il CTR è quanto in alto su una data pagina un link appare. Esistono più probabilità che i lettori facciano click su di un link posto ad inizio pagina piuttosto che alla fine.Infine, più link hai su di una pagina, più questi andranno in competizione fra di loro, diluendo quindi l’autorevolezza che verrà trasferita fra le varie pagine.Come con l’anchor text, la maggior parte delle strategie di link building white hat non ti da generalmente controllo su questo aspetto. Se stai però scrivendo un guest post per il blog di qualcun’altro, dovresti sicuramente provare a invogliare gli utenti a fare click sul tuo link. Non solo per il valore SEO dei link in sé, ma anche perché in questo modo riceverai del traffico referral.6. DestinazioneQuando fai link building per il tuo sito, ci sono tre diverse destinazioni verso le quali puoi puntare:La tua homepage;Le risorse ‘linkabili’ di maggior valore;Le pagine che vuoi posizionare in alto su Google.E spesso le pagine che vuoi posizionare più in alto sono anche quelle verso le quali è più difficile ottenere dei link. Questo in quanto le persone preferiscono solitamente creare link a pagine informazionali dalle quali il loro pubblico può ottenere valore gratuitamente, piuttosto che pagine commerciali dove saranno invitati a spendere dei soldi.Quindi, una delle domande più richieste nella SEO è:“Come posizionare le pagine più noiose?”Non esiste una risposta univoca a questa domanda, ma tutti sono d’accordo sul fatto che dovresti sfruttare la potenza dei link interni per spingere più in alto le “pagine noiose”.In altre parole, costruisci più link che puoi verso le tue risorse di valore e poi indirizza tutta la “link juice” verso le pagine che vuoi posizionare meglio facendo uso dei link interni.E tieni a mente che cose come posizione, rilevanza e anchor text influiscono anche sul valore dei tuoi link interni.Guida al PageRank di GoogleGuida all’Anchor TextLink Nofollow vs. FollowCome Migliorare l’Autorevolezza del Tuo SitoPart 4Migliori tattiche di link buildingNel capitolo due hai imparato molte cose riguardo le varie strategie di link building. Ora diamo uno sguardo ad alcune tattiche reali.Seguire i link dei concorrentiCreare risorse per linkPromozione dei contenutiGuest blog1. Seguire i link dei concorrentiLa ricerca dei link dei concorrenti è una della attività fondamentali della link building. Pensaci un attimo, la pagina meglio posizionata per la query di ricerca ha tutti i link che hanno convinto Google della sua bontà. Studiando i suoi link puoi capire quali tattiche utilizzare per ottenerne di simili e scavalcare quella pagina.Questo è il motivo per il quale uno strumento SEO come Ahrefs è indispensabile.Inserisci la parola chiave per la quale vuoi posizionarti nel Keywords Explorer, e scorri sotto fino a “SERP Overview”. Ti mostrerà quanti backlink (e da quali siti) ottiene ognuna delle pagine meglio posizionate.Numero di backlink e siti referring per le pagine meglio posizionate su “migliori app di produttività” (o “best productivity apps” in inglese).Clicca su uno di questi numeri e vedrai un report che elenca tutti i link:Da qui, hai due opzioni:Provare ad ottenere un link dalle stesse pagine che forniscono link ai tuoi concorrenti;Studiare come questi link sono stati acquisiti e utilizzare quello che impari per trovare pagine simili da cui ottenere link.Mi spiego meglio con un veloce esempio.Una delle parole chiave per la quale vogliamo posizionarci è “SEO”. Attualmente il #1 risultato è la guida per principianti di MOZ, che ottiene quasi 300k backlink da 11k siti diversi:Dopo aver ordinato i loro backlink in base al traffico della pagina da cui parte il link, ho trovato questo articolo, chiamato “Come Imparare le Competenze del Digital Marketing (guida per principianti)”:In base al contesto del link mostrato nella colonna “Anchor and backlink”, ho potuto contattare l’autore dell’articolo per chiedere di menzionare la guida per principianti alla SEO di Ahrefs, in modo che chi atterrasse sulla sua pagina avesse più risorse a disposizione.Un’altra cosa che posso fare è quindi trovare altri articoli riguardo la tematica dell’ ”imparare il digital marketing”, perchè ora so che queste pagine offrono uno spazio rilevante dal quale referenziare la nostra guida alla SEO per principianti.Ho quindi aperto il Content Explorer e cercato le pagine con “imparare digital marketing” (o “learn digital marketing” in inglese) all’interno del loro titolo.Ho poi aperto queste pagine una a una e cercato uno spazio dove avrebbe avuto senso suggerire all’autore di inserire una referenza verso la nostra guida alla SEO come utile risorsa per il suo pubblico.Questo, in essenza, è il motivo per cui devi studiare i backlink dei tuoi concorrenti e come applicare quanto imparato alle tue pagine.Un’altra tattica popolare quando fai reverse-engineering dei link dei tuoi concorrenti, consiste nello studiare le loro risorse ‘linkabili’. Per farlo, inserisci il loro dominio all’interno del Site Explorer di Ahrefs, e vai sul report chiamato “Migliore per link”. Questo ti mostra quali delle loro pagine hanno accumulato il maggior numero di link.Le pagine con più link del blog di Ahrefs con i dati presi dal Site Explorer.Come puoi vedere dallo screenshot qui sopra, tre delle cinque pagine con più link (escludendo la homepage) sono degli studi basati sui dati. Questo ti fornisce una buona idea della tipologia di contenuti che attira link all’interno del nostro settore.Nella tua nicchia il tipo dominante di risorse che attirano link potrebbe essere completamente diverso—infografiche, strumenti online, questionari, ego bait, ecc… Il tuo lavoro consiste nel capire quali sono queste tipologie e utilizzare le tue conoscenze per creare delle risorse che attirano link per il tuo sito.Un ultimo consiglio che voglio condividere, è quello di utilizzare questa sezione per studiare i link che il tuo concorrente ottiene verso la sua homepage. Molto spesso infatti, quando una pagina ha un link alla home dei tuoi concorrenti, ci sono ottime probabilità che puoi persuaderli a fornire un link anche a te.Ecco un esempio di opportunità di link che ho scoperto in sessanta secondi analizzando la home di uno dei nostri concorrenti:Moz ha ottenuto un link da un blog posto dove vengono menzionati i siti su cui imparare la SEO. Contattare l’autore dell’articolo chiedendo di aggiungere Ahrefs alla lista è piuttosto naturale, dato l’ammontare di risorse educative gratuite sulla SEO che abbiamo pubblicato fin’ora.Non fraintendermi. Non sto dicendo che questi esempi siano un modo certo di ottenere un link. Sono solo delle opportunità ragionevoli da percorrere.2. Creare risorse per linkÈ possibile fare link building verso ogni pagina con forza di volontà e determinazione, ma è più semplice avere qualcosa a cui le persone vogliano effettivamente fornire un link.Quando parliamo di risorse per link, le persone tendono a pensare a qualcosa di molto specifico, come:Strumenti online e calcolatori;Infografiche, GIFografiche e “Mappe grafiche”;Riconoscimenti e Classifiche;Studi e Ricerche;Guide e Manuali “Come Fare”;Definizioni e Termini proprietari;Io però oserei dire che il concetto di “risorsa per link” dovrebbe essere più flessibile riguardo a cosa può essere classificato come tale. Quello che intendo, è che anche una singola idea presente in uno dei tuoi articoli può motivare le persone a fornirle un link, come la stessa esistenza della tua azienda o i suoi prodotti.Come esempio del primo caso, ecco due link che abbiamo ottenuto verso la nostra guida alle parole chiave a coda lunga:Ogni link fa riferimento a diverse porzioni dello stesso articolo, rendendo a tutti gli effetti entrambe le parti delle “risorse per link”.L’idea che le parole chiave a coda lunga non siano definite dalla loro lunghezza quanto piuttosto dalla loro popolarità;Una statistica ottenuta da uno studio condotto da noi stessi.Ed ecco altri due esempi di qualcuno che fa riferimento ad Ahrefs come azienda, e qualcun’altro che fornisce un link ad uno dei nostri prodotti:Nessuno di questi link sono stati da noi sollecitati in alcun modo. Queste persone hanno preso la decisione editoriale di fornirci i link, decisione motivata dal valore che queste referenze hanno per i loro lettori:Imparare di più riguardo un concetto (piuttosto complicato);Studiare la fonte di un’interessante statistica;Vedere un esempio di un’azienda basata sul prodotto;Approfondire un prodotto interessante.Non avere quindi fretta di sviluppare calcolatori, disegnare infografiche o creare questionari solo per attrarre link verso il tuo sito. Prenditi un momento per fare un passo indietro e revisionare quello che hai già, valutando se riesci a “re-impacchettarlo” in un modo che lo renda più semplice da notare. Cosa rende la tua azienda unica? Lo dici sulla tua homepage? I tuoi prodotti sono unici in qualche modo? Hai delle pagine dedicate per ogni singolo prodotto che ne mostrano l’unicità e l’utilità? Hai idee all’avanguardia nel tuo settore? Queste idee sono convogliate correttamente nei tuoi contenuti? Qual è la qualità dei tuoi contenuti?Ci sono alte probabilità che hai parecchie opportunità per migliorare le tue pagine esistenti e renderle più attraenti per i link prima di investire tempo e sforzi nel creare delle ‘esche per link’.Ma che succede se devi creare una risorsa per link nuova di zecca per il tuo sito? Come ti assicuri che quello che vuoi creare abbia successo?Come ho già detto nella sezione precedente, dovresti cominciare dallo studiare le risorse per link dei tuoi concorrenti e capire cosa le ha rese un successo. Dovresti anche analizzare i formati più funzionali per le risorse per link e vedere se qualcuna può fare al caso tuo.La ricerca è però la parte più semplice. Una volta che hai una buona idea, la sua esecuzione è quello che conta. Questo però sarebbe troppo da trattare in questa guida “per principianti”.3. Promozione dei contenutiNon importa quanto “linkabili” siano le tue pagine, nessuno può fornirle dei link se non ne vengono prima a conoscenza. In altre parole, anche le migliori risorse per link devono essere promosse per attrarre dei link.In generale, ci sono tre modi per promuovere i contenuti:Pubblicità;Email di contatto;Comunità.PubblicitàSembra piuttosto immediato, giusto? Puoi pagare Google, Facebook e Twitter per portare visitatori verso la tua pagina. Puoi anche contattare ogni sito frequentato dal tuo pubblico e trovare un accordo per fare pubblicità lì.Più sono le persone alle quali fai vedere i tuoi contenuti, maggiori sono le probabilità di trovare qualcuno che fornisca dei link.C’è solo un problema. È praticamente impossibile attribuire i link acquisiti ai soldi spesi in pubblicità e sponsorizzazioni (anche se ci abbiamo provato).Non puoi ad esempio promettere al tuo capo dieci link link di qualità verso una pagina se riesci a convincerli ad investire €1000 in Facebook Ads.Ma la pagina alla quale stai cercando di portare link ha anche una funzione a livello aziendale giusto?Ecco i tre motivi principali per i quali le aziende investono in contenuti:Ottenere contatti e far crescere il pubblico;Ottenere clienti e vendite;Migliorare la riconoscibilità del brand e la fedeltà dei clienti attuali.Se il tuo contenuto aiuta con uno qualsiasi dei tre punti qui sopra, non dovresti aver problemi nel giustificare una richiesta di budget per fare delle Ads.E se una pagine non ti aiuta con nessuno di questi punti, dovresti chiedere a te stesso come ne hai innanzitutto giustificato la creazione.In altre parole, i link dovrebbero essere un sottoprodotto del fare pubblicità verso i tuoi contenuti, e non l’obiettivo principale.Email di contattoL’invio di email di contatto (conosciuta anche come ‘outreach’) è probabilmente il miglior modo di mettere i tuoi contenuti di fronte a persone che hanno un sito e possono fornirti dei link.È vero, queste stesse persone possono essere raggiunte con le pubblicità, ma un’email personalizzata è sempre più efficace se vuoi migliorare le probabilità di ottenere un link da loro.Esistono parecchi articoli che possono insegnarti a scrivere efficaci email di contatto. Anche io ho condiviso il mio pensiero in merito qui sul blog di Ahrefs. Se solo potessi darti un singolo consiglio, sarebbe questo:Piuttosto che chiedere palesemente a qualcuno un link, cerca di impressionarli con i tuoi contenuti e stimolare la loro curiosità al fine di farglieli scoprire.Quello che vuoi fare è piantare una singola idea presa dal tuo contenuto all’interno della loro testa, in modo che vogliano menzionarla in uno dei loro futuri articoli—più o meno quello che ho fatto qui quando ho provato a promuovere la mia piccola ricerca:L’apertura di una email di contatto.ComunitàLe comunità (o community) sono un fantastico modo di promuovere i contenuti ad un pubblico rilevante. Indipendentemente dal settore nel quale ti trovi, probabilmente esiste un sub-reddit pieno di persone interessate, o qualche gruppo su Facebook, Slack o Discord. Potresti anche trovare dei siti di comunità indipendenti in alcune nicchie.Promuovere i tuoi contenuti in queste comunità non è però semplice come sembra. Non puoi semplicemente entrare a farne parte, buttare lì tuo link e scomparire. Verresti bannato in un batter d’occhio.Devi diventare un membro attivo della comunità e ottenere del rispetto dai suoi membri prima di avere il privilegio di promuovere i tuoi contenuti al suo interno. E anche in quel momento, non dovresti approfittarne e pubblicare ogni singolo nuovo pezzo che scrivi, rischiando di rovinare la tua reputazione e scocciare qualcuno. Dovresti farlo solamente per i tuoi contenuti migliori.Una strategia consiste nel costruire la tua comunità, la quale sarà più che felice di ricevere ogni singolo contenuto che pubblichi. Qui ad Ahrefs, offriamo alle persone 3 modi per connettersi con noi: Seguirci su Twitter;Iscriversi alla newsletter del nostro blog;Entrare nel nostro gruppo privato su Facebook.Questi sono i tre “canali” che forniscono ai nuovi nostri articoli un po’ di popolarità iniziale. Ma abbiamo impiegato anni a farli crescere.4. Guest blogOgni blogger vuole pubblicare contenuti di alta qualità che portino valore al proprio pubblico, giusto? Farlo con consistenza è una bella sfida. Parte del motivo per cui molti proprietari di blog accettano guest post sui loro siti.Il guest blog è diventato così utilizzato nel mondo della SEO, che è stato sfruttato a tal punto che Matt Cutts, a capo del team webspam di Google, ne ha dichiarato la fine nel lontano 2014.“Per farla breve: il guest blog è finito.”Matt Cutts, Former Head of Web Spam, GoogleEppure, eccoci nel 2021 e con chiunque io abbia parlato che si occupa di link building considera il guest blog uno dei metodi più efficaci per ottenere link.Tutto quello che devi fare per stare nelle grazie di Google è selezionare dei blog leciti e offrire loro dei contenuti di qualità che saresti contento anche di pubblicare sul tuo sito. Pagare qualcuno €10 per scrivere un articolo di 500 parole e inviarlo ad un blog di terza scelta con zero traffico o follower non funziona più.Ma c’è un problema: i blog leciti non hanno bisogno dei tuoi articoli. Se la cavano piuttosto bene da soli, e questo è esattamente ciò che li rendere “leciti”.Come fare quindi per persuaderli a pubblicare il tuo contenuto?A parte dall’avere qualcosa di sensato da dire, unito a delle buone competenze di copywriting e un po’ di esperienza, ho un paio di consigli da darti che possono aiutarti.1. Fatti stradaI migliori blog del tuo settore probabilmente non ti prenderanno seriamente a meno che tu non abbia alle spalle un buon curriculum di articoli pubblicati su blog simili.Quindi prima di contattare il blog #1 nella tua nicchia, cerca di essere pubblicato sul #2. E prima del #2, assicurati di farti pubblicare sul #3.Capisci cosa sto dicendo? Devi iniziare dai blog meno conosciuti del settore e lentamente farti strada tra i migliori.Se fai fatica ad identificare i blog meno conosciuti, abbiamo uno strumento molto potente per te: il Content Explorer.Fai così:Cerca una parola o una frase che i blog del tuo settore menzionano probabilmente all’interno dei titoli di qualche loro articolo;Imposta il filtro del “Domain Rating” fra 30–40;Utilizza l’opzione “One page per domain” per vedere solo un risultato da ogni sito.Come puoi vedere dallo screenshot qui sopra, cercare la parola “bistecca” (o “steak” in inglese) fornisce 9.227 pagine da siti con un punteggio DR compreso fra 30 e 40.Ora tutto quello che devi fare è esaminare i blog che hai trovato e stimare le tue possibilità di avere un contenuto pubblicato lì. Se i blog sembrano troppo deboli o forti rispetto a te, aggiusta il filtro del DR finchè non trovi il giusto equilibrio.Per restringere ancor più i risultati potresti utilizzare il filtro “Website traffic” che può restituirti solo i siti che ottengono un certo valore di traffico da Google (come stimato da Ahrefs).2. Fai un’offerta che non possono rifiutareCome ho precedentemente menzionato, ogni blogger vuole pubblicare contenuti di alta qualità che siano utili al suo pubblico. Quindi, migliori sono i tuoi contenuti, migliori sono anche le tue opportunità di vederli pubblicati.Eppure, la maggior parte dei blogger ottiene dozzine di guest post simili proposti ogni settimana, etichettati come “di alta qualità, unici e di valore” (quando in realtà non lo sono). Quindi come fai a distinguerti da tutto il resto e attirare efficacemente l’attenzione dei blogger con il tuo guest post?Uno dei metodi più efficaci consiste nell’identificare un “vuoto dei contenuti”—un argomento popolare che porta molto traffico ai loro concorrenti, ma che loro non coprono all’interno del loro blog.Ad Ahrefs abbiamo uno strumento molto utile che ti aiuta ad identificare dei vuoti nei contenuti fra i vari siti e che ha un nome facilmente comprensibile: Gap dei contenuti.Poniamo caso che tu voglia contattare Brian Dean e proporgli un guest post. Potresti utilizzare questo tool per trovare argomenti che portano molto traffico al blog di Ahrefs ma di cui Brian non ha ancora parlato.Inserisci il sito di Brian nel Site Explorer;Apri il lo strumento Gap dei contenuti;Inserisci Ahrefs come concorrente; Premi “Mostra le parole chiave”;Analizza il report alla ricerca di parole chiave che ti sembrano interessanti;Premi la freccetta sulla pagina per analizzare il traffico.Ed ecco fatto. In pochi secondi hai trovato un fantastico argomento che porta 11k visitatori sul blog di Ahrefs ogni mese, ma che non è ancora stato trattato sul blog di Backlinko.Proporre questo specifico argomento a Brian spiegando come scriveresti un articolo eccezionale per lui migliorerà drasticamente le probabilità di venir pubblicato, se lo paragoni ad un generico “posso scrivere un articolo di alta qualità per te” proponendo un guest post.Un’altro interessante modo per risaltare quando proponi un guest post, è quello di offrirti do aggiornare uno dei loro contenuti vecchi o poco performanti.What if....instead of reaching out with an offer to write a guest post for someone…..you would find their old and outdated post that dipped in search traffic and offer them to rewrite it?🤔— Tim Soulo (@timsoulo) August 13, 2019 E se.. ..invece di contattare qualcuno offrendoti di scrivere un guest post…..trovassi uno dei loro vecchi articoli precipitato in termini di posiionamento e ti offrissi di riscriverlo?Come Trovare Backlink che Puoi ReplicareCome Trovare i Link Verso il Tuo Sito7 Modi per Fregare i Link ai Tuoi Concorrenti6 Tipologie di Risorse Link per Link9 Semplici Strategie di Link BuildingPart 5Strumenti per la link buildingAnche se è tecnicamente possibile fare link building solo con il proprio cervello e un account email, esistono diversi strumenti per la link building che possono rendere il processo di acquisizione dei link più semplice.Diamo uno sguardo ai quattro tipi di strumento che potrebbero aiutarti ad ottenere link:Strumenti per la ricerca dei backlink Strumenti per la ricerca dei contenuti; Strumenti di Web Monitoring; Strumenti per l’Email di Contatto.1. Strumenti per la ricerca dei backlinkCome già sai, studiare i link dei tuoi concorrenti è estremamente utile quando sviluppi una strategia di link building pratica per il tuo sito.Il Site Explorer di Ahrefs è reputato come il preferito del settore quando si tratta di strumenti per la ricerca dei backlink.Inserisci un qualsiasi sito o URL e otterrai una lista comprensiva di tutti i backlink che puntano ad esso, con molte utili metriche e filtri per aiutarti a trovare le migliori opportunità di link building.Altre aziende di strumenti SEO che hanno il loro indice link sono Moz, Majestic e Semrush.2. Strumenti per la ricerca dei contenutiGli strumenti per la ricerca dei contenuti eliminano i dubbi quando si tratta di creare contenuti degni di ottenere link e condivisioni. Puoi utilizzarli per trovare angoli di contenuto che hanno generato tantissimi link o condivisioni, e sfruttare i dati trovati per creare il tuo contenuto.Il Content Explorer di Ahrefs ha un gigantesco indice di oltre cinque miliardi di pagine e ti aiuta ad identificare facilmente contenuti degni di essere notati in qualunque settore.Cerca un argomento del quale vuoi scrivere nei titoli delle pagine, ordinando poi i risultati per numero di domini che forniscono link (o domini referring). Studiare queste pagine e i loro link dovrebbe fornirti parecchie idee su come rendere i tuoi contenuti migliori.Un altro strumento con funzioni simili è BuzzSumo. Tuttavia dà la priorità alle condivisioni social rispetto alle metriche SEO.3. Strumenti di Web MonitoringGli strumenti di web monitoring ti avvisano di nuove pagine pubblicate che menzionano la tua parola chiave, o di nuovi backlink che i tuoi concorrenti hanno acquisito. Entrambi questi avvisi possono servire da fonte di opportunità di link building.Ahrefs Alerts compie un ottimo lavoro su entrambi i fronti: backlink e menzioni di parole chiave.Altri strumenti di web monitoring che dovresti provare potrebbero essere Google Alerts, Mention e Brand24.4. Strumenti per l’Email di ContattoGli strumenti per l’email di contatto ti aiutano a gestire e tracciare le campagne di link building. Semplificano anche il processo di trovare dei potenziali contatti, creare schemi di email, inviare dei seguiti e molto più.Esistono molte opzioni fra cui scegliere, ma il giusto strumento dipende dalle tue tattiche, dai tuoi processi, dalla grandezza delle campagne e dal tuo budget.Abbiamo chiesto alla nostra community Facebook quali fossero i loro strumenti preferiti, ed ecco cosa ci hanno risposto:Alcuni strumenti interessanti che non sono stati menzionati dalla community sono Neverbounce e Clearout.io.ConcludiamoQuesta guida è di quasi 8.000 parole, e abbiamo solo grattato la superficie del vasto settore della link building. Ad ogni modo, speriamo abbia chiarito dei dubbi e abbia risposto alle principali domande che avevi sulla link building. Dovrebbe darti delle solide basi su cui imparare ancora di più riguardo questa tematica. Voglio terminare ringraziando (e dando un link) ad alcuni dei link builder più forti che conosca, i quali hanno gentilmente accettato di condividere la loro esperienza con me mentre effettuavo le ricerche per questa guida:Charlotte Ang — TrafficBees;James Norquay — Prosperity Media;Bibi Lauri Raven — BibiBuzz;Matt Diggity — Diggity Marketing;Venchito Tampon — SharpRocket;Greg & Morgan — JollySEO;Alex Tachalova — Digital Olympus;Adam Enfroy — adamenfroy.com;Laura Hampton — Impression;Alex Nigmatulin — PRnews.io.Grazie! 🙂Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim",
  "headers": [
    {
      "level": "H1",
      "text": "La Guida alla Link Building per Principianti"
    },
    {
      "level": "H2",
      "text": "Basi della link building"
    },
    {
      "level": "H3",
      "text": "Cos’è la link building?"
    },
    {
      "level": "H3",
      "text": "Perchè la link building è importante?"
    },
    {
      "level": "H4",
      "text": "1. Il Circolo Vizioso della SEO"
    },
    {
      "level": "H4",
      "text": "2. I tuoi concorrenti stanno, con molta probabilità, facendo link building"
    },
    {
      "level": "H3",
      "text": "I link non sono la risposta a tutto"
    },
    {
      "level": "H2",
      "text": "Come acquisire link"
    },
    {
      "level": "H3",
      "text": "1. Aggiungere link"
    },
    {
      "level": "H4",
      "text": "Inviare il sito a business directory"
    },
    {
      "level": "H4",
      "text": "Crea profili social per la tua azienda"
    },
    {
      "level": "H4",
      "text": "Commenti nei blog"
    },
    {
      "level": "H3",
      "text": "2. Richiedere link"
    },
    {
      "level": "H3",
      "text": "3. Acquistare link"
    },
    {
      "level": "H4",
      "text": "Private Blog Networks"
    },
    {
      "level": "H4",
      "text": "Fiverr"
    },
    {
      "level": "H4",
      "text": "Venditori di link SPAM"
    },
    {
      "level": "H3",
      "text": "4. Guadagnare Link"
    },
    {
      "level": "H3",
      "text": "5. Conservare i Link"
    },
    {
      "level": "H4",
      "text": "Recuperare i link"
    },
    {
      "level": "H4",
      "text": "Sistemare le pagine 404 che hanno link"
    },
    {
      "level": "H2",
      "text": "Cosa rende un link buono?"
    },
    {
      "level": "H3",
      "text": "1. Autorevolezza"
    },
    {
      "level": "H3",
      "text": "2. Rilevanza"
    },
    {
      "level": "H3",
      "text": "3. Anchor text"
    },
    {
      "level": "H3",
      "text": "3. Anchor text"
    },
    {
      "level": "H3",
      "text": "4. Nofollow vs follow"
    },
    {
      "level": "H3",
      "text": "5.  Posizione"
    },
    {
      "level": "H3",
      "text": "6. Destinazione"
    },
    {
      "level": "H2",
      "text": "Migliori tattiche di link building"
    },
    {
      "level": "H3",
      "text": "1. Seguire i link dei concorrenti"
    },
    {
      "level": "H3",
      "text": "2. Creare risorse per link"
    },
    {
      "level": "H3",
      "text": "3. Promozione dei contenuti"
    },
    {
      "level": "H4",
      "text": "Pubblicità"
    },
    {
      "level": "H4",
      "text": "Email di contatto"
    },
    {
      "level": "H4",
      "text": "Comunità"
    },
    {
      "level": "H3",
      "text": "4. Guest blog"
    },
    {
      "level": "H4",
      "text": "1. Fatti strada"
    },
    {
      "level": "H4",
      "text": "2. Fai un’offerta che non possono rifiutare"
    },
    {
      "level": "H2",
      "text": "Strumenti per la link building"
    },
    {
      "level": "H3",
      "text": "1. Strumenti per la ricerca dei backlink"
    },
    {
      "level": "H3",
      "text": "2. Strumenti per la ricerca dei contenuti"
    },
    {
      "level": "H3",
      "text": "3. Strumenti di Web Monitoring"
    },
    {
      "level": "H3",
      "text": "4. Strumenti per l’Email di Contatto"
    },
    {
      "level": "H2",
      "text": "Concludiamo"
    }
  ],
  "author": "Tim Soulo Tim Soulo Tim Soulo"
}