{
  "url": "https://ahrefs.com/blog/it/link-interni-seo/",
  "slug": "link-interni-seo",
  "title": "Link Interni Per La SEO: Una Guida Pratica",
  "description": "Scopri cosa sono i link interni, come impostare una struttura per linkare internamente e come controllarli per individuare i problemi.",
  "content": "Chris Haines Chris è un SEO Director e ha 10 anni di esperienza nel settore, lato agenzia. Quando non ha a che fare con la SEO, gli piace giocare con sintetizzatori vintage, passeggiare su spiagge sabbiose e bere una buona tazza di tè. Contenuti I link interni stanno ai link esterni come Robin sta a Batman: sono fondamentali per il successo SEO ma ricevono poco o nessun credito.In questa guida ti spiegherò cosa sono i link interni, come impostare una struttura per linkare internamente e come utilizzare strategicamente i collegamenti interni nella SEO.ContenutiCosa sono i link interni?I link interni sono collegamenti ipertestuali. Portano i visitatori da una pagina all’altra del tuo sito. Il loro scopo principale è aiutare le persone a navigare facilmente nel tuo sito, ma possono anche aiutare a migliorare la SEO.Ecco una visione semplificata di come appare un link interno:Ed ecco come appare un collegamento interno nel codice HTML:<a href=\"https://esempio.com/\">Link Interno</a>I link interni sono “fondamentli” per la SEO (secondo Google)I collegamenti interni hanno lo scopo pratico di portare i visitatori del tuo sito da A a B, ma hanno un ruolo importante nella tua strategia di link interno.Quando in un Google SEO office-hours gli è stato chiesto se i link interni fossero ancora importanti per la SEO, John Mueller ha risposto:Sì, assolutamente… I collegamenti interni sono estremamente importanti per la SEO. È una delle cose più importanti che puoi fare su un sito per guidare Google e i visitatori verso le pagine che ritieni importanti… Ciò che ritieni importante dipende totalmente da te.John Mueller, Senior Search Analyst GooglePertanto, se i collegamenti interni vengono utilizzati strategicamente nella SEO, possono aiutare a migliorare le prestazioni delle pagine che stai linkando.I collegamenti interni lo fanno indirizzando il PageRank del tuo sito. Anche se la barra del PageRank è scomparsa nel 2016, il PageRank è ancora un segnale utilizzato da Google.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) February 9, 2017 TipPuoi utilizzare l’URL Rating come metrica sostitutiva, poiché ha molto in comune con il PageRank di Google.In generale, maggiore è il numero di link interni di una pagina, maggiore è il suo PageRank. Ma non è solo una questione di quantità: anche la qualità del collegamento gioca un ruolo fondamentale.Oltre a trasmettere autorità, i collegamenti interni consentono ai visitatori di passare direttamente al contenuto che desideri mostrare loro, consentendoti di controllare l’esperienza dell’utente.Ad esempio, se gestisci un e‑commerce, potresti voler linkare i tuoi prodotti più venduti o stagionali direttamente dalla tua home page. Ciò è utile per i visitatori che desiderano passare direttamente ai prodotti e acquistarli e crea anche una buona esperienza utente grazie ad una forte struttura di collegamento interno.Dovresti guardare la questione in maniera strategica e pensare a cosa ti interessa di più e come puoi metterlo in evidenza grazie ai link interni.John Mueller, Senior Search Analyst GoogleGoogle e altri motori di ricerca utilizzano i collegamenti interni anche come indicazioni per scoprire nuove pagine sul tuo sito.Ad esempio, supponiamo che pubblichi una nuova pagina e dimentichi di linkarla da qualche altra parte del tuo sito. Supponendo che la pagina non sia nella tua sitemap XML e non abbia alcun backlink, Google faticherà a scoprirla.Ecco cosa ha da dire Google a riguardo:Alcune pagine sono note perché Google le ha già scansionate in precedenza. Altre pagine vengono scoperte quando Google segue un collegamento da una pagina conosciuta a una nuova pagina.I collegamenti interni possono anche fornire contesto per i motori di ricerca come Google. Lo fanno attraverso il testo di ancoraggio.In altre parole, se hai una pagina sugli abiti rossi e hai più collegamenti interni che puntano a quella pagina utilizzando testo di ancoraggio descrittivo come “vestiti”, “vestiti rossi” e “maxi vestiti rossi”, questi aiuteranno Google a comprendere il contesto della pagina che viene linkata.Tipi di collegamenti interniEcco i principali tipi di link che vedrai sul Web.Link di navigazioneLa maggior parte di chi visita il tuo sito si orienta utilizzando la navigazione del tuo sito. Questi sono alcuni dei collegamenti interni più importanti che puoi utilizzare.Ecco come appaiono sul sito di Ahrefs.Link contestualiI link contestuali vengono visualizzati nel corpo principale del contenuto di una pagina. Vengono generalmente utilizzati per espandere idee, fare riferimento a risorse, definire termini o indirizzare i lettori ad altri contenuti pertinenti.Ecco un esempio di collegamento contestuale al nostro strumento di ricerca per parole chiave:Link di breadcrumbI collegamenti interni possono essere utilizzati anche per indicare le relazioni tra le pagine. Uno dei migliori esempi di questo è il breadcrumb. I breadcrumb consentono agli utenti di tracciare il loro viaggio fino alla home page.In genere sono posizionati nella parte superiore delle pagine interne, per esempio le pagine dei prodotti o i post del blog.Google ha anche dichiarato che li tratta come link normali (come parte del calcolo del PageRank).We likes them. We treat them as normal links in e.g. PageRank computation— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) June 22, 2017 Link nel footerQuesti appaiono in fondo alla pagina. Ecco un esempio dei link a piè di pagina che trovi nel blog di Ahrefs.I link nel footer in genere includono collegamenti alla pagina dei contatti, all’informativa sulla privacy e ad altre pagine importanti del tuo sito.Sebbene i link nel footer siano utili per ulteriori dettagli, non sono il metodo di navigazione principale sulla maggior parte dei siti.Come impostare una struttura di link interni per avere successo con la SEOL’impostazione di una solida struttura per gestire i link interni aiuta il tuo sito a salire di livello indirizzando l’autorità sulle pagine migliori.Ecco come farla.1. Pianifica la struttura dei collegamenti interniSe stai avviando un nuovo sito o risistemando uno vecchio, il primo passo è pianificare la struttura dei link interni.La struttura piramidale è una delle strutture più popolari per i collegamenti interni, poiché crea naturalmente una struttura di collegamento interno dall’alto verso il basso.Ecco un esempio di come appare. Le frecce mostrano i collegamenti interni da una pagina all’altra.La creazione di una struttura per link interni di base è la prima fase per avviare una strategia di successo. Questo approccio è stato raccomandato anche da John:L’approccio top-down o la struttura piramidale ci aiuta molto di più a comprendere il contesto delle singole pagine all’interno del sito.John Mueller, Senior Search Analyst GoogleOltre all’approccio dall’alto verso il basso, puoi anche aggiungere breadcrumb per facilitare la navigazione nel tuo sito.I collegamenti breadcrumb consentono ai visitatori di capire dove si trovano sul sito e di tracciare il loro viaggio verso la home page.2. Linka le pagine interne che ti interessanoDopo aver creato le basi della struttura dei collegamenti interni, è il momento di iniziare a linkare le pagine interne del tuo sito che desideri evidenziare.Per le aziende di e‑commerce, potrebbe significare i loro prodotti o servizi chiave. Per le pubblicazioni, potrebbe essere il contenuto più importante su un particolare argomento.In Ahrefs, solitamente linkiamo internamente i nostri strumenti SEO dalle nostre pagine chiave.Ecco un esempio dalla home page di Ahrefs, che mostra che i nostri strumenti SEO principali sono linkati usando i link interni:Questo approccio aiuta a guidare i visitatori verso alcune delle parti più importanti dell’architettura del nostro sito.Puoi linkare ciò che preferisci, ma è meglio linkare quello che ti interessa di più.3. Linka contenuti rilevantiUn collegamento interno a contenuti contestualmente rilevanti sul tuo sito aiuta a fornire informazioni aggiuntive ai lettori sull’argomento di cui stai scrivendo.Ad esempio, quando si scrive di SEO, il lettore potrebbe imbattersi in un gergo tecnico che potrebbe non necessariamente comprendere, ma il link interno lo potrebbe aiuta a capire il contesto.Ecco un esempio:Questo approccio consente al lettore di cliccare sul collegamento per saperne di più su quell’argomento.Sul nostro blog, linkiamo contenuti pertinenti anche attraverso una casella “Ulteriori letture” simile a questa:Questo è un altro metodo che puoi utilizzare per indirizzare i lettori verso contenuti pertinenti sul tuo sito.Un’altra considerazione relativa ai link interni è il contesto del link. Gael Breton ritiene che:Nei contenuti, purché contestualmente abbia senso linkare un’altra pagina del tuo sito, dovresti farlo.Gael Breton, Co-Founder Authority HackerEcco un esempio di come può apparire su un e‑commerce:Oltre ad essere contestualmente rilevanti, vale la pena considerare quanto siano potenti le pagine dove inserisci il link.Diciamo che hai appena scritto un nuovo post e desideri aggiungere alcuni potenti collegamenti interni. Qual è il modo migliore per farlo?Ecco come farlo gratuitamente con Ahrefs Webmaster Tools:Vai al tuo più recente Site Audit e clicca su Page ExplorerInserisci la tua parola chiave nella barra di ricerca (ad esempio “online advertising”)Cambia il filtro in Page text (la pagina dovrebbe aggiornarsi dopo aver cliccato)In questo esempio ci sono 21 risultati. È quindi possibile ordinare le pagine in base al traffico organico. Ciò ti consente di vedere per prime le pagine con più traffico, probabilmente le più forti.Una volta ottenuto il tuo elenco, è solo questione di elaborarlo e aggiungere i link interni alla tua nuova pagina in queste pagine.Come verificare la presenza di problemi nei link interni del tuo sitoPer rimanere al passo con la tua strategia SEO, devi controllare periodicamente i tuoi collegamenti interni.Controllare manualmente i collegamenti interni uno per uno richiede molto tempo e, per i siti più grandi, è quasi impossibile.La soluzione migliore è utilizzare uno strumento come Site Audit, che ti consente di pianificare le scansioni del tuo sito web su base giornaliera, settimanale o mensile.Con questo strumento puoi:Correggere i collegamenti interni interrotti alle pagine 4XXIdentificare opportunità per nuovi collegamenti interniCorreggere le pagine orfane1. Correggi i link interni interrotti per recuperare l’autoritàDopo aver terminato il tuo Site Audit, vai su Internal pages e clicca su “Issues.”Nell’esempio sopra, possiamo vedere che ci sono alcuni problemi. Clicchiamo sulla “pagina 4XX” per esaminare un problema in modo più dettagliato.Possiamo vedere che questo problema è stato causato da un post del blog che abbiamo rimosso ma che contiene ancora 37 link interni che puntano ad esso.Se la pagina venisse rimossa definitivamente, devi rimuovere i link interni che puntano a questa pagina 404.ConsiglioSe la pagina 404 avesse importanti link esterni che puntano ad essa, allora potresti prendere in considerazione il reindirizzamento 301. Per verificarlo, puoi utilizzare il report sui Backlink Rotti di Ahrefs Site Explorer.Come risultato di questo controllo, potremmo prendere in considerazione il reindirizzamento 301 di questa pagina a una pagina quasi equivalente. 2. Correggi le pagine orfaneLe pagine orfane sono pagine senza link interni.Se sul tuo sito sono presenti pagine importanti classificate come pagine orfane nel tuo Site Audit, vuol dire che hai un problema.La buona notizia è che il problema può essere risolto semplicemente aggiungendo un nuovo link interno alle pagine orfane in questione.Una volta eseguito il controllo, puoi vedere se hai pagine orfane:Cliccando su Links.Selezionando la casella “Issues”.Site Audit > Links > Issues tab > Orphan page (has no incoming internal links)Nell’esempio seguente, possiamo vedere che questo sito ha una pagina orfana:Nessuna pagina importante dovrebbe essere orfana per due motivi:Google non sarà in grado di trovarli (a meno che tu non invii la tua sitemap tramite Google Search Console o ci siano backlink da pagine scansionate su altri siti);Nessun PageRank verrà trasferito tramite collegamenti interni, poiché non ce ne sono.Scorri l’elenco e assicurati che non vengano visualizzate pagine importanti.Se hai molte pagine sul tuo sito, prova a ordinare l’elenco in base al traffico organico dal più alto al più basso.Le pagine orfane che ricevono ancora traffico organico probabilmente otterrebbero ancora più traffico se collegate internamente.3. Identifica opportunità per nuovi collegamenti interniAnche trovare nuove opportunità per link interni è un processo che richiede tempo se viene eseguito manualmente, ma puoi identificarle in blocco utilizzando Site Audit.Per farlo, clicca sul rapporto Internal link opportunities nel Site Audit.Vedrai una serie di suggerimenti su come migliorare i tuoi collegamenti interni utilizzando nuovi link.La cosa migliore di questo rapporto, secondo me, è che suggerisce esattamente dove posizionare il collegamento interno.Nell’esempio sopra, Site Audit suggerisce che in questo passaggio di testo dovremmo aggiungere un link alla nostra pagina sulla navigazione a faccette.Consiglio di rivedere i consigli e di aggiungere link alle pagine più importanti che desideri evidenziare.ConclusioniGestire i link interni non è tecnicamente difficile, ma richiede tempo e pazienza per una strategia di successo. Inoltre, apportare modifiche al tuo sito può causare più problemi che, se non diagnosticati, possono influire sulle prestazioni del tuo sito nei motori di ricerca come Google.Secondo me, l’unico modo sostenibile per monitorare i tuoi link interni è utilizzare uno strumento come Site Audit. di Ahrefs.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Chris Haines Chris è un SEO Director e ha 10 anni di esperienza nel settore, lato agenzia. Quando non ha a che fare con la SEO, gli piace giocare con sintetizzatori vintage, passeggiare su spiagge sabbiose e bere una buona tazza di tè.",
  "headers": [
    {
      "level": "H1",
      "text": "Link Interni Per La SEO: Una Guida Pratica"
    },
    {
      "level": "H2",
      "text": "Cosa sono i link interni?"
    },
    {
      "level": "H2",
      "text": "I link interni sono “fondamentli” per la SEO (secondo Google)"
    },
    {
      "level": "H2",
      "text": "Tipi di collegamenti interni"
    },
    {
      "level": "H3",
      "text": "Link di navigazione"
    },
    {
      "level": "H3",
      "text": "Link contestuali"
    },
    {
      "level": "H3",
      "text": "Link di breadcrumb"
    },
    {
      "level": "H3",
      "text": "Link nel footer"
    },
    {
      "level": "H2",
      "text": "Come impostare una struttura di link interni per avere successo con la SEO"
    },
    {
      "level": "H3",
      "text": "1. Pianifica la struttura dei collegamenti interni"
    },
    {
      "level": "H3",
      "text": "2. Linka le pagine interne che ti interessano"
    },
    {
      "level": "H3",
      "text": "3. Linka contenuti rilevanti"
    },
    {
      "level": "H2",
      "text": "Come verificare la presenza di problemi nei link interni del tuo sito"
    },
    {
      "level": "H3",
      "text": "1. Correggi i link interni interrotti per recuperare l’autorità"
    },
    {
      "level": "H3",
      "text": "2. Correggi le pagine orfane"
    },
    {
      "level": "H3",
      "text": "3. Identifica opportunità per nuovi collegamenti interni"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Chris Haines"
}