{
  "url": "https://ahrefs.com/blog/it/listicle/",
  "slug": "listicle",
  "title": "Come Scrivere un Fantastico Listicle in 10 Mosse",
  "description": "I listicle, conosciuti anche come articoli-lista, sono contenuti strutturati attorno ad una lista. Ogni punto viene solitamente espanso e approfondito per renderlo utile al lettore.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti I listicle non devono essere clickbait. Quei noiosi articoli che parlano delle migliori patatine fritte o delle celebrità con gli addominali più scolpiti che vedi su Facebook danno ai listicle una cattiva fama.È perfettamente possibile scrivere un fantastico listicle che parla… beh, praticamente di tutto.In questo articolo imparerai esattamente come fare.Cos’è un listicle?Perché le persone amano i listicle?Come scrivere un buon listicleAlcuni esempi di listicle ben scrittiCos’è un listicle?I listicle, altrimenti conosciuti come articoli-lista, sono degli articoli che sono strutturati attorno ad una… elenco. Solitamente, tendono ad espandere ogni punto dell’elenco con delle informazioni aggiuntive che sono utili per i lettori.La parola deriva dalla fusione delle due parole inglesi “list” (“lista”) e “article” (“articolo”).Perché le persone amano i listicle?Ecco alcune motivazioni: Facile da scorrere in quanto ogni sottotitolo solitamente corrisponde ad un elemento della lista. Facile da digerire perché sono suddivisi in sezioni corte da leggere. Facili da valutare in quanto sai sempre a che punto ti trovi nella lettura in base al numero presente nel titolo.Si tratta di un elenco esaustivo? No, ma non possiamo elencare tutte le motivazioni. Leggi questo articolo dello Smithsonian Magazine se sei curioso di conoscere il resto delle motivazioni dietro la loro popolarità.Come scrivere un buon listicleScrivere un listicle è semplice. Apri un nuovo documento, fai una lista di un pò di cose e hai un listicle. Ma scrivere un listicle che porta traffico e che le persone vogliano leggere è complicato.Ecco come farlo:Scegli un argomentoAssicurati che abbia sensoDecidi la sua lunghezzaScegli un formatoScegli un angolo vincenteFai brainstorming su cosa includereEspandi le tue ideeApprofondisci ogni elemento della listaIllustra i tuoi puntiCrea una conclusione1. Scegli un argomentoSe vuoi scrivere un listicle che porti traffico dai motori di ricerca, devi scegliere un argomento che le persone ricercano.Dato che la parola chiave rappresenta solitamente un argomento, puoi ottenere questo risultato compiendo una buona ricerca di parole chiave con un apposito strumento come il Keyword Explorer di Ahrefs. Cerca un argomento generico e vai poi nel report chiamato Corrispondenza Frase, dove ti verranno proposte delle idee di parole chiave da utilizzare ordinate in base al loro volume di ricerca.Assicurati di scegliere un argomento di cui hai conoscenza. Altrimenti rischi di avere difficoltà nello scrivere una lista unica e di valore.Nota a margine.Se non hai un account su Ahrefs, puoi ottenere fino a 100 idee utilizzando il nostro keyword generator gratuito.2. Assicurati che abbia sensoNon ogni argomento è adatto ad essere trattato in forma di lista. Questo è piuttosto chiaro per alcuni argomenti come “come fare il nodo alla cravatta”. In questo caso è semplice intuire che chi ricerca voglia una guida passo passo e non un listicle con molti diversi metodi fra cui scegliere.Ma non sempre le cose sono così ovvie…Prendi un argomento come ad esempio “seo expert” (in italiano “esperto seo”). Non è chiaro se le persone vogliano una guida passo-passo, una lista di consigli o altro.Puoi capirlo guardando ai risultati meglio posizionati su Google. Questo perché il business model di Google si basa proprio sul fornire i risultati di ricerca più pertinenti, e quindi i risultati meglio posizionati fanno da filtro per aiutarti a capire cosa vuole vedere l’utente.Dando uno sguardo allo screenshot qui sopra, puoi vedere come solo un listicle sia presente nelle prime cinque per “seo expert”. Dato che il resto sono guide passo-passo, questo probabilmente indica che non si tratta di un buon argomento per un listicle.PRO TIPSe stai avendo difficoltà ad identificare un argomento adatto per un listicle, prova ad aggiungere queste parole chiave nel filtro Include del Keywords Explorer: idee, consigli, migliori, cose, oggetti, strategie, tattiche, lista. Ti aiuteranno a restringere i risultati alle parole chiave che contengono almeno una di queste parole, che sono solitamente ottime candidate per un listicle.3. Decidi la sua lunghezzaGeneralmente parlando, il numero di elementi della tua lista dovrebbe approssimativamente corrispondere al numero di elementi che vedi nelle liste meglio posizionate per l’argomento scelto. Dopotutto, se sono tutte a due o tre cifre, avere una lista di cinque punti non è probabilmente quello che gli utenti vogliono.Ad esempio, i migliori risultati per “date ideas” (“idee per un appuntamento” in italiano), sono nell’ordine delle centinaia.Mentre nessuno dei migliori 5 risultati per “blogging tips” (“consigli per i blogger” in italiano) eccede i 30.Si tratta di una regola ferrea? No. Se credi che un lista da 100+ elementi sia completamente inutile e non aiuti i lettori, sentiti libero di deviare da questo consiglio. Quello che facciamo è utilizzare i migliori risultati come filtro per capire cosa l’utente vuole, ma non si tratta di un metodo infallibile al 100%.In più, la lunghezza della lista potrebbe essere ristretta dal numero di idee che hai, ma è una buona cosa quella di avere una misura approssimativa dalla quale partire.4. Scegli un formatoEsistono due possibile formati per un listicle:a) BaseLe liste base sono concise, contenendo 1–2 frasi di descrizione per ogni elemento. Utilizza questo formato dove una o entrambe le condizioni qui sotto sono vere: La tua lista sarà lunga. Le persone probabilmente non vogliono leggere un romanzo riguardo i 50+ punti della tua lista. L’argomento scelto è semplice. Diciamo che stai creando una lista di idee per il primo appuntamento. Molte di queste sono probabilmente cose semplici come ’andare sui pattini’ o ‘fare una passeggiata in montagna’. Non hai bisogno di scrivere 500 parole su ognuna di queste cose.b) DettagliataLe liste dettagliate d’altro canto, sono quelle dove espandi ogni punto con diverse frasi o paragrafi. Utilizza questo formato dove una o entrambe le condizioni qui sotto sono vere: La tua lista sarà breve. Se la tua lista sarà composta da pochi elementi, il tuo articolo attrarrà probabilmente più traffico se fornisci più sostanza e dettagli su ognuno di essi. L’argomento scelto è complicato. Poniamo il caso che tu stia mettendo insieme una lista di consigli SEO. La SEO è un argomento complicato, quindi i lettori avranno probabilmente bisogno di consigli pratici e istruzioni passo passo su come mettere in pratica ogni consiglio.5. Scegli un angolo vincenteEcco alcuni angle interessanti da utilizzare per i listicle: Esperienza personale → I 21 Migliori Strumenti di Marketing Online Che Utilizziamo ad Ahrefs Migliore → I Migliori 6 Podcast di Marketing (I Più Votati) Commento esperto → 33 Consigli dagli Esperti su Come Mettere in Ordine Per principianti → 17 consigli (testati) per blogger agli inizi Risultati specifici→ 12 Consigli Veloci SEO Per Aumentare il Traffico Organico Testati e provati → 26 delle Migliori Estensioni Chrome per Chi fa SEO (Provate e Testate)Nonostante tu possa scegliere un angolo su quello che reputi più interessante, è meglio prendere ispirazione dai risultati meglio posizionati. Ricorda, questi fungono da filtro su quello che gli utenti vogliono vedere.Se facciamo questa operazione per “travel tips” (“consigli di viaggio” in italiano), vediamo che la maggior parte dei risultati si basa sull’esperienza personale:Per “dinner ideas” (“idee per cena” in italiano), la maggior parte dei risultati è focalizzata sulla semplicità.Le cose non sono sempre così chiare ed immediate. Guarda ad esempio ai risultati per “marketing ideas” (“idee di marketing” in italiano), dove ci sono due angle dominanti: creative e gratuite. Quale fra i due scegliere è a tua discrezione.In ogni caso, assicurati di non cadere in angoli clickbait. Se non puoi offrire quello che il tuo angolo promette, scegline un altro.6. Fai brainstorming su cosa includereFornire nuove e uniche idee è cruciale quando scrivi un listicle (o qualsiasi altro contenuto per la cronaca). Quindi, nonostante sia allettante copiare il lavoro di altri, se ti limiti a creare una copia dei listicle esistenti, nessun porrà attenzione al tuo articolo.Ancora peggio, probabilmente non riuscirà ad attrarre backlink, e sarà quindi difficile posizionarsi su Google e ottenere traffico organico.Per questo motivo, dovresti annotare le idee prima di vedere cosa è contenuto nei listicle già esistenti sulla tematica scelta. Questo processo non deve essere complicato. Apri un documento e inizia a fare una lista delle tue potenziali idee.7. Espandi le tue ideeA meno che tu non abbia una conoscenza approfondita dell’argomento, farai fatica a pensare ad abbastanza elementi da includere nel tuo listicle senza prendere ispirazione. Ottenere degli input da amici e colleghi è un modo per ovviare a questo problema, ma puoi anche farti ispirare dalle pagine meglio posizionate.Ecco due modi per farlo:a) Usa il report “also talk about” Inserisci la tua parola chiave all’interno del Keywords Explorer di Ahrefs e vai nel report Also talk about. Questo mostra le parole e le frasi menzionate frequentemente dalle pagine meglio posizionate per la parola chiave inserita.Non tutte queste parole o frasi saranno particolarmente utili, quindi scorri la lista alla ricerca di quelle che potrebbero essere delle buone candidate per diventare elementi della lista.Ad esempio, ecco alcune parole e frasi che vengono mostrate per “date ideas” (“idee per un appuntamento” in italiano):GelatoCinemaRifugio per gli animaliGiochi da tavoloArrampicataSe combiniamo queste idee con la nostra conoscenza e un po’ di buon senso, possiamo trasformarle in punti di valore della lista:Andare a prendere un gelatoAndare a guarda un film al cinemaVisitare un rifugio per animaliGiocare ai giochi da tavoloAndare a fare arrampicatab) Analizza i sottotitoliLa maggior parte dei listicle utilizza dei sottotitoli per ogni punto della lista. Un ottimo modo per prendere ispirazione dalle pagine meglio posizionate è quindi proprio quello di estrarre i sottotitoli. Per farlo puoi utilizzare la toolbar SEO di Ahrefs. Installala, apri le pagine meglio posizionate e clicca poi sull’icona in alto a sinistra per il report on-page.Se ti stai chiedendo perché non guardare direttamente le pagine, beh, puoi farlo. Ma potresti cadere nella tentazione di prendere troppa ispirazione in questo modo. Finiresti con il leggere tutto il contenuto dei paragrafi e copiarlo all’interno del tuo listicle, che diverrebbe un clone.8. Approfondisci ogni elemento della listaOra è arrivato il momento di espandere e approfondire ogni punto del tuo listicle. Il livello di dettaglio varierà in base al formato che hai deciso di utilizzare. Per le liste semplici. Aggiungi un paio di frasi per ogni punto. Per le liste dettagliate. Scrivi quanto serve per spiegare ogni punto in dettaglio, in modo che sia comprensibile.Tieni a mente l’angolo scelto quando ti trovi a questo punto. Se stai scrivendo un listicle per i principianti ad esempio, dovrai evitare dettagli e tecnicismi eccessivi. Se il tuo listicle si basa sull’esperienza personale, espandi ogni punto con i tuoi pensieri e opinioni.9.Illustra i tuoi puntiI listicle sono semplici da leggere e digerire. Ma sono ancora più semplici da scorrere quando li arricchisci con immagini e illustrazioni. Questo diventa ancora più importante quando vuoi che i lettori si ricordino i punti presenti nella tua lista, grazie all’effetto chiamato effetto picture superiority.Secondo Wikipedia:L’effetto picture superiority si riferisce al fenomeno per il quale le immagini e le figure hanno più probabilità di essere ricordate delle parole. Questo effetto è stato dimostrato in numerosi esperimenti utilizzando diversi metodi.Se hai letto uno qualsiasi dei nostri listicle, avrai notato come utilizziamo parecchie immagini. Ad esempio, il nostro listicle contenente 17 idee di marketing contiene 39 immagini. Questo in quanto il marketing è complicato, e alcuni punti sono difficili da capire senza alcune immagini a corredo. Non devi utilizzare così tante immagini anche nel tuo listicle, quindi non forzare per il semplice gusto di farlo.10. Crea una conclusioneI listicle hanno una tendenza a terminare bruscamente. Arrivi al punto finale e ti fermi.È semplice capirne il perchè. La maggior parte delle persone che legge i listicle lo fa velocemente, quindi non avrebbero particolare interesse nel leggere una conclusione in ogni caso. Ma questo non è un buon motivo per non includerne una. Per le persone che leggono il tuo listicle dall’inizio alla fine, una buona conclusione può aiutarli a tirare le somme.Ecco alcuni consigli per scrivere una buona conclusione ai tuoi listicle:Sii conciso.Non ripetere cose già dette.Concentrati sul punto principale che vuoi sia compreso.Inserisci link ad altri articoli pertinenti (non devono essere per forza altri listicle).Esempi di listicleDato che seguiamo anche noi gli stessi consigli proposti per scrivere i nostri listicle, crediamo sia una buona idea concludere condividendo alcuni listicle dal nostro blog che sono ben posizionati e ci portano parecchio traffico. 7 Motori Di Ricerca Alternativi (Analizzati e Provati): 11K+ visite da traffico organico 8 metodi facili per trovare qualsiasi indirizzo email: 8K+ visite da traffico organico 7 Siti Affiliati Amazon di Successo: 3,5K+ visite da traffico organico 12 Consigli Veloci SEO: 3K+ visite da traffico organico. 10 Metodi per Indicizzare il tuo sito su Google: 2,5K+ visite da traffico organico 9 Semplici Strategie di Link Building: 1,3K+ visite da traffico organico 4 Semplici Modelli Di Post Per I Blog: 1,2K+ visite da traffico organico.ConclusioniNon tutti i listicle sono identici. Solo perché quelli Buzzfeed rappresentano la qualità media non significa che debbano farlo anche i tuoi. Scegli il giusto tema, angolo, formato, fai uno sforzo nella creazione del contenuto e avrai la perfetta ricetta per il successo.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Come Scrivere un Fantastico Listicle in 10 Mosse"
    },
    {
      "level": "H2",
      "text": "Cos’è un listicle?"
    },
    {
      "level": "H2",
      "text": "Perché le persone amano i listicle?"
    },
    {
      "level": "H2",
      "text": "Come scrivere un buon listicle"
    },
    {
      "level": "H3",
      "text": "1. Scegli un argomento"
    },
    {
      "level": "H3",
      "text": "2. Assicurati che abbia senso"
    },
    {
      "level": "H3",
      "text": "3. Decidi la sua lunghezza"
    },
    {
      "level": "H3",
      "text": "4. Scegli un formato"
    },
    {
      "level": "H4",
      "text": "a) Base"
    },
    {
      "level": "H4",
      "text": "b) Dettagliata"
    },
    {
      "level": "H3",
      "text": "5. Scegli un angolo vincente"
    },
    {
      "level": "H3",
      "text": "6. Fai brainstorming su cosa includere"
    },
    {
      "level": "H3",
      "text": "7. Espandi le tue idee"
    },
    {
      "level": "H4",
      "text": "a) Usa il report “also talk about”"
    },
    {
      "level": "H4",
      "text": "b) Analizza i sottotitoli"
    },
    {
      "level": "H3",
      "text": "8. Approfondisci ogni elemento della lista"
    },
    {
      "level": "H3",
      "text": "9.Illustra i tuoi punti"
    },
    {
      "level": "H3",
      "text": "10. Crea una conclusione"
    },
    {
      "level": "H2",
      "text": "Esempi di listicle"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}