{
  "url": "https://ahrefs.com/blog/it/local-seo-consigli/",
  "slug": "local-seo-consigli",
  "title": "Local SEO: 8 Consigli Per Posizionarsi A Livello Locale",
  "description": "Per local SEO si intende il processo per aumentare la presenza della tua azienda nelle ricerche effettuate localizzate per attirare più clienti o utenti.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti La local SEO è il processo che permette di migliorare la visibilità di un’azienda nella ricerca geolocalizzata così da attirare più clienti o utenti.Ci sono molte guide che spiegano come fare local SEO dall’inizio alla fine, ma possono essere poco coinvolgenti dal momento che l’argomento è abbastanza complesso.In questa guida, abbiamo deciso di semplificare la questione e focalizzarci su 8 consigli per aumentare il posizionamento organico a livello locale: Richiedi e ottimizza il tuo profilo su Google BusinessCerca parole chiave geolocalizzateOttimizza le landing page localiOttieni citazioni e link geolocalizzatiRecupera i link persiOttieni più recensioniFatti inserire nelle liste geolocalizzateMantieni il tuo sito in ottime condizioni1. Richiedi e ottimizza il tuo profilo su Google BusinessTutte le attività possono richiedere un profilo gratuito su Google Business, ovvero una scheda geolocalizzata con informazioni sull’attività. Una volta rivendicato il profilo aziendale, le informazioni che aggiungi al suo interno possono essere visualizzate nei risultati di ricerca su Google e in Google Maps.Puoi richiedere il tuo profilo aziendale utilizzando Google My Business, lo strumento gratuito di Google per la gestione degli account My Business.Ecco come fare:Vai su Google My BusinessClicca su Gestisci ora Inserisci i dettagli del tuo account GoogleRicerca il nome della tua attivitàSeleziona la tua attivitàClicca su Gestisci oraNota a margine. Se la tua attività non viene visualizzata nelle ricerche, segui le indicazioni per aggiungerla. Anche se viene visualizzata, ti potrebbe essere chiesto di rivedere e confermare i dettagli della tua attività prima del passaggio 6. Dopo aver ottenuto l’accesso alla scheda della tua azienda, potrai gestire il tuo profilo utilizzando Google My Business.Sono molte le cose che puoi fare per ottimizzare la tua scheda aziendale su My Business. Ne abbiamo selezionate 5, probabilmente le più importanti: Scegli la giusta tipologia per la tua attività: Google divide le attività in negozi, servizi e attività ibride. Le informazioni che inserisci nella scheda “Informazioni” determineranno il modo in cui Google vede la tua attività. Se la tua attività serve i clienti solo in una location specifica, come nel caso di un parrucchiere o di un bar, inserisci l’indirizzo e lascia vuoto il campo relativo alla zona coperta dal servizio. Se la tua attività lavora in modalità consegna a domicilio, come nel caso di un idraulico o di una pizzeria, lascia vuoto il campo con l’indirizzo e inserisci le zone coperte dal servizio. Se la tua azienda fa entrambe le cose, aggiungi il tuo indirizzo e inserisci anche informazioni sulle zone coperte. Scegli la giusta categoria per la tua attività: all’interno di questo campo sono disponibili molte opzioni e alcune possono essere simili (per esempio, ragioniere vs. commercialista). Prenditi qualche minuto per analizzare esattamente le varie opzioni e scegliere quella più appropriata per te. Inserisci gli orari di lavoro/apertura: Le persone non vanno o non telefonano se pensano che un’attività sia chiusa, quindi è fondamentale elencare gli orari di lavoro o di apertura precisi. Dovresti farlo anche per i periodi di ferie o i giorni festivi, in modo che la tua clientela sia sempre aggiornata sulle aperture, anche quelle durante i giorni di festa. Aggiungi foto: Le attività con foto ricevono il 42% in più di richieste di indicazioni stradali e il 35% in più di clic sul loro sito, stando a Google. Assicurati di aggiungerle. Inserisci il link al tuo sito: È sorprendente (e frustrante) vedere quante attività non lo fanno. Differenziati.Letture consigliate: Come Ottimizzare La Tua Scheda Su Google My Business In 30 Minuti2. Cerca parole chiave geolocalizzateSapere come i clienti locali cercano i prodotti o i servizi che offri è la base della local SEO. Se conosci bene il tuo settore e i tuoi clienti, è probabile che tu abbia già un’idea relativa alle abitudini di ricerca. Ma è comunque saggio eseguire ricerche per parole chiave per espandere le tue opportunità.Ad esempio, supponiamo che tu sia un idraulico a Londra. Probabilmente non hai bisogno di fare una ricerca per parole chiave per sapere che i potenziali clienti stanno cercando cose come:idraulico a LondraidraulicoMa la realtà è che le persone probabilmente cercano quello che fai anche in altri modi. Concentrandoti solo su parole chiave ovvie come “plumber london”, stai perdendo dei soldi.Ecco un modo per scoprire in quali altri modi le persone potrebbero cercarti:Ragiona su ciò che offri, che siano prodotti o serviziInserisci la tua lista di idee, o parole chiave, sul Keywords Explorer di AhrefsVai sul report Matching termsCerca parole chiave pertinenti con volumi di ricerca interessantiAd esempio, se cerchiamo parole come “boiler repair,” “boiler installation,” and “drain unblocking”, in inglese, nello strumento Keywords Explorer, notiamo subito che le persone cercano questi servizi e parole simili ogni mese:I volumi di ricerca specificati in Keywords Explorer sono nazionali, non locali. In altre parole, mostrano il numero mensile stimato di ricerche nel Paese di riferimento.Questo non è un grosso problema perché le persone in genere cercano allo stesso modo, indipendentemente da dove si trovano. E quello che ti viene mostrato dal tool corrisponde a come le persone cercano ciò che offri.Se vuoi individuare volumi di ricerca locali per queste parole chiave, leggi la guida qui sotto per scoprire come fare.Letture consigliate: Come Fare Ricerca Parole Chiavi Geolocalizzata3. Ottimizza le landing page localiSe hai scoperto che le persone cercano i prodotti o i servizi specifici che offri, probabilmente devi creare specifiche landing page per attirare queste ricerche. Ad esempio, le persone non cercano solo “plumber” ma anche:gas boiler installationboiler replacementbathroom fittingHa senso dunque creare landing page per questi servizi. Ma come fare in modo che si posizionino in alto nei risultati di ricerca?Per prima cosa affrontiamo il modo sbagliato di farlo: il keyword stuffing. Si tratta della tattica che consiste nel ripetere le parole chiave che vuoi posizionare il maggior numero di volte possibile sulla pagina, generando dunque del testo che non suona e non è naturale (come questo riportato di seguito, in inglese):Questa tattica è utilizzata ancora oggi da molti siti e non è mai una buona idea. Non aiuta la SEO e, anche se lo facesse, probabilmente servirebbe solo a far scappare dei potenziali clienti.Devi invece “ottimizzare” le pagine di destinazione includendo informazioni importanti per chi sta cercando quei servizi. Gran parte di questo processo è semplicemente buon senso. Ad esempio, è abbastanza ovvio che le persone che cercano “boiler repair” vogliono informazioni sui prezzi.Anche se conosci bene il tuo settore e i tuoi clienti, puoi comunque dimenticare dettagli importanti. Per questo motivo, è utile guardare per cosa si posizionano altre pagine simili, poiché queste parole chiave spesso si riferiscono a dettagli importanti.Ecco come fare:Installa e attiva la SEO Toolbar di AhrefsCerca su Google il nome del servizio/prodotto + la posizioneCerca una pagina simile alla tua nei risultati di ricerca (ovvero una pagina che offre lo stesso servizio a livello locale)Verificane il posizionamento per un numero interessante di parole chiaveClicca su KWFiltra per i primi 10 risultatiFiltra per escludere i sitelink e le pagine che si posizionano nella sezione “people also ask” Ad esempio, se cerchiamo “boiler repair london” notiamo che questa pagina si posiziona per 232 parole chiave:Se clicchiamo su quel numero, possiamo vedere tutte le parole chiave nel Site Explorer di Ahrefs.Nota a margine. Vediamo solo 173 parole chiave, non 232, perché stiamo esaminando solo il posizionamento delle parole chiave nel Regno Unito. Le altre parole chiave si posizionano in altri mercati. Poiché siamo interessati solo alle parole chiave più pertinenti, filtriamo anche per vedere le prime 10 parole chiave ed escludiamo i sitelink e le pagine che si posizionano nella sezione “people also ask”.Le parole chiave degne di considerazione (evidenziate nello screenshot sopra) sono le seguenti:fixed price boiler repairsemergency boiler repair londonboiler call outelectric boiler repairgas boiler repair near meboiler repair same dayDa questa lista, possiamo vedere che le persone stanno probabilmente cercando idraulici che offrono prezzi fissi piuttosto che tariffe orarie. Chi cerca, inoltre, vuole anche sapere se è offerta o meno la riparazione in giornata, che tipi di caldaie vengono riparate (elettriche, a gas, ecc.) e se sono accettate chiamate di emergenza.Queste sono tutte le informazioni che dovremmo considerare di includere su una landing page specifica. 4. Ottieni citazioni e link geolocalizzatiLe citazioni locali sono quelle che includono nome, indirizzo e numero di telefono della tua attività online. Sono stati votati come il quinto fattore di ranking più importante per le query locali, almeno stando ad uno studio di Moz del 2018.Oggi sono probabilmente meno importanti, ma vale comunque la pena acquisirli per due motivi: Aiutano le persone a trovare la tua attività: la SEO locale non riguarda solo l’ottimizzazione per Google, ma anche per altri motori di ricerca che le persone possono utilizzare per trovare la tua attività, come Yelp, Bing, Facebook, Apple Maps e qualsiasi directory specifica del settore; Potrebbero comunque aiutarti a posizionarti: anche se sono meno importanti di una volta, possono comunque aiutarti a posizionarti in alto.Negli Stati Uniti esistono degli specifici aggregatori da utilizzare per le citazioni geolocalizzate: Data AxleLocalezeFoursquareQuesti aggregatori inviano i loro dati a molti altri siti Web e directory, quindi ricevere citazioni e inserire link su questi siti può spesso portare a citazioni altrove senza alcun lavoro aggiuntivo.Altri aggregatori disponibili in diverse zone:BingApple MapsFacebookYelpYellowpagesDunn & BradstreetTomTomOltre a ciò, vale principalmente la pena concentrarsi su citazioni specifiche nel proprio settore o in una nicchia specifica. In altre parole, elenchi su directory e motori di ricerca locali o specifici del settore. Poiché la maggior parte di queste citazioni include un collegamento al sito dell’azienda insieme alle informazioni di contatto, il modo più semplice per trovare opportunità rilevanti è cercare collegamenti comuni ad altre attività locali simili..Ecco come utilizzare lo strumento Link Intersect di Ahrefs per farlo: Inserisci l’indirizzo del tuo sito in Site ExplorerClicca su Link intersect nel pannello sulla sinistraInserisci i siti dei tuoi concorrentiClicca su Mostra opportunità di backlinkAd esempio, se lo facciamo per un’azienda idraulica e alcuni dei suoi concorrenti, notiamo come molti dei risultati provengono chiaramente da directory locali o specifiche del settore:Ottenere citazioni da questi siti è solitamente semplice: basta registrarsi e aggiungere i propri dettagli.Letture consigliate: Come Ottenere Citazioni Locali5. Recupera i link persiI backlinks sono un fattore di ranking conosciuto quando si parla di Google, ma possono essere difficili da reperire. Quindi è importante assicurarsi che nessuno dei link che hai già vada sprecato. Puoi farlo identificando le pagine che linkano a vecchie pagine del tuo sito che non esistono e reindirizzarle alle nuove.Ecco come:Inserisci il tuo sito in Site ExplorerVai al report Migliore per linkInserisci il filtro “404 not found” HTTP Reindirizza quegli indirizzi verso le nuove pagineAd esempio, se lo facciamo per un idraulico a New York, vediamo che una pagina ormai inesistente sulla pulizia degli scarichi ha ricevuto link esterni da tre domini unici (siti web unici).Questi backlink sono effettivamente sprecati perché la pagina non esiste più.Basta una veloce visita al sito per comprendere il problema: la pagina “drain cleaning services” è stata spostata ad un nuovo indirizzo e si sono dimenticati di reindirizzare la vecchia:Per recuperare questi link, tutto ciò che il proprietario di un sito deve fare è reindirizzare il vecchio URL a quello nuovo. Puoi scoprire come farlo nella nostra guida ai redirect 301.Nei casi in cui non esiste un indirizzo “nuovo” simile, reindirizza la pagina ormai inesistente a quella più pertinente.6. Ottieni più recensioniSecondo Google, “le recensioni positive e di alta qualità da parte dei clienti possono migliorare la visibilità della tua attività” e sono il secondo fattore di ranking più importante, secondouno studio di BrightLocal del 2020.Come puoi ottenere più recensioni? Chiedile.Devi fare attenzione perché potresti andare contro i termini di Google che vieta di offrire incentivi ai clienti in cambio di recensioni. Ma ci sono modi per aumentare la probabilità che un cliente lasci una recensione senza infrangere le regole di Google.Ad esempio, di recente ho fatto pulire e parcheggiare la mia vecchia auto. Quando il ragazzo ha finito, mi ha inviato tantissime foto del “prima” e del “dopo” della mia macchina su Facebook:Non mi ha chiesto una recensione ma poiché le foto che ha scattato mi hanno reso più facile lasciarne una utile, l’ho fatto:A giudicare dal numero di foto nelle altre recensioni, sembra che questo approccio abbia funzionato bene anche con altri clienti.Ma c’è un modo grazie al quale questo ragazzo potrebbe (probabilmente) ottenere ancora più recensioni……creando e condividendo un link che i clienti possono utilizzare per lasciare una recensione, cosa che puoi fare gratuitamente in Google My Business. Basta cliccare sul pulsante Condividi quindi Recensioni nella dashboard di gestione dell’account.Questa è una buona pratica secondo Google, quindi non c’è pericolo di infrangere i termini.7. Fatti inserire nelle liste geolocalizzatePuoi trovare elenchi con “Il meglio di” praticamente per qualsiasi prodotto o servizio, non importa quanto famoso. Prendi per esempio questo elenco con i posti migliori dove mangiare ali di pollo a Manchester (in inglese):Ci sono tantissime varianti di queste liste sul “meglio di”, come per esempio questo elenco delle 10 migliori aziende vinicole a misura di bambino a Città del Capo (in inglese):Bambini e vino… ok. Ma non divaghiamo…Inserire la tua attività in elenchi pertinenti come questo è una buona idea per due motivi principali: Attirano clienti: questi elenchi di solito si posizionano in alto per termini come “il migliore __ a ___”. Se sei in 9 liste su 10, è probabile che queste ti portino davvero dei risultati. Attirano backlink: e sappiamo bene che i backlink ti aiutano a posizionarti più in alto su Google.Ecco come trovare liste geolocalizzate:Installa la SEO Toolbar di AhrefsCerca su Google qualcosa che probabilmente restituirà elenchi rilevanti per la tua attivitàCerca articoli con trafficoAd esempio, se gestisci un boutique hotel a Londra, potresti cercare “best boutique hotels london”. Questa ricerca ti restituirà un misto di directory (che puoi ignorare) e post di blog. E puoi vedere quali post ricevono traffico osservando i dati nella SEO Toolbar:Se ti imbatti in un post interessante in cui non sei già presente, tutto ciò che devi fare è trovare l’indirizzo e‑mail di chi gestisce il sito e inviare un’e-mail come questa:Ciao Tom,Mi chiamo Josh e sono il proprietario di Joshtique, un boutique hotel a Shoreditch. Ho visto la tua lista dei migliori boutique hotel di Londra e sono rimasto deluso nel vedere che non siamo stati inclusi.Non preoccuparti, è comprensibile dato che abbiamo aperto solo un paio di mesi fa. 🙂Se ti interessa, mi piacerebbe che tu venissi a trascorrere una notte nel nostro hotel in modo da poter verificare se siamo adeguati per essere inclusi nel tuo elenco. Nessun obbligo, ovviamente.Ecco un’anteprima delle nostre camere: [Link]Fammi sapere se la nostra offerta ti interessa!8. Mantieni il tuo sito in ottime condizioniAvere un sito poco curato può generare molti problemi SEO. Questo vale sia per la SEO locale che nazionale e internazionale. Se Google non riesce a trovare, scansionare, comprendere e indicizzare i tuoi contenuti in modo efficiente, vuol dire che hai dei problemi.Puoi tenere d’occhio la salute del tuo sito utilizzando lo strumento Site Audit di Ahrefs, che ti permette di pianificare ed eseguire regolarmente la scansione del tuo sito per individuare oltre 100 problemi. Soprattutto, puoi usarlo gratuitamente per i tuoi siti iscrivendoti all’Ahrefs Webmaster Tools.Qui ci sono solo alcuni errori che controlla quando esegue la scansione:Pagine non funzionanti (4XX)Titoli mancanti o vuotiLink esterni non funzionantiPagine orfane (ovvero, pagine senza (link interni)Puoi visualizzare un elenco completo di errori e problemi che interessano il tuo sito nella Panoramica che ti mostra anche le modifiche tra le varie scansioni in modo da poter vedere quali problemi stanno migliorando o peggiorando:Su questa dashboard puoi anche vedere il punteggio del tuo sito in termine di “salute” e questo è utile per tenere d’occhio lo stato di salute del tuo sito nel tempo senza la necessità di approfondire tramite il Site Audit:ConclusioniLa parte più importante della Local SEO è probabilmente rivendicare, ottimizzare e attirare recensioni per il tuo profilo Google Business. In questo modo puoi ottenere maggiore visibilità dai risultati complessivi di Google. Il posizionamento più alto nei risultati organici “normali” di Google riguarda più la SEO “tradizionale”: puntare alle giuste keywords, lavorare sulla SEO on-page e ottenere backling geolocalizzatiVuoi saperne di più? Leggi la nostra guida alla local SEO per principianti.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Local SEO: 8 Consigli Per Posizionarsi A Livello Locale"
    },
    {
      "level": "H2",
      "text": "1. Richiedi e ottimizza il tuo profilo su Google Business"
    },
    {
      "level": "H2",
      "text": "2. Cerca parole chiave geolocalizzate"
    },
    {
      "level": "H2",
      "text": "3. Ottimizza le landing page locali"
    },
    {
      "level": "H2",
      "text": "4. Ottieni citazioni e link geolocalizzati"
    },
    {
      "level": "H2",
      "text": "5. Recupera i link persi"
    },
    {
      "level": "H2",
      "text": "6. Ottieni più recensioni"
    },
    {
      "level": "H2",
      "text": "7. Fatti inserire nelle liste geolocalizzate"
    },
    {
      "level": "H2",
      "text": "8. Mantieni il tuo sito in ottime condizioni"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}