{
  "url": "https://ahrefs.com/blog/it/marketing-101/",
  "slug": "marketing-101",
  "title": "Marketing 101: Le Basi Da Conoscere",
  "description": "Introduzione al marketing per piccole imprese, imprenditori singoli e professionisti del marketing principianti. Tutto in meno di 15 minuti.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti Questo articolo è un’introduzione al marketing per piccole imprese, imprenditori singoli e professionisti del marketing principianti. Il nostro obiettivo è aiutarti a comprendere i concetti chiave del marketing senza confonderti con inutili termini tecnici.Questa guida è ricca di informazioni ma tieni presente che tratteremo gli argomenti in superficie. Per questo, clicca sui link ad altri articoli per approfondire ulteriormente gli argomenti che ti interessano di più.Ma prima, ecco di cosa parleremo:Cosa si intende per marketing?Perché il marketing è importante?Le quattro P del marketingIl funnel di marketingTipi di marketingTre consigli pratici da AhrefsCosa si intende per marketing?Ecco come l’American Marketing Association (che rivede la definizione ogni tre anni in modo che sia sempre aggiornata) definisce il marketing:Il marketing è l’attività, l’insieme di istituzioni e i processi per creare, comunicare, fornire e scambiare offerte che hanno valore per utenti, clienti, partner e la società in generale.Se questa definizione sembra complessa, eccone il succo. Ciò che questa definizione sta cercando di dirci è che il marketing non riguarda solo la promozione di qualcosa, ma riguarda anche la creazione di prodotti e servizi desiderabili e la loro distribuzione in modo da aumentarne l’attrattiva.Perché il marketing è importante?Le aziende trasferiscono (vendono) beni o servizi ai clienti in cambio di valore (denaro). Sembra facile. Ma ecco cosa può andare storto per un’azienda:Il cliente potrebbe non essere a conoscenza del prodotto/servizio;Anche se lo conosce, potrebbe non avere il desiderio di usarlo/acquistarlo;Anche se lo conosce e lo desidera, potrebbe scegliere di acquistarlo da un’altra attività;Anche se un’azienda riesce a completare tutti i passaggi per trasferire i propri beni, il cliente potrebbe non essere abbastanza soddisfatto da tornare, acquistare di nuovo o consigliare l’attività ad altri.Il marketing è una pratica aziendale pensata per affrontare tutti questi problemi, tra cui generare consapevolezza generando desiderio, fidelizzare i clienti e incoraggiare il passaparola. In altre parole, poiché il marketing connette l’azienda con i suoi clienti, non ci possono essere vendite senza marketing.Le quattro P del marketingQuindi ora sappiamo cos’è il marketing e perché è importante. Ma cosa fa effettivamente il marketing? Quali sono i ruoli principali o le aree chiave del marketing?Per decenni, gli esperti di marketing hanno risposto a queste domande utilizzando le 4 P del marketing:Prodotto: cosa vendiPrezzo: a quanto vendiPosto: dove vendiPromozione: come trovi clientiVediamole nello specificoProdottoUno dei ruoli del marketing è la co-creazione del prodotto. In effetti, è qui che inizia tutto il marketing.Il processo di sviluppo prodotto deve tenere in considerazione le condizioni del mercato. Cose come chi è il cliente, quali caratteristiche del prodotto sono richieste dal mercato, chi sono i concorrenti e come fare meglio di questi concorrenti. Possiamo rispondere a queste e altre domande simili durante la ricerca di mercato.Scoprire cosa costruire è una fase critica nel marketing e negli affari. Questo perché è praticamente impossibile commercializzare efficacemente un prodotto che non si adatta al mercato. Al contrario, un prodotto in grado di soddisfare una domanda esistente in un mercato promettente non ha bisogno di tattiche di marketing complicate o invadenti.Per farti un’idea, ecco come Ahrefs (il nostro prodotto) risponde ad alcune domande di marketing fondamentali:PrezzoUn buon prezzo è quello che il tuo pubblico di destinazione può permettersi e rende redditizia la tua attività. Ovviamente è più facile a dirsi che a farsi. Ma il marketing è qui per aiutare.Fissare un prezzo in maniera arbitraria raramente è una buona idea. Esistono vari modi in cui gli esperti di marketing possono informare le decisioni esecutive sulla base di approfondimenti di mercato. Eccone alcuni:Utilizza un sondaggio o interviste coinvolgendo il tuo target di riferimento. In questo modo puoi capire quale prezzo farà dubitare le persone e quale è considerato eccessivo;Controlla ciò che fanno i tuoi concorrenti, ovvero fai benchmarking. Se imposti un prezzo simile a quello dei tuoi concorrenti che stanno già guadagnando, è probabile che nel tuo mercato di riferimento il tuo modello di prezzo funzionerà;Aggiusta il prezzo puntando sull’effetto psicologico, ovvero pensa a cosa il prezzo comunicherà ai tuoi futuri clienti. Assicurati di non offrire meno vantaggi dei tuoi concorrenti allo stesso prezzo. O peggio ancora, meno vantaggi a un prezzo più alto. Su una tipica matrice di proposte di valore, le migliori opzioni sono quelle evidenziate in verde:PostoCome e dove i clienti acquisteranno un prodotto o servizio, ad esempio il posto/luogo, è un altro fattore che influenza il marketing (questo accade anche prima di andare a parlare delle tattiche di promozione).Qui, la ricerca di mercato offre approfondimenti su informazioni importanti tra cui le abitudini di acquisto dei clienti e i canali di vendita dei concorrenti, per determinare il modello di distribuzione ottimale.Hai mai pensato perché alcuni prodotti non sono direttamente disponibili sul sito di un produttore? O perché alcuni tipi di software sono disponibili sia in versione digitale che fisica mentre altri no? Non è una coincidenza. Questo è marketing.Ecco una rapida carrellata di alcuni modelli di distribuzione popolari tra cui i marketer possono scegliere:PromozioneSolo dopo aver stabilito solide basi per quel che riguarda prodotto, prezzo e luogo, gli esperti di marketing possono concentrarsi sulla promozione. Si tratta delle tattiche utilizzate per raggiungere il pubblico di destinazione con un messaggio. Pensa alla pubblicità, alla creazione di post sul blog, ai social media, all’e-mail marketing, ecc.I marketer sono solitamente associati alle attività di quest’area del marketing, e questa “immagine” non è sbagliata. Una volta che le componenti strategiche del marketing sono a posto, gli esperti di marketing trascorrono la maggior parte del loro tempo lavorando per promuovere ciò che le loro aziende hanno da offrire.Quando si pianificano le tattiche per la promozione di un prodotto/servizio, gli esperti di marketing devono sapere alcune cose:Chi stanno cercando di raggiungere?Quale canale di marketing può funzionare al meglio?Qual è il tipico percorso di acquisto dei potenziali clienti?Di che budget e di che professionisti hanno bisogno per raggiungere i loro obiettivi?Ad esempio, la tattica di marketing principale di Ahrefs è il content marketing. Abbiamo scelto di puntare su questo tipo di marketing perché:Molte persone cercano su Google soluzioni ai problemi che il nostro prodotto può risolvere. Quindi, se creiamo contenuti che si posizionano abbastanza in alto, le persone possono trovarci tramite Google e scoprire il nostro prodotto (parleremo di più dei contenuti basati sui prodotti nell’ultima sezione di questo articolo);Se creiamo contenuti che si posizionano usando il nostro strumento come esempio concreto, possiamo inviare un messaggio autentico sulla qualità del nostro prodotto e sull’esperienza delle persone che lo creano.Nei prossimi paragrafi ci concentreremo sulla parte promozionale del marketing. Ma se vuoi saperne di più sulle quattro P del marketing, dai un’occhiata a questa guida.Cominciamo.Il funnel di marketingIl marketing è un processo. I professionisti del marketing sanno bene che i visitatori non diventano immediatamente clienti, almeno non in tutte le situazioni. E su questo gli esperti di marketing sono tutti d’accordo. Anzi, ne tengono conto e sviluppano un “percorso” per convincere gradualmente le persone.È probabile che nessun altro concetto di marketing trasmetta questo concetto meglio del funnel di marketing.Il funnel di marketing è un sistema progettato per attirare clienti (o utenti) verso un’azienda per poi convertirli. Gradualmente.Un tipico funnel di marketing consiste in diverse fasi di conversione dei visitatori prima in contatti, poi in clienti e in seguito, eventualmente, in sostenitori del marchio.Analizziamo queste due tattiche, per esempio.Un articolo su come fare ricerca di parole chiave per la SEO è probabile che generi visite da query di ricerca relative all’argomento, per esempio “analisi delle parole chiave SEO” o “come eseguire ricerche per parole chiave” (nello screenshot sotto l’analisi in inglese). Ciò significa che questo contenuto è un buon modo per generare consapevolezza e interesse nei confronto del nostro brand e prodotto, poiché le persone che cercano su Google questi termini non hanno bisogno di avere informazioni su di noi.Dall’altro lato, consideriamo una pagina che confronta Ahrefs ad alcuni dei suoi concorrenti. Dal momento che sarà per lo più visitata da persone che già conoscono il nostro prodotto e sono molto probabilmente alla ricerca di uno strumento SEO, questa è una tattica adeguata per la fase del funnel di marketing chiamata della Considerazione.L’altro aspetto importante del modello di funnel di marketing è che il marketing come processo non finisce dopo che qualcuno ha acquistato un prodotto/servizio; se vuoi che i tuoi clienti tornino e facciano acquisti ripetuti, è una buona idea coinvolgere le persone dopo la fase di “acquisto”.Uno dei modi per raggiungere questo obiettivo è inviare una newsletter regolare ai tuoi contatti. Datacamp, una piattaforma dove imparare a programmare, mira a mantenere coinvolti i suoi utenti inviando e‑mail regolari che contengono un promemoria “obiettivo settimanale” e un elenco curato di risorse. Ecco un estratto di una delle loro e‑mail:Ulteriori approfondimentiMarketing Funnel per Principianti: La Guida Completa Tipologie di marketingIl marketing è una sfida aziendale che ha più di una soluzione. Queste diverse soluzioni sono anche conosciute come tipologie di marketing. E non sono segreti da tutelare perché le aziende copiano e mescolano queste tipologie di continuo. La chiave sta nello scegliere la combinazione ottimale e usarla correttamente. Diamo un’occhiata ad alcuni esempi.Marketing B2B e B2CQuesti acronimi indicano rispettivamente marketing business-to-business e marketing business-to-consumer.Gli esperti di marketing spesso differenziano queste soluzioni perché alcune tattiche sono più efficaci per il marketing per le aziende e altre per il marketing per i consumatori. Anche lo stile dei messaggi è diverso.Qui abbiamo un esempio di account-based marketing: un’azienda utilizza le e‑mail per promuovere una nuova funzionalità del prodotto. Le e‑mail sono accuratamente mirate, inviate solo agli account che molto probabilmente trarranno vantaggio dalla nuova funzionalità. Invece di esortare i potenziali clienti ad “acquistare ora”, il messaggio è un caso di studio che tratta una soluzione ad un problema aziendale.Sotto abbiamo invece una tattica spesso utilizzata nel marketing B2C: l’influencer marketing. In questo esempio, un’influencer con 21.5K follower su Instagram pubblicizza un’azienda di consegne di cibo sulla sua pagina. È un messaggio semplice ma potente: se quella compagnia fa bene a me, probabilmente fa bene anche a te. Ecco una manciata di sconti in modo che tu possa utilizzarla immediatamente.Inbound e outbound marketingUn altro paio di tipologie di marketing che possono essere utilizzate per descrivere la maggior parte delle tattiche di marketing sono l’inbound e l’outbound marketing. Il primo consiste “nell’attirare il cliente”, ad esempio fornendo contenuti utili al potenziale cliente quando è pronto. L’outbound invece consiste nello spingere un’offerta verso un cliente con un messaggio che “interrompe”, come la pubblicità.Ad esempio, quando miriamo ad attirare nuovi visitatori con un articolo sull’e‑mail di outreach, stiamo facendo inbound marketing (se le persone accedono all’articolo da motore di ricerca).Ma quando lanciamo una campagna PPC con annunci che promuovono lo stesso articolo, stiamo facendo outbound marketing dal momento che stiamo contattando potenziali clienti che potrebbero non essere necessariamente interessati a noi o pronti a saperne di più.Content marketingContent marketing è il processo di creazione e distribuzione di contenuti per attrarre e fidelizzare i clienti. Per contenuto intendo post per blog, podcast, video, infografiche, ebook, ecc.La promozione attraverso il content marketing di solito implica la soddisfazione del bisogno di un potenziale cliente (come il bisogno di risolvere un problema sul lavoro, il bisogno di intrattenimento, ecc.) dando allo stesso tempo visibilità al prodotto o al brand.Ad esempio, Trader Joe’s (una catena di negozi di alimentari statunitense) ha trovato un modo per offrire contenuti utili e divertenti su prodotti di uso quotidiano che gli acquirenti possono trovare sui suoi scaffali. E lo sta facendo in diversi modi:Trader Joe’s genera regolarmente tre tipi di contenuti nel catalogo Fearless Flyer, che viene distribuito anche in versione cartacea.Quindi, non solo fa un passo in più dando informazioni sui prodotti all’interno di pagine ben disegnate, ma offre anche spunti di ispirazione su cosa fare con quei prodotti:Mentre condivide ricette per pasti deliziosi, Trader Joe’s promuove anche i suoi prodotti.Dai un’occhiata a questa immagine utilizzata in uno dei post sul blog intitolato “Take a Dip Into the New Year” (in inglese). I personaggi principali sono due normali vasetti di olive. Ma mostrandole nel contesto di una deliziosa salsa alle olive (c’è anche una ricetta per prepararla), le olive ora sembrano ancora più gustose per i potenziali clienti.Attraverso il content marketing, Trader Joe’s sta trasformando la monotona spesa in un viaggio colorato, divertente e appetitoso che migliora con ogni prodotto che gli acquirenti mettono nel carrello.Il contenuto di Trader Joe è un esempio di contenuto basato sul prodotto, di cui parleremo più avanti.E‑mail e social media marketingE‑mail e social media, sebbene abbastanza diversi tra loro, condividono un’idea simile per quel che riguarda il marketing: raccogliere un pubblico e utilizzare un canale di marketing di proprietà per inviare messaggi diretti.Ad esempio, ecco lo stesso messaggio distribuito in due modi diversi. Uno è contenuto in una newsletter inviata ai nostri abbonati e‑mail; il secondo è un tweet per i nostri follower su Twitter.66 Content Marketing Statistics for 2022 by @m_makosiewiczHello, 2022! To mark the new year, we’ve rounded up some interesting content marketing statistics worth diving into. 📝https://t.co/BJcisVORR6— Ahrefs (@ahrefs) January 3, 2022Vedi come diverse tipologie di marketing si combinano in questo caso? C’è il content marketing (l’articolo con le statistiche) mescolato con l’e-mail marketing; c’è anche il content marketing mescolato con il social media marketing. Combinandoli, possiamo raggiungere più persone con i nostri articoli invece di pubblicarli solo sul nostro blog.Growth marketingL’ultimo tipo di marketing di cui voglio parlare è un’aggiunta piuttosto nuova alla “famiglia”. Growth marketing è il processo che permette l’aumento delle entrate di un’azienda applicando un approccio basato sulla sperimentazione e integrato che tiene conto di tutte le fasi in cui i clienti vanno attratti.Quindi, invece di copiare semplicemente ciò che funziona per altri esperti di marketing o concentrarsi su un canale di marketing, i growth marketer escogitano ipotesi e le verificano attraverso dati provenienti da esperimenti di marketing. Pertanto, il growth marketing deve essere aperto a qualsiasi tipo di marketing e a tutti i canali, purché funzionino e ci siano dati che lo dimostrino.Ciò che è peculiare è che il growth marketing, a differenza di alcune teorie di marketing più tradizionali, non attrae solo le persone verso un’azienda ma mira a prendersi cura dell’intero funnel di marketing. Quindi, a un certo punto, un growth marketer potrebbe ottimizzare gli annunci su LinkedIn. In un altro momento, potrebbe trasformare il feedback dei clienti in idee per sviluppare caratteristiche specifiche nel prodotto.Dai un’occhiata all’esempio di seguito per vedere come il growth marketing può essere diverso dalle tipologie che abbiamo visto sopra. Questo modello mostra un ciclo di crescita che funziona per Notion, un’app di produttività: ogni nuovo utente è un’opportunità per attirare (e/o trattenere) un altro utente senza che l’azienda debba sostenere costi aggiuntivi o intraprendere ulteriori azioni.3 consigli di marketing pratici da un’azienda a 8 zeriTutto ciò di cui abbiamo discusso finora potrebbe sembrare solo teoria. Ma la realtà è che queste tecniche e tattiche funzionano davvero. Ecco come l’applicazione di alcuni dei principi di cui sopra ha aiutato Ahrefs a diventare un’azienda di successo con entrate ricorrenti annuali (ARR) a otto cifre.1. Il marketing si basa sul prodotto più di ogni altra cosaL’efficacia del marketing dipende da molti fattori, ad esempio il budget, quanto un’azienda si distingue dalla concorrenza e se l’azienda si rivolge al pubblico giusto. Ma, soprattutto, il marketing si basa sul suo fondamento che, se ricordi dalle quattro P del marketing, è il prodotto.Ecco perché:Il marketing non può promuovere efficacemente qualcosa che il prodotto non offre, ovvero deve essere basato su ciò che il prodotto offre veramente;Il marketing dovrebbe generare clienti. Ma il messaggio che il marketing crea non è l’unico fattore che un potenziale cliente prende in considerazione. Il marketing può indirizzare qualcuno verso un prodotto. Ma molto probabilmente la decisione finale della persona dipenderà dalla funzionalità e dal prezzo di quel prodotto;Le persone non devono fidarsi del marketing per conoscere e scoprire un prodotto. Prima di acquistare qualsiasi cosa, possono controllare le recensioni dei prodotti o vedere cosa dicono gli altri sui social media. Questo si ricollega all’importanza di avere un buon prodotto.In Ahrefs, ci siamo assicurati che il nostro prodotto fosse adatto al mercato prima di assumere il primo marketer a tempo pieno. All’epoca il prodotto crebbe molto grazie al passaparola di clienti soddisfatti e persone che lasciarono recensioni positive. Oggi il passaparola è uno dei nostri primi tre canali di acquisizione di clienti.Solo uno dei tanti sondaggi in cui le persone votano per il nostro prodotto. Fonte: SEO Signals Lab.Il nostro product-market fit ci permette anche di investire con sicurezza nel content marketing. Questo ci porta al punto successivo.2. Crea contenuti guidati dal prodotto per la SEOCreare contenuti guidati dal prodotto significa trasformare il tuo prodotto in consigli concreti per il tuo pubblico.Considera la scala seguente, che usiamo per classificare le idee sugli argomenti. Il contenuto guidato dal prodotto è fondamentalmente il contenuto che ottiene almeno un “1” su quella scala:In generale, non c’è niente di sbagliato nei contenuti non di prodotto, in quanto prendono in considerazione argomenti con un notevole potenziale di traffico. Ma preferiamo attenerci ai contenuti in cui possiamo presentare il nostro prodotto perché:Possiamo naturalmente mostrare il nostro prodotto in ogni contenuto: come appare, come funziona e per cosa può essere utilizzato. E possiamo fare tutto questo in un contesto familiare al lettore;Questo tipo di contenuto può servire a più scopi nell’ambito del funnel di marketing. Lo stesso articolo può essere un modo efficace per attirare visitatori e fidelizzare i clienti.E infine, creare contenuti guidati dal prodotto per la SEO significa sviluppare contenuti che tengono conto della ricerca organica come il principale canale di distribuzione. Nel gergo del marketing, il tipo di contenuto progettato per posizionarsi sui motori di ricerca e attirare utenti dalle pagine dei motori di ricerca è chiamato Contenuto SEO.Questo tipo di contenuto ha molti vantaggi. Ma per farla breve, eccone due principali:I contenuti SEO generano traffico quasi gratuito, coerente e passivo dai motori di ricerca;È probabile che chi cerca voglia saperne di più, poiché il contenuto risponde alle loro query di ricerca.Vediamo i risultati di questa tattica: attualmente, il contenuto del nostro blog da solo genera oltre 340.000 visite organiche ogni mese. Se volessimo generare la stessa quantità di traffico attraverso annunci a pagamento, dovremmo spendere quasi $540.000 ogni mese.Dati estratti tramite il Site Explorer di Ahrefs.3. Sperimenta, misura e riutilizza ciò che funzionaCome avrai notato, in Ahrefs ci atteniamo principalmente al marketing dei contenuti. Ma ciò non significa che non facciamo altri tipi di marketing. Infatti sperimentiamo ogni volta che abbiamo la possibilità di imparare qualcosa di nuovo o migliorare qualcosa utilizzando tattiche che sono già usate comunemente.Ecco perché questo approccio è importante:Ciò che funziona per alcuni potrebbe non funzionare per altri: non solo è saggio prendere qualsiasi consiglio di marketing con le pinze, ma è anche importante testare le cose in autonomia;È difficile fare le cose per bene al primo colpo e probabilmente non dovresti provarci. Un processo iterativo per raggiungere i tuoi obiettivi di marketing è spesso l’approccio migliore;Provare qualcosa è spesso il modo migliore per risolvere i problemi, invece di avere discussioni teoriche con i tuoi colleghi.Ma qualunque cosa tu faccia, è fondamentale misurare il risultato. Proprio come dice il vecchio proverbio aziendale: ciò che non può essere misurato non può essere migliorato. Diamo un’occhiata al grafico sottostante che mostra il traffico organico di uno dei nostri post sul blog. Se non avessimo misurato le prestazioni del post, non avremmo potuto rinfrescarlo per migliorarlo. Di conseguenza, avremmo perso molto traffico.Il resto del processo è piuttosto semplice. Se funziona, inizia a farlo regolarmente. E se funziona a lungo termine, fallo ancora di più.È una regola semplice ma a volte viene trascurata. Chi si occupa di marketing tende a distrarsi da ciò che è importante per seguire le ultime mode e dalla necessità di raggiungere quei KPI su base giornaliera.ConclusioniRiassumiamo rapidamente ciò di cui abbiamo discusso in questo articolo. Innanzitutto, contrariamente a ciò che si crede, il marketing non riguarda solo la promozione di un prodotto. Si tratta anche di co-creare il prodotto sulla base di ricerche di mercato e feedback che arrivano dagli utenti.In secondo luogo, il marketing è in genere un processo che collega il pubblico giusto con il giusto tipo di prodotto, una sorta di “agenzia matrimoniale”. Non si limita a convertire un visitatore in cliente. Alcune tattiche di marketing ti permetteranno di trattenere i tuoi clienti, incoraggiarli a tornare e a consigliare la tua attività ad altri.Infine, non esiste una soluzione perfetta nel marketing. Esistono diversi tipologie di marketing da provare per capire cosa sai fare meglio e cosa ti porta i risultati migliori. A questo proposito, speriamo che le tre cose semplici ma potenti che hanno funzionato per Ahrefs ti siano di ispirazione.Quindi quali sono i prossimi passi? Se hai bisogno di un piano che guidi i tuoi sforzi di marketing, significa che hai bisogno di una strategia di marketing. Bene, puoi imparare a crearla grazie a questa guida in 5 passaggi. E se vuoi semplificare il tuo processo di apprendimento, dai un’occhiata a questi 17 Corsi di Marketing Online Gratuiti.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing 101: Le Basi Da Conoscere"
    },
    {
      "level": "H2",
      "text": "Cosa si intende per marketing?"
    },
    {
      "level": "H2",
      "text": "Perché il marketing è importante?"
    },
    {
      "level": "H2",
      "text": "Le quattro P del marketing"
    },
    {
      "level": "H3",
      "text": "Prodotto"
    },
    {
      "level": "H3",
      "text": "Prezzo"
    },
    {
      "level": "H3",
      "text": "Posto"
    },
    {
      "level": "H3",
      "text": "Promozione"
    },
    {
      "level": "H2",
      "text": "Il funnel di marketing"
    },
    {
      "level": "H2",
      "text": "Tipologie di marketing"
    },
    {
      "level": "H3",
      "text": "Marketing B2B e B2C"
    },
    {
      "level": "H3",
      "text": "Inbound e outbound marketing"
    },
    {
      "level": "H3",
      "text": "Content marketing"
    },
    {
      "level": "H3",
      "text": "E‑mail e social media marketing"
    },
    {
      "level": "H3",
      "text": "Growth marketing"
    },
    {
      "level": "H2",
      "text": "3 consigli di marketing pratici da un’azienda a 8 zeri"
    },
    {
      "level": "H3",
      "text": "1. Il marketing si basa sul prodotto più di ogni altra cosa"
    },
    {
      "level": "H3",
      "text": "2. Crea contenuti guidati dal prodotto per la SEO"
    },
    {
      "level": "H3",
      "text": "3. Sperimenta, misura e riutilizza ciò che funziona"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Mateusz Makosiewicz"
}