{
  "url": "https://ahrefs.com/blog/it/meta-description/",
  "slug": "meta-description",
  "title": "Come Scrivere la Meta Description Perfetta",
  "description": "La meta description è un attributo HTML che descrive il contenuto di una pagina. Questa può apparire nei risultati di ricerca al di sotto del titolo.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti La meta description è un attributo HTML utilizzato per descrivere il contenuto di una pagina. Può comparire fra i risultati di ricerca come anteprima al di sotto del titolo, per fornire informazioni aggiuntive.Ecco la porzione di codice utilizzata per rappresentarla:<meta name= \"description\" content= \"Site Explorer runs on a huge database of 12 trillion links and 402 million tracked keywords to give you the most complete SEO data about any website or URL.\">Anche se la meta description non è di per sé un fattore di ranking e Google la mostra nei risultati di ricerca solamente il 62.78% delle volte, è comunque parte della SEO on-page, materia a cui spesso chi pubblica articoli viene incontro.In questa guida imparerai come creare velocemente delle meta description fantastiche, e come fare un audit di quelle già presenti.Prima però ci tengo a spiegare perché la meta description è importante, nonostante spesso venga snobbata nel mondo della SEO.Perchè le meta description sono importantiCome scrivere una meta descriptionCome dare priorità al processo di scrittura ed editing delle meta descriptionAlcuni fantastici esempi di meta descriptionPerchè le meta description sono importantiAvere una meta description intrigante motiva più persone a fare click sul tuo sito quando si trovano di fronte ai risultati di ricerca. Questo è molto importante, nonostante Google mostri le meta description solo il 37% delle volte.Ad esempio, se la tua pagina ottiene 50,000 impression ogni mese, Google, in media, mostra la meta description solamente a 18,500 di queste. Migliorare il tuo CTR dal 4% al 4.5% in questo caso, significherebbe portare al tuo sito quasi 100 click in più.Di conseguenza, anche se non devi diventare ossessionato con le meta description, vale comunque la pena passare un minuto del tuo tempo a scriverne una per tutte quelle pagine che rispondono “si” ad almeno una di queste domande:La pagina è pensata per portare visite organiche sul sito?È probabile che questa venga condivisa sui social?La seconda domanda merita un pò più di contesto.Devi sapere che quando una pagina viene pubblicata sui social network, questi estrapolano la descrizione visualizzata dai meta tag Open Graph.Se però non hai impostato una descrizione OG o una specifica per Twitter, sarà la meta description ad essere visualizzata. Di conseguenza se vuoi impegnarti solamente su una di queste due cose, la meta description è sicuramente la scelta più azzeccata.Ora torniamo a noi e al processo di scrittura….Come scrivere una meta descriptionSegui questi 5 step per creare la tua meta description in pochi e semplici passi:Espandi il titolo della paginaFalla combaciare all’intento di ricercaUtilizza la forma attivaSii concisoImplementa e rilascia la meta descriptionCominciamo.1. Espandi il titolo della paginaPensa sempre alla descrizione come un qualcosa che completa il titolo della pagina.I titoli dovrebbero descrivere la pagina utilizzando le principali parole chiave che la caratterizzano. La meta description offre l’opportunità di espandere quest’ultime.Nel caso qui sopra ad esempio, la descrizione, nonostante sia piuttosto breve, motiva gli utenti a cliccare sul nostro tool per cercare i link rotti perchè:Controlla pagine ed interi sitiConsidera sia i link interni che quelli esterniIl tool è particolarmente veloceNon è una trappola per la lead generation; puoi utilizzarlo senza registrazione.Non preoccuparti di forzare le parole chiave, è più importante creare qualcosa che si connetta con il lettore e lo faccia cliccare.Utilizza la tua USP dove possibile.2. Falla combaciare con il search intentIl search intent è il “perchè” dietro una determinata ricerca. In altre parole, cosa vogliono trovare la maggior parte delle persone quando cercano la tua parola chiave principale?Vogliono avere delle informazioni?Vogliono acquistare qualcosa?Stanno cercando uno specifico sito?Vogliono una breve risposta ad una domanda?Puoi buttare un occhio ai risultati di ricerca per capire il contesto. Google infatti si sforza sempre di fornire i risultati più rilevanti ad una determinata ricerca; cerca quindi le affinità più evidenti fra le anteprime delle pagine meglio posizionate.Ad esempio, praticamente ogni risultato per “meta description” mostra una definizione all’interno dell’anteprima….…quindi faremo questo anche noi.Altre SERP potrebbero non essere così immediate da comprendere, ma puoi sempre ottenere degli indizi. Ad esempio proviamo con “how to tie a tie” (in italiano “come fare il nodo alla cravatta”):Tutte le anteprime parlano dei differenti tipi di nodi, e la maggior parte specifica anche la presenza di istruzioni passo passo. Questo ci dice che ciò è probabilmente molto importante per chi ricerca queste informazioni e vale quindi la pena includerle all’interno della meta description.Presta solo attenzione agli intenti di ricerca misti come quello per “standing desk” (le popolari scrivanie che permettono di lavorare anche in piedi):Puoi infatti notare come in questo caso ci siano dei risultati misti. Alcuni sono post che recensiscono i migliori prodotti di questa categoria, altri sono invece pagine di negozi online.In casi come questo dovresti prendere ispirazione dagli snippet che si allineano maggiormente con il tipo di contenuto che stai per pubblicare. Se hai scritto un post che parla delle migliori standing desk, allora guarda ai risultati che trattano di recensioni e confronti. Se invece hai creato la categoria all’interno del tuo ecommerce, guarda questi ultimi.3. Utilizza la forma attivaLa forma attiva migliora la chiarezza e invoglia al click riferendosi direttamente alla persona che cerca e legge.Eccone un esempio:Puoi notare come la frase inizi con un verbo e pone chi ricerca come soggetto della stessa (in italiano: “Pratica il tuo inglese scritto gratuitamente con Cambridge English Write and Improve”)Ora invece dai uno sguardo a questoSe lo mettiamo a confronto con il primo esempio, questo è quasi demotivante. Questo perché è scritto in forma passiva (in italiano “Le abilità di scrittura in inglese vengono migliorate con il corso Bad English gratuitamente”).Nota a margine. Ho scritto io stesso questo esempio per rendere l’idea. Non si tratta di una descrizione reale. Chiaramente non è sempre possibile scrivere delle meta description in forma attiva. Esempio: le descrizioni che contengono una definizione. Come regola generale però, la forma passiva è solitamente un’eccezione.Puoi approfondire le differenze fra voce attiva e passiva qui.4. Sii concisoLe meta description non sono fatte per lo storytelling. Ogni singola parola ha il suo peso perché gli utenti impiegano pochissimo tempo a scegliere se fare click o no scorrendo velocemente la lista dei risultati. Bisogna inoltre tenere a mente che le description possono essere troncate.Al momento della scrittura, la lunghezza massima consentita è di 920px (~160 caratteri) sul desktop e 680px (~120 caratteri) da mobile. Il metodo migliore per assicurarsi di non andare oltre, è utilizzare un tool come questo, o un plugin WordPress per la SEO che offre tale funzionalità, come Yoast.Scegliere di ottimizzare principalmente per desktop o mobile dipende dalla tua audience. Se solitamente scrivi description più lunghe per gli utenti desktop, cerca di arrivare al punto entro i ¾ della lunghezza, in modo che anche se dovesse venir troncata gli utenti da mobile possono avere un senso del contenuto.Insomma, qual è il succo della questione? Cerca di essere conciso per gli utenti, non i motori di ricerca. Il limite di lunghezza è un buon segnale che aiuta a capire che potrebbero esserci parole non necessarie.5. Implementa e rilascia la meta descriptionSe utilizzi un CMS questo passaggio è davvero semplice. Wix, Shopify e la maggior parte di questi offrono uno specifico campo dove inserire o incollare la meta description all’interno del backend.Su WordPress invece, plugin come Yoast o RankMath aggiungono questa funzionalità.Se non utilizzi un CMS, incolla il tag relativo alla meta description all’interno della sezione <head> del codice HTML.RaccomandazioneSe aggiungi la meta description direttamente all’interno del codice, non inserire le virgolette all’interno della descrizione stessa, perchè rischi di generare degli errori. Al loro posto devi invece utilizza l’entità HTML &quot; in questo modo:<meta name=\"description\" content=\"Ecco come utilizzare le &quot;virgolette&quot; nella meta description.\">Se invece utilizzi le virgolette quando aggiungi la meta description tramite CMS o plugin, questi ultimi faranno tutto al tuo posto.Come dare priorità al processo di scrittura ed editing delle meta descriptionNon dovresti preoccuparti delle meta description solamente durante il processo di pubblicazione di un nuovo articolo. Potresti infatti avere già una serie di pagine che hanno una meta description non ottimizzata, o addirittura non averla proprio.Non c’è però motivo di fare un audit di tutto il sito alla ricerca di queste. Concentrati invece sulla pagine che ottengono più traffico. Queste sono proprio quelle dove avere una buona meta description può fare la differenza.Puoi trovare queste pagine all’interno del Webmaster Tool di Ahrefs. Crea un account gratuito, fai un crawl con il Site Audit e vai poi sul Page Explorer per applicare i seguenti filtri:Clicca poi sul tasto “Manage columns” e seleziona “Organic traffic”, “Meta description” e “Meta description length”:Infine, ordina le pagine in base al traffico organico che ricevono:In questo modo puoi vedere le meta description più importanti per il tuo sito. Vai alla ricerca di quelle non particolarmente ottimizzate o mancanti.Questo è il metodo preferito per fare un check delle meta description. Puoi anche verificare la presenza di meta description mancanti direttamente all’interno del report chiamato On-page:Clicca sul tasto “View affected URLs” per aprire il report e ordinare le pagine in base al traffico organico.Un audit semplice, non trovi? E se ora ti mostrassi un pò di contenuti da cui prendere ispirazione?Alcuni fantastici esempi di meta descriptionChiudiamo il discorso con un pò di esempi di meta description fatti ad-hoc su diverse tematiche e search intent.1. HealthlineLa maggior parte degli utenti in questo caso sta cercando una definizione, ed è quello che questa meta description fornisce. Invita poi l’utente a fare click per scoprire tutti i benefici della glicina. Semplice ed efficace.2. TimeOutMi aspettavo di trovare risultati misti di quartieri e hotel in questo caso, invece i risultati di ricerca sono principalmente focalizzati sulle aree di Praga. E questa description combacia perfettamente con questo intento. Offre una soluzione in maniera concisa, scorrevole e azionabile. Menzionare i “cinque migliori quartieri” fa capire agli utenti che non si troveranno di fronte ad un’enorme lista per la quale dovrebbero leggere righe e righe di testo.3. PatagoniaIn questo caso l’utente sta cercando dei saldi. Mi piace che sfruttino l’urgency all’inizio; sembra meno aggressiva di come solitamente i testi che sfruttano questa tecnica appaiono. Viene poi mostrato quello che l’utente cerca, per terminare con il tratto distintivo di Patagonia: supportare la sostenibilità e la conservazione delle specie.4. NordstromQuesto è l’epitome di una fantastica pagina di categoria per un ecommerce. È possibile che al suo interno Nordstrom fornisca una lista delle giacche e dei brand più ricercati. La spedizione gratis è probabilmente una USP in una SERP come questa, visto che solo un altro risultato ne approfitta oltre loro.5. ShopifyIl nostro ultimo esempio è una homepage.Questa è una categoria a parte perchè deve rispecchiare il tuo brand e quello che fai. Shopify fa proprio questo. È un messaggio piuttosto chiaro che ti invita a provare il loro servizio gratuitamente.La tua homepage è l’unica pagina dove consiglio di mettere più impegno e tempo quando si tratta di scrivere una meta description, perchè appare sempre per le query branded, le quali hanno un intento ben preciso. Proprio per questo motivo in casi come questi nelle SERP Google tende maggiormente a mostrare la meta description.ConclusioneLe meta description sono una delle prima tematiche che le persone affrontano quando si approcciano alla SEO. Fortunatamente sono anche uno degli argomenti più facili da capire e applicare, senza doverci passare sopra ore e ore.Per altri suggerimenti che possono aiutarti a fare la differenza nella SEO, dai uno sguardo a quella lista di consigli SEO da mettere subito in pratica.Domande? Scrivimi pure su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Come Scrivere la Meta Description Perfetta"
    },
    {
      "level": "H2",
      "text": "Perchè le meta description sono importanti"
    },
    {
      "level": "H2",
      "text": "Come scrivere una meta description"
    },
    {
      "level": "H3",
      "text": "1. Espandi il titolo della pagina"
    },
    {
      "level": "H3",
      "text": "2. Falla combaciare con il search intent"
    },
    {
      "level": "H3",
      "text": "3. Utilizza la forma attiva"
    },
    {
      "level": "H3",
      "text": "4. Sii conciso"
    },
    {
      "level": "H3",
      "text": "5. Implementa e rilascia la meta description"
    },
    {
      "level": "H2",
      "text": "Come dare priorità al processo di scrittura ed editing delle meta description"
    },
    {
      "level": "H2",
      "text": "Alcuni fantastici esempi di meta description"
    },
    {
      "level": "H3",
      "text": "1. Healthline"
    },
    {
      "level": "H3",
      "text": "2. TimeOut"
    },
    {
      "level": "H3",
      "text": "3. Patagonia"
    },
    {
      "level": "H3",
      "text": "4. Nordstrom"
    },
    {
      "level": "H3",
      "text": "5. Shopify"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Michal Pecánek"
}