{
  "url": "https://ahrefs.com/blog/it/metriche-marketing/",
  "slug": "metriche-marketing",
  "title": "25 Metriche di Marketing che Dovresti Tracciare",
  "description": "Scegli le giuste metriche di marketing, gestiscile nel tempo e concentrati sul far crescere il fatturato della tua azienda. Eccone 25 che dovresti prendere in considerazione.",
  "content": "Marc Thomas Head of Growth a Powered By Search, Agenzia di Marketing specializzata nel mercato Saas B2B. Scrive sul suo blog articoli che parlano di marketing e growth. Contenuti Molte metriche nel marketing non servono altro che a farti fare bella figura—motivo per il quale vengono spesso chiamate vanity metrics.Le vanity metrics non ti forniscono le informazioni di cui hai bisogno per prendere delle buone decisioni nella tua strategia di marketing, facendoti sprecare risorse dove non ha importanza per la tua azienda.È meglio quindi scegliere un piccolo ma significativo numero di metriche per ogni canale con il quale lavori e far sì che queste siano allineate ai tuoi obiettivi di fatturato.Ma quali metriche sono giuste per ogni canale di marketing e in che modo dovresti utilizzarle?Ecco 25 metriche di marketing che dovresti prendere in considerazione e tracciare:Metriche genericheMetriche legate alla retentionMetriche SEOMetriche per le sponsorizzazioniMetriche per le emailMetriche per i social mediaMetriche genericheAlcuni numeri — come quelli legati al fatturato — non fanno parte di uno specifico canale, ma sono importanti ad ampio spettro. Questi dovrebbero essere tracciati indipendentemente dai canali e le strategie di marketing che utilizzi.1. Crescita del fatturatoLa crescita del fatturato è la differenza fra due diversi fatturati. Ad esempio quello prima e dopo una campagna di marketing.Come si calcolaCrescita del fatturato (%) = ((Fatturato finale — Fatturato iniziale) / Fatturato iniziale) × 1002. Customer Acquisition Cost (CAC)Il CAC rappresenta l’ammontare di denaro che costa alla tua azienda acquisire un nuovo cliente. Più è basso, meglio è. È principalmente utilizzato in concomitanza con altre metriche come il lifetime value (ne parleremo più avanti) per calcolare quanto ti puoi permettere di spendere sull’acquisizione clienti in futuro.Come si calcolaCAC = Spesa totale del marketing / Numero di nuovi clienti acquisiti3. ConversioniUna conversione scatta quando un visitatore sul tuo sito compie un’azione che stai tracciando. Questo può includere iscrizioni, richieste di demo e acquisti. Tracciare le conversioni ti permette di vedere in quale punto del loro customer journey i tuoi clienti completano azioni importanti.Come si calcolaAll’interno di Google Analytics, puoi impostare gli Obiettivi e poi tracciare il tasso di conversione (la percentuale di persone che completa quell’azione) sul tuo sito. Nell’immagine sottostante, possiamo vedere su quali pagine i visitatori atterrano prima di acquistare un prodotto. Possiamo anche vedere tasso di conversione e il fatturato attribuito alle conversioni.4. Share of Voice (SOV)La Share of voice indica quanto tu sia visibile in confronto ai tuoi concorrenti.La quota di mercato e la share of voice sono molto legate fra di loro. Se hai un 20% di share of voice, verosimilmente avrai più o meno lo stesso ammontare di quota di mercato.Se la tua share of voice è maggiore della tua quota di mercato rispetto ai tuoi concorrenti, avrai un eccesso di share of voice (eSOV). Nel lungo termine, la tua quota di mercato dovrebbe rincorrere la share of voice, raggiungendone più o meno lo stesso livello.Questo significa che la SOV può essere utilizzata come indicatore di una crescita futura.Come si calcolaShare of voice = Visibilità del brand / Totale potenziale di visibilitàNon è molto pratico misurare la SOV simultaneamente su più canali, dovrai quindi calcolarla per ognuno di essi. Ecco come farlo per la ricerca organica:Crea un lista delle parole chiave per te importantiAggiungile al Rank TrackerVai nel report CompetitorsControlla la colonna chiamata VisibilityIn questo modo puoi vedere la percentuale di click che stai ottenendo per la parole chiave che tracci rispetto a quella dei tuoi concorrenti.Lettura consigliata: Cos’è la Share of Voice? Come Misurarla nei Diversi Canali5. Return on Investment (ROI)Il ROI misura l’impatto che una campagna o un canale hanno sul fatturato dell’azienda.Come si calcolaROI = (Fatturato attribuito alla spesa di marketing — Spesa sul marketing) / Spesa sul marketingPiù alto è il numero, migliore è il ROI.Il ROI è semplice da calcolare su alcuni canali come quello delle pubblicità a pagamento, dove i pixel riescono a tracciare efficacemente i journey che portano le persone da lead a clienti.Metriche legate alla retentionIl marketing non consiste solo nell’attirare nuovi clienti, ma anche nel trattenere quelli esistenti. Più a lungo trattieni un cliente, più profitto riuscirai a ottenere da questo.6. Churn rateIl churn rappresenta il tasso al quale un cliente smette di pagarti. Viene principalmente utilizzato nei software as a service (SaaS) che basano il loro business model sulle entrate ricorrenti.Come si calcolaChurn rate = (Fatturato perso in un periodo / Fatturato all’inizio del periodo) x 100Un churn rate alto potrebbe essere un indicatore di prodotti mal posizionati. Se i tuoi clienti eliminano i loro account perchè il tuo prodotto non fa quello che hai promesso, dovresti rivedere le tue pagine di vendita e migliorare la tua value proposition.7. Lifetime Value (LTV)Il LTV mostra quanto spende in media un cliente durante tutta la relazione che questo ha con la tua azienda.Nota a margine. Talvolta vengono utilizzate anche le sigle CLV o CLTV. Significano la stessa cosa. La ‘C’ sta per ‘customer’, che significa ‘cliente’.Come si calcolaPer un ecommerce: LTV = Valore medio dell’ordine x Valore medio della frequenza di acquisto annuale x Valore medio della durata della relazionePer calcolare l’LTV per un’azienda con un business model di tipo SaaS: LTV = Valore medio del fatturato mensile per cliente / Valore medio del churn rate mensileSe la tua azienda è nuova, potrebbe volerci un pò a calcolare il valore corretto del LTV, in quanto non sai ancora qual è il periodo medio per il quale un cliente resterà tale.8. LTV:CACLTV su CAC è un rapporto che ti indica quanto puoi spendere per acquisire un nuovo cliente.Ad esempio, se il tuo cliente ti paga in media $30, spenderne fino a $29,99 per acquisirlo sarebbe un successo. Ti ritroveresti però solo con 1 centesimo di profitto, che non è un gran margine.Come si calcolaNon esiste un rapporto che funziona per tutte le aziende, in quanto non esiste un ammontare specifico che dovresti spendere per acquisire un cliente. Questo valore tende a variare nel tempo, in base alla tipologia di azienda e al settore.9. Net Promoter Score (NPS)L’NPS è una metrica ampliamento utilizzata per misurare il livello di soddisfazione dei clienti. Clienti insoddisfatti spesso portano ad un punteggio basso, ed è probabile che questi abbandonino i tuoi prodotti in futuro.Come si calcolaNPS = Percentuale dei promotori — Percentuale di detrattoriUtilizzando una domanda molto definita all’interno di un sondaggio, l’NPS chiede: ‘Qual è la probabilità che tu possa consigliare {Nome Azienda} a un collega?’.Michal, qual è la probabilità che tu possa consigliare Revolut a un amico o collega?Il punteggio varia da 0 a 10. Chiunque assegni un punteggio da 0 a 6 è un detrattore, 7–9 neutrale e 9–10 sono promotori.L’NPS varia da ‑100 a 100, e un punteggio maggiore di 70 è considerato ‘di prima classe’.10. Repeat Purchase Rate (o Frequenza di Acquisto Ripetuto) Il Repeat Purchase Rate, rappresenta la percentuale di clienti che acquistano da te più di una volta.È ampiamente utilizzato negli ecommerce per prevedere quanto è efficace un’azienda a trattenere i suoi clienti.Come si calcolaRepeat Purchase Rate = Numero di clienti che hanno acquistato più di una volta / Numero totale dei clientiUn repeat purchase rate elevato mostra una buona retention, oltre a significare che puoi permetterti di spendere di più per acquisire nuovi clienti.Metriche SEOQuello della ricerca è un fantastico canale per la crescita della tua azienda. Ma è importante assicurarsi di essere sulla strada giusta, e che la strategia che stai utilizzando sia quella buona. Utilizza queste metriche SEO per tenere sott’occhio la crescita del traffico organico proveniente dalla ricerca.11. Traffico Organico Branded vs. non-Branded È sempre utile sapere quante persone raggiungono il tuo sito attraverso ricerche che contengono il nome della tua azienda o termini correlati (branded) contro tutto il resto (non-branded).Se la maggior parte delle persone ti trovano cercando il nome del tuo brand su Google, probabilmente ti stai perdendo molti clienti lungo la strada che stanno cercando una soluzione al loro problema.Come si calcolaPuoi stimare il rapporto fra traffico branded e non-branded utilizzando Google Search Console.Vai nella scheda chiamata Rendimento. Da lì, devi filtrare per termini branded il report che ti trovi di fronte. Per farlo, aggiungi il nome del tuo brand e le relative variazioni all’interno del campo chiamato query, selezionando la voce ‘query che contengono’. Clicca poi su Applica:Quando ha finito di aggiungere i filtri, prendi nota del numero di “Click Totali”. Questo è il tuo traffico branded.Poi cambia le impostazioni del filtro, selezionato ‘Query che non contengono’, e fai click nuovamente Applica. Salva di nuovo il numero di “Clic totali”.Questo ti da un’idea del tuo traffico branded contro quello non-branded.12. Menzioni del BrandLe menzioni del tuo brand mostrano quanto spesso esso sia utilizzato all’interno delle conversazioni nel settore.Quando una pagina web menziona la tua azienda o dei termini strettamente correlati ad essa, come i nomi dei dipendenti più conosciuti (in relazione al loro lavoro), hai ricevuto una menzione Brand.Come tracciarleSe vuoi ricevere un avviso quando qualcuno parla del tuo brand in futuro, puoi utilizzare Ahrefs Alerts.Dirigiti su Ahrefs AlertsClicca la scheda “Citazioni”Seleziona “Aggiungi notifica”Inserisci il nome del tuo brandScegli le lingueEscludi i domini che non vuoi tracciareSeleziona l’intervallo degli avvisiClicca “Aggiungi”13. Crescita dei backlinkI backlink sono link che portano da pagine presenti nel web verso quelle del tuo sito. Un buon profilo backlink aiuta a posizionarsi meglio nelle ricerche, portando traffico referral di qualità. Posizionarti per le parole chiave che i tuoi clienti cercano su internet ti aiuta ad acquisire nuovi utenti facendo scendere i costi nel tempo.Come si calcolaPuoi controllare la crescita dei domini referral all’interno del Site Explorer.Utilizza il report chiamato Migliore per crescita dei link, che mostra quali pagine hanno ottenuto o perso il maggior numero di backlink in un intervallo di 1,7, o 30 giorni.Metriche per le sponsorizzazioniFare sponsorizzazioni a caso ti farà bruciare i soldi investiti ad una velocità preoccupante.Invece di fare le cose a caso sperando in un colpo di fortuna, traccia queste metriche per assicurarti che la tua spesa sul traffico ti porti un buon ritorno.14. Punteggio QualitàGoogle Ads utilizza il Punteggio Qualità per stimare quanto un annuncio sia rilevante all’utente che ricerca.Come si calcolaGoogle lo calcola per te.Il punteggio Qualità si compone di tre fattori:CTR stimatoPertinenza dell’annuncio alla ricercaEsperienza sulla landing pageGli annunci con punteggi più elevati (su una scala da 1–10, dove dieci è il migliore) vincono migliori posizionamenti e pagano generalmente meno sulle aste.Essere a conoscenza di ciò può fornirti molti spunti per migliorare il tuo Punteggio Qualità, apportando cambiamenti alla tua landing page, targeting o modificando il copy dei tuoi annunci per renderlo più appetibile.15. Costo Per Click (CPC)Il Costo per Click è un numero che mostra il prezzo che paghi ogni volta che qualcuno fa click sul tuo annuncio.Come si calcolaCPC = Costo totale dei click / Numero totale dei clickIl Costo per Click varia molto in base alla parola chiave, ma puoi farti un’idea del costo medio all’interno del Keyword Explorer mentre esegui una ricerca parole chiave.È un numero molto utile, e ti permette di poter riflettere su eventuali strategie da utilizzare per campagne attuali o future.16. Costo Per ConversioneIl Costo per Conversione mostra quanto ti costa ottenere una conversione dai tuoi annunci.Come si calcolaCosto per Conversione = Spesa totale / Numero totale delle conversioniQuesto ti permette di decidere se si tratta di un buon utilizzo del tuo budget di marketing.17. Return on Ad Spend (ROAS)Il ROAS rappresenta il ritorno in euro sulla spesa per i tuoi annunci.Come si calcolaROAS = Valore totale delle conversioni / Spesa totaleIl ROAS è simile al Costo per Conversione, ma è strettamente legato alle conversioni che portano un valore monetario. Il Costo per Conversione invece le include tutte, come ad esempio quelle relative al ‘download di un PDF’.18. Conversioni view-through Le conversioni view-through sono quelle che accadono quando un cliente vede l’annuncio, non interagisce, ma poi completa una conversione sul tuo sito in un secondo momento.Come si calcolanoLe reti di annunci sanno come attribuire le conversioni ai click e alle visualizzazioni, in quanto ti richiedono di installare un codice di monitoraggio (o pixel) sul tuo sito prima di lanciare le campagne.Il codice di monitoraggio raccoglie informazioni sulle persone che visitano il sito, incluso da dove queste provengono.Ad esempio, se un utente vede il tuo annuncio, lo ignora e visita il sito a distanza di 30 giorni per compiere un acquisto, una conversione view-through verrà aggiunta ai tuoi report.Se il tuo ciclo di vendita è superiore ai 30 giorni, potresti dover impostare la finestra di conversione delle tua campagne ad un intervallo di tempo adeguato al tuo tipo di business.Metriche per le emailAl contrario della ricerca e degli annunci a pagamento, i canali proprietari come quello delle email sono ‘sempre accesi’. I tuoi iscritti ti hanno dato il consenso a ricevere comunicazioni direttamente all’interno della loro casella di posta.Questo metriche mostrano se stai o meno ottenendo la loro fiducia e dove devi migliorare.19. Tasso di crescita degli iscrittiIl tasso di crescita degli iscritti rappresenta la differenza in percentuale fra gli iscritti all’inizio e alla fine di un determinato periodo (mese/anno/sempre).Come si calcolaTasso di crescita degli iscritti (%) = ((Iscritti alla fine del periodo — Iscritti all’inizio del periodo) /Iscritti all’inizio del periodo) x 100Far crescere la lista email crea nuove opportunità di interazione con potenziali clienti.Tenere traccia del tasso di crescita nel tempo è una metrica molto più significativa rispetto al semplice conteggio del numero degli iscritti.Il tasso di crescita degli iscritti ti fornisce informazioni preziose su quanto velocemente la tua lista sta crescendo.20. Open rateL’open rate rappresenta la percentuale di iscritti che ha aperto la tua email.Come si calcolaOpen rate = (Email aperte / (Email inviate — bounce)) * 100Non dovresti interpretare un alto open rate come un ottimo segno di interazione. Molte persone aprono le email, ma non le leggono o non interagiscono con esse. Certe volte le aprono con il solo scopo di eliminarle. L’open rate non riesce a distinguere le aperture buone da quelle cattive.In ogni caso, l’open rate può darti un’idea generale di quanto stiano funzionando gli oggetti e le anteprime con la tua audience.21. Click rateIl click rate rappresenta la percentuale di riceventi che clicca un link all’interno della tua email.Come si calcolaClick rate = (Email cliccate / (Email inviate — bounce)) * 100I click sui link all’interno delle email indicano che il contenuto ha solleticato l’interesse del lettore. In questo senso, il click rate è un modo piuttosto affidabile per misurare il livello di interazione delle tue email che puoi tracciare come KPI.La maggior parte dei servizi di email (o ESP, email service provider) riescono a fornire i dati relativi ai click sia a livello di campagna che account.22. Tasso di disiscrizioneIl tasso di disiscrizione rappresenta la percentuale di riceventi che si disiscrive dopo aver ricevuto un’email.Come si calcolaTasso di disiscrizione = (Disiscritti / (Email inviate — bounce)) * 100Tener traccia del tasso di disiscrizione delle tue campagne è utile quando i numeri delle campagne che hai inviato sono elevati. Se qualcuno si disiscrive, non puoi più inviargli messaggi, il che avrà un impatto negativo sulla tua capacità di vender loro prodotti/servizi.Se vedi che molte persone si disiscrivono, ci sono possibilità che ci sia un problema con i tuoi messaggi, o che il tuo marketing in generale non sia all’altezza delle aspettative dei tuoi iscritti.23. Bounce rateIl bounce rate è la percentuale di email che non sono state consegnate perchè l’indirizzo email è incorretto, non esiste, o il server del ricevente ne ha bloccato la ricezione per qualche altro motivo.Come si calcolaBounce rate = (Numero di bounce / Email inviate) * 100Il bounce rate può avere un effetto negativo sulla tua azienda, in quanto i tuoi messaggi di marketing non raggiungono i tuoi potenziali clienti. In questo caso ci sono meno probabilità che quest’ultimi acquistino da te in futuro.Il bounce rate può anche indicare lo stato di salute della tua mailing list. Se hai un alto numero di hard bounce, potrebbe significare che stai attirando un elevato numero di email false.Nota a margine. Ci sono dozzine di motivi per i quali i messaggi vengono etichettati come soft bounce da un server email, o potrebbe anche trattarsi del fatto che il ricevente ha la casella di posta piena. Al contrario degli hard bounce, la maggior parte degli EPS proverà a reinviare nuovamente la mail ai soft bounce. Metriche per i social mediaLe metriche relative ai social media sono complicate, in quanto i social spesso variano i loro algoritmi o operano in modi incomprensibili.In aggiunta a ciò, ogni social network definisce le metriche in modo differente. Ad esempio, ecco cosa viene definito come una visualizzazione video fra i differenti social network: Facebook/Instagram – 3 secondiYouTube – 30 secondiTwitter – 2 secondi quando il 50% dell’inquadratura del video è visibileLinkedIn – 2 secondi quando il 50% dell’inquadratura del video è visibileQuesto significa che tracciare le metriche sui social è più complicato e tende a variare. La domanda è: ha senso includere queste metriche nei report?24. Engagement L’engagement è una categoria piuttosto ampia che include le interazioni specifiche provenienti da un social network.Come tracciarloPuoi utilizzare il tool di Analytics messo a disposizione da ogni social network per avere i numeri relativi al tuo engagement. In alternativa, utilizzare uno strumento di analytics per social network può funzionare, come ad esempio Buffer Analyze.Ad ogni modo, non esiste un set di azioni standard fra i vari social media.Ad esempio:Twitter – mi piace, retweet, citazioni dei tweets, risposte, click sul profiloFacebook – condivisioni, visualizzazione, mi piace/reazioni, commenti, clickLinkedIn – impression, commenti, condivisioni, reazioniQuesto significa che potrebbe essere arduo confrontare le metriche di engagement fra i vari social network.25. Menzioni del BrandLe menzioni del brand rappresentano il numero di volte che il tuo brand viene menzionato sui social media in un determinato periodo di tempo.Come tracciarloPuoi utilizzare uno strumento come Hootsuite, dove puoi addirittura segmentare in base al sentimento per comprendere meglio quanto positivamente il tuo pubblico stia reagendo al tuo brand.Tracciare le menzioni del tuo brand sui social ti offre la possibilità di ottenere informazioni su come i tuoi clienti percepiscono il mercato.Ad esempio, immagina che il tuo brand stia costantemente ricevendo menzioni sui social. Questo potrebbe essere un segnale che indica che dovresti continuare ad investire sui social come canale di marketing.ConclusioniPeter Drucker ha una citazione piuttosto famosa che recita “Quello che viene misurato, viene gestito”.Solo perché passi ore su Google Analytics non significa che tu stia tracciando le tue metriche di marketing in maniera efficace. Se non tracci l’impatto delle tue strategie di marketing, come farai a sapere dove investire di più in futuro?Invece, cerca di scegliere le metriche giuste per i tuoi canali di marketing, gestiscile nel tempo, e concentrati sul far crescere i profitti della tua azienda.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "25 Metriche di Marketing che Dovresti Tracciare"
    },
    {
      "level": "H2",
      "text": "Metriche generiche"
    },
    {
      "level": "H3",
      "text": "1. Crescita del fatturato"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "2. Customer Acquisition Cost (CAC)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "3. Conversioni"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "4. Share of Voice (SOV)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "5. Return on Investment (ROI)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H2",
      "text": "Metriche legate alla retention"
    },
    {
      "level": "H3",
      "text": "6. Churn rate"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "7. Lifetime Value (LTV)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "8. LTV:CAC"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "9. Net Promoter Score (NPS)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "10. Repeat Purchase Rate (o Frequenza di Acquisto Ripetuto)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H2",
      "text": "Metriche SEO"
    },
    {
      "level": "H3",
      "text": "11. Traffico Organico Branded vs. non-Branded"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "12. Menzioni del Brand"
    },
    {
      "level": "H4",
      "text": "Come tracciarle"
    },
    {
      "level": "H3",
      "text": "13. Crescita dei backlink"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H2",
      "text": "Metriche per le sponsorizzazioni"
    },
    {
      "level": "H3",
      "text": "14. Punteggio Qualità"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "15. Costo Per Click (CPC)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "16. Costo Per Conversione"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "17. Return on Ad Spend (ROAS)"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "18. Conversioni view-through"
    },
    {
      "level": "H4",
      "text": "Come si calcolano"
    },
    {
      "level": "H2",
      "text": "Metriche per le email"
    },
    {
      "level": "H3",
      "text": "19. Tasso di crescita degli iscritti"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "20. Open rate"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "21. Click rate"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "22. Tasso di disiscrizione"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H3",
      "text": "23. Bounce rate"
    },
    {
      "level": "H4",
      "text": "Come si calcola"
    },
    {
      "level": "H2",
      "text": "Metriche per i social media"
    },
    {
      "level": "H3",
      "text": "24. Engagement"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "25. Menzioni del Brand"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Marc Thomas"
}