{
  "url": "https://ahrefs.com/blog/it/metriche-seo-da-tracciare/",
  "slug": "metriche-seo-da-tracciare",
  "title": "10 SEO Metriche Importanti (E 4 Che Non Lo Sono)",
  "description": "Le metriche SEO sono degli indicatori che ti aiutano a comprendere se la tua SEO sta funzionando o meno. Queste sono le 10 da tracciare.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti Le metriche SEO sono degli indicatori che ti aiutano a comprendere se la tua SEO sta funzionando o meno. Alcune sono essenziali, altre utili, mentre altre ancora sono solo vanity metric che non ti aiuteranno a prendere decisioni ponderate.Ma come fai a capire quali vale la pena tracciare? Troverai risposta in questo articolo.Parleremo delle seguenti 10 metriche SEO che vale la pena tracciare:Traffico organicoPosizionamento delle parole chiaveVisibilità nella ricercaValore del trafficoConversioni da traffico organicoDomini referralPagine indicizzateErrori di coperturaCore Web VitalsSalute del sitoSeguite poi da queste quattro metriche che sono molto diffuse ma che hanno in realtà poco valore:Frequenza di rimbalzoFrequenza di uscitaDurata della sessione mediaPagine per visita o sessioneInfine, comprenderai esattamente cosa e in che modo queste metriche si riflettono sui tuoi sforzi SEO.10 metriche SEO che vale la pena tracciareSe chiedi ad un qualsiasi SEO qual è il dato che tiene principalmente sott’occhio, probabilmente la risposta sarà il traffico organico. Questo tuttavia non è un indicatore di una SEO di successo senza un adeguato contesto, almeno nella maggior parte dei casi.A dirla tutta, non dovresti mai basarti su di un singolo numero senza sapere cosa ci sia dietro. Iniziamo quindi con il parlare proprio del traffico organico.1. Traffico organicoIl traffico organico rappresenta tutti i click non a pagamento provenienti dai motori di ricerca.Perché è utileSe il tuo traffico organico ha un trend positivo, questo potrebbe essere un segnale che i tuoi sforzi SEO stiano finalmente ripagando. Ad ogni modo, tieni a mente che più traffico non significa necessariamente più fatturato, a meno che tu non stia monetizzando il sito con degli annunci di tipo display.Come tracciarloLa tab Rendimento all’interno di Google Search Console fornisce una visione piuttosto accurata del traffico organico nel corso del tempo:pro tipSe hai un brand molto affermato, vale la pena impostare un filtro a livello di query per escludere il traffico brand e avere una panoramica più accurata delle tue performance SEO:Se non utilizzi Search Console (dovresti!), puoi ottenere una stima gratuitamente utilizzando il Site Explorer all’interno di Ahrefs Webmaster Tools (AWT):2. Posizionamento delle parole chiaveIl posizionamento delle parole chiave si riferisce alla posizione che il tuo sito ha nella ricerca organica in relazione ad una determinata parola chiave.Perché è utileAlcune parole chiave e la loro posizione sono più importanti di altre. Parlando in maniera generica, più è pertinente la parola chiave alla tua azienda e i relativi prodotti, più valore ha per te posizionarti bene per quella specifica ricerca.Tracciare il posizionamento delle parole chiave ti consente di monitorare le tue performance SEO per quelle più importanti nel corso del tempo.Come tracciarloPer avere dei risultati accurati, dovresti appoggiarti ad un tool di rank tracking, come il Rank Tracker di Ahrefs. Crea un progetto per il tuo sito, incolla le parole chiave per cui vuoi tracciare il posizionamento e sei pronto a partire.Puoi anche ottenere degli avvisi via email riguardo i progressi delle parole chiave tracciate oppure puoi semplicemente controllare il report all’interno del Rank Tracker di tanto in tanto:3. Visibilità nella ricercaLa visibilità nella ricerca rappresenta la percentuale di click che ottengono le parole chiave da te tracciate e che finiscono sul tuo sito. È essenzialmente una versione SEO della Share of Voice (SOV), una delle più importanti KPI di marketing, che misura la visibilità del tuo brand rispetto al mercato.Perché è utileEsiste una forte correlazione fra SOV e quota di mercato. Generalmente, maggiore è la tua SOV, maggiore è la tua fetta di torta. Il fatto che sia una metrica relativa la rende più adatta come KPI rispetto alla crescita del traffico organico.Come tracciarloIncolla un campione rappresentativo delle parole chiave per te più importanti nel Rank Tracker di Ahrefs. Dovresti avere queste parole chiave pronte se hai condotto la tua keyword research.Nota che queste dovrebbero essere le parole chiave principali che raccolgono quello che la tua audience principale cerca (non preoccuparti delle code lunghe). Questo ti consente di tracciare le parole chiave portando il monitoraggio a un livello superiore.Dai qui, vai nella tab panoramica chiamata Competitors e clicca sulla colonna chiamata Visibility:Questo è tutto. La visibilità nella SERP è un ottimo KPI per tutti, in quanto puoi sempre avere competitor diretti indipendentemente dal tuo business model.Approfondisci: Cos’è la Share of Voice? Come Misurarla nei Diversi Canali4. Valore del trafficoIl valore del traffico è quanto dovresti pagare per ottenere lo stesso numero di click se questi provenissero dagli annunci di ricerca PPC.Perché è utileGeneralmente, più è alto il valore del tuo traffico più di valore questo diventa per la tua azienda.Anche se dovresti utilizzare la SEO per portare traffico durante tutto il customer journey, i click che provengono da visitatori propensi alla conversione sono quelli più di valore. Questo è il motivo per cui puoi vedere molti annunci di ricerca per le “parole chiave monetizzabili” come “migliore agenzia SEO a Londra”, mentre non ne vedrai nessuno per “cosa è la SEO”.Posizionarti bene per “parole chiave monetizzabili” e ottenere più traffico verso di queste è solitamente molto più arduo che posizionarsi per le parole chiave che le persone cercano quando non vogliono acquistare nulla.Come tracciarloPuoi analizzare il valore totale del traffico di ogni dominio dal Site Explorer di Ahrefs:In alternativa puoi anche approfondire il valore del traffico per ogni singola pagina. Per farlo, apri il report Pagine Migliori all’interno del Site Explorer, e ordina le pagina in base al valore del traffico per vedere quelle più importanti:5. Conversioni da traffico organicoLe conversioni sono azioni importanti che i visitatori compiono sul sito, come un acquisto, la creazione di un account o la sottoscrizione ad un servizio. Tracciare questi eventi per ogni singola fonte di traffico, incluso quello organico, è qualcosa che la maggior parte delle azienda già fa.Perché è utileTracciare le conversioni è il modo più semplice per attribuire i tuoi sforzi di marketing al tuo fatturato. In termini di KPI SEO, questa è sicuramente quella che tutti reputano più importante. Come tracciarloIl tracciamento delle conversioni è solitamente semplice da impostare anche se non hai conoscenze in termini di programmazione. La cosa più importante è assicurarsi di tracciare le giuste conversioni.Se gestisci un sito ecommerce, il numero di conversioni, il loro valore e il valore medio di ogni ordine hanno sicuramente senso. Per farlo dovrai però impostare il tracciamento E‑commerce avanzato all’interno di Google Analytics.Se invece offri un software dietro sottoscrizione come noi, ha senso tracciare lead, iscrizioni al trial, iscrizioni a pagamento ed eventualmente anche ogni fascia di sottoscrizione.In ogni caso, indipendentemente dalle conversioni che tracci, è importante tenere a mente un paio di cose:I dati di Google Analytics sono sballati in un modo o nell’altroGoogle Analytics attribuisce le conversioni all’ultima fonte di traffico di default. Questo non combacia bene con il modo in cui la SEO o la maggior parte degli altri canali di marketing contribuiscono alla conversione.Dovresti sempre confrontare periodi simili fra loro (questo è particolarmente importante per le aziende che soffrono di oscillazioni stagionali)Raccogliere dati correttamente in GA, analizzarli e utilizzarli per migliorare le tue performance SEO sono tutti argomenti complessi e oltre lo scopo di questo articolo. Ti consiglio vivamente di dare uno sguardo ai miei altri due articoli per approfondire:Ulteriori approfondimentiCome Utilizzare Google Analytics per Migliorare le Performance SEO13 errori di tracciamento di Google Analytics (e come risolverli)6. Domini referralI domini referral sono i siti che linkano al tuo.Perché è utileI link sono uno dei più importanti fattori di posizionamento su Google, ed esiste una chiara correlazione positiva fra i domini referral ed il traffico:In altre parole, dovresti assicurarti di ottenere più domini referral nel corso del tempo, in quanto questo porterà con molta probabilità a più traffico organico. Quindi un trend positivo in termini di domini referral è un’indicazione che la tua link building, PR e branding stanno funzionando.Come tracciarloInserisci il tuo dominio nel Site Explorer di Ahrefs e analizza il grafico dei domini referral.Nonostante la forte correlazione è però importante notare che un singolo grafico non riflette necessariamente il tuo successo SEO. Devi assicurarti che i siti che ti linkano siano buoni. Puoi farlo nel report Domini Referral:7. Pagine indicizzateQuesto ti dice quante pagine (o più precisamente URL) un motore di ricerca ha nel suo indice.Perché è utileLe tue pagine devono essere indicizzate per apparire nella SEO e portare traffico organico, ma ce ne sono alcune che dovrebbero restare fuori dall’indice.Generalmente, dovresti vedere il numero di pagine indicizzate crescere man mano che pubblichi nuovi contenuti. Qualsiasi repentino cambiamento in questo numero è probabilmente un errore legato alla technical SEO.Più grande e complesso è il tuo sito, più importante diviene questa metrica.Come tracciarloPuoi controllare in maniera approssimativa quante pagine ha Google nel suo indice utilizzando l’operatore di ricerca site in questo modo:Il modo migliore per tracciare questo numero in modo dettagliato, è controllare il report Copertura all’interno del tuo account GSC:8. Errori di coperturaRelativamente alla metrica precedente, il numero di pagine indicizzate che contiene errori è molto importante. Questi errori possono essere una qualsiasi cosa che non permette alle tue pagine di essere indicizzate quando non si tratta di una scelta intenzionale utilizzando il meta tag robots noindex.Perché è utileCi sono molti motivi per i quali Google potrebbe deindicizzare le pagine o rifiutarsi direttamente di indicizzarle. Dato che gli errori di copertura avvengono solitamente quando il motivo è qualcosa fatto non di proposito, è importante conoscerli e saperli correggere quando necessario.Come tracciarloPuoi tracciare questa tipologia di errori all’interno del report Copertura di GSC:Quando clicchi su un errore, ti viene mostrata la lista di URL interessata con un link per approfondire le motivazioni. Solitamente ci sono anche le istruzioni per porre rimedio.Se vuoi approfondire ulteriormente come sistemare i tuoi errori di indicizzazione, crea un account gratuito su Ahrefs Webmaster Tools e scansiona il tuo sito con il Site Audit:Una volta che il tool ha terminato di scansionare il tuo sito, vai sul report chiamato Indexability e analizza gli errori trovati:In questo modo, puoi sistemare le pagine addirittura prima che Google le scansioni, che è ancora meglio.Approfondisci: 10 Metodi per Indicizzare il tuo sito su Google (Che Funzionano Veramente)9. Core Web VitalsI Core Web Vitals (CWV) sono un set di 3 metriche relative alla technical SEO che si riferiscono alla velocità e alla user experience del tuo sito. Ecco quali sono queste 3 metriche: Largest Contentful Paint (LCP) – il singolo elemento più grande caricato in pagina. First Input Delay (FID) – il tempo che passa da quando un utente interagisce con la tua pagina a quando la pagina risponde. Cumulative Layout Shift (CLS) – in che modo gli elementi si muovono o quanto è stabile il layout della pagina.Perché è utileGoogle utilizza i CVW come fattore di posizionamento minore da Giugno 2021. Se una di queste tre metriche è molto negativa, dovresti probabilmente correggerla.Questo riflette gli sforzi di Google di posizionare pagine con un’ottima user experience e che forniscono quindi una buona velocità di caricamento unità ad un’interattività fluida.Come tracciarloEsistono molti modi per tracciare i CWV, ma il migliore è controllarli all’interno del tuo account GSC nel report Core Web Vitals.In alternativa puoi utilizzare anche in questo caso il Site Audit di Ahrefs, analizzando il report Performance per vedere le tue metriche CWV insieme ad altre metriche correlate:Approfondisci: Core Web Vitals: il Page Speed è Ora Ancora Più Importante per la SEO10. Salute del sitoIl Site Audit di Ahrefs ha una metrica chiamata Health Score che riflette la porzione delle URL interne del tuo sito che non presentano errori SEO lato tecnico:Perché è utileL’Health Score offre un modo affidabile per verificare lo stato della tua SEO. La cosa migliore di tutto ciò è che puoi vedere le variazioni dell’Health Score rispetto alle scansioni precedenti, inclusi gli specifici errori che hanno contribuito alle variazioni.Come tracciarloDevi solamente impostare un progetto all’interno del Site Audit.Ogni volta che Ahrefsbot finisce di scansionare il sito, aggiornerà il tuo Health Score e il relativo report. Per vedere le variazioni di errore fra le diverse scansioni, vai sul report All issues e seleziona “Errors only”:Approfondisci: Guida per Principianti alla SEO Tecnica4 metriche SEO diffuse ma non importantiOra la parte più controversa di tutto l’articolo.Molte metriche vengono mal interpretate, non sono così utili, o vengono utilizzate nel modo sbagliato. Sfortunatamente, molte persone non parlano di questi aspetti. Il risultato di tutto ciò è che è possibile vedere di frequente risorse che competono fra di loro a colpi di numeri di metriche elencate.Sicuramente avrai sentito la tipica fra inglese “less is more” (meno è di più) molte volte. Questo è vero anche per l’analisi dei dati. Ecco quindi 4 metriche spesso consigliate sulle quali non dovresti invece perdere troppo tempo.1. Frequenza di rimbalzoLa frequenza di rimbalzo (o bounce rate) rappresenta la percentuale di visitatori che non compie un’azione dopo essere atterrata su di una landing o un sito, come ad esempio cliccare su di un’altra pagina, lasciare un commento o aggiungere qualcosa al carrello.È una delle metriche SEO a cui si consiglia più spesso di fare attenzione (alcuni lo chiamano addirittura KPI). Anche se il bounce rate può essere utile in alcune casistiche, non dovrebbe diventare la tua ossessione. Ecco tre motivi che rendono il bounce rate complicato da utilizzare:È distorto da Google Analytics impostato male, dai visitatori che lasciano troppo velocemente le pagine, dagli utenti che bloccano gli annunci e dai timeout delle sessioni.È una metrica media che richiede una pesante segmentazione e analisi per avere valore.Non esiste un “buon” bounce rate. Dipende tutto dalla tua nicchia, la tipologia di pagina, la fonte di traffico e l’intento dell’utente.Approfondisci: Cos’è Il Bounce Rate? Come Interpretarlo e Utilizzarlo Correttamente2. Frequenza-di-uscitaLa frequenza di uscita (o exit rate) mostra la percentuale di sessioni che sono terminate su quella pagina. Alcune persone nella SEO la tracciano per pagina nei report come questo qui:Ma un alto exit rate non significa che ci sia qualcosa di sbagliato con la pagina. Può anzi essere l’esatto opposto: l’utente ha ottenuto quello che voleva ed ha lasciato la pagina soddisfatto e con una buona impressione del tuo brand/prodotto. Potrebbero aver visto molte altre pagine prima di quella e addirittura aver convertito.Dovresti scavare a fondo su altre metriche correlate o analizzare le registrazioni dei visitatori per ottenere dei potenziali dati di valore da questa metrica. É preferibile ignorarla e concentrarsi su ciò che conta.3. Pagine per visita o sessioneSimile all’exit rate, puoi trovare molti consigli che spiegano come ottimizzare la user experience in base a quanto è basso il numero di pagine per sessione. In termini SEO, questo dovrebbe essere analizzato per il segmento relativo al traffico organico:Quindi qual è un buon numero di pagine per sessione? 4.30 come nello screenshot qui sopra indica che i tuoi visitatori sono meno interessati rispetto a quelli provenienti dal traffico a pagamento con un valore di 6.10? Quali sono le azioni possibili per migliorare? I dati di GA non ti dicono ciò.Ci sono troppe variabili in gioco per rendere questa metrica affidabile.4. Durata della sessione mediaQueste metriche dovrebbero indicarti quanto interessati siano i tuoi visitatori fornendoti dati relativi al tempo passato sul sito.Il problema principale è come queste vengono calcolate.Google Analytics raccoglie dati relativi ai tempi quando un utente clicca fra diverse pagine o attiva degli eventi. Calcola poi la durata di ogni sessione prendendo in considerazione la prima interazione della sua visita e l’ultima compiuta nella stessa sessione. Il tempo medio sulla pagina è la differenza fra il caricamento di una pagina e il clic verso un’altra.Questo significa che ogni utente che ha fatto un bounce ha un valore sulla pagina pari a 0, così come la durata della sessione perchè GA ha solo la prima interazione corrispondente al caricamento della pagina.Potrei fornire più motivazioni per non utilizzare questa metrica applicando la stessa logica che ho utilizzato prima. Ma credo che il fatto che le sessioni bounce siano così frequenti sia già abbastanza.ConclusioneSapere quali dati analizzare e come interpretarli è spesso una parte della SEO trascurata (in realtà vale anche per altri canali di marketing). Fare report e fornire il reale valore dei nostri sforzi SEO è una parte importante del nostro lavoro.Ora sai quali metriche SEO dovresti tracciare ed analizzare. Ma, cosa ancora più importante, sai il “perché” che si cela dietro ognuno di questi numeri.Sei hai altre domande inerenti riguardo le metriche SEO, scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "10 SEO Metriche Importanti (E 4 Che Non Lo Sono)"
    },
    {
      "level": "H2",
      "text": "10 metriche SEO che vale la pena tracciare"
    },
    {
      "level": "H3",
      "text": "1. Traffico organico"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "2. Posizionamento delle parole chiave"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "3. Visibilità nella ricerca"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "4. Valore del traffico"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "5. Conversioni da traffico organico"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "6. Domini referral"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "7. Pagine indicizzate"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "8. Errori di copertura"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "9. Core Web Vitals"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H3",
      "text": "10. Salute del sito"
    },
    {
      "level": "H4",
      "text": "Perché è utile"
    },
    {
      "level": "H4",
      "text": "Come tracciarlo"
    },
    {
      "level": "H2",
      "text": "4 metriche SEO diffuse ma non importanti"
    },
    {
      "level": "H3",
      "text": "1. Frequenza di rimbalzo"
    },
    {
      "level": "H3",
      "text": "2. Frequenza-di-uscita"
    },
    {
      "level": "H3",
      "text": "3. Pagine per visita o sessione"
    },
    {
      "level": "H3",
      "text": "4. Durata della sessione media"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Michal Pecánek"
}