{
  "url": "https://ahrefs.com/blog/it/migliori-plugin-seo-per-wordpress/",
  "slug": "migliori-plugin-seo-per-wordpress",
  "title": "15 Migliori Plugin WordPress SEO (Provati & Testati)",
  "description": "Stai cercando di posizionare più in alto il tuo sito web WordPress su Google? Inizia da questi 15 plugin SEO.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Stai cercando una buona impostazione per la tua SEO WordPress, ma ti spaventa il numero di plugin SEO disponibili? Sei nel posto giusto.Fai una ricerca per “SEO” nella directory dei plugin WordPress, ed avrai 49 pagine di risultati.Ci sono 20 plugin per pagina, quindi fanno in totale 980 plugin! #troppiOra, voglio parlarti chiaro: non esiste qualcosa che possa definirsi come la lista definitiva dei migliori plugin SEO per WordPress. Gli elementi da considerare sono soggettivi.Per questo motivo, quelli sotto elencati sono solamente quelli con i quali ho avuto esperienza negli anni, e quelli che usiamo con il blog di Ahrefs (che ha ~240.000 visite mensili da Google).Iniziamo subito da quello che probabilmente avrai già sentito nominare.1. Yoast SEOYoast SEO è uno dei plugin SEO WordPress più famosi, con oltre 5 milioni di installazioni attive ad oggi.E’ anche il plugin che usiamo nel Blog di Ahrefs.Cosa puoi farci? Tante cose.Creare una sitemap XMLControllare il tuo sito nel Webmaster Tool (Google, Bing, Baidu, Yandex, ecc.)Escludere (“noindex”) alcune tipologie di contenuti dall’essere catalogate nei risultati dei motori di ricerca (es, categorie, tag, pagine media)Creare template per titoli e meta descriptionOttimizzare le pagine AMP. (Per farlo avrai bisogno di Glue for Yoast and AMP)Ma questo riguarda le impostazioni a livello sito. E cosa c’è a livello di pagina?Yoast aggiunge un riquadro meta SEO a tutti gli articoli ed a tutte le pagine. Da qui, puoi impostare i title tag personalizzati, le meta description, Open Graph Tags, i canonical, ed i tag meta robot.Nota a margine. Aggiunge di default il canonical auto-riferito, che è una buona pratica SEO. C’è anche una funzione che ti mostra quanto bene una pagina è “ottimizzata” per una parola chiave obiettivo.Tuttavia, non raccomandiamo di prestarci troppa attenzione.La funzionalità è molto basilare e confronta elementi come la posizione delle parole chiave esatte nei titoli, sottotitoli, e nel contenuto stesso. Nessuna di queste cose rappresenta un fattore importante per la classifica, e cercare un punteggio perfetto spesso peggiora il contenuto.L’analisi della leggibilità è un po’ più utile, e ti dice quanto è facile o difficile leggere il tuo contenuto (punteggio Flesh Reading Ease). Valuta inoltre la lunghezza delle frasi, la distribuzione dei sottotitoli—questa tipologia di elementi.Riassunto? Installare YoastSEO è un buon punto di partenza per molti proprietari di siti WordPress.2. All in One SEO PackAll in One SEO Pack ha molte funzionalità in comune con Yoast SEO. E’ solo maggiormente personalizzabile ed ha alcune funzionalità extra.Ad esempio, lo puoi usare per:Editare il file robots.txt grazie ad una interfaccia semplice*Editare il tuo file .htaccess senza FTP*Bloccare “bot maligni”, incluso lo spam per referral*Aggiungere il markup dei sitelink del riquadro di ricercaGenerare automaticamente le meta descriptionEditare .htaccess utilizzando the All in One SEO Pack.Nota a margine. Tutte le funzionalità contrassegnate da (*) richiedono un componente aggiuntivo gratuito.Inoltre supporta anche AMP, quindi si integra con il plugin ufficiale AMP per WordPress.3. Rank MathRank Math è probabilmente il più potente plugin SEO WordPress nel mercato.Compie la grande impresa di essere colmo di funzionalità ed è anche facile da usare. C’è anche un tutorial per il setup che ti guida nel processo di installazione, con la più bella UI rispetto a tutti gli altri.Quindi cosa ha in più rispetto ad Yoast ed agli altri concorrenti?Integrazione con Google Search ConsoleRedirection (301, 302, 307, 410, 451)Rich snippets markup (14 tipi)Anteprime Card per Facebook e TwitterC’è anche un monitor per gli errori 404, che controlla i visitatori delle pagine 404 (errore) e ti consente di conoscere le URL e la quantità dell’evento.Puoi quindi eliminare questi problemi con un redirect o reintegrando la pagina non disponibile oppure rimuovendo i link interni alla 404. Rank Math ti dice anche la provenienza quindi puoi vedere dove il link è stato cliccato.Se hai l’intenzione di migrare a Rank Math, puoi importare le impostazioni esistenti da Yoast o All in One SEO Pack.4. The SEO FrameworkThe SEO Framework rimane ancora una valida alternativa ad Yoast e All in One SEO Pack.Ricco di funzionalità, non ha molto di più rispetto agli altri, nonostante sia più leggero.5. Easy Table of ContentsGoogle consiglia di suddividere i contenuti lunghi in sezioni logiche associando ancore nella pagina.Assicurati che le pagine del tuo sito lunghe e multi-argomento sono ben strutturate e suddivise in sezioni logiche distinte. Secondo, assicurati che ogni sezione abbia un’ancora associata con un nome descrittivo (es., non solo “Sezione 2.1”), e che la pagina includa un “indice” con i link alle singole ancore.Questo è ciò che fa il plugin—aggiunge un indice dei contenuti ai tuoi articoli ed alle tue pagine per renderle più facili da navigare.Ecco come è in uso:Siccome un indice dei contenuti rende una pagina lunga meno spaventosa, può avere un effetto positivo nella SEO e migliorarne i valori come il tempo nella pagina, il tasso di rimbalzo, ed il tempo di permanenza.Può anche aiutarti ad aumentare posizioni nella SERP, che potrebbe incrementare il CTR.E per quanto riguarda lo stesso plugin, è super personalizzabile.Puoi decidere con precisione dove verrà inserito, i tipi di titoli (H2, H3, ecc.) che saranno inclusi nelle ancore, ed anche se apparirà in tutte le pagine o solamente alcune.6. Broken link checkerBroken Link Checker cerca i link danneggiati nei tuo sito web—sia interni che esterni.Se ne trova, ti mostra il codice di stato HTTP (es, 404, 410), l’anchor text e la provenienza del link. Così è facile trovarli e sistemarli.Siccome il plugin è sempre attivo in background, riesce a controllare continuamente se ci sono link corrotti ed avvisarti con tempestività via email.Ma probabilmente la miglior funzionalità è che puoi riparare i link con un paio di click, in massa.Ad esempio, ecco un link corrotto che il plugin ha trovato nel mio sito web. Se clicco su “unlink”, il link errato verrà rimosso dall’articolo.Probabilmente ancora più utile è il fatto che ti suggerisce i link sostitutivi, e puoi modificare i link errati con quelli funzionanti con un solo click—senza mai dover andare a modificare l’articolo.Ti svela anche i redirect 301, e c’è anche un’opzione per sistemarli in massa sostituendo il link redirect con l’URL di destinazione finale.Bene, ma ci sono degli svantaggi?Purtroppo, il plugin può rallentare il tuo sito ed usare molta banda. Non raccomandiamo di usarlo se hai un hosting molto economico o lento. Infatti, un utente ha segnalato di aver perso il 20% circa del suo traffico mentre il plugin era in esecuzione—probabilmente perché ha un effetto negativo nella velocità del sito per gli altri utenti.Quindi la miglior cosa che puoi fare è attivarlo ogni tanto e lasciarlo nel frattempo disattivato.vuoi trovare link corrotti nel tuo sito senza tutto questo stress per il tuo server web?Scansiona il tuo sito web con uno strumento di terze parti come Site Audit di Ahrefs.Questo strumento cerca i link corrotti nel tuo sito web, ed altri 100 errori tecnici e relativi al sito.Link esterni corrotti 4XX trovati dallo strumento Site Audit di Ahrefs.7. ShortpixelShortpixel comprime ed ottimizza le immagini nel tuo sito web.Siccome le immagini sono solitamente i file più lenti ad essere caricati quando qualcuno visita il tuo sito, l’ottimizzazione delle immagini può avere un effetto sorprendentemente positivo nella velocità della pagina—che dal 2010 è un fattore di posizionamento.E’ facilissimo da usare. Va semplicemente installato, selezionate le impostazioni, e lui inizierà automaticamente ad ottimizzare e sistemare ogni immagine che caricherai in futuro.Le opzioni di compressione disponibili sono lossy, glossy e lossless, e supporta immagini Retina 2x.Funziona con JPG, PNG, GIF, documenti PDF. C’è una opzione per convertire in WebP, anche se sembra un po’ instabile al momento.Per le immagini già esistenti, c’è un ottimizzatore d’immagini in massa. Basta avviarlo, ed inizierà ad ottimizzare tutte le immagini già presenti nel sito utilizzando le impostazioni scelte.Shortpixel ti regala 100 crediti gratuiti al mese.EWWW Image Optimizer è la miglior proposta se stai cercando una alternativa completamente gratuita.8. a3 Lazy LoadA3 Lazy Load è un semplice plugin per attivare il lazy loading delle immagini.Attivalo, e le immagini al di fuori del viewport (l’area visibile dello schermo) non saranno caricate finchè diventeranno visibili dopo lo scrolling. Questo aumenta la velocità della pagina, che, lo ricordiamo, è un fattore di posizionamento.Per la maggior parte dei casi, funziona così com’è. Semplicemente installa ed attiva.Se vuoi escludere alcuni tipi di contenuti o URL specifiche dal lazy loading delle immagini, è possibile deciderlo nelle impostazioni.Puoi anche escludere alcuni tipi di immagini dal lazy loading.Ad esempio, le immagini in Gravatar.9. HREFLANG Tags LiteHreflang è un attributo HTML usato per specificare la lingua e l’obiettivo geografico di una pagina web. Se hai multiple versioni della stessa pagina di lingue diverse, puoi usare il tag hreflang per comunicare ai motori di ricerca come Google queste variazioni. Questo li aiuta a servire la versione corretta ai loro utenti.Hreflang Tags Lite è molto facile da usare. Avvia l’installazione, poi usa il menù a discesa per aggiungere le URL tradotte ad ogni pagina od articolo.Come puoi vedere, puoi usarlo anche per impostare il tag x‑default.Ovviamente, questo non è il metodo più efficiente per aggiungere i tag hreflang se hai un sito grande. Ma funziona bene con siti minori che hanno poca quantità di contenuti tradotti.Ecco perché lo usiamo nel blog di Ahrefs.Per esempio, ecco le impostazioni sulla nostra guida completa al SEO WordPress, che abbiamo tradotto anche in Tedesco e Spagnolo:Nota a margine. Per qualche motivo, questo plugin ha alcune recensioni negative. Ma noi lo stiamo usando per il blog di Ahrefs, e sta facendo bene il suo lavoro. Cerchi qualcosa un po’ più robusto per un sito più grande? Prova Polylang.10. RedirectionRedirection è un plugin semplice per implementare i redirect 301.Usarlo è semplicissimo. Basta inserire l’URL iniziale e l’URL di destinazione, e premere “add redirect”.C’è anche il supporto per altri redirect 3XX…… così come i codici di stati 4XX:Per gli utenti esperti, c’è una opzione per usare le espressioni regolari per i redirect, ignorare i trailing slash, ignorare i parametri URL, e così via.E soprattutto, è gratuito al 100%. Non c’è una versione premium.11. WP Super CacheLa caching è importante se vuoi che il sito web si carichi più velocemente possibile.Cosa significa caching? Qui c’è la migliore spiegazione che abbia mai letto:Normalmente, ogni volta che un browser richiede una pagina web, il server deve fare un sacco di complessi (e dispendiosi) calcoli. Deve recuperare gli ultimi articoli, generare il frontespizio ed il piè di pagina, trovare i widget della barra laterale del tuo sito, e così via. Tuttavia, nella maggior parte dei casi, il risultato di tutti questi calcoli sarà sempre lo stesso. Non sarebbe bello, quindi, se facciamo in modo che il server ricordi il risultato finale, invece di calcolare separatamente ogni richiesta? Questo è proprio ciò che fa la caching!Quello che fa WP Super Cache, quindi, è creare versioni statiche HTML di tutti i contenuti dinamici nel tuo sito web. E poi consegna ai visitatori queste pagine al posto delle versioni dinamiche più lente nel caricamento.Il risultato finale è lo stesso, ma le pagine web sono servite più velocemente. E’ un win-win.Per la maggior parte degli utenti, abilitare le funzionalità base del caching è sufficiente.Tutto qui, semplicePer gli utenti più esperti, ci sono dei paramenti avanzati che si possono impostare (es, disabilitare la caching per i visitatori che hanno un set cookie).Alcune opzioni caching per utenti esperti.Ed una cosa importante da notare quando si usa un plugin come questo è che dovresti pulire la cache ogni volta che effettui un cambiamento nel sito. Altrimenti, non sarà mostrato ai visitatori.12. AutoptimizeAutoptimize minifica, comprime, e crea cache degli script e degli stili (es, CSS, Javascript, HTML, ecc.).Riassumendo, aiuta a velocizzare il sito.Si integra anche con Shortpixel per ottimizzare e convertire immagini in formato WebP, e sono quindi nella cache e servite dal CDN globale di Shortpixel per velocizzare il tutto. (Questo è totalmente optional. Per attivarlo selezionare la casella nel pannello di controllo).C’è anche la funzionalità lazy loading compresa, ed una opzione per ottimizzare come vengono caricati i Font Google.13. Really Simple SSLHTTPS è un fattore di posizionamento, quindi è fondamentale avere SSL in uso.LetsEncrypt offre gratuitamente certificati SSL, e molti hosting supportano questa iniziativa. Ma installare un certificato SSL non è tutto ciò che devi fare. Devi anche fare un redirect permanente dalla versione HTTP del tuo sito alla versione HTTPS.Really Simple SSL lo rende, beh… semplice. Basta installarlo, e selezionare i riquadri nella configurazione.Può anche aiutarti a sistemare i contenuti misti (es, quando contenuti sicuri e non sicuri sono caricati via SSL) nel tuo sito, che è un problema comune quando avviene il cambio. Anche qui, tutto quello che devi fare è cliccare un riquadro.IMPORTANTEReally Simple SSL fa un buon lavoro per risolvere molti problemi che si creano quando ci si sposta da HTTP a HTTPs.Ma non è sempre perfetto.Per questo motivo, vale la pena utilizzare uno strumento come Site Audit di Ahrefs per controllare il tuo sito per ogni problematica relativa ad SSL, anche dopo aver installato e configurato il plugin.Ecco come si fa:https://www.youtube.com/watch?v=LjinWqfGyVEQuesto serve per portare a galla problematiche come:Redirect HTTPS a HTTPCanonical HTTP a HTTPSLink interni a pagine HTTP14. Anti-spamI filtri anti-spam segnalano i commenti di spam senza la richiesta di un captcha.I commenti di spam non causano solitamente grandi problemi alla SEO se i link inseriti nella sezione commenti sono nofollow. Ma Google dichiara che lo spam nei commenti è comunque dannoso in molti modi e quindi potrebbero rimuovere o retrocedere pagine cariche di spam creato dagli utenti per proteggere la qualità dei risultati di ricerca.Ciò significa che i commenti con spam sono in grado di incidere negativamente nella SEO anche se sono nofollow.Fortunatamente, il plugin Anti-spam rende facile evitare i commenti di spam.Lo devi solamente installare, e te ne liberi immediatamente.15. Rel NoFollow CheckboxE’ abbastanza semplice rendere i link “nofollow” su WordPress se conosci HTML. E’ sufficiente aggiungere il tag rel=”nofollow” nell’editor del codice.Ma non tutti usano l’editor del codice. Molti infatti usano solamente l’editor visuale.Questo plugin risolve il problema aggiungendo una casella “nofollow” all’interfaccia WordPress.Spuntala per rendere nofollow qualsiasi link.Nota a margine.Rel NoFollow Checkbox sembra funzionare solamente se stai usando il Classic Editor e non Gutenberg.I migliori consigli SEO per gli utenti WordPressSe posizionarsi meglio su Google fosse così semplice come installare alcuni plugin SEO, allora tutti quelli che hanno un sito WordPress dovrebbero nuotare nel traffico.Purtroppo, la realtà è diversa.Abbiamo da poco analizzato 3,2 milioni di siti WordPress ed abbiamo visto che la maggioranza non ha traffico organico.Non vuoi far parte di questo gruppo statistico?Segui questi semplici 3 consigli SEO:1. Fai ricerca di parole chiave, sempreScrivere articoli del blog richiede tempo—molto tempo.Ogni articolo che pubblichiamo nel blog di Ahrefs richiede tra le 15 e le 20 ore di scrittura.Come possiamo essere sicuri che questo tempo non è sprecato? Scrivendo solamente di argomenti che le persone stanno ricercando.E come lo sappiamo? Facendo la ricerca di parole chiave.Non c’è un approccio adatto ad ogni situazione, ma un buon punto di partenza è digitare alcune parole e frasi rilevanti in uno strumento di ricerca di parole chiave come Ahrefs Keywords Explorer.Ad esempio, se hai un blog di fitness, potresti scrivere parole e frasi come:aumentare i muscoliperdere pesoperdita di pesoDa qui, vai al report “Domande” per vedere le domande che le persone stanno facendo, ed il loro volume di ricerche mensile.Nota a margine. Non sei utente Ahrefs? Prova Answer the Public.Se il tuo sito è nuovo e non ha ancora molta “autorità”, usa il filtro Keyword Difficulty (KD) per trovare qualche argomento a bassa competizione che potrebbe essere più facile da scalare.Hai trovato un argomento del quale vuoi scrivere? Segui la nostra guida SEO on-page per avere le migliori possibilità di posizionarti.2. Non tralasciare il link buildingI link sono elementi di posizionamento—ed anche molto utili allo scopo.Come lo sappiamo? Perché Google è basato su quello che si chiama PageRank, che è il metodo effettivo di utilizzare i backlink per posizionare una pagina del web.Inoltre, abbiamo analizzato circa 1 miliardo di pagine web ed abbiamo visto una chiara correlazione tra i link da siti web univoci (referring domain) ed il traffico organico.Ma come puoi ottenere più backlink di alta qualità per il tuo sito WordPress?Inizia con questo video:https://www.youtube.com/watch?v=BjT-QOqsjz4Oppure leggi alcuni degli articoli nel nostro blog qui sotto.Ulteriori approfondimenti9 Strategie FACILI di Link Building (Che TUTTI Possono Usare)Link Building Pagina delle Risorse: L’Unica Guida Di Cui Hai BisognoCome Ottenere Backlinks: 7 Tattiche Che Non Richiedono Nuovi ContenutiCome Eseguire la Tecnica del Grattacielo (ed Ottenere Risultati)3. Trai vantaggio dall’uso dei link interniI link interni sono link da una pagina all’altra dello stesso dominio.Google li usa per scoprire nuovi contenuti, ed aiutano il flusso PageRank nel sito. Questo è importante perché, come detto sopra, PageRank è alla base delle ricerche Google.Probabilmente è per questo motivo che Google dice questo:Il numero di link interni che puntano ad una pagina è un segnale per i motori di ricerca sull’importanza relativa di quella pagina.Purtroppo, Google ha abbandonato il punteggio pubblico PageRank nel 2016, quindi non c’è modo di conoscere il PageRank delle pagine del tuo sito.Ma ci possono scegliere altre metriche, come la URL Rating (UR) di Ahrefs—una metrica che misura la “autorità” dei backlink di una pagina web in una scala da 0 a 100.Per conoscere il valore dell’URL di una pagina web, incolla l’URL nel Site Explorer di Ahrefs.Secondo il nostro studio su ~14 milioni di pagine web, c’è una chiara correlazione tra URL Rating (UR) di una pagina ed il traffico di ricerche organiche.Ci sono 2 modi per aumentare il valore UR di una pagina:Dotarla di backlinkLink interni ad essa da pagine autorevoliImpara il modo migliore per farlo con la nostra guida al linking interno per la SEO.ConclusioneLa SEO per WordPress non è diversa da qualsiasi altro tipo di SEO.Per questo motivo, i plugin non faranno tutto il lavoro. Di sicuro, rendono facile la gestione di alcuni parametri della SEO tecnica e on-page, ma non è il solo e definitivo lavoro da fare per la SEO.Stai iniziando ora con la SEO per WordPress? Inizia qui.Conosci un plugin SEO che vuoi consigliare e che noi abbiamo tralasciato? Fammelo sapere nei commenti o via Twitter.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "15 Migliori Plugin WordPress SEO (Provati & Testati)"
    },
    {
      "level": "H2",
      "text": "1. Yoast SEO"
    },
    {
      "level": "H2",
      "text": "2. All in One SEO Pack"
    },
    {
      "level": "H2",
      "text": "3. Rank Math"
    },
    {
      "level": "H2",
      "text": "4. The SEO Framework"
    },
    {
      "level": "H2",
      "text": "5. Easy Table of Contents"
    },
    {
      "level": "H2",
      "text": "6. Broken link checker"
    },
    {
      "level": "H2",
      "text": "7. Shortpixel"
    },
    {
      "level": "H2",
      "text": "8. a3 Lazy Load"
    },
    {
      "level": "H2",
      "text": "9. HREFLANG Tags Lite"
    },
    {
      "level": "H2",
      "text": "10. Redirection"
    },
    {
      "level": "H2",
      "text": "11. WP Super Cache"
    },
    {
      "level": "H2",
      "text": "12. Autoptimize"
    },
    {
      "level": "H2",
      "text": "13. Really Simple SSL"
    },
    {
      "level": "H2",
      "text": "14. Anti-spam"
    },
    {
      "level": "H2",
      "text": "15. Rel NoFollow Checkbox"
    },
    {
      "level": "H2",
      "text": "I migliori consigli SEO per gli utenti WordPress"
    },
    {
      "level": "H3",
      "text": "1. Fai ricerca di parole chiave, sempre"
    },
    {
      "level": "H3",
      "text": "2. Non tralasciare il link building"
    },
    {
      "level": "H3",
      "text": "3. Trai vantaggio dall’uso dei link interni"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Joshua Hardwick"
}