{
  "url": "https://ahrefs.com/blog/it/migliori-strumenti-verifica-posizionamento/",
  "slug": "migliori-strumenti-verifica-posizionamento",
  "title": "I Migliori Strumenti per Verificare il Posizionamento: Come Scegliere Quello Giusto",
  "description": "Gli strumenti per verificare il posizionamento, chiamati rank tracker, automatizzano il processo di monitoraggio del posizionamento per alcune parole chiave nel corso del tempo.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Tutti vogliono posizionarsi in cima su Google, in quanto posizionarsi in alto porta più traffico organico.Per capire dove sei posizionato però, hai bisogno di uno strumento per verificare il posizionamento, chiamato anche rank tracker.In questa guida, imparerai come scegliere lo strumento per verificare il posizionamento giusto per te, e come utilizzarlo per migliorare la SEO.Prima però assicuriamoci di essere allineati su un paio di cose.Cosa significa verificare il posizionamento?Perché verificare e monitorare il posizionamento è importante?Come scegliere il miglior strumento per verificare il posizionamentoCome utilizzare uno strumento per verificare il posizionamento per migliorare la SEOCosa significa verificare il posizionamento?La verifica del posizionamento è un processo nel quale analizzi le posizioni sui motori di ricerca per determinate parole chiave nel corso del tempo. Uno strumento o un software per verificare il posizionamento automatizza questo processo.Perché verificare e monitorare il posizionamento è importante?Verificare il posizionamento ti aiuta a capire quali pagine e parole chiave meritano maggiore attenzione, ma questo non è l’unico motivo per cui è importante. Infatti, fornisce anche alcuni indizi sulla tua strategia SEO e se questa sta portando i frutti desiderati.Ad esempio, la visibilità per le parole chiave da noi monitorate migliora nel corso del tempo:Questo ci dice che i nostri sforzi in termini SEO stanno avendo in generale l’effetto desiderato. Se la visibilità generale fosse in fatti in diminuzione, potrebbe essere sintomo di un qualcosa da approfondire per affinare la nostra strategia SEO.La maggior parte degli strumenti per la verifica del posizionamento fornisce anche diversi modi per analizzare in dettaglio i dati, in modo da ottenere intuizioni che possono essere poi tradotte in azione, come vedremo a breve.Perché non puoi verificare il posizionamento tu stesso?I cosiddetti rank tracker aiutano a risparmiare tempo automatizzando il processo di monitoraggio. Se però hai poche parole chiave di cui tener traccia, potresti chiederti: perché non inserirle semplicemente su Google e verificare poi il posizionamento manualmente?La risposta è che la verifica manuale raramente fornisce un quadro accurato della realtà, perché i risultati di Google sono fortemente personalizzati in base a fattori come la tua:PosizioneCronologia di ricercaLinguaDispositivo (desktop/mobile)Ad esempio, questi sono i risultati di ricerca per “come fare i flapjack” (o “how to make flapjacks” in inglese) nel Regno Unito:Se però utilizziamo la Toolbar SEO di Ahrefs per simulare la stessa ricerca dagli Stati Uniti, i risultati sono completamente differenti:Questo accade perché la definizione di flapjack varia fra le due nazioni. Nel Regno Unito, è una barretta fatta di avena. Negli Stati Uniti e in Canada è invece un pancake.E se uso la modalità incognito?Utilizzando una scheda in incognito dal browser risolve il problema della personalizzazione basata sulla cronologia di ricerca, ma non tutto il resto. Il tuo indirizzo IP rimane lo stesso, quindi Google personalizza comunque i risultati in base alla tua posizione e alla lingua dedotta.Ad esempio, ecco una ricerca compiuta su “come fare i flapjack” (o “how to make flapjacks” in inglese) attraverso una scheda in incognito:Google mi mostra comunque le ricette per i flapjack inglesi, in quanto conosce il mio indirizzo IP.In poche parole: anche se vuoi monitorare il posizionamento per una o due parole chiave, dovresti utilizzare uno strumento apposito. Se non vuoi pagarne uno, puoi utilizzare il nostro rank checker gratuito.Come scegliere il miglior strumento per verificare il posizionamentoIn questo momento, stai leggendo il blog di Ahrefs. Ahrefs è uno strumento SEO che comprende al suo interno uno strumento per la verifica del posizionamento. Crediamo sia uno dei migliori sul mercato, ma siamo chiaramente di parte, e non voglio quindi insultare la tua intelligenza creando una lista dei migliori strumenti per verificare il posizionamento con Ahrefs in cima a tutto.Quello che però voglio condividere, è il risultato di un recente sondaggio su Facebook ad opera di Matt Diggity:Molto interessante, è il fatto che solo due dei primi cinque siano degli strumenti per la verifica del posizionamento a sé stanti. Il resto sono inclusi all’interno di strumenti seo all-in-one come Ahrefs.Questo mi porta a discutere un fatto interessante…Se sei serio riguardo la SEO nel 2021, avrai indubbiamente bisogno di uno strumento all-in-one dedicato come Ahrefs, per eseguire azioni cruciali come la ricerca parole chiave e link building. Dato che la maggior parte di questi strumenti include un rank tracker al suo interno, quello migliore per la maggior parte delle persone è proprio quello contenuto all’interno del tuo strumento SEO preferito.Se però non sei ancora pronto ad investire su di uno strumento SEO tutto-in-uno e preferisci uno strumento a sé stante per verificare il posizionamento, quali funzionalità dovresti assicurarti di avere?Eccone alcune di cui potresti aver bisogno:Supporto per la posizioneIl posizionamento varia in base alla locazione geografica. Se il tuo sito o la tua azienda servono principalmente il mercato degli Stati Uniti, vorrai verificare il tuo posizionamento negli Stati Uniti. Allo stesso modo se servi il mercato del Regno Unito, devi controllare il posizionamento nel Regno Unito. Se invece operi principalmente in Canada… insomma, hai capito.Se lavori per una multinazionale, potresti voler tracciare il posizionamento su diversi Paesi.Chiaramente il Rank Tracker di Ahrefs supporta la maggior parte dei Paesi; 187, in continuo aumento.Se fai local SEO, dovresti avere a disposizione uno strumento che consenta di verificare il posizionamento in maniera più granulare, così da poterlo verificare a livello di provincia, città o cap—come supportato dal Rank Tracker di Ahrefs:Supporto multilinguaSe il tuo sito ha come obiettivo una zona con più di un linguaggio utilizzato/ufficiale, vorrai probabilmente tracciare il posizionamento in diverse lingue per quella zona.Ad esempio, poniamo il caso che tu abbia un ristorante a Barcellona. Questa città è nella Catalogna dove, secondo Wikipedia, esiste un mix bilanciato fra chi parla Spagnolo e Catalano. Se il sito del tuo ristorante è disponibile in entrambe le lingue, com’è il caso per questo qui, vorrai probabilmente tracciare il posizionamento sia per chi parla Spagnolo che Catalano. Ecco come farlo sul Rank Tracker di Ahrefs:Supporto per dispositivo (desktop/mobile)I segnali di posizionamento da desktop e da mobile non sono identici, non è quindi raro che il posizionamento vari fra i due dispositivi.Ad esempio, gli utenti da desktop hanno solitamente connessioni più veloci rispetto agli utenti da mobile, quindi la velocità potrebbe essere un fattore di posizionamento più importante da mobile rispetto al desktop. In altre parole, se hai un sito lento, questo potrebbe impattare negativamente il posizionamento da mobile più che da desktop.Ecco un altro paio di cose che potrebbero causare differenze in termini di posizionamento fra i diversi dispositivi:Sito poco mobile friendlyPubblicità e interstiziali più intrusivi su di un dispositivo rispetto all’altroSe utilizzi il Rank Tracker di Ahrefs, puoi facilmente cambiare fra mobile e desktop per monitorare il posizionamento medio fra i due dispositivi.Tracking delle features in SERPLe features della SERP sono tutti quei risultati di ricerca non tradizionali come i featured snippet e i caroselli con le storie in evidenza. Posizionarsi per alcuni di questi può aiutare a portare più traffico verso il tuo sito e ha quindi senso monitorare la loro prominenza per parole chiave importanti nel corso del tempo.Molti strumenti per verificare il posizionamento offrono questa funzionalità, incluso il Rank Tracker di Ahrefs, che traccia la prominenza e il possesso della maggior parte delle features in SERP in maniera automatica per le parole chiave da monitorare.Aggiornamenti del posizionamento giornalieriLa frequenza di aggiornamento del posizionamento è importante al fine di identificare eventuali problemi il prima possibile. All’interno del Rank Tracker di Ahrefs, la frequenza di aggiornamento varia in base al piano scelto. L’intervallo è compreso fra uno* e sette giorni.Nota a margine. *Gli aggiornamenti giornalieri sono disponibili nella versione Pro del Rank Tracker di Ahrefs. Puoi aggiungere questa funzionalità ad ogni piano. Ti consente anche di monitorare fino a 100.000 parole chiave. Come utilizzare uno strumento per verificare il posizionamento per migliorare la SEOÈ facile passare i giorni a lasciarsi ossessionare da ogni piccola fluttuazione all’interno di uno strumento per la verifica del posizionamento, ma non è un utilizzo molto produttivo del tuo tempo. Invece, dovresti utilizzare lo strumento di rank tracking per identificare modi per migliorare la tua SEO e ottenere più traffico.Diamo uno sguardo ad alcuni modi per farlo.Trova le opportunità per accaparrarti i featured snippetTraccia la share of voice organica per argomentoTrova opportunità semplici per battere i tuoi concorrentiTrova pagine che hanno bisogno di una rinfrescataTrova concorrenti per accelerare la tua ricerca parole chiaveNota a margine. Utilizzeremo il Rank Tracker di Ahrefs per gli esempi qui sotto, ma molti altri strumenti hanno funzionalità e caratteristiche simili.Trova le opportunità per accaparrarti i featured snippetI featured snippet sono delle risposte brevi che appaiono in cima ai risultati di ricerca su Google. Vengono estratti da una delle pagine meglio posizionate.Ad esempio, Google estrae questo snippet dalla nostra guida all’hreflang:Vincere i featured snippet è una scorciatoia verso la cima di Google, che può portare più traffico.Come fai a trovare delle opportunità in termini di featured snippet?Cerca parole chiave che fanno scattare featured snippet che al momento non possiedi, ma per le quali sei posizionato nelle prime 10. Spesso puoi vincere questi featured snippet aggiungendo o editando il contenuto della tua pagina.Se hai familiarità con Ahrefs, saprai che puoi svolgere questo processo per ogni sito attraverso il Site Explorer. Recati sul report Parole Chiave Organiche 2.0, filtra per featured snippet e spunta la casella chiamata “where target doesn’t rank” per visualizzare i featured snippet che non possiedi. Esiste però un vantaggio nel fare tutto questo all’interno del Rank Tracker. Puoi infatti vedere la prevalenza dei featured snippet nel corso del tempo.Questo è utile perchè non vale la pena ottimizzare per featured snippet che Google raramente mostra in SERP.Ad esempio, attualmente è presente un featured snippet per “trovare indirizzo email” (o “find email address” in inglese):Eppure, se facciamo click sulla freccetta per analizzare i dati storici della SERP, vediamo che Google mostra questo featured snippet in maniera sporadica. Il Rank Tracker lo ha infatti intercettato nella SERP solo una manciata di giorni nel mese scorso:Per “ecommerce SEO” invece, Google mostra in maniera consistente il featured snippet:Quindi, per noi, ha più senso cercare di vincere il featured snippet per “ecommerce SEO” rispetto a “trovare indirizzo email”, in quanto la sua prevalenza presenta una maggiore opportunità di ottenere del traffico.Traccia la share of voice organica per argomentoLa share of voice organica ti dice quanta quota di mercato diversi siti hanno per un determinato set di parole chiave. In questo caso, le parole chiave monitorate.Prima di poter vedere questo nel Rank Tracker, devi specificare uno o più concorrenti.Se non lo hai già fatto, vai sulla scheda chiamata Competitors Overview, fai click sull’opzione per aggiungere i concorrenti e poi inserisci il percorso o l’URL dei concorrenti che vuoi tracciare. Se non sei sicuro di chi siano i tuoi concorrenti, analizza i suggerimenti in base alle intersezioni di parole chiave, e clicca sul “+” per aggiungerli al tuo progetto.Per il Blog di Ahrefs, aggiungeremo Backlinko e il blog di Moz.Nota a margine. Abbiamo aggiunto il percorso per il blog di Moz invece dell’intero dominio in modo da poter tracciare solo la share of voice dei contenuti all’interno della sottocartella /blog/ invece dell’intero sito. Questo in quanto Moz inserisce tutti i suoi articoli di blog all’interno di quella sottocartella, e questo ci consente di avere un confronto congruo. Ora se ci rechiamo nel report chiamato Competitors Overview, possiamo vedere come stiamo vincendo rispetto a Moz per le parole chiave da noi tracciare, in termini di “visibility”, che rappresenta la percentuale di click per ogni parola chiave ottenuta dai singoli siti. Siamo invece più o meno alla pari con Backlinko.Stesso discorso vale anche per posizione media, traffico e feature nella SERP:Questa funzionalità diventa ancor più potente quando raggruppi le parole chiave utilizzando dei tag, perché puoi tracciare la share of voice organica per argomento, facendo uso del report chiamato Competitors Tags.Ora possiamo notare come nonostante siamo nettamente in testa rispetto alla competizione quando parliamo di contenuti sulla ricerca parole chiave, Backlinko ci batte sui contenuti che parlano di link building.Se controlliamo la scheda chiamata Traffic, possiamo vedere come questo si rifletta anche sul traffico:Potremmo quindi investigare questa problematica a fondo, al fine di verificare se c’è qualcosa che possiamo fare a riguardo. Ad esempio, potremmo ottenere più backlink per competere, o potremmo migliorare il nostro posizionamento per questa tematica creando un content hub.Trova opportunità semplici per battere i tuoi concorrentiSe i concorrenti si posizionano meglio per importanti parole chiave, potresti scegliere di dare priorità a queste al fine di vincere più traffico verso di esse.Ecco come trovare queste parole chiave:Vai sul tuo progetto all’interno del Rank TrackerClicca sul report chiamato Competitors OverviewFiltra per i posizionamenti in top 10Ordina la tabella in base ai posizionamenti dei concorrenti, dal più alto al più bassoAd esempio, Backlinko si posiziona meglio di noi per parole chiave come “LSI keywords” e “blog post templates”:Dato che siamo poche posizioni indietro, potrebbe essere interessante analizzare la SERP per vedere se c’è qualcosa che possiamo fare per posizionarci meglio. Nel caso di “LSI keywords”, sembra che dovremmo ottenere molti più backlink—il che non è semplice:Per “blog post templates” invece, Backlinko è al primo posto, una posizione sopra di noi nonostante abbiamo più o meno lo stesso numero di siti che forniscono link all’articolo.Nonostante possano esserci diverse motivazioni, una fattore potrebbe essere il fatto che Backlinko ha indubbiamente un angolo più interessante all’interno del tag title (“che funzionano a meraviglia” contro il nostro “quando utilizzarli”).Trova pagine che hanno bisogno di una rinfrescataIl posizionamento non dura per sempre. Anche se la tua pagina una volta era in pole position per le parole chiave di riferimento, ci sono alte probabilità che nel corso del tempo inizierà a retrocedere e perdere traffico.A questo punto quello che dovresti fare è dare una rinfrescata alla pagina e ripubblicarla.Per trovare le pagine che potenzialmente sono pronte ad essere aggiornate, vai sul report chiamato Grossing all’interno del Rank Tracker, e cerca le parole chiave che hanno perso posizionamento nel corso del tempo.Ad esempio, la nostra posizione per “local SEO” è passata da #1 a #9 da quando abbiamo iniziato a monitorare la parola chiave.Se analizziamo l’articolo attraverso il Site Explorer, possiamo vedere un calo corrispondente relativo al traffico proveniente dagli Stati Uniti:È molto probabile che aggiornando questo articolo per il 2021, potremmo guadagnare almeno parte del posizionamento e del traffico perso.Impara come farlo nella nostra guida che parla di come aggiornare e ripubblicare i contenuti.Trova concorrenti per accelerare la tua ricerca parole chiaveCercare argomenti che i nostri concorrenti online hanno trattato, è una delle migliori tecniche di ricerca parole chiave. Funziona però meglio quando analizzi i siti di concorrenti molto diretti.Per trovare rapidamente questi concorrenti, dirigiti sul report chiamato Traffic Share all’interno del Tank Tracker, e fai click sullo switch chiamato “Domains”.Dato che il Rank Tracker genera questi concorrenti analizzando i siti che attraggono traffico dalle parole chiave che stai monitorando, finisce spesso con il mostrare concorrenti in termini di ricerca organica che potresti aver trascurato.Ad esempio, possiamo vedere come bigcommerce.com sia uno dei primi concorrenti in base alla quota di traffico ottenuto:Dato che questo sito non è né un concorrente aziendale diretto, né un blog SEO, lo avremmo probabilmente trascurato durante una ricerca parole chiave. Ma se inseriamo il sito all’interno del Site Explorer e analizziamo il report Pagine Migliori, possiamo notare alcuni argomenti di cui potremmo parlare, come “consigli per le piccole aziende” (o “small business tips” in inglese) e “calendario marketing” (o “marketing calendar” in inglese).Se hai taggato le tue parole chiave all’interno del Rank Tracker, potresti addirittura portare questo metodo per la scoperta dei concorrenti al livello successivo, utilizzando il filtro per i tag.Ad esempio, se filtriamo per il nostro tag “link building”, possiamo notare un paio di concorrenti che non venivano mostrati in precedenza, come outreach.io e linkbuilder.io.Dato che siamo sempre alla ricerca di nuove tematiche di cui parlare nell’ambito della link building, ha senso verificare il report Pagine Migliori per questi due siti nel Site Explorer.A dirla tutta, se analizziamo il report per linkbuilder.io, possiamo notare un paio di tematiche correlate alla link building di cui noi non abbiamo parlato sul sito, come “scambi di link” (o “link exchanges” in inglese) e “esperto di link building” (o “link building expert” in inglese).FAQPrima di concludere l’articolo, rispondiamo ad un paio di domande spesso poste riguardo gli strumenti per la verifica del posizionamento di un sito.Quali sono i migliori strumenti per verificare il posizionamento del sito?Il miglior strumenti per monitorare il posizionamento è soggettivo, ma secondo un sondaggio del settore SERPRobot, Ahrefs’ Rank Tracker, Accuranker, e SE Ranking sono quelli più utilizzati.Esiste uno strumento per verificare il posizionamento gratuito?Si, ce ne sono molti. Noi abbiamo il nostro strumento per verificare il posizionamento in maniera totalmente gratuita.Posso monitorare il posizionamento local con un rank tracker?Dipende dallo strumento che utilizzi. Alcuni hanno questa funzionalità; altri no. Puoi tracciare il posizionamento in base al Paese, alla provincia, alla città o al cap all’interno del Rank Tracker di Ahrefs. ConclusioneVerificare il posizionamento di un sito web può diventare una perdita di tempo. Se ti lasci ossessionare da ogni piccola fluttuazione giornaliera, stai utilizzando lo strumento nel modo errato. Il miglior strumento per verificare il posizionamento è quello che ti offre le giuste funzionalità per migliorare la tua SEO e ottenere più traffico.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "I Migliori Strumenti per Verificare il Posizionamento: Come Scegliere Quello Giusto"
    },
    {
      "level": "H2",
      "text": "Cosa significa verificare il posizionamento?"
    },
    {
      "level": "H2",
      "text": "Perché verificare e monitorare il posizionamento è importante?"
    },
    {
      "level": "H2",
      "text": "Perché non puoi verificare il posizionamento tu stesso?"
    },
    {
      "level": "H3",
      "text": "E se uso la modalità incognito?"
    },
    {
      "level": "H2",
      "text": "Come scegliere il miglior strumento per verificare il posizionamento"
    },
    {
      "level": "H3",
      "text": "Supporto per la posizione"
    },
    {
      "level": "H3",
      "text": "Supporto multilingua"
    },
    {
      "level": "H3",
      "text": "Supporto per dispositivo (desktop/mobile)"
    },
    {
      "level": "H3",
      "text": "Tracking delle features in SERP"
    },
    {
      "level": "H3",
      "text": "Aggiornamenti del posizionamento giornalieri"
    },
    {
      "level": "H2",
      "text": "Come utilizzare uno strumento per verificare il posizionamento per migliorare la SEO"
    },
    {
      "level": "H3",
      "text": "Trova le opportunità per accaparrarti i featured snippet"
    },
    {
      "level": "H3",
      "text": "Traccia la share of voice organica per argomento"
    },
    {
      "level": "H3",
      "text": "Trova opportunità semplici per battere i tuoi concorrenti"
    },
    {
      "level": "H3",
      "text": "Trova pagine che hanno bisogno di una rinfrescata"
    },
    {
      "level": "H3",
      "text": "Trova concorrenti per accelerare la tua ricerca parole chiave"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "Quali sono i migliori strumenti per verificare il posizionamento del sito?"
    },
    {
      "level": "H3",
      "text": "Esiste uno strumento per verificare il posizionamento gratuito?"
    },
    {
      "level": "H3",
      "text": "Posso monitorare il posizionamento local con un rank tracker?"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Joshua Hardwick"
}