{
  "url": "https://ahrefs.com/blog/it/motori-di-ricerca-alternativi/",
  "slug": "motori-di-ricerca-alternativi",
  "title": "11 Motori di Ricerca Alternativi a Google e Focalizzati sulla Privacy",
  "description": "Potresti conoscere DuckDuckGo, ma ci sono motori di ricerca più focalizzati sulla privacy che vale la pena provare e li abbiamo testati tutti.",
  "content": "Rebecca Liew Content marketer e scrittrice. Assuefatta dalla parole, dalla cancelleria e dall’esplorare nuovi luoghi a piedi. Contenuti Le alternative a Google sono ovunque, ma sono davvero buone?Per rispondere a questa domanda, ho dato un’occhiata ad alcuni popolari motori di ricerca alternativi per un giorno o due e li ho usati per il mio lavoro.Il mio principale criterio di valutazione è stato l’impegno dei vari motori di ricerca per quel che riguarda la protezione dei dati degli utenti e della privacy. Ecco gli 11 che hanno passato il mio test:StartpageDuckDuckGoBrave SearchSwisscowsSearch EncryptOneSearchMetaGerMojeekQwantEcosiaYou.com1. StartpageStartpage è effettivamente Google senza il monitoraggio. E per questo occupa il primo posto.Secondo il motore di ricerca con sede nei Paesi Bassi, tutte le domande sono anonimizzate prima che i risultati di ricerca vengano estratti da Google. Ciò significa che tutte le informazioni di identificazione sono coperte, incluso il tuo indirizzo IP. Non vengono utilizzati cookie di tracciamento.Startpage rispetta anche il GDPR, un regolamento dell’Unione Europea che protegge i dati degli utenti. Tuttavia, è giusto che tu sappia che il Paese fa parte della Nine Eyes Intelligence Alliance, che condivide i dati di sorveglianza di massa con otto Paesi.Caratteristica da segnalareL’Anonymous View ti consente di visitare siti dai risultati di ricerca in modo anonimo sia da desktop che da dispositivi mobili. Si comporta essenzialmente come una VPN (gratuita).2. DuckDuckGoDuckDuckGo è probabilmente il motore di ricerca privato più noto in circolazione e l’antitesi di Google quando si tratta di favorire la privacy degli utenti (tuttavia monetizza dalle ricerche degli utenti).La cronologia delle ricerche viene salvata in modo non identificabile, il che significa che i cookie di tracciamento e gli identificatori personali, come gli indirizzi IP, non vengono memorizzati.Questo è un enorme vantaggio nonostante il fatto che i risultati siano stati ricavati da 400 fonti, incluso il proprio crawler (DuckDuckBot), siti di crowdsourcing come Wikipedia e partner come Bing e Yahoo.Per testarne l’efficacia, ho inserito le stesse parole chiave in inglese, da “COVID-19 updates” a “Kaws Marina Bay”, sia su Google che su DuckDuckGo. I risultati che ho ottenuto sono spesso simili e ho scoperto che lo stesso vale anche per le ultime notizie.Un possibile aspetto negativo è che DuckDuckGo ha sede negli Stati Uniti e, per estensione, fa parte della Five Eyes Intelligence Alliance, che spesso raccoglie dati di sorveglianza di massa dalle società Internet.Caratteristica da segnalare“Bangs” di DuckDuckGo ti porta direttamente ai risultati di ricerca su altri siti. Ad esempio, digitando “!w” e una parola chiave (ad esempio, !w singapore) si accede direttamente alla pagina di Wikipedia per Singapore.3. Brave SearchMi piace Brave Search perché si focalizza su risultati non filtrati che acquisisce dal suo indice. L’azienda ha fatto l’audace mossa di rinunciare alla sua dipendenza dalla SERPs di Google ad Ottobre del 2021.Dopo aver cercato sia contenuti sempreverdi che notizie del momento, ho scoperto che i risultati sono abbastanza simili a quelli di Google, a patto che tu acconsenta a ricevere risultati locali anonimi.Per una maggiore privacy, puoi scegliere di disattivare il bottone che vedi qui sotto ed eseguire ricerche manuali, ad esempio “cose da fare in [posizione]”.Proprio come gli altri motori di ricerca qui segnalati, non c’è profilazione dell’utente né annunci personalizzati o mirati.Il motore di ricerca fa parte di Brave Software, i cui co-fondatori includono Brendan Eich (creatore di JavaScript e co-fondatore del browser Mozilla Firefox) e Brian Bondy (ex senior platform engineer di Mozilla).Caratteristica da segnalareBrave include pannelli informativi per risposte rapide alle tue domande più importanti, proprio come Google.4. SwisscowsSwisscows è un motore di ricerca con sede in Svizzera che dispone di un proprio indice per le query in lingua tedesca. Per tutte le altre lingue, i risultati vengono estratti da Bing. Ma questo non è un problema, dato che tutte le query di ricerca sono private degli identificatori personali.Il motore di ricerca omette anche l’uso dei cookie di tracciamento e del targeting geografico.Sebbene i risultati di ricerca di Swisscows non siano certamente alla pari di quelli di Google, mi piace perché è adatto alle famiglie: infatti filtra automaticamente i risultati di ricerca violenti e pornografici tramite una funzione che viene attivata di default.Per quanto riguarda la privacy, la Svizzera non fa parte di un’alleanza relativa all’intelligence, ma ha un rapporto chiamato di Mutual Legal Assistance Treaty con gli Stati Uniti.Caratteristica da segnalareSwisscows dispone di “mappe semantiche” per aiutarti a perfezionare le tue ricerche.5. Search EncryptSearch Encrypt si serve, per ottenere i risultati, dai suoi partner per i contenuti e dai motori di ricerca (inclusi Google, Bing e Yahoo), anche se in modo sicuro per la privacy.Come gli altri motori di ricerca presenti in questo elenco, Search Encrypt rende anonime le query di ricerca, non conserva i registri del server o gli indirizzi IP e non memorizza i cookie di tracciamento.Quando si tratta di ricerche, i termini vengono crittografati localmente prima di essere inviati ai server. Dopo 30 minuti di inattività, la cronologia di navigazione viene cancellata.Tuttavia, Search Encrypt memorizza i tuoi dati di ricerca (sebbene senza nessuno dei tuoi identificatori personali) per migliorare le prestazioni del suo prodotto.Ho trovato i suoi risultati di ricerca paragonabili a quelli di Ecosia. Quindi, anche se non è proprio in cima alla lista con DuckDuckGo e Startpage, Search Encrypt è abbastanza affidabile e può essere utilizzato per tutti i tipi di query, sia navigazionali che transazionali che informativi.Caratteristica da segnalareSe non sei ti piacciono i risultati ottenuti o vuoi confrontarli rapidamente, puoi farlo facilmente utilizzando la funzione “riprova questa ricerca” situata nella parte superiore della pagina.6. OneSearchDi proprietà della società madre di Yahoo, Verizon Media, OneSearch sostiene di essere un motore di ricerca orientato alla privacy, con risultati di ricerca estratti da Bing.Nessun cookie viene memorizzato e i dati personali identificabili non vengono condivisi con gli inserzionisti. Ho esaminato anche la sua policy sulla privacy e credo che questo motore di ricerca sia abbastanza sicuro. Va però detto che OneSearch ti profila based in base alle parole di ricerca e alla tua posizione imprecisa ogni volta che cerchi qualcosa. Quindi potresti ricevere annunci contestuali o informazioni plausibili sui tuoi interessi in base alle parole chiave di ricerca. Tuttavia, non esiste una profilazione personale o un retargeting.Mi piacciono gli elementi aggiuntivi presenti in questo motore di ricerca: la funzione SafeSearch, la possibilità di impostare una posizione più specifica e le “Opzioni di Privacy Avanzate” (vedi sotto).Caratteristica da segnalareAttiva l’“Advanced Privacy Mode”per crittografare i termini di ricerca e gli URL, così da mascherare il contenuto della tua ricerca a terze parti.7. MetaGerMetaGer è un metamotore di ricerca open source con sede in Germania. Come Ecosia, i suoi server funzionano con energia rinnovabile.I risultati vengono estratti da Scopia, Bing, OneNewspage e OneNewspage (Video), quindi sono piuttosto tempestivi. Puoi anche deselezionare i motori di ricerca utilizzati o creare una lista nera di siti Web nelle impostazioni.Mi piace molto la transparenza di MetaGer nella gestione delle informazioni dell’utente, dalle query alle mappe. Tuttavia il motore di ricerca memorizza il tuo indirizzo IP completo per 96 ore e il tuo nome e indirizzo email vengono conservati se compili il modulo di contatto.Nonostante questo, utilizza un proxy anonimo che ti assicura di mantenere il pieno controllo sui tuoi dati.Caratteristica da segnalareIl box “Did you know”’ (alla destra dei risultati di ricerca) offre curiosità su MetaGer e su come perfezionare le tue ricerche. Puoi cliccare sul testo per vedere la lista completa di suggerimenti.8. MojeekMojeek è un motore di ricerca basato su crawler con il proprio indice di ricerca pari a più di 4 miliardi di pagine. Questo lo rende eccellente per informazioni imparziali ma significa anche che potrebbero esserci risultati limitati, poiché non estrae risultati da altri motori di ricerca.Tuttavia, mi piace il motore di ricerca per la sua semplice politica di non tracciamento. I tuoi dati personali non verranno mai venduti o distribuiti, che è un enorme vantaggio. Se riempi il suo modulo di contatto puoi anche richiedere la cancellazione delle informazioni, come da GDPR.Detto questo, Mojeek ha sede nel Regno Unito, e fa parte della Five Eyes Intelligence Alliance proprio come DuckDuckGo.Caratteristica da segnalareLa funzione di classificazione della ricerca basata sulle emozioni ti consente di inserire una parola chiave e cercare per emozione.9. QwantQwant è un motore di ricerca con sede a Parigi i cui risultati di ricerca sono alimentati da Bing e dal proprio web crawler. È completamente accessibile in oltre 30 Paesi ma, purtroppo per noi, non a Singapore.Il mio collega, SQ, ha trovato l’accuratezza dei risultati di ricerca abbastanza decente. Ma non aspettarti risposte specifiche per posizione, poiché Qwant non tiene traccia della tua geolocalizzazione.Inoltre non raccoglie dati né utilizza cookie di tracciamento anche se mantiene il tuo indirizzo IP per scopi di rilevamento delle frodi. Se preferisci il completo anonimato, Qwant suggerisce l’uso di una VPN o di un TORCome Startpage, Qwant offre la protezione GDPR. La Francia, tuttavia, fa parte della Five Eyes Intelligence Alliance.Caratteristica da segnalareEsistono “scorciatoie di ricerca” che ti offrono un rapido accesso a siti specifici. Ad esempio, utilizzando il termine “&a books” (in inglese) si ottengono risultati dalla categoria dei libri di Amazon.Controlla la lista delle scorciatoie qui.10. EcosiaSapevi che ogni azione che fai sul tuo dispositivo digitale emette anidride carbonica? E Google gioca un ruolo importante in questo: è responsabile di circa il 40% dell’impronta di carbonio di Internet.Per contrastare questa situazione, il motore di ricerca privato Ecosia dona l’80% del suo profitto a progetti che si occupano di piantare alberi, in media un albero ogni 45 ricerche. Ha anche costruito un impianto solare in modo che i suoi server possano funzionare con energia pulita.Nel complesso, ho trovato i suoi risultati di ricerca abbastanza vicini a quelli di Google.Ecosia non è completamente privato: raccoglie dati di ricerca e informazioni di identificazione personale, che vengono anonimizzati dopo sette giorni. Ma riteniamo che l’utilizzo del motore di ricerca sia un buon compromesso, poiché cerca di affrontare il cambiamento climatico.Caratteristica da segnalareIl numero delle tue ricerche viene mostrato su un tabellone (a meno che tu non scelga di cancellare i cookie del tuo browser), permettendoti di tenere traccia del tuo impatto sull’ambiente.11. You.comA completare la lista c’è You.com. Il motore di ricerca in fase beta offre un’esperienza altamente personalizzabile: i risultati della ricerca vengono visualizzati su una pagina Web ma sono suddivisi in diverse sezioni che puoi riorganizzare in base alle tue preferenze.Per personalizzare ulteriormente i tuoi risultati, crea un account per aggiungere e salvare app nella tua dashboard (scopri di più nel box di seguito). Queste app sono essenzialmente le tue fonti di informazioni preferite e verranno visualizzate insieme ai risultati di ricerca.Sebbene sia una funzionalità accurata, significa anche che i tuoi cookie proprietari verranno archiviati per attività di personalizzazione. In alternativa, puoi eliminare completamente il tracciamento dei cookie proprietari navigando in privato o con una VPN.Ho trovato i risultati di ricerca per varie parole chiave in inglese (per esempio “ahrefs” e “covid-19 singapore daily cases”) paragonabili a quelli di Google. E se alcuni risultati sono estrapolati da Microsoft, You.com sostiene che i dati degli utenti sono tenuti al sicuro e non venduti agli inserzionisti. Anche l’azienda è carbon neutral. Caratteristica da segnalarePersonalizza i tuoi risultati di ricerca aggiungendo app al tuo feed: ci sono decine di categorie tra cui scegliere. Puoi persino aggiungere app per sviluppatori, come Github, alla tua dashboard.ConclusioniSe è vero che Google domina il mercato globale dei motori di ricerca, è anche vero che ha ricevuto e sta ricevendo parecchie critiche: problemi di antitrust, definizione di risultati non accurati, violazione della privacy utente e molto altro.Per gli utenti, i motori di ricerca alternativi possono essere una soluzione da considerare. Ma non credermi sulla parola; prova quelli che trovi in questo elenco per decidere quale funziona meglio per te.Hai domande o commenti? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Rebecca Liew Content marketer e scrittrice. Assuefatta dalla parole, dalla cancelleria e dall’esplorare nuovi luoghi a piedi.",
  "headers": [
    {
      "level": "H1",
      "text": "11 Motori di Ricerca Alternativi a Google e Focalizzati sulla Privacy"
    },
    {
      "level": "H2",
      "text": "1. Startpage"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "2. DuckDuckGo"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "3. Brave Search"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "4. Swisscows"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "5. Search Encrypt"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "6. OneSearch"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "7. MetaGer"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "8. Mojeek"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "9. Qwant"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "10. Ecosia"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "11. You.com"
    },
    {
      "level": "H3",
      "text": "Caratteristica da segnalare"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Rebecca Liew"
}