{
  "url": "https://ahrefs.com/blog/it/not-provided/",
  "slug": "not-provided",
  "title": "'Not Provided' in Google Analytics: Come Recuperare i Dati Sulle Tue Keywords",
  "description": "Google Analytics nasconde le tue parole chiave organiche alla voce \"Not provided\". Ecco come risolvere questo problema e utilizzare i tuoi dati per la SEO.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti In Google Analytics, quando vedi la voce “(not provided)” invece delle parole chiave che hanno portato le persone sul tuo sito, significa che Google sta nascondendo i dati relativi alla parole chiave organiche per proteggere la privacy degli utenti.Ma non preoccuparti, questo non significa che hai configurato Google Analytics in modo errato o che i tuoi dati sono andati persi. In questo articolo, ti daremo due soluzioni per risolvere il problema dei “not provided” e alcuni suggerimenti su come utilizzare i dati sulle parole chiave:Soluzione 1. Utilizza Google Search ConsoleSoluzione 2. Utilizza Ahrefs Webmaster Tools3 suggerimenti per utilizzare i dati sulle parole chiaveNota a margine.Mentre sto scrivendo questo articolo, Google Analytics 4 (il successore di Universal Analytics) per impostazione predefinita non mostra alcuna parola chiave organica (e nemmeno la categoria “Not provided”) nel report. Per risolvere questo problema, puoi utilizzare le stesse soluzioni mostrate in questo articolo.Soluzione 1. Utilizza Google Search Console (gratuito)Google Search Console (GSC) è uno strumento gratuito di Google progettato per monitorare e risolvere i problemi relativi all’aspetto del tuo sito Web nei risultati di ricerca. Oltre a rivelare quali sono le parole chiave organiche che hanno portato persone sul tuo sito Web, puoi utilizzare GSC per trovare e correggere errori tecnici, inviare mappe del sito, visualizzare backlink e altro ancora.Per visualizzare i dati delle tue parole chiave organiche, devi impostare lo strumento correttamente. Puoi imparare come farlo grazie alla nostra guida per impostare GSC.Ora, vediamo che tipo di dati troverai in GSC. Iniziamo con il motivo principale per cui vuoi utilizzare GSC: puoi vedere le tue parole chiave organiche nel rapporto sul rendimento, che troverai qui:Una volta che i tuoi dati saranno disponibili, vedrai le tue parole chiave nella scheda Query situata nel pannello inferiore:Ecco cosa significano questi dati:Top queries si riferisce alle query di ricerca di Google (ad es. parole chiave) che hanno generato impressioni sul tuo sito web. Ciò significa che ogni volta che l’URL del tuo sito viene visualizzato nei risultati di ricerca di Google (può essere ricerca web, ricerca immagini, ricerca video o Google News), la parola chiave che ha generato quell’impressione verrà segnalata qui;Clicks sono il numero di clic che arrivano al tuo sito dai risultati di ricerca organici. Tieni presente che questo esclude i risultati di ricerca di Google Ads a pagamento. Qualsiasi clic che porta l’utente al di fuori dei risultati della ricerca è considerato un clic. E quando qualcuno fa clic su un link a una pagina, torna alla SERP (pagina dei risultati del motore di ricerca) e quindi clicca di nuovo su quella pagina, conta solo un clic;Impressions sono il numero di volte in cui qualsiasi URL del tuo sito è apparsa nei risultati di ricerca. Nota che questo non implica necessariamente che la persona che ha effettuato la ricerca ha automaticamente visto il tuo sito ma solo che è apparso nei risultati di ricerca.Potrebbe volerci del tempo prima che Google inizi a mostrare i tuoi dati. Ma la buona notizia è che una volta inseriti i tuoi dati, vedrai fino a 16 mesi di dati retroattivi.Nota a margine.Sebbene GSC offra informazioni sulle query che hanno indirizzato gli utenti al tuo sito Web, non mostra tutti i dati. La prima limitazione è che Google non mostra query molto rare (ovvero eseguite solo da pochi utenti, quelle che Google chiama “query anonime”). In secondo luogo, GSC ti mostrerà solo fino a 1.000 parole chiave.Altre schede nel rapporto sul Rendimento ti mostreranno clic e impressioni per:URL delle pagine visitate provenienti dalle SERP;Paesi da cui proviene la ricerca.Il tipo di dispositivo su cui è stata eseguita la ricerca;Dati raggruppati per tipi o caratteristiche specifiche dei risultati di ricerca (scheda Aspetto ricerca). Questi dati sono riservati ai risultati di ricerca diversi dai tipici link blu, per esempio gallerie di ricette, frammenti di recensioni, video, risultati di istruzioni e altro.Date (nel fuso orario del Pacifico). Tutto qua. La prima soluzione per le parole chiave “not provided” è semplice come impostare GSC e attendere che i tuoi dati vengano elaborati. Ma prima di passare alla seconda soluzione, vediamo che altro offre Google nel rapporto sul rendimento.Partendo dall’alto, abbiamo i filtri.I filtri permettono di visualizzare solo i dati che soddisfano determinati criteri. Per impostazione predefinita, puoi filtrare per tipo di ricerca e data. Inoltre, il filtro “Tipo di ricerca” consente di confrontare le fonti:Puoi anche attivare filtri aggiuntivi per una query, una pagina, un Paese o un dispositivo specifici.Sotto i filtri, abbiamo il pannello generale con un altro set di filtri e un grafico che mostra dinamicamente il set di dati nei filtri e tracciato rispetto al tempo. Questi filtri influiscono anche sui dati mostrati nel rapporto sulle parole chiave. Quindi se selezioni il filtro CTR, i dati relativi al CTR verranno mostrati accanto a “Clic” e “Impressioni”:Poiché abbiamo già parlato di clic e impressioni, vediamo cosa sono CTR (percentuale di clic) e posizione media:CTR è la percentuale di impressioni organiche che si traducono in un clic;Posizione è la posizione media del tuo sito nei risultati di ricerca calcolata prendendo come base la posizione più alta del sito ogni volta che appare in una ricerca.Vale la pena notare che gli utenti di Universal Analytics e Google Analytics 4 possono integrare i dati GSC in Analytics per visualizzare tutti i dati in un unico strumento.Per integrare Google Universal Analytics in GSC, assicurati di aver impostato entrambi i servizi per la stessa proprietà. Quindi accedi al tuo Google Analytics e:Scegli la tua proprietà (ovvero, il sito web di cui desideri visualizzare i dati);Vai al pannello di amministrazione;Nella sezione Product Linking, scegli All products;Cerca “Search Console” e clicca su Link Search Console;Segui i passaggi della procedura guidata di configurazione per connettere i tuoi dati GSC con i dati di Universal Analytics.Per integrare il tuo Google Analytics 4 con GSC, assicurati di aver impostato entrambi i servizi per la stessa proprietà. Quindi accedi al tuo Google Analytics e:Scegli la tua proprietà (ovvero, il sito web di cui desideri visualizzare i dati);Vai al pannello di Admin;Nella sezione Product Linking, scegli Search Console Linking. Se non vedi ancora questa opzione, potrebbe essere necessario attendere alcuni giorni; questo perché la funzione di integrazione è ancora in fase di implementazione;Nel pannello Search Console, clicca su Link;Segui i passaggi della procedura guidata di configurazione per connettere i tuoi dati GSC con i dati di Universal Analytics.Questo è quello che devi fare per per sbloccare i dati delle tue parole chiave organiche in Google Analytics con l’aiuto di Search Console, la nostra prima soluzione. Ma questa non è la tua sola opzione e siamo pronti per passare alla seconda soluzione per decifrare le parole “Not provided”.Soluzione 2. Utilizza Ahrefs Webmaster Tools (gratuito)Come già accennato GSC ha i suoi limiti, il più importante dei quali è il limite di 1.000 parole chiave. Se hai bisogno di aggirare questo limite, puoi prendere in considerazione uno strumento SEO come l’Ahrefs Webmaster Tools (AWT).È il nostro strumento gratuito che ti consente di migliorare le prestazioni SEO del tuo sito Web e ottenere più traffico di ricerca. AWT presenta quattro vantaggi principali rispetto a GSC quando si tratta di parole chiave organiche. Ti mostra:Tutte le parole chiave conosciute. Nessun limite di 1.000 parole chiave;Metriche SEO per pagine e parole chiave;Un’istantanea SERP spersonalizzata con dati competitivi;Funzionalità SERP per ogni parola chiave.Nota a margine. Inoltre, con un account Ahrefs premium, puoi accedere ai tuoi dati storici relativi al posizionamento, così come i dati storici relativi ai backlink.Vediamo quindi come funziona AWT. Una volta impostato, fai clic sul widget “Parole chiave organiche” nella panoramica del progetto…… e verrai indirizzato al rapporto sulle Parole Chiave Organiche:Per impostazione predefinita, ti verranno presentati i seguenti dati (da sinistra a destra):Parole chiave che sono state utilizzate per trovare il tuo sito web: la tua soluzione al problema “not provided”;SF sta per SERP Features che appaiono nei risultati di ricerca per una parola chiave;Il Volume mostra il numero medio di ricerche mensili per una parola chiave;La Keyword Difficulty (KD) fornisce una stima di quanto sia difficile posizionarsi tra i primi 10 risultati di ricerca organica per una parola chiave, su una scala di 100 punti;Il Costo per Clic (CPC) mostra il prezzo medio che gli inserzionisti pagano per ogni clic sull’annuncio nei risultati di ricerca a pagamento per una parola chiave;Il Traffico mostra una stima del traffico di ricerca organico mensile che la tua pagina riceve da una determinata parola chiave;Modifica (accanto a Traffico) si riferisce alla variazione del traffico tra le date selezionate;Posizione si riferisce alla posizione più alta della tua pagina per una parola chiave;Il Cambio (accanto a Posizione) si riferisce al cambio di posizione tra le date selezionate.URL si riferisce all’URL che si posizione nei risultati di ricerca per una parola chiave.Sopra i dati delle tue parole chiave, ci sono filtri che puoi utilizzare per visualizzare dati che soddisfano determinati criteri, come il Paese da cui proviene la parola chiave, la posizione nella SERP, il volume di ricerca o la ricerca di una determinata parola chiave. Come visto negli screenshot sopra, c’è molto che puoi fare con l’Ahrefs Webmaster Tools. Qui ti stiamo facendo vedere solo una piccola parte delle funzionalità relative alle parole chiave organiche. Nel video qui sotto, prendiamo in esame altre funzionalità che possono aiutarti nella SEO e ti mostriamo anche come impostarlo. https://youtu.be/ipTk-qGrNlcQuindi il gioco è fatto: due diverse soluzioni al problema “Not provided”. Entrambe sono gratuite quindi non devi fare altro che provarle senza alcun impegno e puoi persino utilizzarle in parallelo.e hai già GSC attivo e funzionante configurare l’Ahrefs Webmaster Tools è ancora più semplice, poiché puoi verificare la tua proprietà al suo interno utilizzando GSC. Inoltre, puoi vedere la panoramica dei dati GSC direttamente in AWT.Un’ultima cosa che vale la pena sapere su queste soluzioni è che visualizzano i dati utilizzando fonti diverse. Google visualizza i dati dai propri servizi mentre Ahrefs aggrega i dati da diverse fonti.3 suggerimenti per utilizzare i dati sulle parole chiaveSapere quali parole chiave organiche portano traffico al tuo sito web è davvero utile. Questo perché puoi usare queste informazioni per migliorare le tue strategie SEO e far crescere il tuo traffico organico. Ecco tre idee veloci per farlo. In questa sezione utilizzeremo sia GSC che Ahrefs Webmaster Tools.1. Ottimizza le pagine con parole chiave che performano peggioLe parole chiave con prestazioni di basso livello sono quelle per le quali non ti posizioni nelle posizioni 1 o 2. Il motivo è che la maggior parte delle persone clicca su uno dei primi due risultati di ricerca e se non esci tra questi risultati perderai molto traffico organico.La posizione n. 6 per una parola chiave competitiva è davvero buona, ma quella posizione ci garantisce meno della metà del traffico organico che ottengono le pagine posizionate più alto.Per trovare le tue parole chiave con prestazioni insufficienti utilizzando Ahrefs Webmaster Tools, accedi al tuo rapporto sulle Parole Chiave Organiche facendo clic sul widget “Parole chiave organiche” nella panoramica del progetto. Una volta nel rapporto, imposta il Paese per cui desideri visualizzare i dati e imposta il filtro Posizione su “3”.In un lampo, otterrai un elenco di parole chiave che si posizionano dalla posizione 3 in giù. Queste sono le parole chiave che performano peggio.Ora puoi dare un’occhiata a quell’elenco per creare una lista di pagine da ottimizzare. Una buona pratica è usare lo strumento SERP per vedere chi si posiziona sopra di te nei risultati. In questo modo, puoi valutare la probabilità di superarli. Per chiarire questo punto ti basta sapere che noi abbiamo poche possibilità di superare Google per la parola chiave “Google keyword planner”.Per quanto riguarda l’ottimizzazione stessa, ecco alcune idee su cosa puoi fare:Migliorare la SEO on-pageAggiungere link interni più pertinentiOttenere più backlink2. Ottimizza le pagine con un CTR basso ma ben posizionateSe ricordi quanto scritto nelle sezioni precedenti, il CTR è la percentuale di impressioni organiche che si traducono in un clic sul tuo sito.Generalmente una pagina che si posiziona in alto sulla SERP dovrebbe avere un CTR alto dal momento che le persone tendono a cliccare sui risultati di ricerca che si trovano in cima. E maggiore è il CTR, maggiore è il traffico verso il tuo sito.Ma in alcuni casi, le pagine posizionate più alto possono avere un CTR inferiore alla media. Con l’aiuto di GSC, puoi trovare rapidamente queste pagine, analizzare la causa delle loro prestazioni e vedere se c’è un modo per migliorare il CTR.Per fare ciò, vai al report sulla Performance in GSC. Spunta i filtri CTR medio e “Posizione media”. Quindi filtra le parole chiave in posizione media pari a 3,1. In questo modo, vedrai le pagine per le quali la pagina si posiziona tra le prime tre.Adesso ordina il rapporto per CTR in ordine crescente. Quindi cerca le parole chiave con molte impressioni ma CTR basso. Ecco un esempio di una parola di questo tipo.Come probabilmente puoi intuire, per la posizione n. 3 nella SERP, il CTR dovrebbe essere molto più alto. Ciò significa che in qualche modo stiamo perdendo molto traffico potenziale che potrebbe andare al nostro articolo sulla SEO Fai Da Te.Nel caso di questa parola chiave, la causa delle scarse prestazioni può essere vista solo analizzando la SERP. La nostra pagina web, sebbene sia in alto in classifica, è “sepolta” sotto annunci, uno snippet in primo piano, un carosello video e il box Le Persone Hanno Chiesto Anche. Questi elementi della SERP probabilmente catalizzano l’attenzione di chi cerca.Quindi una soluzione, in questo caso, potrebbe essere quella di cercare di ottimizzare il nostro articolo sulla SEO Fai Da Te per finire in un featured snippet.3. Trova parole chiave facili per le quali posizionartiCome forse saprai, una singola pagina può posizionarsi per centinaia di parole chiave (abbiamo anche uno studio su questo argomento). Alcune delle parole chiave possono persino causare il posizionamento involontario di una pagina. Ciò significa che Google può associare una pagina Web a una parola chiave anche se non hai collegato in modo specifico la parola chiave a quella pagina.Quando ciò accade, è un segno che devi creare nuovi contenuti ottimizzati per quella parola chiave “non intenzionale”. In tal caso, potresti ottenere più traffico di quello che ricevi attualmente. E più basso è il KD, più facile è creare contenuti che si posizioneranno in alto.Puoi cercare parole chiave a bassa difficoltà utilizzando la metrica di KD presente nell’Ahrefs Webmaster Tools. Basta aprire il rapporto sulle Parole Chiave Organiche e inserire nell’apposito campo KD un valore basso, per esempio “20”.. Quindi ordina i risultati in base al volume per individuare le opportunità con il potenziale più alto. Ecco un esempio relativo a un blog sul web design:Come puoi vedere, la parola chiave “tinder ui” ha un volume di ricerca elevato. Ma non porta traffico alla pagina che si posiziona per questa a causa della posizione bassa nella SERP. Tuttavia, la creazione di nuovi contenuti dedicati a quella parola chiave potrebbe aiutare il blog a posizionarsi più in alto e ottenere traffico organico aggiuntivo.ConclusioniIn questo articolo, abbiamo analizzato due diverse soluzioni per i rapporti sulle parole chiave incompleti in Google Analytics (sia per Universal Analytics che per Google Analytics 4). Sia Search Console che l’Ahrefs Webmaster Tools ti danno informazioni sulle parole chiave organiche che portano le persone sul tuo sito Web e/o fanno apparire il tuo sito nei risultati di ricerca.Ma se vuoi andare oltre la semplice informazione relativa a quali sono le tue parole chiave organiche, ti consiglio di utilizzare entrambi gli strumenti gratuiti in parallelo. In questo modo, avrai accesso a più dati e potrai individuare più opportunità di crescita, come mostrato nei tre suggerimenti SEO qui sopra.E se hai intenzione di far crescere il traffico organico, strumenti come GSC e AWT sono semplicemente indispensabili.Vuoi scoprire di più sulle tattiche SEO menzionate qui? Leggi la nostra guida completa sulla SEO.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "‘Not Provided’ in Google Analytics: Come Recuperare i Dati Sulle Tue Keywords"
    },
    {
      "level": "H2",
      "text": "Soluzione 1. Utilizza Google Search Console (gratuito)"
    },
    {
      "level": "H2",
      "text": "Soluzione 2. Utilizza Ahrefs Webmaster Tools (gratuito)"
    },
    {
      "level": "H2",
      "text": "3 suggerimenti per utilizzare i dati sulle parole chiave"
    },
    {
      "level": "H3",
      "text": "1. Ottimizza le pagine con parole chiave che performano peggio"
    },
    {
      "level": "H3",
      "text": "2. Ottimizza le pagine con un CTR basso ma ben posizionate"
    },
    {
      "level": "H3",
      "text": "3. Trova parole chiave facili per le quali posizionarti"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Mateusz Makosiewicz"
}