{
  "url": "https://ahrefs.com/blog/it/obiettivi-seo/",
  "slug": "obiettivi-seo",
  "title": "Come Definire i Giusti Obiettivi SEO - con 3 Esempi",
  "description": "Gli obiettivi SEO sono dei risultati misurabili e specifici che vuoi raggiungere in un determinato arco temporale.",
  "content": "Kayle Larkin Stratega SEM. Mi impegno per rendere gli analytics facili da comprendere e accessibili a tutti gli imprenditori. Contenuti Come esperti SEO, tendiamo a darci obiettivi generici perché ci sono molti fattori che non riusciamo a controllare. “Non possiamo fare alcuna promessa sui risultati che otterremo”.Il problema è che, senza una chiara visione strategica, è difficile raggiungere dei risultati.Lo stesso ragionamento è valido se gli obiettivi che ci diamo sono vaghi o eccessivamente stringenti.In questa guida imparerai a definire correttamente i traguardi da raggiungere utilizzando il sistema chiamato “piramide degli obiettivi SEO”.Cosa sono gli obiettivi SEOPerché definire degli obiettivi SEO è importanteCome definire degli obiettivi SEO3 esempi di buoni obiettivi SEOCosa sono gli obiettivi SEO?Gli obiettivi SEO sono obiettivi specifici e misurabili che vuoi raggiungere in un arco temporale specifico. Ogni obiettivo dovrebbe contribuire allo scopo finale della SEO: raggiungere più utenti potenziali attraverso la ricerca organica e trasformarli in clienti.Perché è importante definire degli obiettivi SEO?Definire degli obiettivi SEO è importante perché ti aiuta a definire una strategia più chiara e specifica, definendo dei traguardi da raggiungere. Se non hai degli obiettivi SEO, stai brancolando nel buio. Non avere obiettivi non è mai una buona idea, perché è improbabile che raggiungerai i tuoi traguardi senza impegnarti fattivamente nel loro raggiungimento.Come definire degli obiettivi SEOI marketer compiono spesso l’errore di definire degli obiettivi SEO troppo generici, come ad esempio “ottenere più traffico”.Il problema principale dell’avere obiettivi troppo generici è che non definiscono in alcun modo il cosa e il come. Cosa farai per arrivare all’obiettivo? Come farai a raggiungerlo?Per aiutarti a risolvere questo problema, abbiamo creato la piramide degli obiettivi SEO:Ecco come utilizzarla: Definisci l’obiettivo principale. Questo è il principale risultato che vuoi raggiungere e l’arco temporale nel quale farlo. Pensa a questo punto come il torneo che stai provando a vincere. Dividi l’obiettivo principale in obiettivi di performance. Questi sono obiettivi più piccoli che contribuiscono al raggiungimento del risultato finale. Puoi pensare a questi come a dei gol in una partita di calcio. Dividi gli obiettivi di performance in obiettivi di processo. Questi sono obiettivi ancora più piccoli che puoi controllare direttamente. Continuando l’analogia della partita di calcio, questi rappresentano contro chi e dove stai giocando.L’idea è quella di dividere il tuo obiettivo principale in micro-obiettivi così da renderlo più semplice da raggiungere. Man mano che completi gli obiettivi di processo, diventa più facile completare i tuoi obiettivi di performance. E man mano che completi i tuoi obiettivi di performance, sarà sempre più probabile raggiungere il tuo obiettivo principale.Guardiamo più da vicino ogni fase del processo così da comprenderlo meglio e definire il nostro primo framework.1. Definisci un obiettivo principaleIl tuo obiettivo principale dovrebbe essere quello di allineare i tuoi sforzi SEO agli obiettivi aziendali. Devi chiederti:Quali risultati, da un punto di vista SEO, contribuiscono al raggiungimento dei più ampi obiettivi aziendali? Analizzare la mission aziendale, le domande poste con maggiore frequenza durante le riunioni, ecc. può aiutarti a trovare la risposta. Se sei bloccato nella definizione della strategia la cosa migliore da fare è chiedere direttamente al tuo manager o al tuo cliente.Qualunque sia la tua strategia, l’importante è non cadere nella trappola dell’ “ottenere più traffico”. Anche se ottenere più traffico potrebbe infatti aiutarti a raggiungere gli obiettivi aziendali, è decisamente un obiettivo troppo vago. Il tuo obiettivo principale deve invece essere SMART: specifico (Specific) , misurabile (Measurable) , raggiungibile (Achievable), pertinente (Relevant) e prendere in considerazione l’arco temporale di cui hai bisogno per raggiungerlo (Time-based).Quindi, invece di cercare di “ottenere più traffico”, un buon obiettivo potrebbe essere “posizionarsi nella top 3 per [parola chiave di alto valore] nel corso dei prossimi 6 mesi”.Questo obiettivo è specifico e pertinente, perché posizionarsi per la [parola chiave di alto valore] contribuirà ad aumentare il fatturato. É misurabile in quanto puoi tracciare il posizionamento delle parole chiave con un buon rank tracker, come il Rank Tracker di Ahrefs. É raggiungibile, in quanto dovresti aver già stimato la keyword difficulty. L’obiettivo integra anche il fattore tempo, in quanto hai specificato l’arco temporale nel quale raggiungere il risultato.Ecco quindi la nostra piramide degli obiettivi SEO aggiornata:2. Definisci gli obiettivi di performanceGli obiettivi di performance sono i traguardi che definisci per te stesso e che puoi quindi identificare rispondendo alla seguente domanda:Quali azioni a breve termine hanno maggiori possibilità di portarci verso l’obiettivo principale?Puoi avere uno o più obiettivi di performance. Tali obiettivi dipendono dal tuo obiettivo principale e la sua portata. Presta attenzione a non cadere nella classica trappola del definire obiettivi troppo generici come ad esempio “ottenere più backlink”. Questo potrebbe infatti aiutarti a raggiungere il risultato desiderato, ma non sarebbe un obiettivo SMART. Non puoi misurare infatti quando o se hai raggiunto questo obiettivo.Continuando con il nostro esempio che ha come obiettivo principale “posizionarsi nella top 3 per [parola chiave di alto valore] nel corso dei prossimi 6 mesi”, un obiettivo di performance SMART potrebbe essere quello di “ottenere 40 backlink di alta qualità sulla pagina nel corso dei prossimi 6 mesi”.Questo obiettivo è specifico perché miriamo ad ottenere un numero di backlink ben definito.Ancora, l’obiettivo è misurabile, in quanto possiamo utilizzare il grafico dei domini referral all’interno del Site Explorer di Ahrefs:É raggiungibile perché realistico. Ci sono azioni che possiamo controllare che possono portarci più vicini al raggiungimento dell’obiettivo.É pertinente perché sappiamo che i backlink sono un importante fattore di ranking, ed esiste una forte evidenza su come la nostra pagina stia sotto performando in termini di backlink.Dipende dal fattore tempo in quanto ha un termine di sei mesi che coincide con quello del nostro obiettivo principale.Ancora più importante è il fatto che raggiungere questo obiettivo di performance ci aiuterà a prendere la giusta strada per raggiungere il nostro obiettivo principale.Ecco quindi la nostra piramide degli obiettivi SEO nuovamente aggiornata:Nota a margine. Se devi impostare 4 o + obiettivi di performance per raggiungere il risultato desiderato, questo potrebbe significare che l’obiettivo principale scelto è troppo vago e non realistico. Torna indietro, e ripercorri il primo step per definire un obiettivo più realistico.3. Definisci gli obiettivi di processoGli obiettivi di processo sono azioni misurabili che sono completamente sotto il tuo controllo. Per trovarli puoi rispondere alla seguente domande:Di cosa ho bisogno per raggiungere i miei obiettivi di performance? Continuando con il nostro esempio abbiamo visto come il nostro obiettivo sia quello di posizionarci nella top 3 per la parola chiave “x” entro 6 mesi. Abbiamo anche impostato un obiettivo di performance rappresentato dall’ottenere 40 backlink di alta qualità verso la nostra pagina.Cosa dobbiamo fare per ottenere i 40 backlink di alta qualità verso la pagina nel corso dei prossimi sei mesi?Poniamo caso di aver deciso di voler attivare una campagna di tipo ‘skyscraper’. Ipotizzando di ottenere un tasso di conversione medio del 5% dalle nostre email di outreach, possiamo costruire il percorso a ritroso per creare un obiettivo di processo che ci ponga in una posizione favorevole al raggiungimento del nostro obiettivo di performance. Facciamo insieme qualche calcoloi:40 backlinks / 5% tasso medio di conversione = 800 email800 email / 6 mesi = ~133 email/meseQuindi il nostro obiettivo di processo è di inviare 133 email di outreach di tipologia ‘skyscraper’ al mese per sei mesi.Ecco la nostra piramide degli obiettivi SEO ulteriormente aggiornata:Nota a margine. Come per gli obiettivi di performance, puoi creare diversi obiettivi di processo. Ad esempio, potresti avere difficoltà nel trovare abbastanza prospect a cui inviare 1,200 email. In questo caso potresti quindi affiancare un’altra tattica di link building alla campagna, come la tattica della pagina risorse ed impostare quindi un secondo obiettivo di processo. 3 esempi di buoni obiettivi SEODato che gli obiettivi SEO dovrebbero allinearsi a quelli aziendali, non posso dirti esattamente quali obiettivi SEO seguire. Il settore nel quale operi, quanto è forte il tuo brand e la competitività della tua nicchia hanno un peso importante nell’equazione utilizzata per definire i tuoi obiettivi — insieme ad altri fattori.Posso però mostrarti alcuni esempi per farti sentire più a tuo agio nell’utilizzo di questo framework per gli obiettivi SEO.Incrementare la “share of voice” del 20% in 12 mesiIncrementare l’engagement rate del traffico organico del 10% in 6 mesiRaggiungere 10,000$ in vendite dal traffico organico entro il sesto meseObiettivo SEO di esempio #1: Incrementare la share of voice del 20% in 12 mesiLa search engine optimization è una forma di marketing piuttosto competitiva. Essenzialmente, siamo tutti in forte competizione per spazio (e attenzione) all’interno di un ambiente molto ristretto. Potresti aver sentito il tuo manager o il tuo cliente dire “distruggi i competitor”.Cosa significa? Come si può fare? Cosa determina le possibilità di successo?“Distruggere i tuoi competitor” è troppo vago.Utilizzando questo framework per gli obiettivi SEO, puoi trasformare la frase “distruggi i tuoi competitor” in un obiettivo specifico e misurabile.Il primo passo è quello di allineare i tuoi sforzi SEO con gli obiettivi dell’azienda. Quale risultato può contribuire al raggiungimento degli obiettivi aziendali in modo migliore rispetto al “distruggere i tuoi competitor?” In questo caso, un obiettivo come “incrementare la share of voice del 20% in 12 mesi” sarebbe un obiettivo principale di tipo SMART.É specifico in quanto abbiamo definito una percentuale in un dato arco temporale—non è un obiettivo indefinito.É misurabile, utilizzando il report Competitors Overview nel Rank Tracker di Ahrefs.É raggiungibile perché il 20% in 12 mesi è una proposta piuttosto realistica.É pertinente agli obiettivi aziendali in quanto essenzialmente si tratta della visibilità organica del nostro sito rispetto a quella dei competitor.Ed è anche misurabile nel tempo perché ci siamo dati un periodo nel quale raggiungerlo.Ora possiamo proseguire con il secondo passaggio: definire gli obiettivi di performance.Ricorda che anche questi dovrebbero essere obiettivi SMART. Per non complicare le cose, ne definiremo solamente uno: “ottenere più di 50 snippet in evidenza per parole chiave tracciate ad alto traffico nel corso di 12 mesi”.Gli snippet in evidenza sono porzioni di informazioni che generalmente appaiono in cima ai risultati di ricerca per una determinata query. Ottenere più snippet in evidenza è un modo piuttosto semplice per ottenere maggiore visibilità e click all’interno della SERP.Ecco come trovare le migliori opportunità per far visualizzare gli snippet in evidenza relativamente al proprio sito:Vai nel Rank Tracker di AhrefsSeleziona il tuo progettoScegli il report chiamato OverviewFiltra in base alle parole chiave per le quali non hai snippet in evidenza posizionatiFiltra poi le parole chiave per le quali sei fra la 2–5 posizioneOrdina le parole chiave dal volume di traffico più alto al più bassoSiamo quasi alla fine. Il terzo e ultimo step consiste nel dividere l’obiettivo di performance in obiettivi di processo definendo il come.Dato che spesso è possibile riuscire ad ottenere gli snippet in evidenza con dei semplici cambiamenti sulla pagina, un obiettivo di processo sarà quello di “apportare cambiamenti a 50 pagine in modo da aumentare le possibilità di ottenere lo snippet in evidenza”. Possiamo misurare il progresso su questa azione tracciando il numero di snippet in evidenza posseduti all’interno del Rank Tracker di Ahrefs.Ecco la nostra piramide degli obiettivi SEO completata:Ulteriori approfondimentiCome Ottimizzare per gli Snippet in evidenza di GoogleCos’è la Share of Voice? Come Misurarla nei Diversi CanaliObiettivo SEO di esempio #2: Incrementare l’engagement rate del traffico organico del 10% in 6 mesiPotresti pensare che ottimizzare l’user engagement sia una metrica esclusiva dell’ambito CRO. Ma ricorda che la stessa Guida Introduttiva alla SEO di Google dice che “qualsiasi ottimizzazione deve essere pensata per migliorare l’esperienza utente”.Storicamente, gli esperti SEO hanno sempre fatto affidamento sul bounce rate per misurare l’engagement. Questa non è però una metrica ideale, in quanto spesso non coincide con il comportamento dell’utente.Ad esempio, poniamo il caso che tu legga un articolo di ~2K parole. Secondo quanto riportato su questo sito, un lettore lento dovrebbe riuscire a leggere tutto in 20 minuti circa. Se chiudi il browser subito dopo aver finito quella sessione, questa verrà conteggiata come bounce.Fortunatamente, Google Analytics 4 ha delle metriche molto più robuste quando si parla di misurare la UX: il tasso di Coinvolgimento.Il tasso di Coinvolgimento misura in modo più accurato se un utente ha interagito con il tuo sito o lo ha abbandonato, quindi un buon obiettivo potrebbe essere quello di “migliorare il tasso di Coinvolgimento del 10% in 6 mesi”.È specifico perché dettaglia una percentuale ed un intervallo temporale.È misurabile, utilizzando il report di Acquisizione all’interno di GA4:È raggiungibile, in quanto ci sono fattori che possiamo controllare e che possiamo mettere in pratica per avere un impatto su questa metrica.È pertinente perché vogliamo migliorare la UX, e l’engagement rate misura proprio questo in modo più accurato rispetto al bounce rate o al tempo medio sulla pagina.È dipendente dal tempo perché ci siamo imposti una deadline (6 mesi).Ora passiamo all’obiettivo di performance.Per semplicità, anche in questo caso ne definiremo solo uno: “aumentare il numero di scorrimenti unici per utente del 30% sulle pagine con pochi scroll e che hanno valore per l’azienda”.Per trovare le pagine dove dobbiamo migliorare la UX, possiamo analizzare il report Pagine e Schermate all’interno della sezione Coinvolgimento in GA4, filtrare per utenti organici e ordinare la tabella in base agli scorrimenti unici.Dato il nostro obiettivo di performance, quello di processo potrebbe essere quello di scrivere un buon paragrafo introduttivo sulle pagine con pochi scorrimenti unici, in modo che più persone vengano persuase dall’articolo e lo continuino a leggere. Anche questo dato può essere misurato manualmente.Obiettivo SEO di esempio #3: Raggiungere 10,000$ in vendite dal traffico organico nel sesto meseAumentare il fatturato è l’obiettivo finale della SEO. Per avere le migliori opportunità in questo senso, dobbiamo trasformare l’obiettivo generico “guadagnare di più” in un risultato SMART come “raggiungere 10,000$ in vendite dal traffico organico entro il 6° mese”.Questo obiettivo è specifico perché abbiamo definito una cifra e un relativo arco temporale.È misurabile attraverso Google Analytics.È raggiungibile in quanto il nostro ipotetico sito non è particolarmente soggetto a stagionalità e registra ~$9K/mese di vendite da traffico organico— si tratterebbe quindi di un incremento dell’11% circa.Nota a margine. Un buon risultato dovrebbe essere sia motivante che realistico. Quanto fissi un obiettivo basato sulle vendite, considera la cronologia delle vendite che hai ottenuto grazie al traffico organico ed eventuali fluttuazioni stagionali.È pertinente in quanto, come prima, aumentare il fatturato è l’obiettivo ultimo della SEO.Dipende dal fattore tempo, in quanto abbiamo specificato un arco temporale.Ora passiamo agli obiettivi di performance:Come sempre, per scopi di semplicità, imposteremo un solo obiettivo di performance, che sarà “aumentare il traffico organico verso le pagine di alto valore del 20% in 6 mesi”.Nota a margine. Definire un intervallo temporale ed una percentuale potrebbe essere piuttosto complicato in questo caso. Essenzialmente dovresti lavorare andando a ritroso nei “top seller” per poi comprendere quanti in più dovresti venderne per raggiungere il tuo obiettivo di vendita, qual è il tasso di buy-to-detail e l’incremento di traffico necessario per raggiungere l’obiettivo.Il modo più semplice per trovare le “pagine di alto valore” consiste nel chiedersi quali siano i prodotti più profittevoli per l’azienda. Considera i costi di produzione, di spedizione, le restituzioni, ecc..Puoi misurare il progresso del tuo obiettivo di performance con Google Analytics. Vai su Comportamento > Tutte le Pagine, confronta i periodi, segmenta per traffico organico e dai uno sguardo alla metrica relativa alle entrate:Infine, l’obiettivo di processo…Non posso dettagliare con esattezza quali dovrebbero essere gli obiettivi di processo, in quanto variano a seconda del prodotto o servizio, l’intento di ricerca, le risorse aziendali, ecc…Ecco però alcuni esempi di obiettivi di processo azionabili che potrebbero aiutarti ad incrementare il traffico organico:implementa una scheda di prodotto per le pagine scelteottimizza i prodotti all’interno dell’organic product feed (solo per gli Stati Uniti)ottimizza tutte le immagini presenti sulle pagineDato che gli obiettivi di processo sono compiti di cui tu o il tuo team si occupa, il completamento dell’obiettivo dovrebbe essere misurato manualmente utilizzando il tuo metodo di Project Management.Ad esempio, se l’obiettivo di processo è quello di ottimizzare tutte le immagini su ogni singola pagina ad alto valore, dovremmo analizzare manualmente ogni immagine, assicurandoci che abbia un nome file ottimizzato, un alt text descrittivo e che non ecceda le dimensioni consigliate.Ecco il nostro framework SEO degli obiettivi completo:ConclusioneDefinire degli obiettivi SEO potrebbe sembrare un compito molto difficile, ma un framework ben strutturato è tutto quello di cui hai bisogno per iniziare.Se riesci a rispettare gli obiettivi di processo, hai delle ottime possibilità di raggiungere quelli di performance. E raggiungendo quelli di performance, hai buone possibilità di raggiungere quello principale.Il successo è una questione di dettagli.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Come Definire i Giusti Obiettivi SEO — con 3 Esempi"
    },
    {
      "level": "H2",
      "text": "Cosa sono gli obiettivi SEO?"
    },
    {
      "level": "H2",
      "text": "Perché è importante definire degli obiettivi SEO?"
    },
    {
      "level": "H2",
      "text": "Come definire degli obiettivi SEO"
    },
    {
      "level": "H3",
      "text": "1. Definisci un obiettivo principale"
    },
    {
      "level": "H3",
      "text": "2. Definisci gli obiettivi di performance"
    },
    {
      "level": "H3",
      "text": "3. Definisci gli obiettivi di processo"
    },
    {
      "level": "H2",
      "text": "3 esempi di buoni obiettivi SEO"
    },
    {
      "level": "H3",
      "text": "Obiettivo SEO di esempio #1: Incrementare la share of voice del 20% in 12 mesi"
    },
    {
      "level": "H3",
      "text": "Obiettivo SEO di esempio #2: Incrementare l’engagement rate del traffico organico del 10% in 6 mesi"
    },
    {
      "level": "H3",
      "text": "Obiettivo SEO di esempio #3: Raggiungere 10,000$ in vendite dal traffico organico nel sesto mese"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Kayle Larkin"
}