{
  "url": "https://ahrefs.com/blog/it/obiettivi-marketing/",
  "slug": "obiettivi-marketing",
  "title": "6 Obiettivi di Marketing Strategici e Come Misurarli",
  "description": "Gli obiettivi di marketing permettono ai team di focalizzarsi al meglio. Eccone 6 che vale la pena considerare in una strategia di marketing e come misurarli.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti Gli obiettivi di marketing possono essere definiti come risultati di larga veduta e a lungo termine che un’azienda vuole ottenere attraverso diverse azioni di marketing.Stabilire obiettivi di marketing chiari è importante, in quanto permette al team di lavorare per uno scopo condiviso. La cosa importante è scegliere attentamente i propri obiettivi per evitare di perdere tempo in attività che portano scarsi risultati o che possono addirittura compromettere i tuoi sforzi passati.In questo articolo, abbiamo deciso di stilare un breve elenco di obiettivi strategici che vale la pena considerare in qualsiasi strategia di marketing ed alcune idee su come misurarli:Migliorare il valore del prodottoAumentare il traffico organicoGenerare leadStabilire una leadershipAumentare la brand awarenessIncrementare le entrate1. Migliorare il valore del prodottoIl marketing per avere successo si deve fondare su un buon prodotto che soddisfi la domanda del mercato. In caso contrario, nessuno dei tuoi sforzi di marketing riuscirà a fare presa. Ciò significa che, indipendentemente da come promuovi il prodotto, non riuscirai a convincere il tuo pubblico e a crescere in maniera sostenibile.Al contrario, un prodotto che le persone sono disposte a utilizzare, acquistare e consigliare ad altri rafforzerà tutte le attività di marketing. Sono molte le aziende di successo che sono cresciute solo o principalmente grazie al passaparola stimolato dal valore dei loro prodotti, basti pensare a Whatsapp o Tesla, per citarne solo due.Per metterti sulla strada giusta per migliorare il prodotto e la sua penetrabilità, devi raggiungere il cosiddetto Product-Market Fit ovvero adattare il prodotto alla domanda di mercato.Quando sai di essere nel mercato giusto con il giusto tipo di prodotto, puoi iniziare a deliziare i tuoi utenti con funzioni utili e un’esperienza utente eccezionale. Non dimenticare che anche miglioramenti del prodotto apparentemente semplici possono fare molto.We have finally released this long overdue SEO metric:🔥 Traffic potential 🔥Because pages don’t rank in Google for just a single keyword. They also rank for all the different variations of that keyword and get search traffic from them. https://t.co/a0ehTT5WJV pic.twitter.com/zQAXCaQTYj— Tim Soulo 🇺🇦 (@timsoulo) November 12, 2021Come misurare questo obiettivoPuoi misurare questo obiettivo in due modi: chiedere ai tuoi utenti cosa pensano o raccogliere dati rilevanti dall’utilizzo del prodotto.SondaggiSe utilizzi i sondaggi, devi porre agli utenti domande che ti aiutino a capire quanto il tuo prodotto soddisfa le loro esigenze. Puoi anche utilizzare metodi collaudati come il popolare e semplice Net Promoter Score (NPS).Questo sondaggio si compone di una sola domanda: “Con quale probabilità consiglieresti il [prodotto o il servizio o l’azienda] a un amico o collega?” Le risposte sono date su una scala di 10 punti.Puoi trovare più strumenti online che ti aiuteranno a distribuire il sondaggio e calcolare il tuo NPS (ad esempio Hotjar, Survicate, ecc).Livello di coinvolgimento del prodottoSe gestisci un servizio online, prendi in considerazione la misurazione della soddisfazione del prodotto utilizzando strumenti di analisi del prodotto (chiamati anche strumenti di product intelligence) come Mixpanel o Amplitude. Funzionano raccogliendo dati dal comportamento in-app dei tuoi utenti e consentendoti di analizzare i dati per ricavarne informazioni utili.Ad esempio, misurando la frequenza con cui i tuoi utenti utilizzano particolari funzionalità all’interno del tuo prodotto, puoi vedere se queste funzionalità hanno un valore o meno. Quindi puoi scartare le funzionalità inutilizzate in base a dati reali o condurre esperimenti (ad esempio, modificando le tue funzionalità o rendendole più visibili).Fidelizzazione degli utentiLa fidelizzazione degli utenti (o fidelizzazione di gruppo) è una metrica utilizzata per misurare la capacità di mantenere i clienti per un determinato periodo di tempo.Se i tuoi clienti vanno via così velocemente come arrivano vuol dire che c’è un problema (con alcune eccezioni, ad esempio quando si tratta di un e‑commerce). Se non operi in una nicchia in cui un breve periodo di utilizzo è naturale, una bassa fidelizzazione degli utenti è un segno che:Le persone non trovano ciò che hai promesso nella tua comunicazione di marketing;Il tuo prodotto mantiene la promessa, ma i tuoi concorrenti fanno un lavoro migliore.In queste situazioni, è probabile che tu stia sprecando denaro e il valore del brand fornendo qualcosa a cui le persone non sono realmente interessate. Quindi devi migliorare il tuo prodotto velocemente.Detto questo, anche se hai il miglior prodotto sul mercato, il cosiddetto customer churn (cioè quando i clienti smettono di usare il tuo prodotto) è un fenomeno relativamente naturale. La chiave qui è determinare se la tua retention rate è comunque positiva e salubre.2. Aumentare il traffico organicoIl traffico organico, chiamato anche traffico legato alla ricerca organica, si riferisce ai visitatori che giungono al tuo sito tramite i risultati di ricerca non a pagamento di un motore di ricerca (ad esempio Google, DuckDuckGo, ecc).Per sfruttare il potenziale di traffico organico dei motori di ricerca, è necessario pubblicare contenuti in base alla domanda di ricerca e al valore commerciale di un determinato argomento (ovvero lavorare su contenuti SEO).In questo modo, ogni volta che qualcuno cerca una soluzione tramite un motore di ricerca, troverà i tuoi contenuti e, di conseguenza, il tuo marchio e prodotto.Ecco i principali motivi per cui dovresti unirti alla maggior parte dei marketer che investono nella creazione di contenuti SEO per aumentare il traffico organico:I contenuti SEO possono influenzare e persino guidare l’intero funnel di marketing;Contenuti di questo tipo portano traffico quasi gratuito e costante;Un post di un blog scritto anni fa può portarti traffico ora e in futuro, purché sia di ottima qualità;La crescita del tuo traffico organico dipende più dalla qualità dei contenuti e dalla creatività piuttosto che dal budget;Il marketing dei contenuti fatto bene può essere un meccanismo che si auto-rafforza e che ti aiuta a ottenere risultati più facilmente man mano che vai avanti, scatenando in questo modo un vero e proprio effetto volano.Aggiungo solo che questa non è un’ipotesi. Noi di Ahrefs abbiamo creato sistematicamente articoli e video ottimizzati per i motori di ricerca e gli articoli, da soli, che ci portano circa 384.000 visite organiche ogni mese.Dati estratti utilizzando il Site Explorer di Ahrefs.Come misurare questo obiettivoConsigliamo di utilizzare due strumenti.In primo luogo, va misurato il traffico organico tramite Google Search Console (GSC). Si tratta di uno strumento gratuito che fornisce dati accurati sul traffico organico. GSC ti mostrerà il numero di clic provenienti da Ricerca Google, Discover o News. Ti mostrerà anche il numero di volte in cui i tuoi contenuti sono stati visualizzati da Google (le Impressions):Sebbene GSC faccia un ottimo lavoro nel fornire queste semplici informazioni, manca di funzionalità e dati per un’analisi completa del traffico organico.Questo ci porta ad altri tipi di strumenti: strumenti SEO che colmano le lacune di GSC, come Ahrefs Webmaster Tools, completamente gratuito.Ad esempio, se GSC ti mostrerà fino a 1.000 parole chiave e fino a 1.000 backlink, Ahrefs Webmaster Tools ti mostrerà questo e molti altri dati senza alcun limite.Per riassumere, puoi utilizzare GSC per misurare il traffico organico e altri strumenti SEO più avanzati per l’analisi SEO e trovare opportunità di crescita.Ulteriori approfondimentiSEO: La Guida Completa per Principianti (2021)Content Marketing: La Guida Completa per il 20213. Generare leadSemplifichiamo al massimo: più lead generi, più soldi guadagni. Questo perché ogni lead è un potenziale cliente. Tuttavia, non tutti i lead diventeranno clienti, quindi hai bisogno di molti più lead per ottenere il numero desiderato di clienti.Un lead è chiunque abbia espresso interesse per un prodotto o servizio condividendo le proprie informazioni di contatto (per esempio l’indirizzo e‑mail) con un’azienda in cambio della ricezione di un elemento di valore di qualsiasi tipo (per esempio un ebook gratuito, uno strumento gratuito, una newsletter settimanale con materiale didattico).Il più delle volte i potenziali clienti non sono immediatamente pronti per l’acquisto. Questo si verifica soprattutto quando conoscono poco, o per niente, un brand.Quando c’è molta concorrenza sul mercato, è probabile che i tuoi potenziali clienti facciano qualche ricerca e ti confrontino con gli altri prima di effettuare un acquisto. Inoltre, se il tuo prodotto è complesso e/o costoso, le persone devono assicurarsi che il prodotto risolva il loro problema o valga la pena spendere soldi e fatica per imparare a utilizzarlo.È qui che entra in gioco la generazione di lead. Quando una persona ti fornisce le sue informazioni di contatto, hai l’opportunità di contattarla direttamente in futuro. Puoi sfruttare questa opportunità per coltivare questa relazione fino al punto in cui questa persona sarà pronta per l’acquisto.Per generare lead, hai bisogno di tre cose: Traffico: persone che arrivano sulle tue pagine dai tuoi canali di marketing; Offerta: l’elemento di valore che offri in cambio delle informazioni di contatto (per esempio un e‑book gratuito); Modalità per catturare i lead: un modulo tramite il quale le persone possono inviare le proprie informazioni di contatto (per esempio nome, numero di telefono, indirizzo e‑mail).Come misurare questo obiettivoIl modo in cui misuri la generazione di lead dipende da ciò che offri. Può trattarsi del numero di iscritti alla newsletter, dell’esperienza di prova a cui le persone si sono iscritte, del numero di download della tua app o di qualsiasi altra cosa tu intenda fornire.Il modo più semplice per misurare i lead in entrata è tramite lo stesso strumento che utilizzi per acquisire i lead. Ad esempio, il nostro modulo di acquisizione e‑mail utilizza la funzionalità di Mailchimp. È la stessa app che utilizziamo per monitorare il numero di lead e inviare la newsletter settimanale alle persone che si sono iscritte.Puoi anche aggregare i tuoi dati in un software di business intelligence come Google Data Studio o Klipfolio per visualizzare i dati insieme ad altre metriche importanti per ottenere informazioni rapide, per esempio il tasso di conversione da lead a clienti.Ulteriori approfondimenti10 Metodi (Con Esempi) di Lead Generation Che Funzionano 4. Stabilire una leadershipNel marketing, la leadership dimostra che il tuo marchio ha esperienza nella sua area di competenza. Una leadership efficace instilla nel tuo target di riferimento l’idea che le tue soluzioni siano le migliori.Attraverso un’efficace leadership, diventi un’autorità nel tuo settore e questo rafforzerà ogni messaggio che invierai. In questo modo, nel classico enigma se il messaggero sia più importante del messaggio, puoi riuscire a trarre effettivamente vantaggio da entrambi.Più il mercato è sofisticato e tecnico, più la leadership è importante. Un ottimo esempio in questo senso è il mercato delle auto elettriche. Tesla è leader indiscusso del settore. Ecco perché ha superato le vendite di altre case automobilistiche famose e con budget pubblicitari più elevati. Infatti, Tesla è famosa per il suo atteggiamento anti-pubblicità.We don’t buy advertising— Elon Musk (@elonmusk) April 29, 2019Come misurare questo obiettivoMisurare i tuoi progressi in termini di leadeship dipende da dove condividi le tue idee. Qui mostreremo esempi di due canali efficaci e le rispettive metriche. Backlink di qualità Un backlink è un link su un sito che rimanda a un altro sito. I backlink sono come dei voti e anche Google la pensa così, trattando i backlink come uno dei fattori di ranking più importanti.Quindi, se pubblichi contenuti che ottengono backlink, sei sulla buona strada per diventare un’autorità nel tuo settore. Questo perché le persone votano digitalmente per quello che dici, con conseguente traffico diretto da quelle pagine e un posizionamento più elevato nei motori di ricerca.Facciamo un esempio pratico: uno degli argomenti ampiamente discussi nella comunità SEO è la creazione di backlink facendo outreach diretto. Il nostro CMO, Tim Soulo, si è unito alla conversazione con un articolo dal titolo Ho cancellato la tua e‑mail di outreach e non mi dispiace affatto, che spiega come inviare e‑mail efficaci che non sembrino spam.Quell’articolo da solo ha ottenuto oltre 2.000 backlink (ovvero voti digitali).E solo un rapido promemoria: la condivisione di idee attraverso articoli di questo tipo porta clienti:Impegni come speakerÈ possibile diventare speaker durante eventi di diverse forme e dimensioni. Si può trattare di grandi eventi del settore come BrightonSEO (con circa 4.000 persone) o eventi più accoglienti con un pubblico più piccolo, per esempio le interviste dei podcast.Ciò che tutti hanno in comune è attirare l’attenzione dei professionisti del settore e persino delle autorità del settore. Quindi più parli a eventi di questo tipo, più è probabile che le tue idee (e il tuo nome) diventino autorevoli nella tua nicchia.Partecipando come speaker puoi far notare il tuo nome, attirare follower sui tuoi canali social e comunicare con questi follower direttamente in un secondo momento.Se hai più budget puoi persino alzare la posta creando la tua conferenza, soprattutto se vuoi rendere popolare un concetto originale. Questo è ciò che Hubspot ha fatto sfruttando il termine “marketing inbound” e il suo evento INBOUND.5. Aumentare la brand awarenessIl brand è un concetto centrale nel marketing ed è così da decenni. Questo perché i brand hanno potenti effetti sui consumatori:Un marchio rende il riconoscimento del prodotto facile come ricordare una parola o un logo;Un marchio evoca associazioni con esperienze positive;Un marchio permette di razionalizzare il costo del prodotto.Costruire brand awareness aumenta le probabilità che i consumatori associno il tuo marchio o prodotto a un’esigenza specifica.Pensaci. Starbucks è uno dei brand più importanti del mondo. Per milioni di persone, Starbucks è sinonimo di caffè. Quindi, in sostanza, non è esagerato affermare che la sua attività si basa su un’associazione mentale tra un logo e il bisogno di caffè. Questo dimostra la potenza della brand awareness.E la parte sorprendente è, per quanto assurdo possa sembrare, il logo di Starbucks non ha nulla a che fare con il caffè. Starbucks ha persino eliminato la parola “caffè” dal logo.Come misurare questo obiettivoMisurare la brand awareness è parte del lavoro di società specializzate. Un metodo comune per misurarlo è attraverso i sondaggi. Tuttavia, questa opzione ha i suoi difetti: è costosa e richiede tempo.In alternativa, puoi valutare l’awareness legata al tuo marchio utilizzando strumenti online. L’unica cosa che devi ricordare è che questo metodo ti darà stime più accurate per le attività online rispetto a quelle prevalentemente offline.Puoi anche utilizzare uno strumento di ricerca per parole chiave per scoprire il volume di ricerca legato al tuo marchio. Il motivo è questo: più la brand awareness aumenta, più persone vorranno acquistare da te e ti cercheranno online.Usando il Keywords Explorer di Ahrefs,puoi semplicemente inserire il nome del tuo brand e ottenere immediatamente:Il numero di ricerche mensili stimate per un Paese specifico (e a livello globale);Un grafico delle ricerche mensili nel tempo che offre rapide informazioni sulle tendenze.Puoi anche misurare facilmente le tue prestazioni rispetto a quelle dei tuoi concorrenti (tecnicamente, questo tipo di comparazione è la misurazione dello share of voice).Se non utilizzi Ahrefs o hai solo bisogno di un punto di riferimento senza i dati sul volume di ricerca, puoi utilizzare Google Trends per misurare l’interesse per le chiavi di ricerca brandizzate.6. Incrementare le entrateFinora abbiamo discusso di modi piuttosto indiretti per aumentare le entrate. Ora parleremo di tre metodi per incrementare direttamente le entrate.Il primo metodo è rivedere i tuoi prezzi. Se hai motivi certi per pensare che non stai facendo pagare abbastanza per il valore che fornisci, puoi provare ad aumentare i prezzi. Anche un piccolo aumento del prezzo può comportare entrate significative se moltiplicato per centinaia o addirittura migliaia di nuovi clienti. Un consiglio: una buona pratica qui è mantenere il prezzo originale per tutti i clienti esistenti.Un modo apparentemente controintuitivo (anche piuttosto rischioso) per aumentare i profitti è abbassare i prezzi (per esempio nel caso dei prezzi di penetrazione nel mercato o della strategia di perdita dei profitti). Questo può aumentare l’arrivo di nuovi clienti (e in questo modo potresti anche conquistare i clienti della concorrenza).Letture consigliate: Come Aumentare i Prezzi in una SaaS nel Modo Giusto (e Redditizio)Il secondo metodo consiste nell’aggiungere nuovi servizi e/o prodotti. Ad esempio, un marchio di cibo per cani decide di espandere il proprio assortimento offrendo accessori per cani come giocattoli, prodotti per la cura del cane o biancheria. Può persino creare pacchetti di prodotti speciali e chiamarli “nuovi elementi essenziali per chi possiede un cane”.Il terzo metodo è il cosiddetto cross-selling e l’upselling. Cross-selling significa suggerire altri prodotti oltre a quello scelto. L’upselling suggerisce una versione più costosa del prodotto scelto.Impariamo dai migliori. Quando acquisti un nuovo iMac, la prima cosa che vedi è il prezzo standard del prodotto:Quindi ti viene offerta una serie di opzioni di upsell:Seguito da una gamma ancora più ampia di suggerimenti seguendo la strategia di cross-selling:Come misurare questo obiettivo Il modo più semplice per misurare le entrate è misurare il numero e il valore delle vendite. Ma molte aziende devono anche misurare i ricavi ricorrenti dagli abbonamenti, il tasso di crescita dei ricavi e il valore di ogni nuovo cliente.Entrate ricorrentiLe entrate ricorrenti mensili (MRR) misurano quanto guadagni ogni mese attraverso contratti continui (per esempio gli abbonamenti).MRR = numero di abbonati mensili * ricavo medio per utentePer i piani annuali, devi dividere il prezzo del piano per 12 e quindi moltiplicare per il numero di clienti che hanno aderito a quel piano.Per esempio: Se hai 700 clienti che hanno sottoscritto un piano da 9$ al mese e 100 clienti che hanno sottoscritto un piano annuale da 97$, il tuo MRR sarà:(700 x $9) + ($97/12 x 100) = $7,108 MRR Se desideri monitorare anche le entrate ricorrenti annuali (ARR), tutto ciò che devi fare è moltiplicare l’MRR per 12.Nel nostro esempio, questo è il totale:$7,108*12 = $85,296 ARRTasso di crescita dei ricaviIl tasso di crescita dei ricavi misura l’aumento percentuale mensile dei ricavi. Questa metrica indica la velocità di crescita della tua azienda.Puoi misurare il tasso di crescita delle entrate per qualsiasi periodo di cui hai bisogno: settimane, mesi o anni.Supponiamo di voler misurare il tasso di crescita annuale rispetto all’anno precedente. La formula da utilizzare sarà:(ricavi anno 2 — ricavi anno 1) / ricavi anno 1 x 100 = tasso di crescita dei ricavi (%)Nel nostro esempio, questo è il totale:($170,592 — $85,296) / $85,296 x 100 = 100% revenue growth rateValore del clienteIl valore del cliente (CLV) o customer lifetime value è il valore totale di un cliente per un’azienda durante l’intero periodo in cui un contratto è in essere. Il CLV può anche essere utilizzato come metrica predittiva delle entrate che ogni nuovo cliente porterà in media.Esistono diversi modelli per calcolare il CLV. Senza entrare troppo nel dettaglio di ciascuna alternativa, ecco una formula abbastanza semplice per calcolare il CLV:customer lifetime value = valore medio dell’ordine x tasso di frequenza di acquisto x vita media del clienteDove:Il valore medio dell’ordine è il ricavo totale diviso per il numero di acquisti;Il tasso di frequenza degli acquisti è il numero totale di acquisti diviso per il numero di clienti;La vita media del cliente è il numero di giorni tra la prima e l’ultima data di acquisto, diviso per 365.ConclusioniGli obiettivi di marketing, per natura, sono generalmente grandi e ambiziosi. Quindi possono essere piuttosto intimidatori.Ma non preoccuparti. Puoi superare questo problema stabilendo obiettivi raggiungibili e suddividendo il tuo obiettivo generale in sezioni più piccole. Puoi vedere come si fa prendendo come esempio gli obiettivi SEO e leggendo l’articolo che trovi di seguito:Come Determinare gli Obiettivi SEO con 3 Esempi Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "6 Obiettivi di Marketing Strategici e Come Misurarli"
    },
    {
      "level": "H2",
      "text": "1. Migliorare il valore del prodotto"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H4",
      "text": "Sondaggi"
    },
    {
      "level": "H4",
      "text": "Livello di coinvolgimento del prodotto"
    },
    {
      "level": "H4",
      "text": "Fidelizzazione degli utenti"
    },
    {
      "level": "H2",
      "text": "2. Aumentare il traffico organico"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H2",
      "text": "3. Generare lead"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H2",
      "text": "4. Stabilire una leadership"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H4",
      "text": "Backlink di qualità"
    },
    {
      "level": "H4",
      "text": "Impegni come speaker"
    },
    {
      "level": "H2",
      "text": "5. Aumentare la brand awareness"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H2",
      "text": "6. Incrementare le entrate"
    },
    {
      "level": "H3",
      "text": "Come misurare questo obiettivo"
    },
    {
      "level": "H4",
      "text": "Entrate ricorrenti"
    },
    {
      "level": "H4",
      "text": "Tasso di crescita dei ricavi"
    },
    {
      "level": "H4",
      "text": "Valore del cliente"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Mateusz Makosiewicz"
}