{
  "url": "https://ahrefs.com/blog/it/parole-chiave-coda-lunga/",
  "slug": "parole-chiave-coda-lunga",
  "title": "Parole Chiave a Coda Lunga: Cosa Sono e Come Usarle",
  "description": "Le parole chiave a coda lunga sono parole con un numero limitato di ricerche al mese. Tendono ad essere più lunghi e più specifici delle parole chiave principali.",
  "content": "Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim Contenuti La gente spesso sostiene che le parole chiave a coda lunga sono più facili da posizionare e convertono meglio. Ma è davvero così?Dipende. Esistono due tipi di parole chiave a coda lunga e alcune non sono più facili da posizionare sui motori di ricerca rispetto alle loro controparti a coda corta.In questo articolo scoprirai le differenze tra i due tipi di parole chiave a coda lunga e come trovarle.Ma prima, ecco l’elenco degli argomenti che tratteremo in questa guida: Che cosa sono le parole chiave a coda lunga?Perché si chiamano parole chiave a coda lunga?Perché le parole chiave a coda lunga sono così amate?Come trovare le parole chiave a coda lunga?I due tipi di parole chiave a coda lungaChe cosa sono le parole chiave a coda lunga?Le parole chiave a coda lunga sono query di ricerca che ricevono un numero limitato di ricerche al mese. Tendono ad essere più lunghe e più specifiche rispetto alle loro controparti “corte” e, quindi, hanno spesso un tasso di conversione più elevato.Per esempio, la parola chiave “meditazione” (in inglese nell’esempio di seguito) è una parola chiave “corta” perché ottiene 211.000 ricerche al mese. La parola chiave “può la meditazione renderti più intelligente” (in inglese nell’esempio di seguito) è una parola chiave a coda lunga perché è cercata solo 50 volte al mese.Perché si chiamano parole chiave “a coda lunga”?Le parole chiave a coda lunga devono il loro nome dalla loro posizione sulla curva della “domanda di ricerca”. Se tracciamo tutte le query di ricerca che le persone eseguono su Google nel corso di un mese e le ordiniamo in base ai loro volumi di ricerca, ci ritroveremo qualcosa del genere:In “testa” alla curva abbiamo un numero esiguo di parole chiave con volumi di ricerca elevatissimi, mentre la “coda” è costituita da tantissime parole chiave con volumi di ricerca molto bassi.Per essere precisi, nel database statunitense di Ahrefs (che è il più grande del settore!), ci sono solo 31.000 parole chiave con volumi di ricerca pari ad oltre 100.000 ricerche al mese; ci sono invece 3,8 miliardi di parole chiave che hanno meno di 10 ricerche al mese.Ecco come appare la situazione se utilizziamo un grafico a torta:Come puoi vedere, le parole chiave con meno di 10 ricerche al mese rappresentano quasi il 95% del nostro database di parole chiave negli Stati Uniti. Questo non dovrebbe davvero sorprendere, dato che circa il 15% delle ricerche giornaliere su Google è su parole nuove e mai cercate prima.Il 95% di tutte le query di ricerca negli Stati Uniti riceve meno di 10 ricerche al mese.Ma per essere considerata “coda lunga”, una parola chiave non deve necessariamente essere cercata meno di 10 volte al mese. Non esiste un numero minimo di ricerche per stabilire quando una parola chiave si definisce a “coda lunga”. Questo dipende soprattutto dalla parola chiave “principale” con cui la confronti.Il grosso errore è però definire le parole chiave a coda lunga in base alla loro lunghezza in termini di parole.Molte parole chiave contenenti una sola parola ottengono meno di 100 ricerche mensili. E ci sono molte parole chiave lunghe cinque parole (o anche di più) con centinaia di migliaia di ricerche mensili.Quindi non è la lunghezza di una parola chiave che la rende una coda lunga ma il suo volume di ricerca.Perché le parole chiave a coda lunga sono così amate?Ecco tre motivi per cui le parole a coda lunga vanno considerate come parte integrante di una strategia SEO.1. Le parole chiave a coda lunga sono (generalmente) molto meno competitiveSupponiamo che hai appena lanciato un blog sulle criptovalute. Esistono molte parole chiave popolari con volumi di ricerca elevati che potrebbero potenzialmente generare enormi volumi di traffico per il tuo blog:Queste parole chiave sono sicuramente allettanti ma cerchiamo di essere realisti. Quali sono le possibilità che il tuo blog si posizionerà per una di queste parole nel breve periodo? Tutte le parole chiave di cui sopra (in inglese) hanno un punteggio di difficoltà, il Keyword Difficulty (KD), molto alto. Ciò significa che sarà incredibilmente difficile posizionarsi in prima pagina su Google per queste parole. E se il tuo sito web è nuovo di zecca, questa impresa sarà semplicemente impossibile.Ora diamo un’occhiata ad alcune delle query di ricerca meno popolari per l’argomento bitcoin:Come puoi vedere, questa volta il loro punteggio di KD è basso. Ciò significa che anche un nuovo sito Web ha la possibilità di classificarsi tra i primi 10 risultati di ricerca e ricevere alcuni visitatori grazie a quelle parole chiave.2. Le parole chiave a coda lunga sono (generalmente) più facili da gestireContinuiamo a confrontare i due insiemi di parole chiave sopra.“Come acquistare bitcoin” (in inglese come si vede sopra) sembra una domanda piuttosto semplice a cui rispondere. Ma se guardi la pagina in cima alla classifica per quella query di ricerca, questa si compone di ben 3.400 parole.Al contrario, la pagina in cima a Google per la parola a coda lunga “come incassare grandi quantità di bitcoin” (in inglese) contiene solo 1.000 parole.Il fatto è che più generale è la query di ricerca più dettagli dovrai includere quando ne scrivi. Ma se la query di ricerca è specifica, spesso puoi rispondere in modo piuttosto breve e soddisfare comunque la domanda.In altre parole, la creazione di contenuti per parole chiave a coda lunga generalmente richiede meno lavoro.Oltre a questo, puoi effettivamente cercare gruppi di query di ricerca a coda lunga simili e trattarli in pagine che presentano solo pochissime differenze.Ad esempio, controlla il seguente gruppo di parole chiave:Lo stesso software per la creazione di siti web probabilmente funziona sia con i dottori che con gli insegnanti e gli attori. Ciò significa che puoi indirizzare tutte queste diverse ricerche con pagine che hanno l’80% di contenuti simili, adattando il restante 20% a ciascun profilo utente.In altre parole, puoi facilmente creare una dozzina di pagine in un giorno per indirizzare le ricerche a coda lunga simili.3. Ce ne sono TANTISSIMEChiaramente ogni singola parola chiave a coda lunga non genererà volumi di traffico incredibili verso il tuo sito. Ma man mano che ne utilizzerai sempre di più, il traffico organico diventerà piuttosto sostanziale in quanto i vari volumi si andranno a sommare. E poiché ci sono molte parole chiave a coda lunga praticamente in ogni settore, è improbabile che non riesca a trovarne a sufficienza.Torniamo all’esempio “miglior software per siti di…” (in inglese). Utilizzando lo strumento Keywords Explorer di Ahrefs ci rendiamo conto che la quantità di parole chiave a coda lunga è enorme:Come trovare le parole chiave a coda lunga?Esistono diversi metodi per trovare parole chiave a coda lunga. Alcuni sono più noiosi di altri, altri sono, come dire, “non tradizionali” ed altri ancora sono semplicemente scorretti. 1. Utilizzare il suggeritore automatico di GoogleAlcuni esperti SEO consigliano di reperire le parole chiave a coda lunga utilizzando i suggerimenti di Google, ovvero inserendo la parola chiave di base seguita da diverse lettere dell’alfabeto.Ebbene, Google Autosuggest è una funzione progettata per permettere di accedere rapidamente alle query di ricerca più diffuse. Quindi, se controlliamo i volumi di ricerca delle parole chiave nello screenshot sopra, la maggior parte di esse avrà un numero di ricerche piuttosto decente.In altre parole, è molto più probabile che Google Autosuggest ti suggerisca parole chiave molto popolari piuttosto che le ambite code lunghe.Lo stesso vale per strumenti online come Answer The Public o Soovle che sfruttano l’Autosuggest di Google per generare i loro elenchi di parole chiave. Un gran numero dei loro suggerimenti per le parole chiave a coda lunga si rivelerà piuttosto popolare e competitivo.2. Utilizzare il Keywords Explorer di AhrefsA differenza del precedente, questo metodo non richiede noiosi lavori manuali. Cerca solo una parola specifica del tuo settore nello strumento Keywords Explorer e usa il filtro del volume di ricerca per trovare istantaneamente migliaia di parole chiave a coda lunga.Se il tuo sito web è nuovo di zecca e ha pochissima “autorità,” ti consiglio di utilizzare il filtro KD, che ti aiuta a trovare le parole chiave meno competitive.Inoltre, non dimenticarti del bottone “Questions” che spesso restituisce alcune interessanti parole a coda lunga formulate come domande:3. Scopri per quali parole chiave si posizionano i tuoi concorrentiUn’altra grande fonte di parole chiave a coda lunga proviene dai tuoi concorrenti. Lo strumento Site Explorer di Ahrefs ti permette di scoprire per quali parole chiave a coda lunga si posizionano.Prendi il sito web di un tuo concorrente, inseriscilo in Site Explorer e visualizza il report Organic keywords per scoprire quali parole chiave a coda lunga portano traffico al loro sito web:Ripeti questa tecnica con 5–10 siti web dei tuoi concorrenti e otterrai idee per parole chiave a coda lunga da utilizzare per mesi.4. Naviga su Reddit, Quora e forum di nicchiaOgni volta che le persone visitano Google e non riescono a trovare una risposta alla loro domanda, vanno su siti come Quora e Reddit.Ad esempio, stavo cercando informazioni sul’argomento “marketing” su Quora e ho visto questo post:Un velocissimo controllo sul Keywords Explorer mi ha mostrato che la parola “marketing manipulation” è una parola chiave a coda lunga con un punteggio KD basso.Il vantaggio di questo metodo è che i thread del forum possono essere molto interessanti e questo può essere utile quando si crea un contenuto specifico su un argomento specifico.Lo svantaggio è che l’estrazione di parole chiave a coda lunga dai forum è un processo piuttosto noioso. E dovrai comunque utilizzare uno strumento SEO come Keywords Explorer per verificare i volumi di ricerca e il KD delle tue parole chiave.Ma il fatto è che la stessa parola chiave può essere facilmente scoperta tramite Keywords Explorer:I due tipi di parole chiave a coda lungaNon tutte le parole chiave a coda lunga sono uguali. Alcune rappresentano una query di ricerca univoca, mentre altre sono semplicemente una variante meno popolare di una query di ricerca più popolare.Chiamiamo le prime “parole chiave a coda lunga topiche” e le seconde “parole chiave a coda lunga di supporto”.Parole chiave a coda lunga di supportoTe lo spiego con un esempio. “Best healthy treats for dogs” (in inglese) è sicuramente una parola chiave a coda lunga perché è cercata solo 100 volte al mese:Ma ci sono alcune altre query di ricerca che hanno lo stesso significato pur avendo un volume di ricerca molto più importante:Se cerchi ciascuna di queste parole su Google, scoprirai che a posizionarsi in alto per ciascuna di queste parole chiave sono le stesse pagine.Google è abbastanza intelligente da capire che persone diverse formulano le loro ricerche in modo diverso anche se cercano esattamente la stessa cosa. Pertanto, posiziona lo stesso insieme di pagine per tutte queste varianti di parole chiave.Ciò significa che se la tua pagina inizia a posizionarsi per una query di ricerca popolare come “healthy dog treats” (6.800 ricerche al mese, in inglese), si posizionerà automaticamente per tutte le variazioni a coda lunga della query. Quindi non è necessario creare singole pagine per ciascuna variante a coda lunga. Piuttosto, devi indirizzare tutte in una singola pagina.Ma come fai a sapere se una parola chiave a coda lunga che stai controllando fa parte di un argomento più ampio o meno?Noi di Ahrefs abbiamo sviluppato una funzionalità che serve proprio a questo.Si chiama Parent Topic.Ogni volta che inserisci una parola chiave in Keywords Explorer, controlliamo la pagina in cima alla classifica per quella parola chiave e vediamo se c’è una query di ricerca più popolare per la quale questa pagina è classificata.Ecco cosa abbiamo scoperto per la parola “best healthy treats for dogs”:Come puoi vedere nello screenshot qui sopra, questa parola chiave a coda lunga ha una variante molto più popolare: “healthiest dog treats” (2.500 ricerche al mese, in inglese). E se riesci a classificarti per questa parola chiave, ti classificherai automaticamente anche per la sua parola chiave a coda lunga di supporto.Parole chiave a coda lunga topicheOra diamo un’occhiata a un diverso tipo di parola chiave a coda lunga partendo dalla parola “fly bites on dogs ears”, in inglese.Questa volta, l’argomento principale è lo stesso della parola chiave originale. Ciò significa che la nostra parola chiave è in realtà il modo più popolare quando si cerca questo argomento. E puoi indirizzare in sicurezza questa parola chiave a coda lunga con una pagina apposita.E una volta che riesci a posizionarti per questa parola chiave a coda lunga, ti classificherai automaticamente per tutte le varianti di query di ricerca “di supporto” meno popolari:Sfortunatamente, però, le cose non sono sempre così semplici.Esaminiamo un’ultima query di ricerca: “natural sleep aid for dogs.”Lo strumento Parent Topic suggerisce che questa parola chiave a coda lunga sia solo una variazione della query di ricerca “sleep aid for dogs” (1.600 ricerche mensili, in inglese).Il termine “natural” nella parola chiave originale lo distingue però effettivamente dal Parent Topic suggerito. Le persone che cercano questa parola sembrano cercare un’alternativa naturale alle solite opzioni farmaceutiche.E se osserviamo i primi risultati di ricerca per quella parola chiave a coda lunga, nessuno di loro sembra parlare di “aiuto naturale per dormire” (natural sleep aid) e tutti parlano di “ausili per il sonno” (sleep aids) in generale:Quindi direi che ha senso creare un contenuto dedicato per indirizzare la parola chiave “aiuto naturale al sonno per i cani” (natural sleep aid for dogs in inglese). Ci sono buone probabilità che si posizioni effettivamente al primo posto per questa chiave di ricerca, in assenza di altri articoli che trattano quell’argomento specifico.In altre parole, non devi sempre fidarti ciecamente di qualunque cosa ti dica lo strumento Parent Topic in quanto è solo un algoritmo informatico e ha i suoi difetti e limiti. È sempre una buona idea analizzare le pagine posizionate in alto per la tua parola chiave e capire se la tua query di ricerca rappresenta un argomento distinto o è parte di un argomento più ampio.ConclusioniE questo è tutto sulle parole chiave a coda lunga e su ciò che le rende così fantastiche.Spero questo articolo ti aiuti a mettere a punto la tua strategia SEO e ad accelerare la crescita del traffico organico sul tuo sito.Se hai altre domande, contattami su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Tim Soulo Tim è il Chief Marketing Officer e Product Advisor @Ahrefs; ma soprattutto è il più grande fan e il più sincero evangelist della nostra azienda. Scopri di più su Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Parole Chiave a Coda Lunga: Cosa Sono e Come Usarle"
    },
    {
      "level": "H2",
      "text": "Che cosa sono le parole chiave a coda lunga?"
    },
    {
      "level": "H2",
      "text": "Perché si chiamano parole chiave “a coda lunga”?"
    },
    {
      "level": "H2",
      "text": "Perché le parole chiave a coda lunga sono così amate?"
    },
    {
      "level": "H3",
      "text": "1. Le parole chiave a coda lunga sono (generalmente) molto meno competitive"
    },
    {
      "level": "H3",
      "text": "2. Le parole chiave a coda lunga sono (generalmente) più facili da gestire"
    },
    {
      "level": "H3",
      "text": "3. Ce ne sono TANTISSIME"
    },
    {
      "level": "H2",
      "text": "Come trovare le parole chiave a coda lunga?"
    },
    {
      "level": "H3",
      "text": "1. Utilizzare il suggeritore automatico di Google"
    },
    {
      "level": "H3",
      "text": "2. Utilizzare il Keywords Explorer di Ahrefs"
    },
    {
      "level": "H3",
      "text": "3. Scopri per quali parole chiave si posizionano i tuoi concorrenti"
    },
    {
      "level": "H3",
      "text": "4. Naviga su Reddit, Quora e forum di nicchia"
    },
    {
      "level": "H2",
      "text": "I due tipi di parole chiave a coda lunga"
    },
    {
      "level": "H3",
      "text": "Parole chiave a coda lunga di supporto"
    },
    {
      "level": "H3",
      "text": "Parole chiave a coda lunga topiche"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Tim Soulo"
}