{
  "url": "https://ahrefs.com/blog/it/penalizzazione-google/",
  "slug": "penalizzazione-google",
  "title": "Penalizzazione Google: La Guida Semplice Per Principianti",
  "description": "Una penalizzazione si verifica quando Google sanziona un sito per aver violato le linee guida sulla qualità e può portare a una significativa perdita di ranking.",
  "content": "Nick Churick Nick è il nostro vero “Communications Manager” @Ahrefs (per quello che può significare) e, casualmente, è anche piuttosto bravo a scrivere. Per cui eccolo qua: ora è diventato un collaboratore regolare del nostro blog. Contenuti Una penalizzazione di Google è il peggior incubo di ogni webmaster. Ma anche se incappi in una, non è detto che sia tutto perduto.In questo post scoprirai:Che cosa si intende per penalizzazione GoogleCome le penalizzazioni aiutano Google ad evitare spamCome identificare penalizzazioni manuali o automaticheChe tipo di penalizzazioni manuali possono essere inflitteMotivi delle penalizzazioni Google Analizzare i backlink per individuare penalizzazioniCome uscire dalle penalizzazioniPenalizzazioni Google: FAQNon abbiamo mai affrontato avuto a che fare con penalizzazioni sul blog di Ahrefs, quindi ho contattato degli esperti SEO che si occupano di questo aspetto nel loro lavoro:Marie Haynes di Marie Haynes ConsultingDan Taylor di SALT.agencyOlga Zarzeczna di SeoslyCominciamo!Che cosa si intende per penalizzazione Google?In parole povere, una penalizzazione è una “punizione” imposta manualmente su un sito web dal team antispam di Google.Si verifica generalmente quando il sito viola le linee guida sulla qualità di Google. Questa penalizzazione si traduce in un drastico calo delle posizioni sul motore di ricerca con conseguente perdita di traffico organico. Vale la pena ricordare che l’effetto penalizzazione degli aggiornamenti dell’algoritmo di Google non deve essere scambiato per una sanzione.Google non utilizza il termine “penalizzazione” nella sua documentazione. Utilizza invece i termini azioni manuali e azioni algoritmiche.Se il tuo posizionamento organico e il traffico diminuiscono improvvisamente nonostante il tuo sito non abbia problemi di inattività o SEO, potresti trovarti di fronte a una di queste due situazioni:Il tuo sito è stato esaminato da una persona e ha ricevuto una penalizzazione manuale;Un aggiornamento di Google ha generato un’azione algoritmica che ha declassato il tuo sito web.Come le penalizzazioni aiutano Google a evitare spamLo scopo di Google è presentare sempre i migliori risultati a chi cerca qualcosa. Le linee guida sulla qualità spiegano proprio cosa ci si deve aspettare da un sito. Qualsiasi tentativo di manipolare i fattori che determinano il posizionamento o le linee guida sulla qualità è considerato spam. Ogni giorno Google scopre circa 40 miliardi di pagine di spam. Ecco come combatte lo spam.Come Google combatte lo spam, spiegato sul blog di Google Search Central. Le linee blu mostrano quanto lavoro è necessario per filtrare lo spam.Google dispone di sistemi in grado di rilevare lo spam nella fase di “scansione”. Di conseguenza, un gran numero di pagine considerate spam non arriverà nemmeno all’indice di Google.Il contenuto incluso nell’indice viene ricontrollato per verificare che non contenga spam. Questi contenuti di bassa qualità possono essere mostrati nei risultati di ricerca ma non si posizioneranno in alto.Come spiegato da Google, questi sistemi automatizzati assistiti dall’intelligenza artificiale offrono una protezione del 99% contro lo spam. Le azioni manuali entrano in gioco per il restante 1%.Google ha un vasto esercito di revisori che possono imporre azioni manuali sui siti web.Nel 2020 hanno inviato 2.9 milioni di messaggi a proprietari di siti direttamente in Search Console e relativi ad azioni manuali per via di spam.Nota a margine.Le azioni manuali vengono imposte e revocate da un team antispam web interno in Google. Non confondere questo team con le persone che valutano la qualità, le quali aiutano Google solo a valutare le modifiche agli algoritmi e non sono a conoscenza di informazioni dettagliate sul funzionamento interno di Google Search.Come identificare penalizzazioni manuali o automaticheOgni volta che un sito Web è soggetto a un’azione manuale, questo problema sarà sempre visibile in Sicurezza e Azioni manuali in Google Search Console. Avrà più o meno queste sembianze. Grazie a un messaggio del genere, sai che c’è un problema e puoi affrontarlo direttamente.Le azioni manuali imposte a un sito comportano o un peggioramento del posizionamento o l’uscita completa del sito stesso dai risultati di ricerca.Ma capire l’effetto di un adeguamento algoritmico è molto più impegnativo poiché in questo caso non si ricevono notifiche da Google.Il modo migliore per identificare un’azione algoritmica è analizzare il traffico organico proveniente da Google e vedere se è presente un calo che coincide con un aggiornamento dell’algoritmo noto o sospetto.Puoi cercare nei forum dei webmaster o su Twitter per vedere se altre persone stanno affrontando problemi simili. Google Search Central Help Community, per esempio, è un ottimo posto dove trovare maggiori informazioni. Con Ahrefs, puoi verificare se anche altri siti web nel tuo settore stanno perdendo le loro posizioni.Usiamo il nostro blog come esempio:Il 3 dicembre 2020 è stato rilasciato un aggiornamento dell’algoritmo di base. Il blog di Ahrefs si concentra al massimo sulla qualità dei contenuti; non abbiamo acquistato mai un singolo backlink. Quindi questo aggiornamento è stato uno schiaffo in faccia per noi.Infatti gli aggiornamenti dell’algoritmo non solo fanno perdere posizioni ai siti di bassa qualità o contenenti spam ma promuovono anche siti di alta qualità. Quindi anche se non c’è niente di “sbagliato” nel tuo sito, dopo l’aggiornamento altri siti potrebbero superarti su Google.Se vieni “colpito” da un cosiddetto core update di Google, non considerarlo come una penalizzazione. Potrebbe non essere colpa tua ma semplicemente merito di qualcuno che sta facendo qualcosa di meglio.Gary Illyes, Webmaster Trends Analyst GoogleChe tipo di penalizzazioni manuali possono essere inflitte?Esistono due tipi di azioni che possono essere visualizzate nella pagina “Azioni manuali”:Azioni manuali che interessano l’intero sito;Azioni manuali che interessano solo un URL o una sezione specifica del sito.Le azioni manuali possono essere più o meno specifiche. L’obiettivo è sempre quello di neutralizzare il problema: a volte è facile farlo, altre volte è molto più difficile.John Mueller, Search Advocate GoogleTutte le notifiche di “azione manuale” sono accompagnate da due informazioni: “Motivo” ed “Effetti”.Oggi, l’elenco delle penalizzazioni manuali include:Sito con spam di terze partiSpam generato dagli utentiHost con spamProblema dei dati strutturatiLink innaturali verso il tuo sitoLink innaturali dal tuo sitoContenuto leggero con poco o nessun valore aggiuntoCloaking e/o reindirizzamenti subdoliSpam al 100%Cloaking su immaginiTesto nascosto e/o eccessivo uso di parole chiave Contenuto AMP non pertinenteReindirizzamenti su mobili subdoliViolazione delle norme di News e DiscoverOgni volta che Google lancia un nuovo aggiornamento per lo spam, sostanzialmente mira agli stessi problemi.I core update invece si occupano della pertinenza e della qualità dei contenuti.Inoltre, tieni presente che le azioni manuali possono riguardare diversi prodotti Google. Quindi, se in qualche modo ricevi un’azione manuale relativa a Google Discover, il tuo posizionamento sul motore di ricerca non dovrebbe essere coinvolto.News e Discover sono prodotti completamente separati.Le notizie includono contenuti di tipo giornalistico, prodotti non solo da editori.Discover include contenuti provenienti da tutto il Web, non solo notizie.Le azioni manuali possono verificarsi per entrambi ma se si verificano riguardano solo il particolare prodotto per il quale sono state applicate.Danny Sullivan, Public Search Liaison GoogleLeggi di più sulle Azioni Manuali in questo articolo sul centro assistenza di Search Console.Motivi delle penalizzazioni GoogleSfortunatamente, non ci sono dati relativi alle diverse penalizzazioni Google quindi ho cercato tra i thread recenti su diversi forum di webmaster e Twitter.Le azioni manuali più comuni che i webmaster si preoccupano di risolvere in questi giorni sono legate ai tentativi di manipolare i risultati di ricerca di Google. Potrebbe essere una coincidenza, ma queste penalizzazioni sono anche una accanto all’altra nell’elenco delle azioni manuali. Nello specifico:Link non naturali verso il tuo sito;Link non naturali dal tuo sito;Contenuto leggero che offre poco o nessun valore aggiuntoDirei che quasi tutte le penalizzazioni di Google ora vengono inflitte perché ci si sforza troppo di manipolare Google. Cinque o sei anni fa molte penalizzazioni venivano applicate a causa di specialisti SEO senza competenze che si imbarcavano in pratiche di link building innaturali e scorrette. Oggi la maggior parte di quei link viene ignorata da Penguin. Quindi se ricevi una penalizzazione legata a link da o verso il tuo sito, è una penalizzazione che hai meritato di ricevere.Marie Haynes, CEO Marie Haynes ConsultingQuindi, basta con le tecniche di bassa lega! 🙂Come analizzare i backlink per individuare penalizzazioniI link sono ancora oggi uno di fattori di posizionamento più importanti ed ecco perchè i link non naturali sono oggi la ragione per cui molti siti ricevono una penalizzazione. Siamo onesti. Se vedi una notifica di questo tipo in Search Console, molto probabilmente hai partecipato a schemi per ottenimento di link e sai perché hai ricevuto la penalizzazione.Ma se hai acquistato un sito o stai lavorando sul sito di qualcuno, devi fare un link audit completo. Ecco alcune cose veloci su cui puoi lavorare.Controlla i tuoi anchor textDevi prestare attenzione alla quantità di anchor text eccessivamente ottimizzati che provengono da siti Web di scarsa qualità.La prima cosa da fare è inserire il tuo sito nel Site Explorer di Ahrefs (o in qualsiasi tool che preferisci) e vai su Ancore che abbiamo recentemente migliorato per diagnosticare più facilmente i problemi.Quando i backlink sono naturali, la maggior parte dei link sono ancorati all’URL o ancorati al brand. Ma se un sito è stato pesantemente coinvolto nella creazione di link manipolativi, di solito gli anchor text sono pieni di parole chiave e provengono da più domini: Se il report Ancore è simile a quello qui sopra, non è un buon segno. Per quanto riguarda i “Link non naturali dal tuo sito”, devi analizzare gli anchor text dei link in uscita. Il Site Explorer di Ahrefs include un report speciale proprio per questo.Controlla i tuoi domini referralIl report sui Domini Referral in Site Explorer può aiutarti a identificare i siti creati in modo esplicito per la vendita di link. L’elemento principale da controllare è il numero di siti che linkano (correlato alle dimensioni di un sito).Inoltre, questi siti Web di solito ricevono poco o zero traffico da Google, sebbene a volte abbiano un Domain Rating piuttosto elevato.Questo è il motivo per cui abbiamo aggiunto le colonne “Domini Dofollow Linkati” e “Traffico” direttamente nel report dei Domini Referral.Ad esempio, qui sul blog di Ahrefs, non siamo avidi nel linkare esternamente. Se una pagina o una risorsa è utile e merita di essere menzionata, noi lo facciamo.Il nostro blog ha circa 2.000 pagine indicizzate su Google.E il report sui Domini Referral di Ahrefs mostra che abbiamo linkato circa 1.500 siti.Quindi il rapporto è di circa a 1:1. Non sto dicendo che si tratta di uno standard per ogni settore ma almeno spero ti aiuti a farti un’idea sulla questione. Un sito con 500 pagine con link a 5.000 siti diversi dovrebbe farti venire qualche dubbio.Un basso DR e uno scarso traffico organico non indicano sempre la bassa qualità di un sito. Potrebbe trattarsi di un nuovo sito e che necessiti di tempo per crescere. Ma quando un sito ha un basso DR, un design e un’interfaccia utente brutti, contenuti di bassa qualità e zero traffico organico, non è possibile che un link ricevuto da questo possa essere considerato naturale.Google sembra avere un elenco aggiornato con i siti che vendono backlink e potrebbe anche utilizzare l’email marketing per scovarne altre, facendo finta di essere un servizio interessato all’acquisto. Leggi questo articolo di Barry Schwartz per maggiori informazioni.Per avere un’idea di quanto sia grave il problema dei backlink del tuo sito, accedi allo strumento Disavow Blacklist Bulk Upload di Marie Haynes quindi esporta l’elenco dei tuoi domini di riferimento da Ahrefs e guarda quanti di loro sono nella lista nera di Marie.Potresti anche individuare i siti in base al loro aspetto grafico.I siti creati solo per attività di link building sono facilmente riconoscibili, i loro contenuti hanno in genere poco senso e le immagini sono un disastro totale.Letture consigliate: Come Gestire I Link Non Naturali e Le Penalizzazioni Manuali di Google Come uscire dalle penalizzazioniPer rimuovere una penalizzazione manuale dal tuo sito, devi correggere i problemi specificati nei messaggi di Azioni manuali dell’SGC e selezionare “Richiedi revisione” su ogni problema specifico, dopo averlo risolto.“Link non naturali verso il tuo sito” è l’unica penalizzazione che ha radici fuori dal tuo sito e, per uscire dalla penalizzazione, devi fare in modo di rimuoverli.Per farlo, devi ripulire al meglio il tuo profilo di backlink. Il semplice disavowing di questi link potrebbe non essere sufficiente.Ecco cosa dice la documentazione di Google:Dovresti fare uno sforzo per rimuovere i backlink prima di utilizzare lo strumento di disconoscimento. Può anche essere utile documentare lo sforzo che hai fatto per rimuovere quei collegamenti. Il semplice disallow di tutti i backlink senza tentare di rimuoverli potrebbe portare al rifiuto della tua richiesta.Se puoi, rimuovi i link tossici.Per farlo potresti dover inviare richieste di rimozione dei link a chi gestisce i siti ma molto probabilmente non sarà così facile. Avrai bisogno di più di un tentativo, poiché dovrai cercare contatti diversi prima di trovare la persona giusta.E anche se la trovi, non a tutti potrebbe interessare la tua richiesta e non è detto che non ti chiedano di pagare per rimuovere il link.Se non riesci a rimuovere un link verso il tuo sito web, utilizza lo strumento per il “disavow” della pagina o del dominio. E spiega perché l’hai fatto nella tua richiesta di riconsiderazione.Assicurati di documentare ogni passo che fai e ogni messaggio che invii per risolvere i problemi. Questo renderà la tua richiesta di riconsiderazione più convincente.Se la penalità deriva da contenuti scarsi, fornisci prove relative ai miglioramenti apportati. Mostra quali contenuti hai rimosso e cosa hai aggiunto.Richiedi una revisione solo dopo aver risolto i problemi in tutte le pagine interessate, poiché l’azione manuale non può essere revocata parzialmente.Quando invii una richiesta di riconsiderazione, è essenziale dimostrare il tuo impegno nell’affrontare tutti i problemi e qualsiasi risultato ottenuto. Ricorda che il tuo sito sarà riconsiderato da esseri umani, non da algoritmi e macchine.Non vi è alcun limite al numero di volte in cui è possibile richiedere la riconsiderazione.With a manual action, you want to show to a knowledgable person that you understand what the problem was, that you’ve taken all of the necessary steps to resolve it and ideally that you won’t do it again. Just disavowing some links someone else placed doesn’t seem complete to me.— John 🧀 … 🧀 (@JohnMu) June 30, 2021Le penalizzazioni algoritmiche non prevedono richieste di riconsiderazione. Tutto quello che puoi fare è risolvere i problemi che potrebbero causare il declassamento del tuo sito e attendere che Google esegua nuovamente la scansione e reindicizzi il tuo sito. Solo dopo potrai capire se la situazione è cambiata.Se non riesci a cancellare la penalizzazione al primo tentativo, ripeti il processo di cui sopra in maniera ancora più approfondita. Se non sai come fare, trova un bravo professionista SEO che possa valutare il danno e trovare la soluzione.Le domande più frequenti sulle penalizzazioni GoogleÈ prevista una penalizzazione per i contenuti duplicati?Il 25%–30% dei contenuti su Internet è duplicato..Google ha demistificato la “penalizzazione per contenuti duplicati” nel 2008 ma molti ancora chiedono la stessa cosa.La risposta breve a questa domanda è “no”. Non è prevista alcuna penalizzazione per contenuti duplicati.Se rubi contenuti da altri siti, Google posizionerà semplicemente l’originale.Per quanto riguarda le pagine duplicate del tuo sito, Google cercherà di determinare l’URL principale come versione canonicalizzata. Utilizza il codice rel=canonical per aiutare Google a scegliere la pagina più appropriata.Letture consigliate: Contenuti Duplicati: Perché Si Creano e Come SistemarliUn sito può essere penalizzato per colpa di un design scadente o obsoleto?A volte le pagine minimaliste, vecchie, semplici o addirittura brutte si posizionano bene e a volte le cose cambiano nel giro di poco tempo (sembra che lasci spazio alla concorrenza se il tuo sito non è perfetto).John Mueller, Search Advocate GoogleUna segnalazione di spam da parte di un mio competitor può comportare una penalizzazione?Prima del 2020, la documentazione di Google indicava che le segnalazioni di spam potevano essere utilizzate per intraprendere azioni manuali contro i siti.Oggi vengono utilizzate solo per migliorare gli algoritmi per il rilevamento dello spam. Secondo Google:Sebbene Google non utilizzi queste segnalazioni per intraprendere azioni dirette contro le violazioni, questi report svolgono comunque un ruolo significativo nell’aiutarci a capire come migliorare i nostri sistemi di rilevamento dello spam che proteggono i nostri risultati di ricerca.Dovrei usare lo strumento per il disavow su qualsiasi link di bassa qualità per impedire una penalizzazione manuale?Se non hai ottenuto link in maniera artificiale, probabilmente non hai quasi nulla di cui preoccuparti.I collegamenti casuali ricevuti nel corso degli anni non sono necessariamente dannosi, li abbiamo avuti anche noi per molto tempo e possiamo ignorarli. Utilizza lo strumento per il disavow solo sui collegamenti che sono stati pagati (o comunque ottenuti attivamente in modo innaturale), non preoccuparti di altro.John Mueller, Search Advocate GoogleQuanto tempo ci vuole per ottenere una risposta alla richiesta di riconsiderazione?Non esiste una risposta esatta a questa domanda. Ovviamente, dipende dalla gravità del problema e dal carico di lavoro del team webspam.Ecco cosa dice Google:La maggior parte delle riconsiderazioni può richiedere diversi giorni o settimane, anche se in alcuni casi, come le richieste di riconsiderazione relative ai backlink, l’esame della richiesta potrebbe richiedere più tempo del solito.In rari casi, può richiedere anche mesi.Negli ultimi 18 mesi, ho sperimentato tempistiche variabili tra le 3 settimane e, in un caso estremo, 5 mesi.Credo che Google elabori le richieste di riconsiderazione in gruppi e non poche alla volta e, a seconda della gravità della penalizzazione/infrazione e del suo potenziale impatto sul benessere di chi la richiede, vengano trattate in modo diverso (e raggruppati in modo diverso). Il che, dato il modo in cui Google utilizza le risorse a favore della maggioranza degli utenti, ha senso.Dan Taylor, Head of Research & Development SALT.agencyGli attacchi SEO negativi possono portare ad azioni manuali?È altamente improbabile che i collegamenti spam creati dai tuoi competitor come azioni SEO negative possano portare a una penalizzazione. Google è abbastanza intelligente da ignorare quei link.Ma se hai paura di problemi, utilizza il tool per il disavow.A mio parere, è raro che tentativi di SEO negativa portino a un’azione manuale. Se un sito ottiene un’azione manuale dopo aver ricevuto un’ondata di link SEO negativi, quasi sempre è perché il sito stesso ha partecipato a pratiche di link building poco chiare.Marie Haynes, CEO Marie Haynes ConsultingQuindi, se fai SEO poco chiaro, azioni dello stesso tipo da parte dei tuoi concorrenti per danneggiare il tuo sito potrebbero attirare l’attenzione proprio verso il tuo sito web. Un altro segnale che indica di lasciar stare con la Black Hat SEO?Una penalizzazione può scadere?Con mia sorpresa, le azioni manuali scadono. Le azioni dell’algoritmo no, e possono solo migliorare.https://twitter.com/JohnMu/status/1037982949197709312Il rendimento del mio sito nella ricerca diventerà normale una volta revocata l’azione manuale?La risposta generale è “sì”. Google non nutre rancore nei confronti dei siti a cui sono state revocate penalizzazioni manuali. La “contaminazione” di un sito dopo una penalizzazione manuale è solo un mito che gira negli ambienti SEO. Richiedi la riconsiderazione e, in caso di successo, sei fuori dai guai.Gary Illyes, Webmaster Trends Analyst GoogleJohn Mueller ha anche girato un video proprio su questo argomento.Ma le cose potrebbero essere leggermente più complicate di così.Nel corso degli anni ho lavorato con una serie di siti che hanno subito penalizzazioni manuali, nello specifico relative ai link e, una volta revocate, il sito è stato in grado di crescere. Quando si revoca una penalizzazione ottenuta per colpa dei link, si ha spesso l’idea sbagliata che “le prestazioni torneranno alla normalità”, ma ci si dimentica che i backlink hanno avuto un impatto sulle prestazioni. Altrimenti, perché Google li vedrebbe come manipolazioni se non portassero vantaggi? Dan Taylor, Head of Research & Development SALT.agencyUn sito riceve solitamente una penalizzazione manuale perché le tecniche che stava utilizzando stavano effettivamente funzionando. Anche quando l’azione manuale viene revocata, il sito torna alla situazione precedente l’implementazione di queste tecniche.Olga Zarzeczna, SEO Consultant SeoslyHo fatto delle ricerche e ho trovato la sessione AMA di John su Reddit, durante la quale si è preso il tempo di rispondere a tantissime domande interessanti:Non esiste un “pulsante di ripristino” per un dominio, non lo abbiamo nemmeno internamente, quindi una revisione manuale non cambierebbe nulla. Se dietro la penalizzazione c’è una brutta storia, devi conviverci, ripulirla il più possibile o cambiare dominio. Mi rendo conto che può essere una seccatura, ma è lo stesso con qualsiasi tipo di attività: ripulire una cattiva reputazione può essere molto faticoso ed è difficile anticipare se alla fine ne varrà davvero la pena.John Mueller, Search Advocate GoogleConclusioniCome hai visto in questo post, i siti subiscono principalmente le penalizzazioni Google a causa dei contenuti di bassa qualità e tecniche SEO discutibili.Se vuoi che il tuo sito sia a prova di penalizzazione, assicurati che soddisfi le linee guida sulla qualità di Google, che segua i principi E‑A-T e che i link da e verso l’esterno siano naturali.Oltre a ciò, monitora il tuo sito per eventuali problemi di hacking e rimuovi i contenuti compromessi il prima possibile per prevenire lo spam generato dagli utenti sul tuo sito.Hai altri consigli da condividere? Hai domande? Contattami su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Nick Churick Nick è il nostro vero “Communications Manager” @Ahrefs (per quello che può significare) e, casualmente, è anche piuttosto bravo a scrivere. Per cui eccolo qua: ora è diventato un collaboratore regolare del nostro blog.",
  "headers": [
    {
      "level": "H1",
      "text": "Penalizzazione Google: La Guida Semplice Per Principianti"
    },
    {
      "level": "H2",
      "text": "Che cosa si intende per penalizzazione Google?"
    },
    {
      "level": "H2",
      "text": "Come le penalizzazioni aiutano Google a evitare spam"
    },
    {
      "level": "H2",
      "text": "Come identificare penalizzazioni manuali o automatiche"
    },
    {
      "level": "H2",
      "text": "Che tipo di penalizzazioni manuali possono essere inflitte?"
    },
    {
      "level": "H2",
      "text": "Motivi delle penalizzazioni Google"
    },
    {
      "level": "H2",
      "text": "Come analizzare i backlink per individuare penalizzazioni"
    },
    {
      "level": "H3",
      "text": "Controlla i tuoi anchor text"
    },
    {
      "level": "H3",
      "text": "Controlla i tuoi domini referral"
    },
    {
      "level": "H2",
      "text": "Come uscire dalle penalizzazioni"
    },
    {
      "level": "H2",
      "text": "Le domande più frequenti sulle penalizzazioni Google"
    },
    {
      "level": "H3",
      "text": "È prevista una penalizzazione per i contenuti duplicati?"
    },
    {
      "level": "H3",
      "text": "Un sito può essere penalizzato per colpa di un design scadente o obsoleto?"
    },
    {
      "level": "H3",
      "text": "Una segnalazione di spam da parte di un mio competitor può comportare una penalizzazione?"
    },
    {
      "level": "H3",
      "text": "Dovrei usare lo strumento per il disavow su qualsiasi link di bassa qualità per impedire una penalizzazione manuale?"
    },
    {
      "level": "H3",
      "text": "Quanto tempo ci vuole per ottenere una risposta alla richiesta di riconsiderazione?"
    },
    {
      "level": "H3",
      "text": "Gli attacchi SEO negativi possono portare ad azioni manuali?"
    },
    {
      "level": "H3",
      "text": "Una penalizzazione può scadere?"
    },
    {
      "level": "H3",
      "text": "Il rendimento del mio sito nella ricerca diventerà normale una volta revocata l’azione manuale?"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Nick Churick"
}