{
  "url": "https://ahrefs.com/blog/it/piano-di-marketing/",
  "slug": "piano-di-marketing",
  "title": "Il Modello di Piano di Marketing Più Efficace e Semplice",
  "description": "Un piano di marketing permette di eseguire una strategia di marketing in un determinato periodo di tempo, di solito un anno.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Tutte le aziende hanno bisogno di un piano di marketing. Questo strumento guida i tuoi sforzi di marketing e ti aiuta a raggiungere i tuoi obiettivi di marketing. Il problema è che crearne uno può essere complicato, molto complicato.Non è così difficile se conosci i termini di marketing, per esempio SWOT e KPI. Ma se non ne hai mai creato uno prima e vuoi cominciare, potresti credere di aver bisogno di un master in marketing solo per iniziare.Ecco perché ho creato questo piano di marketing che si compone di una sola pagina.Utilizzandolo potrai realizzare il tuo marketing plan in poco tempo. Ma prima, partiamo dalle basi…Che cos’è un piano di marketing?Piano di marketing vs strategia vs tattiche vs obiettiviCome creare un piano di marketingChe cos’è un piano di marketing?Un piano di marketing è una tabella di marcia che permette l’esecuzione della strategia di marketing in un determinato periodo di tempo, di solito un anno.Qual è la differenza tra piano di marketing vs strategia vs tattiche vs obiettiviNonostante questi termini siano spesso utilizzati in maniera intercambiabile, sono in realtà molto diversi.Ecco il modo più semplice per differenziarli:Obiettivo: Cosa vuoi ottenereStrategia: Come lo otterraiTattiche: I metodi che utilizzeraiPiano: Pianificazione meticolosa per eseguire le varie azioniImmagina per esempio di voler andare da Londra a Parigi e di avere a disposizione un budget limitato. Il tuo obiettivo, la strategia, le tattiche e il piano potrebbero assomigliare a qualcosa del genere:Obiettivo: Andare da Londra a Parigi per meno di $100Strategia: Utilizzare i mezzi pubbliciTattiche: Autobus, metropolitana, treno EurostarPiano: Prendi l’autobus per arrivare alla metropolitana, prendi la metropolitana per St. Pancras, prendi l’Eurostar per Parigi.Senza un piano dettagliato, eseguire la tua strategia sarebbe molto difficile perché non sapresti se prendere prima il treno, il tram o la metropolitana. Il piano ti permette di mettere insieme i vari pezzi per poter eseguire le azioni necessarie e portare a termine la tua missione.È lo stesso con il marketing. Il tuo piano di marketing spiega come le tattiche di marketing che hai scelto possono lavorare insieme nell’esecuzione della strategia di marketing e nel raggiungimento degli obiettivi di marketing.Come creare un piano di marketingInizia facendo una copia di questo modello di marketing plan. Vedrai che ruota attorno a quattro semplici domande. Esploriamole nel dettaglio.1. A chi ti rivolgi?Se stai creando un piano di marketing, significa che hai già lavorato alla tua ricerca di mercato e hai sviluppato la tua strategia di marketing. Questo vuol dire che dovresti già avere un’idea abbastanza precisa relativamente al tuo target di riferimento. Tuttavia, è utile ribadirlo nel tuo piano di marketing per evitare di perderlo di vista.Ad esempio, se stessimo creando un piano di marketing per Ahrefs, potremmo inserire:Professionisti/e della SEO e proprietari di siti Web che vogliono aumentare il traffico verso i loro siti.Si tratta di una versione molto semplificata del nostro target di riferimento, ma è sufficiente per farci rimanere focalizzati.2. Quali sono i tuoi obiettivi?Non stai creando un piano di marketing per il solo gusto di farlo. Ne stai creando uno per mappare come raggiungerai (si spera!) i tuoi obiettivi di marketing. Quindi devi definire quali sono questi obiettivi.Questi possono essere praticamente qualsiasi cosa tu voglia, ma idealmente dovrebbero essere SMART.Sfortunatamente, questo termine di marketing va discusso ma è piuttosto semplice, e significa solo che i tuoi obiettivi dovrebbero essere:Specific (Specifico): Indica chiaramente il risultato desiderabile stabilendo il chi, cosa, quando, quanto, ecc;Measurable (Misurabile): : Deve essere in grado di monitorare i progressi con gli indicatori chiave di prestazione (KPI);Achievable (Raggiungibile): Sii audace con i tuoi obiettivi, ma anche realistico; utilizza la crescita attuale come parametro di riferimento;Relevant (Pertinente): Assicurati che ogni obiettivo sia allineato con la tua strategia generale di marketing e di business;Timely (Definito a livello temporale): : Stabilisci un lasso di tempo per raggiungere l’obiettivo.Ecco per esempio un pessimo obiettivo di marketing:Aumentare il traffico organico.Ecco invece un ottimo obiettivo:Aumentare il traffico organico negli Stati Uniti dal 3 al 6% nei prossimi 12 mesi.Solo il secondo obiettivo è SMART. Il primo è troppo vago, non è collegato a un preciso periodo di tempo e non è misurabile. Quest’ultimo, invece, è specifico, considera un orizzonte temporale di 12 mesi ed è facilmente misurabile utilizzando il Rank Tracker di Ahrefs.In generale, è meglio avere un numero ristretto di obiettivi, diciamo una manciata. Se scendi sotto questa soglia, otterrai poco. Se vai oltre, non riuscirai a concentrarti su nessuno in particolare.Se hai problemi nell’individuare obiettivi rilevanti per la tua attività, prendi ispirazione dagli esempi che trovi nella nostra guida su come definire gli obiettivi di marketing.3. Come raggiungerai i tuoi obiettivi?Sistemare la palla davanti alla porta è facile, ma segnare un gol è difficile. Ecco perché devi pensare alle tattiche che utilizzerai per raggiungere i tuoi obiettivi di marketing e a quanto ti costeranno.Ricorda che le tue tattiche dovrebbero sempre essere allineate alla tua strategia di marketing e ai tuoi obiettivi. Non tirarle fuori dal nulla e non perdere tempo a cercare nuove tattiche. Al contrario, considera quali sono quelle che si allineano con la tua strategia di marketing.Ad esempio, la nostra strategia di marketing è piuttosto semplice:Aiutare il nostro pubblico nella risoluzione dei problemi SEO e di marketing con l’aiuto dei nostri strumenti creando contenuti informativi e utili sugli argomenti che stanno cercando.Poiché la strategia dovrebbe sempre dettare le regole e guidare la scelta delle tattiche da usare, è chiaro che tutte le tattiche che utilizziamo sono relative ai contenuti. Ciò risulta chiaro anche dall’obiettivo che ci siamo dati nella sezione precedente:Aumentare il traffico organico negli Stati Uniti dal 3 al 6% nei prossimi 12 mesi.Dunque, quali tattiche dobbiamo utilizzare per raggiungere questo obiettivo?Dato l’obiettivo stesso, c’è solo una cosa che possiamo fare: SEO. Tuttavia, se vogliamo davvero creare un piano di marketing che funzioni, dobbiamo essere più specifici.È qui che serve fare ricerca…Se scorriamo verso il basso fino alle parole chiave tracciate nel Rank Tracker (in inglese) e ordiniamo la lista per traffico stimato, possiamo vedere le parole chiave per le quali la nostra visibilità nei motori di ricerca è bassa o inesistente:Per migliorare la nostra visibilità sui motori di ricerca per queste parole chiave, ci sono alcune tattiche che possiamo utilizzare. Tuttavia, per semplificare le cose, diciamo che riscrivere i post che utilizzano queste parole chiave sembra la tattica più praticabile.Supponiamo inoltre di non avere la forza lavoro per riscrivere tutti questi post, quindi ci concentreremo sulle opportunità più basse. Probabilmente sono i post che hanno come target parole chiave ad alto volume e che attualmente si posizionano in modo accettabile ma non eccezionale.Ecco come possiamo filtrare e trovare queste parole chiave nello strumento Rank Tracker:Ora, alcune delle parole chiave di cui sopra (“youtube tags,” “what is https,” ecc.) sembrano non essere rilevanti per il target a cui ci rivolgiamo, quindi le escludiamo.In questo modo la lista finale ammonta a circa 80 parole chiave e questo numero equivale a 80 post da riscrivere.Ora dobbiamo stimare il costo di questo lavoro.Questo è un passaggio fondamentale da non trascurare, poiché non ha senso creare un piano di marketing campato in aria. Deve essere realistico, fattibile e tutti i numeri devono effettivamente basarsi su qualcosa.Dato che riscriviamo i contenuti internamente, ha più senso basare le stime dei costi sul tempo che sarà necessario al nostro team per lavorare a questo progetto (e su quanto lo paghiamo).Per semplificare le cose, diciamo che i numeri sono simili a questi:Tempo necessario per riscrivere il post: 20 ore Costo per ora: $20 Numero di post da riscrivere: 80Sulla base di questi numeri, sembra che questa tattica ci costerà circa $32.000 e un totale di 1.600 ore di lavoro a persona. Potrebbe sembrare molto, ma è meno dell’orario di lavoro annuale di un dipendente a tempo pieno.Ripeti questo processo tutte le volte che devi creare una lista di tattiche che utilizzerai per raggiungere i tuoi obiettivi di marketing.Letture consigliate: 16 Tattiche di Marketing Che Funzionano nel 2021IMPORTANTESe hai a disposizione un budget di marketing specifico, non cedere alla tentazione di “adattare tutto” allocando e riassegnando casualmente il budget tra le varie tattiche che hai selezionato. Il budget assegnato a ogni tattica deve avere un senso. Se le tue tattiche finiscono per costare più del budget assegnato, significa che non hai abbastanza soldi per raggiungere tutti i tuoi obiettivi. In tal caso, devi tagliare gli obiettivi meno importanti fino a quando le tattiche e il budget proposti non saranno allineati.4. Entro quando eseguirai tutto ciò che hai pianificato?I piani di marketing coprono un periodo di tempo specifico, quindi la risposta a questa domanda potrebbe sembrare ovvia. Se hai creato un piano di marketing di 12 mesi, le tattiche che hai delineato nel passaggio precedente dovranno essere eseguite in quel lasso di tempo.Anche se questo è indubbiamente vero, avere solo un elenco di cose da fare nel corso di un anno non è molto fattibile. È sempre meglio suddividere i compiti in blocchi gestibili in modo da poter monitorare i progressi durante tutto l’anno.Quanto e come scomporre i vari compiti dipende da te, ma un piano trimestrale è un buon punto di partenza.Ecco per esempio come potrebbe essere suddivisa la nostra tattica che ci ha portato a individuare 80 articoli del blog, oggi a basso rendimento, da riscrivere:Q1Q2Q3Q4Riscrivere 20 articoli a basso rendimentoRiscrivere 20 articoli a basso rendimentoRiscrivere 20 articoli a basso rendimentoRiscrivere 20 articoli a basso rendimentoPotrebbe sembrare un cambiamento piccolo e insignificante, ma significa che possiamo rivedere i nostri progressi ogni trimestre per verificare che il nostro piano sia sulla strada giusta. Ad esempio, se notiamo che nel primo trimestre sono stati riscritti solo 10 post, potremmo dover intervenire e ottimizzare i flussi di lavoro per assicurarci di raggiungere i nostri obiettivi entro la fine dell’anno.Pianificare le tattiche su base trimestrale aiuta anche ad allocare le risorse in modo più efficiente.Ad esempio, supponiamo che un’altra delle nostre tattiche di marketing sia quella di aggiornare alcuni post del blog nel quarto trimestre per massimizzare il traffico dalle query che includono “2022”. Il team che si occupa dei contenuti sarebbe piuttosto impegnato se ci aspettassimo di riscrivere anche 20 post a basso rendimento nello stesso trimestre, quindi quello di seguito sarebbe probabilmente un piano migliore:Q1Q2Q3Q4Riscrivere 25 articoli a basso rendimentoRiscrivere 25 articoli a basso rendimentoRiscrivere 25 articoli a basso rendimentoRiscrivere 5 articoli a basso rendimentoAggiornare 10 articoli con aggiunta di “2022”Potresti anche prendere in considerazione una codifica a colori del tuo piano trimestrale per mostrare quale team è responsabile di quale attività. Ciò rende più facile capire quando i vari team sono più carichi di lavoro e pianificare di conseguenza.ConclusioniDato che la maggior parte dei piani di marketing si compone di dozzine o addirittura centinaia di pagine, il nostro piano a una una pagina è certamente molto semplificato. Ma è questo il punto. Ti aiuta a mettere su carta le basi il più velocemente possibile senza dover fare i conti con infiniti termini e acronimi di marketing.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Il Modello di Piano di Marketing Più Efficace e Semplice"
    },
    {
      "level": "H2",
      "text": "Che cos’è un piano di marketing?"
    },
    {
      "level": "H2",
      "text": "Qual è la differenza tra piano di marketing vs strategia vs tattiche vs obiettivi"
    },
    {
      "level": "H2",
      "text": "Come creare un piano di marketing"
    },
    {
      "level": "H3",
      "text": "1. A chi ti rivolgi?"
    },
    {
      "level": "H3",
      "text": "2. Quali sono i tuoi obiettivi?"
    },
    {
      "level": "H3",
      "text": "3. Come raggiungerai i tuoi obiettivi?"
    },
    {
      "level": "H3",
      "text": "4. Entro quando eseguirai tutto ciò che hai pianificato?"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}