{
  "url": "https://ahrefs.com/blog/it/pr-tattiche-esempi/",
  "slug": "pr-tattiche-esempi",
  "title": "9 Fantastiche Tattiche di Pubbliche Relazioni con Esempi da Campagne Reali",
  "description": "Le Pubbliche Relazioni (o PR, Public Relation) sono le pratiche che mirano a influenzare positivamente la percezione di un brand, gestendo le comunicazioni con i media e il pubblico.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti Le Pubbliche Relazioni (o PR, Public Relation) sono le pratiche che mirano a influenzare positivamente la percezione di un brand, gestendo le comunicazioni con i media e il pubblico.Ottime PR possono dare una spinta alla tua riconoscibilità del brand, costruire credibilità, farti ottenere preziosi backlink, portare traffico referral, interazioni con il tuo pubblico, e infine farti ottenere più vendite.In questo articolo, imparerai queste 9 tattiche di PR, che includono esempi presi da reali campagne di Pubbliche Relazioni:Monitora e reagisci alle richieste dei mediaNewsjackingFai leva sul trend del momentoProponi risorse per link a giornalisti e bloggerOttieni dei brand ambassadorCollabora con altri brandPR stunts e guerilla marketingPromuovi i tuoi valori prendendo posizione su qualcosaTrasforma la pubblicità negativa in ottime PR1. Monitora e reagisci alle richieste dei mediaOgni scrittore ha bisogno del contributo di qualche esperto ogni tanto. Puoi essere tu quell’esperto nella tua nicchia, è semplice. Tutto quello che devi fare, è iscriverti sulle piattaforme dove i media inviano delle richieste, come HARO, Sourcebottle, ResponseSource, o JournoRequests.Ecco il nostro feed email con le richieste dei blogger e dei giornalisti provenienti da HARO:Il tuo obiettivo, è quello di fornire informazioni di valore nel minor tempo possibile ogni volta che noti una buona opportunità.Questa è un’ottima tecnica di link building e PR, specialmente per i progetti nelle fasi iniziali. Questo in quanto le tue credenziali e il valore delle informazioni che fornisci sono quello che conta, e non il tuo sito o il suo contenuto.Anche se puoi fare l’upgrade ad un piano premium a pagamento per avere accesso a caratteristiche come la notifica anticipata delle richieste o i filtri per le parole chiave, ho ottenuto un buon successo con la versione gratuita. Ecco alcuni consigli che ho maturato durante la mia esperienza:a) Utilizza le parole chiave per filtrare le richiesteHARO invia email 3 volte o più al giorno. Passarle tutte in rassegna è un’enorme distrazione dal tuo lavoro quotidiano.Per risolvere il problema, crea un filtro con delle condizioni. Queste limiteranno le notifiche che ricevi in tempo reale esclusivamente alle email che contengono le parole chiave attinenti al tuo business.Ecco come creare un filtro in Gmail:Premi sulla freccetta a destra della barra di ricercaIncolla [email protected] (o qualsiasi altra mail) all’interno del campo “da”Aggiungi le parole chiave (utilizzando OR come separatore) al campo “Includi le parole”. Utilizza le virgolette per far interpretare più parole come una sola parola chiave,Impostare un filtro HARO su Gmail.b) Verifica l’autorevolezza e la storia della pubblicazioneDevi sempre separare il buono dal cattivo. Dato che ottenere informazioni da esperti è un facile metodo per creare contenuti, molte aziende se ne approfittano. Dovresti solo rispondere alle richieste che provengono da fonti autorevoli o almeno da quelle che non basano tutti i loro contenuti su HARO. La seconda condizione è facile da verificare. Apri alcuni articoli della fonte e vedi se spesso contengono referenze ad altre persone o aziende. In questo modo capirai quali pubblicazioni evitare nella tua nicchia con un solo colpo d’occhio.Riguardo l’autorevolezza, l’indicatore migliore è rappresentato dal conoscere già la pubblicazione. Se però non ne hai mai sentito parlare prima, verifica che i loro contenuti siano di alta qualità.Quello che vuoi, dopotutto, è contribuire per ottenere della solita visibilità. Anche se puoi controllare l’andamento dei loro articoli sui social per farti un’idea, uno degli indicatori migliori della qualità della fonte è quanto traffico organico questa ottiene ogni mese.Per verificarlo, vai sul Site Explorer di Ahrefs, inserisci il sito web e analizza le loro metriche nella panoramica:Assicurati di verificare la stima del traffico organico e il loro Domain Rating (DR). Il DR è un indicatore dell’autorevolezza in quanto mostra la popolarità di un sito in termini di backlink provenienti da altri siti web.Lo screenshot qui sopra mostra i dati per uno dei siti presi dal nostro feed HARO. In questo caso, non mi preoccuperei di rispondere, in quanto non mi aspetto che molte persone leggano l’articolo. Oltre a questo, il potenziale backlink non sarebbe molto di valore.c) Scegli le richieste alle quali puoi fornire davvero delle ottime informazioniAnche i contributi più semplici richiederanno almeno 15 minuti del tuo tempo per essere messi insieme. Assicurati di aumentare le probabilità di essere selezionato fornendo contenuti obiettivamente di valore e unici.d) Rispondi il prima possibileCi sono tante persone che monitorano la tua stessa nicchia. Spesso le scadenze sono inoltre molto strette per incoraggiarti a rispondere subito, ma non basarti solo su queste.Ho parlato con molti scrittori che hanno confermato di aver chiuso la richiesta prima rispetto alla scadenza specificata. Prima reagisci, maggiori sono le possibilità di essere selezionato.e) Fatti aiutare dai colleghiEcco il risultato di un invio su HARO che ha avuto successo riguardo CDN77 (un’azienda per la quale ho lavorato in passato):Noterai che il mio collega è stato menzionato nell’articolo, e non io. Questo perché non ero qualificato per rispondere alla domanda riguardo i migliori strumenti per gli amministratori di sistema, ed ho quindi chiesto al mio collega di rispondere al posto mio. Non esitare a farlo.f) Attieniti alla richiestaSpesso i giornalisti specificano il formato e le condizioni del contributo che stanno cercando all’interno della loro richiesta:Non prendere delle deviazioni. Fornisci anche tutto quello di cui l’autore può aver bisogno per inserire il tuo contributo. Mi riferisco a cose come una concisa biografia, un link verso il tuo sito, una referenza per confermare la tua credibilità sul tema, ecc…Lettura consigliata: Come Ottenere dei Backlink e Visibilità con HARO2. NewsjackingIl newsjacking è una tecnica di PR sempre attiva. Consiste nel monitorare gli eventi e identificare delle opportunità per porre il tuo brand al centro dell’attenzione reagendo con dei commenti esperti e solida leadership.Questo significa che devi agire velocemente ed essere utile. Le ricompense possono essere enormi se eccelli in questa strategia.Questo è il modo in cui Will Hobson, PR Director per Rise at Seven mi ha spiegato il newsjacking.La loro campagna di newsjacking per Ask Traders ha generato oltre 250 link, aumentato il traffico organico del 329% e le conversioni del 53% in sei mesi, ottenendo copertura da parte di molti importanti media, inclusi:Ecco alcuni dei migliori domini dai quali sono riusciti ad ottenere dei link:Dati presi dal report Backlink all’interno del Site Explorer di Ahrefs.Ho chiesto a Will di condividere la loro esperienza nel newsjacking e fornirci alcuni consigli su come puoi farlo anche tu. Ecco cosa ci ha detto:Il newsjacking può essere utilizzato in diversi settori, incluso finanza, viaggi, cosmetica, scommesse sportive, motori, e brand di consumo. Riesce particolarmente bene con il settore finanziario quando hai degli esperti nel tuo team che possono fornire la loro visione, opinioni e consigli su temi come la finanza personale, azioni, business performance, news economiche e molto altro. È una tattica perfetta per affermare la proprie competenza, autorevolezza e attendibilità sia agli occhi di Google che del pubblico. Avere dei portavoce credibili può farti ottenere link e menzioni verso il tuo brand su news di rilievo attraverso opinioni e consigli esperti.Questo può portare ad un aumento del traffico organico in maniera piuttosto repentina e, chiaramente, più fatturato.Esistono due principali tipologie di newsjacking che utilizziamo a Rise at Seven per i nostri clienti, specialmente quelli nella nicchia della finanza: Pianificazione sui report delle aziende – consiste nel commentare i risultati economici delle grandi aziende. Spesso puoi identificare le date direttamente sui calendari aziendali presenti all’interno della sezione dedicata agli investitori presente sulla maggior parte dei siti. Ecco ad esempio il calendario finanziario di Tesco. Reattivo – consiste nel commentare le ultime notizie in settori come quello del retail, delle compagnie aeree o delle banche. Questo potrebbe essere di tutto, da una catena di negozi che va in bancarotta fino ad uno sciopero generale come quelli visti in passato da parte dei piloti delle compagnie aeree nazionali.Monitorare i media per il newsjackingIl newsjacking richiede una risposta rapida, ed il modo migliore per farlo è monitorare le notizie la maggior parte della giornata. Trova un modo per leggere le news e rendere il processo parte della tua routine; non importa se lo fai attraverso un telegiornale, la radio o i social media.Un ottimo approccio consiste nel monitorare i blog di news live durante il giorno. Tutte le ultime notizie passano infatti da lì, e la maggior parte dei giornalisti utilizza tali piattaforme come fonte per le loro notizie. Alcuni esempi nel Regno Unito sono la BBC e The Guardian.Prepara il tuo commentoUna volta trovata una buona storia, devi preparare un commento. Questo potrebbe essere preparato al momento o in anticipo a seconda della storia. Ma cosa rende un commento buono?Il mio più grande consiglio quando commenti una news finanziaria o di qualsiasi altra tipologia è quello di assicurarti di avere un’opinione. I giornalisti vogliono aggiungere valore alle loro storie e non solo ripetere quello che è successo. Assicurati che il tuo commento abbia queste tre caratteristiche: Cosa significa questo veramente? Cosa significa per i consumatori e il grande pubblico questo evento che stai commentando? In pratica, in che modo andrà a impattare la vita dello spettatore medio? Qual è la tua opinione? Qual è l’opinione che stai affermando con il tuo commento? Sei d’accordo con quello che è successo? Cosa succederà in seguito? Cos’ha in serbo il futuro per questo brand/azienda? Se un’azienda sta avendo difficoltà finanziarie dopo aver rilasciato i proventi finanziari, fornisci un’opinione onesta se credi che si riprenderanno e cosa succederà in seguito.Proponi il tuo commentoUna volta che il tuo commento è pronto per essere inviato, assicurati di aver pronta una lista di persone da contattare. Se la tua storia è pianificata in anticipo, assicurati di avere una lista di almeno 50 giornalisti che ne hanno parlato in passato. Se si tratta invece di un’opportunità reattiva, assicurati di contattare chiunque si stia interessando alla questione.Una volta che hai tutto, sei pronto per l’invio.3. Fai leva sul trend del momentoQuesta parla da sé. Considera un qualcosa che sia in forte trend, e fai buon uso della tua creatività per collegarci il messaggio del tuo brand, in modo da ottenere visibilità. Questo può essere fatto su ogni format.Ti ricordi dell’annuncio pubblicitario della bici Peloton, che divenne virale per poi fallire e schiantarsi? Ryan Reynolds ha sfruttato questa opportunità per il suo gin, creando un seguito con l’attrice dell’annuncio pubblicitario Peloton.https://www.youtube.com/watch?v=H2t7lknrK28Puoi andare virale anche con un articolo sui social. Questo è quello che ha fatto McDonald’s riguardo la famosa questione dei monoliti che sono apparsi di colpo ovunque nel mondo:welcome to McDonald’s what can i get you? pic.twitter.com/iIgd8J5QIW— McDonald’s⁷ (@McDonalds) December 1, 2020 Benvenuto a McDonald’s cosa posso fare per te?Ci sono poi dei trend a lungo termine, come la sfortunata circostanza del COVID e del lavoro da casa. Questo è quello che ha spinto la mente creativa dello stratega Sam Hennig a creare la campagna non ufficiale per KitKat, giocando sul loro famoso slogan “Have a break”:Qui le opzioni sono infinite. Tutto quello che conta è che tu riesca a rispondere al momento giusto in modo creativo. Puoi utilizzare strumenti come Exploding Topics per monitorare i trend che stanno acquisendo rapidamente popolarità e traction.4. Proponi risorse per link a giornalisti e bloggerIl tempismo è una variabile importante per la tattica vista qui sopra. Ma puoi ottenere copertura mediatica anche proponendo le tue risorse in qualsiasi momento.Una risorsa per link non è altro che un tipo di contenuto al quale gli scrittori tendono a far riferimento, e che può quindi ottenere facilmente dei backlink. Queste potrebbero essere degli studi condotti su dati, opinioni uniche, infografiche—qualsiasi cosa che gli altri possono trovare di valore per il proprio pubblico.Gli studi di dati funzionano particolarmente bene per noi all’interno della nicchia della SEO:Dati presi dal Site Explorer di Ahrefs, che mostrano le nostre pagine che hanno più linkAd esempio, la nostra miglior risorsa per link, ha ottenuto link dai seguenti domini in maniera organica:Immagina quindi la copertura mediatica che potresti ottenere promuovendo in maniera diretta.Ecco un processo semplificato che puoi percorrere per ottenere questi risultati:a) Cerca di capire che tipologia di contenuto attrae link nella tua nicchiaInserisci il dominio del tuo concorrente e quello di altri siti all’interno del Site Explorer di Ahrefs e analizza il report Migliore per link come mostrato sopra. Lasciati quindi ispirare.Se poi riesci a concepire qualcosa di completamente unico che credi porterebbe valore ad altri, ancora meglio.b) Pubblica le tue risorse per linkabiliAssicurati che sia il meglio che puoi fare. La persona che legge la tua proposta dovrebbe capire cosa stai proponendo immediatamente dopo aver fatto click sul tuo link.c) Contatta persone che potrebbero fornire link al tuo contenutoDevi fare tre cose qui:Trovare giornalisti e blogger che parlano di argomenti correlati a quello della tua risorsa per linkTrovare le loro informazioni di contattoContattarli con una proposta interessante.Questa fase è un argomento a sé stante, quindi ti inserisco i link delle seguenti risorse per capire come eseguirla con successo:Ulteriori approfondimentiHo Appena Eliminato una Email Senza Leggerla. E NO, non mi Sento in ColpaOutreach: Come Farlo e Scalarlo Senza Sentirsi un Idiota8 metodi facili per trovare qualsiasi indirizzo emailCome Eseguire una Campagna di Link Building Velocemente (e Sistemizzare Tutto)5. Ottieni dei brand ambassadorCredo che avere dei brand ambassador sia il migliore approccio all’influencer marketing.Un brand ambassador è chiunque sia spesso sotto i riflettori e rappresenta un’azienda. Spesso si tratta di un impiegato che ha il potere di influenzare la community. Ma puoi formare questo tipo di rapporto a lungo termine con praticamente chiunque. Sono certo che segui alcuni influencer che promuovono specifici prodotti da anni.Ad esempio, noi abbiamo Patrick. È uno dei technical-SEO più conosciuti. Spesso parla a eventi SEO, li organizza, e addirittura modera il famoso subreddit di settore chiamato TechSEO.In termini di campagne a pagamento, le migliori sponsorship e le raccomandazioni dei nostri prodotti provengono dai noi clienti di lunga data:Da Sponsorizzazioni sui Podcast: $51.975 Spesi. Ecco Cosa Abbiamo Imparato.Il punto è che dovresti fare in modo che gli influencer promuovano i tuoi prodotti regolarmente invece di cercare di fare campagne non efficaci una volta ogni tanto.Per avere le migliori opportunità di successo, contatta le persone che sono già tuoi clienti. Potrebbero già essere nella posizione di promuovere il prodotto gratuitamente se lo apprezzano. Il prerequisito è quello di avere un prodotto fantastico.Ecco un esempio della campagna PR di Heinz con Ed Sheeran, che è un grande fan del loro ketchup:https://www.youtube.com/watch?v=keOaQm6RpBgEd ha fatto diverse campagne per loro, e ha addirittura un tatuaggio del ketchup Heinz sul suo corpo. Non puoi avere migliore influencer e fan di lui.6. Collabora con altri brandAlcuni brand condividono valori e tratti tra i loro pubblici. Unire le forze per fare leva su pubblici in differenti nicchie può portare a situazioni e campagne di tipologia win-win.Il tipo di partnership più utilizzato consiste nel creare prodotto co-branded. Questi sono spesso edizioni limitate che giocano anche sull’urgenza. Questo whiskey di Game of Thrones rappresenta un ottimo esempio di co-brand:Puoi anche creare dei co-brand con delle sponsorizzazioni, come questo esempio del 2014 di Uber e Spotify. In quei giorni, entrambe le aziende erano solo agli inizi:https://www.youtube.com/watch?v=tBY5Lbcc5wEPuoi anche optare per l’alternativa più semplice, che consiste nel creare un contenuto insieme. Webinar, podcast e articoli costituiscono tutti eccellenti opzioni.Ecco un esempio di webinar che abbiamo ospitato noi stessi insieme a Buffer:https://www.youtube.com/watch?v=xn2XCFqREbU&t=261sBuffer è uno strumento per i social media, quindi anche se abbiamo un pubblico parzialmente condiviso, non siamo in diretta competizione. È quello il trucco: devi fare partnership con brand che non siano concorrenti diretti, e creare contenuti su argomenti dove potete entrambi promuovere i rispettivi prodotti.Ma come fai a trovare questi brand?Nell’industria B2C, le scelte sono praticamente infinite. Devi trovare un qualcosa che le due aziende hanno in comune che può essere intrigante per entrambi i pubblici. Il miglior modo per trarre ispirazione è quello di chiedere direttamente ai tuoi clienti.Nel settore B2B però, l’idea di un prodotto complementare è importante. Se hai bisogno di idee per trovare aziende con cui fare partnership, utilizza uno strumento per la ricerca dei pubblici come Sparktoro. Ecco un esempio di cosa ottengo quando all’interno della versione gratuita inserisco ahrefs.com:Abbiamo già fatto una partnership con Buffer, ma HubSpot potrebbe essere una buona proposta. E dato che SparkToro è complementare al nostro strumento per la SEO, potrebbe essere considerato come una buona opzione.7. PR stunts e guerilla marketingUn PR stunt è un qualsiasi cosa di inusuale che un’azienda mette in atto per fare rumore. È uno sforzo creativo che spesso esce fuori dalle più classiche forme di comunicazione.Per spiegarlo meglio, ricorriamo a degli esempi.Tutti abbiamo visto questo. Red Bull ha organizzato il salto ad alta quota più alto di sempre. Questo non solo si allinea perfettamente con il loro brand, ma è anche letteralmente uno stunt. E, a proposito, è stato co-brandizzato con GoPro per motivi piuttosto ovvi:https://www.youtube.com/watch?v=dYw4meRWGd4Ma non devi necessariamente organizzare un evento che costi milioni. Può anche essere un qualcosa di leggermente oltraggioso che mandi lì fuori:Why should bread have all the fun, when there’s Weetabix? Serving up @HeinzUK Beanz on bix for breakfast with a twist. #ItHasToBeHeinz #HaveYouHadYourWeetabix pic.twitter.com/R0xq4Plbd0— Weetabix (@weetabix) February 9, 2021 Controverso e rischioso? Sicuramente. Ha funzionato? Ci puoi scommettere. Il tweet è diventato virale e ha contribuito in maniera indiscutibile a incrementare le vendite del 15%.Non è però quello che dovresti fare anche tu per aumentare le vendite. Utilizzare i social media in maniera organica per fare una cosa del genere sarebbe probabilmente uno spreco di tempo. Il beneficio principale sarà in termini di menzioni e backlink ricevuti:142 pagine hanno menzionato il tweet che è diventato virale, incluse alcune grandi pubblicazioni. Dati dal Content Explorer di Ahrefs.Nonostante questi siano grandi esempi di PR stunt, tieni a mente che i tuoi sforzi per ottenere i cosiddetti media guadagnati in questo modo potrebbero non sempre essere ripagati. Alcuni PR stunt potrebbero essere piuttosto rischiosi per la reputazione del tuo brand. Le persone potrebbero non interpretare la tua idea nel modo in cui avevi pensato.Poi abbiamo le campagne di guerilla marketing. Queste si sovrappongono ai PR stunt, ma la differenza sta nel fatto che il guerilla marketing è principalmente all’aperto, low cost e ancora più audace e non convenzionale. Lo scopo è quello di sorprendere le persone, dunque è di solito anche piuttosto memorabile.Le nostre tazze da caffè al Brighton SEO, la più grande conferenza SEO al mondo, erano un sublime esempio di guerilla marketing. Rimpiazzando i valori nutrizionali con valori relativi alle parole chiave, abbiamo generato parecchio rumore, e le persone hanno cominciato a parlarne.The coffee cups are so cool 😎 @ahrefs @brightonseo #BrightonSEO #brightonseo2019 pic.twitter.com/Dcmr2nZyuF— Adam Najak ッ (@adamnajak) September 13, 2019 Le tazze del caffè sono fighissime!Ad ogni modo, utilizzare a proprio vantaggio gli spazi pubblici è un esempio molto più comune. Ad esempio, puoi fare molto anche con delle semplici strisce pedonali:La creatività non ha limiti, come puoi vedere anche dallo promo per un nuovo prodotto Marmite:8. Promuovi i tuoi valori prendendo posizione su qualcosaIniziamo con un esercizio mentale non molto intuitivo. Pensa ad alcuni brand che ti piacciono e il loro scopo, la loro mission o qualsiasi altra cosa per la quale prendono posizione. Se sei come me, non avrai molto successo in questo compito. La maggior parte dei brand fallisce a comunicare un chiaro obiettivo. Vendere un prodotto che risolve un problema a qualcuno solitamente è abbastanza—non c’è bisogno di altro.Ma dato che la competizione è bassa, le tue possibilità di distinguerti dalla massa sono elevate e nelle tue mani. Prendi posizione per qualcosa in cui credi veramente, parlane, e avrai ottimi risultati in termini di PR.In merito agli eventi più recenti, la battaglia fra la community Reddit e gli investimenti corporate costituisce un ottimo esempio. Reddit è riuscita addirittura a farsi strada nel Super Bowl, uno degli spazi pubblicitari più costosi al mondo:https://www.youtube.com/watch?v=_wkvH0qBMP8Se noti il corto annuncio, avrai voglia di fermarti e cercarlo online in un secondo momento. Non è un formato che si vede tutti i giorni. È stato reputato come uno degli annunci più efficaci durante quella giornata.Dal punto di vista di una comunicazione più a lungo termine, Patagonia è davvero efficace a far comprendere come per loro siano importanti il futuro del pianeta e la sostenibilità. Questo era il loro annuncio per il Black Friday, ad esempio:Non si tirano indietro nemmeno di fronte alla politica. Sono arrivati fino al punto di denunciare l’amministrazione di Trump per supportare la causa ambientale:Non so quanto questo loro attivismo influisca sulle vendite, ma una cosa è chiara: Patagonia è molto credibile e costante nelle posizioni prese. Non puoi dire la stessa cosa di molte altre aziende che promuovono una “causa importante”. Non so se ti ricordi di alcuni annunci piuttosto controversi di Pepsi o Gillette.9. Trasforma la pubblicità negativa in ottime PRTrasformare eventi negativi che possono danneggiare la tua azienda in qualcosa di buono è davvero una sfida.Ecco la famosa risposta di KFC quando si sono trovati a corto di pollo nel Regno Unito:Ovviamente non sarai in grado di farlo con tutte le cose negative. Il modo più semplice e spesso migliore per farlo, è quello di accettare le tue responsabilità e ammettere i tuoi errori.Spesso puoi ammirare degli ottimi esempi del “trasformare qualcosa di cattivo in qualcosa di buono” fatti molto male nella politica. Non voglio avventurarmi in queste acque in quanto spesso i fatti vengono distorti e manipolati. Ma non c’è bisogno di dire che i tuoi sforzi dovrebbero essere sinceri.ConclusioneUna cosa è capire le PR; un’altra cosa è eseguirle con successo. Puoi copiare molte tattiche di marketing, ma quelle relative alle PR richiedono spesso più creatività.Vai pure avanti, ricerca e fatti ispirare dalle migliori campagne PR della tua nicchia. Devi però sempre mettere tanta creatività e sforzo per far sì che le campagne di PR funzionino. Quindi, in bocca al lupo.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Fantastiche Tattiche di Pubbliche Relazioni con Esempi da Campagne Reali"
    },
    {
      "level": "H2",
      "text": "1. Monitora e reagisci alle richieste dei media"
    },
    {
      "level": "H3",
      "text": "a) Utilizza le parole chiave per filtrare le richieste"
    },
    {
      "level": "H3",
      "text": "b) Verifica l’autorevolezza e la storia della pubblicazione"
    },
    {
      "level": "H3",
      "text": "c) Scegli le richieste alle quali puoi fornire davvero delle ottime informazioni"
    },
    {
      "level": "H3",
      "text": "d) Rispondi il prima possibile"
    },
    {
      "level": "H3",
      "text": "e) Fatti aiutare dai colleghi"
    },
    {
      "level": "H3",
      "text": "f) Attieniti alla richiesta"
    },
    {
      "level": "H2",
      "text": "2. Newsjacking"
    },
    {
      "level": "H3",
      "text": "Monitorare i media per il newsjacking"
    },
    {
      "level": "H3",
      "text": "Prepara il tuo commento"
    },
    {
      "level": "H3",
      "text": "Proponi il tuo commento"
    },
    {
      "level": "H2",
      "text": "3. Fai leva sul trend del momento"
    },
    {
      "level": "H2",
      "text": "4. Proponi risorse per link a giornalisti e blogger"
    },
    {
      "level": "H3",
      "text": "a) Cerca di capire che tipologia di contenuto attrae link nella tua nicchia"
    },
    {
      "level": "H3",
      "text": "b) Pubblica le tue risorse per linkabili"
    },
    {
      "level": "H3",
      "text": "c) Contatta persone che potrebbero fornire link al tuo contenuto"
    },
    {
      "level": "H2",
      "text": "5. Ottieni dei brand ambassador"
    },
    {
      "level": "H2",
      "text": "6. Collabora con altri brand"
    },
    {
      "level": "H2",
      "text": "7. PR stunts e guerilla marketing"
    },
    {
      "level": "H2",
      "text": "8. Promuovi i tuoi valori prendendo posizione su qualcosa"
    },
    {
      "level": "H2",
      "text": "9. Trasforma la pubblicità negativa in ottime PR"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Michal Pecánek"
}