{
  "url": "https://ahrefs.com/blog/it/redirect-301/",
  "slug": "redirect-301",
  "title": "Redirect 301 per SEO: Tutto quello che Devi Sapere",
  "description": "Scopri cosa sono i redirect 301, come influenzano SEO, come impostarli e, soprattutto, come utilizzarli per aumentare il traffico organico.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Vuoi sapere tutto quello che c’è da sapere su redirect 301, incluso come usarli e aumentare il tuo traffico organico? Sei nel posto giusto.I redirect (reindirizzamenti) 301 sono un concetto abbastanza semplice. Vengono utilizzati per reindirizzare una pagina web ad un’altra.Ma capire come sono collegati a SEO è molto più complesso.In questa guida, imparerai:Cosa sono i redirect 301;Come implementarli;Come impattano SEO;Come risolvere problemi di SEO causati da redirect 301;Come utilizzare redirect 301 per (potenzialmente) aumentare il traffico organicoIniziamo dal principio.Che cos’è un redirect 301?Un reindirizzamento 301 indica lo spostamento permanente di una pagina web da un luogo ad un altro.Il numero 301 fa riferimento al codice di stato HTTP della pagina reindirizzata.Esempio: blog.ahrefs.com reindirizza a ahrefs.com/blogIn termini semplici, un reindirizzamento 301 dice al browser: “Questa pagina si è spostata permanentemente. Questo è il nuovo indirizzo e non abbiamo intenzione di tornare indietro.” Al che il browser risponde: “Ottimo! Mando l’utente lì subito!”Questo è il motivo per il quale se visiti blog.ahrefs.com, non si carica.Finirai invece su ahrefs.com/blog.Come fare un reindirizzamento 301Ci sono molti modi per fare un reindirizzamento 301, ma il metodo più comune è di modificare il file .htaccess del tuo sito.Troverai questo file nella cartella root (radice) del tuo sito:Non vedi il file? Questo può voler dire una di due cose:Non hai un file .htaccess. Creane uno utilizzando Notepad (Windows) oppure TextEdit (Mac). Crea semplicemente un nuovo documento e salvalo con il nome .htaccess. Assicurati di non rimuovere l’estensione di file standard .txt.Il tuo sito non utilizza un server web Apache. Questo è abbastanza tecnico, ma ci sono diversi tipi di server web. Apache, Windows/IIS, e Nginx sono i più comuni. Solo i server Apache utilizzano .htaccess. Per verificare che il tuo sito web utilizzi Apache, chiedi al tuo host web.Questi sono alcuni frammenti di codice per aggiungere tipologie comuni di reindirizzamenti 301 tramite .htaccess:IMPORTANTE. Queste istruzioni sono solo per server web Apache. Leggi qui se il tuo sito utilizza Nginx, o qui se il tuo sito utilizza Windows/IIS.Reindirizzare una vecchia pagina web ad una nuova Redirect 301 /old-page.html /new-page.html Utilizzi WordPress? Rimuovi la necessità di modificare il file .htaccess con il plugin Redirection gratuito.Rende aggiungere reindirizzamenti 301 facile quanto fare questo:Reindirizza un vecchio dominio ad un nuovo dominio RewriteEngine on RewriteCond %{HTTP_HOST} ^oldsite.com [NC,OR] RewriteCond %{HTTP_HOST} ^www.oldsite.com [NC] RewriteRule ^(.*)$ https://newsite.com/\\ [L,R=301,NC] Nota a margine. Ci sono diversi modi per fare questo. Non sono un esperto di Apache server e file htaccess. Questo è il codice che ha sempre funzionato per me. Assicurati di testarlo prima di implementarlo sul tuo sito. IMPORTANTE! Se <code>RewriteEngine on</code> è già nel tuo file .htaccess, non ripeterlo. Copia il resto del codice. È anche possibile farlo in Cpanel, il che potrebbe essere preferibile.Reindirizza un intero dominio da non-www a www (e viceversa)Questa è la versione da non-www a www: RewriteEngine on RewriteCond %{HTTP_HOST} ^example.com [NC] RewriteRule ^(.*)$ http://www.example.com/\\ [L,R=301,NC] Questa la versione da www a non-www: RewriteEngine on RewriteCond %{HTTP_HOST} ^www.example.com [NC] RewriteRule ^(.*)$ http://example.com/\\ [L,R=301,NC] IMPORTANTE! Il posizionamento e l’ordine del codice nel tuo file htaccess è importante. Potresti riscontrare effetti non voluti se molte istruzioni sono inserite nell’ordine “sbagliato” (ad es., catene di reindirizzamenti, etc.). Se hai intenzione di implementari molti reindirizzamenti 301 nel tuo file htaccess, ti suggeriamo di starci attento.Reindirizza un intero dominio da HTTP a HTTPSRewriteEngine On RewriteCond %{HTTPS} off RewriteRule ^(.*)$ https://%{HTTP_HOST}%{REQUEST_URI} [L,R=301] IMPORTANTE! Devi avere un certificato SSL installato sul tuo sito web perché questo funzioni. Altrimenti, otterrai il messaggio di attenzione “Sito non sicuro”.Reindirizza un intero dominio da non-www a www e da HTTP a HTTPSRewriteEngine On RewriteCond %{HTTP_HOST} !^www. [NC] RewriteRule ^ https://www.%{HTTP_HOST}%{REQUEST_URI} [L,R=301] RewriteCond %{HTTP:X-Forwarded-Proto} !https RewriteCond %{HTTPS} off RewriteRule ^ https://%{HTTP_HOST}%{REQUEST_URI} [L,R=301]I reindirizzamenti 301 impattano SEO?Molti professionisti di SEO si concentrano sulla relazione tra reindirizzamenti 301 e PageRank.Non conosci il PageRank? È l’algoritmo che Google ha creato per giudicare il “valore di una pagina” in base alla quantità e qualità dei suoi link. Ovviamente, il PageRank non è l’unico “fattore di posizionamento,” ma in generale si pensa che, in generalmente, un PageRank più alto coincide con posizionamenti più alti.C’è qualche prova di questo? Sì, Google ha (ri)confermato l’anno scorso che il PageRank è un segnale utilizzato per il posizionamento:DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理” Illyes (@methode) February 9, 2017C’è anche una chiara correlazione positiva tra Ahrefs’ URL Rating—che funziona in una maniera simile a PageRank—e la quantità di traffico organico ricevuta da un sito:Nota a margine. Il motivo per il quale parlo di URL Rating (UR) e non di PageRank è che Google ha interrotto i punteggi pubblici di PageRank nel 2016. Ora non c’è modo di sapere quanto PageRank abbia una pagina. Non sto dicendo che UR è equivalente a PageRank, ma è la metrica più vicina che abbiamo disponibile. Quindi cosa c’entra questo con i reindirizzamenti 301?Prima del 2016, se utilizzavi un reindirizzamento 301 per reindirizzare da una pagina all’altra, c’era un calo di PageRank perso per strada. Quanto? Questo è oggetto di discussione, ma 15% sembrava essere l’ipotesi più comune. È anche nella fascia alla quale allude Matt Cutts, ex Capo di Webspam presso Google, in questo video del 2013:https://www.youtube.com/watch?v=Filv4pP-1nwNota a margine. Matt non ha detto esattamente che i reindirizzamenti 301 portano ad una perdita del 15% di PageRank in quel video. Quella è solo la figura che ha utilizzato come esempio. D’altra parte, è il numero sul quale sembravano essere d’accordo la maggior parte dei professionisti di SEO per diversi anni. È probabile perché 15% riguarda anche il “tasso di caduta” nel brevetto originale di PageRank.Come argomento di discussione, assumiamo che il numero fosse 15%.Ecco come funzionerebbe:Reindirizzamento 301 semplice: domain.com/page‑1 → domain.com/page‑2 = perdita di 15% di PageRankcatena di reindirizzamenti 301: domain.com/page‑1 → domain.com/page‑2 → domain.com/page‑3 → domain.com/page‑4 = perdita di 38% di PageRank!D’altra parte, Google ha cambiato la sua posizione ufficiale su questo nel 2016:30x redirects don’t lose PageRank anymore.— Gary “鯨理” Illyes (@methode) July 26, 2016Quindi, nel 2019, se reindirizzi domain.com/page1 a domain.com/page2, la pagina reindirizzata dovrebbe avere tanto “potere” quanto la pagina originale.Questo è MOLTO significativo, ed è parte del motivo per il quale i reindirizzamenti 301 possono essere così utili per aumentare il traffico organico. (Ne parleremo in maniera approfondita più avanti!)Ma i reindirizzamenti 301 possono causare molti altri problemi di SEO di cui non si parla spesso.Come risolvere problemi di 301 esistenti sul tuo sitoEcco come trovare e risolvere problemi esistenti relativi a reindirizzamenti 301.1. Assicurati che la versione HTTP del tuo sito reindirizzi a HTTPSOgni website dovrebbe utilizzare HTTPS.Non solo aggiunge uno strato aggiuntivo di sicurezza per i tuoi visitatori, ma Google utilizza HTTPS come fattore per il posizionamento. Combina questo con il fatto che i certificati SSL certificates sono disponibili gratuitamente tramite Let’s Encrypt e non c’è davvero alcuna scusa per utilizzare HTTPS nel 2019.Ma avere un certificato SSL è solo metà della battaglia…Devi anche assicurarti che le persone visitino effettivamente la versione HTTPS del tuo sito, che vuol dire utilizzare un reindirizzamento 301 permanente dalla versione HTTP a quella HTTPS.Per verificare che ci sia questo reindirizzamento, naviga sulla tua home page e cerca la barra dell’url. Dovresti vedere https://[www].tuosito.com/, con l’icona di un lucchetto.Cambia l’indirizzo a http:// (not https://) e premi invio. Dovresti venire reindirizzato alla versione HTTPS automaticamente.Se questo succede, quindi dovrebbe essere tutto a posto o quasi. Potrebbero comunque esserci altri problemi, quali:Il reindirizzamento da HTTP a HTTPS non è implementato su tutte le pagine del sito (ad es., sottodomini).Reindirizzamenti da HTTPS a HTTPPer assicurarti che non vi sia altri problemi simili, avvia una scansione con Ahrefs’ Site Audit.https://www.youtube.com/watch?v=LjinWqfGyVENaviga verso il rapporto pagine interne e cerca questi problemi:NOTA. Se vedi una pagina con avvertimento da HTTP a HTTPS, e si tratta semplicemente della versione HTTP della pagina dalla quale è partito il crawl, allora questo non è un problema.Risolvi eventuali problemi utilizzando il giusto reindirizzamento 301 dalla versione HTTP a quella(e) HTTPS della(e) pagina(e) affette.2. Rimuovi le pagine con codice di stato 301 dalla tua sitemapGoogle guarda alla tua sitemaps per capire quali pagine scansionare ed indicizzare.Siccome le pagine con codice di stato 301 non esistono più tecnicamente, non ha senso chiedere a Google di scansionarle. Se queste pagine restano nella tua sitemap, Google potrebbe continuare a visitarle ogni volta che ri-scansione il tuo sito web. Questo non è necessario e spreca il crawl budget.Ecco un modo per trovare questo tipo di pagine:Trova lo URL della tua sitemap (questo solitamente è yourdomain.com/sitemap.xml… ma non sempre)Utilizza questo strumento per scaricare tutti gli URLs.Incolla la lista di URLs in questo strumento per verificare gratuitamente il codice di stato HTTP (nota: c’è un limite di 100 URL alla volta)Filtra le pagine con codice di stato 301.Vuoi utilizzare un metodo più facile? Utilizza Ahrefs’ Site Audit per scansionare il tuo sito, quindi vai sul rapporto Overview e cerca errori “3XX redirect in sitemap”.Cliccando qui rivela tutte le pagine con codice di stato 301 nella(e) tue sitemap.Rimuovi questi URL dalla tua sitemap e sostituiscili con l’indirizzo URL finale del reindirizzamento (se non c’è già).3. Risolvi le catene di reindirizzamentoLe catene di reindirizzamento capitano quando c’è una serie di due o più reindirizzamenti tra lo URL iniziale e l’URL di destinazione.Ecco cosa dice Google a proposito:Anche se Googlebot e i browser possono seguire una “catena” di reindirizzamenti multipli (e.g., Pagina 1 > Pagina 2 > Pagina 3), noi consigliamo di reindirizzare direttamente alla destinazione finale. Se questo non è possibile, mantieni il numero di reindirizzamenti nella catena basso, idealmente non più di 3 e sicuramente meno di 5.Le catene di reindirizzamento non servono alcun obiettivo se non danneggiare l’esperienza dell’utente e rallentare il tutto, quindi dovresti evitarle il più possibile.Puoi verificare le catene di reindirizzamento su fino a 100 URL utilizzando questo strumento per verificare il codice di stato HTTP.Cerca le pagine con due o più reindirizzamenti.Per controllare più di 100 pagine alla volta, controlla il rapporto Internal pages (pagine interne) in Ahrefs’ Site Audit e cerca errori “Redirect chain” (catene di reindirizzamento).Cliccare su questo rivela tutti gli URL nella catena, inclusa la pagina di destinazione finale.Ci sono due modi per risolvere questi errori;Sostituire la catena di reindirizzamento con un unico reindirizzamento 301. Invece che Pagina 1 > Pagina 2 > Pagina 3 > Pagina 4, il reindirizzamento diventa Pagina 1 > Pagina 4.Sostituisci i link interni alle pagine reindirizzate con link diretti a URL finali. Questo previene il rischio che Google e altri bot scansionino le catene di reindirizzamento. Ancor più importante, evita che veri esseri umani (sai, quelle persone che *potrebbero* comprare qualcosa dal tuo sito) dal dover subire la lentezza di molteplici reindirizzamenti quando cliccano su un link.Dove è pratico, la seconda soluzione è la migliore.Per farlo, ordina la lista di catene di reindirizzamento in base alla colonna “No. of inlinks” (numero di link interni) dall’alto al basso. Quindi clicca sul numero di link interni per vedere tutti i link interni alla pagina reindirizzata.Sostituisci i link interni sulle pagine affette dal problema con link diretti allo URL di destinazione finale.4. Risolvi i loop di reindirizzamentoI loop di reindirizzamento avvengono quando uno URL reindirizza ad un altro URL nella stessa catena. Questo crea un giro (loop) infinito id reindirizzamenti che può confondere ed intrappolare motori di ricerca così come utenti.Esempio: Pagina 1 > Pagina 2 > Pagina 3 > Pagina 2 > Pagina 3 > Pagina 2 > Pagina 3 […]Questi sono la morte dell’esperienza utenti perché solitamente portano ad una risposta di questo tipo da parte del browser:Puoi trovare errori di loop di reindirizzamenti in blocchi da 100 utilizzando lo stesso strumento di controllo dei codici di stato HTTP che abbiamo utilizzato in precedenza. Cerca per errori di tipo “Exceeded maximum number of redirects” (Numero massimo di reindirizzamenti superato).Per verificare più di 100 pagine, controlla il rapporto pagine interne nel Ahrefs’ Site Audit cercando errori “Redirect loop” (loop di reindirizzamento).Clicca qui per mostrare tutte le pagine con problemi di loop di reindirizzamento, quindi risolvi ogni problema di uno di due modi:Se l’URL non dovrebbe reindirizzare, cambia il codice di risposta HTTP a 200.Se l’URL dovrebbe reindirizzare, fissa l’URL di destinazione finale e rimuovi il loop. In alternativa, rimuovi o sostituisci tutti i link interni allo URL reindirizzante.5. Fissa i reindirizzamenti rottiI reindirizzamenti rotti sono pagine che portano a pagine che non esistono (cioè, quelli che portano ad un codice di risposta HTTP 4XX o 5XX).Esempio: Pagina 1 (301) > Pagina 2 (404)Questi non vanno bene perché né i visitatori né i motori di ricerca possono accedere allo URL finale. Per questo, molti visitatori lasceranno il tuo sito web, e molti motori di ricerca abbandoneranno la scansione.Puoi verificare questi errori in blocchi da 100 utilizzando uno strumento di verifica codice di stato HTTP.Per verificare più pagine, cerca errori “Broken redirect” (reindirizzamento rotto) nel rapporto Internal pages (pagine interne) in Ahrefs’ Site Audit.Risolvi questi errori in uno di questi modi:Reinserendo la pagina non funzionante (se cancellata per sbaglio)Rimuovendo il link interno allo URL reindirizzato.6. Reindirizza pagine 404Le pagine che restituiscono il codice di stato 404 sono morte, e quindi il browser restituisce una pagina così:Ora, ci sono occasioni in cui ha senso che l’utente veda questi errori. Se un utente inserisce uno URL sbagliato nel proprio browser, ad esempio, la pagina di errore permette di sapere che è successo qualcosa di sbagliato. Puoi vederne un esempio qui sopra—ha senso restituire una pagina 404 per quello URL.Detto questo, le pagine con codice di stato 404 sono un problema quando:Sono scansionabili. Scansionabile solitamente è uguale a cliccabile. E se sono cliccabili, alcuni utenti ci finiranno sopra cliccando su link interni sul tuo sito per poi ritrovarsi su una pagina morta. Questa non è una gran bella esperienza di utilizzo.Hanno backlink. Siccome le pagine 404 non sono accessibili, ogni backlink che punta ad esse è di fatto sprecato.Per risolvere il primo problema, controlla il rapporto Internal links nel Ahrefs’ Site Audit cercando errori “404 page” (pagina 404).Clicca qui per vedere tutte le pagine 404 che vengono trovate durante la scansione.Quindi, clicca sul pulsante “Manage columns” (gestisci colonne), aggiunge la colonna “No. of dofollow backlinks” (numero di backlink dofollow), clicca su “Apply,” quindi ordina la colonna dall’alto al basso.Controlla il rapporto Backlinks in Ahrefs Site Explorer cercando pagine con uno o più backlink “dofollow”. C’è una buona probabilità che questi link siano di valore. Se lo sono, vorrai reindirizzare (301) la pagina ad una risorsa rilevante sul tuo sito web.IMPORTANTEReindirizzare le pagine 404 a qualcosa di rilevante è importante. Google tratta i 301 non rilevanti come versioni soft di 404, quindi non c’è alcun vero vantaggio a fare un reindirizzamento a meno che non lo fai su una pagina quantomeno simile o rilevante.John Mueller di Google lo spiega in maniera approfondita in questo video.https://youtu.be/nIDZmac_rMI?t=76Se non hai una pagina simile o rilevante, e hai ancora molte pagine 404 con molti backlink d’alta qualità allora, onestamente, può valer la pena ripubblicare il contenuto che esisteva in quella pagina.Pensalo in questo modo:Se la pagina morta era così di valora da attrarre backlink d’alta qualità, allora c’è da chiedersi perché non esista più. Voglio dire, chiaramente è un argomento al quale la gente è interessata.Per pagine senza backlink dofollow, fissali in uno di questi modi:Reinserisci la pagina morta a quel URLReindirizza (301) la pagina morta ad un’altra pagina rilevanteRimuovi o sostituisci tutti i link interni alla pagina mortaIMPORTANTE. Se scegli l’opzione #3, assicurati non di sostituire il link interno ma anche il testo di ancoraggio e il testo attorno, dove necessario.7. Sostituisci i reindirizzamenti 302 e reindirizzamenti di aggiornamento meta con 301Non usare mai reindirizzamenti 302 o reindirizzamenti di meta refresh (meta aggiornamento) al posto di reindirizzamenti permanenti.I reindirizzamenti 302 sono per spostamenti temporanei, e Google consiglia di non usare reindirizzamenti meta refresh in alcun caso se possibile. Quindi, se hai uno di questi sul tuo sito, dovresti cercare di rimuoverli o sostituirli con reindirizzamenti 301.Per vedere pagine con questi codici di stato HTTP, consulta il rapporto Internal pages in Ahrefs’ Site Audit cercando problemi di“Meta refresh redirect” e “302 redirect”.Fortunatamente, entrambe questi problemi possono essere risolti nello stesso modo:Se il reindirizzamento è permanente, utilizza invece un reindirizzamento 301.Se il reindirizzamento non è permanente, rimuovi il reindirizzamento.Dovresti anche cercare di rimuovere o sostituire link interni alle pagine reindirizzate, specialmente se possono creare confusione per chi ci clicca sopra.8. Cerca pagine di reindirizzamento (301) che ricevono traffico organicoPagine con codice di stato HTTP 301 non dovrebbero ricevere traffico organico perché non dovrebbero essere nell’indice di Google. Se queste pagine stanno ricevendo traffico, vuol dire che Google non ha ancora visto il reindirizzamento.Per verificare le pagine 3XX con traffico, vai sul rapporto Overview in Ahrefs’ Site Audit e cerca errori di tipo “3XX page receives organic traffic”.Se hai la tua lista di pagine 3XX da qualche altro strumento (ad es., uno strumento di verifica di codice di stato HTTP), allora incolla la lista nel Ahrefs’ Batch Analysis tool in blocchi fino a 200 per vedere il traffico organico a livello di pagina.NOTA. Potresti anche verificare il traffico organico in Google Analytics o nella Google Search Console.Ora, se hai aggiunto il reindirizzamento 301 di recente, è probabile che questo non sia un problema. Google dovrebbe notarlo durante la prossima scansione, dopo la quale toglieranno la pagina dall’indice.Per velocizzare il processo, incolla l’URL nello strumento ispezione URL nella Google Search Console, quindi clicca su “Richiedi indicizzazione.”Dovresti anche rimuovere queste pagine dalla tua sitemap (vedi punto #2) ed inviare di nuovo la sitemap tramite la Google Search Console.9. Cerca 301 esterni “cattivi”La maggior parte di siti web hanno link a siti di terze parti e risorse rilevanti.Questo è bene… finché la pagina verso la quale è presente il link reindirizza da qualche parte.Ad esempio, immagina che hai inserito un link ad una risorsa utile. Dodici mesi più tardi, quel dominio scade e viene comprato da un cercatore di domini scaduti che cancella la risorsa rilevante e reindirizza al loro sito attuale. Ora hai involontariamente un link a qualcosa di irrilevante (e potenzialmente anche dannoso) per i tuoi visitatori.Per questa ragione, è importante verificare ogni tanto i link esterni 301 cercando eventuali link “cattivi”.Per fare questo, vai sul rapporto Pagine esterne nel Ahrefs’ Site Explorer e cerca errori di tipo “External 3XX redirect”.Clicca su questo per vedere una lista di tutti i link di reindirizzamento esterno, oltre allo URL di destinazione finale.Vedi troppe pagine?Siccome i link esterni nofollow sono spesso cose tipo commenti blog, puoi rimuoverli per ottenere una lista più pulita. Aggiungi un filtro “No. of inlinks dofollow > 0” al rapporto.Questo dovrebbe aiutarti a prioritizzare.Quindi, scorri il rapporto guardando le colonne URL e Redirect URL. Cerca reindirizzamenti che non sembrano a posto. In altre parole, ignora cose quali reindirizzamenti da HTTP a HTTPS, e reindirizzamenti da blog.domain.com/page a domain.com/blog/page. Cerca reindirizzamenti verso altri siti o pagine.Ecco un esempio che ho trovato andando su Backlinko:Il problema qui non è tanto che il reindirizzamento punta ad un altro sito web. Chi ha familiarità con Neil Patel saprà che ha fuso blog.kissmetrics.com con neilpatel.com quest’anno di recente.No, il problema è che la pagina reindirizzata è un articolo completamente diverso.Titolo originale dell’articolo: Utilizzare la Magia dei Dati Qualitativi per aumentare le Conversioni SaaSTitolo dell’articolo reindirizzato: Come Capire Il Tuo Cliente Ti Aiuterà a creare Testo Che VendeIn questi casi, è meglio rimuovere il(i) link interno(i) alla pagina reindirizzata.Per fare questo, clicca sul numero nella colonna “No. of inlinks” per vedere ogni pagina con link interni alla pagina reindirizzata.Vai nel tuo CMS e rimuovile.Come utilizzare reindirizzamenti 301 per aumentare il tuo traffico organicoA questo punto, il tuo sito dovrebbe essere libero da problemi impattanti SEO legati a reindirizzamenti 301.Ora è tempo di fare ragionamenti seri e parlare di come possiamo utilizzare il potere dei reindirizzamenti per aumentare il traffico organico.Ecco due metodi per farlo.La tecnica CocktailHai un bicchiere di Coca Cola. Mmm. Hai un bicchiere di rum. Che sapore!Entrambe sono ottimi drink nel loro contesto. Combinandoli, però, porti il tutto in un’altra dimensione. Buonasera, Cuba Libre! Quindi cosa c’entra questo con reindirizzamenti 301?Pensa ad entrambe questi drink come pagine di argomento simile sul tuo sito web. Entrambe vanno bene. Hanno un po’ di backlink utili. Ottengono un po’ di traffico organico. Niente male. Ma perché non fonderle e consolidare queste due pagine in una che sia ancora meglio?Facendo questo, è probabile che possiamo trasformare due pagine dal rendimento medio in un unico delizioso cocktail di pagina che performa ancora meglio!Abbiamo fatto questo con due dei nostri post sul blog di Ahrefs:https://ahrefs.com/blog/skyscraper-technique/https://ahrefs.com/blog/skyscraper-technique-fail/Entrambe questi articoli stavano diventando vecchi, quindi abbiamo deciso di fonderli in una nuova guida.Abbiamo quindi ripubblicato la pagina su ahrefs.com/blog/skyscraper-technique/ e reindirizzato l’altro articolo ad essa.I risultati parlano da soli:Quindi perché funziona?Due motivi:Consolidamento di “autorevolezza”: Ricordi come i reindirizzamenti 301 non “perdono” più PageRank? Reindirizzando uno di questi articoli all’altro, siamo riusciti a fondere “l’autorevolezza” di entrambe le pagine in una. Ovviamente, questo non funziona se le due pagine sono scollegate perché altrimenti Google le tratta come 404 soft. Siccome però queste due pagine sono simili, ha funzionato alla perfezione.Contenuti migliori: Entrambe questi articoli avevano una qualità decente. Stavano semplicemente iniziando ad essere un po’ meno aggiornati. Prendendo il meglio da entrambe i post e fondendoli, abbiamo creato un contenuto nettamente meglio di entrambi che, secondo noi, si merita molto più traffico.Ora, l’unica domanda rimanente è come replicare questa strategia, giusto?Ecco il processo.Passo 1. Cerca problemi di cannibalizzazione di parole chiave (con backlink)La cannibalizzazione di parole chiave avviene quando due o più pagine hanno come target e sono posizionate per le stesse parole chiave. Trovare questi problemi è un buon modo per identificare opportunità.Quindi, iniziando dal principio, fai una copia di questo Foglio di Calcolo Google Sheet.Poi, incolla il tuo sito in Ahrefs’ Site Explorer, vai sul rapporto Top Pages, ed esportalo in formato CSV.Importa il CSV nella prima scheda del tuo Google Sheet.Per farlo, vai su File > Importa… > Upload > Seleziona il CSV > Scegli l’opzione “Aggiungi in fondo al foglio attuale” Ecco fatto. Vai alla scheda “Results” e dovresti vedere dei risultati raffinati.Passo 2. Trova opportunità rilevantiCome prossimo passo, devi guardare il foglio con i risultati cercando opportunità di reindirizzamento.Ecco un buon esempio dal blog di Hubspot:Queste due pagine si trovano rispettivamente in posizione #5 e #6 per “user generated content.”Entrambe:Parlano di argomenti molto similiHanno molti backlink da siti unici (467 domini di referral combinati!)Ottengono un po’ di traffico organicoGuardiamo quindi le pagine meglio posizionate per “user generated content” in Ahrefs’ Keywords Explorer:Due cose balzano all’occhio dalla pagina attualmente ai vertici della pagina dei risultati di ricerca:Ottiene quasi 2x il traffico dei due post di Hubspot messi insieme!Ha 192 domini di referral… meno della metà dei 467 domini di referral verso i due post di HubspotQuindi se Hubspot dovesse fondere i due post in uno, e consolidare tutto quel “succo di link”, allora direi che hanno buone probabilità di prendersi il primo posto. Questo potrebbe potenzialmente raddoppiare il loro traffico!Passo 3. Riscrivi e fondi le pagineOra è tempo di prendere le cose migliori da entrambe le pagine e combinarle in una.Ad esempio, se stessimo scrivendo uno degli articoli di Hubspot menzionati precedentemente, vorremmo probabilmente mantenere la sezione su “Come Gestire La Tua Campagna di Contenuti Generati dagli Utenti” di uno dei due post:… e tenere la parte che spiega “Perché Contenuti Generati dagli Utenti?” dall’altro:Per mantenere la rilevanza della nua pagina il più alta possibile, e mitigare il rischio che Google tratti il nostro 301 come un 404 soft, possiamo anche controllare il rapporto Anchors in Site Explorer di ciascuna pagina:Questo ci dà un’idea del perché gli autori di quelle pagine hanno messo un link a quelle di Hubspot.Ad esempio, posso vedere che un po’ di persone hanno citato delle statistiche mettendo il link a questa pagina, quindi sarà importante mantenere queste statistiche nel nostro post aggiornato..PRO TIPDovresti anche considerare la riscrittura/fusione di queste due pagine come un’occasione per meglio servire l’intenzione di ricerca e dare agli utenti quello che stanno cercando. Se ci sono molte liste di “migliori 10” per la parola chiave obiettivo, allora fai si che il tuo post aggiornato sia una lista “migliori 10”. Se ci sono molte guide “come fare”, beh’ allora… dovresti aver capito!NOTA. Questo non ha niente a che vedere con i reindirizzamenti 301, ma vale la pena farlo se vuoi massimizzare il ROI (Ritorno sull’Investimento) dei tuoi sforzi.Passo 4. Pubblica la tua pagina aggiornata e implementa i reindirizzamenti 301Ora è finalmente tempo di pubblicare la tua nuova pagina aggiornata.Se uno dei due URL è un buon candidato per il tuo nuovo post, allora ripubblica su quel URL. Puoi quindi cancellare l’altra pagina ed aggiungere un reindirizzamento 301 al nuovo post.Potresti ricordare quello che abbiamo fatto con il nostro post su skyscraper technique. Abbiamo riutilizzato lo URL /skyscraper-technique/.Se nessuno dei due URL è un buon candidato per il tuo nuovo post/pagina, allora è perfettamente sensato di fare reindirizzamenti 301 per entrambe le pagine ad uno URL completamente nuovo.Ad esempio, se volessimo fondere i due post Hubspot in un’unica guida:… allora nessuno dei due vecchi URL avrebbe davvero senso.Sarebbe meglio pubblicare su qualcosa come blog.hubspot.com/marketing/user-generated-content/Quindi, potremmo farlo, quindi fare reindirizzamenti 301 dalle altre due pagine a quel URL. Semplice.TIPVuoi portare ancora più in là questa idea? Fai una revisione dei contenuti per trovare pagine prive di traffico organico o posizionamento che però hanno dei backlink.Se queste pagine non sono importanti per la tua azienda, cancellale e reindirizzale ad una pagina rilevante che è importante.Il metodo fusioneEcco cosa succede al traffico organico di un sito dopo aver utilizzato il metodo fusione:I risultati dell’utilizzo del metodo fusione.C’è stata una crescita di traffico del ~116% in 12 mesi!Ecco il processo in breve:Compra un’altra azienda o sito nel tuo settoreFondi il sito con il tuo utilizzando reindirizzamenti 301Brian Dean di Backlinko ha fatto proprio questo l’anno scorso. Ha comprato un altro blog di SEO—Point Blank SEO—e lo ha reindirizzato a Backlinko. Infatti, è stato lui che ha utilizzato questo metodo per raggiungere i risultati che vedi nello screenshot qui sopra.Ma prima che inizi a comprare ogni sito web sul quale puoi mettere le mani, è importante capire questo:Avere successo con questo metodo non è così facile come comprare un sito vecchio e utilizzare 301 per reindirizzare tutte le pagine alla tua homepage. Questo è l’approccio pigro, e nel 2019, non è una buona idea. Devi anche implementare reindirizzamenti 301 per ogni singola pagina.Ecco come farlo, passo dopo passo:1. Trasloca e reindirizza i contenutiI più grossi aumenti di traffico vengono soprattutto dal traslocare i contenuti (re-homing) e reindirizzare i contenuti.Brian Dean lo ha fatto con alcuni dei post su pointblankseo.com, incluse le famose liste di strategie di link building di Jon.Sai, quelle con questo profilo di backlink:Lo URL originale era: pointblankseo.com/link-building-strategiesIl nuovo URL (reindirizzato) è: backlinko.com/link-building-strategiesSiccome Brian ha spostato il post dal vecchio al nuovo dominio con un reindirizzamento 301, tutti questi link ora puntano effettivamente alla stessa pagina ma di backlinko.com. La pagina ha effettivamente trovato una nuova casa.Quindi re-homing e il reindirizzamento dei contenuti sono l’opzione migliore quando tutte queste condizioni sono applicate:Il contenuto ha traffico organicoL’argomento è rilevante per la tua aziendaIl contenuto è di alta-qualitàNota che puoi discutere dell’inclusione nella lista dell’ultimo punto ma aggiornare o riscrivere il contenuto può essere fatto dopo averlo spostato e reindirizzato. Brian ha fatto proprio questo con quella lista di strategie di link building, che non era stata aggiornata dal 2012.Il vecchio post su pointblankseo.com Il nuovo post su backlinko.com2. Cancella e reindirizza il traffico ad un’altra paginaNon ha senso mantenere o applicare re-homing su pagine che:Hanno poco o nessun potenziale traffico organico.Sono duplicati di argomenti che hai già copertoAd esempio, non ha senso mantenere la pagina “su di noi” del sito che stai fondendo perché avresti due pagine “su di noi” … che non ha senso. Questo è vero anche per altre pagine che hanno come target le stesse parole chiave di pagine esistenti sul tuo sito.Reimpostare la home a queste porterebbe solo a problemi di cannibalizzazione di parole chiave.Allo stesso modo, se le pagine hanno poco o nessun potenziale di traffico, allora potresti anche semplicemente eliminarle e reindirizzare da un’altra parte. Questo è ciò che ha fatto Brian per diversi post di pointblankseo.com, come questo post su piattaforme di outreach:Quel post non esiste più. Brian lo reindirizza al suo blog post su strumenti di link building.Lo URL originale era: pointblankseo.com/outreach-platformsIl nuovo URL (reindirizzato) è: backlinko.com/link-building-toolsHa fatto questo perché la parola chiave “outreach platforms” non ha grossi volumi di ricerca e non ha potenziale di traffico. Non è un argomento che vale la pena avere come obiettivo.Quindi aveva senso reindirizzare questo post ad un altro post rilevante con potenziale di traffico.3. Cancella e reindirizza alla tua homepageSe non c’è una destinazione più rilevante per reindirizzare le pagine, e non ha senso spostarle traslocandole, allora l’ultima spiaggia è reindirizzarle alla homepage.Brian ha fatto questo con la maggior parte delle pagine su pointblankseo.com, come questa guida su ego-bait:Lo URL originale era: pointblankseo.com/egobait-guideIl nuovo URL (reindirizzato) è: backlinko.com/blogPerché questa è l’ultima spiaggia? Ricorda quello che abbiamo coperto prima riguardo la possibilità che Google tratti reindirizzamenti 301 irrilevanti come 404 soft. Questo potrebbe succedere quando reindirizzi post e pagine alla tua homepage.Ma qui c’è un aspetto importante: se non reindirizzi queste pagine, allora c’è una probabilità del 100% che Google le traffi come 404 soft. Conclusione: a questo punto vale la pena reindirizzarle.C’è però un ulteriore cavillo su questo, che è il motivo per il quale non dovresti reindirizzare pagine con backlink di bassa qualità. Fare questo potrebbe causare più danno che bene, quindi assicurati di controllare il rapporto Backlink in Site Explorer per ogni pagina prima di effettuare reindirizzamenti.Se il profilo di backlink è di questo tipo…… allora è probabile che sia meglio cancellare la pagina e lasciarla come 404.O, se senti davvero il bisogno di reindirizzare la pagina, allora puoi applicare disavow ai link cattivi prima di farlo. Lo sforzo potrebbe però non valere la pena.Pensieri finaliI reindirizzamenti 301 hanno molti utilizzi per quanto riguarda SEO.Utilizzali strategicamente e potresti vedere grossi benefici in traffico organico. D’altra parte, conviene assicurarsi prima che non ci siano problemi esistenti con reindirizzamenti 301 sul tuo sito, in quanto questi potrebbero fermare i tuoi sforzi correnti e futuri.Ho mancato qualcosa in questa guida? Fammelo sapere nei commenti o via Twitter.Tradot­to da Mar­co Viap­pi­ani, con­sulente di mar­ket­ing digitale. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Redirect 301 per SEO: Tutto quello che Devi Sapere"
    },
    {
      "level": "H2",
      "text": "Che cos’è un redirect 301?"
    },
    {
      "level": "H2",
      "text": "Come fare un reindirizzamento 301"
    },
    {
      "level": "H3",
      "text": "Reindirizzare una vecchia pagina web ad una nuova"
    },
    {
      "level": "H3",
      "text": "Reindirizza un vecchio dominio ad un nuovo dominio"
    },
    {
      "level": "H3",
      "text": "Reindirizza un intero dominio da non-www a www (e viceversa)"
    },
    {
      "level": "H3",
      "text": "Reindirizza un intero dominio da HTTP a HTTPS"
    },
    {
      "level": "H3",
      "text": "Reindirizza un intero dominio da non-www a www e da HTTP a HTTPS"
    },
    {
      "level": "H2",
      "text": "I reindirizzamenti 301 impattano SEO?"
    },
    {
      "level": "H2",
      "text": "Come risolvere problemi di 301 esistenti sul tuo sito"
    },
    {
      "level": "H3",
      "text": "1. Assicurati che la versione HTTP del tuo sito reindirizzi a HTTPS"
    },
    {
      "level": "H3",
      "text": "2. Rimuovi le pagine con codice di stato 301 dalla tua sitemap"
    },
    {
      "level": "H3",
      "text": "3. Risolvi le catene di reindirizzamento"
    },
    {
      "level": "H3",
      "text": "4. Risolvi i loop di reindirizzamento"
    },
    {
      "level": "H3",
      "text": "5. Fissa i reindirizzamenti rotti"
    },
    {
      "level": "H3",
      "text": "6. Reindirizza pagine 404"
    },
    {
      "level": "H3",
      "text": "7. Sostituisci i reindirizzamenti 302 e reindirizzamenti di aggiornamento meta con 301"
    },
    {
      "level": "H3",
      "text": "8. Cerca pagine di reindirizzamento (301) che ricevono traffico organico"
    },
    {
      "level": "H3",
      "text": "9. Cerca 301 esterni “cattivi”"
    },
    {
      "level": "H2",
      "text": "Come utilizzare reindirizzamenti 301 per aumentare il tuo traffico organico"
    },
    {
      "level": "H3",
      "text": "La tecnica Cocktail"
    },
    {
      "level": "H4",
      "text": "Passo 1. Cerca problemi di cannibalizzazione di parole chiave (con backlink)"
    },
    {
      "level": "H4",
      "text": "Passo 2. Trova opportunità rilevanti"
    },
    {
      "level": "H4",
      "text": "Passo 3. Riscrivi e fondi le pagine"
    },
    {
      "level": "H4",
      "text": "Passo 4. Pubblica la tua pagina aggiornata e implementa i reindirizzamenti 301"
    },
    {
      "level": "H3",
      "text": "Il metodo fusione"
    },
    {
      "level": "H4",
      "text": "1. Trasloca e reindirizza i contenuti"
    },
    {
      "level": "H4",
      "text": "2. Cancella e reindirizza il traffico ad un’altra pagina"
    },
    {
      "level": "H4",
      "text": "3. Cancella e reindirizza alla tua homepage"
    },
    {
      "level": "H2",
      "text": "Pensieri finali"
    }
  ],
  "author": "Joshua Hardwick"
}