{
  "url": "https://ahrefs.com/blog/it/ricerca-parole-chiave/",
  "slug": "ricerca-parole-chiave",
  "title": "Come Ricercare Parole Chiave Per La SEO - SEO Blog by Ahrefs",
  "description": "La ricerca di parole chiave è il processo di scoperta delle parole chiave per le quali vuoi posizionarti nei motori di ricerca. Riguarda la comprensione di cosa stanno cercando i potenziali clienti e perché.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Le parole chiave sono i pilastri della SEO. Se nessuno cerca ciò di cui tu stai scrivendo, non avrai traffico da Google—non importa quanto duramente ci proverai.Ecco perché abbiamo scritto questa guida per principianti. Ti insegna uno schema di ricerca parole chiave testato che puoi facilmente adattare al tuo sito web ed ai tuoi obiettivi. Abbiamo usato lo stesso schema per far crescere il nostro traffico del blog da 15.000 ad oltre 700.000 visite di ricerca mensili in soli pochi anni.Traffico di ricerca mensile per il blog di Ahrefs.Ci siamo anche sforzati di tenere tutto senza tecnicismi per quanto possibile e senza risparmiarci nei dettagli e con link a risorse extra alla fine di ogni sezione nel caso tu voglia approfondire.Iniziamo.Contents Guida SEO 1Come Funzionano i Motori di Ricerca 2Nozioni di base sulla SEO 3Ricerca delle parole chiave 4Contenuto SEO (EN) 5SEO on-page 6Link Building 7SEO tecnica Part 1Basi di ricerca parole chiavePrima di addentrarci nell intricato mondo della ricerca parole chiave e di come trovare le parole chiave migliori per la tua attività, assicuriamoci di conoscere le basi.Che cos’è la ricerca di parole chiave?La ricerca di parole chiave è il processo di comprensione del linguaggio che i tuoi clienti potenziali usano quando cercano i tuoi prodotti, servizi, e contenuti. Coinvolge quindi l’analisi, confronto, e scelta della priorità delle migliori opportunità di parole chiave per il tuo sito web.Perché è importante la ricerca di parole chiave?La ricerca di parole chiave è l’unico modo per capire cosa stanno digitando le persone nei motori di ricerca. Devi saperlo per evitare di creare contenuti su argomenti che nessuno sta cercando. Molti proprietari di siti web fanno questo errore, ed è il motivo per cui il 90,63% delle pagine non ottengono traffico da Google, secondo un nostro studio.La ricerca delle parole chiave inoltre ti aiuta a rispondere a domande come:Quanto difficile sarà posizionarsi per questa parola chiave?Quanto traffico potrò ottenere se mi posiziono per questa parola chiave?Quale tipo di contenuto dovrei creare per posizionarmi per questa parola chiave?Le persone che stanno cercando questa parola chiave potranno diventare miei clienti?Conoscere le risposte a queste domande ti aiuterà a scegliere attentamente le tue battaglie.Part 2Come trovare idee per parole chiaveLa ricerca di parole chiave inizia dal pensare a come i tuoi potenziali clienti potrebbero cercare la tua attività o il sito web. Puoi quindi usare gli strumenti di ricerca parole chiave per espandere queste idee e trovare ancora più parole chiave.E’ un processo semplice, ma bisogna comunque fare bene 2 cose:Devi avere una buona conoscenza del tuo settore.Devi conoscere come funzionano gli strumenti di ricerca parole chiave e come ottenere da essi il massimo.In questo capitolo, vedremo alcuni metodi pratici per migliorare la tua conoscenza in entrambe queste aree e scoprire parole chiave potenzialmente vincenti per il tuo sito web durante il processo.Brainstorm sulle parole chiave ‘seme’Trovare le parole chiave con le quali si posizionano i tuoi concorrentiUtilizzare strumenti di ricerca parole chiaveStudiare la tua nicchia 1. Brainstorm sulle parole chiave ‘seme’Le parole chiave seme sono le fondamenta del processo di ricerca delle parole chiave. Definiscono la tua nicchia e ti aiutano ad identificare i tuoi concorrenti. Ogni strumento di ricerca parole chiave ti chiede una parola chiave seme, che poi userà per generare un elenco immenso di idee di parole chiave (ne parlerò tra poco).Se hai già un prodotto o una attività che vuoi promuovere online, avere parole chiave seme è facile. Pensa solo a cosa le persone scrivono su Google per trovare la tua offerta.Per esempio, se vendi macchine ed attrezzatura per caffè, allora le parole chiave potrebbero essere:cafféespressocappuccinobricco a stantuffoNota che le parole chiave in quanto tali non sono necessariamente le migliori da avere come obiettivo per le pagine del tuo sito web. Come suggerisce il nome, le userai come ‘semi’ per i prossimi passi nel processo. Quindi non ossessionarti troppo con le parole chiave seme. Per trovarle dovresti impiegare solo pochi minuti.Appena hai una manciata di idee di base collegate all’argomento del tuo sito web, vai al prossimo passo. 2. Trovare le parole chiave con le quali si posizionano i tuoi concorrentiTrovare quali parole chiave mandano traffico ai tuoi concorrenti è di solito il miglior modo per iniziare la ricerca di parole chiave. Ma prima, devi identificare i concorrenti. Ecco dove la tua lista del brainstorm sulle parole chiave torna utile. Cerca su Google per una delle parole chiave seme e vedi chi si posiziona in prima pagina.Se nessuno dei siti web primi in classifica per le tue parole chiave seme sono simili al tuo sito (o come vorresti che fosse), prova a cercare invece con le query rilevanti con ‘autosuggerimento’.Query ’autosuggerimento” di Google escono appena inizi a digitare la tua query.Per esempio, se vendi macchine per caffé, potresti trovare altri concorrenti reali nei risultati di ricerca per “macchina cappuccino” al posto di “cappuccino”. Questo perché molti negozi ecommerce come il tuo si posizionano per il primo, e i blog per il secondo.In entrambi i casi, devi comunque usare un pò del tuo giudizio quando valuti i siti web concorrenti. Se vedi un brand gigante come Amazon o The New York Times posizionarsi per la tua parola chiave seme, non dovresti trattarli davvero come concorrenti. Cerca sempre siti web che assomigliano al tuo—o a quello che sarà il tuo.Dopo aver trovato alcuni siti web in linea, puoi portare questi siti web in uno strumento di intelligence competitiva come Site Explorer di ahrefs uno ad uno, e poi fare click nel report Pagine Migliori. Potrai così vedere le loro pagine più popolari dal traffico di ricerca mensile stimato. Il report inoltre mostra ogni “Parola chiave migliore” della pagina. E’ quella che manda il maggior traffico organico.Dati del report Pagine Migliori in Site Explorer di Ahrefs.Ecco alcune parole chiave interessanti che abbiamo scoperto per il nostro negozio ipotetico di caffé, analizzando solo un sito web concorrente con Site Explorer:come usare un bricco a stantuffocaffé turcomokacome fare il caffécaffettiera napoletanaCome puoi vedere, anche se hai esperienza nella tua nicchia, puoi sempre trovare molte idee di parole chiave dallo studio dei tuoi concorrenti che probabilmente non avresti trovato solo dal brainstorming.Se hai controllato tutti i concorrenti nei risultati di ricerca ma comunque vuoi altre parole chiave, puoi trovare maggiori concorrenti le report Domini Concorrenti su Site Explorer. Inserisci uno dei tuoi concorrenti conosciuti, e ti suggerirà altri siti simili basandosi dal numero di parole chiave sovrapponibili per le quali sono posizionati su Google.Report di Domini Concorrenti su Site Explorer di Ahrefs.Puoi ripetere il processo qui sopra un numero illimitato di volte per avere un elenco quasi infinito di idee di parole chiave.Vedi molti argomenti che hai già trattato?Se stai facendo una ricerca parole chiave per un sito web consolidato nel tuo settore, potresti scoprire di aver già trattato molte delle parole chiave dei tuoi concorrenti. In questo caso, puoi provare ad usare il nostro strumento Content Gap. Trova parole chiave per le quali uno o più concorrenti sono posizionati, ma non tu. Per usarlo, inserisci alcuni domini concorrenti nella sezione in alto, poi incolla il tuo sito nella parte bassa e fai click su “Mostra parole chiave”.Inserimento siti concorrenti nello strumento Content Gap di Ahrefs.Ottieni un elenco di parole chiave per le quali i concorrenti si posizionano, ma non il tuo sito, nello strumento Content Gap di Ahrefs.Ecco solo alcune parole chiave delle migliaia di parole chiave per le quali Homegrounds e Roasty Coffee si posizionano, ma non yourcoffeestore.com:mokamacinacaffé manualeoli cafféespressoImpara di più su come fare una analisi di gap di contenuti in questo video.3. Utilizzare strumenti di ricerca parole chiaveI concorrenti possono essere una grande fonte di idee per le parole chiave. Ma c’è comunque un gruppo enorme di parole chiave che i tuoi concorrenti non hanno come obiettivo, e li puoi trovare utilizzando gli strumenti di ricerca parole chiave.Gli strumenti di ricerca parole chiave funzionano tutti allo stesso modo. Scrivi una parola chiave seme, e loro generano idee di parole chiave basate su quella parola.Keyword Planner di Google è probabilmente lo strumento per le parole chiave più conosciuto. E’ gratuito, e anche se è dedicato ai pubblicitari, lo puoi usare anche per trovare parole chiave per la SEO.Proviamo ad inserire qualcuna delle nostre parole chiave seme e vediamo cosa ci restituisce:baristamacchiatoirish coffeeamericanoflat whiteinfusione a freddocaffettiera a filtrocaffé turcoarabicacialdefrappuccinoPotrai notare che Keyword Planner di Google è abbastanza intelligente da mostrati le idee di parole chiave rilevanti, anche se non contengono le tue parole chiave seme. Prendi “cialde”, ad esempio. Se non sei un appassionato di caffé, forse non sapresti che sono associate al caffé.Nota a margine.La metrica “Competizione” che vedi nel Keyword Planner di Google non ha niente a che fare con la SEO. Mostra quanti pubblicitari sono disposti a pagare per mostrare le pubblicità nei risultati di ricerca per quella parola chiave. Non dovresti prestarci attenzione se vuoi posizionarti organicamente.Oltre al Keyword Planner, ci sono molti altri strumenti gratuiti di terze parti. Questi sono ottimi se hai poco da investire, ma capirai subito che sono molto limitati con i loro dati e funzionalità perché il loro obiettivo è farti convertire in un utente pagante.Se hai serie intenzioni nella ricerca di parole chiave, dovresti anche saltare la fase gratuita ed usare uno strumento ‘professionale’ come Keywords Explorer di Ahrefs fin dall’inizio.Inseriamo alcune delle nostre parole chiave seme e vediamo quante idee può generare.Il report ‘Corrispondenza frase’ in Keywords Explorer ti fornisce quasi 4 milioni di idee di parole chiave da sole 4 parole chiave seme.3,7 milioni di idee. E solo dal report “Corrispondenza frase”. Gli altri report di idee parole chiave trovano le idee di parole chiave in modi diversi.Ecco come i report in Keywords Explorer fanno corrispondere le idee di parole chiave:Corrispondenza frase: Idee di parole chiave che contengono la parola chiave ‘seme’ così com’è. Per esempio, se la tua parola chiave seme è “sedia computer”, allora “sedia computer nera” sarà una corrispondenza, ma “sedia nera per computer” non lo sarà, anche se contiene entrambe le parole.Con gli stessi termini: Idee di parole chiave che contengono tutti i termini individualmente dalla parola chiave ‘seme’ in ogni ordine. Per esempio, se la tua parola chiave seme è “sedia computer”, allora “sedia nera per computer” apparirà in questo report.Domande: Idee di parole chiave che contengono ogni termine dalla parola chiave ‘seme’ in ogni ordine, in più una “parola interrogativa” ad esempio “come”, “quale”, “dove”, “quando” o “perché”. Per esempio, se la tua parola chiave ‘seme’ è “sedia computer”, allora “qual’è la miglior sedia per computer da lavoro” dovrebbe apparire qui.Ora, questo sembra un numero insormontabile di idee, ed è vero. Ma non preoccuparti. Imparerai a selezionarle direttamente nello strumento nella prossima sezione.Nota a margine.Keywords Explorer ha milioni di parole chiave anche da altri motori di ricerca. Bing, YouTube, Amazon, e Baidu sono solo alcuni di essi.4. Studiare la tua nicchiaTutto ciò che abbiamo discusso finora è abbastanza per generare un quasi illimitato numero di idee di parole chiave. Ma allo stesso tempo, il processo ti mantiene “dentro la scatola”. E’ limitato dalle tue parole chiave seme e dalla dimensione e freschezza del database dello strumento di parole chiave che hai scelto. Per questo, ti starai sicuramente perdendo delle buone idee.Puoi risolvere questo problema studiando la tua nicchia con maggior dettaglio, ed un buon punto di partenza è la navigazione su forum di settore, gruppi, e siti di domande e risposte. Ti aiuterà a trovare maggiori informazioni sulle necessità dei tuoi potenziali clienti che non sono mostrate negli strumenti per parole chiave e nessun tuo concorrente si preoccupa di trattare.Per esempio, ecco una discussione popolare dal subreddit /r/coffee:Questa persona sta facendo una domanda su una macchina del caffé chiamata Aeropress. Se inseriamo l’argomento su Keywords Explorer, vediamo che crea 61.000 ricerche mensili negli Stati Uniti, in media.Potremo non averlo trovato usando gli strumenti perché non include alcuna nostra parola chiave seme.Ecco alcuni altri argomenti interessanti da quel subreddit che potrebbe valer la pena trattare:versare senza un filtro hariocome fare un carajillocoltivare il caffé a casacaffé etiopeiscrizioni cafféSe noti alcune tendenze tra queste idee di parole chiave, le puoi usare come nuove parole chiave seme su Keywords Explorer per trovare maggiori idee. Per esempio, se usiamo “aeropress” some parola chiave seme e controlliamo il report “Corrispondenza frase”, vediamo migliaia di idee di parole chiave.Migliaia di idee di parole chiave nel report “Corrispondenza frase” in Keywords Explorer di Ahrefs.Oltre alla navigazione nei forum, i tuoi clienti possono essere anche una fonte fantastica di idee di parole chiave. Ricorda, queste sono le persone con le quali hai già un rapporto di lavoro. Dovrai attirare più persone come loro nel tuo sito.Ecco alcuni modi per ottenere informazioni dai clienti:Parla faccia a faccia con loroGuarda nelle email scambiateGuarda nelle richieste all’assistenza clientiProva a ricordare domande frequenti che sono state fatte in conversazioni passateRicordati di fare attenzione al linguaggio che loro usano quando parlano. Spesso è diverso da quello che usi tu. Per esempio, se vendi online macchine del caffé, forse i tuoi clienti cercano confronti di macchine specifiche.6 tool gratis per la ricerca delle parole chiave (da fare impallidire Google Keyword Planner)Google Keyword Planner: guida pratica all’utilizzoI 6 Migliori Strumenti Di Ricerca Parole Chiave per la SEO4 Metodi per Trovare Idee Potenziali per Parole Chiave6 Suggerimenti Ricerca Parole ChiavePart 3Come analizzare le parole chiaveAvere una grande lista di idee per parole chiave è un bene. Ma come puoi sapere quali sono le migliori? Dopotutto, analizzarle tutte manualmente sarebbe un compito quasi impossibile.La soluzione è semplice: usa le metriche SEO per ridurre l’elenco e separare il grano dall’oglio prima di aggiungerle al tuo calendario di contenuti.Esploriamo le 6 metriche per le parole chiave che puoi usare in questo caso.Volume di ricercaClickTraffico potentialeKeyword DifficultyCost Per Click (CPC)Volume di ricercaIl volume di ricerca ti dice il numero medio di volte che una parola chiave viene cercata al mese. Per esempio, “moka” ha un volume di ricerca mensile di 40.000 solo negli Stati Uniti.Ci sono 3 cose importanti da considerare su questo numero:E’ il numero di ricerche, non il numero di persone che hanno fatto la ricerca. Ci sono casi dove qualcuno potrebbe cercare una parola chiave, come “meteo a singapore” più volte al mese. Queste ricerche contribuiscono al volume di ricerca, anche se è sempre la stessa persona a compierle.Non ti dice quanto traffico avrai dal posizionamento. Anche se riesci a posizionarti al primo posto, il tuo traffico per una parola chiave raramente supera il 30% di quel numero. E questo se sei fortunato.E’ una media annuale. ISe ci sono 120.000 ricerche per una parola chiave in Dicembre e nessuna nei rimanenti 11 mesi dell’anno, il suo volume di ricerca mensile sarà 10.000 (120.000 / 12 mesi).Su Keywords Explorer, potrai vedere un filtro del volume di ricerca in ogni report di idee di parole chiave.Questo filtro è utile soprattutto per 2 ragioni:Togliere le parole chiave con volume elevato. Se il tuo sito è nuovo, allora probabilmente non dovresti ordinare pagine di parole chiave con oltre 100.000 ricerche mensili perché probabilmente saranno competitive.Filtrare appositamente parole chiave a basso volume. Forse vorrai trovare parole chiave non competitive e a basso volume dove puoi facilmente avere traffico aggiuntivo con articoli corti. Sono conosciute come parole chiave a coda lunga.Lo sapevi che la maggior parte delle parole chiave sono parole chiave a coda lunga?Le parole chiave a coda lunga sono termini con volumi di ricerca bassi. Il loro nome è dovuto da dove sono posizionate nella cosiddetta “curva della domanda di ricerca”:Come puoi vedere, all’inizio della curva, abbiamo un numero molto piccolo di query di ricerca incredibilmente popolari, come:youtube — 181Mfacebook — 168Mmeteo — 52Mgoogle translate — 42mcraigslist — 30mGli esperti SEO le chiamano parole chiave “fat-head”.E la coda lunga di quella curva consiste in centinaia di milioni di parole chiave con volumi di ricerca molto bassi. Gli esempi includono:migliori font per un curriculum — 150i 4 pilastri del cuore di un uomo — 150definizione di deuteronomio — 100significato militare 5 per 5 — 100quanto vale il mio account overwatch — 50torta degli angeli senza teglia — 50biglietti di natale divertenti per single — 50Se vuoi saperne di più sull’uso di tipi diversi di parole chiave a coda lunga, guarda la nostra guida completa.Se hai bisogno di vedere i volumi di ricerca per altri paesi rispetto agli Stati Uniti, puoi scegliere su Keywords Explorer tra altri 171 paesi. Puoi anche vedere i volumi di ricerca globali (la somma dei volumi di ricerca da tutti i paesi). Entrambe queste opzioni sono utili se fai attività a livello internazionale per 2 motivi:Non dovresti limitarti ad un solo paese. Se vendi prodotti in tutto il mondo, allora solo gli Stati Uniti potrebbero essere un piccolo segmento di mercato. Se le persone stanno cercando ciò che cerchi altrove, lo dovresti sapere.Dovresti considerate il “potere d’acquisto” dei paesi con il volume di ricerca. Forse puoi vedere una parola chiave promettente con 100.000 ricerche mensili, ma il 90% di loro vengono da un paese con un basso PIL. In questo caso, la parola chiave potrebbe non essere un ottimo obiettivo perché il “potere d’acquisto” degli acquirenti è probabilmente molto basso.Per esempio, guarda questa parola chiave “generatore di backlink”. Ha un volume di ricerca globale di 13.000 ma oltre il 70% delle ricerche proviene da alcuni paesi con un PIL pro capite basso come India, Indonesia, Bangladesh, e Pakistan. Quindi anche se potresti probabilmente avere molto traffico se ti posizioni per questa parola chiave, il ‘valore di business’ di questo traffico sarà probabilmente basso rispetto ad una parola chiave che ha oltre il 70% degli utenti di ricerca dagli Stati Uniti.Un’altra cosa importante da ricordare sui volumi di ricerca è che variano da strumento a strumento. Questo perché ogni strumento calcola e aggiorna questa metrica in modo diverso. Puoi leggere di più sulle complessità delle stime dei volumi di ricerca e sul perché anche i dati di Google non sono davvero “accurati” qui e qui.Conoscere le tendenze delle parole chiaveDato che i volumi di ricerca sono una media annuale, è spesso utile controllare i grafici di tendenza su Keywords Explorer per le parole chiave che stai considerando. Se le parole chiave sono stagionali o stanno crescendo o calando in popolarità, il volume di ricerca potrebbe non essere il miglior indicatore del traffico mese su mese.Le ricerche legate al natale sono un buon esempio. Crescono tutte in dicembre prima di tornare a zero in febbraio, ma il volume di ricerca non riflette questo andamento.Leggi la nostra guida di Google Trends per maggiori consigli pratici sulla ricerca di parole chiave stagionali. ClickMolte persone potrebbero cercare qualcosa su Google, ma ciò non significa che tutti faranno click nei risultati di ricerca e visiteranno le pagine prime in classifica. Ecco dove viene comoda la metrica Click su Keywords Explorer. Ti dice il numero medio di click mensili nei risultati di ricerca per una parola chiave.Guarda ad una query come “quanta caffeina nel caffé”.Volume di ricerca mensile e click per “quanta caffeina nel caffé”, da Keywords Explorer di Ahrefs.Anche se ha un volume di ricerca mensile di 48.000, riceve solo 8.600 click.Questo succede perché Google risponde alle domande direttamente nei risultati di ricerca. Non c’è bisogno per le persone di fare click per trovare le informazioni che stanno cercando.Google sta fornendo risposte nei risultati di ricerca per sempre più query. Ecco perché il filtro click su Keywords Explorer è così prezioso. Lo puoi usare per togliere le idee di parole chiave con bassissimo potenziale di traffico di ricerca.Filtrare per click su Keywords Explorer di Ahrefs.Dovresti anche essere attento alle parole chiave dove le pubblicità a pagamento “rubano” molti click. Per esempio, il 32% dei click per “macchina del caffé braun” va alle pubblicità a pagamento, quindi quella parola chiave potrebbe essere un obiettivo migliore per la PPC.Il 32% di tutti i click di “macchina caffé braun” vanno alle pubblicità a pagamento. Dati da Keywords Explorer di AhrefsTraffico potenzialeIpotizziamo che tu stia considerando una parola chiave come “effetti collaterali del caffé”. Secondo Keywords Explorer, ha delle ricerche mensili stimate in 1.000 e ~800 click mensili.I volumi degli Stati Uniti e globali per “effetti collaterali del caffé”. Dati da Keywords Explorer di Ahrefs.Tuttavia, tieni a mente che se ti posizioni per questa parola chiave, la tua pagina si posizionerà anche per ogni tipo di parola chiave correlata e i sinonimi, come:cosa succede se bevi troppi caffé — 450 ricerche mensilieffetti del bere troppo caffé — 200 ricerche mensilitroppi caffé effetti collaterali — 200 ricerche mensilieffetti collaterali del bere troppo caffé — 100 ricerche mensiliSiccome tutte queste query di ricerca vogliono dire la stessa cosa, stimare il traffico di ricerca potenziale da una singola query di ricerca è un errore. E’ meglio vedere quanto traffico hanno ora le pagine in cima alla classifica, ed è facilissimo farlo con Keywords Explorer.Ecco, vediamo che le pagine posizionate in cima per “effetti collaterali del caffé” hanno ~3,500 visite al mese e si posizionano per oltre 930 parole chiave:Traffico organico di ricerca negli Stati Uniti per le pagine posizionate in cima per “effetti collaterali caffé”. Dati da Keywords Explorer di Ahrefs.Posizionarsi per più di una parola chiave è abbastanza normale. Abbiamo studiato 3 milioni di query di ricerca e scoperto che mediamente le pagine in cima alla classifica sono posizionate tra le prime 10 per quasi altre 1.000 parole chiave.La morale della storia? Non giudicare le parole chiave solo dal loro Volume di ricerca (o dai click). Guarda ai risultati primi in classifica per stimare il totale del potenziale traffico di ricerca dell’argomento. In molti casi, il volume di ricerca di una parola chiave sarà correlato con il ‘traffico potenziale’ totale dell’argomento. Tuttavia, diventare attento a questi dettagli ti aiuterà a creare priorità tra le tue parole chiave e a trovare opportunità di parole chiave che i tuoi concorrenti hanno ignorato.Keyword DifficultyI professionisti SEO misurano tipicamente la difficoltà di posizionamento di una parola chiave manualmente. E lo fanno guardando le pagine in cima alla classifica per la loro parola chiave obiettivo. Tengono in considerazione molti fattori differenti per giudicare quanto difficile o facile sarà posizionarsi:Numero (e qualità) dei backlink;Domain Rating (DR);Lunghezza del contenuto, rilevanza, freschezza;Uso della parola chiave obiettivo, sinonimi, entità;Intento di ricerca;Termini brand;ecc.Questo processo varia da persona a persona, perché non c’è consenso su cosa sia o non sia importante. Una persona potrebbe pensare che il DR è importante, ed un’altra potrebbe pensare che la rilevanza giochi un ruolo maggiore. Questa assenza di consenso rende la vita un po’ difficile per chi crea gli strumenti di ricerca parole chiave, perché ognuno di essi prova a distillare la difficoltà di posizionamento delle parole chiave in un unico sistema a punteggio.Dopo aver parlato con molti professionisti della SEO riguardo i segnali che un punteggio Keyword Difficulty affidabile dovrebbe tenere in considerazione, abbiamo capito che ognuno di essi è d’accordo su almeno una cosa: i backlink sono cruciali per il posizionamento. Quindi, alla fine, abbiamo deciso di basare il nostro punteggio Keyword Difficulty (KD) sul numero di siti web unici che hanno link alle prime 10 pagine posizionate.Come puoi vedere dall’immagine sopra, ogni punteggio KD è relativo ad un numero approssimativo di siti web che dovrebbero avere link alla tua pagina per portarla tra i primi 10 risultati di ricerca.Nota a margine.Per favore, non dimenticare che nella spiegazione qui sopra ci riferiamo ai “primi 10”. Il punteggio KD di Ahrefs non ti dice cosa serve per posizionarsi al #1 per una parola chiave data. Ti indica semplicemente cosa ci vorrebbe per entrare tra i primi 10.Conoscendo come funziona KD, molte persone lo usano male impostando il filtro tra 0 e 30 e si focalizzano solo nelle opportunità “a portata di mano”. Non si preoccupano mai di coprire le parole chiave con alti KD nei loro siti web, ed è un grande errore per 2 ragioni:Dovresti affrontare le parole chiave con alto KD prima, non dopo. Siccome avrai bisogno di molti backlink per posizionarti, è vantaggioso creare la tua pagina e iniziare a promuoverla prima possibile. Più aspetti, maggiore è il vantaggio che offri ai tuoi concorrenti—rendendo più difficile il loro sorpasso in classifica in futuro.Dovresti vedere le parole chiave con alto KD come opportunità di link. Il fatto che le pagine in cima alla classifica hanno molti backlink è un segno di argomento “da link”. In altre parole, se affronti l’argomento, potresti attirare su di te molti backlink.La morale è questa: KD non esiste per farti evitare di prendere di mira specifiche parole chiave. Esiste per farti capire cosa ci vorrà per posizionarti per una query data e la capacità ‘attira-link’ dell’argomento.Ricordati solo che dovresti sempre valutare manualmente le parole chiave prima di approcciarle e non basarti solamente nel punteggio di difficoltà delle parole chiave di qualsiasi strumento prima di prendere la decisione finale. Nessun punteggio di difficoltà della parola chiave può racchiudere la complessità dell’algoritmo di posizionamento di Google in un solo numero. Non fidarti dei creatori di strumenti che suggeriscono diversamente.Se vuoi saperne di più su Keyword Difficulty, controlla la nostra guida al Keyword Difficulty.Cost Per Click (CPC)Il Cost Per Click (CPC) mostra quanto i pubblicitari sono disposti a spendere per click promozionali per una parola chiave. E’ una metrica soprattutto per i pubblicitari che per i tecnici SEO, ma può servire come un utile raffronto sul valore di una parola chiave.Monday.com paga per i click dalla parola chiave “project management software”. Costa a loro dei soldi ogni volta che c’è un click all’annuncio.Per esempio, la parola chiave “caffé da ufficio” ha un CPC relativamente alti di $12. Questo perché molti utenti di ricerca stanno cercando di acquistare macchine da caffé per i loro uffici, che possono costare centinaia o migliaia di dollari. Ma è l’esatto opposto per “come fare un buon espresso”. Questo perché molti utenti di ricerca non stanno cercando di comprare alcunché. Stanno cercando informazioni su come fare un buon espresso.CPC stimati per “caffé da ufficio” e “come fare un buon espresso” su Keywords Explorer di Ahrefs.Tuttavia, una cosa importante da sapere sul CPC è che è molto più volatile rispetto al Volume di ricerca. Mentre la domanda di ricerca per molte parole chiave rimane quasi la stessa da mese a mese, il suo CPC può cambiare ogni minuto. Questo significa che il valore CPC che vedi in uno strumento di parole chiave di terze parti sono fotografie nel tempo. Se vuoi dati in tempo reale, dovrai usare AdWords.Volume di Ricerca Parole Chiave: Cose Che Non Sapevi Di Non SaperePerché Non Puoi Fidarti Ciecamente sul Volume di Ricerca per le Stime di TrafficoCome cercare le parole chiave con Google Trends: 7 metodi efficaciPer Quante Parole Chiave Puoi Posizionarti? [Studio]Keyword Difficulty: Come Determinare le Tue Possibilità di Posizionarti su GoogleCosa Sono le Parole Chiave a Coda Lunga? Come Trovarle ed UsarlePart 4Come mirare le parole chiavePer ogni parola chiave nel tuo elenco, devi creare la giusta tipologia di pagina e contenuto per occupartene. Capire come farlo è un passo cruciale nel processo di ricerca parole chiave. Fortunatamente, lo puoi fare con 2 semplici passi.Identificare l’Argomento PrincipaleIdentificare l’intento di ricerca1. Identificare l’Argomento PrincipaleIpotizziamo che tu abbia queste parole chiave nel tuo elenco:come fare il caffédalgonache cos’è il caffédalgonaricetta caffédalgonacome fare il caffédalgona senza istantaneocaffé dalgona senza zuccheroPotresti pensare, dovrei fare una pagina diversa per ogni parola chiave o mirarle tutte in una pagina singola?La risposta dipende principalmente da come Google vede queste parole chiave. Le vede come parte dello stesso argomento (es., come fare caffé dalgona)? O le vede tutte come argomenti individuali? Puoi capirlo guardando i risultati di Google.Per esempio, vediamo alcune delle stesse pagine posizionarsi per “come fare caffé dalgona” e “che cos’è caffédalgona”.Questo sembra indicare che Google vede entrambe queste parole chiave come parte dello stesso argomento.Vediamo anche che molti dei risultati per entrambe le ricerche sono articoli sul fare un caffédalgona. Questo ci dice che “cos’è il caffédalgona” è un sottoargomento dell’argomento più vasto “come fare il caffédalgona”.Per questa ragione, avrebbe probabilmente più senso mirare ad entrambe queste parole chiave in una pagina singola che creare 2 pagine separate.Tuttavia, se vediamo i risultati per “caffédalgona senza zucchero”, vediamo l’opposto:Quasi tutti i risultati sono specifici nel creare un caffé dalgona salutare e senza zucchero, non solo un caffédalgona tradizionale. Questo ci dice che “caffé dalgona senza zucchero” non fa parte di un argomento più vasto nel fare il caffédalgona (anche se un caffé dalgona senza zucchero è, di fatto, sempre un caffédalgona). Quindi dovremo probabilmente scrivere un articolo separato per posizionarci per questa parola chiave.Il problema con questo approccio è che rimane molto lento e manuale, quindi se hai molte parole chiave da analizzare, potrebbe prenderti del tempo.Su Keywords Explorer, la nostra soluzione al problema è mostrarti l’”Argomento Principale” per ogni parola chiave. Ti dice se pensiamo che tu possa posizionarti per la parola chiave obiettivo mentre invece prendi come obiettivo un argomento più vasto.Per identificare l’”Argomento Principale”, prendiamo la pagina prima in classifica per ogni parola chiave e troviamo la parola chiave che invia i maggiori click alla pagina.Mettiamo le nostre parole chiave di prima su Keywords Explorer e controlliamo i loro “Argomenti Principali”.Argomenti Principali per le nostre parole chiave su Keywords Explorer di Ahrefs.Ciò che vediamo qui riflette quello che abbiamo visto nei risultati di ricerca. Molte delle nostre parole chiave cadono nello stesso argomento generale. L’eccezione è “caffédalgona senza zucchero”, che quindi dovrebbe avere una pagina a sé.Tuttavia, la nostra funzionalità Argomento Principale non è perfetta. Non ti può dare sempre un consiglio diretto su come raggruppare al meglio le tue parole chiave per pagina (nella SEO, questa pratica è conosciuta anche come “keyword clustering”) perché i risultati di ricerca di Google sono volatili.Per esempio, quando controllo l’Argomento Principale per le stesse parole chiave come sopra subito dopo pubblicare questa guida, ottengo risultati diversi:Dovresti provare ad usare il report “Quota traffico > Per pagine” su Keywords Explorer in questi casi. E’ un modo facile per vedere se e dove le stesse pagine si posizionano per il tuo gruppo di parole chiave.2. Identificare l’intento di ricercaIpotizziamo che tu abbia queste parole chiave nel tuo elenco:macinacaffélatte o cappuccinomacchina del caffé tazza singolacaffé arabicacome preparare il caffé freddomacinacaffé manualeSe gestisci un negozio online con un blog, devi capire quali avere come obiettivo tra articoli di blog o pagine di prodotto.Per alcune parole chiave, questo è ovvio. Non dovrai creare una pagina prodotto per “come preparare un caffé freddo” perché non ha senso. Gli utenti di ricerca vogliono sapere come fare un caffé freddo, non comprare degli accessori per la preparazione.Ma per una parola chiave come “macinacaffé manuale”? Dovresti mirarla con un articolo blog sui migliori macinacaffé o una pagina di categoria dell’ecommerce che mostri tutti i macinacaffé manuali che vendi?Esempio di una pagina di categoria ecommerce.Ammesso che il tuo obiettivo è probabilmente vendere più macinacaffé, il tuo istinto è quello di creare una pagina di categoria con tutti i macinacaffé che hai in vendita. Questa sarebbe una mossa sbagliata perché questo tipo di contenuto non è allineato con quello che l’utente di ricerca vuole vedere—conosciuto anche come intento di ricerca.Come facciamo a saperlo? Se guardi alle pagine in cima alla classifica per questa parola chiave su Google, sono tutti articoli di blog sui migliori macinacaffé manuali.Google capisce l’intento meglio di chiunque altro, quindi i primi risultati per una parola chiave sono spesso una buona indicazione per l’intento di ricerca. Se vuoi avere la migliore possibilità di posizionamento, dovresti creare lo stesso tipo di contenuto che vedi già posizionato nella prima pagina.Puoi vedere i migliori risultati per il tuo paese nel Keywords Explorer. Fai click nell’accento “SERP”.Anteprima SERP per “macinacaffé” su Keywords Explorer di Ahrefs.Da qui, puoi analizzare ciò che ci piace chiamare le 3 fondamenta dell’intento di ricerca per imparare come mirare al meglio la parola chiave:Tipo di contenutoFormato del contenutoAngolo del contenuto1. Tipo di contenutoI tipi di contenuto di solito possono essere raggruppati in 5 gruppi: articoli blog, prodotto, categoria, pagine di atterraggio, o video.2. Formato del contenutoIl formato del contenuto si applica soprattutto nel contenuto ‘informativo’. Gli esempi tipici sono le guide come-fare-per, articoli elenco, articoli di attualità, articoli di opinione, e recensioni.3. Angolo del contenutoL’angolo del contenuto è il punto di vendita principale del contenuto. Per esempio, le persone che cercano “come fare la schiuma” sembra che vogliono sapere come farla senza un accessorio o alcuna attrezzatura dedicata.Ricordati solo che mentre è importante allineare il tuo contenuto con l’aspettativa dell’utente di ricerca, non devi necessariamente seguire il gregge e mantenere gli utenti di ricerca dentro la bolla di ciò che si aspettano. Se hai la confidenza che puoi avere l’attenzione di chi cerca con un tipo diverso di contenuto, formato, o angolo, dagli una possibilità.Part 5Come dare priorità alle parole chiaveLa priorità alle parole chiave non è esattamente l’ultimo passo del processo di ricerca parole chiave. E’ più che altro qualcosa che dovresti fare mentre svolgi i passaggi sopra descritti. Mentre stai cercando parole chiave, analizzando le loro metriche, e raggruppandole, chiediti:Qual è il traffico potenziale di questa parola chiave?Quanto dura è la competizione? Quanto lavoro serve per posizionarsi?Hai già contenuti su questo argomento? Se no, cosa serve per creare e promuovere una pagina competitiva?Sei già posizionato per questa parola chiave? Potresti aumentare il traffico aumentando il tuo posizionamento di alcuni posti?Il traffico si convertirà facilmente in contatti e vendite, o porterà solo conoscenza del brand?L’ultimo punto è particolarmente importante. Mentre il volume di ricerca, il potenziale di traffico, difficoltà, e l’intento di ricerca sono tutte considerazioni importanti, devi anche considerare se il traffico di quella parola chiave è valido per la tua attività.Come valutare il “potenziale di business” delle tue idee di parole chiaveMolti marketer di contenuti e SEO giudicano il ‘valore’ delle parole chiave collocandole nella mappa del viaggio del cliente. E’ il processo che le persone affrontano prima di fare un acquisto. Il buon senso dice che più le persone sono all’inizio del loro viaggio, meno sono pronte a comprare.Come si fa? Il metodo più conosciuto è raggruppare le idee di parole chiave in 3 gruppi:TOFU, MOFU, e BOFU.Ecco alcuni esempi di parole chiave TOFU, MOFU e BOFU per Ahrefs:Inizio del Funnel (Top of the Funnel — TOFU): marketing online, cos’è la SEO, come aumentare il traffico del sito web.Centro del Funnel (Middle of the Funnel — MOFU): come fare ricerca parole chiave, come ottenere link, come analizzare un sito web.Fine del Funnel (Bottom of the Funnel — BOFU): ahrefs vs moz, recensioni ahrefs, sconto ahrefs.In generale, le parole chiave TOFU hanno il maggior traffico potenziale, ma i visitatori non stanno ancora provando ad acquistare. E le parole chiave MOFU e BOFU ti porteranno meno traffico, ma le persone sono più propense a diventare tue clienti.Ad Ahrefs, pensiamo che questo concetto sia limitante e forse anche ingannevole.Lo spieghiamo con 3 ragioni:Primo, non tiene in considerazione che puoi prendere qualcuno dall’inizio del funnel che sta cercando qualcosa di generico come “marketing online” e accompagnarlo su tutti i passaggi del viaggio del cliente in una pagina. Questo è ciò per cui i copywriter a risposta diretta sono famosi. Non creano le loro pubblicità basate sul TOFU/MOFU/BOFU. Creano una pubblicità che prende il lettore da una comprensione approssimativa del problema al comprare la tua soluzione.Secondo, è abbastanza difficile assegnare ad ogni parola chiave una etichetta TOFU, MOFU o BOFU perché le cose non sono sempre così chiare. Per esempio, “strumento di link building” potrebbe essere per noi una parola chiave MOFU o BOFU. Dipende da come la guardi.Third, alcuni marketer espandono la loro definizione di TOFU in un livello così ampio che finiscono con il toccare alcuni argomenti non correlati. Un caso di questo esempio, Hubspot:Report delle Pagine Migliori del blog HubSpot da Site Explorer di Ahrefs.Premesso che loro vendono software di marketing, come pensi che possano convertire le persone che arrivano ai loro articoli per:citazioni famosecaselle email gratuitelettere di dimissionimigliori siti web di designPer risolvere questo problema, abbiamo creato un “punteggio business” più semplice e maggiormente obiettivo per determinare il valore di una parola chiave. Ed è basato principalmente in quanto facilmente possiamo inserire il nostro prodotto nel nostro contenuto.Ecco i criteri di punteggio che usiamo per gli argomenti del blog:PunteggioCosa significaEsempio3Il nostro prodotto è una soluzione insostituibile per risolvere il problema.“come posizionarsi più in alto su google” — perché è difficile farlo senza un set di strumenti come Ahrefs.2Il nostro prodotto aiuta abbastanza, ma non è essenziale a risolvere il problema.“suggerimenti SEO” — perché alcuni suggerimenti non sono possibili senza il nostro prodotto, mentre altri lo sono.1Il nostro prodotto può essere citato solo brevemente.“idee marketing” — perché la SEO è una delle molteplici idee di marketing, e Ahrefs ti aiuta ad 0Non c’è assolutamente alcun modo per citare il nostro prodotto.“social media marketing” — perché non è un argomento dove Ahrefs può aiutarti.Accostando questo punteggio con il potenziale traffico di ricerca stimato di un argomento, possiamo avere una ottima idea degli argomenti con maggior valore per la nostra attività. Noterai che raramente abbiamo degli articoli nel nostro blog con un valore per il business pari a zero e dove non c’è alcuna menzione del nostro prodotto.Per concludere, quando affronti questo processo, ricordati che non stai cercando solamente parole chiave “facili da posizionare”. Stai cercando quelle con il più alto ritorno sull’investimento.Focalizzarsi solo sulle parole chiave a bassa difficoltà è un errore che fanno molti proprietari di siti web. Dovresti sempre avere obiettivi di posizionamento a breve, medio e lungo termine. Se ti focalizzi solo negli obiettivi a breve termine, non ti posizionerai mai per le parole chiave più remunerative. Se ti focalizzi solo sugli obiettivi a medio e lungo termine, ci vorranno anni per avere del traffico.Pensa in questo modo: raccogliere i frutti in basso è facile, ma quelli sopra l’albero sono spesso i più succosi. Significa che non vale la pena raccogliere quelli in basso? No. Li dovresti comunque raccogliere. Ma dovresti anche pianificare in tempo e comprare ora una scala per quelli in cima.Part 6Strumenti di ricerca parole chiavePrima di riassumere tutto, guardiamo alcuni strumenti di ricerca parole chiave famosi che ti aiuteranno a fare tutto ciò di cui abbiamo discusso sopra.Google Keyword Planner (Gratis)Per i suggerimenti esclusivi di parole chiave e valori aggiornati CPC.Google Trends (Gratis)Per confronto tra tendenze e ricerca della geografia delle tendenze.Google Search Console (Gratis)Per controllare le prime 1.000 parole chiave per le quali sei già posizionato e quanto traffico di portano queste parole chiave.Ahrefs Webmaster Tools (Gratis)Per controllare tutte le parole chiave per le quali ora sei posizionato, assieme al loro volume di ricerca stimato, i punteggi Keyword Difficulty, traffico potenziale, ed altre metriche SEO utili.Keyword Generator (Gratis)Per generare centinaia di idee di parole chiave gratuitamente da una parola chiave seme.Keyword Difficulty Checker (Gratis)Per controllare la difficoltà di posizionamento di una parola chiave, ovvero il punteggio Keyword Difficulty (KD) per Ahrefs.Keyword Rank Checker (Gratis)Per controllare dove sei posizionato per una parola chiave in ogni paese.Keywords ExplorerPer quando hai delle idee chiare sul trovare le migliori parole chiave per il tuo sito web. Trova decine di migliaia di idee di parole chiave in un attimo, filtra i report di idee parole chiave per le parole che interessano a te, e valuta facilmente il loro potenziale di traffico e difficoltà di posizionamento.6 tool gratis per la ricerca delle parole chiave (da fare impallidire Google Keyword Planner)I 6 Migliori Strumenti di Ricerca Parole Chiave per la SEOGoogle Keyword Planner: guida pratica all’utilizzoTiriamo le conclusioniTutto ciò che abbiamo detto sopra dovrebbe essere abbastanza per capire i concetti base della ricerca parole chiave e per pianificare la tua strategia di contenuti.Se vuoi saperne di più e approfondire la ricerca di parole chiave, controlla i nostri link sparpagliati nella guida per leggere di più. Ti daranno una conoscenza maggiore delle metriche e degli strumenti disponibili e le istruzioni per usarli.Potresti anche vedere questo video, dove affrontiamo l’intero processo dall’inizio alla fine.https://www.youtube.com/watch?v=w4Qmgp03ypMAbbiamo dimenticato qualcosa? Fammelo sapere su Twitter.Tradotto da Mauro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Collaboratori Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Collaboratori",
  "headers": [
    {
      "level": "H1",
      "text": "Come Ricercare Parole Chiave Per La SEO"
    },
    {
      "level": "H2",
      "text": "Basi di ricerca parole chiave"
    },
    {
      "level": "H3",
      "text": "Che cos’è la ricerca di parole chiave?"
    },
    {
      "level": "H3",
      "text": "Perché è importante la ricerca di parole chiave?"
    },
    {
      "level": "H2",
      "text": "Come trovare idee per parole chiave"
    },
    {
      "level": "H3",
      "text": "1. Brainstorm sulle parole chiave ‘seme’"
    },
    {
      "level": "H3",
      "text": "2. Trovare le parole chiave con le quali si posizionano i tuoi concorrenti"
    },
    {
      "level": "H3",
      "text": "3. Utilizzare strumenti di ricerca parole chiave"
    },
    {
      "level": "H3",
      "text": "4. Studiare la tua nicchia"
    },
    {
      "level": "H2",
      "text": "Come analizzare le parole chiave"
    },
    {
      "level": "H3",
      "text": "Volume di ricerca"
    },
    {
      "level": "H3",
      "text": "Click"
    },
    {
      "level": "H3",
      "text": "Traffico potenziale"
    },
    {
      "level": "H3",
      "text": "Keyword Difficulty"
    },
    {
      "level": "H3",
      "text": "Cost Per Click (CPC)"
    },
    {
      "level": "H2",
      "text": "Come mirare le parole chiave"
    },
    {
      "level": "H3",
      "text": "1. Identificare l’Argomento Principale"
    },
    {
      "level": "H3",
      "text": "2. Identificare l’intento di ricerca"
    },
    {
      "level": "H3",
      "text": "1. Tipo di contenuto"
    },
    {
      "level": "H3",
      "text": "2. Formato del contenuto"
    },
    {
      "level": "H3",
      "text": "3. Angolo del contenuto"
    },
    {
      "level": "H2",
      "text": "Come dare priorità alle parole chiave"
    },
    {
      "level": "H3",
      "text": "Come valutare il “potenziale di business” delle tue idee di parole chiave"
    },
    {
      "level": "H2",
      "text": "Strumenti di ricerca parole chiave"
    },
    {
      "level": "H3",
      "text": "Google Keyword Planner (Gratis)"
    },
    {
      "level": "H3",
      "text": "Google Trends (Gratis)"
    },
    {
      "level": "H3",
      "text": "Google Search Console (Gratis)"
    },
    {
      "level": "H3",
      "text": "Ahrefs Webmaster Tools (Gratis)"
    },
    {
      "level": "H3",
      "text": "Keyword Generator (Gratis)"
    },
    {
      "level": "H3",
      "text": "Keyword Difficulty Checker (Gratis)"
    },
    {
      "level": "H3",
      "text": "Keyword Rank Checker (Gratis)"
    },
    {
      "level": "H3",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Tiriamo le conclusioni"
    }
  ],
  "author": "Tim Soulo  Joshua Hardwick Joshua Hardwick Joshua Hardwick"
}