{
  "url": "https://ahrefs.com/blog/it/rich-snippet/",
  "slug": "rich-snippet",
  "title": "Rich Snippet: Cosa Sono e Cosa Fare Per Averli?",
  "description": "I rich snippet ti aiutano a rendere più attraente la pagina web nei risultati di ricerca. Possono mostrare informazioni aggiuntive utili dai dati strutturati della pagina.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti Vuoi che il tuo sito web compaia in questo modo nei risultati di ricerca?Invece di così?Cosa imparerai in questa guida:Cosa sono i rich snippetQuando compaiono i rich snippetLa differenza tra rich snippet e rich resultCome i rich snippet migliorano la SEOCome avere i rich snippetCosa sono i rich snippet?I rich snippet sono risultati di ricerca più attraenti da vedere con informazioni di valore aggiuntive mostrate vicino al titolo, descrizione e URL. Le informazioni extra provengono dai dati strutturati della pagina.Miglioramenti delle recensioni e FAQ nella SERP.Quando compaiono i rich snippet?I rich snippet possono apparire solamente per le pagine con alcuni tipi di informazioni, e possono essere limitati dal tipo di dispositivo. Per esempio, rich snippet “come fare a” compare solamente dei dispositivi mobili:Qual’è la differenza tra i rich snippet e i rich result?Probabilmente avrai incontrato il termine “rich result”, che spesso viene usato in modo intercambiabile con “rich snippet”.Le SERP sono oggi parecchio complesse. Guarda solamente ai risultati del sondaggio quando chiedo alle persone pareri sui nomi:Vote here:— Michal Pecanek (@michalpecanek) March 31, 2020Possiamo affermare che non c’è consenso.Il “tipo di SERP” nell’immagine sopra è chiamato ufficialmente un rich result interattivo…Definizione della galleria di ricerca Google.…oppure è un “risultato di ricerca arricchito”?La mancanza di una terminologia consistente di Google non aiuta certamente.Ecco il nostro contributo per la terminologia:Rich snippets: Normali risultati di ricerca con informazioni aggiuntive mostrate vicino al titolo, lo snippet descrittivo, e la URL.Rich results: Qualsiasi tipo di risultato di ricerca potenziato da informazioni visuali, con le informazioni prese da dati strutturati rilevanti.SERP features. Tutto ciò che non è un risultato di ricerca “link blu”. Snippet featured, pubblicità PPC, riquadri dei tweet, e Grafici di Conoscenza sono tutte tipologie di funzionalità SERP.Come i rich snippet migliorano la SEOPosizionarsi in alto nei risultati di ricerca è bello, ma ciò che farà la differenza per far cliccare le persone sono i contenuti dello snippet. I rich snippet aiutano a rendere la tua pagina web più attraente nei risultati di ricerca.Il primo snippet è sicuramente il più attraente perché utilizza il markup schema prodotto nel suo pieno potenziale. Trasmette fiducia e favorisce i click grazie al numero superiore di recensioni e mostrando il prezzo.Puoi anche utilizzare questi attributi, come i prezzi, il numero di recensioni, i voti, o il tempo di cottura per le ricette come un livello competitivo nella SERP. Ti forniscono più spazio per attirare click con informazioni che contano. Per esempio, posso immaginare più persone cliccare nel risultato di un prodotto che si posiziona secondo ma è più economico del primo.Tuttavia, facciamo un po’ di chiarezza:Anche se avere degli snippet visivamente attraenti potrebbe portare a più click, i rich snippet non sono un fattore di posizionamento.Come ottenere i rich snippetI rich snippet sono creati partendo da dati strutturati che sono disponibili per certe tipologie di contenuto. I dati sono formattati e organizzati in modo da renderli facili da capire per Google ed usati per la SERP ed altri motivi.Quindi, invece di chiedere a Google di estrarre le informazioni chiave da qualcosa del genere…Ci vorranno 20 minuti per preparare i pancake. Non solo, queste sono pancake con poche calorie—circa 80 ciascuna. …saranno disponibili in un formato strutturato che ricorda questo:tempo di cottura: 20 minuti calorie: 80 Puoi capire come il secondo esempio sia più facile da leggere per una macchina come Google.Ora, quando ci riferiamo a dati strutturati nella SEO, ci riferiamo di solito al vocabolario schema.org utilizzato per definire il tuo contenuto. Google allora potrebbe decidere di utilizzare questo markup per arricchire i suoi risultati di ricerca.Quindi, come puoi implementare questo markup, e che tipo di contenuto puoi applicarci?Ecco come ottenere il massimo dagli rich snippet in 4 semplici passaggi.1. Controlla quali rich snippet sono i giusti per tePrima di tutto, gli snippet standard dei risultati di ricerca possono già darti una buona visione del contenuto. Per esempio, nel caso di molti dei nostri articoli, non c’è molto altro che può dare valore aggiunto al lettore.Ad esempio, cos’altro potresti volere oltre al titolo, descrizione, e la URL di un articolo di blog come questo?Il metodo per ottenere i rich snippet è ben documentato da Google. Ed include i tipi di contenuto che sono idonei ad arricchire i risultati di ricerca.Ecco la lista dei casi più comuni per l’uso dei markup rich snippet:Markup “How to”Markup prodottoMarkup recensioniMarkup softwareMarkup FAQCi sono molte più opzioni di queste, ma vengono applicate a categorie di siti web specifici come le ricette che hai visto in precedenza. Gli altri sono:News, media, and entertainment Notizie, media e intrattenimentoBooks LibriEducation EducazioneEvents EventiDatasets Basi datiJob-related content Lavoro-carrieraSe alcune di queste categorie è per te rilevante, allora leggi i documenti ufficiali, controlla i possibili miglioramenti e funzionalità per il tuo tipo di contenuti, e decidi se vale la pena implementarli.Per tutti gli altri, prendiamo il markup FAQ come esempio e vediamo il processo di implementazione che potrebbe portare a qualcosa di simile a questo:Implementare il rich snippet FAQ è una popolare tattica SEO recente per avere maggiore spazio nella SERP. Anche se è menzionata nella tipologia Prodotto, può essere usata per ogni pagina con una sezione FAQ.2. Implementare i dati strutturatiE’ facile creare ed implementare il markup indipendentemente da come è stato costruito il sito web.Iniziamo presentandoti il metodo più diretto di inserimento del codice nella sezione <head> del tuo sito web.Ti verrà comodo utilizzare uno dei tanti generatori di markup schema. Io ho scelto questo qui ed ho selezionato la creazione del markup per la pagina FAQ:<script type=\"application/ld+json\"> { \"@context\": \"https://schema.org\", \"@type\": \"FAQPage\", \"mainEntity\": [{ \"@type\": \"Domanda\", \"name\": \"E’ difficile implementare questo markup?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"No, nel modo più assoluto, ci sono molti plugin e generatori di markup.\" } },{ \"@type\": \"Question\", \"name\": \"I tecnici seo usano a proprio vantaggio il markup FAQ?\", \"acceptedAnswer\": { \"@type\": \"Answer\", \"text\": \"Si, è una tattica abbastanza popolare. Mentre può fornire molto valore per la SERP, i SEO tendono ad usarla troppo fino al limite delle linee guida di Google.\" } }] } </script> Puoi usare anche Google Tag Manager per creare il codice.Ricorda solamente di aggiungere schema al contenuto che è visibile al lettore e di rispettare le linee guida di Google per il tipo di schema scelto.Per esempio, non dovresti usare il markup FAQ per motivi pubblicitari, e dev’essere scritto nel sito web stesso.Nota a margine.Qui sto utilizzando il formato markup JSON-LD (JavaScript Object Notation for Linked Data). Verrai a conoscenza anche di microdata e RDFa. Non utilizzarli, e tieni il JSON-LD. E’ ciò che Google consiglia ufficialmente, ed è anche il formato più semplice e meno confusionario. Ma cosa fare quando usi un CMS dove la stesura di codice personalizzato è spesso problematica?Se stai usando WordPress, i plugin fanno al caso tuo. I dati strutturati sono supportati nei plugin SEO multiuso come Yoast o Rank Math, oppure ci sono plugin creati solamente per l’implementazione degli schema.Yoast è sufficiente per le basi come gli schema FAQ e “how to”, ma avrai bisogno di un plugin più specializzato per uno spettro maggiore di tipologie di schema. Dopo aver usato le versioni gratuite dei plugin più famosi, ho apprezzato maggiormente l’esperienza d’uso le opzioni markup di Rank Math.Rimanendo su Yoast e il nostro esempio FAQ, il processo è molto semplice (e di fatto identico a Rank Math). E’ necessario selezionare un blocco FAQ quando si crea una pagina…… e compilare le domande e le risposte:Il processo di creazione dipende dal plugin e dal tipo di schema, non ci sono scorciatoie magiche o guide buone-per-tutti. Ti consiglio di leggere la documentazione del plugin che hai scelto per vedere come funziona con il tipo di schema scelto.3. Validare il markupUtilizzando generatori di markup e plugin rende il processo di generazione del markup molto affidabile. Ma è sempre bene controllare con lo Strumento di Test Rich Result di Google. Questo ti dirà immediatamente se il codice o la pagina è idonea ai rich result.Ricorda la parola “idonea” perché i rich snippet non sono garantiti.Puoi inserire anche un URL se il markup è già attivato. E’ buono per i controlli a campione ma inutile per controllare tutto il sito web.4. Controlla performance ed errori delle pagine con markupGoogle non si tira indietro nemmeno in questo campo. Tutto ciò di cui hai bisogno è nella Search Console di Google.Puoi filtrare i report di performance in base ai rich result:E vedere tutti i tipi di markup idonei che Google scova nel tuo sito web:Cliccando in un approfondimento rich snippet arriverai ad un report che mostra gli URL che sono validi, non validi, e con avvertenze.Se hai già validato i markup, allora non dovresti incontrare alcun problema. La cosa bella di questo è che non devi impostare nulla. Apparirà nel GSC dopo che avrai impostato i rich result markup e Google li prenderà dalla scansione delle pagine.ConclusioniAvere maggior attenzione e click con i rich snippet è bene, ma tieni a mente che i dati strutturati che sono alla base fanno parte di qualcosa di più grande.Google utilizza i dati strutturati per aiutarti a costruire il Grafico di Conoscenza. E’ questo che aiuta Google a fornire risultati di ricerca più rilevanti e alimenta altri tipi di funzionalità SERP come i Pannelli di Conoscenza.Capire come funzionano i Grafici di Conoscenza, e come utilizzarli a tuo vantaggio è una tecnica SEO cruciale da avere ora e nei prossimi anni.Per domande o segnalazioni, non esitare a scrivermi su Twitter.Tradot­to da Mau­ro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Rich Snippet: Cosa Sono e Cosa Fare Per Averli?"
    },
    {
      "level": "H2",
      "text": "Cosa sono i rich snippet?"
    },
    {
      "level": "H2",
      "text": "Quando compaiono i rich snippet?"
    },
    {
      "level": "H2",
      "text": "Qual’è la differenza tra i rich snippet e i rich result?"
    },
    {
      "level": "H2",
      "text": "Come i rich snippet migliorano la SEO"
    },
    {
      "level": "H2",
      "text": "Come ottenere i rich snippet"
    },
    {
      "level": "H3",
      "text": "1. Controlla quali rich snippet sono i giusti per te"
    },
    {
      "level": "H3",
      "text": "2. Implementare i dati strutturati"
    },
    {
      "level": "H3",
      "text": "3. Validare il markup"
    },
    {
      "level": "H3",
      "text": "4. Controlla performance ed errori delle pagine con markup"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Michal Pecánek"
}