{
  "url": "https://ahrefs.com/blog/it/scrittura-seo/",
  "slug": "scrittura-seo",
  "title": "Cos’è la SEO Copywriting? Come Diventare Più Bravi nella Scrittura SEO",
  "description": "La SEO copywriting è il processo di ricerca, definizione, creazione e ottimizzazione dei contenuti allo scopo di posizionarsi su Google e altri motori di ricerca.",
  "content": "Fio Dossetto Content marketing editor. Grande fan di Ahrefs. Impegnato nell’aiutare le persone a creare contenuti fantastici che aiutano la propria audience. Contenuti La SEO copywriting è il processo di ricerca, definizione, creazione e ottimizzazione dei contenuti allo scopo di posizionarsi per la parola chiave di proprio interesse su Google e altri motori di ricerca.Il successo di Google si basa sul fornire i contenuti più adatti alle ricerche che gli utenti compiono. Se vuoi fare in modo che sia il tuo contenuto quello che le persone vedano, fare “qualcosina” a livello SEO non ti porterà lontano. Dovresti invece implementare la SEO direttamente nel processo di scrittura dei contenuti sin dalle fasi iniziali.Questa guida ti spiega:Perché la SEO Copywriting è importanteCome scrivere per la SEO: un approccio a 5 step5 Consigli SEO da applicare alla scritturaPerché la SEO Copywriting è importanteEsistono tantissimi contenuti che non vengono mai visti perchè non si posizionano e dunque non hanno possibilità di educare, aiutare, colpire positivamente o convertire nessuno (non si riflettono nemmeno positivamente su di te, ovvero la persona che lo ha scritto).Al contrario, scrivere avendo cura di pensare anche al lato SEO delle cose, ti aiuta a ottenere traffico organico, lettori in target e potenziali clienti sul tuo sito.Ad esempio, il team di Ahrefs ha impiegato 5 anni per portare il blog da ~5,000 a ~550,000 visite al mese. I contenuti da loro scritti si posizionano e portano traffico in target al sito, dove potenziali clienti possono imparare ad utilizzare Ahrefs per far crescere il loro traffico e di conseguenza la loro attività. Alcuni di loro infatti, con il passare del tempo, acquisteranno una sottoscrizione al nostro tool.La crescita del traffico del Blog di Ahrefs. Dati presi dal Site Explorer.Come scrivere per la SEO: un approccio a 5 stepLa SEO copywriting consiste nel ricercare e scrivere contenuti che si posizionano nei motori di ricerca, ma questo non significa certo che tu debba scrivere in maniera artificiale per un pubblico di robot. Il tuo scopo principale è infatti quello di capire cosa stiano cercando le persone, in modo da poterti allineare con il contenuto di cui hanno bisogno.Ecco quindi un framework a 5 step che ti aiuterà a scrivere contenuti per il tuo blog avendo cura dell’aspetto SEO. Per ognuno di questi step ho incluso degli esempi presi da questa stessa guida, in modo che tu possa vedere il processo di ricerca e scrittura nel quale ho dovuto imbattermi. Tieni a mente però, che gli esempi e la ricerca che ti mostrerò nei prossimi step prendono in considerazione la versione originale di questo articolo, che è in inglese.Trova una parola chiave adatta alla tua attività con potenziale di portare trafficoDetermina l’intento di ricercaDefinisci i subtopic che dovresti includereDelinea la strutturaScrivi il tuo contenutoPS: avrai notato come la scrittura è l’ultimo di tutti gli step—questo è proprio il concetto dietro un contenuto ottimizzato per la SEO: per fare un lavoro eccellente, devi prima ricercare a fondo e capire quello che le persone stanno cercando, cosa si aspettano di trovare e quale tipo di contenuto è il più adatto. Solo in quel momento potrai cominciare a scrivere.1. Trova una parola chiave adatta alla tua attività con potenziale di portare trafficoComincia identificando un argomento correlato all’attività per la quale stai scrivendo. Prova a pensare a cosa le persone potrebbero ricercare su Google per trovare i tuoi prodotti o servizi: questa è la tua parole chiave seed.Ad esempio, se stessi scrivendo per un’attività che vende lampade, cercheresti semplicemente “lamp” o “lamps”.Inizia la ricerca inserendo la parola chiave seed all’interno del Keyword Explorer di Ahrefs e utilizza il report Questions per trovare idee per le parole chiave in forma di domanda. La maggior parte delle domande avranno un intento informazionale, per le quali puoi posizionarti con un articolo di blog.Puoi anche utilizzare il report chiamato Phrase Match per identificare ricerche che contengono la tua parola chiave seed ed ordinarle in base al volume di ricerca.Tieni però a mente che non ha sempre senso cercare di intercettare queste ricerche con un articolo: il formato dipende infatti dall’intento di ricerca (ne parleremo nello step numero 2).Se il tuo sito è relativamente nuovo, un buon punto di partenza è quello di restringere la ricerca filtrando in base alle parole chiave che hanno una Keyword Difficulty bassa (<30) e volumi di ricerca piuttosto alti (1000+). Queste sono solitamente le più facili per cui posizionarsi, ma che hanno comunque un buon potenziale di traffico.Ad esempio, “best desk lamps” sembra una parola chiave con un buon volume di ricerca. E se diamo uno sguardo alla SERP con la funzione Overview, la pagina meglio posizionata ottiene una stima di 7000+ visite al mese da Google, confermando quindi il potenziale di traffico posseduto da questa parola chiave.Stima delle visite mensili provenienti dagli USA per la pagina meglio posizionata. Dati dal Keywords Explorer di Ahrefs.Seguendo lo stesso processo per scrivere questa guida, ho inserito “SEO” come parola chiave seed, ed ho poi trovato “SEO writing” nel report Phrase Match. L’ho quindi scelta in quanto gode di buone ricerche, è in target con i nostri lettori, e non siamo attualmente posizionati per essa.2. Determina l’intento di ricercaUna volta identificata la parola chiave principale con un buon potenziale di traffico, dovresti cercare di capire cosa cercano le persone che la digitano. Questo è conosciuto come intento di ricerca (spesso chiamato anche search intent, dall’inglese), e se il tuo contenuto non combacia con esso, è molto improbabile che Google lo posizioni.Puoi capire che tipologia di pagine sono più adatte a quell’intento analizzando quelle meglio posizionate nella SERP, identificando poi quelle che noi definiamo come le 3 C dell’intento di ricerca: tipo di Contenuto, formato del Contenuto e angolo del Contenuto.Tipo di contenutoIl tipo di contenuto (ad esempio landing page, articolo o blog post, video, ecc…) che si posiziona meglio per la tua chiave d’interesse ti fornisce informazioni su quello che dovresti creare.Se hai trovato la parola chiave all’interno del report chiamato Questions, quasi sempre i contenuti più performanti sono gli articoli di blog o i video che forniscono informazioni all’utente che cerca:I primi due risultati di ricerca per la parola chiave informativa “how do touch lamps work”—entrambi articoli all’interno di un blog.Se invece hai utilizzato il report Phrase Match per trovare la parola chiave, potresti scoprire che quella scelta non ha necessariamente un intento informativo, il che significa che non riuscirai a posizionarti con un articolo di blog. Ad esempio, la SERP per “table lamps” ci suggerisce che chi cerca è in fase di acquisto, in quanto i risultati meglio posizionati sono tutte pagine di categoria all’interno di siti ecommerce.Formato del contenutoIl formato dei contenuti meglio posizionati (ad esempio, liste o contenuti guida che spiegano come fare qualcosa) detterà il modo in cui dovresti strutturare anche il tuo contenuto. Ad esempio, la maggior parte dei risultati per “best desk lamp” sono articoli di blog, quindi questo è il formato di contenuto che dovresti scrivere anche tu.Angolo del contenutoQuando analizzi le SERP, prendi nota di quelle che sono le varie prospettive degli articoli esistenti. Ad esempio, un angolo comune per la parola chiave “how to develop film” è il come farlo a casa (o per meglio dire “at home”, visto che stiamo ragionando in inglese per questo articolo).Per questa guida che stai leggendo, l’intento di ricerca dietro “SEO copywriting” era piuttosto chiaro:Tipo di contenuto → blog post/articolo Formato del contenuto → guida/come fare Angolo del contenuto → guide complete; tecniche per principianti e writer che non hanno esperienza con la SEOPer far combaciare il contenuto all’intento di ricerca e avere migliori possibilità di posizionarci, ho deciso di fare di questa guida una risorsa SEO completa che spiegasse tutto dalla A alla Z, piuttosto che creare una lista di consigli presi qua e là.Nota del redattoreL’intento di ricerca è generalmente un fattore di ranking sottovalutato, che può però aiutare anche nella ri-ottimizzazione dei contenuti esistenti.Ad esempio, il nostro articolo su “Cos’è la SEO” è partito come una carrellata di 40+ domande e risposte scritte da vari esperti SEO che fornivano la propria opinione. Quando abbiamo analizzato nuovamente l’intento di ricerca dopo alcuni mesi, ci siamo resi conto che nessuno voleva avere 40+ definizioni differenti: tutti volevano invece imparare qualcosa e questo “vuoto” fra il loro intento e il nostro contenuto non ci permetteva di posizionarci bene.Abbiamo quindi riscritto tutta la pagina per allinearla con l’intento di ricerca, ed il traffico è praticamente migliorato nell’arco di poche ore.Joshua HardwickHead of Content3. Definisci i subtopic che devi coprireA questo punto dovresti avere la parola chiave principale e sapere che tipo, formato e angoloutilizzare per scrivere il tuo contenuto.Continuiamo però a fare ulteriori ricerche: dobbiamo analizzare le pagine che si posizionano meglio per la nostra parola chiave (ovvero i nostri competitor) e la SERP per determinare i subtopic da coprire.Utilizza un file doc, uno spreadsheet, o un qualsiasi editor di testo per annotare le seguenti informazioni.Metodo 1: Analizza gli heading utilizzati dai tuoi competitorAvere una lista degli heading utilizzati dai competitor ti fornisce al volo un’idea di quelli che sono i subtopic che dovresti toccare nel tuo articolo. Inoltre, puoi ottenere idee su come rendere il tuo contenuto più utile ed originale.Visita quindi le pagine dei tuoi competitor e analizza la loro struttura (ovvero gli headings). Puoi utilizzare la toolbar gratuita di Ahrefs per visualizzare rapidamente gli heading presenti su di una qualsiasi pagina. Clicca sull’icona a forma di lista per aprire il report on-page relativo alla pagina e scrolla fino a trovare la lista degli heading. A questo punto prendi nota di tutti i subtopic che trovi fra le tue pagine competitor.Nel nostro caso, la maggior parte delle pagine includeva un heading chiamato “What is SEO writing”, il quale mi ha fatto capire che includere una definizione fosse importante.Metodo 2: verifica le PAA boxTorna su Google e cerca la tua parola chiave principale. Le box “Le persone hanno chiesto anche” (o PAA, dall’inglese People Also Ask) forniscono un’idea di quello che le persone hanno in mente quando compiono quella specifica ricerca: Non devi rispondere ad ogni singola domanda che trovi, ma queste possono fornirti un’idea di come scrivere un contenuto in linea con quello che viene cercato e cosa gli utenti si aspettano di trovare nella tua pagina. Nell’esempio qui sopra, posso capire che le persone cercano contenuti “freschi” (inseriscono infatti “2020” nella query).Metodo 3: scopri per cosa si posizionano i tuoi competitorConoscere le parole chiave per le quali i tuoi competitor si posizionano ti assicura di non lasciare nulla al caso e capire esattamente cosa includere nell’articolo.Puoi confrontare le parole chiave per cui alcune pagine si posizionano utilizzando il Content Gap Tool di Ahrefs e cliccando poi su “Show Keywords”.In questo caso, prova ad identificare i punti in comune fra le pagine che si posizionano meglio. Non devi trovare parole chiave da gettare alla rinfusa nel contenuto, piuttosto, subtopic che dovresti includere nella tua struttura.4. Delinea la strutturaSe hai seguito tutti gli step qui sopra, dovresti ora avere:Una parola chiave principaleFormato, tipo e angle del contenuto che dovresti scrivereTutti i subtopic da coprireOra è tempo di delineare la struttura del contenuto. Apri Google Doc (o qualsiasi editor di testo) e scrivi una bozza del titolo. Questo ti aiuta a tenere a mente l’angle quando scrivi il contenuto.Scrivi poi una lista degli heading che vorresti utilizzare, seguendo l’approccio della “piramide inversa”. Comincia dalle informazioni più importanti da coprire, espandendo poi il resto dei punti da toccare in modo logico e in ordine di importanza.Nel mio caso, ho cominciato dalla definizione di “SEO writing”, spiegando perché è importante, ed ho poi proseguito elencando una serie di step su come applicare tali concetti. La sezione contenente consigli e suggerimenti che leggerai a breve è infatti utile ma non strettamente necessaria—rientra esattamente in quella sezione chiamata “Interessante da sapere” della nostra piramide.PRO TIPDovresti fornire anche un pò di informazioni aggiuntive su ogni sezione. Questo aiuta i tuoi editor a capire in che modo verrà sviluppato il contenuto e vi permetterà di essere allineati.5. Scrivi una bozzaSei finalmente giunto al punto nel quale trasformeremo la struttura del nostro articolo in una bozza. Se sei un content writer dovresti già sapere cosa fare—ma ecco comunque una serie di consigli utili da tenere a mente:Scrivi in modo naturale avendo in mente la tua audienceNel momento in cui cominci a scrivere, gli elementi più importanti relativi alla SEO sono già definiti: in questo modo puoi concentrarti sullo scrivere in maniera naturale.Utilizza un tono colloquiale, evitando frasi al solo scopo di allungare il brodo. Un tool come Hemingway può aiutarti a semplificare ed affinare il testo—anche se non tutte le lingue sono supportate e non sempre tool del genere riescono a comprendere testi tecnici.Un esempio di linguaggio tecnico che Hemingway considera di difficile lettura.Ricordati sempre di tenere a mente la tua audience. Ad esempio, se vuoi scrivere un contenuto per un pubblico di principianti, pensa alle conoscenze che questi potrebbero già avere in funzione di quello che stai tentando di spiegare. In questo modo puoi immaginarti una personale reale per la quale scrivere.Parlando di questo:Parla come la tua audienceSe non sei esperto nel tema che stai trattando, corri il rischio di utilizzare frasi e parole generiche che non risuonano con la tua audience, che di conseguenza non si fiderebbe particolarmente. Ad esempio se non ti intendi di alpinismo, non potresti sapere che “arrivare in cima ad una montagna” si dice “summiting”—ma un pubblico di appassionati ne sarebbe sicuramente a conoscenza.Quando ti manca l’esperienza in prima persona puoi crearti un vocabolario leggendo i contenuti esistenti:Se stai parlando di prodotti fisici, leggi le recensioni scritte da altri e dai uno sguardo anche su Amazon e YoutubeSe stai invece descrivendo un servizio (come ad esempio un software), leggi i forum dove gli specialisti di scambiano opinioni o anche i vari gruppi correlati sui socialSe il topic è estremamente complesso e di nicchia, considera intervistare un esperto e imitare il suo linguaggio nella tua bozzaAggiungi qualcosa di unicoUna struttura SEO è come un libro da colorare: hai i contorni ma sta a te scegliere come colorarli.Fare ricerche approfondite è utilissimo, perchè ti permette di conoscere i tuoi competitor e creare qualcosa di unico. Ad esempio, la maggior parte dei contenuti che si posiziona per “SEO writing” utilizza degli esempi generici: al contrario, io ho deciso di avere un approccio differente, e mostrarti come questo articolo si è evoluto dalla fase di ricerca a quella di pubblicazione.Segui la struttura che hai scritto, ma sii pronto ad alterarlaScoprirai che con molta probabilità che la struttura SEO che hai realizzato ha senso in modo astratto, ma durante il processo di scrittura dovrà essere alterata.Ad esempio, la mia struttura originale prevedeva solamente 4 step. Mentre la scrivevo però, è diventato ovvio che l’ultimo di questi poteva essere diviso in due: ho quindi preso nota e modificato poi la struttura.5 semplici consigli SEO da applicare alla tua scritturaLa scrittura SEO non si limita al solo processo di redazione. Se vuoi avere maggiori possibilità di posizionarti con i tuoi contenuti e ottenere traffico, segui anche questi step aggiuntivi:1. Crea un titolo irresistibile 2. Utilizza URL concise e in tema 3. Ottimizza per i featured snippet 4. Utilizza i link interni per migliorare il contesto 5. Rafforza il contenuto con le immagini1. Crea un titolo irresistibileIl titolo è l’elemento più visibile nella SERP e non otterrai traffico (o un CTR decente) se questo non intriga le persone a fare clic.Dai uno sguardo ai titoli delle pagine meglio posizionare e scrivi qualcosa che possa ottenere più clic di loro (senza cadere nel clickbait). Utilizza la tua parola chiave principale per far capire che il tuo contenuto è in linea con il loro intento e in che modo può aiutarli. Quando puoi utilizza anche:Numeri (ad esempio, 27 Idee Regalo per le Nozze, o Come Tagliarti i Capelli da Solo [in 4 Semplici Mosse])Aggettivi (ad esempio Economico, Facilmente, In poco tempo)Freschezza dei contenuti (ad esempio, I Calzini più Stravaganti del 2021)Brand name (da esempio Guida SEO da Ahrefs)Valore aggiunto (ad esempio, Come Cucinare i Brownie in Meno di 10 Minuti)Unicità (ad esempio, 10 Lezioni che Abbiamo Imparato Lanciando (e poi Eliminando) la Nostra App)Scrivere un buon titolo ottimizzato per la SEO non significa fare clickbaiting: non vuoi di certo che i tuoi visitatori facciano un bounce tornando alla SERP perchè il tuo contenuto non è allineato con la loro ricerca.Consiglio: utilizza un tool per vedere l’anteprima nella SERP e capire come il tuo titolo apparirà prima ancora di pubblicare l’articolo.2. Utilizza URL concise ed in temaCrea delle URL SEO-friendly mantenendole concise e semplici. La tua parola chiave principale è solitamente abbastanza. Le URL brevi sono più semplici da leggere, mentre quelle più lunghe spesso vengono tagliate nella SERP.Evita di utilizzare numeri e date nelle URL, in quanto queste potrebbero cambiare quando aggiorni il tuo contenuti in futuro.3. Ottimizza per i featured snippetI featured snippets sono dei brevi sommari che appaiono in cima ai risultati organici di Google. Molte ricerche hanno i featured snippet, e questi ti danno un grande livello di visibilità nelle SERP.Per ottimizzare il tuo testo al fine di ottenere uno snippet per la tua parola chiave principale, guarda la SERP e cerca di capire il formato del risultato esistente. Ad esempio, potresti notare che il featured snippet è costituito da una lista:Uno snippet in questo formato viene solitamente tirato fuori daglii headings, quindi se hai creato il tuo contenuto seguendo i passi qui sopra dovresti già essere ottimizzato su questo aspetto—in pratica, si tratta di strutturare il tuo articolo seguendo un ordine logico.In altri casi, potresti notare che lo snippet è un paragrafo:In questo caso, dovresti fornire una risposta alla query in modo succinto e conciso.4. Utilizza i link interni per conferire contestoNon puoi coprire un intero argomento in un solo articolo; devi quindi utilizzare i link interni per evidenziare altre risorse che diano alle persone un contesto aggiuntivo rispetto a quello che stanno leggendo. Google utilizza inoltre i link interni per scoprire nuovi contenuti, rendendoli quindi ottimi per la SEO.Ad esempio, ci sono molte formule per la SEO copywriting di cui avrei potuto parlare in questa guida, ma questo l’avrebbe resa non affine all’obiettivo che mi ero posto. Invece, ho preferito segnalare risorse aggiuntive sulla SEO Copywriting e sui Contenuti SEO grazie alle quali puoi approfondire.5. Rafforza il contenuto con le immaginiUn writer SEO lavora principalmente con le parole, ma le immagini aiutano il lettore a seguire la logica dell’articolo, oltre a fornire ulteriore valore al contenuto. Nessuno vuole trovarsi davanti ad un muro di testo (a meno che non vogliano leggere un romanzo): utilizza quindi le immagini in modo strategico per spezzare l’articolo quando necessario.Bonus aggiuntivo: utilizzare le immagini come quelle che hai visto fin’ora fa capire ai tuoi lettori che quello che scrivi è “reale”, specialmente quando li guidi attraverso una serie di step di cui vuoi mostrare il processo.ConclusioniSe c’è una sola cosa che dovresti portarti a casa da questa guida, sarebbe la seguente: la scrittura SEO non consiste nell’inserire parole chiave a caso nel testo per farlo piacere ai motori di ricerca o trarre in inganno chi clicca. Significa invece scrivere contenuti che aiutino davvero la tua audience, cosa che ti porterà poi a posizionarti meglio ed ottenere più traffico.Domande? Scrivici su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cos’è la SEO Copywriting? Come Diventare Più Bravi nella Scrittura SEO"
    },
    {
      "level": "H2",
      "text": "Perché la SEO Copywriting è importante"
    },
    {
      "level": "H2",
      "text": "Come scrivere per la SEO: un approccio a 5 step"
    },
    {
      "level": "H3",
      "text": "1. Trova una parola chiave adatta alla tua attività con potenziale di portare traffico"
    },
    {
      "level": "H3",
      "text": "2. Determina l’intento di ricerca"
    },
    {
      "level": "H4",
      "text": "Tipo di contenuto"
    },
    {
      "level": "H4",
      "text": "Formato del contenuto"
    },
    {
      "level": "H4",
      "text": "Angolo del contenuto"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "3. Definisci i subtopic che devi coprire"
    },
    {
      "level": "H4",
      "text": "Metodo 1: Analizza gli heading utilizzati dai tuoi competitor"
    },
    {
      "level": "H4",
      "text": "Metodo 2: verifica le PAA box"
    },
    {
      "level": "H4",
      "text": "Metodo 3: scopri per cosa si posizionano i tuoi competitor"
    },
    {
      "level": "H3",
      "text": "4. Delinea la struttura"
    },
    {
      "level": "H3",
      "text": "5. Scrivi una bozza"
    },
    {
      "level": "H4",
      "text": "Scrivi in modo naturale avendo in mente la tua audience"
    },
    {
      "level": "H4",
      "text": "Parla come la tua audience"
    },
    {
      "level": "H4",
      "text": "Aggiungi qualcosa di unico"
    },
    {
      "level": "H4",
      "text": "Segui la struttura che hai scritto, ma sii pronto ad alterarla"
    },
    {
      "level": "H2",
      "text": "5 semplici consigli SEO da applicare alla tua scrittura"
    },
    {
      "level": "H3",
      "text": "1. Crea un titolo irresistibile"
    },
    {
      "level": "H3",
      "text": "2. Utilizza URL concise ed in tema"
    },
    {
      "level": "H3",
      "text": "3. Ottimizza per i featured snippet"
    },
    {
      "level": "H3",
      "text": "4. Utilizza i link interni per conferire contesto"
    },
    {
      "level": "H3",
      "text": "5. Rafforza il contenuto con le immagini"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Fio Dossetto"
}