{
  "url": "https://ahrefs.com/blog/it/segnalare-sito-google/",
  "slug": "segnalare-sito-google",
  "title": "Come Segnalare il Tuo Sito a Google nel 2021",
  "description": "Se vuoi che gli utenti dei motori di ricerca trovino il tuo sito, questo deve essere indicizzato. Impara come segnalare il tuo sito a Google.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti Se vuoi fare in modo che gli utenti dei motori di ricerca trovino il tuo sito, questo deve essere indicizzato.Come come si fa a segnalare un sito a Google nel 2021? Ed è necessario farlo?In questa guida, imparerai:Come segnalare il tuo sito a GoogleCome segnalare le URL a GoogleSe e perché è necessario segnalare il tuo sito a GoogleQuanto ci vuole prima che Google indicizzi il tuo sitoPerché Google potrebbe non indicizzare il tuo sitoCome segnalare il tuo sito a GoogleEsistono due modi per segnalare l’esistenza del tuo sito a Google. Puoi inviare una sitemap attraverso Google Search Console, puoi inviare la URL della sitemap utilizzando il servizio di “ping” di Google. Entrambe le opzioni sono completamente gratuite e richiedono un secondo.Trovare la tua sitemapEntrambi i metodi richiedono la URL della tua sitemap. Il modo in cui puoi trovarla o crearla dipende dalla piattaforma utilizzata dal tuo sito. Se usi WordPress, installa un plugin SEO gratuito, come Yoast, Rank Math, o The SEO Framework. Tutti e tre creano una sitemap in maniera automatica. Puoi poi trovarla qui:iltuosito.com/sitemap_index.xmlSe usi Wix, Squarespace, or Shopify, la tua sitemap è qui: iltuosito.com/sitemap.xml .Se utilizzi una piattaforma differente o un CMS, ci sono alte probabilità che questo crei una sitemap automaticamente per te. Probabilmente puoi trovarla ad uno dei seguenti indirizzi:iltuosito.com/sitemap.xmliltuosito.com/sitemap_index.xmliltuosito.com/sitemap1.xmlSe non è li, prova a guardare all’interno del file iltuosito.com/robots.txt.Se non utilizzi una piattaforma o un CMS, dovrai creare una sitemap manualmente. Prima però vale sempre la pena verificare le URL elencate qui sopra, in quanto potresti già averne una.Inviare la tua sitemapHai due opzioni.Opzione 1. Invia la tua Sitemap su Google Search ConsoleFai login all’interno di Google Search ConsoleScegli la giusta proprietàClicca su “Sitemap” nel menù a sinistraIncolla la URL della tua sitemapClicca “Invia”Questo è indubbiamente il miglior modo, in quanto Google Search Console ti notifica della presenza di eventuali errori all’interno della sitemap, anche in futuro. Fornisce anche una panoramica dello stato di salute del tuo sito, incluso il perché alcune pagine non possono essere indicizzate.Opzione 2. Invia la tua sitemap con un ping a GoogleGoogle ha un servizio di “ping” dove puoi richiedere una scansione della tua sitemap. Incolla questo nel tuo browser, sostituendo la parte finale con la URL della tua sitemap:http://www.google.com/ping?sitemap=<url_completa_della_sitemap>Ad esempio, se la tua sitemap si trova all’indirizzo iltuosito.com/sitemap.xml, dovresti fare in questo modo:http://www.google.com/ping?sitemap=https://iltuosito.com/sitemap.xmlDovresti poi vedere una pagina che mostra “sitemap notification received”.Google dice che dovresti utilizzare questo servizio solo per le sitemap nuove o che vengono aggiornate. Non utilizzarlo ripetutamente o su sitemap non aggiornate.Come segnalare le URL a GoogleGeneralmente parlando, non è necessario segnalare ogni nuova pagina a Google. Fintanto che le nuove URL vengono aggiunte alla sitemap che hai inviato a Google, questo riuscirà a scoprirle. Ci sono però due modi in cui puoi potenzialmente velocizzare questo processo.Opzione 1. Fai ping a GoogleAssicurati che le tue nuove pagine siano all’interno della sitemap, e utilizza poi le istruzioni nella sezione precedente per fare ping a Google e dare istruzioni per scansionare nuovamente la tua sitemap. Non è una cosa strettamente necessaria se utilizzi WordPress con Yoast, Rank Math, o The SEO Framework, in quanto tutti questi plugin fanno ping a Google in maniera automatica.Opzione 2. Utilizza URL Inspection Tool di GoogleÈ possibile aggiungere delle URL su Google anche se non sono presenti all’interno della tua sitemap (ma dovrebbero esserlo), utilizzando URL Inspection Tool di Google Search Console.Fai login su Google Search ConsoleScegli la giusta proprietàFai click su “Controllo URL” nel menù a sinistraIncolla la URL della tua paginaPremi InvioFai click su “richiesta di indicizzazione”Se hai solo una o due nuove pagine, non c’è nulla di male nel fare questo. Alcune persone credono che velocizzi l’indicizzazione. Se hai tante nuove pagine da inviare a Google non utilizzare questo processo. Non è efficiente, e ci metterai una giornata. Utilizza la prima opzione.Se e perché è necessario segnalare il tuo sito a GoogleSi e no.Google solitamente trova e indicizza ogni pagina che ritiene di valore, anche se non la segnali. Ma esistono comunque dei benefici nell’inviare il tuo sito a Google.Prima di parlarne però, dovremmo discutere del modo in cui Google trova e indicizza i contenuti.Come Google trova e indicizza i tuoi contenutiGoogle trova e indicizza i contenuti principalmente in quattro fasi.Nota a margine. Questi sono passaggi semplificati per scopi di chiarezza, in quanto Google è un animale piuttosto complesso. Fase 1. ScopertaLa scoperta è la fase nella quale Google scopre l’esistenza del tuo sito. Google trova la maggior parte dei siti e delle pagine attraverso le sitemap o i backlink da pagine conosciute.Fase 2. ScansioneLa scansione avviene quando un software (spider) chiamato Googlebot visita e scarica le tue pagine.Fase 3. LavorazioneNella fase di lavorazione le informazioni vengono estratte dalle pagine scansionate, e preparate per l’indicizzazione.Fase 4. IndicizzazioneL’indicizzazione è la fase nella quale le informazioni lavorate dalle pagine scansionate sono aggiunte a un grande database chiamato l’indice di ricerca. Questo è essenzialmente una libreria digitale di triliardi di pagine dalle quali Google estrae i risultati di ricerca.Lettura consigliata: Come Funzionano i Motori di Ricerca e Perché Dovresti SaperloPerché segnalare il sito a Google è importanteOgnuna della fasi qui sopra avviene in ordine. È un percorso. Inviando il tuo sito a Google, puoi potenzialmente velocizzare il primo passaggio del processo: la Scoperta.Come in ogni percorso da affrontare, prima parti, prima arrivi a destinazione. In questo caso: l’indicizzazione.Ma ci sono altri motivi per cui inviare una sitemap è importante.1. Dice a Google quali pagine sono importantiLe sitemap non includono solitamente ogni singola pagina del tuo sito. Includono solo le più importanti, escludendo quelle frivole o duplicate. Questo aiuta a combattere problemi come l’indicizzazione della versione errata di una pagina a causa di problemi di contenuti duplicati.2. Informa Google sulla presenza di nuove pagineMolti CMS aggiungono le nuove pagine alla sitemap per poi fare ping a Google automaticamente. Questo fa risparmiare del tempo rispetto all’invio manuale di ogni singola pagina.3. Informa Google di pagine orfaneLe pagine orfane sono quelle senza link interni da altre pagine del tuo sito. Google non può scoprire queste pagine attraverso la scansione, a meno che non ricevano link da altre pagine o siti. Inviare una sitemap risolve il problema, in quanto le pagine orfane vengono solitamente incluse—o per lo meno le pagine generate dai CMS.Quanto ci vuole prima che Google indicizzi il tuo sitoGoogle dice che la scansione può richiedere da qualche giorno a qualche settimana. (Ricorda che la scansione è un quasi sempre un prerequisito per l’indicizzazione).Nella mia esperienza, a meno che tu non abbia un grosso sito, raramente ci vogliono più di una o due settimane.Ma non preoccuparti se sembra ci voglia di più; è perfettamente normale.Perché Google potrebbe non indicizzare il tuo sitoGoogle non sempre indicizza tutte le URL che invii. Esistono diverse motivazioni per cui questo succede, ma ecco alcune delle più comuni:1. Hai bloccato la scansioneRobots.txt è un file che dice a Google quali URL possono e non possono scansionare.Ad esempio, questo robots.txt blocca Google dallo scansionare tutte le pagine sul sito:User-agent: GooglebotDisallow: /Google talvolta indicizza le URL anche se non può scansionare, ma è un evento piuttosto raro. Prevenire le scansioni fa sì che Google non possa ottenere informazioni sulla pagina in questione, ci sono quindi alte probabilità che questa non riesca a posizionarsi anche se viene indicizzata.Questo è un ulteriore buon motivo per iscriverti a inviare il tuo sito attraverso Google Search Console. Questo ti dice infatti quali pagine sono escluse a causa di blocchi all’interno del report chiamato Copertura.Ecco come arrivarci:Fai il login su Google Search ConsoleScegli la proprietà giustaFai click su “Copertura” nel menù a sinistraDa qui, fai click sulla scheda “Escluse” e verifica l’eventuale presenza di uno di questi tre errori:Bloccato da robots.txtURL inviata ma bloccata da robots.txtIndicizzata ma bloccata da robots.txt2. Hai delle pagine importanti impostate su noindexSe sulla tua pagine è presente un meta tag robots o un header x‑robots con un attributo “noindex”, Google non lo indicizzerà.Se Google ha già scansionato il tuo sito, puoi verificare la presenza di pagine in noindex attraverso il report Copertura. Clicca sulla scheda “Errore” e “Esclusa”, poi vai alla ricerca di questi due problemi:L’URL inviato contiene un tag “noindex”Esclusa in base al tag “noindex”Se Google non ha ancora indicizzato il tuo sito, o vuoi accertarti che non siano presenti “tag noindex” che non dovrebbero esserci in futuro, iscriviti su Ahrefs Webmaster Tools (AWT), e fai una scansione gratuita del sito attraverso il Site Audit. Questo verifica il tuo sito alla ricerca di oltre 100 errori SEO, incluse le pagine noindex.3. Hai pagine di poco valoreÈ probabile che Google non indicizzi pagine che ritiene di poco valore per chi ricerca. In un tweet del 2018, John Mueller di Google ha detto che il tuo sito è i tuoi contenuti dovrebbero essere “fantastici e ispirazionali” per essere indicizzati.We never index all known URLs, that’s pretty normal. I’d focus on making the site awesome and inspiring, then things usually work out better.— 🍌 John 🍌 (@JohnMu) January 3, 2018 Non indicizziamo mai tutte le URL, è normale. Mi concentrerei sul rendere il sito fantastico e ispirazionale, le cose in questo modo funzionano solitamente meglio.Se hai escluso la presenza di altri errori tecnici che prevengono l’indicizzazione, vale la pena chiederti se la pagina è davvero di valore. Se la risposta è no, probabilmente questo è il motivo per il quale non è indicizzata. Se credi che la tua pagina sia di poco valore e che tu possa averne altre sul sito, fai girare una scansione gratuita utilizzando il Site Audit all’interno di Ahrefs Webmaster Tools. Questo riesce a segnalare due errori spesso associati con le pagine di poco valore:Pagine con poco testoPagine che sono duplicati esatti o quasiPuoi vedere una lista delle URL con un poco testo all’interno del report All issues.Anche se il contenuto non deve essere lungo per essere di valore, le pagine con pochissimo testo spesso non sono utili per chi ricerca sul web. Vale quindi la pena fare una cernita e un’analisi di queste pagine manualmente, assicurandosi di renderle più utili dove necessario.Puoi invece vedere le pagine che sono duplicate o quasi all’interno del report Duplicate Content:Ecco un buon esempio di due pagine di basso valore che sono quasi duplicate fra di loro:Queste sono pagine categoria vuote su di un ecommerce. Dato che nessuna delle due include dei prodotti, non sono utili a dei potenziali visitatori. Dovrebbero quindi essere rimosse o migliorate.Lettura consigliata: 10 Metodi per Indicizzare il tuo sito su Google (Che Funzionano Veramente)ConclusioniAnche se il tuo sito è indicizzato su Google, non significa necessariamente che ti posizionerai sulla prima pagina di Google per la parola chiave di tuo interesse. Essere indicizzati significa che sei in competizione, non che vincerai.Questo è dove la SEO entra in gioco. La SEO è il processo di ottimizzazione del tuo sito al fine di incrementare il suo traffico dai risultati organici dei motori di ricerca. In questo caso: Google.Se vuoi approfondire la SEO, leggi la nostra guida alla SEO per principianti.Se vuoi segnalare il tuo sito agli altri motori di ricerca, leggi la nostra guida completa alla segnalazione del sito ai motori di ricerca.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Come Segnalare il Tuo Sito a Google nel 2021"
    },
    {
      "level": "H2",
      "text": "Come segnalare il tuo sito a Google"
    },
    {
      "level": "H3",
      "text": "Trovare la tua sitemap"
    },
    {
      "level": "H3",
      "text": "Inviare la tua sitemap"
    },
    {
      "level": "H4",
      "text": "Opzione 1. Invia la tua Sitemap su Google Search Console"
    },
    {
      "level": "H4",
      "text": "Opzione 2. Invia la tua sitemap con un ping a Google"
    },
    {
      "level": "H2",
      "text": "Come segnalare le URL a Google"
    },
    {
      "level": "H4",
      "text": "Opzione 1. Fai ping a Google"
    },
    {
      "level": "H4",
      "text": "Opzione 2. Utilizza URL Inspection Tool di Google"
    },
    {
      "level": "H2",
      "text": "Se e perché è necessario segnalare il tuo sito a Google"
    },
    {
      "level": "H3",
      "text": "Come Google trova e indicizza i tuoi contenuti"
    },
    {
      "level": "H4",
      "text": "Fase 1. Scoperta"
    },
    {
      "level": "H4",
      "text": "Fase 2. Scansione"
    },
    {
      "level": "H4",
      "text": "Fase 3. Lavorazione"
    },
    {
      "level": "H4",
      "text": "Fase 4. Indicizzazione"
    },
    {
      "level": "H3",
      "text": "Perché segnalare il sito a Google è importante"
    },
    {
      "level": "H4",
      "text": "1. Dice a Google quali pagine sono importanti"
    },
    {
      "level": "H4",
      "text": "2. Informa Google sulla presenza di nuove pagine"
    },
    {
      "level": "H4",
      "text": "3. Informa Google di pagine orfane"
    },
    {
      "level": "H2",
      "text": "Quanto ci vuole prima che Google indicizzi il tuo sito"
    },
    {
      "level": "H2",
      "text": "Perché Google potrebbe non indicizzare il tuo sito"
    },
    {
      "level": "H3",
      "text": "1. Hai bloccato la scansione"
    },
    {
      "level": "H3",
      "text": "2. Hai delle pagine importanti impostate su noindex"
    },
    {
      "level": "H3",
      "text": "3. Hai pagine di poco valore"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Joshua Hardwick"
}