{
  "url": "https://ahrefs.com/blog/it/seo-per-startups/",
  "slug": "seo-per-startups",
  "title": "SEO per Startup: 8 Passaggi per Farla in Economia",
  "description": "Non hai bisogno di grossi budget per iniziare a far crescere il tuo traffico organico con la SEO. Se vuoi iniziare a fare SEO per la tua startup, questa è la guida giusta.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti Le startup sono sempre alla ricerca di tattiche di crescita scalabili che possono essere eseguite con pochi soldi o addirittura senza. La Search Engine Optimization, o semplicemente SEO, è una di queste.La SEO non richiede un grosso budget e, se fatta correttamente, porta traffico gratuito che cresce quasi in modalità pilota automatico. In più, può spingere altre tattiche di marketing e avere effetto su ogni fase del marketing funnel. Se vuoi iniziare a fare SEO per la tua startup, sei nel posto giusto.In questo articolo, parleremo di:Perché le startup dovrebbero investire nella SEO?Come fare SEO per startupPerché le startup dovrebbero investire nella SEO?Se hai ancora dubbi riguardo l’utilità della SEO o hai bisogno di dati a supporto del tuo piano SEO, ecco tre motivi per i quali fare SEO per la tua startup.Motivo 1. Per via del trend principaleNel 2014, Google e Millward Brown Digital hanno condotto uno studio sulle abitudini di ricerca e acquisto fra chi prende decisioni nel mondo B2B. Quello studio ha rivelato come il 71% di chi ricerca nel B2B inizia proprio con una ricerca generica (invece di una branded).Come Google stessa ha detto, “Cercano prima un prodotto, non te”.Motivo 2. Perché le persone cercano quello che offriAnche se il tuo prodotto è davvero di nicchia, le persone probabilmente lo cercano comunque in un modo o nell’altro.Anche se potrebbero non esserci molte ricerche per “latte vegetale” (o “animal-free dairy” in inglese) in quanto si tratta di un nuovo concetto, c’è una domanda tangibile per ricerche correlate come “vegano”, “senza lattosio” o “a basso lattosio” (rispettivamente “vegan,” “lactose free,” o “low lactose” in inglese).Motivo 3. Perché puoi ottenere traffico gratuito e scalarloAttualmente, noi otteniamo circa 1.1 milioni di visite al mese solo dai motori di ricerca. Se dovessimo acquistare lo stesso ammontare di traffico utilizzando gli annunci PPC, ci costerebbe una stima di 2M$ al mese:Quindi anche se la SEO non è mai davvero gratuita, in quanto devi investire nella creazione di contenuti e la relativa ottimizzazione, non devi pagare per ogni utente e visita, come succede invece con gli annunci.Come fare SEO per startupSegui questi otto passaggi per iniziare a fare SEO per la tua startup nel modo giusto:Passaggio 1. Ottieni l’approvazioneChi devi convincere per iniziare a fare SEO nella tua startup? Il CMO, CFO, CEO, gli investitori, il team di marketing o forse te stesso? Chiunque sia, alla fine si tratta di aumentare il fatturato, giusto?Prima di tutto, la SEO è un investimento che non verrà ripagato in una notte. Ci vuole tempo a condurre una keyword research, creare contenuti e promuoverli. Ci vuole addirittura del tempo solo per fare in modo che Google o altri motori di ricerca scansionino e indicizzino il tuo contenuto.Ma la SEO può ripagarsi al contrario del resto, ed Ahrefs ne è la prova vivente. Siamo un’azienda con un ARR a sette zeri, con una strategia di marketing basata sui contenuti SEO.Se la persona che devi convincere è appassionata di marketing, un ottimo modo per convincerla è partire dai vantaggi stessi della SEO.Puoi spiegare i vantaggi della SEO mostrando le tattiche di marketing che si basano su essa, di cui la principale è il content marketing. Il content marketing ha diversi scopi:Crea awareness e attira potenziali clientiTi aiuta ad interagire con la tua audience e a ottenere credibilitàAiuta a convertire i clientiAiuta a fidelizzare e migliorare la retentionIl content marketing, funziona inoltre un pò come un interesse composto, come ho già detto prima.In altre parole, se utilizzi la SEO per creare contenuti, la SEO ha un modello di attribuzione che va praticamente a toccare ogni fase del marketing funnel.Se devi però convincere qualcuno la cui attenzione è posta interamente sull’impatto che potrebbe avere sul fatturato dell’azienda, va bene lo stesso. Devi solo parlare la stessa lingua della persona interessata, ad esempio utilizzando un grafico che mostri il punto di break-even del tuo investimento:Approfondisci: Come Convincere il Tuo Capo a Investire nella SEOPassaggio 2. Definisci obiettivi e risorseSe la tua SEO è già stata approvata, è arrivata l’ora del passaggio successivo: definire gli obiettivi e preparare le risorse necessarie all’operazione.Come definire gli obiettiviL’obiettivo ultimo della SEO è quello di raggiungere potenziali clienti attraverso la ricerca organica e convertirli in clienti. Ma questo è un obiettivo di alto livello ed è piuttosto difficile lavorarci perché non ti dice come ci arriverai..Un approccio migliore, consiste nel dividere il tuo obiettivo principale in obiettivi più “piccoli” che possono portarti più vicino a quello principale.Puoi visualizzare ciò come la piramide degli obiettivi SEO, dove la punta è l’obiettivo principale mentre quelli più piccoli sono contenuti nei livelli sottostanti. L’idea è partire dalla base portandosi verso la cima.Ad esempio, poniamo caso che il tuo obiettivo sia quello di posizionarti in top tre per una determinata parola chiave in sei mesi. La piramide potrebbe essere un qualcosa del genere:Come puoi vedere, abbiamo diviso il tutto in un qualcosa che non può essere fatto con una sola azione (posizionarsi in alto per una parola chiave) in attività più piccole che hanno però la capacità di influenzare la riuscita del tutto.Importante tanto quanto definire gli obiettivi più piccoli e realizzabili, è definire il modo in cui andrai a misurarli. Nell’esempio qui sopra, utilizziamo il Site Explorer di Ahrefs per misurare quanti backlink acquisiamo.Approfondisci: Come Definire i Giusti Obiettivi SEO — con 3 EsempiRisorse di cui hai bisognoRisorse significa costi, e le startup devono fare particolare attenzione a questo frangente. Anche se la SEO non richiede nessun budget per gli annunci o tool super costosi, non è un processo completamente gratuito.La SEO ha bisogno di ciò per funzionare:RicercaContenuti ottimizzatiBacklinkTool di misurazioneSe tu stesso sei tutto il team e non hai budget per creare un team più largo o delegare, non c’è altro modo se non quello di imparare a fare tutte queste cose oltre a tutto quello che devi già fare. Ma non preoccuparti. Con i giusti consigli, definizione delle priorità e tool, si tratta di un qualcosa di fattibile.Se la tua startup ha budget per un ruolo correlato alla SEO, ecco le tue opzioni: Assumi qualcuno con tutte le skill descritte sopra – Questi sono o delle superstar o delle persone che hanno supervisionato diversi aspetti del marketing, possibilmente in un’altra startup. Le superstar sono probabilmente al di fuori del tuo budget, ma la seconda categoria non dovrebbe essere troppo complicata da identificare. Dopotutto il content marketing e la SEO sono strettamente legati. Assumi qualcuno che ha esperienza nello scrivere e ha interesse per la SEO – Dagli del tempo per imparare la SEO mentre la fanno. Esistono molte risorse online dove imparare, come la nostra Ahrefs Academy o questo stesso blog, entrambi completamente gratuiti. Assumi qualcuno che ha avuto un pò di successo con la SEO e dagli la possibilità di delegare – Un SEO professionale con esperienza dovrebbe essere in grado di creare una strategia per i contenuti. Potrebbero però aver bisogno di esternalizzare parte del processo (come la creazione di contenuti o la link building) per andare più veloce.Ora passiamo ai toolFortunatamente per le startup, esistono molti tool free e freemium nel mondo della SEO. Abbiamo raccolto una lista di 45 dei migliori di questi in questo articolo.Con i SEO tool in una startup hai due diverse opzioni: Utilizza quelli gratuiti (finchè puoi) – Puoi fare molto con i tool SEO gratuiti, come ti mostrerò in questa guida. Il punto è che dovrai sempre utilizzarne di diversi per ogni processo, e i dati saranno limitati. Prova diversi tool SEO premium – Una volta che hai fatto ciò, fai l’upgrade verso quello che più ti si addice. Se includi questo costo nelle fasi iniziali dei tuoi processi SEO, avrai dati aggiuntivi e funzionalità premium che aiuteranno te (e il tuo team) a lavorare più efficientemente sin dall’inizio.Passaggio 3. Imposta bene la tua technical SEOLa technical SEO è il processo di ottimizzazione per il tuo sito che aiuta motori di ricerca come Google a trovare, scansionare, comprendere e indicizzare le tue pagine. A meno che Google non riesca a fare tutto quello elencato qui sopra, le possibilità di posizionarti sono praticamente inesistenti.La versione breve e ideale per i principianti della technical SEO è la seguente: sistema tutte le problematiche che un tool come Ahrefs Webmaster Tools (AWT) identifica.Una delle molte funzionalità di AWT è monitorare la salute del tuo sito web analizzando oltre 100 problematiche SEO, incluse quelle tecniche. Se Google o altri motori di ricerca hanno un potenziale problema con la scansione e l’indicizzazione del tuo sito, AWT te lo farà probabilmente sapere.Ad esempio, potrebbe identificare come ci siano pagine con un tag noindex che fa in modo che i motori di ricerca non possano indicizzarle. Quando clicchi sulla problematica all’interno del report, otterrai una spiegazione di cosa significa e come sistemare l’errore:Per completare AWT, abbiamo un’intera sezione del nostro knowledge base dedicata alla comprensione e alla sistemazione delle problematiche SEO.Un’altra cosa molto forte di AWT è che anche se ti dimentichi di analizzare la salute del tuo sito regolarmente, riceverai comunque delle frequenti email (come quella qui sotto) che mostrano lo stato dell’arte degli errori:Approfondisci: Technical SEO: La Guida per PrincipiantiPassaggio 4. Fai una keyword research La keyword research è il processo all’interno del quale identifichi quello che i potenziali clienti cercano su Google, analizzando e confrontando questi termini in modo da dare priorità alle migliori opportunità.Puoi imparare come farlo nella nostra guida per principianti alla keyword research. Dato però che la maggior parte delle startup ha poca o nessuna “autorevolezza” o brand equity, consigliamo solitamente di andare a intercettare parole chiave a bassa difficoltà per le quali puoi posizionarti senza troppi backlink o un’alta autorevolezza a livello di sito.Quindi ad esempio, le aziende che fanno assicurazioni per animali avranno difficoltà a posizionarsi per una parola chiave come “assicurazione animali” (o “pet insurance” in inglese), in quanto la #1 pagina della SERP (la pagina dei risultati di ricerca) è dominata da pagine con molti backlink.Il nostro punteggio Keyword Difficulty, suggerisce che avresti bisogno di backlink da circa 932 siti per posizionarti nella top 10:Ma all’interno di quel vasto argomento, puoi identificare parole chiave a bassa competizione come “assicurazione animali per french bulldog” (o “french bulldog pet insurance” in inglese):Puoi trovare le parole chiave a bassa competizione in massa utilizzando un tool per fare keyword research come il Keywords Explorer di Ahrefs. Inserisci un argomento, vai nel report Matching terms e imposta un filtro per limitare la KD ad un massimo di 20:Come risultato per una parola chiave “seed” come “assicurazione animali” (o “pet insurance” in inglese), otterrai 426 potenziali parole chiave a bassa competizione attorno alle quali puoi creare contenuti:Nota che queste sono le tue parole chiave potenziali in quanto devi considerare altri fattori prima di selezionarle, ad esempio l’intento di ricerca, la brand equity dei competitor e il potenziale di traffico. Parliamo di questi fattori nella nostra guida alla ricerca di parole chiave a bassa competizione e in questo video.Oltre ciò, puoi anche prendere ispirazione dalle parole chiave a bassa competizione dei tuoi competitor.Ecco come identificarle con il Site Explorer di Ahrefs:Inserisci il dominio di un competitorPremi cercaVai nel report Parole chiave organiche 2.0Aggiungi un filtro KD con un valore massimo di 20Ad esempio, se hai una startup che propone software per i designer e competi con Invision, puoi trovare tutte queste parole chiave a bassa competizione per le quali loro sono posizionati:Si tratta poi di filtrare le parole chiave che vale la pena provare ad intercettare. In questo caso, potrebbe essere “palette colore rosso” (o “red color palette” in inglese), in quanto ha un KD basso ed un buon volume di ricerca. Inoltre, puoi facilmente creare la tipologia di contenuto che chi ricerca vuole sembrar trovare (una lista che propone diverse palette basate sul colore rosso da cui trarre ispirazione):Step 5. Crea contenutiOra che ti sei fatto un’idea di quali parole chiave intercettare, devi creare contenuti di alta qualità e ottimizzati che attraggano traffico organico. Ci sono diversi pezzi del puzzle da incastrare.A. Assicurati di comprendere la tua audienceSapere quello che le persone cercano online è di valore. Fare affidamento solo sulle metriche SEO può però far perdere l’attenzione rispetto alle persone che leggono i tuoi contenuti. Questo è il motivo per il quale certe volte devi espandere la tua ricerca e affiancare i tuoi dati SEO ad una ricerca di mercato.L’elemento che ha un peso critico all’interno della tua go-to market strategy sulla scelta dei contenuti è la tua audience principale. Assicurati quindi di avere le tue buyer persona pronte prima di creare il tuo primo contenuto SEO.Una buyer persona è una persona parzialmente fittizia che rappresenta le caratteristiche comuni ai tuoi clienti (archetipo). Eccone un esempio per il nostro prodotto:B. Realizza i contenuti tenendo a mente l’intento di ricercaL’intento di ricerca si riferisce a quello che chi ricerca vuole trovare. È importante in quanto Google vuole posizionare contenuti che siano utili, quindi ci sono ampie probabilità che non ti posizionerai a meno che i tuoi contenuti non si allineino con l’intento dell’utente.Per comprendere l’intento di ricerca dietro una parola chiave, dovresti analizzare i risultati in funzione di quello che noi chiamiamo le tre C dell’intento di ricerca: Tipologia del contenuto – Esiste una tipologia di contenuto che domina la SERP, come articoli di blog, pagine prodotto, video o landing page? Formato del contenuto – Esiste un formato di contenuto che domina la SERP, come guide, listi, news, pezzi d’opinione o recensioni? Angolo del contenuto – Esiste un angle di contenuto che domina la SERP, come contenuti aggiornati di recente o contenuti per i principianti?Facciamo una veloce analisi di un esempio. Ecco cosa possiamo trovare per “SEO tools” negli US dopo aver inserito la parola chiave nel Keywords Explorer di Ahrefs:Puoi identificare le tre C in questo caso? Tipologia del contenuto: Quasi tutti sono articoli di blog. Formato del contenuto: Quasi tutti sono in formato lista. Angolo del contenuto: Quasi tutte sono liste di tool gratuiti.Se non utilizzi il Keywords Explorer puoi utilizzare la nostra Toolbar SEO gratuita per visualizzare la SERP di praticamente ogni Paese:C. Pianifica, pubblica e riproponiProbabilmente hai dozzine di idee per i contenuti arrivato a questo punto. Quindi come farai a gestire e creare tutti quei contenuti?Una pratica di comune utilizzo consiste nell’avere un calendario editoriale. Si tratta di un sistema per organizzare, gestire e pianificare la produzione dei contenuti.Non esiste un modo univoco di creare un calendario editoriale. Prima di tutto, un calendario editoriale dovrebbe essere ideale per te e il tuo team. Puoi utilizzare Google calendar, creare un kanban su app come Notion o Trello, creare progetti come in Asana o addirittura utilizzare un vecchio e amato foglio di calcolo.Ecco alcune delle informazioni che vale la pena avere in un calendario editoriale:TematicaAutoreAssegnatarioStatoDeadlineMetadati necessari (potenziale aziendale, fase del funnel, persona target, ecc..) FormatpCanaleLink al documento in scritturaIn Ahrefs, utilizziamo Notion per tener traccia di tutto in un unico luogo (il calendario, gli allegati, commenti, ecc). Ecco una card del calendario editoriale per un articolo che abbiamo fatto:Quando si tratta della scrittura vera e propria, della registrazione o della creazione del contenuto, è una questione molto personale. Dopotutto le persone hanno diversi modi di scrivere ed essere creativi. Specialmente nelle piccole startup, le attività tendono a consentire un ampio raggio di autonomia, quindi la maggior parte delle cose sarà “a tua discrezione”.In ogni caso, quando si tratta di creare contenuti aziendali, è un’ottima idea quella di sviluppare una sorta di metodologia e ottenere del feedback prima di pubblicare. Un valore aggiuntivo di ciò è che sviluppare flussi efficaci dall’inizio renderà più semplice scalare i contenuti più avanti. Ecco alcuni consigli: Parti sempre con uno schema – Pianifica quello che dirai. Questo ti aiuterà ad evitare di scrivere riguardo cose irrilevanti o scrivere troppo o troppo poco. Cerca consigli su scrittura/registrazione/editing – Questo può aiutarti in diversi modi: migliorando la produttività, scrivendo in modo più efficace, o qualsiasi altra cosa di cui senti di avere bisogno. Esistono metodi ben testati da provare, come quello della piramide invertita (inserendo il “necessario da sapere” prima delle “informazioni aggiuntive”). Crea delle standard operating procedures (SOPs) man mano – Le SOP sono documenti che spiegano come svolgere specifiche attività, come ad esempio rinominare le immagini. Chiaramente le SOP non sono così importanti per un team costituito da una persona. Ma ogni persona aggiunta in seguito al processo di creazione contenuti mette più urgenza alla necessità di creazione delle SOP. Cerca feedback – Perché fa sempre bene ottenere un secondo parere.Se ti stai chiedendo com’è il processo di creazione dei contenuti a Ahrefs, ecco un grafico che lo mostra:Per rendere le cose ancor più efficienti, puoi riproporre alcuni contenuti fra i diversi canali, in modo da sfruttare al massimo ogni pezzo. Questa strategia funziona molto bene sia per le startup che per le aziende affermate, noi lo facciamo costantemente.Ad esempio abbiamo un video e un tweet riguardo le parole chiave a coda lunga, entrambi ottenuti dall’originale articolo di blog.Step 6. Ottimizza i contenuti esistentiTalvolta il miglior modo di ottenere più traffico organico è ottimizzare i contenuti esistenti. Ci sono due motivi dietro tale affermazione:I tuoi contenuti esistenti potrebbero essere già posizionati.I tuoi contenuti esistenti potrebbero essere il miglior modo di intercettare il giusto intento di ricerca.Ad esempio, Google ha un modello piuttosto chiaro di quello che posiziona per “stampanti 3d” (o “3d printers” in inglese): guide all’acquisto. Addirittura posiziona le guide più in alto rispetto a pagine di produttori ben noti di stampanti 3d nonostante questi abbiano più backlink:Sembra che la maggior parte delle persone che cerca questo termine sia in modalità acquisto. Di conseguenza, Google prova a far combaciare l’intento con le pagine che offrono aiuto sull’acquisto di una stampante 3D.Quello che è interessante è che uno dei produttori di stampanti 3D riesce a posizionarsi in altro fra le guide: Formlabs. Ha infatti trovato un modo di ottimizzare il contenuto esistente per portarlo il più in alto possibile all’interno della SERP.Tutto questo creando un misto fra una guida e una pagina di categoria di prodotto sulla stampante 3D.Hai notato quello che è stato fatto?Hanno chiamato la pagina “Guida alla Stampante 3D: Tipologie di Stampante 3D, Materiali e Applicazioni”.Hanno fornito alcune informazioni base, spiegato il processo di stampa 3D, mostrato le tipologie di stampante 3D, dato alcuni consigli su come sceglierne una, ecc.. Questo è più o meno quello che ti aspetteresti da una guida. Ma allo stesso tempo, le uniche stampanti 3D che vedi sono prodotte da Formlabs. Inoltre, sono esattamente la prima cosa che vedi prima di scorrere in basso nella parte relativa alla guida vera e propria.Dal punto di vista navigazionale, questa è la pagina prodotto principale di Formlabs. Per questo motivo, chiunque voglia linkare all’assortimento di stampanti 3D Formalabs dovrà linkare a questa pagina, probabilmente con un anchor text che sarà qualche variazione di “stampante 3D”.In aggiunta, questa pagina agisce da content hub, distribundo “link juice” fra le altre parti del sito Formlabs.Qual è l’effetto di tutto ciò dal punto di vista SEO?La pagina è ottimizzata per una parola chiave dall’alto “potenziale aziendale”: “stampanti 3d”.Dato che la parola chiave ha un Parent Topic con un alto volume di ricerca e lo stesso intento, “stampante 3d” si posiziona bene anche per quell’intento.La pagina ottiene una quantitá significativa di traffico organico dalla parola chiave “stampanti 3d” (o “3d printers” in inglese) e ancora più traffico da “stampante 3d” (o “3d printer” in inglese), come puoi vedere dallo screenshot qui sotto:Un’altro esempio: Canva si posiziona #4 negli US per la parole chiave “generatore di meme”, con questa landing page. Come potrai immaginare, non c’è bisogno per Canva di creare, diciamo, un articolo di blog per posizionarsi per quella parola chiave.Puoi approfondire riguardo l’ottimizzazione dei contenuti esistenti nella terza parte della nostra guida alla SEO on-page per principianti.Step 7. Ottieni linkQuando i tuoi contenuti SEO sono completi, è necessario iniziare a muovere le cose riguardo il più importante dei fattori di posizionamento: i link.Linka internamentePartiamo con qualcosa di semplice: linka le diverse pagine fra di loro sullo stesso sito.Ecco cosa succede quando crei dei link interni: Aiuti i motori di ricerca a scoprire le pagine – Questo in quanto fornisci un percorso di scansione verso la nuova pagina. Passi autorevolezza fra le varie pagine – In questo modo puoi dare una spinta alle pagine meno performanti. Aiuti i motori di ricerca a comprendere di cosa parla una determinata pagina– Questo è importante in quanto devi fare in modo che Google comprenda il significato del tuo contenuto se vuoi che si posizioni per parole chiave pertinenti.Puoi identificare le possibilità opportunità di inserimento di link interni attraverso il report Link Opportunities all’interno di Ahrefs Webmaster Tools. Mostra parole chiave non linkare che potrebbero essere utilizzate come link verso un’altra pagina.Ad esempio, in un articolo di blog sui rank tracker, AWT suggerisce di inserire un link sulla parola chiave “keyword research” verso la lista di “tool per la keyword research”.Esistono altre buone strategie per fare link interni. Abbiamo raccolto le più importanti all’interno di Link Interni per la SEO: una Guida da Applicare.Spia i link dei tuoi competitorA meno che tu non sia in un mercato nuovo e sconosciuto, avrai qualcuno di cui seguire le tracce. In altre parole, un’altra azienda che ha già fatto la sua keyword research, creato contenuto e ottenuto link verso il suo sito.Al momento i tuoi competitor potrebbero precederti di qualche passo, ma la buona notizia è che puoi analizzarli e rubare alcune delle loro idee. Interessante vero?Questa strategia di link building consiste nell’analizzare i link dei competitor per comprenderne due aspetti: Link che puoi replicare – Alcuni dei link dei tuoi competitor potrebbero venire da fonti che potrebbero linkare anche te, come una lista delle migliori app, recensioni, ecc… Puoi contattare queste fonti e proporti come candidato per un link. Pattern nella tipologia di backlink – Puoi studiare quali tipologie di link hanno aiutato i tuoi competitor a posizionarsi e vedere quali strategie e tattiche potrebbero quindi funzionare anche per te. Ad esempio, potresti scoprire che un competitor ha ottenuto molti backlink creando uno studio unico che altri siti citano e linkano.Ottieni recensioniOttenere recensioni online del tuo prodotto ha chiari vantaggi: brand e product awareness, traffico e, spesso, feedback di valore sul prodotto. Ma c’è un altro vantaggio nascosto: i backlink.Poniamo caso che tu sia una startup tech che fa motorini elettrici. Ecco alcune idee su come cercare siti di recensioni:Inserisci la URL del sito del tuo competitor all’interno del Site Explorer di Ahrefs e recati nel report chiamato Backlinks, filtrando i risultati per URL referral che contengono parole come “recensione”, “guida” o “migliore” (rispettivamente “review,” “guide,” o “best” in inglese). Questo ti mostrerà i siti che hanno recensito il tuo competitor. Puoi ora analizzare i risultati e proporre il tuo prodotto ai siti che ti colpiscono.Un consiglio: non chiedere una recensione in cambio di un backlink. Prima di tutto pensa al modo in cui la recensione potrebbe riflettersi sulle vendite del tuo prodotto, e fallo solo se il tuo prodotto è pronto. I backlink sono solo un bonus in questo gioco.Digital PRAvere la tua azienda menzionata dalla stampa è fantastico. Ma in aggiunta, puoi dare una spinta al tuo posizionamento attraverso i link inclusi nella storia.Le startup spesso hanno il vantaggio della novità, che le rende ottime candidate per ricevere copertura mediatica. Ecco un esempio di storia tratto da The Next Web su di una startup chiamata Spring che ha creato un tool basato su IA mai visto prima (e che chiaramente include un link verso l’azienda).Alcuni dei link che trovi in questo modo saranno “nofollow”, e probabilmente non passerano alcuna “autorevolezza”, ma questo non dovrebbe dissuaderti. Anche se un link non spinge direttamente il posizionamento, ci sono possibilità che la storia porti a menzioni da parte di altri siti; oltre a darti ulteriore visibilità, questi possono migliorare il tuo posizionamento.Ecco alcuni altri consigli sul come ottenere copertura mediatica per la tua storia (e ottenere un link): Rispondi alle richieste dei giornalisti su siti come HARO, ResponseSource, ProfNet, o SourceBottle. Puoi anche cercare hashtag Twitter come #journalrequest. In questo modo puoi venir citato e richiedere di inserire un link nella tua bio. Scrivi e proponi comunicati stampa verso dei gestori affidabili e con una buona reputazione. Non esagerare, o verrai ignorato la prossima volta che proponi qualcosa. Prova anche a concentrarti su notizie che valgono la pena di essere chiamate tali. Probabilmente puoi venir menzionato più di frequente su magazine di settore, quindi puoi proporti a questa tipologia di siti con maggiore frequenza. Prova ad includere qualcosa che sia “degno di link” nella tua proposta, come dei dati unici. Non dimenticarti di fornire immagini di alta qualità.Ulteriori approfondimenti La Guida alla Link Building per Principianti (2021) 9 Semplici Strategie di Link Building (che Chiunque può Utilizzare) Link Building con Pagine Risorse: la Guida Definitiva3 Tattiche di Link Building White Hat che Vanno Oltre i Meri Link Guest Blogging per la SEO: Ottenere Link di Alta Qualità in MassaStep 8. Traccia e misura Infine, come fai a misurare il successo nella SEO? Quali metriche dovresti tracciare?La risposta dipende tutta dagli obiettivi che ti sei prefissato, di cui ho parlato nel secondo passaggio di questa guida.A seconda dei tuoi obiettivi, le metriche SEO che traccerai più di frequente sono: Traffico organico – Il numero di visite che ottieni dalle SERP. Puoi misurare questo dato utilizzando dei software di analytics come Google Analytics, Matomo, Google Search Console e Ahrefs. Parole chiave organiche – Le parole chiave per le quali le tue pagine si posizionano. Alcuni tool di analytics (come Google Analytics) nascondono alcuni dati per le parole chiave come “non fornito”, mentre altri (come Google Search Console) ne mostreranno un numero limitato. Altri tool come AWT mostreranno tutto. Posizione delle parole chiave – Dove ti posizioni nella SERP per le parole chiave tracciate nel corso del tempo. Per una soluzione basica e gratuita, utilizza il nostro tool di rank tracking gratuito. Backlink – Link verso il tuo sito provenienti da altri siti. Come ho già menzionato, i backlink sono uno dei più importanti fattori di posizionamento. Per tracciare fino a 100 backlink gratuitamente verso ogni sito, utilizzano il backlink checker gratuito di Ahrefs.Puoi trovare facilmente tool gratuiti per tracciare le metriche più importanti. Le versioni a pagamento solitamente ti consentono di analizzare più dati, utilizzare filtri avanzati e ottenere più informazioni (come dati storici e trend).ConclusioneNon hai bisogno di un grosso budget per iniziare a far crescere il tuo traffico organico con la SEO. Puoi andare piuttosto avanti con i tool gratuiti e i tool di cui avrai bisogno da quel punto in poi non costeranno troppo. Se hai i fondi per un tool SEO premium, considerane uno all-in-one come Ahrefs, che ha tutto quello di cui hai bisogno in un solo posto.Come con molte altre cose nella vita, l’inizio è sempre la parte più difficile. Potrebbe volerci del tempo per far partire la tua SEO. Ma una volta che inizi, puoi utilizzare le stesse tattiche quante volte vuoi, per ottenere risultati che si moltiplichino nel tempo.Tutto quello di cui abbiamo parlato in questa guida potrebbe essere molto da ricordare. In qualunque momento tu abbia bisogno di rinfrescare la memoria sulle cose più importanti, dai uno sguardo alla nostra checklist SEO.Domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO per Startup: 8 Passaggi per Farla in Economia"
    },
    {
      "level": "H2",
      "text": "Perché le startup dovrebbero investire nella SEO?"
    },
    {
      "level": "H3",
      "text": "Motivo 1. Per via del trend principale"
    },
    {
      "level": "H3",
      "text": "Motivo 2. Perché le persone cercano quello che offri"
    },
    {
      "level": "H3",
      "text": "Motivo 3. Perché puoi ottenere traffico gratuito e scalarlo"
    },
    {
      "level": "H2",
      "text": "Come fare SEO per startup"
    },
    {
      "level": "H3",
      "text": "Passaggio 1. Ottieni l’approvazione"
    },
    {
      "level": "H3",
      "text": "Passaggio 2. Definisci obiettivi e risorse"
    },
    {
      "level": "H4",
      "text": "Come definire gli obiettivi"
    },
    {
      "level": "H4",
      "text": "Risorse di cui hai bisogno"
    },
    {
      "level": "H3",
      "text": "Passaggio 3. Imposta bene la tua technical SEO"
    },
    {
      "level": "H3",
      "text": "Passaggio 4. Fai una keyword research"
    },
    {
      "level": "H3",
      "text": "Step 5. Crea contenuti"
    },
    {
      "level": "H4",
      "text": "A. Assicurati di comprendere la tua audience"
    },
    {
      "level": "H4",
      "text": "B. Realizza i contenuti tenendo a mente l’intento di ricerca"
    },
    {
      "level": "H4",
      "text": "C. Pianifica, pubblica e riproponi"
    },
    {
      "level": "H3",
      "text": "Step 6. Ottimizza i contenuti esistenti"
    },
    {
      "level": "H3",
      "text": "Step 7. Ottieni link"
    },
    {
      "level": "H4",
      "text": "Linka internamente"
    },
    {
      "level": "H4",
      "text": "Spia i link dei tuoi competitor"
    },
    {
      "level": "H4",
      "text": "Ottieni recensioni"
    },
    {
      "level": "H4",
      "text": "Digital PR"
    },
    {
      "level": "H3",
      "text": "Step 8. Traccia e misura"
    },
    {
      "level": "H2",
      "text": "Conclusione"
    }
  ],
  "author": "Mateusz Makosiewicz"
}