{
  "url": "https://ahrefs.com/blog/it/seo-copywriting/",
  "slug": "seo-copywriting",
  "title": "SEO Copywriting: Cos'è E Come Farlo",
  "description": "Con SEO copywriting si intende la creazione di contenuti di qualità che si rivolgono ai motori di ricerca e agli utenti Scopri come si fa.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Combinare tecniche SEO e di copywriting può aiutarti a posizionarti in alto su Google e su altri motori di ricerca e anche a incrementare le vendite.In questo post imparerai cosa si intende per scrittura SEO, o SEO copywriting, e come farla.ContenutiCos’è il SEO copywriting?ISEO copywriting vuol dire creare contenuti di alta qualità che piacciono sia agli algoritmi dei motori di ricerca che agli utenti. Si tratta di scrivere contenuti pensati per posizionarsi in alto su Google e, allo stesso tempo, contenuti che le persone vogliono consumare, linkare e condividere sui social media.Perché il SEO Copywriting è importante?I contenuti che si posizionano e ottengono tantissimo traffico di ricerca ma non spostano gli obiettivi di business sono inutili. Così come sono inutili i contenuti accattivanti che non ricevono traffico.Ma se riesci a fondere insieme solidi fondamenti SEO e buone tecniche di copywriting, puoi creare contenuti di valore che si posizionano ai primi posti sui motori di ricerca e invogliano gli utenti al consumo, alla condivisione e persino all’acquisto.Questo è esattamente il modo grazie al quale abbiamo portato Ahrefs a 2,4 milioni di visite di ricerca mensili, generando al contempo entrate ricorrenti annuali (ARR) pari a otto cifre. È il fulcro della nostra strategia di contenuti SEO.Come fare SEO CopywritingCi sono tre fasi quando si parla di scrittura SEO:Fase 1. RicercaQuesta fase riguarda la scelta di cosa scrivere. Ecco alcuni suggerimenti per fare copywriting SEO in questa fase:1. Inizia dalla ricerca parole chiaveSe vuoi traffico organico, devi scrivere di argomenti ricercati dal tuo pubblico di destinazione. Quindi, prima di mettere nero su bianco, devi avere un elenco di parole chiave pertinenti da targetizzare.Il modo più semplice per farlo è utilizzare uno strumento di ricerca per parole chiave. Ecco come:Vai sul Keywords Explorer di AhrefsInserisci parole chiave specifiche pertinenti al tuo sitoVai sul report Termini CorrispondentiScorri l’elenco e cerca le parole chiave pertinenti che potresti coprire. Ad esempio, questa parola chiave sarebbe perfetta per un’azienda di materassi che lavora in inglese:Ulteriori approfondimentiKeyword Research: La Guida per Principianti2. Fai corrispondere alla parola il suo intento di ricercaGoogle vuole posizionare solo i contenuti pertinenti. E la maggior parte delle persone solitamente cerca uno di questi tipi di contenuti su Google:Blog postVideoPagine prodottoPagine categoriaStrumentoQuindi, se vuoi avere le migliori possibilità di posizionarti in alto nei motori di ricerca, devi allinearti con l’intento di ricerca.Puoi scoprirlo guardando le pagine in alto nella SERP.Per esempio se analizziamo la Panoramica SERP per la keyword “how to sleep better,” possiamo vedere che si tratta per lo più di post di blog basati su elenchi:Questo è ciò che dobbiamo creare se decidiamo di lavorare su questo termine di ricerca.Ulteriori approfondimentiCos’è l’intento di ricerca? Una guida completa per principianti3. Crea uno schema basato sui datiOgni argomento genera naturalmente dei sottoargomenti. Più argomenti secondari pertinenti tratti, più è probabile che ti posizionerai per più parole chiave e riceverai più traffico.Puoi trovare questi argomenti secondari esaminando i posizionamenti delle parole chiave comuni tra le pagine che si posizionano più in alto. Questo è anche un buon modo per costruire la struttura del tuo post.Ecco come trovare questi argomenti secondari:Vai sul Keywords Explorer di AhrefsInserisci la tua parola chiaveVai su Panoramica SERPControlla alcune delle pagine in altoClicca su Apri in e scegli Gap di ContenutoIn questo modo aprirai il rapporto Gap di Contenuto, dove vedrai i posizionamenti delle parole chiave comuni tra queste pagine. Guarda i risultati per vedere se ci sono argomenti secondari che puoi trattare.Ad esempio, se stiamo creando contenuti sull’argomento “how to sleep better,” questi potrebbero essere buoni H2:Di quante ore di sonno hai bisognoIgiene del sonnoOre di sonno per etàCome ottenere un sonno profondoConsigli per addormentarsi4. Fai risaltare i tuoi contenuti dandogli un tocco unicoI link sono un importante fattore di ranking per Google. Se i tuoi contenuti sono come quelli di tutti gli altri, non c’è motivo per cui qualcuno linki il tuo invece che quello di altri.Fare SEO copywriting significa trovare un equilibrio tra dare agli utenti ciò che vogliono e dare loro qualcosa di unico e originale.Un modo per aggiungere un tocco unico è scrivere in base all’esperienza personale.Le persone vogliono suggerimenti e consigli reali, provati e testati, non generici. Anche Google lo capisce. Ecco perché ha introdotto E‑E-A‑T, dove la prima “E” sta per esperienza.Quindi, se vuoi dare consigli sul sonno, provali prima di scriverne. Ad esempio, quando ho scritto sull’essere un creatore di contenuti, l’ho scritto in base alla mia esperienza.5. Arriva al dunque con il metodo della “piramide rovesciata”Alcune persone vogliono solo sapere qual è la migliore padella antiaderente. Ed è proprio quello che Wirecutter dice loro:Per tutti gli altri, c’è più spiegazione di seguito.Questo formato è noto come piramide rovesciata, dove si svela l’essenziale prima del resto:Dal punto di vista SEO, dare ai lettori ciò che desiderano immediatamente può aiutare a ridurre il pogo-sticking e migliorare il tempo di permanenza.Ad esempio, io ho definito immediatamente “creazione di contenuti digitali” nel mio post:6. Costruisci la tua credibilità Google sa che le persone vogliono imparare a fare sollevamento pesi da un personal trainer, non da una persona a caso per la strada.Ecco perché Google ha introdotto E‑E-A‑T, dove la seconda “E” sta per competenza (expertise in inglese). Pur non essendo fattori di ranking diretti, i valutatori umani di Google li utilizzano per capire la qualità dei risultati di ricerca.Quindi la cosa importante è provare cosa stai dicendo. Ad esempio, gli articoli di Wirecutter includono una sezione su “Perché dovresti fidarti di me”:Se non hai le competenze richieste per la tua parola chiave target, intervista qualcuno che le possiede. Questo è quello che abbiamo fatto quando abbiamo scritto un post sul blog sulle penalizzazioni di Google:Ecco come trovare esperti se non sai a chi rivolgerti:Vai sul Content Explorer di AhrefsInserisci la tua parola chiaveClicca sulla voce AutoriQuesto ti mostrerà un elenco di persone che hanno pubblicato contenuti sull’argomento.Fase 2. ScritturaQuesta fase consiste nel mettere le dita sulla tastiera e iniziare a scrivere. Ogni persona ha il proprio stile, ma i copywriter SEO di solito hanno gli stessi obiettivi: creare contenuti di alta qualità che istruiscano, intrattengano e piacciano ai lettori in modo che compiano un’azione di conversione.Ecco alcuni suggerimenti per il copywriting SEO che puoi utilizzare:7. Coinvolgi i lettori con la formula PASLa tua introduzione deve attirare i lettori e interessarli a leggere il resto. Puoi farlo con la formula Problem-Agitate-Solution (PAS).Prima di tutto, definisci il problema:Quindi crea agitazione:Infine rivela la soluzione:8. Utilizza parole e frasi che invitano alla letturaUtilizza parole e frasi di transizione che incoraggiano i lettori a continuare a leggere e che incuriosiscono lasciando intenzionalmente le cose irrisolte.Ecco alcuni esempi in inglese:Dai un’occhiata a questo post per ulteriori esempi, tenendo conto che si tratta di esempi in inglese per cui non necessariamente rappresentativi.9. Rendi i tuoi contenuti ancora più utili aggiungendo una sezione FAQLe persone diventano naturalmente più curiose mentre ricercano un argomento. Potrebbero avere tonnellate di domande correlate. Ma può essere difficile rispondere a tutte senza interrompere il flusso del tuo articolo.Per risolvere questo problema, crea una sezione FAQ. Rispondere alle domande più frequenti sulla tua pagina può aiutarti a posizionarti più in alto per le parole chiave a coda lunga. Ad esempio, questo è ciò che abbiamo fatto nel nostro post sui tag H1:Because we answered a common question, we now rank on Google when people are searching for this answer:Ecco come trovare le domande frequenti a cui rispondere:Vai su Keywords ExplorerInserisci il tuo argomentoVai su Termini CorrispondentiSeleziona “Domande”Fase 3. EditingLa fase finale consiste nel migliorare la tua bozza e assicurarti che ciò che hai scritto sia ciò che vuoi dire.Ecco alcuni consigli:10. Ottimizza per gli snippet in primo pianoGli snippet in primo piano sono risposte rapide nei risultati di ricerca che Google estrae da una pagina posizionata tra le prime 10.Puoi raggiungere la prima posizione tramite questa scorciatoia se riesci a “catturare” lo snippet in primo piano. Quindi pianificalo controllando se esiste uno snippet in primo piano per la tua parola chiave principale e cosa è necessario per fare in modo che diventi tuo.Ad esempio, se cerchiamo “marketing funnel” in inglese, notiamo che Google mostra una definizione:Se vogliamo ottenere lo snippe in primo piano, dobbiamo includere una definizione, cosa che abbiamo fatto:11. Scrivi come parliNiente grida “smettila di leggere” più dei testi copiati, dei discorsi aziendali e del gergo senza senso. Il linguaggio complesso allontana i lettori e li riporta alle SERP.I testi per il web devono essere semplici e informali. Immagini di parlare con una persona amica.Se temi che il tuo testo SEO sembri troppo poco naturale, incollalo in Hemingway (controlla se funziona in italiano):Ti fornirà un punteggio di leggibilità e suggerimenti su come migliorare.12. Semplifica la lettura modificando con la formula ASMRLeggere è una transazione. I tuoi lettori stanno scambiando il loro tempo per le tue parole. Se leggere è un lavoro difficile, torneranno “Indietro”.Quindi assicurati che i tuoi contenuti siano facili e agevoli da leggere. Puoi farlo seguendo la formula ASMR.Innanzitutto, aggiungi annotazioni. Includere elementi come note a margine, citazioni e link dai social media può spezzare la monotonia:Quindi utilizza frasi e paragrafi brevi. Suddividi le frasi lunghe in frasi brevi usando parole di transizione (ad esempio “e”, “quello”).In terzo luogo, includi i contenuti multimediali. L’inserimento di video, immagini e GIF può illustrare i tuoi punti senza aggiungere parole extra, come questo diagramma di flusso:​Alla fine, leggi il tuo testo ad alta voce per individuare le aree in cui i tuoi contenuti non scorrono in modo fluido.Suggerimenti bonus per fare copywriting SEOQuesti suggerimenti extra per fare copywriting SEO possono aiutarti a migliorare i tuoi contenuti.13. Includi un sommarioI lettori vogliono sapere se i tuoi contenuti soddisfano ciò che stanno cercando. Puoi rendere semplice questo compito a farlo aggiungendo un sommario (ToC):Ciò consente loro di accedere alla sezione desiderata. Una volta che hanno iniziato a leggere, potrebbero essere risucchiati dal tuo testo e leggere il resto dei tuoi contenuti.L’aggiunta di un sommario può anche creare sitelink per la tua pagina, che Google a volte mostra nei risultati:Ciò può potenzialmente portare a più clic.14. Ottieni più clic creando titoli accattivantiIl titolo è una delle prime cose che chi cerca online vede. Quindi deve invogliare a cliccare.Il modo più semplice per creare titoli accattivanti è utilizzare il nostro generatore di titoli gratuito, verificando che funzioni in italiano. Aggiungi un messaggio, scegli un tono e fai clic su “Genera titolo”:Riceverai un suggerimento per il titolo, che potrai migliorare:Ulteriori approfondimentiCome Creare il Titolo SEO Perfetto in 4 PassaggiStrumenti per fare copywriting SEOGli strumenti sono i tuoi migliori amici quando si tratta di copywriting SEO. Ti aiutano a creare contenuti in modo più efficiente. Questi sono gli strumenti di copywriting SEO che consigliamo (alcuni potrebbero funzionare solo in inglese):Ahrefs – Strumenti SEO che ti aiuteranno a ricercare parole chiave, trovare idee e lacune nei contenuti, scoprire persone da contattare, ricercare i tuoi concorrenti, monitorare i posizionamenti e altro ancora.Google Search Console – Verifica se ti stai posizionando per le tue parole chiave target e stai generando traffico organico.Ahrefs’ free AI writing tools – Una raccolta di strumenti di copywriting basati sull’intelligenza artificiale che possono aiutare a generare idee per strutture, paragrafi, titolo, meta descrizioni e altro ancora.Grammarly – Correggi gli errori grammaticali e migliora la tua scrittura.Hemingway – Semplifica i tuoi contenuti e migliorane la leggibilità.ChatGPT – Crea schemi e brief per contenuti, correggi i tuoi contenuti SEO, genera titolo e meta descrizioni, trova parole chiave a coda lunga e altro ancora.FAQEcco una domanda frequente sul copywriting SEO:Qual è la differenza tra scrittura SEO, SEO copywriting e copywriting?La scrittura SEO e il SEO copywriting sono la stessa cosa. Il copywriting utilizza le parole per convincere qualcuno ad agire, per esempio effettuare un acquisto o iscriversi a una newsletter.ConclusioniContent writers e content marketer, prendete nota: la SEO non riguarda solo un migliore posizionamento su Google. Si tratta anche di convincere i tuoi lettori a leggere, condividere e linkare i tuoi contenuti.Ecco perché il SEO copywriting è importante. Nessuno leggerà un contenuto spazzatura, non importa quanto in alto sia sui motori di ricerca.Hai domande? Scrivimi su Twitter o Threads. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Copywriting: Cos’è E Come Farlo"
    },
    {
      "level": "H2",
      "text": "Cos’è il SEO copywriting?"
    },
    {
      "level": "H2",
      "text": "Perché il SEO Copywriting è importante?"
    },
    {
      "level": "H2",
      "text": "Come fare SEO Copywriting"
    },
    {
      "level": "H3",
      "text": "Fase 1. Ricerca"
    },
    {
      "level": "H4",
      "text": "1. Inizia dalla ricerca parole chiave"
    },
    {
      "level": "H4",
      "text": "2. Fai corrispondere alla parola il suo intento di ricerca"
    },
    {
      "level": "H4",
      "text": "3. Crea uno schema basato sui dati"
    },
    {
      "level": "H4",
      "text": "4. Fai risaltare i tuoi contenuti dandogli un tocco unico"
    },
    {
      "level": "H4",
      "text": "5. Arriva al dunque con il metodo della “piramide rovesciata”"
    },
    {
      "level": "H4",
      "text": "6. Costruisci la tua credibilità"
    },
    {
      "level": "H3",
      "text": "Fase 2. Scrittura"
    },
    {
      "level": "H4",
      "text": "7. Coinvolgi i lettori con la formula PAS"
    },
    {
      "level": "H4",
      "text": "8. Utilizza parole e frasi che invitano alla lettura"
    },
    {
      "level": "H4",
      "text": "9. Rendi i tuoi contenuti ancora più utili aggiungendo una sezione FAQ"
    },
    {
      "level": "H3",
      "text": "Fase 3. Editing"
    },
    {
      "level": "H4",
      "text": "10. Ottimizza per gli snippet in primo piano"
    },
    {
      "level": "H4",
      "text": "11. Scrivi come parli"
    },
    {
      "level": "H4",
      "text": "12. Semplifica la lettura modificando con la formula ASMR"
    },
    {
      "level": "H2",
      "text": "Suggerimenti bonus per fare copywriting SEO"
    },
    {
      "level": "H3",
      "text": "13. Includi un sommario"
    },
    {
      "level": "H3",
      "text": "14. Ottieni più clic creando titoli accattivanti"
    },
    {
      "level": "H2",
      "text": "Strumenti per fare copywriting SEO"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "Qual è la differenza tra scrittura SEO, SEO copywriting e copywriting?"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}