{
  "url": "https://ahrefs.com/blog/it/seo-audit/",
  "slug": "seo-audit",
  "title": "Come Fare Un Audit SEO In 11 Semplici Passaggi",
  "description": "Un audit SEO ti aiuta a trovare e risolvere i problemi SEO che potrebbero ostacolare il tuo sito. Scopri come farlo nel modo giusto.",
  "content": "Chris Haines Chris è un SEO Director e ha 10 anni di esperienza nel settore, lato agenzia. Quando non ha a che fare con la SEO, gli piace giocare con sintetizzatori vintage, passeggiare su spiagge sabbiose e bere una buona tazza di tè. Contenuti Se il tuo sito non si posiziona bene sui motori di ricerca, potrebbe essere per colpa di alcuni problemi SEO che ne ostacolano il posizionamento.Trovando e risolvendo questi problemi, puoi spesso migliorare i tuoi posizionamenti e ottenere più traffico organico. È qui che entra in gioco un audit SEO.ContenutiCos’è un audit SEO?Un audit SEO verifica quanto un sito è ottimizzato per i motori di ricerca. Trova problemi che potrebbero danneggiare il posizionamento del sito e offre opportunità per migliorarlo.Ad esempio, ecco un sito che sembra difficile da utilizzare su un dispositivo mobile.Poiché l’ottimizzazione per i dispositivi mobili è un fattore di ranking per Google e ci sono più ricerche da mobile che da desktop, questo problema potrebbe frenare il sito.Ecco altri vantaggi derivanti dal completamento di un audit SEO:Ti consente di stare al passo con i tuoi concorrentiMigliora l’esperienza utente dei visitatori del tuo sitoPuò identificare preziose opportunità SEO che possono massimizzare il ritorno sull’investimentoTi consente di perfezionare la tua strategia SEOTi consente di comunicare l’importanza della SEO alle parti interessate nella tua aziendaDi quali strumenti hai bisogno per un SEO audit?Esistono molti strumenti diversi che puoi utilizzare per completare un audit SEO, ma il modo più semplice per iniziare è utilizzare due strumenti gratuiti che coprono tutte le nozioni di base:Ahrefs Webmaster Tools (AWT)Google Search Console (GSC)Come fare un audit SEOIl processo per fare un audit SEO è diverso per sito e specialista, ma ecco come puoi creare il tuo audit SEO in 11 passaggi:1. Esegui una scansione del tuo sitoLa “scansione” è il processo grazie al quale il software esegue l’analisi del tuo sito per individuare problemi SEO. Puoi usare AWT per costituire la base del tuo audit SEO.Per iniziare, vai sul Site Audit, clicca su + New project e autoizza Ahrefs ad accedere al tuo account.Then click on Import from Google Search Console. (You’ll need a Google Search Console account to do this.)Dopo aver autorizzato Google, selezionato il tuo sito e fatto clic su Import, la scansione potrà iniziare. Una volta impostato l’audit, devi solo attendere. Ahrefs ti invierà un’e-mail una volta completato il tuo audit.L’audit può identificare oltre 100 problemi e i risultati possono essere eccessivi da gestire per una persona agli inizi della sua carriera. Quindi, se stai iniziando con gli audit, ti suggerisco di concentrarti sui passaggi seguenti invece di provare a risolvere tutti i problemi uno per uno.2. Identifica i cali di traffico organico e scopri cosa li ha causatiGoogle aggiorna continuamente i suoi algoritmi di ricerca. Molti di questi aggiornamenti prendono di mira aspetti specifici come la qualità dei contenuti o lo spam nei link. Se si verificano cali di traffico in concomitanza con aggiornamenti importanti, puoi individuare su quali aree probabilmente è necessario concentrarti. Ecco come fare.I cali possono essere causati da molti elementi, ma due motivi principali sono:Aggiornamento degli algoritmi di Google Azioni manualiIl modo più veloce per verificare se il tuo sito è stato colpito da un aggiornamento è inserire il tuo URL nel Site Explorer di Ahrefs e vedere se eventuali cali di traffico sono concomitanti con un aggiornamento.Ad esempio, di seguito possiamo vedere che il calo del traffico di questo sito è coinciso con un aggiornamento sullo spam di Google.Puoi anche controllare il rendimento della ricerca organica in Google Search Console. Questo è importante da fare perché i numeri del traffico organico di Ahref sono stime.Per farlo:Vai su Risultati di RicercaImposta la data su Ultimi 12 mesiCerca eventuali cali significativiControlla i cali rispetto alla dashboard dello stato della ricerca di Google per vedere se coincidono Se il tuo traffico si è azzerato, potresti dover verificare la presenza di un’azione manuale. Vuol dire che una persona a Google ha deciso che il tuo sito non è conforme alle linee guida di Google. Significa che parte o tutto il tuo sito non verrà mostrato nei risultati di ricerca di Google.È improbabile che tu riceva un’azione manuale a meno che tu non abbia fatto qualcosa di eccessivamente sbagliato. Ma è comunque importante verificare di non essere annegati prima di iniziare a nuotare.Per verificare la presenza di azioni manuali, vai al rapporto Azioni manuali in Google Search Console.Se dice qualcosa di diverso da “Nessun problema rilevato”, leggi la nostra guida alle penalizzazioni di Google.Se non si tratta di un’azione manuale, potresti dover controllare ulteriormente gli aggiornamenti dell’algoritmo di Google, poiché possono influire in modo significativo sul traffico organico del tuo sito.Ad esempio, il Core Update di agosto 2018 influenzò in gran parte i siti di salute, fitness e medicina che non erano riusciti a dimostrare competenza, autorevolezza e fiducia (E‑A-T). Barry Schwartz, un blogger famoso, chiamò l’aggiornamento “medico”.L’aggiornamento ha quasi distrutto alcuni siti, come questo:Se noti un forte calo del traffico in coincidenza con un aggiornamento di Google, controlla la nostra pagina relativa alla Cronologia degli Aggiornamenti dell’Algoritmo di Google.3. Controlla eventuali duplicati sul tuo sitoI visitatori del tuo sito dovrebbero essere in grado di accedervi solo da uno di questi indirizzi:https://dominio.comhttps://www.dominio.comSe è accessibile da entrambi o dalle loro controparti non sicure (i.e., http://dominio.com, http://www.dominio.com), hai un problema.Le varianti di cui sopra dovrebbero reindirizzare alla versione principale del tuo sito.Questo è importante perché Google vede queste URL come versioni separate del sito. Avere più di un file accessibile può causare problemi di scansione e indicizzazione. In alcuni casi, può addirittura diluire il valore dei link e, quindi, avere un impatto negativo sul posizionamento.Per verificare che tutto funzioni come dovrebbe, installa la SEO Toolbar di Ahrefs, inserisci ciascuna versione dell’URL nel tuo browser, quindi controlla le intestazioni HTTP per assicurarti che reindirizzino tutte alla stessa versione “principale”.Per esempio, se andiamo su http://ahrefs.com, reindirizza alla versione sicura su https://ahrefs.com.Lo stesso accade se visitiamo la versione sicura con www (https://www.ahrefs.com). Se ciò non accade, devi implementare i reindirizzamenti.Ulteriori approfondimentiReindirizzamenti SEO: Una Guida Semplice (Ma Completa)4. Individua e diagnostica i problemi di indicizzazioneI risultati di ricerca di Google provengono dal suo indice, che è un database di centinaia di miliardi di pagine web. Le tue pagine devono essere in questo indice per avere qualche possibilità di posizionarsi.I problemi di indicizzazione possono diventare piuttosto complicati, ma puoi verificare quelli di base abbastanza facilmente.Prima di tutto, analizza il report Indexability nel Site Audit per avvisi relativi a “Noindex page”.Google non può indicizzare le pagine che presentano questo avviso, quindi vale la pena verificare che non siano pagine che desideri vengano indicizzate. Se lo sono, rimuovi o modifica il tag meta robots.5. Assicurati che il tuo sito sia ottimizzato per i dispositivi mobiliL’ottimizzazione per i dispositivi mobili è un fattore di ranking di Google dal 2019, quindi ha senso verificare che il tuo sito sia ottimizzato per i dispositivi mobili.Per fare ciò, vai al rapporto Usabilità mobile in Google Search Console che ti dirà se qualche URL contiene errori che influiscono sull’usabilità mobile.Se non hai accesso a Google Search Console, inserisci qualsiasi pagina del tuo sito nel Test di Ottimizzazione Mobile di Google.Ecco alcuni altri suggerimenti per quanto riguarda l’ottimizzazione per dispositivi mobili:Utilizza un layout o un tema ottimizzato per i dispositivi mobiliDai la priorità ai tuoi contenuti e assicurati che siano leggibili sui dispositivi mobiliComprimi le tue immagini in modo che siano ottimizzate per i dispositivi mobili, ma non sacrificare la qualitàTesta sempre il tuo sito su diversi dispositiviUlteriori approfondimentiIndicizzazione Mobile-First: Tutto Quello Che Devi Sapere6. Analizza i punteggi dei tuoi Core Web VitalsI Core Web Vitals sono metriche che Google utilizza per misurare l’esperienza dell’utente. Misurano il tempo di caricamento di una pagina, l’interattività e la stabilità del contenuto durante il caricamento.Nel 2022, John Mueller ha confermato che Google utilizza solo i Core Web Vitals anziché “vecchi segnali di velocità della pagina”.Do we have any indication that Google is still using the “old page speed signals” (2010, 2018) even after the Core Web Vitals update?Perhaps some lab measurements just for new pages that don’t yet have CrUX data?@JohnMu 🤞— Bojan Basrak (@Bojan_Basrak) October 27, 2022 Ha anche affermato su Reddit che i Core Web Vitals sono un fattore di ranking di Google.Queste sono le metriche principali con cui dovresti effettuare il benchmark:Largest Contentful Paint (LCP)First Input Delay (sarà sostituito da Interaction to Next Paint a Marzo 2024)Cumulative Layout Shift (CLS)Quando si tratta di monitorare queste metriche, dovresti iniziare utilizzando il rapporto Core Web Vitals di Google Search Console. Se hai bisogno di più dati, controlla il rapporto sulle Performance nel Site Audit di Ahrefs.7. Recupera l’autorità sistemando le pagine danneggiateAvere pagine rotte sul proprio sito non è una cosa buona. Se queste pagine hanno backlink, vengono effettivamente sprecate perché non puntano a nulla.Puoi trovare URL non funzionanti con backlink usando il Site Explorer. Basta inserire l’URL del tuo sito, andare su Migliore per link e aggiungere un filtro “404 non trovato”. Quindi ordina la lista in base ai domini, dal più alto al più basso.Ecco la nostra procedura consigliata per gestire i link che non funzionano:8. Assicurati che la tua sitemap sia correttaUna sitemap, o mappa del sito, elenca le pagine che vuoi che vengano indicizzate dai motori di ricerca. Non dovrebbe contenere elementi come reindirizzamenti, pagine non canonicalizzate o pagine morte per evitare di inviare segnali contrastanti a Google.È importante avere la certezza che le pagine più importanti che desideri indicizzare siano incluse nella sitemap.Puoi monitorare i problemi della tua sitemap andando su Google Search Console e cliccando su Sitemaps.9. Assicurati che gli elementi in pagina seguano le migliori pratiche SEO Ogni pagina indicizzabile del tuo sito dovrebbe avere un titolo, una meta descrizione e un tag H1. Questi elementi di base aiutano Google a comprendere i tuoi contenuti e ti aiutano a ottenere più clic dai posizionamenti organici.Per verificare la presenza di problemi, vai alla voce “Issues” nel report Content generato dal Site Audit. Ad esempio, il sito web sopra analizzato ha 724 pagine con un titolo mancante o vuoto. Questo non è corretto perché Google mostra il titolo nei risultati di ricerca, quindi il sito potrebbe di conseguenza perdere clic.Ha anche lo stesso numero di pagine con una meta descrizione vuota o mancante e migliaia con un tag H1 mancante o vuoto.Google mostra spesso le meta descrizioni nei risultati di ricerca, quindi dovresti provare a scriverne una accattivante per ogni pagina importante. I tag H1 mancanti, d’altra parte, di solito indicano problemi più grandi come un tema codificato in modo errato.Puoi vedere quali pagine sono interessate dal problema cliccando su un problema e scegliendo View affected URLs.Se desideri dare priorità alle correzioni, ordina il report in base al traffico organico stimato delle pagine, dal più alto al più basso.10. Trova contenuti che stanno perdendo posizioni e cerca di posizionarli di nuovo Il posizionamento non resta sempre lo stesso. Man mano che i contenuti diventano obsoleti, il traffico di ricerca spesso inizia a diminuire. Ma di solito puoi modificare questa tendenza aggiornando e ripubblicando il contenuto.Per esempio, la nostra posizione con il post relativo alle ricerche più importanti su Google è calato tantissimo nel 2021. Questo perché non abbiamo aggiornato il post per oltre un anno, quindi il contenuto è diventato obsoleto. Una volta ripubblicato il pezzo, tuttavia, abbiamo riscontrato un picco nel traffico organico.Ecco un modo semplice per trovare contenuti in declino usando Google Search Console:Vai su Risultati di ricercaImposta il filtro della data sul confronto tra periodi diversiScegli “Compara gli ultimi 6 mesi con il periodo precedente”Clicca su “Pagine”Ordina la tabella in base alla “Differenza di clic” dal più basso al più altoFacendo questo scopriamo per esempio che il nostro articolo sui 100 siti web più visitati è diminuito drasticamente negli ultimi sei mesi. Quindi sarebbe il caso di aggiornarlo.Se utilizzi WordPress, puoi automatizzare questo processo con il nostro plugin SEO gratuito che controlla le pagine che non funzionano più bene e offre consigli su come sistemarle.Ad esempio, ci suggerisce di riscrivere il nostro elenco dei migliori strumenti per le parole chiave perché prima si posizionava tra le prime tre posizioni per la parola chiave target, ma ora non si posiziona nemmeno tra i primi 100.Ulteriori approfondimentiRipubblicazione Contenuti: Come Aggiornare Vecchi Post Per La SEOCome Fare Un Audit Dei Contenuti11. Trova le parole chiave per le quali i concorrenti si posizionano, ma tu noLe mancanze nei contenuti possono verificarsi quando i siti dei tuoi concorrenti si posizionano per parole chiave per le quali tu non ti posizioni. L’identificazione manuale di queste parole chiave richiede tempo.Ecco un ottimo modo per trovarle usando lo strumento Content Gap Ahrefs:Inserisci l’indirizzo del tuo sito nel Site ExplorerVai su Gap di ContenutoInserisci gli indirizzi dei tuoi competitorClicca su Mostra le parole chiave. In questo modo vedrai le parole chiave per le quali i tuoi concorrenti si posizionano e tu non appari. Prossimi passaggiL’esecuzione di questo audit SEO ti offre tre cose su cui agire per migliorare la SEO:Problemi di SEO Tecnica: La risoluzione di questi problemi potrebbe aumentare le prestazioni organiche complessive del tuo sito.Problemi di SEO On-page SEO: Risolvere questi problemi potrebbe aumentare i clic organici.Opportunità a livello di contenuti: Perseguire questi obiettivi può posizionare le pagine più in alto e per più parole chiave.Se vuoi eseguire un audit più approfondito, leggi la nostra guida per eseguire un audit SEO tecnico.Hai domande? Scrivimi su Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Chris Haines Chris è un SEO Director e ha 10 anni di esperienza nel settore, lato agenzia. Quando non ha a che fare con la SEO, gli piace giocare con sintetizzatori vintage, passeggiare su spiagge sabbiose e bere una buona tazza di tè.",
  "headers": [
    {
      "level": "H1",
      "text": "Come Fare Un Audit SEO In 11 Semplici Passaggi"
    },
    {
      "level": "H2",
      "text": "Cos’è un audit SEO?"
    },
    {
      "level": "H2",
      "text": "Di quali strumenti hai bisogno per un SEO audit?"
    },
    {
      "level": "H2",
      "text": "Come fare un audit SEO"
    },
    {
      "level": "H3",
      "text": "1. Esegui una scansione del tuo sito"
    },
    {
      "level": "H3",
      "text": "2. Identifica i cali di traffico organico e scopri cosa li ha causati"
    },
    {
      "level": "H3",
      "text": "3. Controlla eventuali duplicati sul tuo sito"
    },
    {
      "level": "H3",
      "text": "4. Individua e diagnostica i problemi di indicizzazione"
    },
    {
      "level": "H3",
      "text": "5. Assicurati che il tuo sito sia ottimizzato per i dispositivi mobili"
    },
    {
      "level": "H3",
      "text": "6. Analizza i punteggi dei tuoi Core Web Vitals"
    },
    {
      "level": "H3",
      "text": "7. Recupera l’autorità sistemando le pagine danneggiate"
    },
    {
      "level": "H3",
      "text": "8. Assicurati che la tua sitemap sia corretta"
    },
    {
      "level": "H3",
      "text": "9. Assicurati che gli elementi in pagina seguano le migliori pratiche SEO"
    },
    {
      "level": "H3",
      "text": "10. Trova contenuti che stanno perdendo posizioni e cerca di posizionarli di nuovo"
    },
    {
      "level": "H3",
      "text": "11. Trova le parole chiave per le quali i concorrenti si posizionano, ma tu no"
    },
    {
      "level": "H2",
      "text": "Prossimi passaggi"
    }
  ],
  "author": "Chris Haines"
}