{
  "url": "https://ahrefs.com/blog/it/statistiche-seo/",
  "slug": "statistiche-seo",
  "title": "63 Statistiche sulla SEO nel 2021",
  "description": "Curioso di sapere a che punto si trova la SEO nel 2020? Ecco una lista delle più importanti statistiche SEO.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Sei curioso di esplorare il panorama della SEO nel 2021? Questo articolo fa decisamente per te.Abbiamo creato, curato e categorizzato una lista di statistiche aggiornate particolarmente interessanti.Clicca per saltare direttamente ad una determinata sezione, o continua a leggere le migliori statistiche a tema SEO.Le migliori statistiche SEOStatistiche sul posizionamentoStatistiche sui BacklinkStatistiche sulle parole chiaveStatistiche sul campo della SEOStatistiche sui motori di ricercaStatistiche sulla Local SEOStatistiche sulla SEO per i videoStatistiche sulla SEO per mobileStatistiche sul Voice SearchNota del redattoreQuesto articolo è parte di un case studies che stiamo per rilasciare, dove abbiamo creato una pagine su cui in maniera strategica abbiamo fatto una campagna di outreach per acquisire backlink.Eccone i risultati:Se vuoi approfondire, iscriviti al nostra canale YouTube. Rilasceremo una serie di 3 video per questo case study.Joshua HardwickHead of ContentLe migliori statistiche SEOQueste sono le statistiche più interessanti sulla SEO che dovresti conoscere.Il 68% delle esperienze online comincia da un motore di ricerca. (BrightEdge)Lo 0.78% degli utenti che compie una ricerca su Google clicca su di un risultato in seconda pagina. (Backlinko)Il 53% del traffico di un sito viene dalla ricerca organica. (BrightEdge)Il 92.96% del traffico globale passa attraverso la ricerca Google, Google Immagini e Google Maps. (Sparktoro)La SEO porta il 1000% in più di traffico rispetto ai social media. (BrightEdge)Il 69.7% delle query di ricerca contiene 4 o più parole. (Ahrefs)Il 60% dei marketers sostiene che l’inbound (SEO, contenuti del blog, ecc) è la loro fonte migliore di lead qualificati (HubSpot)I lead ottenuti dalla SEO convertono nel 14.6% dei casi. (HubSpot)Statistiche sul posizionamentoQueste statistiche sul posizionamento in Google potrebbero sorprenderti.Il 90.63% delle pagine non ottiene traffico organico da Google. (Ahrefs)Il primo risultato ottiene più traffico dalla ricerca solo nel 49% dei casi.(Ahrefs)Solo il 5.7% delle pagine si posiziona nella top 10 ad un anno dalla pubblicazione. (Ahrefs)Il 25.02% delle pagine che si posizionano meglio non ha una meta description. (Ahrefs)Il 40.61% delle pagine ha una meta description che viene troncata. (Ahrefs)Google mostra la meta description specificata nei risultati solo il 37.22% delle volte. Questo valore raggiunge il 40.35% per le parole chiave di tipo fat-head e scende al 34.38% per le parole chiave a coda lunga. (Ahrefs)In media, una buona pagina si posiziona nella top 10 per oltre 1,000 diverse parole chiave. (Ahrefs)L’età media di una pagina in top 10 è di oltre 2 anni. (Ahrefs)Statistiche sui BacklinkGoogle ha confermato che i backlink sono uno dei 3 più importanti fattori di ranking.Il 66.31% delle pagine non ha backlink. (Ahrefs)La maggior parte delle pagine meglio posizionate ottiene nuovi backlink di tipo “follow” al ritmo di +5%/14.5% al mese. (Ahrefs)Parlando molto approssimativamente, più una pagina ha backlink, più traffico riceve da Google. (Ahrefs)Il costo medio di un link è di $361.44. (Ahrefs)Il costo medio per la pubblicazione di un guest post è di $77.80. (Ahrefs)Il 73.6% dei domini ha link reciproci, ovvero alcuni dei siti verso cui loro linkano li linkano a loro volta. (Ahrefs)Il 43.7% delle pagine che si meglio si posizionano presenta dei link reciproci. (Ahrefs)Statistiche sulle parole chiaveLa maggior parte delle campagne SEO comincia con una ricerca delle parole chiave. Ecco alcuni statistiche su come le persone cercano su Google.Il 92.42% delle parole chiave ottiene 10 o meno ricerche mensili. (Ahrefs)Il 70.87% delle parole chiave con più di 10,000 ricerche mensili consiste solo di una o due parole. (Ahrefs)Il 13.53% delle parole chiave con 10 o meno ricerche mensili consiste di una o due parole chiave.(Ahrefs)Circa l’8% delle ricerche è posto come domanda. (Moz)Lo 0.16% delle parole chiave più popolari è responsabile del 60.67% di tutte le ricerche. (Ahrefs)Statistiche sulle attività SEOQuanto si fanno pagare i professionisti della SEO per i loro servizi? Chiedi di più o di meno della media? Diamo uno sguardo alle statistiche.Il 74.71% dei SEO si fa pagare una tariffa mensile dai propri clienti. (Ahrefs)Questo fisso mensile, è di media fra i $501-$1000. (Ahrefs)Per le tariffe orarie, $100-$150 è la fascia di prezzo più popolare. (Ahrefs)In termini di costo a progetto, $501-$1,000 è la fascia di prezzo più comune. (Ahrefs)L’88.28% dei SEO chiede $150 l’ora o meno per i suoi servizi. (Ahrefs)In media, i SEO con 2 o più anni di esperienza, chiedono il 39.4% in più sulle tariffe orarie, il 102.4% in più sulla tariffa mensile ed il 275% in più per i lavori a progetto rispetto a chi ha meno di due anni di esperienza.(Ahrefs)In media, i SEO che lavorano nel mercato internazionale chiedono il 130.74% in più rispetto a quelli che lavorano su clienti locali in termini di tariffa mensile.(Ahrefs)Statistiche sui motori di ricercaCome professionisti della SEO, è importante capire come si comportano i motori di ricerca—e come nel futuro..Il 12.29% delle pagine dei risultati di ricerca ha un featured snippet. (Ahrefs)Il primo risultato di una ricerca su Google ha un CTR medio del 31.7%(Backlinko)Sul web, si stima che ogni giorno vengano compiute 3.5 miliardi di ricerche. (Internet Live Stats)Il 39% degli acquirenti è influenzato da una precedente ricerca. (Think With Google)Il 61.5% delle ricerche da desktop ed il 34.4% delle ricerche da mobile risulta in un abbandono dei risultati di ricerca senza click.(Sparktoro)Statistiche sulla Local SEOSe ti occupi di local SEO, dovresti concentrarti sul miglioramento della presenza per query local in modo che più persone possano trovarti. Queste statistiche mostrano l’importanza di una buona Local SEO.Il 30% delle ricerche da mobile sono correlate ad una specifica posizione. (Think With Google)Il 76% delle persone che compie ricerche dal proprio smartphone cercando qualcosa nei suoi pressi, visita un’attività entro un giorno. (Think With Google)Il 28% delle ricerche di qualcosa nelle vicinanze si traduce in un acquisto. (Think With Google)Yelp appare nei primi 5 risultati di ricerca per il 92% delle ricerche su Google che includono una città e una tipologia di attività commerciale. (FreshChalk)Il 54% degli utenti che hanno uno smartphone cerca gli orari di un negozio ed il 53% cerca le indicazioni ad un negozio nelle vicinanze. (Think With Google)Circa il 45% degli shopper acquista online per poi ritirare direttamente in negozio (Think With Google)Le ricerche di tipo “Where to buy” + “near me” (“Dove comprare” + “nelle vicinanze” in Italiano) da mobile sono cresciute di oltre il 200% dal 2017 al 2019. (Think With Google)Le ricerche da mobile per “store open near me” (“negozio aperto nelle vicinanze” in Italiano) come ad esempio “Supermercato aperto nelle vicinanze” sono cresciute di oltre il 250% dal 2017 al 2019. (Think With Google)Le ricerche da mobile di tipo “on sale” + “near me” (“in offerta” + “nelle vicinanze” in Italiano) sono cresciute oltre il 250% YOY dal 2017 al 2019. (Think With Google)Statistiche sulla SEO per i videoAbbiamo ottenuto un ottimo successo nell’acquisire clienti sfruttando il video marketing. Tu lo stai facendo? Se la risposta è negativa, queste statistiche potrebbero sorprenderti.Il Video è il tipo di media più utilizzato nelle content strategy, superando blog e infografiche. (HubSpot)Il numero di commenti, visualizzazioni, condivisioni e “mi piace” ha una forte correlazione con migliori ranking su Youtube. (Backlinko)Il 68.2% dei risultati in prima pagina su Youtube sono video in HD. (Backlinko)La lunghezza media di un contenuto nella prima pagina di Youtube è di 14 minuti e 50 secondi. (Backlinko)Statistiche sulla mobile SEOCon sempre più persone che cercano da mobile, Google si è spostato in favore del mobile-first indexing, confermando ancora di più l’importanza della Mobile SEO.Il 52.2% di tutto il traffico di ricerca proviene dagli smartphone. (Statista)Vengono effettuate più ricerche da mobile che da desktop. (Think With Google) Quando le persone vogliono sapere, fare, andare o comprare, utilizzano il loro smartphone. Vengono effettuate più ricerche da mobile che da desktop. Più della metà del traffico del web proviene da smartphone e tablet.Il 51% degli utenti che utilizzano uno smartphone ha scoperto una nuova azienda o un nuovo prodotto durante una ricerca su internet. (Think With Google)In media, posizionarsi #1 sulle ricerche da mobile porta il 27.7% dei click, mentre essere #1 su desktop ne porta circa il 19.3%. (SEOClarity)Statistiche sulla voice search“Hey Google, che mi sai dire sulla voice search?”Il 40–7% di tutte le risposte a ricerche vocali proviene da un featured snippet. (Backlinko)Il risultato tipico di una voice search è composto da 29 parole. (Backlinko)Approssimativamente, il 75% dei risultati di una ricerca vocale, proviene da un sito posizionato fra le prime 3 posizioni per quella specifica query di ricerca. (Backlinko) Come tendono a posizionarsi i risultati delle ricerche vocali (nelle ricerche da desktop) Posizione nei risultati di ricerca GoogleIl livello di lettura medio di un risultato vocale corrisponde a quello di un testo di prima superiore. (Backlinko)I siti con una forte autorità proveniente dai link tendono a posizionarsi bene nei risultati vocali. In media infatti, la Domain Rating di un risultato scelto da Google Home è 76.8%.(Backlinko)Il 48% dei consumatori utilizza la voice search per “ricerche generiche”. (Search Engine Land)In conclusioneVuoi imparare come fare SEO? Leggi le basi qui, o guarda questo video:https://www.youtube.com/watch?v=IkachvSZtPECredi che mi sia dimenticato qualche importante statistica sulla SEO? Fammelo sapere su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "63 Statistiche sulla SEO nel 2021"
    },
    {
      "level": "H2",
      "text": "Le migliori statistiche SEO"
    },
    {
      "level": "H2",
      "text": "Statistiche sul posizionamento"
    },
    {
      "level": "H2",
      "text": "Statistiche sui Backlink"
    },
    {
      "level": "H2",
      "text": "Statistiche sulle parole chiave"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Statistiche sulle attività SEO"
    },
    {
      "level": "H2",
      "text": "Statistiche sui motori di ricerca"
    },
    {
      "level": "H2",
      "text": "Statistiche sulla Local SEO"
    },
    {
      "level": "H2",
      "text": "Statistiche sulla SEO per i video"
    },
    {
      "level": "H2",
      "text": "Statistiche sulla mobile SEO"
    },
    {
      "level": "H2",
      "text": "Statistiche sulla voice search"
    },
    {
      "level": "H2",
      "text": "In conclusione"
    }
  ],
  "author": "Si Quan Ong"
}