{
  "url": "https://ahrefs.com/blog/it/strategia-content-marketing/",
  "slug": "strategia-content-marketing",
  "title": "Come Creare una Strategia Vincente di Content Marketing in 9 Passi",
  "description": "Impara a creare una strategia di content marketing per ottenere maggior traffico, contatti e in definitiva vendite, in 9 semplici passi.",
  "content": "Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita. Contenuti Se vuoi avere successo nel content marketing, devi avere una strategia di content marketing.Perché quando ne hai una, sarai in grado di raggiungere risultati come questi:Crescita del traffico da ricerca del Blog Ahrefs, da Site Explorer di Ahrefs.E questi:Visite mensili sul canale YouTube di AhrefsIn questo articolo, ti mostrerò come creare una strategia vincente di content marketing basata sulla nostra esperienza ad Ahrefs.Ma prima…Che cos’è esattamente una strategia di content marketing?La strategia di content marketing è un piano per la creazione in modo consistente di contenuto di alta qualità progettato per accompagnare gli sconosciuti in clienti.Molte persone pensano che dev’essere qualcosa di complicato, ma non è così.Infatti, la nostra strategia in Ahrefs è abbastanza semplice. Creiamo articoli di blog educativi e video di YouTube che insegnano alle persone come risolvere i loro problemi con l’aiuto dei nostri strumenti. Ci focalizziamo nella ottimizzazione dei motori di ricerca (SEO) durante il processo di creazione del contenuto, così il nostro contenuto appare nelle ricerche rilevanti.Posizionarsi in cima a Google per “contenuto sempreverde”.Sotto, ti spiegherò come puoi replicare la nostra strategia in 9 semplici passi.Imposta un obiettivoConosci il tuo pubblicoScegli una tipologia di contenutoScopri cosa stanno cercando le personeDai priorità agli argomenti più promettentiCrea un calendario dei contenutiPromuovi il tuo contenutoControlla i risultatiRinfresca il tuo contenutoPasso 1. Imposta un obiettivoL’impostazione degli obiettivi può essere complicata, ma non dev’esserlo per forza. Se conosci concetti come gli obiettivi SMART e gli OKR, puoi usarli.Noi tuttavia preferiamo semplificare le cose.Ecco perché il nostro obiettivo di content marketing è semplicemente attrarre traffico mirato da motori di ricerca come Google e YouTube.Il tuo obiettivo potrebbe essere diverso, e va bene così. Alcuni obiettivi abituali includono:Avere maggiori contatti inbound per il tuo team commercialeAttrarre link verso il tuo sitoAumentare l’esposizione del brandDiventare un leader riconosciuto nel tuo settorePer questo articolo abbiamo ipotizzato che, come noi, tu voglia maggior traffico mirato.Passo 2. Conosci il tuo pubblicoIl content marketing non è l’attrazione di chiunque al tuo sito web. Devi attirare persone che potrebbero acquistare il tuo prodotto o servizio.Potrebbe sembrare ovvio, ma è un errore comune, specialmente per chi è nuovo nel content marketing.Per esempio, ipotizziamo che tu abbia una azienda di produzione video. Dovresti scrivere un articolo del blog su “come correggere il colore su Adobe Premiere Pro”? Probabilmente no, perché non è ciò che i tuoi clienti stanno cercando. E’ ciò che stanno cercando altri video editor.Se il tuo obiettivo sono i titolari di piccole aziende che stanno cercando un aiuto per la produzione di video, devi mirare agli argomenti che a loro interessano.E l’unico modo di farlo è essere chiari su chi stai cercando di mirare.Per farlo, puoi considerare la creazione di una buyer persona. Si tratta di una “persona immaginaria” che rappresenta le caratteristiche comuni del tuo cliente ideale.Ecco come potrebbe essere per noi:E’ qualcosa che devi fare? Non proprio. Se senti già di avere una buona confidenza su chi siano i tuoi potenziali clienti, puoi saltare benissimo questo passaggio. Tuttavia, se è qualcosa alla quale non avevi mai pensato, potrebbe essere un esercizio utile scriverlo su carta. Qui c’è una ottima guida che spiega come farlo.Passo 3. Scegli una tipologia di contenutoArticoli di blog, video, podcast, webinar — ci sono tantissime tipologie di contenuto che puoi scegliere.Tuttavia, se stai iniziando, non provare a correre prima di camminare. Scegli una solo.Come? Ci sono 2 aspetti che dovresti considerare.Il primo, pensa alla tipologia di contenuto che il tuo pubblico consuma. Per noi, sono gli articoli del blog, e molti tecnici SEO usano Google per trovare informazioni. Se hai una scuola di cucina e vuoi condividere ricette, i video potrebbero essere un’opzione migliore.Secondo, pensa a quali cose sai fare. Alcune persone sono brave davanti ad una camera, mentre altre non riescono nemmeno a sentire la propria voce. Se sei tra le seconde, contenuti scritti potrebbero andare meglio.Se sei bloccato, inizia con il blog o con il video marketing.Non importa quale sia il tuo settore, il tuo pubblico starà probabilmente cercando informazioni su Google o YouTube. Quindi, entrambi i formati sono un ottimo punto di partenza.Dopo che hai deciso, mantieni questo formato finché non scopri un processo di creazione consistente. Solo dopo dovresti passare ad un nuovo formato.E’ ciò che abbiamo fatto. Quasi tutti i nostri sforzi sono stati rivolti al blog fino al 2018, quando abbiamo assunto Sam per prendere il controllo del nostro canale YouTube. E Tim, il nostro Chief Marketing Officer (CMO) non si è dedicato ad altri formati di contenuto (come i corsi e gli strumenti gratuiti) fino a che ha delegato il blog e YouTube a Josh e Sam.Passo 4. Scopri cosa stanno cercando le personeIl nostro obiettivo di content marketing è attirare traffico mirato dai motori di ricerca come Google e YouTube. Quindi, oltre a conoscere chi è il nostro pubblico, dobbiamo anche sapere cosa sta cercando. E’ l’unico modo con il quale possiamo creare la tipologia di contenuto che vuole vedere ed attirare traffico dai motori di ricerca mese dopo mese.Per questo, avrai bisogno di uno strumento di ricerca parole chiave come Keywords Explorer di Ahrefs.Per iniziare, fatti un’idea di alcune parole chiave ‘seme’ rilevanti. Se vendi caffè online, potrebbero essere “caffè”, chicchi di caffè”, e “caffettiera a stantuffo”.Incolla queste parole chiave su Keywords Explorer, e seleziona Google o YouTube a seconda della tipologia di contenuto che stai andando a creare.Poi, vai al report “Domande”. Dovresti vedere una lista enorme di parole chiave con il loro relativo volume mensile ed altre metriche SEO.Se non sei sicuro quali parole chiave ‘seme’ utilizzare, guarda a quali i tuoi concorrenti si stanno già posizionando su Google per avere alcune idee. Come? Incolla le URL dei tuoi concorrenti su Site Explorer di Ahrefs e vai al report “Pagine migliori”.Questo report ordina le pagine di un sito web per il traffico di ricerca organica stimato. In altre parole, ora hai un elenco dei migliori articoli dei tuoi concorrenti e le parole chiave che inviano loro il maggior traffico.Ulteriori approfondimentiCome Ricercare Parole Chiave Per La SEO (Guida per Principianti)6 Suggerimenti Per la Ricerca di Parole Chiave per Trovare Opportunità Non SfruttateParole Chiave a Coda Lunga: Il ‘Segreto’ per Avere TANTISSIMO Traffico di RicercaCome Cercare Parole Chiave per YouTube in 3 Semplici PassiPasso 5. Dai priorità agli argomenti più promettentiSiccome il tuo obiettivo è avere maggior traffico mirato, dovresti dare priorità agli argomenti più rilevanti per la tua attività.Noi lo facciamo assegnando un punteggio ‘valore di business’ per ogni argomento.Ecco la scala che utilizziamo:“3” — il nostro prodotto è una soluzione insostituibile per il problema;“2” — il nostro prodotto aiuta un po’, ma non è essenziale per risolvere il problema;“1” — il nostro prodotto aiuta in modo marginale;“0” — il nostro prodotto non aiuta o aiuta molto poco a risolvere il problema.La validità di questa scala è che può essere applicata praticamente ad ogni settore.Per esempio, ipotizziamo che tu venda online degli strumenti per caffè. Un argomento simile a “come fare la schiuma a casa” sarebbe probabilmente un “3”, perché gli utenti avranno sicuramente bisogno di comprare un montalatte per farlo bene.Dall’altro lato, un argomento come “come pulire una macchina del caffè” avrebbe probabilmente un “2”. Anche se probabilmente potresti vendere prodotti specializzati per la pulizia, molti utenti probabilmente hanno già qualcosa che possono usare per pulire le loro macchine, come l’aceto bianco. Quindi probabilmente non compreranno oggi nulla dal tuo negozio.Per finire, un argomento come “come togliere il caffè dal tappeto” avrà forse uno “0” o “1”. Anche se l’argomento è rilevante, le persone che fanno questa ricerca non sono probabilmente degli appassionati di caffè con una propensione per costose apparecchiature di preparazione. Probabilmente hanno appena fatto cadere una tazza di caffè istantaneo.Resta a te decidere quali argomenti vuoi o non vuoi trattare. Ci siamo focalizzati su argomenti che hanno voto di 2–3 e raramente pubblichiamo qualcosa con un punteggio 0.Passo 6. Crea un calendario dei contenutiLa creazione consistente di contenuti riguarda in definitiva il bilanciamento tra la qualità del tuo contenuto e la velocità di produzione. Il tuo obiettivo è pubblicare più spesso possibile senza cadere con gli standard di qualità. Dopo tutto, non c’è motivo nel pubblicare contenuto che non sarà letto, visto, o ascoltato.Purtroppo, non possiamo dirti la frequenza a te ideale. E’ diverso per ogni azienda. Ma ciò che possiamo dirti è che hai bisogno di un calendario dei contenuti per tenere tutto sotto traccia.I calendari dei contenuti sono semplicemente delle programmazioni che ti mostrano quando hai pianificato di pubblicare un nuovo contenuto e che contenuto vuoi pubblicare.Per esempio, questo è il nostro calendario dei contenuti qui ad Ahrefs:Con questo semplice calendario, possiamo vedere facilmente a colpo d’occhio chi sta lavorando a cosa, la fase in cui si trova, e quando il contenuto è pronto per la pubblicazione.Questo mantiene tutto organizzato ed assicura che noi pubblichiamo in modo consistente.Passo 7. Promuovi il tuo contenutoIl contenuto non sarà scoperto da solo. Devi portarlo davanti alle persone così lo leggeranno e si spera lo condivideranno o creeranno dei link ad esso.Ecco alcune semplici idee di promozione del contenuto per iniziare:1. Invia il nuovo contenuto ai tuoi iscritti via emailQuesto è uno dei più vecchi trucchetti da manuale per un motivo: funziona.Ogni volta che noi produciamo un nuovo pezzo di contenuto, inviamo una email dedicata ai nostri ~70mila iscritti coinvolti.2. OutreachNel content marketing, c’è un pubblico secondario, “nascosto”, che molte persone non considerano.Conosciuti come “amplificatori”, sono i giornalisti e gli influencer che possono condividere e amplificare il tuo contenuto ai loro seguaci.Fonte.Se queste persone in qualche modo si prendono cura del tuo contenuto, potresti potenzialmente guadagnare condivisioni, link, traffico referral, o anche opportunità di future collaborazioni.Nel digital marketing, questo si chiama “outreach”.E la chiave per farlo bene è avere un motivo preciso per cui dovrebbero darti attenzione.Ecco 2 delle motivazioni che potresti usare:Hai menzionato loro (o il loro lavoro) nel tuo contenuto. Così come stai creando contenuti, ci sono possibilità che tu abbia menzionato risorse da altri creatori di contenuto. Quindi, è un veloce e facile lavoro fagli sapere che hai menzionato il loro lavoro.Hai qualcosa di estremamente interessante che gli influencer non conoscono, ma sono molto interessati a saperlo. Per esempio, potresti aver fatto uno studio sui dati dove hai trovato risultati interessanti, come il nostro studio sul motivo per cui il 91% dei contenuti non riceve alcun traffico di ricerca.Il secondo ha funzionato bene per noi in numerose occasioni. Infatti, abbiamo creato recentemente un elenco di statistiche SEO e contattato oltre 500 blogger che avevano dei link a statistiche non aggiornate. Come risultato, abbiamo ottenuto link da 32 siti web.Impara qui come abbiamo fatto:https://www.youtube.com/watch?v=gMcA-8nalL83. Pubblicità a pagamentoLa pubblicità a pagamento è probabilmente il modo più veloce per portare il tuo contenuto di fronte a nuovi potenziali clienti. Che sia Facebook, Twitter, o Pinterest, quando metti dei soldi nelle pubblicità a pagamento, stai pagando per risultati tracciabili: dalle visualizzazioni ai click e conversioni.Proprio ora, pubblicizziamo ogni nuovo articolo con Facebook Ads. Se queste pubblicità hanno buoni risultati, investiamo una somma maggiore nella pubblicità (significa generalmente un CPC < $0,30).Inoltre regolarmente sponsorizziamo podcast e ci pubblicizziamo su YouTube:If you create YT tutorials that feature your product, consider spending 💰 on ads. Doesn’t have to be a lot. In July, we spent 154.62 SGD (~112.75 USD) for 174.8 hours of watch time (10,488 minutes).That’s $0.01/min or $0.65/hour. Name a cheaper medium for relevant/focused attn— Sam Oh (@samsgoh) August 16, 2020Ulteriori approfondimentiCome Promuovere Il Tuo Blog: 7 Strategie Fondamentali13 Tattiche Collaudate per Aumentare il Tuo Traffico del BlogElenco di Controllo di Promozione dei Contenuti per PrincipiantiPasso 8. Controlla i risultatiSiccome le cose cambiano sempre, dobbiamo anche assicurarci che il nostro contenuto sia rilevante per posizionarsi negli anni a venire. Ecco perché diventa cruciale controllare il contenuto, e ci sono molti modi per farlo.La prima cosa a cui tutti pensano è Google Analytics. E’ lo standard di settore quando si tratta di controllare i veri numeri di traffico.Se stai creando video per YouTube, allora dovresti guardare le YouTube Analytics.E per finire, siccome posizionarci in alto su Google è per noi importante, teniamo traccia dei nostri posizionamenti con il Rank Tracker di Ahrefs. Lo facciamo tracciando la parola chiave obiettivo primaria per ogni articolo.Da Rank Tracker di Ahrefs.Se il traffico e il posizionamento di una specifica pagina cala per alcuni mesi consecutivamente, inizieremo a capire perché succede. Ed in molti casi, programmiamo una riscrittura o aggiornamento dell’articolo.Passo 9. Rinfresca il tuo contenutoCome ho appena detto, dovresti guardare sempre quanto bene sta andando il tuo contenuto scritto in ogni momento dato.Se sta mantenendo il suo posizionamento nei risultati di ricerca, probabilmente non avrà bisogno di aggiornamento.Se sta perdendo velocemente posizioni e riducendo la visibilità, bene, è probabilmente giunto il momento per una rinfrescata.Questo significa aggiornare un po’ le informazioni per mantenerle fresche, o riscrivere interamente l’articolo. Ad Ahrefs, di solito aspettiamo circa 6 mesi per dare ad un articolo del blog il tempo di posizionarsi prima di decidere se riscriverlo (il formato video non può purtroppo avere questo lusso).Per una guida più esaustiva su come rinfrescare il tuo contenuto, leggi questo articolo o guarda il video:https://www.youtube.com/watch?v=9HWna4hK47c&feature=emb_titleConclusioniIl content marketing è come un investimento in fondi indicizzati. Nel breve termine, i ritorni sono bassi. Ma nel lungo periodo, possono generare ritorni significativi, ma solo se li mantieni e continui ad investire.E’ la stessa cosa per il content marketing. Richiede uno sforzo per partire, e prende del tempo di lavoro. Ma focalizzati sul lungo termine, ed avrai i tuoi risultati.Domande? Mi trovi su Twitter.Tradotto da Mauro Marinello Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Si Quan Ong Marketing @Ahrefs. Leggo, pratico breakdance e mi piace fare ogni giorno nuove esperienze di vita.",
  "headers": [
    {
      "level": "H1",
      "text": "Come Creare una Strategia Vincente di Content Marketing in 9 Passi"
    },
    {
      "level": "H2",
      "text": "Che cos’è esattamente una strategia di content marketing?"
    },
    {
      "level": "H2",
      "text": "Passo 1. Imposta un obiettivo"
    },
    {
      "level": "H2",
      "text": "Passo 2. Conosci il tuo pubblico"
    },
    {
      "level": "H2",
      "text": "Passo 3. Scegli una tipologia di contenuto"
    },
    {
      "level": "H2",
      "text": "Passo 4. Scopri cosa stanno cercando le persone"
    },
    {
      "level": "H2",
      "text": "Passo 5. Dai priorità agli argomenti più promettenti"
    },
    {
      "level": "H2",
      "text": "Passo 6. Crea un calendario dei contenuti"
    },
    {
      "level": "H2",
      "text": "Passo 7. Promuovi il tuo contenuto"
    },
    {
      "level": "H3",
      "text": "1. Invia il nuovo contenuto ai tuoi iscritti via email"
    },
    {
      "level": "H3",
      "text": "2. Outreach"
    },
    {
      "level": "H3",
      "text": "3. Pubblicità a pagamento"
    },
    {
      "level": "H2",
      "text": "Passo 8. Controlla i risultati"
    },
    {
      "level": "H2",
      "text": "Passo 9. Rinfresca il tuo contenuto"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Si Quan Ong"
}