{
  "url": "https://ahrefs.com/blog/it/studio-tag-title/",
  "slug": "studio-tag-title",
  "title": "6 Importanti Fatti sui Tag Title (953,276 Pagine Studiate)",
  "description": "Abbiamo analizzato i titoli nelle SERP e i tag title di 953,276 posizionate in top 10. Ecco cosa abbiamo scoperto.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti I recenti cambiamenti introdotti da Google sui tag title che fanno sì che questi contino meno per generare i titoli delle SERP ha causato confusione nel settore della SEO durante Agosto e Settembre. Il feedback da parte dei SEO è stato piuttosto negativo. Non è una sorpresa, visti alcuni dei fallimenti di questo nuovo sistema.Ecco uno dei peggiori esempi di riscrittura del tag title che abbia mai visto:Great example of Google rewriting the title tag and getting it very wrongFor non UK folk, the HMRC is the UK tax collectors pic.twitter.com/YbpWaEmSjo— Charles Meaden (@charlesmeaden) September 6, 2021Ed ecco il reale title, per avere un metro di misura:Google ha poi fatto degli aggiustamenti rispetto al primo update, e ora ha dichiarato che utilizza il tag title nell’87% circa dei casi. Noi possediamo dei dati per confermare o confutare queste dichiarazioni, ed è esattamente quello che andremo a fare.Abbiamo analizzato i titoli nelle SERP per 953,276 pagine posizionate fra i primi 10 risultati al fine di ottenere dei preziosi dati.Ed eccoli qui, partendo con una statistica che potrebbe lasciare sorpresi:Il 7.4% delle pagine meglio posizionate non ha un tag titleMi aspettavo che quasi tutte le pagine posizionate nella top 10 dei risultati di ricerca avrebbero avuto un tag title. Averlo mancante nel 7.4% delle pagine meglio posizionate fra i primi 10 risultati sembra infatti un numero piuttosto alto.Per la maggior parte delle pagine che presentano invece un tag title, con che modalità questi vengono riscritti da Google?Google riscrive il tag title nel 33.4% dei casiUtilizzare il tag title solo il 66.6% delle volte è un pò diverso rispetto all’87% delle volte che Google dichiara. Ma come con la maggior parte delle cose, tutto è nei dettagli. In base alla nostra metodologia, ignoriamo le piccole discrepanze fra il tag title specificato e quello mostrato nella SERP. Questo in quanto delle piccole variazioni nella punteggiatura o l’aggiunta del nome brand sono sempre state un qualcosa che Google ha fatto. Se dovessimo considerare ogni minima variazione, allora la percentuale di titoli riscritti sarebbe ancora più elevata.D’altro canto, consideriamo come titoli che combaciano solo quelli in cui Google ha mantenuto le parole nello stesso ordine. E questa è una delle precedenti affermazioni di Google:Fra tutti i modi in cui generiamo i tolti, il contenuto HTML del tag title è quello più utilizzato, oltre l’80% delle volte.Questo potrebbe significare che Google considera il titolo lo stesso anche cambiando l’ordine delle parole. O forse sto solo esagerando.In ogni caso, il punto è che questi cambiamenti hanno effetto sulle tue pagine. Ad esempio, Google attualmente riscrive i titoli il 31.6% delle volte (1,314 casi su 4,162 pagine) su ahrefs.com:Puoi trovare questo all’interno del report Page explorer nel Site Audit di Ahrefs.C’è il 33% in più di possibilità che ora Google riscriva il titoloGoogle genera i suoi titoli e le sue description per le SERP da molto tempo. Mentre prima le meta description venivano riscritte il 62.78% delle volte, i tag title erano a confronto sempre più stabili ed i cambiamenti non erano così frequenti.Abbiamo analizzato i title non riscritti all’interno delle pagine della SERP confrontando Giugno e Settembre 2021, scoprendo che Google ora li riscrive molto più di frequente:I titoli non riscritti sono quasi identici per parole chiave fat-head o a coda lungaGoogle sostiene che riscrive i tag title indipendentemente dalla query di ricerca, ad esempio il titolo dovrebbe essere identico in tutte le SERP.La mia ipotesti è che se questo non fosse vero, sarebbe più probabile che Google riscriva il titolo per le parole chiave a coda lunga. Questo in quanto c’è maggiore volatilità nell’intento di ricerca rispetto alla parola chiave principale per la quale le persone provano a posizionarsi.Possiamo confermare che non esistono differenze significative fra le riscritture per parole chiave a coda lunga e fat-head:Tieni a mente che i dati qui sono un filtro per quello che Google sostiene, non una prova. Confrontare i titoli della stessa pagina fra varie SERP potrebbe portare ad una migliore analisi, ma ha anche delle complessità differenti (ora, posizione, personalizzazione).Quando Google ignora il tag title, utilizza l’H1 il 50.76% delle volte al suo postoGli heading sono un posto ovvio dove andare a cercare un titolo alternativo per la SERP. E nel caso in cui i titolo nella SERP e il tag title differiscono, i nostri dati mostrano come Google tragga il titolo per la SERP dal tag H1 nel 50.76% delle volte, dal tag H2 il 2.02% delle volte ed una combinazione fra H1 e H2 l’1.31% delle volte.Questo ci lascia con il 45.91% di casi non identificati. Secondo Google, i titoli in queste SERP possono venire anche da:Altri contenuti grandi e prominenti attraverso l’applicazione di determinati stili.Altro testo contenuto nella pagina.Anchor text sulla pagina.Testo all’interno di link che puntano alla pagina.Dopo aver analizzato alcuni di questi “altri” casi, siamo giunti alla conclusione che Google possa spesso utilizzare molti elementi mixati fra di loro per creare un titolo coerente a partire da questi. Si tratta solamente di ipotesi basate però su una manciata di esempi.Google riscrive con una probabilità del 57% i tag title troppo lunghiGoogle riscriveva i titoli al di sopra di 600px il 29.45% delle volte. Ora il 46.12% delle volte, un incremento del 56.6%.Quindi, se vuoi incrementare le possibilità che Google utilizzi il tag title da te specificato, assicurati di rientrare nei 600px di lunghezza, il limite massimo che viene mostrato nelle SERP. Anche se il consiglio più semplice è quello di tenersi ad un massimo di 60 parole.Puoi identificare le pagine con titoli eccessivamente lunghi dopo aver scansionato il tuo sito con il Site Audit di Ahrefs:Conclusione? Tieni traccia dei cambiamenti di titoli nelle SERP per le pagine più importantiPrevenire è meglio che curare. Questo significa scrivere i migliori titoli possibili per minimizzare le possibilità che Google li riscriva. Averne alcuni riscritti è comunque inevitabile. E dovresti tracciare questi casi.Ti ricordo che il Site Audit può aiutarti con ciò (gratuito all’interno di Ahrefs Webmaster Tools). Dopo aver scansionato il tuo sito, vai nel Page explorer. Qui attiva il filtro preimpostato “Page and SERP titles do not match,” clicca su “Advanced filter”, ed escludi i cambiamenti minori che comprendono troncamenti o l’aggiunta del tuo nome brand:Clicca poi su “Apply” per ordinare la tabella in base al traffico organico e mostrare i cambiamenti che potrebbero avere il maggiore impatto:Se una riscrittura di titolo ti sembra problematica, analizza le variazioni in CTR all’interno di Google Search Console. Poi decidi se e come sistemare il tag title. Si allinea all’intento di ricerca della parola chiave principale? Si tratta di un titolo aggiornato? Potrebbe forse essere troppo clickbait o spam?Questo è tutto quello che possiamo fare per combattere le riscritture dei tag title da parte di Google.Scrivimi su Twitter se hai domande o commenti. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "6 Importanti Fatti sui Tag Title (953,276 Pagine Studiate)"
    },
    {
      "level": "H2",
      "text": "Il 7.4% delle pagine meglio posizionate non ha un tag title"
    },
    {
      "level": "H2",
      "text": "Google riscrive il tag title nel 33.4% dei casi"
    },
    {
      "level": "H2",
      "text": "C’è il 33% in più di possibilità che ora Google riscriva il titolo"
    },
    {
      "level": "H2",
      "text": "I titoli non riscritti sono quasi identici per parole chiave fat-head o a coda lunga"
    },
    {
      "level": "H2",
      "text": "Quando Google ignora il tag title, utilizza l’H1 il 50.76% delle volte al suo posto"
    },
    {
      "level": "H2",
      "text": "Google riscrive con una probabilità del 57% i tag title troppo lunghi"
    },
    {
      "level": "H2",
      "text": "Conclusione? Tieni traccia dei cambiamenti di titoli nelle SERP per le pagine più importanti"
    }
  ],
  "author": "Michal Pecánek"
}