{
  "url": "https://ahrefs.com/blog/it/suggerimenti-ricerca-parole-chiave/",
  "slug": "suggerimenti-ricerca-parole-chiave",
  "title": "6 Suggerimenti Per la Ricerca di Parole Chiave per Trovare Opportunità Non Sfruttate",
  "description": "La ricerca di parole chiave è un fattore cruciale per il successo della maggior parte dei siti Web. Ma il processo convenzionale può lasciare molte parole chiave in ballo.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO). Contenuti La ricerca di parole chiave è un fattore cruciale per il successo della maggior parte dei siti Web. Ma il processo convenzionale può lasciare molte parole chiave in ballo. Guarda questa parola chiave: Non si vedeva da nessuna parte quando abbiamo usato il nostro solito processo di ricerca per una parole chiave seme (seed) nell’Keyword Explorer, scegliendo un rapporto Keyword ideas, applicando alcuni filtri e alla ricerca di idee.Eppure, abbiamo ancora scritto un post sul blog al riguardo, e ora siamo il primo risultato di ricerca con circa 700 visite mensili.In questa guida imparerai come abbiamo trovato questa parola chiave, ed oltre a cinque altri metodi per trovare opportunità non sfruttate in pochi minuti.Decodifica le pagine più popolari dei tuoi concorrentiEsegui un’analisi del gap di contenuti (content gap analysis)Trova pagine con traffico organico e pochi o nessun backlinkTrova le parole chiave per cui vengono classificati i forumTrova nuove parole chiave in Google Search ConsoleTrova parole chiave di affiliazione redditizie con potenziale di traffico1. Decodifica le pagine più popolari dei tuoi concorrentiOgnuno fa la ricerca di parole chiave in modo diverso, motivo per cui i concorrenti risultano spesso nel ranking di parole chiave che non hai mai nemmeno considerato.Questa non è necessariamente una cosa negativa.Decodificando le loro pagine più popolari nella ricerca organica, è possibile sfruttare il loro duro lavoro per trovare parole chiave e argomenti con potenziale di traffico.Ecco come:Incolla il sito Web di un concorrente in Site Explorer di Ahrefs, poi vai al rapporto Top Pages. Questo mostra quali delle loro pagine ottengono il più traffico organico.Non sei sicuro chi siano i tuoi concorrenti?Incolla il tuo dominio in Site Explorer e poi vai al rapporto Competing Domains. Premi il cursore sul primo sito topicamente simile, assicurati che abbia una buona quantità di traffico organico, quindi incollalo in Site Explorer.Se il tuo sito non è ancora classificato per molte parole chiave, potresti non trovare buoni suggerimenti nel rapporto Competing domains. Questo perché il rapporto si basa su parole chiave sovrapposte.Ecco un altro modo per trovare buoni domini concorrenti da analizzare:Cerca su Google una parola chiave per cui desideri classificare;Incolla uno dei domini di alto rango in Site Explorer di Ahrefs;Verifica che abbia una discreta quantità di traffico;Continua la tua analisi.Poiché siamo interessati anche al potenziale del traffico globale, cambieremo il filtro per mostrare le stime del traffico da tutti i paesi, non solo dagli Stati Uniti.Ora, se esaminiamo gli URL e le parole chiave nella colonna Top keyword, ci sono un bel po’ di argomenti che abbiamo già trattato. Tuttavia, ce ne sono alcuni che non abbiamo trattato come “content writing”, un argomento che invia oltre 10.500 visite mensili a backlinko.com.È una storia simile per “bounce rate”.Dato il potenziale di traffico organico di questi argomenti, vorremmo prendere in considerazione la possibilità di scriverne sul blog di Ahrefs.Ora, una volta che hai trovato tutte le idee non sfruttate con potenziale di traffico da un concorrente, non fermarti qui. Controlla il rapporto Competing Domains per trovare i concorrenti del tuo concorrente, controlla anche le loro pagine migliori.Ripeti questo processo quante volte vuoi per trovare idee per parole chiave quasi illimitate.2. Esegui un’analisi del gap di contenuti (content gap analysis)Se vedi diversi concorrenti in classifica per una parola chiave, può essere un segnale che potrebbe anche avere senso per te perseguire quella parola chiave.Ad esempio, tre strumenti di email marketing — Active Campaign, Campaign Monitor e Get Response — si posizionano tra i primi cinque per la parola chiave “newsletter ideas” …… ma Convert Kit, un altro strumento di email marketing, non appare da nessuna parte:Il modo più efficace per trovare queste parole chiave è eseguire un’analisi del gap di contenuto (content gap analysis).Per fare ciò, incolla il tuo dominio in Site Explorer di Ahrefs, vai al rapporto Content Gap e inserisci alcuni domini concorrenti nella sezione in alto. Per Convert Kit, questi potrebbero essere activecampaign.com, getresponse.com e campaignmonitor.com.Se eseguiamo la ricerca, vediamo che Get Response e Campaign Monitor si classificano per “email marketing tips”, mentre Convert Kit non compare.Se non ci sono molte parole chiave pertinenti nel rapporto, imposta il filtro delle intersezioni su “3 targets”. In questo modo, vedrai solo le parole chiave per cui tutti i concorrenti classificano.Tieni presente che mentre il rapporto del gap di contenuto mostra il volume di ricerca mensile stimato per ogni parola chiave, questo non è sempre il modo migliore per giudicare il potenziale del traffico di ricerca di un argomento. Per ottenere un’indicazione migliore, premi il pulsante “SERP” e controlla il traffico organico stimato per le pagine di alta classificazione.3. Trova pagine con traffico organico e pochi o nessun backlinkSecondo il nostro studio di oltre un miliardo di pagine, esiste una chiara correlazione tra il numero di domini di riferimento (backlink da siti web unici) a una pagina e il suo traffico di ricerca organico.Ma ciò non significa che sia impossibile aumentare il tuo ranking con pochi o nessun backlink. A volte s’incontra una pagina che ottiene traffico organico decente con quasi nessun backlink.Ad esempio, questa pagina sulle piante che scacciano le zanzare ha una media di circa 5.200 visite organiche al mese nonostante abbia un solo backlink:Se hai un sito che vende semi, potrebbe avere senso scrivere un post su quell’argomento perché è pertinente e poco competitivo. Probabilmente potresti classificarti su Google con pochi o nessun backlink.Allora, come puoi trovare pagine come questa?Per prima cosa, vai al Content Explorer di Ahrefs e cerca un argomento pertinente. Se gestisci un sito di fitness, potrebbe trattarsi di “perdita di peso” o “aumento della massa muscolare”. Quindi, filtra i risultati per le pagine con almeno 500 visite organiche mensili e pochi o nessun dominio di riferimento.Nota a margine. Vale anche la pena filtrare solo per le pagine funzionanti (live) e quelle nella tua lingua di destinazione. Ciò rimuoverà alcune delle pagine indesiderate dai risultati. Vedi i risultati. Se un argomento attira la tua attenzione, fai clic sul pulsante “Details” e controlla la scheda Organic keywords per visualizzare i volumi di ricerca, i punteggi di difficoltà (KD) delle parole chiave e le posizioni in classifica delle parole chiave che inviano traffico alla pagina.Se la pagina si classifica nella prima posizione per quella che sembra una parola chiave con alto volume di traffico, allora il suo traffico è probabilmente un buon giudice del potenziale di traffico complessivo dell’argomento.Se la pagina si posiziona più in basso nella prima pagina, come nel caso di “losing weight while breastfeeding”, inserisci la parola chiave in Keyword Explorer e controlla il traffico verso le pagine prime in classifica nella panoramica SERP.Qui vediamo che alcune delle pagine di rango più elevato stanno ricevendo ancora più traffico e hanno solo pochi backlink.SUGGERIMENTOQuando fai l’analisi dei risultati in Content Explorer, tieni d’occhio il grafico del traffico organico.Se la pagina ha recentemente visto un notevole aumento del traffico e sembra riguardare un argomento degno di nota, ciò è probabilmente dovuto al posizionamento della pagina nella funzione SERP Top Stories.Di solito, questi non sono argomenti che vale la pena di stare appresso, poiché il potenziale di traffico a lungo termine non esiste.Cerca invece pagine in cui il grafico del traffico organico appare abbastanza coerente, in particolare per oltre sei mesi o più.Le parole chiave classificate in queste pagine tendono ad avere un potenziale di traffico a lungo termine migliore.4. Trova le parole chiave per cui vengono classificati i forumLa prima scelta di Google è raramente quella di classificare i contenuti generati dagli utenti perché sono spesso di bassa qualità e scritti male. Quindi, se vedi post dei forum tra i primi 10 risultati, questo è di solito un buon segnale di un argomento non competitivo.Ad esempio, questo thread su Quora si posiziona in primo posto per “differenza tra ddr3 e ddr4” e ottiene oltre 5.400 visite di ricerca al mese.Secondo a Keyword Explorer, questa parola chiave ha un punteggio di difficoltà (Keyword Difficulty) basso di 11. Ci sono anche altre pagine tra le prime 10 che ottengono centinaia di visite di ricerca mensili con pochi backlink.Per trovare parole chiave come queste, installa la Chrome extension SEO toolbar di Ahrefs e cerca in Google per forum su un argomento. Dai uno sguardo ai risultati della ricerca che hanno del traffico.Incolla uno dei forum in Site Explorer di Ahrefs, e controlla il rapporto Top Pages.Nota a margine. Se il forum si trova su un sottodominio, incolla il sottodominio in Ahrefs anziché il dominio principale (ad esempio forums.tomshardware.com, non tomshardware.com). Se il forum e tutti i suoi post si trovano in una sottocartella, incolla il percorso della cartella del forum in Ahrefs anziché del percorso principale (ad es. Pcpartpicker.com/forums/, non pcpartpicker.com). Probabilmente noterai che le parole chiave principali per molte di queste pagine sono di marca. Per risolvere questo problema, aggiungi un elenco di termini di marca separati da virgole al filtro “Exclude”. In questo caso, sarebbero cose come “pcpartpicker” e “pc part picker”. Utilizza il filtro di destinazione per escludere solo parole chiave contenenti questi termini, non URL.Controlla l’elenco delle pagine con traffico relativo alle parole chiave che potresti prendere di mira.Se trovi dei trend, incolla alcuni termini correlati in Keyword Explorer, vai al rapporto Phrase Match e usa il filtro “Include” per trovare parole chiave più simili.Ad esempio, ci sono alcune parole chiave “[modello cpu] vs [modello cpu]” nell’elenco sopra. Quindi cerchiamo un po ‘di numeri di modello del processore in Keyword Explorer, andiamo al rapporto Phrase Match e aggiungiamo “vs” al filtro “Include” per trovare più parole chiave di comparazione.5. Trova nuove parole chiave in Google Search ConsoleSe hai mai usato Google Search Console, saprai che il rapporto “Risultati della ricerca” mostra le parole chiave per le quali sei classificato. Molte di queste saranno parole chiave che stai già prendendo di mira con i contenuti, ma non tutte.Quindi, ecco un modo semplice per trovare nuove idee di argomento:Cerca parole chiave con impressioni alte correlate ad argomenti che non ricordi avere già come obiettivo.Ad esempio, per noi, una delle parole chiave che vediamo con molte impressioni è “amazon affiliate”.Non ricordo di aver scritto su questo argomento, quindi filtriamo la parola chiave e controlliamo la scheda Pagine per vedere quali post sono classificati.Sembra che sia la nostra lista di successful Amazon affiliate websites.Se controlliamo le pagine di alto rango per la parola chiave in Keyword Explorer, vediamo che nessuna di esse è un elenco di siti affiliati. Sono principalmente guide per fare soldi come un affiliato di Amazon.Dato che questi post ricevono tonnellate di traffico e il nostro set di strumenti può aiutare con la creazione di un redditizio sito di affiliazione Amazon, sarebbe un buon argomento di cui scrivere. Quel post corrisponderà meglio alle intenzioni di ricerca (search intent), quindi, si spera, possiamo posizionarci più in alto per questa parola chiave e aumentare il traffico del nostro blog.l’utilizzo di Google Search Console per questo funziona bene, ma c’è un aspetto negativo: sei limitato a 1.000 righe di dati.Se questo è un problema per te, utilizza invece il rapporto Organic Keywords in Site Explorer di Ahrefs. Questo mostra tutte le tue prime 100 classifiche dal nostro database di oltre 490 milioni di parole chiave.Ad esempio, possiamo vedere che il blog Ahrefs occupa oltre 73.000 parole chiave negli Stati Uniti.Se questo porta le cose da un estremo all’altro e ora hai troppe parole chiave per passare al setaccio, restringi il campo con un filtro del volume di ricerca.6. Trova parole chiave di affiliazione redditizie con potenziale di trafficoÈ facile trovare molte parole chiave per gli affiliati utilizzando il processo convenzionale in Keyword Explorer. Cerca solo alcune parole chiave correlate alla tua nicchia, controlla il rapporto Keyword Ideas, aggiungi parole come “migliore (best)”, “recensione (review)” e “top” al filtro “Include”.Ad esempio, se il tuo sito riguarda utensili da cucina, potrebbe apparire così:Nota a margine. Assicurati di separare le parole con virgole e scegli l’opzione “Qualsiasi parola (Any word)”.Tuttavia, mentre questo metodo funziona molto bene, può mancare alcune parole chiave.È anche facile escludere parole chiave con bassi volumi di ricerca, anche se l’argomento nella sua totalità potrebbe avere un elevato potenziale di traffico.Ad esempio, “best carbon steel pan” non sembra una grande parola chiave perché ha un volume di ricerca mensile di soli 100. Ma se controlli le pagine classificate più in alto, vedrai che stanno ottenendo una discreta quantità di traffico.Poichè occorrerebbe molto tempo per controllare manualmente le SERP per migliaia di parole chiave, ecco un modo più rapido per trovare argomenti per gli affiliati con potenziale di traffico:Incolla un sito di un affiliato concorrente in Site Explorer;Vai al rapporto Top Pages;Aggiungi una lista separata da virgole di parole come “migliore (best)”, “recensione (review)” e “top” al filtro Include.Cerca nell’elenco risultante delle parole chiave le pagine “migliore (best)[tipo di prodotto]” con traffico.Pensieri finaliLa ricerca di parole chiave può essere effettuata in vari modi. Mentre il tradizionale processo di ricerca di una parola chiave seme (seed) in uno strumento per keyword research e cercando idee sicuramente funziona, non dovresti limitarti a questo metodo.Cerchi idee per parole chiave non sfruttate? Leggi questo.Cerchi un collaudato framework di ricerca per parole chiave. Ecco qui.Hai domande? Ping me su Twitter.Tradotto da Federico Dedeu, consulente digitale. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Joshua Hardwick Head of Content @ Ahrefs (o, in parole povere, sono la persona che fa sì che ogni articolo pubblicato sul nostro blog sia EPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "6 Suggerimenti Per la Ricerca di Parole Chiave per Trovare Opportunità Non Sfruttate"
    },
    {
      "level": "H2",
      "text": "1. Decodifica le pagine più popolari dei tuoi concorrenti"
    },
    {
      "level": "H2",
      "text": "2. Esegui un’analisi del gap di contenuti (content gap analysis)"
    },
    {
      "level": "H2",
      "text": "3. Trova pagine con traffico organico e pochi o nessun backlink"
    },
    {
      "level": "H2",
      "text": "4. Trova le parole chiave per cui vengono classificati i forum"
    },
    {
      "level": "H2",
      "text": "5. Trova nuove parole chiave in Google Search Console"
    },
    {
      "level": "H2",
      "text": "6. Trova parole chiave di affiliazione redditizie con potenziale di traffico"
    },
    {
      "level": "H2",
      "text": "Pensieri finali"
    }
  ],
  "author": "Joshua Hardwick"
}