{
  "url": "https://ahrefs.com/blog/it/tattiche-marketing/",
  "slug": "tattiche-marketing",
  "title": "16 Tattiche di Marketing che Funzionano nel 2021",
  "description": "Le tattiche di marketing sono delle attività che ti avvicinano ai tuoi obiettivi di marketing. È come esegui la tua strategia di marketing per avere successo.",
  "content": "Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos. Contenuti Le tattiche di marketing sono delle attività che ti aiutano ad avvicinarti ai tuoi obiettivi di marketing. È il modo in cui esegui la tua strategia di marketing per far sì che abbia successo.Scegliere la tattica di marketing più adatta dipende dai tuoi obiettivi di marketing, budget, e chi è e dove si trova il tuo pubblico. Tieni queste cose a mente man mano che leggi queste 15 tattiche di marketing efficaci e collaudate:Promuovi i tuoi contenuti il più possibileRiproponi i contenutiAggiorna regolarmente i tuoi contenutiPubblica contenuti ottimizzati per Google DiscoverPosizionati organicamente per parole chiave di valore Ottimizza per i featured snippet e posizionati #1Aggiorna i link interni regolarmente per migliorare il posizionamentoSfrutta la tecnica dell’Intermediario per passare autorevolezza alle tue “pagine del denaro”Monitora e rispondi alle richieste su HAROCostruisci autorevolezza e link con il newsjackingSeleziona delle pubblicazioni rilevanti per fare guest postCrea delle campagne email di tipo dripSfrutta i canali di marketing meno utilizzati e più economiciUsa le sponsorizzazioniCrea un programma di affiliazioneUtilizza i codici del brand per essere memorabile1. Promuovi i tuoi contenuti il più possibilePubblichi regolarmente articoli sul tuo blog, crei video YouTube o registri podcast? Una cosa è creare contenuti stellari; un’altra è farli arrivare al tuo pubblico.La seconda parte del content marketing è più cruciale e complicata rispetto alla creazione del contenuto in sé.Puoi distribuire i tuoi contenuti in diversi modi:Condividerli sui socialPubblicarli su forum a temaInserirli nelle tue newsletterInviarli a persone influenti nella tua nicchiaSponsorizzarli tramite annunciNon tutti i contenuti sono però uguali fra di loro.Non ha senso inviare tutto quello che pubblichi a degli influencer. Fallo solo per i pezzi che reputi più interessanti e di valore.La stessa cosa vale per le sponsorizzazioni, in quanto non vuoi con molta probabilità spendere soldi su contenuti che hanno nessun o poco valore per la tua azienda.Dovresti invece impiegare la maggior parte delle forze su quelle piattaforme che hanno più senso per la tua attività. Per alcuni, potrebbe essere Twitter, LinkedIn, o un forum verticale. Per altri Instagram o Pinterest.La cosa migliore di questa tattica? Puoi condividere cose sui social media o far girare delle sponsorizzazioni verso i tuoi contenuti ogni volta che vuoi.Lettura consigliata: Content Marketing: Una Guida Completa2. Riproponi i contenutiAlle persone piace fruire i contenuti in diversi formati. Quindi perché non trasformare i tuoi articoli di blog in video e viceversa? Noi lo facciamo sempre.Ad esempio, il nostro video sulla SEO per YouTube ha più di 200k visualizzazioni:Abbiamo pubblicato lo stesso contenuto come articolo, che ci porta circa 1,4k click da ricerca organica ogni mese:Dati del Site Explorer di Ahrefs.Inoltre, avendo il contenuto in due formati, ci permette di occupare ben due posti nella SERP:Non hai tempo, soldi o competenze per produrre video? Puoi applicare lo stesso principio per riproporre i tuoi contenuti su articoli per i social. Ho scritto un articolo sulla Frequenza di Rimbalzo e, un mese dopo, ne ho estratto le parti migliori per trasformarle in una discussione su Twitter:Bounce RateOne of the most misunderstood Google Analytics metrics.9 things you might not have known.🦘//THREAD//— Michal Pecánek (@michalpecanek) December 2, 2020 È stato il mio più popolare tweet, che è entrato a far parte di numerose newsletter. Quando abbiamo semplicemente condiviso l’articolo, non c’era stata molta attenzione.3. Aggiorna regolarmente i tuoi contenutiLa maggior parte dei tuoi articoli non sarà sempre “fresca”. Alcuni potrebbero diventare irrilevanti con il passare dei mesi.Questo è un problema, in quanto la freschezza dei contenuti è essenziale—almeno per alcune chiavi di ricerca.Dai uno sguardo a questi risultati:La maggior parte delle pagine è stata aggiornata nelle prime settimane del 2021. Se noti un calo nel traffico organico verso alcuni dei tuoi articoli, potrebbe essere un segnale che è arrivata l’ora di aggiornarli e reclamare le tue posizioni nelle SERP.Questa è stata una parte della strategia di crescita del nostro blog, e dovrebbe esserlo anche per la tua. Come puoi notare, abbiamo aggiornato circa un terzo di tutti i nostri articoli almeno una volta:DalContent Explorer di Ahrefs.La ripubblicazione spesso porta a degli incrementi di traffico organico, come puoi vedere dai picchi qui sotto per uno dei nostri articoli:Lettura consigliata: Ripubblicare Contenuti: Come Aggiornare Vecchi Articoli Blog per la SEO4. Pubblica contenuti ottimizzati per Google DiscoverGoogle Discover è un feed piuttosto nuovo che suggerisce contenuti in base ai tuoi interessi:Ottimizzare i contenuti per Google Discover consiste principalmente nel pubblicare articoli su argomenti in tendenza o comunque molto popolari. Ma ci sono altre cose che dovresti fare:Avere un sito mobile-friendlyUtilizzare immagini uniche e di alta qualitàAllineare i tuoi contenuti ed i tuoi meta-tagLavorare sulla tua E‑A‑TAnche se probabilmente i contenuti non otterranno una tonnellata di traffico da Google Discover, questi consigli avranno comunque un impatto positivo sulla tua SEO. Lettura consigliata: Google Discover: Come Posizionarsi ed Ottenere Traffico5. Posizionati organicamente per parole chiave di valoreOgni mese, otteniamo oltre un milione di click verso il nostro sito solamente da Google:A dirla tutta, utilizzare la SEO al fine di posizionarci per parole chiave di valore su Google è il nocciolo della nostra strategia di marketing.Ma cosa rende una parola chiave di valore? Due cose.a) Potenziale di trafficoSolitamente, una buona regola generale per questo è guardare al volume di ricerca mensile che puoi trovare nel Keyword Explorer di Ahrefs:Ma il volume di ricerca può trarre in inganno, dovresti infatti controllare anche la stima di traffico organico che riceve la pagina meglio posizionata. Questo numero è solitamente una migliore stima del traffico che puoi ottenere posizionandoti, in quanto tiene in considerazione anche le altre parole chiave per cui la pagina si posiziona.b) Potenziale per la tua aziendaIl ‘potenziale per la tua azienda’ rappresenta quanto l’argomento sia di valore per il tuo business. Dopotutto, non ha senso creare contenuti su argomenti che non siano di valore per la tua azienda.Questo è il metodo che utilizziamo noi stessi per valutare il ‘potenziale per l’azienda’ di un dato argomento:3: il nostro prodotto è una soluzione irrimpiazzabile al problema;2: il nostro prodotto aiuta parecchio, ma non è essenziale per risolvere il problema.1: il nostro prodotto può solo essere menzionato fugacemente;0: non è possibile menzionare il nostro prodotto.Solitamente cerchiamo di intercettare tematiche che siano almeno un “2” o “3”. Questo articolo ne è la prova. Non solo ha molto potenziale di traffico, ma possiamo mostrare in maniera naturale e non forzata come Ahrefs può aiutarti ad eseguire molte di queste tattiche di marketing.Lettura consigliata: Cosa Sono i Contenuti SEO? Come Scrivere Contenuti che si PosizionanoCONSIGLIO ANZANZATODovresti anche prestare attenzione ad altre metriche SEO quando assegni la priorità ai tuoi contenuti. Una di queste è la Keyword Difficulty (KD). Questa giudica la difficoltà di posizionamento in base al numero di domini referring (il numero di siti che fornisce un link) delle pagine nelle prime 10 posizioni.Dato che i backlink sono uno dei più importanti fattori di posizionamento, la KD dovrebbe darti un’idea di contro chi ti metti nelle SERP.Di norma, le migliori opportunità sono nelle parole chiave con un alto potenziale di traffico e aziendale ma una bassa KD. Queste però non sono semplici da trovare. Solitamente è proprio il contrario—la KD tende a crescere con il potenziale di traffico e aziendale. Puoi iniziare a costruire la tua autorevolezza in una nicchia facendo leva su parole chiave con una bassa KD per poi concentrarti su quelle più competitive man mano che cresci.6. Ottimizza per i featured snippet e posizionati #1I featured snippet sono pezzi di informazione che Google mostra solitamente in cima ai risultati di ricerca. Forniscono una risposta alla query di ricerca estraendo contenuti da una delle pagine meglio posizionate.La cosa fantastica riguardo i featured snippet è che fanno da scorciatoia verso la prima posizione. Puoi posizionarti #7 per una parola chiave e diventare #1 in un balzo se Google decide che il tuo contenuto è adatto al featured snippet.Puoi facilmente identificare le opportunità per cogliere i featured snippet grazie al report Parole Chiave Organiche all’interno del Site Explorer di Ahrefs. Ti basta filtrare per le parole chiave che contengono un featured snippet e per le quali di posizioni già fra i primi 10, ma per le quali non hai ancora conquistato lo snippet:Ottimizzare per i featured snippet può essere complicato, ma per farla breve, devi allineare i tuoi contenuti a quelli che sono presenti nello snippet attuale.Ad esempio, lo snippet corrente per la parola chiave “backlinks” mostra una definizione:Questo significa che è quello che la maggior parte delle persone che ricercano vuole vedere. Possiamo incrementare le nostre possibilità di conquistare lo snippet fornendo una migliore definizione di “backlinks” sulla nostra pagina.Lettura consigliata: Come Ottimizzare per i Featured Snippet di Google7. Aggiorna i link interni regolarmente per migliorare il posizionamentoI link interni sono link da una pagina all’altra dello stesso dominio.Ottimizzare i link interni è una delle opportunità meno sfruttate e più semplici da portare a casa nella SEO, dato che incrementare il numero di link interni verso le pagine più importanti aiuta queste a posizionarsi meglio per due motivi: Aumenta l’autorevolezza a livello della pagina. Google utilizza un algoritmo chiamato PageRank per posizionare le pagine. In poche parole questo giudica “l’autorevolezza” di una pagina web in base ai link interni ed esterni che questa riceve. Migliora la rilevanza. Utilizzare anchor rilevanti per i link interni aiuta Google a capire di cosa parli la tua pagina, e posizionarla di conseguenza.Collegare fra di loro le pagine pertinenti sul tuo sito, è di beneficio quindi sia per i visitatori che per i tuoi sforzi SEO.Puoi trovare delle opportunità di inserimento di link interni grazie al Site Audit di Ahrefs. Dopo aver creato un progetto ed eseguito la scansione del sito, vai nel report Link Opportunities e aggiorna i tuoi link interni dove lo reputi necessario:https://www.youtube.com/watch?v=HWBBqJ0a2U4Lettura consigliata: Link Interni per la SEO: una Guida Pratica8. Sfrutta la Tecnica dell’Intermediario per passare autorevolezza alle tue “pagine del denaro”Può essere difficile costruire link direttamente verso le tue più importanti “pagine del denaro”. La Tecnica dell’Intermediario è un’ottima soluzione, che la rende una delle tecniche di link building più efficaci.L’idea è questa:Crea un contenuto che attragga backlinkAggiungi dei link interni a quella risorsa verso le tue pagine del denaroIl tipo di contenuto che funziona meglio dipende dalla nicchia nella quale ti trovi. Nel nostro caso, solitamente tendiamo a ricevere più link verso i nostri studi di dati, come puoi vedere dal report Migliore per link:I link in questi articoli che puntano ad altre pagine passano un ottimo ammontare di PageRank.Lettura consigliata: Una Semplice Strategia SEO (il Metodo ‘dell’Intermediario’)9. Monitora e rispondi alle richieste su HAROHARO sta per Help A Reporter Out. È un sito dove giornalisti, blogger e altri scrittori richiedono informazioni per i contenuti sui quali stanno lavorando.Tu puoi essere la loro fonte di informazioni. Iscriviti alle loro notifiche email, monitora le richieste nella tua categoria, e rispondi con informazioni di valore il più velocemente possibile quando vedi una buona opportunità. Si tratta di un’ottima tecnica di link building e PR, specialmente per i progetti in fase iniziale. Questo perché l’importante sono le tue credenziali e le informazioni che fornisci, piuttosto che il sito ed i relativi contenuti in sé.Ecco alcuni consigli dalla mia esperienza con HARO: Verifica il sito dove verranno pubblicate le informazioni. Evita quelli che non sono autorevoli o che sfruttano eccessivamente HARO. Fai il pignolo. Rispondi solo alle richieste per le quali sai che puoi fornire informazioni di valore. Rispondi il più velocemente possibile. Ci sono tante persone che stanno monitorando la tua stessa nicchia. Chiedi aiuto. Non esitare a chiedere aiuto a qualche collega se questo è più qualificato a rispondere. Attieniti alla forma corretta. Non deviare dal formato che l’autore richiede.Ecco un estratto di un invio di HARO andato a buon fine pubblicato su di un sito autorevole riguardo cosa fa CDN77 (un’azienda per la quale ho lavorato in passato). Ho ottenuto aiuto da un mio ex collega perchè non ero qualificato per fornire una risposta riguardo i “migliori strumenti per gli amministratori di sistema”.Lettura consigliata: Come Ottenere Link e l’Attenzione della Stampa Utilizzando HARO10. Costruisci autorevolezza e link con il newsjackingIl newsjacking è una tecnica PR che consiste nel fornire informazioni di valore riguardo eventi recenti ai media il prima possibile.Al contrario di HARO, questo richiede un monitoraggio costante di quello che sta succedendo nel mondo riguardo la tua nicchia, e proporre il tuo contributo da esperto ai siti di news prima che questi pubblichino qualcosa.Si tratta di una tecnica piuttosto avanzata, che può però portare a fantastici risultati:Building links on top tier domains in the financial/medical space builds trust and authority with GoogleIn 6 months, we drove a 329% increase in organic traffic for a forex trading client of ours and 53% increase in organic conversions. A thread on how… pic.twitter.com/jHJNZcjGu0— Carrie Rose (@CarrieRosePR) January 18, 2021 11. Seleziona delle pubblicazioni rilevanti per fare guest postFare guest post consiste nel creare e pubblicare contenuti per un altro sito web.I tre obiettivi principali che puoi avere con un guest post sono:Costruirti una reputazioneOttenere trafficoPozisionarti per parole chiave competitiveIl terzo obiettivo richiede probabilmente una spiegazione.Se non sei ancora un’autorità nella tua nicchia, alcune parole chiave saranno difficili da raggiungere. Quindi, mentre ti concentri sulle opportunità meno competitive in termini di parole chiave, puoi proporre contenuti su quelle più competitive ai siti più grandi del tuo settore.Certo, non sarai più il proprietario di quel contenuto, ma raggiungere tutti e tre gli obiettivi visti sopra vale sicuramente lo sforzo.Lettura consigliata: Fare guest blog per la SEO12. Crea delle campagne email di tipo dripÈ teoria comune che dovresti iniziare a costruire la tua lista di contatti email appena possibile. Ma poi? Certo, puoi inviare email regolarmente, ma una delle tecniche meno sfruttare è quella del drip email marketing.Le campagne drip sono una serie di email che partono in automatico a specifici intervalli di tempo quando un utente compie una specifica azione che sei in grado di tracciare.Una di queste azioni potrebbe essere fornire valore immediatamente a seguito della registrazione alla newsletter:L’email che inviamo ai nuovi iscritti.Quando si tratta però di trasformare i tuoi iscritti in utenti paganti, avrai probabilmente bisogno di più email in sequenza:L’esempio qui sopra è un pò troppo per i miei gusti, ma alla fine della giornata mi ha portato a convertire.Quindi, pensa agli obiettivi che vuoi centrare con le tue email, e fatti venire in mente una sequenza che possa aiutarti a raggiungerli. Questo potrebbe essere qualcosa di semplice come proporre un codice sconto sul primo acquisto quando un utente non completa una transazione ma ha inserito qualcosa nel carrello.13. Sfrutta i canali di marketing meno utilizzati e più economiciChiunque sa che può far girare annunci a pagamento su Google e Facebook. Questi canali funzionano, ma se il tuo pubblico è presente anche su piattaforme meno sature, puoi ottenere nuovi clienti a minor costo.Questi potrebbero essere dei canali specifici alla tuo pubblico, come motori di ricerca alternativi, o anche piattaforme di pubblicità meno conosciute come Quora o Brave Ads. Ho fatto girare degli annunci sponsorizzati su entrambe queste piattaforme, e hanno portato a risultati di gran lunga migliori di Google e FB Ads.Ma anche i contenuti organici possono funzionare bene. Guarda ad esempio il mio collega SQ che ha ottenuto oltre 1,6M di visualizzazioni dalle sue risposte su Quora:Lettura consigliata:Quora Marketing: ~1 Millione di Visualizzazioni Generate. Come Replicare il Nostro Successo14. Usa le sponsorizzazioniUna grossa fetta del nostro budget di marketing viene speso sulle sponsorizzazioni di podcast, eventi e newsletter. Si tratta del modo in cui spendiamo la maggior parte del nostro budget dedicato allo sviluppo del brand.Hai capito bene, sviluppo del brand. Indipendentemente dallo sponsor scelto, raramente questo porta delle vendite dirette. Ma porti ripetutamente di fronte al tuo pubblico con un messaggio efficace può fare meraviglie.Un esempio di sponsorizzazione del nostro prodotto nella newsletter di Marketing Examples.Puoi addirittura utilizzare un approccio più tradizionale. Dipende tutto dal tuo prodotto, il suo posizionamento e il tuo pubblico. C’è un motivo per il quale brand come HSBC hanno il loro logo sui ponti di molti aeroporti in bella vista, stessa cosa per il logo Omega di fianco ai cronometristi negli eventi sportivi.Lettura consigliata: Pubblicità su Podcast: $51.975 Spesi. Cosa Abbiamo Imparato15. Crea un programma di affiliazioneUn programma di affiliazione consente a chiunque di percepire una commissione quando ti porta un nuovo cliente. Motiva le persone a consigliare i tuoi prodotti ai loro amici, conoscenti e pubblico.Ecco alcune cose da considerare prima di intraprendere questa strada: Devi avere un prodotto fantastico. Alcuni affiliati potrebbero consigliare prodotti in cui non credono loro stessi, ma questo può portare a problemi nel lungo termine. Studia i programmi di affiliazione dei tuoi concorrenti. Alcuni potrebbero essere piuttosto aggressivi, e potrebbe non valere la pena competere con loro. Fai i conti. Devi avere un buon rapporto fra i profitti e le commissioni che eroghi e che spingono gli affiliati a consigliare i tuoi prodotti.Ad Ahrefs, abbiamo deciso di interrompere il nostro piccolo programma di affiliazione qualche anno fa. Dato che ora siamo uno strumento SEO affermato nel settore, le persone ci consigliano attraverso il passaparola, senza il bisogno incentivi monetari.Creare un programma di affiliazione è un ottimo metodo per ottenere esposizione all’inizio. Ma devi pensarci bene. Ricalibrare le commissioni o chiudere il programma in un secondo momento può portare a non pochi problemi.16. Utilizza i codici del brand per essere memorabileIl codice del brand è tutto quello che utilizzi regolarmente a livello comunicativo.Tutti hanno un logo e degli stili grafici. Ma questo è tutto solitamente per la maggior parte dei brand. Non è però abbastanza per risaltare e fissarti nella mente del tuo pubblico obiettivo.Dovresti invece scegliere strategicamente 3–5 codici del brand (ovvero delle risorse distintive). Puoi poi utilizzarli nelle tue comunicazioni come mezzo tecnico per l’esecuzione di una strategia.Ad Ahrefs, a parte il nostro logo ed il colore blu, abbiamo altri due codici del brand. Il primo è il nostro font personalizzato:Il secondo è la nostra mascotte, un ragazzo barbuto spesso accompagnato da un corgi:Non esistono limiti alla creatività. Tutto quello che conta è scegliere qualcosa con il quale vuoi che il tuo brand venga associato e utilizzarlo con consistenza.Altri esempi di codici di brand possono includere emoji personalizzate, gif, parole uniche, tagline, o addirittura stili utilizzati negli annunci pubblicitari. Pensa ad esempio alle campagne di MasterCard “per tutto il resto c’è MasterCard”.ConclusioniLe tattiche di marketing dipendono da prodotto, prezzo, luogo (place) e promozione. Queste sono le famose “4P del marketing mix”.Come avrai potuto notare, la maggior parte delle tecniche qui sopra si concentra sulla promozione. Questo perché creare prodotti che soddisfino i bisogni del tuo pubblico e ottimizzare il prezzo al fine di ottenere la migliore profittabilità dipende anche dal buon senso.Detto questo, tutte le “P” sono fondamentali, mentre la maggior parte dei marketer tende a focalizzarsi sulla promozione dimenticando tutto il resto. Non farlo. Fai delle ricerche di mercato e crea una solida strategia basandoti su di essa, concentrandoti poi su tutte e 4 le P.Domande? Scrivimi su Twitter.Tradotto da Matteo Ginnetti, Consulente Digital Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Michal Pecánek Marketer e scrittore di contenuti ad Ahrefs. Appassionato di SEO, aviazione, profumi, sushi e tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "16 Tattiche di Marketing che Funzionano nel 2021"
    },
    {
      "level": "H2",
      "text": "1. Promuovi i tuoi contenuti il più possibile"
    },
    {
      "level": "H2",
      "text": "2. Riproponi i contenuti"
    },
    {
      "level": "H2",
      "text": "3. Aggiorna regolarmente i tuoi contenuti"
    },
    {
      "level": "H2",
      "text": "4. Pubblica contenuti ottimizzati per Google Discover"
    },
    {
      "level": "H2",
      "text": "5. Posizionati organicamente per parole chiave di valore"
    },
    {
      "level": "H4",
      "text": "a) Potenziale di traffico"
    },
    {
      "level": "H4",
      "text": "b) Potenziale per la tua azienda"
    },
    {
      "level": "H2",
      "text": "6. Ottimizza per i featured snippet e posizionati #1"
    },
    {
      "level": "H2",
      "text": "7. Aggiorna i link interni regolarmente per migliorare il posizionamento"
    },
    {
      "level": "H2",
      "text": "8. Sfrutta la Tecnica dell’Intermediario per passare autorevolezza alle tue “pagine del denaro”"
    },
    {
      "level": "H2",
      "text": "9. Monitora e rispondi alle richieste su HARO"
    },
    {
      "level": "H2",
      "text": "10. Costruisci autorevolezza e link con il newsjacking"
    },
    {
      "level": "H2",
      "text": "11. Seleziona delle pubblicazioni rilevanti per fare guest post"
    },
    {
      "level": "H2",
      "text": "12. Crea delle campagne email di tipo drip"
    },
    {
      "level": "H2",
      "text": "13. Sfrutta i canali di marketing meno utilizzati e più economici"
    },
    {
      "level": "H2",
      "text": "14. Usa le sponsorizzazioni"
    },
    {
      "level": "H2",
      "text": "15. Crea un programma di affiliazione"
    },
    {
      "level": "H2",
      "text": "16. Utilizza i codici del brand per essere memorabile"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Michal Pecánek"
}