{
  "url": "https://ahrefs.com/blog/it/tipi-di-marketing/",
  "slug": "tipi-di-marketing",
  "title": "18 Tipologie di Marketing (Con Esempi)",
  "description": "Scopri tutto sui 18 diversi tipi di marketing che puoi utilizzare per far crescere la tua attività.",
  "content": "Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate. Contenuti Quando parliamo di marketing, non ci riferiamo ad un solo tipo di attività. Esistono infatti tantissimi tipi di marketing, ciascuno diverso dall’altro.Per semplificare la classificazione, nel corso del tempo sono stati individuati 18 tipi diversi di marketing, tutti testati e provati da generazioni di persone esperte in vari settori.È anche probabile che, oggi, a ciascun tipo di marketing sia dedicata una conferenza annuale da qualche parte del mondo.Ed è facile trovare esempi delle 18 tipologie di marketing nella vita quotidiana, dal momento che vengono utilizzate e mescolate per diventare ancora più efficaci. E chissà, magari in questa lista è nascosto il segreto del successo di marketing della prossima azienda che cambierà il mondo!Ognuna delle tipologie di marketing individuate è diversa dalle altre ma molte possono essere utilizzate in parallelo e insieme per una crescita organica costante e resistente ai problemi.In questo articolo tratteremo i seguenti tipi di marketing:Marketing digitaleMarketing offlineInbound marketingOutbound marketingContent marketingSearch engine marketingGrowth marketingMarketing B2BMarketing B2CAffiliate marketingSocial media marketingBrand marketingMarketing direttoInfluencer marketingE‑mail marketingMarketing del passaparolaEvent marketingGuerrilla marketing1. Marketing digitaleIl termine marketing digitale indica qualsiasi tipo di attività promozionale che utilizza Internet come canale primario. Di conseguenza anche due diverse tattiche di marketing, SEO e PPC, sono considerate parte del marketing digitale.Questo termine viene spesso utilizzato per differenziare le tattiche di marketing online da quelle di marketing offline. EsempioIn Ahrefs, utilizziamo varie tattiche e strumenti di marketing digitale per condividere la nostra esperienza nella SEO, nel marketing e promuovere il nostro prodotto.Molto spesso un argomento particolare, per esempio la checklist SEO, viene utilizzato in un post pubblicato sul blog, quindi riproposto su altre piattaforme e promosso attraverso canali diversi; tutto questo è marketing digitale.Ecco un tweet con la checklist SEO compressa in un’unica infografica.Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021Abbiamo anche promosso la checklist utilizzando la pubblicità online. In questo caso, abbiamo scelto i Quora Ads:Ed ecco la nostra newsletter settimanale, la Weekly Digest, all’interno della quale abbiamo promosso il post originale:Leggi anche: 7 Strategie di Marleting Digitale Che Funzionano Davvero2. Marketing offlineA differenza del marketing digitale, il marketing offline (spesso chiamato anche marketing tradizionale) è un termine generico che indica qualsiasi tipo di attività di marketing che non fa uso di Internet.Se un annuncio viene pubblicato su una rivista cartacea anziché su una rivista online, si tratta di marketing offline. Ed è marketing offline anche l’invio di un messaggio personalizzato tramite posta ordinaria anziché via e‑mail.Sebbene parole come “offline” e “tradizionale” possano dare l’impressione che questo tipo di marketing sia un ricordo del passato, la pubblicità sulle riviste stampate o durante i programmi televisivi non è ancora scomparsa.Infatti, secondo Statista, gli annunci in televisione hanno ancora la copertura più ampia tra tutti i tipi di annunci.EsempioTra il 1999 e il 2002, l’azienda produttrice di birra Anheuser-Busch promosse la sua birra Budweiser con uno spot televisivo che è oggi considerato un vero e proprio fenomeno culturale.La campagna “Whassup?” ha vinto numerosi premi pubblicitari, tra cui il Gran Premio di Cannes, e ha permesso all’azienda di aumentare le vendite passando da 2,4 milioni di barili di birra a ben 99,2 milioni di barili nel 2020.https://www.youtube.com/watch?v=JJmqCKtJnxM3. Inbound marketingL’inbound marketing è una strategia di marketing che mira ad attirare i clienti con contenuti pertinenti e utili.Per comprendere meglio questo termine, confrontiamolo con l’outbound marketing.Se l’outbound marketing cerca di raggiungere l’utente con un messaggio che va ad “interrompere” qualcosa (esempi classici sono la pubblicità in tv, il PPC, i cartelloni pubblicitari), l’inbound marketing punta tutto sulla creazione di una situazione per cui il potenziale cliente è messo nella condizione di scoprire un’azienda mentre cerca una soluzione.Un esempio classico è quello di una persona che sta cercando qualcosa su Google e si imbatte in un articolo estremamente rilevante pubblicato sul sito di un’azienda.EsempioGli strumenti gratuiti di Ahrefs, per esempio il backlink checker gratuito, sono pensati proprio seguendo i principi dell’inbound marketing.Attirano infatti i clienti dalle pagine dei risultati dei motori di ricerca (SERP) per chiavi di ricerca come “backlink checker” o “analisi dei backlink”. Se i volumi di ricerca sono elevati, questo tipo di strumento gratuito può portare una quantità significativa di traffico organico:Lettura consigliata: Che Cos’è l’Inbound Marketing? La Guida per Iniziare4. Outbound marketingL’outbound marketing è una forma di marketing che “interrompe” altro; è una forma di marketing che prevede che un’azienda invii un messaggio relativo ad un prodotto ad un potenziale cliente chiamandolo al telefono, inviando e‑mail anche non richieste, inviando messaggi di posta ordinaria, etc.L’outbound marketing cerca di aumentare la consapevolezza relativa ad un prodotto o di spingere ad una certa azione (ad esempio l’acquisto, la stipula di un abbonamento, la visita a un negozio) indipendentemente dall’interesse del pubblico nei confronti di quel determinato prodotto o servizio.EsempioLuoghi come Times Square a New York sono stati utilizzati per attività di outbound marketing e ottenere successo e, oggi, sono saturi sia in termini di spazio utilizzato per trasmettere il messaggio che di budget necessario. Parte di ciò che puoi vedere nell’immagine qui sotto è oubound marketing tramite cartelloni pubblicitari.5. Content marketingIl content marketing è il processo di creazione e distribuzione di contenuti per attrarre e fidelizzare i clienti.Il content marketing è solitamente praticato come una forma di inbound marketing, in cui il contenuto offre una soluzione ad un problema per il cliente che cerca. I potenziali clienti scoprono i prodotti o i servizi imparando a conoscere il modo in cui vengono utilizzati.Il content marketing viene spesso utilizzato per generare lead e in questi casi il contenuto premium viene protetto e per accedervi è necessario inserire informazioni personali come nome, numero di telefono o e‑mail. Successivamente, queste informazioni verranno utilizzate per altre tattiche di marketing (incluso l’outbound marketing).EsempioAlcuni tipi popolari di content marketing sono:Articoli del blogVideo e vlogPodcastWebinarCasi studioE‑BookWhite paperEcco un esempio di come alcuni possono essere utilizzati in una strategia di content marketing efficace e coerente:Letture consigliate:Content Marketing: La Guida Completa per il 2021 Come Creare Una Content Strategy Vincente7 Ottimi Esempi Di Content Marketing (E Come Copiarli)6. Search engine marketing (SEM)Il search engine marketing è un termine utilizzato per descrivere i messaggi promozionali che appaiono sulle SERP. Il SEM divide questi due tipi di messaggi in due categorie: risultati a pagamento e risultati organici.I risultati organici sono pagine che un motore di ricerca come Google trova, scansiona e indicizza sulla sua SERP. La posizione sui risultati organici non può essere acquistata, solo influenzata dal content marketing e dalla SEO.I risultati a pagamento sono una forma di pubblicità pay-per-click. Le aziende pagano i motori di ricerca per partecipare a un’offerta competitiva che permetta loro di posizionare al meglio i loro annunci rispetto ai competitor.EsempioSupponiamo che tu voglia posizionarti nella prima pagina di Google per la parola chiave “marketing automation” negli Stati Uniti. Hai due modi per farlo: uno è attraverso risultati a pagamento e l’altro è attraverso risultati organici.I risultati a pagamento saranno visualizzati in questa forma:I risulati organici saranno invece visualizzati in questa forma:Come puoi vedere, i risultati sembrano simili (e si adattano a ciò che Google vuole). La differenza principale è che i risultati a pagamento costeranno all’inserzionista circa 50 $ per clic così da apparire in cima alla lista.Al contrario, per posizionarsi organicamente e senza pagare, l’inserzionista dovrà creare contenuti pertinenti che corrispondano all’intento di ricerca e ottenere molti link da siti esterni.Lettura consigliata:SEO vs. SEM: Quali Sono le Differenze e Perché Devi Conoscerle?7. Growth marketing Il growth marketing è il processo per aumentare i ricavi di un’azienda applicando un approccio basato sulla sperimentazione e che considera tutte le fasi di interazione con l’utenza.Il growth marketing è un altro termine che viene spesso utilizzato in contrasto con “marketing tradizionale”. Questo perché quando il growth marketing è entrato in scena nei primi anni del 2000, è stato rapidamente adottato dalle startup che avevano bisogno di un approccio diverso che le aiutasse a:Competere con aziende già affermate;Attirare l’attenzione degli investitori dimostrando di utilizzare tattiche di crescita scalabili.La seguente tabella riassume le differenze tra growth marketing, “marketing tradizionale” e growth hacking.EsempioCi sono molte storie di aziende che hanno utilizzato il growth marketing per crescere: Slack, Spotify, Uber e Square, tra le altre.Ma voglio focalizzarmi sulla strategia di growth marketing di Notion perché sembra che abbiano azzeccato quasiasi aspetto di questa tattica. Inoltre è stata analizzata tantissime volte, quindi è un ottimo esempio da cui imprenditori e marketer possono imparare.Il successo di Notion si basa su molti elementi: un ottimo prodotto, una comunità enorme e attiva e un modello “freemium”.Lavorano con il growth marketing ma senza adottare tecniche scorrette o ai limiti. E stanno crescendo rapidamente, con una strategia incentrata sul cliente, che non mette a rischio la reputazione del brand e punta al lungo termine.Molti sottolineano anche il ruolo dei modelli generati dagli utenti nel successo di Notion. L’azienda infatti incoraggia la creazione e la condivisione di modelli utilizzabili per vari documenti e operazioni.Gli utenti di Notion creano modelli che attraggono, coinvolgono e sono utili per altri utenti. Molti di questi nuovi utenti creeranno e condivideranno i propri modelli e il ciclo andrà avanti all’infinito.Questa grafica di Foundation spiega perfettamente come questa tattica si rivolga all’intero funnel di marketing per garantire la crescita.8. Marketing B2BIl marketing B2B, o marketing business-to-business, si riferisce alla commercializzazione di prodotti o servizi da parte di aziende che si rivolgono ad altre aziende.Questo termine è spesso usato da chi si occupa di marketing per dare un nome e differenziare tipi di strategie e tecniche di marketing particolarmente efficaci nelle relazioni B2B (per esempio quando si parla di account-based marketing), che sono diverse da quelle utilizzate nelle relazioni business-to-consumer (B2C).EsempioAlle aziende piace fare pubblicità su LinkedIn. Il motivo? I suoi utenti accedono alla piattaforma per scopi di lavoro. LinkedIn ne trae vantaggio (ed è così che il modello di business è stato pensato) e offre un assortimento di prodotti pubblicitari.Oggi LinkedIn detiene un terzo di tutte le entrate pubblicitarie display nel settore B2B negli Stati Uniti. Come puoi vedere di seguito, anche giganti come IBM utilizzano gli annunci di LinkedIn per attirare clienti.Questo annuncio B2B rimanda ad un modulo di acquisizione dei lead che offre crediti gratuiti per l’utilizzo del servizio di IBM Cloud.Letture consigliate:La Guida All’Account-Based Marketing (ABM) Per Principianti Che cosa si intende per B2B Content Marketing? 7 Esempi di Successo9. Marketing B2CIl marketing B2C, o marketing business-to-consumer, si riferisce alla commercializzazione di prodotti o servizi da parte delle aziende che si rivolgono direttamente ai consumatori.Questo termine è spesso utilizzato da chi si occupa di marketing per dare un nome e differenziare tipi di strategie e tattiche di marketing particolarmente efficaci nelle relazioni B2C (per esempio l’influencer marketing), che sono diverse da quelle utilizzate nelle relazioni B2B. EsempioIl marketing B2C è ovunque. Non ho nemmeno bisogno di citare studi per dimostrare da quanta pubblicità siamo circondati; basta guardarsi intorno.Tutte le cose che possiedi le avrai probabilmente acquistate a causa del marketing B2C. Ciò significa che o hai visto una qualche forma di promozione B2C che ti ha spinto a fare un acquisto o hai sentito qualcuno che ha acquistato il prodotto, te ne ha parlato bene e hai deciso di acquistarlo anche tu.Voglio raccontarti una storia.Un giorno stavo facendo le mie cose, senza alcuno scopo. Ad un certo punto, ho ricevuto un’e-mail da Vans che mi avvisava di una vendita speciale nel suo negozio. Senza pensarci troppo, ho cliccato.Quell’e-mail (in lingua polacca) mi ha indirizzato a questa pagina, dove ho visto queste scarpe.Era esattamente quello di cui avevo bisogno. Quindi, pochi giorni dopo, le scarpe si sono materializzate a casa mia.E questa è la breve storia di come il marketing B2C mi ha fatto comprare scarpe in pochissimi secondi e senza nemmeno visitare il negozio per provarle. Pensa: stavo facendo qualcosa di completamente diverso e non avevo alcuna intenzione di comprare delle scarpe!Chiaramente non tutte le e‑mail riescono a persuaderci e in questo caso il potere del brand ha fatto la differenza, considerando che Vans è una delle mie marche preferite.Con e‑mail come queste e offrendo la possibilità di acquistare online, un brand può capitalizzare su ogni attività in cui ha investito, facendosi conoscere, apprezzare e permettendo all’utente di fidarsi.10. Affiliate marketingL’affiliate marketing è un tipo di attività in cui un’azienda paga una commissione a un sito esterno per il traffico o le vendite da esso generate.É possibile individuare i link di affiliazione facilmente sui blog in quanto contengono parametri di monitoraggio come “tag”, “hop” o “customid”.Ciò significa che la persona che gestisce il sito riceve una commissione ogni volta che qualcuno clicca su quel link o acquista qualcosa tramite quel collegamento. In questo modo, l’azienda pagante premia gli affiliati per aver influenzato i loro profitti.EsempioQuesta blogger in questo post spiega come ha aumentato di cinque volte le entrate del suo blog di cucina in tre mesi utilizzando, tra le varie tattiche, l’affiliazione.Qualcuno ha acquistato pillole ai funghi per un valore di 3.240 $ su Amazon dopo aver cliccato su un link presente sul blog; in questo modo, i proprietari del blog hanno ricevuto 145 $ solo quel giorno, 24 ore dopo aver pubblicato un articolo relativo alle pillole ai funghi.Da questa storia escono tutti vincitori: il produttore, il rivenditore, Amazon, il blog e presumibilmente anche la persona che ha acquistato le pillole.Esiste un’altra forma di marketing di affiliazione che a volte viene chiamata marketing in partnership (sebbene questo termine abbia almeno due significati diversi).È quando coloro che progettano soluzioni mettono in piedi un programma partner per altre aziende in modo da stimolare la domanda e l’adozione di un prodotto o servizio, utilizzando le capacità di mercato di coloro che partecipano al programma.Ecco per esempio come Microsoft presenta il suo programma per i partner: “Il Microsoft Partner Network è un hub di persone, risorse e offerte in un unico posto che ti offrono tutto tutto ciò di cui hai bisogno per creare e fornire soluzioni di successo ai tuoi clienti”.Letture consigliate:Affiliate Marketing per Principianti: 7 Modi per Avere Successo Come Costruire un Sito Affiliato ad Amazon di Successo (Guida Passo Passo)11. Social media marketingIl social media marketing è l’uso di social media come Facebook, Twitter o LinkedIn per commercializzare prodotti o servizi di un’azienda.L’obiettivo dei social media è far crescere il pubblico e stimolare l’interazione. Ciò rende più conosciuto il brand, aumenta il traffico al sito e, infine, genera vendite.Il social media marketing prevede l’utilizzo di diverse tattiche, tra cui la pubblicazione di contenuti, la risposta ai commenti e la pubblicazione di annunci sui social media.EsempioL’account Twitter di Wendy’s è diventato una sorta di leggenda. Ecco perché:Tutto è iniziato con una serie di risposte ironiche e al vetriolo che non hanno mai risparmiato nessuno. All’inizio è stata la risposta ad un commento non troppo brillante di un utente che ha reso l’account quello che conosciamo e vediamo oggi.Questo tono di voce ha permesso ai messaggi di Wendy di essere percepiti come autentici e ha fatto in modo che quelli dei suoi competitors venissero percepiti come robotici e non personali.E mentre sempre più persone si collegavano a Twitter per vedere cosa avrebbe scritto l’account social di Wendy’s, è arrivato quello che è diventato il terzo tweet più ritwittato della storia:HELP ME PLEASE. A MAN NEEDS HIS NUGGS pic.twitter.com/4SrfHmEMo3— Carter Wilkerson (@carterjwm) April 6, 2017L’utente non ha ricevuto 18 milioni di retweet (solo 3,1 milioni) ma Wendy’s lo ha comunque ricompensato con un anno di crocchette di pollo gratis. Wendy’s ha dimostrato non solo di saper attirare l’attenzione della gente ma anche di essere in grado di mantenere le sue promesse (una cosa per cui le catene di fast food non sono famose).Ci sono tantissimi casi di studio relativi all’approccio di Wendy’s sui social network (per esempio quello di GroupNug o quello di March Madness). Ma nonostante si spinga sempre oltre il seminato con attività di marketing virali, allo stesso tempo Wendy’s non dimentica che i social media sono anche strumenti per il servizio clienti e per promuovere la propria attività.12. Brand marketingBrand marketing è un termine per descrivere le azioni che promuovono un prodotto o servizio in modo da mettere in evidenza il brand e plasmare la sua immagine.Che cosa si intende per brand?Nel marketing di oggi è abbastanza difficile dare una definizione che sia esaustiva e soddisfacente. Dopotutto, il brand marketing non è univoco! Prendiamo degli esempi di brand molto forti e pensa a ciò a cui associ ciascuno di loro.AppleMastercardThe AvengersFacebookBMWCoca-ColaChe immagine hanno suscitato nella tua mente o a cosa li hai associati? Hanno evocato un determinato sentimento e ricordo? Ecco cosa si intende per brand: elementi che scatenano reazioni cognitive ed emotive.Quindi è meno importante quali sono i brand ed è più importante quello che fanno. E questo è l’obiettivo del brand marketing: rafforzare l’effetto che i marchi hanno sui consumatori e fare in modo che: Riconoscano il prodotto (e lo distinguano dagli altri): lo scopo è che tu ti chieda, “È questa la deliziosa barretta di cioccolato che ho mangiato l’ultima volta?”; Associno il prodotto ad un’esperienza positiva: potresti anche non aver provato il prodotto ma se la voglia di assaggiarlo ti rende felice, è abbastanza; Razionalizzino il costo del prodotto: le BMW non sono le auto meglio costruite al mondo. E non sono nemmeno le più economiche. Tuttavia, si dice ancora che la BMW è la “macchina per eccellenza”.I consumatori non sono gli unici possibili bersagli del brand marketing. Le aziende possono utilizzare questo tipo di marketing anche per aumentare la propria valutazione in borsa o per attirare talenti nella propria azienda (employer branding).EsempioIn tutta onestà, mi sono innamorato subito di questo annuncio. Mi ha fatto venire voglia di acquistare dei LEGO e di “ricostruire il mondo”.https://www.youtube.com/watch?v=XraFU5BjYjQL’annuncio mostra poco del prodotto LEGO ma, soprattutto, mette in risalto il brand e ne modella l’immagine.Non so se concordi con me, ma questo annuncio definisce i LEGO come giocattoli positivi, non violenti e cognitivamente stimolanti per tutti.Inoltre, li caratterizza come i giocattoli per chi costuirà il futuro. Un mondo costruito sulla diversità, il rispetto e l’aiuto reciproco; un mondo dove la somma dei fattori è più di zero.E non importa quale set LEGO comprerò: sono tutti così e tutti stimolano le stesse reazioni. È attraverso il brand marketing che LEGO è riuscita a trasmettere quel messaggio in soli 60 secondi.13. Marketing direttoIl marketing diretto è una strategia in cui l’azienda comunica direttamente con il pubblico di destinazione invece di utilizzare i media.Il marketing diretto viene solitamente scelto per il suo costo inferiore (rispetto ai media), la capacità di personalizzazione del messaggio e la possibilità che il pubblico risponda al messaggio (ad esempio attraverso un modulo).EsempioSiamo tutti destinatari del marketing diretto. La prova di ciò è la piccola scatola di metallo accanto alla cassetta delle lettere che molti di noi hanno, progettata per tenere in ordine i volantini e i cataloghi indesiderati. E la sua presenza è facilmente individuabile grazie a questi cartelli, che appaiono pressoché ovunque:Ma voglio farti vedere un esempio positivo ed efficace di marketing diretto: i primi cataloghi di Ikea.Ikea iniziò la sua attività in questo modo e all’inizio non vendeva principalmente mobili, ma di tutto. Questo è un esempio di un catalogo Ikea inviato per corrispondenza nel 1950:Oggi, possiamo semplicemente andare al negozio Ikea e acquistare quello che ci serve. Nessuno ha bisogno di inviarci nulla. Meglio ancora, possiamo vedere il catalogo online ed effettuare un acquisto senza neanche uscire di casa.Ed è stata questa l’idea alla base dei primi cataloghi Ikea che vennero pubblicati in un mondo senza internet e con pochissimi televisori. Fu una soluzione ingegnosa (ma non proprio originale) per raggiungere molti potenziali clienti e “ridurre i vincoli” nell’acquisto dei prodotti.Inoltre, per le persone che vivono in aree remote della Svezia, i cataloghi rappresentavano varietà e stile direttamente alla porta di casa.14. Influencer marketingL’influencer marketing è la pratica di lavorare con persone influenti per promuovere aziende, prodotti o servizi.Un influencer può essere chiunque abbia una rete significativa di contatti, o “follower”, e/o che sia un’autorità in un determinato campo.I meccanismi di influenza sfruttati in questo tipo di marketing possono assumere molte forme: ispirazione, fiducia, capacità di influenzare e imitazione. L’influencer marketing è efficace perché seguire gli esempi o i consigli degli altri aiuta le persone a fare delle scelte.Inoltre, poiché la possibilità di influenzare e farsi influenzare è un fenomeno caratterizzante le relazioni umane, l’influencer marketing funziona sia nel B2B che nel B2C.EsempioEcco un esempio di influencer marketing che ha funzionato.La YouTuber Meredith Foster è stata uno delle poche influencer accuratamente selezionate per promuovere la nuova linea di smartphone di Motorola.Il canale di Meredith conta ben 4,8 milioni di iscritti. Confrontalo con la portata media della programmazione di notizie negli Stati Uniti ed è facile capire perché l’influencer marketing può essere una strategia potente.Lettura consigliata: Influencer Marketing nel 2021: Definizione, Esempi e Strategie15. E‑mail marketingL’e-mail marketing è qualsiasi tipo di messaggio di marketing effettuato via e‑mail.Detto questo, l’e-mail marketing non è solo l’invio di e‑mail. Implica infatti:Costruire una mailing list;Progettare e inviare e‑mail ad un elenco di iscritti;Monitorare i risultati;Curare la mailing list.Questo tipo di marketing ha quattro scopi principali: Generare traffico: puoi comunicare con il tuo pubblico via e‑mail con l’obiettivo di portarli dall’e-mail a una pagina specifica, ad esempio quella dove hai pubblicato dei contenuti specifici; Coltivare le relazioni: questo include le cosiddette campagne programmate utilizzate metodicamente per inviare e‑mail che guidano gli utenti al compimento di un’azione, per esempio portandoli a concludere un acquisto. Questo processo determina anche il tipo di lead e al tipo di relazioni da coltivare, per esempio per i fan del brand o per quelli del prodotto specifico; Onboarding: si tratta di una sequenza di e‑mail inviate secondo un apposito “ciclo di vita” che permette al cliente di scoprire e provare il valore del prodotto ed eventualmente acquistarlo. L’uso classico della strategia di onboarding via e‑mail è durante ilo periodo di prova di un prodotto SaaS. Generare entrate: Esattamente quello che Vans ha fatto con me. I brand spesso offrono ai clienti un incentivo per iscriversi a una newsletter, ad esempio il 20% di sconto sull’acquisto successivi. Quindi a fronte dell’iscrizione invieranno offerte speciali.EsempioDal momento che ti ho mostrato due esempi di e‑mail in precedenza e dal momento che probabilmente ricevi e‑mail in abbondanza, ecco un’illustrazione per farti vedere come funziona il flusso di lavoro nell’e‑mail marketing.In questa semplice campagna e‑mail a rilascio scaglionato, ai destinatari vengono inviate automaticamente e‑mail in base a quanto sono interessati e coinvolti.Se i destinatari reagiscono positivamente alle e‑mail, riceveranno materiali didattici più approfonditi e persino una demo del prodotto.Ma se non aprono le e‑mail successive, vengono spostati su un percorso che comprende materiali educativi meno dispendiosi in termini di tempo e alla fine verranno rimossi dal flusso di e‑mail.Questo tipo di flusso di lavoro peculiare dell’e‑mail marketing può essere progettato tramite un editor WYSIWYG (Vedi ciò che progetti mentre lo stai progettando) in molti dei programmi per l’e‑mail marketing senza dover imparare la programmazione.16. Marketing del passaparolaIl marketing del passaparola è il processo per influenzare e incoraggiare discussioni naturali su un prodotto, servizio o azienda.Nell’uso quotidiano, può descrivere due tipi di situazioni: Passaparola come un “effetto collaterale” naturale delle operazioni di un’azienda, per esempio quando si superano le aspettative dei consumatori su un prodotto o servizio. In tali casi, l’azienda potrebbe non avere intenzione di influenzare attivamente le discussioni ma il modo in cui agisce crea un’esperienza così forte che i clienti vogliono condividerla con amici, familiari, follower sui social media, ecc. Il passaparola tattica utilizzata per influenzare intenzionalmente e attivamente la diffusione di discussioni sull’azienda o sui suoi prodotti o servizi. Questo tipo di passaparola è al centro di questo breve paragrafo.L’essenza del passaparola è dare alle persone un motivo per parlare. Il motivo per cui questa strategia funziona è che le persone spesso si fidano di ciò che gli altri hanno da dire.Quel fenomeno è stato anche documentato:Uno studio di Nielsen del 2015 rivelò che l’83% degli intervistati in 60 Paesi si fidava delle raccomandazioni di amici e familiari. Ma quando una raccomandazione arrivava da un’opinione condivisa online, il rapporto di fiducia scendeva al 63%.Il “motivo per parlare” non deve essere la raccomandazione dei servizi di un’azienda. Può essere qualsiasi cosa che faccia pubblicità a un’azienda, che crei “ronzio” e aumenti la forza del brand. Per questo motivo, il passaparola è spesso chiamato “buzz marketing”.Il marketing del passaparola può assumere molte forme. Può iniziare come una campagna sui social media, una campagna di PR o una campagna di referral con incentivi per diffondere il messaggio dell’azienda.EsempioUna cosa è “beneficiare” dell’effetto del passaparola sotto forma di recensioni positive e thread spontanei sui social media.Un’altra cosa è progettare e controllare l’intero spettacolo.Nel libro “Buzzmarketing: Get People to Talk About Your Stuff,” Mark Hughes descrive come è riuscito a cambiare il nome di una città negli Stati Uniti con il nome di una piattaforma di e‑commerce che stava promuovendo.Una città chiamata Halfway è stata ribattezzata Half.com. Per un anno. E questo ha davvero reso la nuova piattaforma di e‑commerce visibile.Questo evento fu così straordinario da attirare l’attenzione di Associated Press, Reuters, USA Today, Good Morning America, tra gli altri. Quindi immagina quanta pubblicità ha ottenuto quella società di e‑commerce attraverso questa singola azione, giusto in tempo per il lancio della piattaforma.In cambio, la città di Halfway ha ricevuto nuovi computer per la scuola, un nuovo sito e 110.000 $. E sei mesi dopo, Half.com (l’e-commerce) è stato venduto a eBay per 300 milioni di dollari17. Event marketing L’event marketing è una tattica in cui gli eventi brandizzati vengono utilizzati come modo per comunicare con il pubblico e promuovere prodotti o servizi.L’obiettivo dell’event marketing è creare un’esperienza memorabile coinvolgendo i partecipanti all’evento e incoraggiandoli a interagire direttamente con un’azienda.Le interazioni possono assumere forme diverse: provare un prodotto, assistere a una dimostrazione di un prodotto, assistere a un concerto, partecipare a lanci, creare reti, partecipare a un seminario o a una conferenza, ecc.EsempioDal 2003 Salesforce organizza un evento annuale chiamato Dreamforce. Riunisce “la comunità globale di Salesforce per l’apprendimento, il divertimento, la costruzione della comunità e a scopi filantropici”.L’evento annuale, della durata di 3 giorni, è un grande parco a tema di tutto ciò che riguarda Salesforce. Quest’anno l’evento è stato trasmesso anche online.Consente a Salesforce di creare un’esperienza multiforme: i partecipanti possono assistere agli annunci sui prodotti Salesforce, scoprire come usare in maniera avanzata il CRM e ottenere certificazioni Salesforce.Ma come ogni parco a tema, ci devono essere diversi tipi di attrazioni. L’evento non si limita a promuovere il CRM di Salesforce. Dreamforce è un’opportunità per ascoltare i discorsi di persone famose, leader di pensiero e politici. Ultimo ma non meno importante, i partecipanti possono divertirsi come fossero ad una festa.Join superstar Will Smith at Dreamforce 2021. Together, we’ll be:1. Chillin’ out.2. Maxin’.3. Relaxin’, all cool.Watch #DF21 on Salesforce+: https://t.co/pXrOL9oVnB pic.twitter.com/qeZSQjQC8v— Salesforce (@salesforce) September 22, 2021La cosa interessante di questo esempio di event marketing è che è aperto ad altre aziende. Ben 103 aziende esterne aiutano Salesforce a rendere possibile questo evento attraverso le sponsorizzazioni, in questo modo migliorando anche il posizionamento del loro brand.18. Guerrilla marketingCon il termine guerrilla marketing si intende una tattica di promozione che prevede l’utilizzo di interazioni inaspettate e non convenzionali per evocare forti emozioni e generare passaparola.Caratteristiche del guerrilla marketing:Basso costoCreativoMessaggi semplici e breviUtilizzo di luoghi pubblici come strade o centri commerciali come mezzo pubblicitarioPossibilità di creare un’impressione forte e memorabileEsempioCredo che questo esempio sia perfetto per spiegare cosa si intende per guerrilla marketing.Questo è uno dei tanti esempi della campagna di promozione del film “IT”. Anche se non hai sentito parlare del pagliaccio mortale del romanzo di Stephen King, la scritta e il palloncino sono così particolari che invitano a volerne sapere di pià via Google.Inoltre, scommetto che dopo aver visto questa scritta e il palloncino non potrai non avere voglia di condividerlo con altre persone e magari anche di scriverlo su Twitter.Pretty cool marketing initiative for #ITMovie spotted in Sydney CBD this morning.“We all float down here” pic.twitter.com/vi1KnXSRFj— David Piepers (@davepiepers) September 3, 2017E se poi vai a vedere il film e vedi quella scena con il palloncino che esce dal tombino, ricordare questa pubblicità rende il film molto più reale e spaventoso.Per quanto riguarda il budget di questa campagna, è abbastanza ovvio: alcuni palloncini, spago e vernice bianca.ConclusioniCon tutti questi 18 tipi di marketing, viene da chiedersi: dov’è il rasoio di Occam quando ne hai bisogno? Posso usarne solo un tipo e smettere di preoccuparmi? Le varie tipologie di marketing che ti ho presentato sono state sviluppate per una ragione. Alcune sono usate per differenziarsi dalla concorrenza e altre per adattarsi alla clientela.Il punto è che puoi considerare questi tipi di marketing come soluzioni già pronte per raggiungere il tuo obiettivo.Conoscere queste tecniche collaudate rende il lavoro più semplice. Hai solo bisogno di scegliere saggiamente. Scrivimi su Twitter se hai domande. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Articolo di Mateusz Makosiewicz Ricercatore nel campo del marketing ed educatore ad Ahrefs, Mateusz ha oltre 10 anni di esperienza nel marketing che ha ottenuto presso agenzie e aziende coinvolte in hardware e SaaS. Quando non scrive, compone musica e si gode lunghe passeggiate.",
  "headers": [
    {
      "level": "H1",
      "text": "18 Tipologie di Marketing (Con Esempi)"
    },
    {
      "level": "H2",
      "text": "1. Marketing digitale"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "2. Marketing offline"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "3. Inbound marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "4. Outbound marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "5. Content marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "6. Search engine marketing (SEM)"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "7. Growth marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "8. Marketing B2B"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "9. Marketing B2C"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "10. Affiliate marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "11. Social media marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "12. Brand marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "13. Marketing diretto"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "14. Influencer marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "15. E‑mail marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "16. Marketing del passaparola"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "17. Event marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "18. Guerrilla marketing"
    },
    {
      "level": "H3",
      "text": "Esempio"
    },
    {
      "level": "H2",
      "text": "Conclusioni"
    }
  ],
  "author": "Mateusz Makosiewicz"
}