{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/consumer-credit-trends/",
  "slug": "consumer-credit-trends",
  "title": "Consumer Credit Trends - Holiday 2021 (+4 Tips) | Similarweb",
  "description": "Opportunities are open in consumer credit this holiday. To help banks win: 1. Prepare for higher demand for credit 2. Bid on low interest keywords",
  "content": "HomeBlogResearchDigital AnalysisHow To Win the Consumer Credit Game This Holiday (4 Tips) Research Intelligence How To Win the Consumer Credit Game This Holiday (4 Tips) Get the full holiday credit report by Emily Hunt , Market Research & eCommerce Specialist 4 Min. October 18, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Last year, online spending surged 49% year-over-year (YoY) during the holiday season despite economic uncertainty. Signs point to even higher spending this year, and with that, opportunities in consumer credit. To help financial services companies leverage end-of-year consumer behavior, we’ve put together some quick tips you won’t want to miss using data from Similarweb Research Intelligence and Shopper Intelligence. 1. Prepare for increased spending Spending patterns in 2021 indicate that consumers may borrow to fund holiday shopping sprees. In Q2, millions of Americans stopped receiving coronavirus relief checks. But, this didn’t stop them from spending on non-essential items including durable goods, like electronics, and nondurable, fast-moving CPG products, like cosmetics, which increased 13% and 13.9% respectively. It’s not surprising then that interest in credit cards is already climbing. Users searched for credit card-related terms 11 million times in August, indicating usage of funds beyond personal bank accounts – this search volume even outpaced the 2020 holiday season, by 9%. Additionally, credit card balances rose 11% from April to May 2021, the largest jump in five years, on an annualized basis. Strong consumer confidence also indicates that an increase in debt is what’s fueling spending. In fact, 44% of Americans said that they were willing to take on debt for non-essential purchases, like dining and entertainment, in the second half of 2021. The merriment of the holiday season could lead this number to spike even higher. Jamie Dimon, JP Morgan’s CEO, also recognizes this positive consumer attitude on the bank’s earnings call: “The pump is primed…The consumer, their house value is up, their stocks up, their incomes are up, their savings are up, their confidence up.” With confidence higher than in 2020 and consumption levels rising, payment methods have also transformed, making it particularly important for financial services companies to be savvy in their holiday strategy to come out ahead of the competition. Get the full holiday credit report Understand the latest trends in consumer credit and spending Download now 2. Level up to compete with soft credit Both the finance and eCommerce industries are being transformed by Buy Now Pay Later (BNPL), also called point-of-sale loans. With BNPL, consumers only need a soft credit check in order to pay for purchases in installments. Megaretailer Amazon announced that it partnered with Afterpay, one of the fastest-growing payment providers, this fall (the company was also acquired by Square for $29 billion around the same time). The partnership will allow Amazon customers to pay for purchases over $50 in installments – a milestone in modern online shopping. Consumer appeal The BNPL industry allows shoppers to space out payments, often without paying interest. The soft credit check needed for these programs is unlikely to impact credit scores. As such, search volume for “buy now pay later” nearly doubled from 33,719 in October 2020 to 64,936 in September 2021, reflecting exploding demand for this payment option. eCommerce appeal RBC Capital Markets estimates that point-of-sale loans increase retail conversion rates 20% to 30%, and average order value (AOV) between 30% and 50%. This boost in AOV also aligns with the growing premium tastes of consumers. Across Amazon categories, year-over-year (YoY) revenue grew 27.7% in September, while YoY sales growth lagged nearly 10 percentage points (ppts), indicating consumers are spending more per product. YoY revenue growth exceeds sales on Amazon showing consumers are spending more per purchase (via Shopper Intelligence) 3. Promote low-interest cards If consumers can pay 0% interest with BNPL, why should they enroll in credit cards with higher interest and greater debt risk? It’s up to banks to answer that question by promoting low-interest cards with effective, targeted messaging. Here’s how: Create targeted content Outside of direct and internal traffic, organic search is the highest driver of clicks. Because the need is often the same for consumers, ‘low interest,’ ‘0% APR,’ and ‘balance transfer’ should be on the same landing page. Develop targeted content, reflecting consumer demand for low-interest rates 4. Invest in the right keywords After being curtailed during the pandemic, banks’ paid ad spend is up with 295,000 paid clicks on top credit card keywords in August. Affiliates and credit card providers both bid heavily on low-interest-related keywords so it’s important for banks to accurately research and choose the right keywords to compete in the highly competitive market. Pro tip: Use tools like Similarweb Competitive Intelligence to analyze trending keywords, see what your competitors are bidding on, and gain other keyword intelligence. Sample Digital Research Intelligence Dashboard: Trending Keywords, Investing Consider partnering with affiliates Financial services can also consider teaming up with top affiliates that are receiving a high traffic share for targeted, top search terms. Credit Karma, Nerd Wallet, and WalletHub, for instance, all rank among the top 10 websites for the most traffic share for credit-related keywords. Traffic share for top credit card keywords via Similarweb Digital Research Intelligence Final thoughts Spending is up, so it’s key for financial services companies to have the right data to tailor their consumer credit strategies. This applies year-round, not just the holiday season. We used Similarweb Digital Research Intelligence and Shopper Intelligence to put together our analysis. To get your own insights for a happy holiday, schedule a demo today. Schedule a Demo Get the latest digital insights to win the holiday season. Schedule now by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Digital Analysis Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence Competitor Monitoring: How to Track Your Competitors Online Content Marketing Digital Analysis by Monique Ellis 10 Min. Sep 18, 2023 Updates New Feature: The Most Granular Way to Analyze any Sector or Market Digital Analysis Product Updates by Liz March 3 Min. Jan 11, 2023 Research Intelligence Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know Digital Analysis by Daniel Schneider 30 Min. Nov 25, 2022 Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Digital Analysis Product Updates by Liz March 3 Min. Oct 12, 2022 Research Intelligence The ROI of Digital Intelligence: Time, Money, and Opportunity Digital Analysis by Molly Winik 4 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How To Win the Consumer Credit Game This Holiday (4 Tips)"
    },
    {
      "level": "H2",
      "text": "1. Prepare for increased spending"
    },
    {
      "level": "H2",
      "text": "2. Level up to compete with soft credit"
    },
    {
      "level": "H3",
      "text": "Consumer appeal"
    },
    {
      "level": "H3",
      "text": "eCommerce appeal"
    },
    {
      "level": "H2",
      "text": "3. Promote low-interest cards"
    },
    {
      "level": "H3",
      "text": "Create targeted content"
    },
    {
      "level": "H2",
      "text": "4. Invest in the right keywords"
    },
    {
      "level": "H3",
      "text": "Consider partnering with affiliates"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Competitor Monitoring: How to Track Your Competitors Online"
    },
    {
      "level": "H3",
      "text": "New Feature: The Most Granular Way to Analyze any Sector or Market"
    },
    {
      "level": "H3",
      "text": "Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know"
    },
    {
      "level": "H3",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H3",
      "text": "The ROI of Digital Intelligence: Time, Money, and Opportunity"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}