{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/cookieless-future/",
  "slug": "cookieless-future",
  "title": "Tips & Tools to Conquer a Cookieless Future | Similarweb",
  "description": "Tips for publishers and media to conquer a cookieless future: 1. Alternate targeting 2. Pursue competitor audience 3. Monitor payflow. Read more now.",
  "content": "HomeBlogResearchDigital Analysis4 Tips to Conquer a Cookieless Future Research Intelligence 4 Tips to Conquer a Cookieless Future Get cookieless conversion tips by Emily Hunt , Market Research & eCommerce Specialist 5 Min. March 14, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic If a cookieless future sounds terrible to you, rest assured, we’re not talking about that kind of cookie. We’re referencing third-party cookies, which the publishing and media industry has relied heavily on to monetize content for quite some time. When Google announced that it would ban cookies from Chrome, it upended the $152 billion digital advertising industry and forced publishers and media to rethink revenue strategies. To help you get a sweet start on your strategy, we’ll use insights from Similarweb, a research intelligence tool, to demonstrate how the right anonymized data and analytics can help conquer the cookieless future. What are cookies? Cookies are snippets of code that assign website visitors a unique ID. They remember users, collect information, and deliver personalized experiences. First-party cookies customize experiences on the website visited by a user. Third-party cookies allow brands to re-engage targeted audiences across domains for digital advertising. Ongoing concerns surrounding data privacy and regulations like GDPR (General Data Protection Regulation) have brought a lot of attention to this practice. Chrome’s biggest competitors, Safari and Firefox, pulled back on third-party cookies years ago. Apple took it a step further, now requiring opt-in for tracking in-app. Soon, Google’s browser, which accounts for two-thirds of global browser share, will be the last of its bunch to back away from the cookies. Increased regulation and data privacy laws pressure Google to sunset cookies. Google initially announced in 2020 that it would stop supporting third-party cookies by 2022. The tech giant has since pushed that to 2023, opening up opportunities for the industry to better prepare for the cookieless future. Why is the death of third-party cookies important to publishing and media? Behavioral insights provided by third-party cookies help businesses understand audiences at granular levels to deliver content that truly attracts and resonates. More engagement means more ad sales at a higher CPM. Cyclically, ad sales fund content creation. Cookies underpin audience-based digital ad campaigns by enabling: Retargeting users that left a website Reaching out to lookalike audiences Attributing conversions to users, then finding similar people Understanding more about a brand’s target audience and behaviors Without third-party audience data for effective targeting, there’s growing concern that ad revenue will further decline in an industry already facing decreased spending on print and linear ads. While larger publishers have the resources to spend heavily on first-party data to prepare for the cookieless future, smaller brands need to get more creative. 4 tips to prepare for the cookieless future Investing in digital tools mixed with first-party data can help these brands contextualize audience segments and build subscription revenue to replace lost cash flow. Check out some techniques using cookie-free data from Similarweb’s suite of digital tools for publishers and media: 1. Use site lists for alternative targeting Analyzing referral sources of incoming traffic can help identify domains already sending visitors to you and your competitors’ websites. Build a whitelist that includes these referral sources to reach your target audience. Conversely, use similar data to build a blacklist, so your ads don’t appear on the wrong domains. Both techniques will help you stretch your budget and invest in channels with the most return without programmatic advertising, a popular practice that requires third-party data. Incoming traffic referral sources Pro Tip: Use Similarweb Digital Research Intelligence to pinpoint referral sources of incoming traffic. 2. Leverage competitive intelligence Audience insights, such as cross-browsing behavior, can help identify top competitors’ audiences to convert to your own. Check out the example: More than one-third of visitors to washingtonpost.com who also browse nytimes.com suggest that The Washington Post may want to pursue The New York Times’ audience. At 22% overlap, Reuters may also want to consider targeting The New York Times’ visitors. With just 4% and 6% overlap with businessinsider.com, both The Washington Post and Reuters may want to avoid ads targeting Business Insider’s audience. Cross-browsing behaviors: NY Times, The Washington Post, Reuters, Business Insider Pro Tip: Use the audience interests feature of Similarweb Digital Research Intelligence to identify cross-browsing behavior. 3. Monitor pay flows Monitor pay flows to pinpoint channels that drive subscriptions for your competitors. Consider focusing on their top sources. For instance, rising visits to The New York Times’ subscription page through paid rather than organic search, suggests that competitors may want to allocate more resources to paid channels vs. SEO. Pro Tip: Use segment analysis, a feature of Digital Research Intelligence, to identify channels driving traffic to specific URLs on competitors’ websites. For pay flows, these may include subscription sign-up, cancellation, and payment confirmation pages. 4. Power up your pitch In addition to boosting customer acquisition, cookieless data can optimize ad sales. By harnessing granular web traffic information, ad sellers can continue to make strong pitches to clients. For example, audience overlap can showcase the visitors that your site and your clients’ site have in common. If overlap with your site exceeds your competitors’, you’ve made a strong case to be your client’s top priority. Case in point – adidas.com shares 23% of its audience with espn.com, more than twice that of rival sports websites. To make a compelling pitch, ESPN should share these insights with Adidas. Pro Tip: Use audience overlap, a feature of Digital Research Intelligence to determine the number of shared, unique visitors with client and competitor websites. Want to Grow Ad Sales in the Cookieless Future? Get the free whitepaper for tips Download now Next steps to win when the cookie crumbles Check out how individual tools within the Similarweb digital intelligence suite can help publishers and media conquer the cookieless future Research Intelligence: Understand competitive audience browsing behavior and analyze audience segments. Gain a market view, including a share of voice. Digital Marketing Intelligence: Allocate resources and marketing efforts based on your competitors’ traffic. Analyze, benchmark, and perform keyword research. Shopper Intelligence: Gain additional audience behavior insights and spot emerging trends on eCommerce sites to maximize affiliate revenue. Sales Intelligence: Grow new and existing advertising clients using competitive insights and a comprehensive client contact database. Check out Similarweb Digital Intelligence Try our suite for publishers and media Schedule demo now by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence Competitor Monitoring: How to Track Your Competitors Online Content Marketing Digital Analysis by Monique Ellis 10 Min. Sep 18, 2023 Updates New Feature: The Most Granular Way to Analyze any Sector or Market Digital Analysis Product Updates by Liz March 3 Min. Jan 11, 2023 Research Intelligence Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know Digital Analysis by Daniel Schneider 30 Min. Nov 25, 2022 Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Digital Analysis Product Updates by Liz March 3 Min. Oct 12, 2022 Research Intelligence The ROI of Digital Intelligence: Time, Money, and Opportunity Digital Analysis by Molly Winik 4 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "4 Tips to Conquer a Cookieless Future"
    },
    {
      "level": "H2",
      "text": "What are cookies?"
    },
    {
      "level": "H2",
      "text": "Why is the death of third-party cookies important to publishing and media?"
    },
    {
      "level": "H2",
      "text": "4 tips to prepare for the cookieless future"
    },
    {
      "level": "H3",
      "text": "1. Use site lists for alternative targeting"
    },
    {
      "level": "H3",
      "text": "2. Leverage competitive intelligence"
    },
    {
      "level": "H3",
      "text": "3. Monitor pay flows"
    },
    {
      "level": "H3",
      "text": "4. Power up your pitch"
    },
    {
      "level": "H2",
      "text": "Next steps to win when the cookie crumbles"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Competitor Monitoring: How to Track Your Competitors Online"
    },
    {
      "level": "H3",
      "text": "New Feature: The Most Granular Way to Analyze any Sector or Market"
    },
    {
      "level": "H3",
      "text": "Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know"
    },
    {
      "level": "H3",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H3",
      "text": "The ROI of Digital Intelligence: Time, Money, and Opportunity"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}