{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/lockdowns-shopping/",
  "slug": "lockdowns-shopping",
  "title": "Why Online Shopping Isn’t Going Anywhere | Similarweb",
  "description": "What's happening with the Australian eCommerce industry? It's booming. We break down the traffic data to bring you the details. Read now.",
  "content": "HomeBlogResearchDigital AnalysisWhy Online Shopping Isn’t Going Anywhere Research Intelligence Why Online Shopping Isn’t Going Anywhere Book a demo by Similarweb 3 Min. August 27, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Much like the timeless album cover of Dark Side of the Moon, the pandemic has been a prism for online retailers. It’s now July 2021, and a lot of us are locked up inside with nothing but Pink Floyd’s sampled sounds – like coins in a cash register at the start of Money – to remind us of the outside world. Online shopping has become the norm, and Australians are buying groceries, clothes, and recreational items with a click of their mouse or a swipe of their screen in never-before-seen numbers. When comparing online traffic to Australia’s top 100 eCommerce sites in Q1 2019 (our pre-COVID beam of white light) to Q1 2020 (our triangular prism), we see an increase of 10.53%. Under normal circumstances, an increase of more than 10% in traffic would be remarkable. However, it pales in comparison to the increase on the other side of the prism – our rainbow road – which saw Australian eCommerce traffic surge by more than 42% in the first quarter of this year. While the increase in traffic has been a welcome challenge to online retailers, the recent surge has been underscored by a sentiment that things would snap back to ‘normal.’ Our traffic analysis of Australia’s top 100 eCommerce sites before, during, and after last year’s pandemic (prior to this latest series of lockdowns) indicates the gains in web traffic are here to stay. It is worth highlighting that this exponential growth occurred after the height of 2020’s restrictions when consumers around Australia were largely free of lockdowns and able to visit and make purchases from bricks-and-mortar retailers. With more shoppers turning to online retailers first, merchants and marketers need to be cognizant of how consumers are searching for and accessing products online to make strategic choices about where, when, and how they allocate advertising dollars. Our data shows that more than half of all customer journeys now begin at the search engine with customers accessing products through both organic and paid search channels. Image-based shopping ads, which now appear on Google before both search ads and organic results, are garnering lots of hits, with click-throughs from these ads growing by more than 50% between April 2020 and March 2021. This includes ads listed in the ‘shopping tab’ under Google searches – which Google made free-to-use for Australian merchants in October last year. The only other channel to grow compared to pre-pandemic levels is referrals through affiliate marketing. Traffic from display ads, email marketing, and direct traffic have all decreased. This indicates that over the past 18 months, shoppers have taken a more proactive approach, opting to research products or categories themselves, rather than being enticed with more direct marketing tactics. That being said, click-throughs across all search functions, both organic and paid, have steadily increased since the onset of COVID, highlighting the importance of every bit of digital shelf space, regardless of which online sector your business serves. It’s safe to assume that online shopping is a fixture of the immediate future. As we move out of the pandemic, retailers need to switch their focus to how consumer data and insights can sharpen their marketing efforts and ensure they stay ahead of the competition. Tune in next week for my article on how Australian online consumers are shopping across specific sectors, and why this matters for your business – regardless of what area you work in. by Similarweb Related Topics: Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence Competitor Monitoring: How to Track Your Competitors Online Content Marketing Digital Analysis by Monique Ellis 10 Min. Sep 18, 2023 Updates New Feature: The Most Granular Way to Analyze any Sector or Market Digital Analysis Product Updates by Liz March 3 Min. Jan 11, 2023 Research Intelligence Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know Digital Analysis by Daniel Schneider 30 Min. Nov 25, 2022 Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Digital Analysis Product Updates by Liz March 3 Min. Oct 12, 2022 Research Intelligence The ROI of Digital Intelligence: Time, Money, and Opportunity Digital Analysis by Molly Winik 4 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Why Online Shopping Isn’t Going Anywhere"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Competitor Monitoring: How to Track Your Competitors Online"
    },
    {
      "level": "H3",
      "text": "New Feature: The Most Granular Way to Analyze any Sector or Market"
    },
    {
      "level": "H3",
      "text": "Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know"
    },
    {
      "level": "H3",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H3",
      "text": "The ROI of Digital Intelligence: Time, Money, and Opportunity"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Similarweb"
}