{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/mental-health/",
  "slug": "mental-health",
  "title": "Mental Health Data Shows Pandemic Is Far From Over | Similarweb",
  "description": "We review search data and consumer habits to measure the impact of the pandemic on mental health. See our key findings here, enter now!",
  "content": "HomeBlogResearchDigital AnalysisThe Mental Health Pandemic Is Far From Over, Data Shows Research Intelligence The Mental Health Pandemic Is Far From Over, Data Shows Download the mental health study by Emily Hunt , Market Research & eCommerce Specialist 6 Min. October 11, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic COVID-19 will be remembered in history as a pandemic. One of the things it may or may not be remembered for is the mental health pandemic that it induced. Mental Health Awareness Day this year is a stark reminder that, although there is a vaccine for COVID-19, there is no such thing for mental health and personal well-being. And while the need for mental health services has soared, the pandemic halted traditional support and treatment. Through analyzing our own unique data of online searches, habits, and purchases, along with sharing real-life stories, we see how the mental health crisis has developed and how people are finding new ways to cope, find treatment, and achieve contentment. Our key mental health data findings January – August 2020 vs. 2021: Website traffic to nine of the top therapy sites grew this year. Website traffic to nine of the top 10 pet adoption sites continued its uptick by an additional 3.8%. Total sales for Amazon’s Wellness & Relaxation category climbed 81.3%. Searches for “phone addiction” and “internet addiction test” up 172% and 354% respectively. The doctor will see you…online It’s no surprise that visits to mental health websites escalated in line with the pandemic. We know what a devastating effect it had on so many. What is interesting though, is the data shows demand for online therapy has continued to rise, even though we’re past the pandemic’s peak. Traffic to nine of the top therapy sites in 2021 was higher than at the peak of COVID-19 and mass lockdowns in 2020. Take getcerebral.com as an example – it’s an online mental health subscription platform that provides users with ongoing access to virtual medical care and medication management. It saw staggering growth at +1,063.7% YoY, increasing from 84,400 average monthly visits in 2020 (January – August) to 982,400 in 2021. Virtual therapy vs. traditional The National Institute of Mental Health estimates that nearly one in five adults in the U.S. lives with mental health illness. It’s a similar situation worldwide. A new U.K. study also found that since the first lockdown, adults have slowly become less able to cope with the stress of the pandemic. Aside from medication, people were put on to therapy in never-before-seen ways. Searches for “psychiatrist near me” grew 23.8% since April 2020, whereas searches for “online psychiatrists” rose 137.7% in the same period. While we’re not qualified to say which form of therapy is better, what we know is that without virtual therapy during the pandemic, millions would have been without support. We spoke to Tom Thanos (name changed), a Marketing Manager from London about his experience with virtual therapy: “I felt more anxious than usual and began withdrawing from people in my life. I was lucky as my workplace had a wellbeing officer who directed me to a virtual therapy company. Through that company, I had an initial assessment and was then assigned a course of therapy, which my employer covered the cost of. I was pretty skeptical about it at first and chose to speak on the phone, rather than online videos. Some people say the phone acts as a barrier, but I personally think speaking on the phone may have allowed me to be more open than I would have been face to face. The impact therapy had on my life was enormous. I had space to talk and was given practical coping mechanisms to use in my everyday life. I still don’t know if it was the pandemic that brought on my anxiety, but I know it didn’t help it. Like most mental health conditions, I wouldn’t say I am ‘cured’, but I am better equipped, and am now a surprise advocate for virtual therapy.” With demand comes opportunity Just like healthcare, mental healthcare is a big business. Our data shows that although around 50% of people are accessing online therapy sites directly (i.e. they already know the brand they are visiting), competition is heating up between providers for new visitors, with spend on both display ads and paid search terms surging in the increasingly crowded space. Similarweb Research Intelligence data above shows the rise in paid traffic this year for online therapy sites Consumer trends shift toward well-being Not only are people taking mental health matters into their own hands, as depicted in the above data, they’re also looking to elevate their happiness levels in the long run. Amazon’s Wellness & Relaxation category, which offers items like supplements, essential oils, acupressure mats, and humidifiers, skyrocketed 81.3% in sales this year. What was the top-selling product, you ask? BUTIYCE’s Massage Gun for Deep Tissue Pain Relief – a testament to the physical effects of mental health. Consumers are hitting the books to better their mental state as well, with the best-seller “The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma” by Bessel Van Der Kolk leading the pack. So far this year, 16,000 copies have been sold, with a string of reviews praising it for changing lives. Phenomenal reviews for “The Body Keeps the Score”, a book which has helped thousands come to terms with trauma A pet is for life – and for mental health Moving on to something you can’t purchase online (thankfully): pets. Pandemic-induced pet adoption has been well documented, but our new data shows that the trend hasn’t paws-ed, when many thought it would. Traffic to nine of the top 10 adoption sites in the U.S. continued growing by an additional 3.8% heading in 2021. Traffic to pet adoption sites continues to rise (via Similarweb Research Intelligence) Whether you’re a long-time dog mom (like me) or a fan of felines, the joys of having a pet are unparalleled. Taking one on during the pandemic lifted both moods and tails to a new level, as Bryn Glover of Cambridge reflects: “My partner Kelly and I adopted Evie around Easter in 2020, quite early on in the pandemic. She’s an incredibly lively and curious puppy who causes a lot of mischief. But at the same time, she’s the reason for about 90% of the laughter in our house. Even when she’s destroying socks (or trying to steal them), you know that she’s just playing and wants to be with you all the time. There’s something really lovely about knowing that, however bad your day might be, she’s always going to be there to jump on your chest while you relax to spend some time together. She can be a huge amount of work, but it’s always worth it just to see her charge toward you whenever you have a treat in hand, ready to play and lift your mood.” Yes, he’s real! The author’s day brightens with Omega, the pup she took in during the pandemic You might as well face it, you’re addicted to the internet When the pandemic began, the number of visits to adult entertainment sites exploded. While this increase doesn’t necessarily equate to mental health issues, but experts worry about the impact that violent and degrading acts can have on viewers. Notably, this is one trend that hasn’t grown in 2021. In fact, people are speaking out about quitting watching adult entertainment altogether. Last month, Similarweb data shows that five of the top fifty global websites classified as “Adult” dropped in popularity, with users spending more time on Twitter and Facebook than any of the other sites in the list. We’ve also seen a dip in search terms for “sex addiction” (-35.6%) and yes, even “love addiction” (-65.8%), whereas “phone addiction” has risen 172% and searches for “internet addiction test” are up a whopping 354%. Wrap up The mental health crisis is far from over. But on a brighter note, our data also shows us there is more recognition of mental health, more platforms available to help, and that people are seeking that help in addition to preventative solutions. Mental health is complex, which is why we included real-life stories to sit alongside our data. In an increasingly digital world, online behavior analysis, trends, and consumer habits tell us a lot – we call this digital intelligence. For now, we offer these insights alongside Mental Health Awareness Day, virtual cup of tea in hand, to help bring and keep this still underrepresented topic to the forefront. Methodology We used the Similarweb digital intelligence platform to examine the state of mental health, analyzing: Visits to online therapy sites Trending keywords for the mental health industry Sales of Health & Wellness products on Amazon Web traffic/engagement to pet adoption sites Top ranking websites index by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence Competitor Monitoring: How to Track Your Competitors Online Content Marketing Digital Analysis by Monique Ellis 10 Min. Sep 18, 2023 Updates New Feature: The Most Granular Way to Analyze any Sector or Market Digital Analysis Product Updates by Liz March 3 Min. Jan 11, 2023 Research Intelligence Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know Digital Analysis by Daniel Schneider 30 Min. Nov 25, 2022 Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Digital Analysis Product Updates by Liz March 3 Min. Oct 12, 2022 Research Intelligence The ROI of Digital Intelligence: Time, Money, and Opportunity Digital Analysis by Molly Winik 4 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Mental Health Pandemic Is Far From Over, Data Shows"
    },
    {
      "level": "H2",
      "text": "Our key mental health data findings"
    },
    {
      "level": "H2",
      "text": "The doctor will see you…online"
    },
    {
      "level": "H2",
      "text": "Virtual therapy vs. traditional"
    },
    {
      "level": "H2",
      "text": "With demand comes opportunity"
    },
    {
      "level": "H2",
      "text": "Consumer trends shift toward well-being"
    },
    {
      "level": "H2",
      "text": "A pet is for life – and for mental health"
    },
    {
      "level": "H2",
      "text": "You might as well face it, you’re addicted to the internet"
    },
    {
      "level": "H2",
      "text": "Wrap up"
    },
    {
      "level": "H3",
      "text": "Methodology"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Competitor Monitoring: How to Track Your Competitors Online"
    },
    {
      "level": "H3",
      "text": "New Feature: The Most Granular Way to Analyze any Sector or Market"
    },
    {
      "level": "H3",
      "text": "Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know"
    },
    {
      "level": "H3",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H3",
      "text": "The ROI of Digital Intelligence: Time, Money, and Opportunity"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}