{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/similarweb-passes-alexa/",
  "slug": "similarweb-passes-alexa",
  "title": "Similarweb Passes Alexa in Website Rank | Similarweb",
  "description": "Just saying - According to Alexa Rankings, in April of this year Similarweb passed by Alexa and today is almost 1,000 positions higher. Enter for some stats.",
  "content": "HomeBlogResearchDigital AnalysisSimilarweb Passes Alexa in Website Rank Research Intelligence Similarweb Passes Alexa in Website Rank Start your free trial by Natalie Halimi 3 Min. August 4, 2014 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic According to Alexa Rankings, in April of this year, Similarweb passed by Alexa and today is almost 1,000 positions higher. As of this week, Alexa claims the global rank of 2137 and Similarweb.com at a global rank of 1,336. Due to the black-box nature of Alexa’s rankings, we’re not sure how Alexa ranked Similarweb above themselves. Alexa’s trends show clearly that Similarweb is on the rise while Alexa is in free fall but in all fairness, we should say that according to our stats, we have yet to pass Alexa in traffic volume. Let’s review the stats: Stats by Alexa.com Alexa.com has a policy of showing its own real traffic stats openly. The site current stats shows 5,934,653 monthly unique visitors and 23,384,829 monthly page views: Alexa.com doesn’t offer traffic stats on their free platform (unlike Similarweb), but its assessment of our page views is a bit higher than what we know we have: Stats by Similarweb.com At Similarweb.com we see that Alexa.com had 11,500,000 visitors in June with 3.17 average page views. Note that the main difference is due to the fact we’re showing visitors, while Alexa shows unique visits. However, based on internal statistics we regularly ran on sites across the web, including our own, 11.5 visits reflects between 6-7 unique visits. To better compare apples to apples let’s look at how we rank ourselves and Alexa: We rank Alexa.com at 3,057. This is based on visits and page views. The reason we consider page views an important factor of a website ranking is that it helps us clean out malware and spam sites which generate automatic visits by the millions. According to our stats, Similarweb.com’s current global rank is 31,188, with 1.2 million monthly visits and an average of 3.22 page views in June. As you can see, though our engagement metrics are slightly better than Alexa.com’s, they still pass us by quite a lot in traffic volume, which is why we rank them much higher than us. Based on published stats from 2007, Alexa is basing its website ranks on a user panel with 2.5 million users. As of this moment, our panel is 20 times bigger and covers more countries. This, together with our unique team of data experts, is why we consider our data more reliable and trustworthy than Alexa. As you can see from the stats above, Alexa.com is making it that much easier to prove that. by Natalie Halimi Natalie Halimi has over 10 years of marketing experience across B2C and B2B sectors. Related Topics: Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. Oct 1, 2024 Updates New Data Version: The Best Digital Data Just Got Better Announcements by Ron Asher 4 Min. Sep 24, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Similarweb Passes Alexa in Website Rank"
    },
    {
      "level": "H2",
      "text": "Stats by Alexa.com"
    },
    {
      "level": "H2",
      "text": "Stats by Similarweb.com"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "New Data Version: The Best Digital Data Just Got Better"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Natalie Halimi"
}