{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/social-justice-intelligence/",
  "slug": "social-justice-intelligence",
  "title": "Similarweb Presents: Social Justice Intelligence | Similarweb",
  "description": "Learn how data intelligence used for social justice can impact the social services ability to identify and attend to domestic violence issues during Covid.",
  "content": "HomeBlogResearchDigital AnalysisWhat Can Information Technologies Like Similarweb Do for Social Justice Issues? Research Intelligence What Can Information Technologies Like Similarweb Do for Social Justice Issues? Explore More by Similarweb 4 Min. November 19, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Although market intelligence platforms such as Similarweb are typically used to measure trends in digital consumption, they also carry the potential to further social justice research. The socioeconomic consequences of the COVID-19 pandemic, for example, offer an opportunity for data scientists to use their technologies for good. At the Covid-19 Taskforce On Domestic Violence, we used Similarweb’s data to analyze trends in domestic violence throughout the pandemic. In our analysis, we used multiple data types measured by Similarweb to look at and study the impact of shelter-in-place measures on access to DV resources, specifically the websites of hotlines. In order to do so, we broke our data into state-level analyses for each of the 50 states. We also investigated the difference in traffic on mobile versus desktop devices. Here’s what we learned from that data, and what we can still learn from the data types that Similarweb provides: Geographic Data By breaking our analysis down into states, we were able to understand audience geography and pinpoint and differentiate the data based on the different official shelter-in-place orders of each state. Since some cities issued shelter-in-place recommendations before the state made any official orders, further investigation to break states down into city-level analysis might also be able to provide more clarity as to access in urban versus rural settings. During a pandemic, running research in a densely populated city like New York may be more dangerous than it would have been in a more rural setting, and therefore might provide an explanation for decreases in traffic for states with larger urban population densities. Increasing the granularity in geographic data would provide valuable clarity. Mobile vs. Desktop Device Data In our analysis of web traffic to hotline websites, we also studied the differences in traffic using mobile web versus desktop devices. This data is valuable in the DV-specific study because we’ve learned from interviews with shelters and DV workers nationwide that access to devices with the internet has become more difficult for survivors during the pandemic. We hypothesized that mobile traffic would increase after shelter-in-place dates, and at a granular level it may have, but on a country-level, we found that desktop use actually increased from the year before. We also found that some sites attract more overall desktop use than others, like ncadv.org below. Regardless of the impact of shelter-in-place orders, it is clear from both charts below that mobile devices are most heavily used to access DV sites. This knowledge alone has important implications on the way shelters and hotlines build their websites and offer support. User Gender/Age Data Data on different aspects of users’ identity, like gender and age, can give important information about domestic violence in the United States. For example, in the data below we learned that most users are in younger age brackets, which may indicate that younger populations access resources contained on these websites more frequently. Information like this has important implications on what groups DV resources market their material to. It allows victim support providers to assess any potential missing populations in the way resources are marketed, and which populations to target. Gender data, similarly, tell us about which populations to focus on. The below graphic demonstrates that about 2/3 of users across the given sites are female. The other 1/3 is male. With information like that, DV prevention and help resources may offer their services in typically gendered spaces, like supermarkets, or specific aisles of the drug store. Average Visit Duration We may also get a clue as to how much time survivors are able to spend on their devices by looking at the average session duration. In the graphs below, we see that the visit duration to the four sites increased starting in April. We might hypothesize that this was a result of increased DV during the pandemic. Of course, the average visit duration could also be a result of having information readily available and easy to find. Even just the bounce rate can demonstrate important implications like the percentage of people that visit the website and then leave rather than browsing other pages. If users are visiting but leaving quickly, it would be important for sites to have their most important information, like hotline numbers, on that home screen. Visit duration data coupled with geographical data might indicate which spaces afford survivors more time to seek help. Spaces like public libraries, university buildings, small urban apartments, or larger rural homes might show trends that could inform how to build safe spaces- whether public or private. What’s next? Our world is brimming with data, and we’re just starting to understand how to break it down, and what to do with that information. Thanks to Similarweb’s support, we were able to take advantage of the information available in order to learn more about who is accessing help, where, when, how, and for how long. Ultimately this information will help us understand and help survivors of domestic violence during the pandemic and beyond. Download our all-inclusive playbook to learn how to understand your target audience! by Similarweb Related Topics: Announcements Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. Oct 1, 2024 Updates New Data Version: The Best Digital Data Just Got Better Announcements by Ron Asher 4 Min. Sep 24, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "What Can Information Technologies Like Similarweb Do for Social Justice Issues?"
    },
    {
      "level": "H2",
      "text": "Geographic Data"
    },
    {
      "level": "H2",
      "text": "Mobile vs. Desktop Device Data"
    },
    {
      "level": "H2",
      "text": "User Gender/Age Data"
    },
    {
      "level": "H2",
      "text": "Average Visit Duration"
    },
    {
      "level": "H2",
      "text": "What’s next?"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "New Data Version: The Best Digital Data Just Got Better"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Similarweb"
}