{
  "url": "https://www.similarweb.com/blog/research/digital-analysis/top-web-trends-2021/",
  "slug": "top-web-trends-2021",
  "title": "The 10 Biggest Digital Trends of 2021 | Similarweb",
  "description": "Which digital trends made an impact this year? Get the latest insight into what is happening online in 2021 and how it affects your business. Read now.",
  "content": "HomeBlogResearchDigital AnalysisYear in Review: 10 Biggest Digital Trends of 2021 Research Intelligence Year in Review: 10 Biggest Digital Trends of 2021 Talk to an expert by Molly Winik , Senior Content Marketing Manager 9 Min. December 20, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic It’s hard to believe that 2022 is right around the corner. With the second year of life during a pandemic behind us, let us reflect on some of the biggest internet trends we encountered so that you can better prepare for what’s coming next. Using Similarweb Digital Research Intelligence, we explored the biggest digital trends of the past year in terms of keyword searches, website traffic, and audience engagement. We focused on the events people couldn’t stop talking about, products that trended, and global market patterns likely to stick around post-pandemic. Read it here first and see the top 10 digital trends of the year, and make sure you’re armed with the insights you need to meet and exceed all your New Year’s Resolutions. 1. Pop culture is still king queen – the Megan and Harry interview Celebrities are fascinating. Their lifestyle, culture, and stardom are often front-page news and the subject of countless social media frenzies. And the rise of popular platforms like Instagram and TikTok means an unprecedented view into their lives. So when Meghan Markle and Prince Harry sat down with Oprah on March 7, 2021, the internet was chomping at the bit to hear what the couple would say and which family secrets they’d spill. Viewers all over the world wanted to watch the interview, but since cbsnews.com had exclusive airing rights within the U.S., many needed a VPN to do so. Audiences in the U.K. who didn’t want to wait to watch the interview until it aired locally, turned in droves to VPN websites as a solution. So much so that traffic for three top VPNs soared exponentially during the first week of March. Traffic growth March 1–March 7, 2021: Expressvpn.com +60% Nordvpn.com +52% Vpnmentor.com +38% Although just a one-off event, this huge pop culture moment offered ample opportunities for any company with an online presence to make some noise. Our data coverage of the topic was one of the most shared articles of the year. Our tip for the year ahead: Leave room in any marketing plan to adapt to seasonal or temporal trends so that you can act fast. Our tip for the year ahead: Leave room in any marketing plan to adapt to seasonal or temporal trends so that you can act fast. Tweet this 2. People are more interested than ever in climate change Climate change was one of the most talked-about (and searched) subjects this year, as internet users express more interest and concern than ever in the global phenomenon. In April 2021, climate-change-charged keywords peaked at 145,500 searches, and web traffic to environmental sites escalated dramatically. Similarweb Digital Marketing Intelligence shows monthly search volume has risen this year for Climate Change related keywords In addition, visits to environmental education websites experienced nearly 90% growth year-over-year (YoY). The data doesn’t lie: educational and consumer trends both point towards a greener mindset. Companies that are able to tap into this – whether it be through eco-friendly business practices or awareness campaigns – will come out ahead in 2022. Similarweb Digital Research Intelligence shows environmental education websites have received the biggest uplift in traffic this year. 3. Electric transportation races ahead Building off of the consumer’s growing eco-consciousness, there’s been a clear shift this year in preference towards electric bikes as alternatives to buses, cars, and other smog-producing forms of transportation. This change is reflected in search behavior – both on Amazon on-site search and search engine traffic to leading e-bike brands’ websites. A deeper dive shows how trekbikes.com, a major player in this space, has seen traffic around electric bikes increase by four times over the last year. The growth peaks both in August 2020 and February 2021 could be attributed to well-placed advertisements or marketing campaigns that capitalized on the growing interest in this category. 4. Our favorite in-person activities are back Although we’re not back to normal yet (and maybe we’ll never be), COVID restrictions eased throughout 2021, and people returned to in-person gyms and fitness classes for the first time in over a year. And how did they find their new gym? On the internet of course. Classpass.com, a popular site used for booking in-person fitness classes, hit its highest level of traffic since 2019 at 784,700 in May 2021. This is 113.4% higher than in May 2020 in the middle of the pandemic. Restaurants and dining were other luxuries that we had to temporarily say goodbye to for most of 2020. While grocery and food deliveries soared, reservations for in-person dining dropped drastically. However, after almost a year of cooking for ourselves at home, it’s finally time to go out and grab a bite at our favorite spots. Both resy.com and opentable.com, two go-to websites sites used for booking dining reservations, have hit their highest traffic levels since before the pandemic at 2.6 million and 9.5 million in May 2021 respectively. For resy.com, this was a whopping 2,015% higher than the year before. 5. No live audience, no problem There was a ton of pent-up anticipation for the 2021 Summer Olympic Games in Tokyo. And when the Olympics Committee announced that there would be no in-person fans allowed for health and safety concerns, millions tuned in online to watch their favorite athletes and read recaps of the competitions they couldn’t see live. Using search interest analysis for 90+ Olympic-related keywords in July, we ranked the countries with the most dedicated fans. The U.S. set a record for its average monthly search volume, clocking in at 4.9 million. Silver-medalist India drove 2.2 million Google searches, and the U.K., our bronze-medalist, put up a score of 886,800. Another tip for you for the year ahead – include remote or virtual options for any event you’re planning. Consumers have adapted to our new reality and will expect these types of options in the future. 6. Drone delivery takes off We’re officially living in a SciFi movie and drones are playing a huge role in shaping the future of logistics and eCommerce. With more and more consumers buying online, whether it be groceries, clothes, home goods, etc, companies are looking for fast, reliable, and cost-effective shipping solutions. Drones are quickly becoming everyone’s go-to. In fact, as the demand rises, drone delivery service Wing (operated by Google’s parent company, Alphabet) has recorded strong growth in the last 24 months. Year-to-date (January 2021 – August 2021), the website experienced a 12% YoY jump in the U.S. market, and an incredible 111% YoY surge in visits from Australia. Although it’s not mainstream yet, keep an eye on this field, especially if you are in a line of business that requires shipping goods directly to consumers. You don’t want to be stuck in the past (or really on the ground) if all your competitors start offering drone deliveries to customers. Insights and analysis by Michael Mckay 7. TikTok revives retro brands TikTok is one of the most impactful marketing tools right now, especially if you are targeting Gen Z or millennials directly. One viral video and you could be the talk of the down with the product that everyone must-have. TikTok has become so powerful that even brands we consider retro are rising to popularity again after small cameos on the social media platform. In August 2021, after being featured in a TikTok on the benefits of sour candy for panic attacks, Warheads experienced a significant brand lift which resulted in an uptick of over 2,239% in revenue on Amazon. Insights and analysis by Kaitlyn Boehm via Shopper Intelligence Abercrombie & Fitch experienced similar growth and popularity which can be attributed to TikTok users’ obsession with a particular pair of jeans the retailer sells. As users tried to score a coveted pair of pants, traffic to abercrombie.com grew nearly 9% YoY in Q3 2021, while visitation to its major competitors declined. Insights and analysis by Maria Pashi 8. Companies prep for a cookieless future A cookieless future is upon us. And even though Google decided to postpone its sunsetting of 3rd party cookies, this change will happen and when it does it will profoundly impact how publishers, media, and agencies can capture ad spend. As we shift further into a digital-centric world that will rely less on cookies, the question we need to pose ourselves is “what is the future of advertising?” Well, what better way to answer this question than to go back to our roots and focus again on product placement Forward-thinking brands are using this time to develop direct relationships and communicate their unique value to customers before cookies disappear – Sweet Baby Rays BBQ Sauce did just that in October 2021. Although Mark Zuckerberg isn’t your typical influencer, subtle product placement can help catalyze a simple product’s traction in the market. Sweet Baby Rays was already on a positive trendline upwards at the beginning of the year, but with a subtle placement in the background of Zuckerberg’s Meta announcement, the climb isn’t slowing down. Insights and analysis by Kaitlyn Boehm Digital advertising is going to change dramatically as we shift towards a cookieless world, so brands will have to figure out creative strategies to stay relevant in a competitive market. 9. #SUEZBlocked: Readers want news on-the-fly Between March 23 – 29, 2021, a huge shipping container was blown off course and became stranded in the Suez Canal, blocking any access or trade through the waterway. Like any global event, the internet jumped on the discussion resulting in 133,000 shares of the hashtag #SuezBLOCKED and more than 145,200 interactions on Twitter. People were googling the event so much that the search term suez canal grew 200% YoY. Trending keywords that people were most likely to search included suez canal blocked, suez canal ship stuck, suez canal crisis, and suez canal blockage. Publishers and media websites were able to capitalize on this buzz and fast. Prior to the event, organic search competition related to the Suez Canal came almost exclusively from reference materials or search engines, such as wikipedia.org, youtube.com, britannica.com, history.com, and google.com. However, in March 2021 there was a noticeable transfer of power. Eight of the top 10 media websites won significant traffic distribution for “suez canal,” one of the first times that publishers stole such a significant amount of traffic away from the reference websites for this category. 10. Bye bye Alexa, hello Similarweb API After 25 years on the market, Amazon announced that it will retire its website ranking tool, Alexa.com by May 2022. Although it’s a bittersweet end, we’re entering the next generation of website rankings, one that at Similarweb, we believe should be free for everyone. Just last week, Similarweb launched a new, free website ranking API tool to complement its suite of existing Digital Intelligence tools, so that you can get the rank data you need to stay competitive and win your market at no cost. Try it for yourself. Just follow these steps: Step 1: Explore to similarweb.com No login is necessary Access key high-level ranking metrics across various channels and countries Step 2: Download our Browser extension Review in-depth statistics for any website visited Step 3: Try our new DigitalRank API Get free global ranking metrics Analyze Ranking Data for Free With DigitalRank API Here’s to looking at 2022 It’s hard to believe everything that happened in 2021. And while staying on top of all these trends can seem like a daunting task, it’s an important step in your market research and digital strategy for the future. A good data and analytics platform will take out much of that guesswork, and help you narrow down your focus on what matters most to your business – whether that be capitalizing on seasonal events, understanding what consumers are searching for, or tracking industry leaders to stay competitive. With Similarweb Digital Research Intelligence, you can do all that and more. There’s no time to waste. Get started today so that you can prepare for what’s coming next. Enjoy 360° Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant Try Similarweb for free by Molly Winik Senior Content Marketing Manager Molly has 8+ years of experience in marketing, content creation, and PR. Her work has been featured on Mention, The Times of Israel, and Culture Trip. Related Topics: Digital Analysis This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence Competitor Monitoring: How to Track Your Competitors Online Content Marketing Digital Analysis by Monique Ellis 10 Min. Sep 18, 2023 Updates New Feature: The Most Granular Way to Analyze any Sector or Market Digital Analysis Product Updates by Liz March 3 Min. Jan 11, 2023 Research Intelligence Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know Digital Analysis by Daniel Schneider 30 Min. Nov 25, 2022 Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Digital Analysis Product Updates by Liz March 3 Min. Oct 12, 2022 Research Intelligence The ROI of Digital Intelligence: Time, Money, and Opportunity Digital Analysis by Molly Winik 4 Min. Sep 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Year in Review: 10 Biggest Digital Trends of 2021"
    },
    {
      "level": "H2",
      "text": "1. Pop culture is still king queen – the Megan and Harry interview"
    },
    {
      "level": "H2",
      "text": "2. People are more interested than ever in climate change"
    },
    {
      "level": "H2",
      "text": "3. Electric transportation races ahead"
    },
    {
      "level": "H2",
      "text": "4. Our favorite in-person activities are back"
    },
    {
      "level": "H2",
      "text": "5. No live audience, no problem"
    },
    {
      "level": "H2",
      "text": "6. Drone delivery takes off"
    },
    {
      "level": "H2",
      "text": "7. TikTok revives retro brands"
    },
    {
      "level": "H2",
      "text": "8. Companies prep for a cookieless future"
    },
    {
      "level": "H2",
      "text": "9. #SUEZBlocked: Readers want news on-the-fly"
    },
    {
      "level": "H2",
      "text": "10. Bye bye Alexa, hello Similarweb API"
    },
    {
      "level": "H2",
      "text": "Here’s to looking at 2022"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Competitor Monitoring: How to Track Your Competitors Online"
    },
    {
      "level": "H3",
      "text": "New Feature: The Most Granular Way to Analyze any Sector or Market"
    },
    {
      "level": "H3",
      "text": "Research 101: The Ultimate Dictionary of Terms Every Digital Researcher Needs to Know"
    },
    {
      "level": "H3",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H3",
      "text": "The ROI of Digital Intelligence: Time, Money, and Opportunity"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Molly Winik"
}