{
  "url": "https://www.similarweb.com/blog/research/market-research/5g-race/",
  "slug": "5g-race",
  "title": "Who's Winning the 5G Race? | Similarweb",
  "description": "Over the past year, the big four mobile carriers in the US launched their 5G offerings. How their race is unfolding into traffic and search? Click to see",
  "content": "HomeBlogResearchMarket ResearchWho's Winning the 5G Race? Research Intelligence Who’s Winning the 5G Race? Start your free trial by Daniel Schneider , Director, Content Marketing 4 Min. January 23, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic What Is The 5G Race 2020 is a crucial year for the big four telecom companies – soon to be big three, following the T-Mobile-Sprint merger – as they race to deliver the fifth generation of wireless networks. AT&T, the largest telecom provider in the US, was the first to roll out 5G in December 2018 to a selected list of cities. Sprint, Verizon, and T-Mobile quickly followed with their 5G networks in 2019. Let’s see who’s winning the early stage of the battle. For the sake of this post, we used Similarweb’s Website Segments Analysis to focus specifically on the 5G pages of these providers for the timeframe of July to December 2019. Traffic to 5G Offerings Is Increasing Interestingly, even though T-Mobile was the last to join, launching its 5G network in July, it is outpacing AT&T in terms of traffic volume and is close behind Verizon, the group leader. T-mobile’s 5G-related pages experienced a 328% growth between October and December. This coincides with the company’s announcement in December about the expansion of its 5G coverage. AT&T’s 5G pages also saw increased traffic, gaining 187% during the same time frame, but it still has very little traffic compared to the competition. A further indication of this trend can be found in the providers’ share of 5G traffic (out of total website traffic). All hope to increase 5G visits, but the share of traffic to att.com and sprint.com is plateauing, while traffic to t-mobile.com and verizonwireless.com’s is rising. In September 2019, visits to 5G-related pages accounted for 2.4% of visits to verizonwireless.com in the US, while just 0.2% of visits to att.com were related to 5G. But, to put this in context, we need to consider the total amount of unique visitors each provider is getting, which serves as an indication of growth. AT&T had the largest amount of unique monthly visitors all throughout 2019, but since March, we see a slight downward trend. Verizon, on the other hand, saw its traffic grow significantly in the final quarter of the year, topping AT&T for the first time in November with 12.5M unique visitors. Let’s try to see if this is related to the 5G launch. Verizon Is Tripling Down On 5G PPC One of the most effective marketing channels companies often turn to first in order to promote new products and services is Paid Search. Looking at each website’s paid keywords, we see that Verizon has concentrated the most on raising awareness towards its 5G offering. The company has almost tripled its share of traffic for 5G keywords, such as 5g cities and 5g home internet, from 0.36% in June-July to 1% in August-September (resulting in an increase of 30K visits). T-Mobile, AT&T, and Sprint, on the other hand, are hardly spending money on 5G-related keywords, evident in the fact that only 0.02% and 0.04% and 0.18% of their paid traffic went to these keywords, in the same timeframe. SEO and PPC Are Better When Used Together Another way of looking at this topic is by analyzing audience intent using Similarweb’s Keyword Analysis tool. On average, ‘5G’ search terms are responsible for 1% of search visits to the group. But, not everyone is building up their content around 5G or investing in relevant paid traffic sources. As the graph below shows, Verizon gets 1 in 4 organic searches and over 70% of paid traffic for 5G keywords, despite the fact AT&T’s organic presence is stronger and its overall spending on PPC is nearly the same size. But Is There A True Interest Here? Diving a bit deeper reveals that ‘5G’ is indeed a highly competitive keyword: it is the only keyword with an average monthly volume of over 100K. Verizon is winning the traffic for this specific keyword but has a lot of competition with T-Mobile on other high-intent, non-branded keywords. These include terms like ‘5g networks’, ‘what is 5g’ and ‘5g phones’. Here also, AT&T is absent from the scoreboard. High-intent 5G keywords Focusing on 5G Devices Is Paying Off Using the Keyword Generator Tool, we created a list of the 5G Android devices that are currently available as a means of understanding how audiences are searching for 5G and comparing between the carriers’ offerings. One Plus 7T (which, up until recently, was exclusively offered by T-Mobile) is the most searched device with a traffic share of over 50%. Samsung Galaxy Fold and Huawei Mate X are also popular devices, with 22% and 7%, respectively. This also presents an opportunity for carriers to optimize their content around 5G devices and invest in related PPC campaigns. As for where these searches are going, we see that tech news sites are getting most of the organic traffic related to 5G devices – with cnet.com, techradar.com, and theverge.com, all grabbing over 3 percent. In other words, people are reading about specific devices, and only then turning to the operators’ sites. Conclusion After years of hype, ultra-fast wireless technology is finally arriving to consumers. The major carriers are insisting that 2020 will be a pivotal year for 5G, with plans to expand their coverage and offer new 5G-compatible devices. Verizon’s ability to build strong brand recognition around its offering and drive more traffic to its website (through related content and a successful PPC strategy) set an example for others to learn from as the race accelerates further on. by Daniel Schneider Director, Content Marketing Daniel brings over 10 years of content marketing experience, specializing in both B2B and B2C audiences. He thrives at managing delivery of content projects, consistently developing concepts that drive impact. Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Who’s Winning the 5G Race?"
    },
    {
      "level": "H2",
      "text": "What Is The 5G Race"
    },
    {
      "level": "H2",
      "text": "Traffic to 5G Offerings Is Increasing"
    },
    {
      "level": "H2",
      "text": "Verizon Is Tripling Down On 5G PPC"
    },
    {
      "level": "H2",
      "text": "SEO and PPC Are Better When Used Together"
    },
    {
      "level": "H2",
      "text": "But Is There A True Interest Here?"
    },
    {
      "level": "H2",
      "text": "Focusing on 5G Devices Is Paying Off"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Daniel Schneider"
}