{
  "url": "https://www.similarweb.com/blog/research/market-research/bnpl-industry-analysis/",
  "slug": "bnpl-industry-analysis",
  "title": "The Meteoric Rise Of The BNPL Industry In Ecommerce | Similarweb",
  "description": "The Buy Now, Pay Later market is worth billions and set to grow. Read on for full industry analysis, market share, top players and future predictions",
  "content": "HomeBlogResearchMarket ResearchThe Meteoric Rise of the Buy Now, Pay Later Industry Research Intelligence The Meteoric Rise of the Buy Now, Pay Later Industry Get the full report by Inès Durand 9 Min. April 17, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Ecommerce experienced an unprecedented rise in 2021: digitization coupled with a pandemic forced both retailers and shoppers online. Now, in 2023, ecommerce’s rise has faltered slightly. While it’s still way bigger than pre-pandemic levels, rising interest, inflation, and various other macroeconomic factors have stalled growth. So with an ultra-competitive playing field, retailers should look to trends, tech, and innovation to make up for the shortfall in demand. In an exclusive report, we analyzed multiple industries to review conversion performance and found a gap. Retailers that have Buy Now Pay Later (BNPL) technology enabled on their website overall performed better than those without. In this article, we take a look at what BNPL is, who the biggest players and consumers are, and what the future looks like for this tech and retailers. What is BNPL? BNPL stands for ‘Buy Now, Pay Later’. While banks and financial institutions have offered the concept of ‘credit’ in various forms for years (think loans, mortgages, credit cards), ‘BNPL’ is more specific. BNPL is a payment system, only available online, and usually with no interest payments attached. This makes it an easy, convenient, and accessible payment option for the online consumer – especially for the digitally-native, UX-centric generation. BNPL market size The BNPL market size was valued at 141.8B USD in 2021 and is predicted to rise to 596.7B by 2026 (according to GlobalData estimates). In a Similarweb survey, 37% of respondents (US based) had used a Buy Now Pay Later technology, and 27% in the last 12 months as of January 2023 (note that survey was in app). With Similarweb Research Intelligence data we see BNPL increased traffic share within the payment landscape in the last three years: Desktop & mobile traffic to the 14 biggest BNPL providers grew 21.1% CAGR between 2020-2022, from 236.8M visits in 2022 to 420.8M in 2022 Monthly active users for the top 6 BNPL providers in Jan 2022 was 11.2m – 200% growth from 2021 Biggest BNPL companies While more established online payment providers, such as PayPal and Google Pay now also offer their own versions of BNPL, in this article and in our downloadable report, we have focused on providers that exclusively offer BNPL, such as Klarna and Afterpay. According to our website traffic data, the top six BNPL companies are: Afterpay (HQ: Melbourne) Klarna (HQ Stockholm) Affirm (HQ: San Francisco) Zip (HQ: Sydney) Sezzle (HQ: Minneapolis) PerPay (HQ: Philadelphia) The top BNPL providers design their services to be easy additions to an online store’s payment journey. In fact, with the growing usage of the providers, many retailers now offer 2+ BNPL providers as payment methods. There are subtle differences between each provider’s UX, but the most important factor for retailers to note is the demographic/industry each operates in. In our report, we uncovered the following information: Affirm has the higher share of users aged 45 and plus, 16% vs 12% on average. It is also strong in the consumer electronics category. Afterpay users over-index more with Fashion retailers as female consumers aged between 25 and 34 years old make over a fifth of its user base and are the most likely demographic to use BNPL for fashion Klarna’s top 20 overlapping sites show that the provider is trying to break into every retail category, with the most even distribution; 7 marketplaces, 7 fashion retailers, 2 beauty & consumer electronics, 1 in Home & Garden and Groceries BNPL consumer insights We ran a survey, conducted on a representative sample of 2,507 US respondents, to gain consumer insights into the adoption and usage of this payment technology. We analyzed the survey results against the online behavior of respondents to ensure the scores were reflective of reality. BNPL demographics BNPL adoption is growing and growing fast. While there is not much difference between gender adoption (53% male vs 47% female), by far the largest age bracket is 25-34-year-olds, who make up 40% of the user base. We expect growth in adoption for every age category, but pay close attention to: young Gen Zers with emerging spending power, and older Gen X and boomers who are traditionally ‘slower to the party’ with emerging tech. Consumer motivation for using BNPL In our survey, the key motivations for using BNPL can be grouped into three categories: Convenience. This is the biggest group, where ‘longer to pay’, ‘cheaper’, ‘simpler’, and ‘quicker’ all fit into BNPL’s wheelhouse. This user base doesn’t necessarily need to use the finance option, however, they choose to as it fits in with their lifestyle and is cheaper (no interest) and simpler (UX) than credit cards or traditional finance methods for prolonging payment. Only option. For 31.9% of respondents, it was the only way they could purchase the item(s). Our survey showed that of this group, 35% of female BNPL users said BNPL was their only financing option and had no alternative for payment, versus only 28% of male BNPL users. ‘Try before committing’. This reason was most represented within the 18 to 24-year-old BNPL user group (26% vs 16% average for all age groups), with this behavior costing a lot of money in return costs for retailers. While there are those who use BNPL because they have no choice, the majority don’t need to use it, but choose to. The biggest reason for using it is ‘longer to pay’, ie. spreading payments, and we see evidence of people using not only using it for fashion or ‘one-off’, larger purchases, but on everyday purchases in marketplaces like Target, Walmart, and even DoorDash. Similarweb behavioral data shows people who actively shop online and are ‘in trend’ lean towards using BNPL more than others – so capturing this engaged, active audience is an opportunity for businesses. Understanding audience demographics, and consumer trends helps businesses become truly customer-centric. Insight from a real BNPL user Age: 26 Gender: Male Location: New York, U.S. Job: Investment Associate “I started using BNPL in 2021. I first decided to use it having seen it as a payment option on some fashion websites, and I thought it seemed like a good idea to spread payments, without the interest. I would have usually used a credit card for purchases like this in the past, but BNPL is cheaper and still builds up your credit score, so it makes more sense to me. I use Klarna, and regularly shop at Farfetch or Adidas, although I could afford paying in one go. Recently, I started using BNPL for Home appliance purchases. “I haven’t missed any payments. I am loyal to ‘Klarna’ but might consider signing up to other providers if a retailer doesn’t offer Klarna, especially if the purchase has a higher price point.” Usage and purchase data for BNPL Monthly Unique Users for all Buy-Now-Pay-Later Apps combined (Android & iOS) U.S., App, February 2021 – January 2022 Usage shows overall YoY growth from 2021 to 2022. However, the 2021 holiday season outperformed 2022’s holiday season, which was generally quieter for the whole of ecommerce due to macroeconomic factors. In terms of purchase information, our survey and data show: 72% of 25-34-year-olds used it for fashion purchases in the last 12 months 35% of 35-44-year-olds who made a Fashion & Apparel purchase used it for workwear in the last 12 months 25-34-year-old group with the highest occurrence of a home appliances purchase in the last 12 months 62% of Gen Z consumer electronics via BNPL shoppers declared using it to buy Gaming Consoles Buying groceries with BNPL was most common within the 35-44-year-old age group For more in-depth data and commentary on usage and purchase information, download our full report: BNPL Industry Impact Similarweb analyzed 291 U.S. Merchants in several ecommerce industries: Beauty & Cosmetics, Consumer Electronics, Fashion & Apparel, Home & Garden, Jewelry & Luxury, looking at Year-on-Year converted visits and conversion rates for merchants offering Buy-Now-Pay-Later at checkout against those who don’t. Our study revealed that US Merchants offering Buy-Now-Pay-Later solutions saw an average better YoY converted visits (+2%) performance than those without BNPL (-11%). On average, merchants with BNPL also saw a 0.5% increase in conversion rate vs. a drop of 0.2% in conversion rate for those without the tech. Most associated with BNPL, the ‘fashion and apparel’ category, had an increase in extra converted visits for BNPL merchants (+5% vs +1% without). We see a general trend in BNPL adoption for more expensive items, consumer electronics being one category and luxury and jewelry being another. Non-BNPL-enabled sites in this sector faced a huge -19% of converted visits, whereas sites with BNPL tech only dropped 5.5%. With both conversion and traffic analytics, we see the impact of BNPL on bigger ticket items: Jewelers Jomashop.com, Brilliantearth.com & Davidyurman.com, whose engagement rings are priced between $500-$15,000 dollars, offer Buy Now-Pay Later alongside traditional financing options. Their converted visits skyrocketed YoY, growing by 90%, 27%, and 22% respectively, versus an average drop in converted visits of -10% YoY for all jewelry and luxury products retailers in our sample. Analyzing YoY traffic and converted visits across a market gives a clear view of website benchmarks. These are metrics we suggest every business monitor and analyze, especially in a post-covid world, where both the online and macroeconomic landscapes are facing significant and frequent changes and challenges. Spotlight BNPL industry impact: consumer electronics The Consumer Electronics industry has been hit hard in 2022, with visits and conversions down across the board. We found this industry gets the highest advantage in offering BNPL solutions. BNPL-equipped retailers saw a drop of desktop converted visits of only -0.6%, while retailers without BNPL’s converted visits fell by over -17% YoY. And moreover, in our survey, 26.7% of consumers using BNPL for consumer electronics would not have been able to buy without this financing option, representing an additional potential drop in demand for the category. The rise in BNPL usage for consumer electronics is telling. Traditionally retailers have associated this payment method with fashion, beauty and smaller, but more frequent purchases. With the stagnation of wages, and the cost of living crisis growing, we are seeing online consumers turn to BNPL for more expensive, one-off purchases. Concurrently we are also seeing more consumers opting to rent electronics rather than buy, so the landscape is tough, and retailers need to pivot their offerings and payment methods to capture the audience. The future of BNPL With the market size of BNPL set to grow to $500bn+ by 2026, the adoption and prevalence of this technology is far from saturation point. However, as of yet, BNPL is an unregulated finance option. In a landscape of economic downturn, and increased presence, advertising and awareness of BNPL is likely to keep eating into the more traditional finance market. Banks and financial institutions aren’t likely to sit back and let more of their pie get taken without challenge. Depending on how and when BNPL is regulated, it could lose its USP of being readily and easily available to all. The other risk is the rise of Gen-Z spending habits. In our survey, the Try-Before-Pay reason to use BNPL was most represented within the 18 to 24-year-old user group (26% vs 16% average for all age groups), with this behavior costing a lot of money in return costs for retailers, not to mention the environment. Overall, the technology has found a sweet spot for consumers and retailers – it makes shopping easier. Although there could be challenges coming in the future, BNPL already has a core user base, excellent public awareness, and growing adoption industries beyond ecommerce retailers (travel being the primary example), we see this as an emerging tech that’s here to stay. Mixed methodologies for market research in 2023 Having access to consumer behavior data, as well as technographic data is a must for retailers operating online. While survey data shows intent, it cannot provide analysis into performance. Similarweb flipping traditional market research on its head. Our data and services identify growth opportunities amid macro decline with richer, more accurate, and timely insights. This consumer-first and mixed-methodological approach is especially important in a downmarket, where recession is looming and a new generation has spending power. New trends, habits, and technologies are emerging and evolving at breakneck speed. Similarweb delivers ready-made and custom data via different solutions and services. To get the full story and datasets behind this article, download the full ‘Rise of BNPL’ report: FAQs What is BNPL? BNPL stands for Buy Now, Pay Later. It’s an online payment method that allows users to delay and spread payments, usually without interest. What is an example of BNPL? Afterpay, Klarna, and Affirm are examples of fintech companies that provide Buy Now, Pay Later finance, and technology solutions for ecommerce websites. What is the advantage of BNPL? For retailers, BNPL can help improve conversions and purchases at check-out. The advantages to users are that it is easy to use, helps spread payments, and is readily available. Who is the biggest BNPL provider? While PayPal, GooglePay, and other large financial companies offer BNPL, the biggest specific BNPL company is Afterpay, followed by Klarna and Affirm. Boost Your Market Research with Similarweb Enjoy 360° visibility into your industry and instantly adapt to market changes Book a live demo by Inès Durand Inès provides market research insights in Retail, CPG, and Financial Services. Her work has appeared in Retail Today, CNBC, and AFP. Related Topics: Market Research Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Meteoric Rise of the Buy Now, Pay Later Industry"
    },
    {
      "level": "H2",
      "text": "What is BNPL?"
    },
    {
      "level": "H2",
      "text": "BNPL market size"
    },
    {
      "level": "H2",
      "text": "Biggest BNPL companies"
    },
    {
      "level": "H2",
      "text": "BNPL consumer insights"
    },
    {
      "level": "H3",
      "text": "BNPL demographics"
    },
    {
      "level": "H3",
      "text": "Consumer motivation for using BNPL"
    },
    {
      "level": "H3",
      "text": "Insight from a real BNPL user"
    },
    {
      "level": "H3",
      "text": "Usage and purchase data for BNPL"
    },
    {
      "level": "H2",
      "text": "BNPL Industry Impact"
    },
    {
      "level": "H3",
      "text": "Spotlight BNPL industry impact: consumer electronics"
    },
    {
      "level": "H2",
      "text": "The future of BNPL"
    },
    {
      "level": "H2",
      "text": "Mixed methodologies for market research in 2023"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Inès Durand"
}