{
  "url": "https://www.similarweb.com/blog/research/market-research/business-plan-research/",
  "slug": "business-plan-research",
  "title": "Market Research for a Business Plan: How to Do It in a Day | Similarweb",
  "description": "Market research for a business plan doesn’t have to take ages. Follow our guide to get it done and dusted in less than 24 hours. It’s easier than you think.",
  "content": "HomeBlogResearchMarket ResearchMarket Research for a Business Plan: How to Do It in a Day Research Intelligence Market Research for a Business Plan: How to Do It in a Day Start your free trial by Liz March , Digital Research Specialist 10 Min. August 5, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Whether it’s your first time using market research for a business plan or this isn’t exactly your first rodeo: a quick refresh on the topic can do no harm. If anything, it’s the smart route to take. Particularly when you consider modern-day market research data can be obtained quicker than ever – when the right tools are used. Today, I’m going to explain exactly how to conduct market research for a business plan, and how to access that key data and juicy intel without hassle. The importance of market research in business planning They say knowledge is power, and where your rivals and your market are concerned, there’s nothing quite like it. By looking at things like consumer behavior, the competitive landscape, market size, and the digital strategies of others; companies at any stage in their lifecycle can stay relevant, maintain a competitive edge, set strategic direction, and experience growth. Doing periodic market research also helps businesses develop a deeper, more informed understanding of a market, its audience, and key players. If you’re seeking financial backing, doing market research is essential to show credibility and build confidence in your plans. How to conduct market research for a business plan Good market research for a business plan should be contextualized with information about your company, its goals, products, pricing, and financials. Sounds like a lot of work, right? Read on to learn how to conduct all the market research for a business plan you’re going to need – quickly, using the most up-to-date data there is. I’ll show you how to: Understand your audience Identify target personas Size your market Research the competition Discover your unique sales proposition Define marketing priorities Before you start, make sure your business planning document includes the following 10 headings: This format is considered best practice, so I’ve indicated the specific sections that each element of your market research fits into. Sound good? Then let’s get started. 1. Understand your audience What it is – A target audience is a social segment of people who are likely to be interested in your products or services. It’s a snapshot of your target customer base, sorted by certain characteristics. It’s also known as audience demographics and can contain data like age, gender, location, values, attitudes, behaviors, and more. Where to use this market research in a business plan – Demographical data can help determine the size of your market, which slots into the executive summary, marketing plan, market sizing, and financial sections of the plan. What’s more, when you use it to identify groups of people to target, it can also be used in the products and services, competitive research tools, and SWOT analysis sections. Bonus: Audience demographics can also help you develop stronger branding by choosing imagery that appeals most to your ideal customers. How to do a quick audience analysis Similarweb Research Intelligence gives you the ability to view almost any industry in a few seconds; you can also create a custom industry based on specific players in your market. Here’s how to see relevant audience demographics in a market. For this example, I chose the airline industry. View typical audience relevant to your sector with gender and age distribution, along with geographical data. You can see which companies are experiencing growth and at what rate. Audience loyalty is also key to understanding how people behave, if they tend to shop around and what search terms they use to discover sites in any niche. Read more: Learn more about how to do a demographic analysis of your market’s audience. 2. Identify target personas What it is – An audience or target persona is a typical customer profile. It starts with audience demographics, and then zooms into a much deeper level. Most organizations develop multiple target personas, based on things like pain points, location, gender, background, occupation, influential factors, decision-making, likes, dislikes, goals, ideals, and more. Pro Tip: If you’re in B2B, your target personas are based on the people who make purchasing decisions, not the business itself. Where to use this market research in a business plan – Creating target personas for your business shows you know whom you’re targeting, and how to market to them. This information will help you complete market sizing, product or service overview, marketing plan, and could fit into the competitive research section too. How to create a buyer persona in five steps Guesswork does not equal less work – there’s no place for shortcuts here. Your success depends on developing the most accurate representation of who your customers are, and what they care about. 1. Research: If you’re already in business, use market research surveys as a tool to collect information about your customers. If you’re a startup or pre-startup, you can use a platform like Similarweb to establish a typical customer profile for your market. Don’t forget to use mobile app intelligence and website analytics in tandem to build a complete picture of your audience. Pro Tip: Secondary market research is another good source of intel for startups. You might be able to find published surveys that relate to your products or market to learn more. 2. Analysis: Here, you’re looking to answer key questions to fill in the blanks and build a complete picture of your ideal customer. Tools like Similarweb Digital Research Intelligence, Google Analytics, and competitors’ social media channels can help you find this out. Typical questions include: Where is your audience coming from? What channels do they use to find your site? Do they favor access via mobile site, app, or desktop? What are their demographics? Think age, job, salary, location, and gender. 3. Competitive market research: This shows you what marketing channels, referral partners, and keywords are sending traffic to businesses similar to yours When you combine this data with what you learned in sections 1 + 2, you are ready to build your personas. 4. Fill in a buyer persona template: We’ve done the hard work for you. Download a pre-made template below. Further reading: The complete guide to creating buyer personas 3. Size your market What it is – Market sizing is a way to determine the potential size of a target market using informed estimation. This is how you find out the potential revenue and market volume applicable to your business. There are three key metrics: total addressable market (TAM), service addressable market (SAM), and service obtainable market (SOM). Where to use this market research in a business plan – Knowing how big the slice of the pie you’re going after is crucial. It can inform any goal setting and help with forecasting too. This data can be used in your executive summary, marketing plan, competitive research, SWOT analysis, market sizing, operations, and financial sections. Further reading: How to do market sizing shows you how to calculate the TAM, SAM, and SOM for your business. 4. Research the competition What it is – Competitive landscaping shows who you’re up against and how your offering stacks up vs others in your space. By evaluating rivals in-depth and looking at things like features, pricing, support, content, and additional products, you can form a detailed picture of the competition. Where to use this market research in a business plan – The information you gain from performing a competitive analysis can transform what you offer and how you go to market. In business planning, this market research supports the executive summary, product or service overview, marketing plan, competitive research, SWOT analysis, and operation sections. How to do competitive landscaping Using the industry overview section of Similarweb Digital Research Intelligence, competitor research is made quick and easy. Access key metrics on an industry or specific players, then download raw data in a workable excel file or get a PNG image of charts in an instant. Most data can be downloaded via excel or as an image and included in the resource section of your plan. Here, you can see a summary of a market, yearly growth, and top sites. A quick click to industry leaders shows you market leaders and rising stars. Select any name for a complete picture of their digital presence – use this to spot potential opportunities to gain a competitive advantage. Read more: See how to do a competitive analysis and get a free template to help you get started. 5. Discover your unique sales proposition What it is – Not all businesses have them, and that’s OK. A unique selling proposition (USP) is something distinctive your business offers but your rivals don’t. It can be anything that’s unique to a product, service, pricing model, or other. Why it’s useful – Having a compelling USP helps your company stand out in a market. It can make your business more valuable to a customer vs the competition, and ultimately help you win and retain more customers. Where to use this market research in a business plan – Your USP should be highlighted in the executive summary, the product and service overview, and the SWOT analysis. How to find your USP Unless you’ve developed a unique product or service, or you’re planning to sell to the market at a lower-than-average price point, you’re going to have to look for some kind of service differentiator that’ll help you stand out. In my experience, the quickest way to discover this is through competitive benchmarking. Here, I’m talking about evaluating your closest rivals to uncover things they’re not doing, or looking for gaps that your business can capitalize on. A competitive review of their site should look at things like: Customer support: do they have live chat, email support, telephone support, etc.? Content: do they produce additional content that offers value, free resources, etc.? Offers: what promotions or offers do they run? Loyalty or referral programs: do they reward loyalty or referrals? Service level agreements: what commitments do they make to their customers? Operations: consider delivery methods, lead times, returns policy etc. Price promises: what satisfaction or price promises do they offer, if at all? Go easy on yourself and create a basic template that details each point. Once complete, look for opportunities to provide something unique that nobody else currently offers. 6. Define marketing priorities What it is – A detailed plan showing how you position and market your products or service. It should define realistic, clear, and measurable goals that articulate tactics, customer profiles, and the position of your products in the market. Where to use this market research in a business plan – Relevant intel you uncover should inform the marketing plan first and foremost. However, it can also be used in the SWOT analysis, operation, and financial sections. How to do it – with a market research example Using the marketing channels within Similarweb Digital Research Intelligence, you can short-cut the lengthy (and often costly) process of trial and error when trying to decide which channels and activities work best. Let me show you how. Using Similarweb Digital Research Intelligence, I can hone in on any site I like, and look at key marketing intel to uncover the strategies they’re using, along with insights into what’s driving traffic, and traffic opportunities. In less than 60 seconds, I can see easyJet’s complete online presence; its marketing and social channels, and a snapshot of every metric that matters, like referrals, organic and paid ads, keywords, and more. Expand any section to get granular data, and view insights that show exactly where key losses, gains, and opportunities exist. You can take this a step further and add other sites into the mix. Compare sites side-by-side to see who is winning, and how they’re doing it. While this snapshot shows a comparison of a single competitor, you can compare five at any one time. What’s more, I can see industry leaders, rising players, and any relevant mobile app intelligence stats, should a company or its rivals have an app as part of their offering. Best practice for market research data in business plans When doing any type of market research, it’s important to use the most up-to-date data you can get your hands on. There are two key factors for data are timeliness and trustworthiness. For any market, look for data that applies to any period over the last 12 months. With how fast markets evolve and how quickly consumer behaviors change, being able to view dynamic data is key. What’s more, the source of any data matters just as much as its age. To emphasize the importance of using the right type of data in a business plan, here’s some timely advice from SBA commercial lending expert and VP of Commerce National Bank and Trust, Steve Fulmer. As someone who, in the past 15 years, has approved approximately $150 million in loans to SMBs; his advice is worth paying attention to. “For anybody doing market research for a business plan, they must cite sources. Most new or small businesses lack historical performance data, which removes substantial confidence in their plans. As a lender, we cannot support assumptions in their business plan or their projections if their data hasn’t come from a trustworthy source.” Wrapping up… Now you know the six ways to do market research for a business plan, it’s time to knuckle down and get started. With Similarweb, you’ve got access to all the market intel you’re going to need to conduct timely, accurate, and reliable market research. What’s more, you can return to the platform anytime to benchmark your performance, get fresh insights, and adapt your strategies to focus on growth – helping you build a sustainable business that can withstand the test of time. FAQs How do I do market research for a business plan? By using Digital Research Intelligence tools like Similarweb, you can quickly conduct audience research, company research, market analysis, and benchmarking from a single place. Another method is secondary market research, but this takes more time and data isn’t always up to date. Why does a business plan need market research? Doing market research for a business plan is the quickest and easiest way to validate a business idea and establish a clear view of the market and competitive landscape. When done right, it can show you opportunities for growth, strategies to avoid, and effective ways to market your business. What is market research in a business plan? Market research in business planning is one of the most powerful tools you can use to flesh out and validate your company or its products. It can tell you whether there’s a market for your product, and how big that market is – it also helps you discover industry trends, and examine the strategies of the rising stars and industry leaders in detail. by Liz March Digital Research Specialist Liz March has 15 years of experience in content creation. She enjoys the outdoors, F1, and reading, and is pursuing a BSc in Environmental Science. Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Market Research for a Business Plan: How to Do It in a Day"
    },
    {
      "level": "H2",
      "text": "The importance of market research in business planning"
    },
    {
      "level": "H2",
      "text": "How to conduct market research for a business plan"
    },
    {
      "level": "H3",
      "text": "1. Understand your audience"
    },
    {
      "level": "H3",
      "text": "2. Identify target personas"
    },
    {
      "level": "H4",
      "text": "How to create a buyer persona in five steps"
    },
    {
      "level": "H3",
      "text": "3. Size your market"
    },
    {
      "level": "H3",
      "text": "4. Research the competition"
    },
    {
      "level": "H3",
      "text": "5. Discover your unique sales proposition"
    },
    {
      "level": "H4",
      "text": "How to find your USP"
    },
    {
      "level": "H3",
      "text": "6. Define marketing priorities"
    },
    {
      "level": "H2",
      "text": "Best practice for market research data in business plans"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liz March"
}