{
  "url": "https://www.similarweb.com/blog/research/market-research/market-sizing/",
  "slug": "market-sizing",
  "title": "Market Sizing: Measuring Your TAM, SAM, and SOM | Similarweb",
  "description": "Market sizing looks at how big an opportunity exists in a sector or industry. Get market size formulas and see how to calculate TAM, SAM, and SOM.",
  "content": "HomeBlogResearchMarket ResearchMarket Sizing: Measuring Your TAM, SAM, and SOM Research Intelligence Market Sizing: Measuring Your TAM, SAM, and SOM Start your free trial by Liz March , Digital Research Specialist 8 Min. June 10, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Market sizing is all about potential. It’s the measurement every organization wants to increase. But before you start on your quest toward market domination, you need to know your market size, and only then, can you outline a strategic plan to help you get a bigger piece of the pie. When launching a new product, diversifying your offering, or expanding into new regions, knowing your market potential BEFORE you invest time and money is key. So, how can you work out your market size? Before you even think about using a syndicated research report published last year or data that’s out-of-date, let me explain how you can do market sizing with fresh data that reflects any market as it stands today – not last quarter, or last year. What is market sizing? Market sizing uses informed estimations to determine the potential market volume and sales revenue. Knowing how to calculate a total addressable market is just as important for those looking to launch in a new market as it is for start-ups. Why do market sizing? Calculating market size matters for several reasons. Here’s why. Allows organizations to estimate potential profit from a new product, service, or business. Helps investors decide whether to invest in a business or not. Aids the development of an effective marketing strategy that highlights the needs and potential of a core market. Gives a clearer picture of hiring needs before launch, helping to drive an optimized recruitment strategy. Doing periodic market sizing will also clarify your TAM, SAM, and SOM. What is a market size formula? You use a market sizing formula to estimate your market size. It’s the number of potential customers you can sell to. How to calculate your market size Multiple metrics go into a market sizing analysis: if you’re familiar with market size formulas you’ve probably heard of TAM, SAM, and SOM. These calculations are used to give an idea of a company’s size in relation to its market and competitors. Here, we’ll go into detail about each metric, with bottom-up approaches on calculating them. We’ll also break down the variables contributing to your potential reachable market size. Total Addressable Market (TAM) TAM looks at the entire potential value of the overall market (think, the total value for toothbrush sales in the United States in a given year). The market size estimation is a huge number, and probably unattainable by one company (unless we’re talking about a monopoly). TAM can provide a framework for a market’s potential and stability. You calculate TAM by adding up all product sales across the market. There are two ways of doing this: Add up figures for toothbrush sales per grocery chain, pharmacy, and retailer Estimate how many toothbrushes the average person buys, multiply that by the number of people in the U.S., and then by the average cost of a toothbrush Serviceable Addressable Market (SAM) SAM refers to the specific potential audience for your product or offering (keeping with our toothbrush example – the total value of online-only electric toothbrushes for kids). This is the maximum market value of your company based on this target market. To calculate SAM, add up all the relevant product sales across the market (so, add up figures for online purchases of electric toothbrushes for kids). Serviceable Obtainable Market (SOM) SOM (also known as Share of Market) is a representation of the proportion of your SAM that you’re likely to obtain for your company. Assuming you’re not the only children’s toothbrush manufacturer, that number will be smaller than the SAM. To calculate SOM, divide last year’s revenue by last year’s SAM. This is your market share. Now multiply your market share by the dollar-value SAM for this year. Market size example + formula A start-up linen company – supplying boutique hotels. Let’s say you’re considering starting a business that supplies luxury bed linens for hotels and want to explore the opportunity. Here’s how you would calculate your market size. Firstly, find out how many boutique hotels are in your market (we’re looking at the US market for this example). This allows you to establish the total addressable market (TAM) to which you could, in theory, sell your products. After doing this research, you identify 50,000 hotels in North America. Of these 50,000, you only want to sell to independent hotels, which account for 10,000 establishments. You ascertain that your core target market includes 10,000 hotels. You then do further primary market research, which involves speaking with bedding and linen distributors, who confirm an approximate success rate of 25% for annual sales into luxury hotels. Using this scenario, the following market sizing formula would be applied. 10,000 hotels x 25% = 2,500 hotels Based on the assumption that each hotel will result in $20,000 in sales, you can work out potential revenue with the following formula. 2,500 hotels x $20,000 = $50,000,000 These figures tell you that, should you achieve a penetration rate of 25%, you could potentially generate $50 million. However, this figure doesn’t account for competitor offerings, so it’s important to be conservative when estimating how much of the market potential you can grab. Pro Tip: If you’re launching a new product, conduct a competitive analysis and estimate your SOM based on factors such as web traffic analysis, marketing mix, and ad spend. Boost Your Market Research with Similarweb Enjoy 360° visibility into your industry and instantly adapt to market changes Book a live demo Top-down vs. bottom-up market sizing There are two approaches to market sizing – top-down and bottom-up. Neither gives you the complete picture, so it’s important to do a bit of both. Here’s why. Bottom-up market sizing assumes a surplus of customers in your reachable segments. With top-down market sizing, this doesn’t consider potential challenges such as ease of reaching a particular audience segment. What is top-down market sizing? Top-down market sizing looks at the whole market, taking a macro view of potential revenue and customers. Starting with the largest number and then refining according to realistic estimations of a target market. A top-down approach to market sizing is used to ascertain your serviceable obtainable market (SAM). What is bottom-up market sizing? Bottom-up market sizing starts small, then gradually gets built up. Firstly, you identify the segments you intend to reach. Then, estimations are made using assumptions (and market research) to establish growth and size. Essentially, bottom-up market sizing looks at where a product or service can be sold, the sales of comparable products, and the portion of current sales you can go after. Top-down market sizing or bottom-up market sizing – which is best? Start any market sizing or market analysis bottom-up but add in some top-down thinking too. It’s generally good practice to meet somewhere in the middle. You’ll know when you have a good market size estimation when both your bottom-up and top-down models align. You might need to tweak some of your assumptions in order to reach that happy place, but the updates are a positive part of the process that helps make your final estimate accurate. Tools to estimate market size There are ways to measure your TAM and SAM in addition to the market size formulas mentioned above. Here are a few: Primary and secondary research: Start reading online and find external resources that give information about a market. These can come in the form of articles, case studies, whitepapers, product launch announcements, and more. Financial reports: Public companies have to release their financial reports to the public. Capitalize on this information to see what the market looks like and specific competitors’ business plans. Market research tools: Market research comes in many shapes and forms. You can pay a company to create a one-off report or use resources like Similarweb Digital Intelligence for on-demand access to dynamic market insights. Additionally, for businesses looking for a customizable and scalable data solution, Similarweb’s Data-as-a-Service provides tailored data feeds and APIs that integrate seamlessly with your existing tools, enhancing both market size estimations and competitive analysis. Read more about our offering here. Interviews and in-person visits: Talk to people in the industry to get a sense of how they see market potential, customers, and challenges. This can include studying customer segments and analyzing audience demographics. Put it all together: Look at the figures and group all your information together to see if it all makes sense. If you have calculated a TAM of $1B, but conversations with business owners in the space point to half that, try to spot where your estimations may have skewed and adjust the TAM, SAM, and SOM accordingly. Market sizing a micro-market In larger organizations running multiple lines of business, each department or segment needs to size its own custom market. While this granular level of analysis was time-consuming and expensive in the past, Similarweb enables effortless customization capabilities that make the process quick, easy, and effective. Feature Spotlight: Website Segment Analysis See how to build a website segment in less than 60 seconds. This example is from the US finance market, specifically looking at credit card business lines across 6 key industry players. Once created, you can view the size of a market based on individual lines of business using Similarweb data. In Summary Good market sizing involves getting deep into the numbers. Knowing your market size (AKA your TAM, SAM, and SOM) helps you build an effective strategy and make critical decisions about investing, potential growth opportunities, marketing strategies, and more. From increasing market share to new product ideation, you can use various tools and formulas for estimates that help you make smart decisions while avoiding unnecessary risks. Here’s a market size formula chart to get you started: Want to learn more about market sizing? Check out our related blog posts Market Segmentation: Tips, Types, and Benefits Explained and 4 Types of Market Segmentation (Plus a Few Extras You Might Miss). Interested in getting started with Similarweb? Get hands-on experience with our free trial Set up a one-on-one consultation with an expert Boost Your Market Research with Similarweb Enjoy 360° visibility into your industry and instantly adapt to market changes Book a live demo Market Sizing FAQ What is market sizing? Market sizing is the process of estimating the market’s potential size from the bottom up. What is my market size? Your market size is the number of potential customers you can sell a product or service to. Are market mapping and marking sizing the same thing? Although market sizing and mapping are similar, there are key differences. Market sizing considers the potential size of a market, which involves understanding the total potential market size from the bottom-up. Market mapping is a data-driven market research strategy that allows you to strategically position yourself in the market. This can help determine who your customers are in terms of market size and value. How do I calculate market sizing? TAM (add up all product sales across the market) SAM (add up only relevant product sales across the market) SOM (divide last year’s revenue by last year’s SAM) What other tools can I use to help calculate market size? Primary and secondary desk research Financial reports Market research products In-person interviews and visits Why is market sizing important? If you can accurately assess the size of a market, you can safely launch a new product, enter new regions, diversify your offering, or make any other major, costly decisions with ease. by Liz March Digital Research Specialist Liz March has 15 years of experience in content creation. She enjoys the outdoors, F1, and reading, and is pursuing a BSc in Environmental Science. Related Topics: Company Research Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Research Intelligence Most Popular Messaging Apps Worldwide 2023 Company Research Market Research by Liz March 6 Min. Jan 31, 2023 Research Intelligence How to Research a Company: The Ultimate Guide Company Research by Liz March 8 Min. May 23, 2022 Marketing Intelligence How To Create Better Competitive Analysis Reports Ad Intelligence Affiliate Marketing by Ruth Trucks 11 Min. Apr 5, 2022 Updates Fresh Updates: Analyze Entire Companies With Company Analysis Company Research Product Updates by Chloe Nicholls 3 Min. Mar 24, 2022 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Market Sizing: Measuring Your TAM, SAM, and SOM"
    },
    {
      "level": "H2",
      "text": "What is market sizing?"
    },
    {
      "level": "H2",
      "text": "Why do market sizing?"
    },
    {
      "level": "H2",
      "text": "What is a market size formula?"
    },
    {
      "level": "H2",
      "text": "How to calculate your market size"
    },
    {
      "level": "H3",
      "text": "Total Addressable Market (TAM)"
    },
    {
      "level": "H3",
      "text": "Serviceable Addressable Market (SAM)"
    },
    {
      "level": "H3",
      "text": "Serviceable Obtainable Market (SOM)"
    },
    {
      "level": "H2",
      "text": "Market size example + formula"
    },
    {
      "level": "H2",
      "text": "Top-down vs. bottom-up market sizing"
    },
    {
      "level": "H3",
      "text": "What is top-down market sizing?"
    },
    {
      "level": "H3",
      "text": "What is bottom-up market sizing?"
    },
    {
      "level": "H2",
      "text": "Tools to estimate market size"
    },
    {
      "level": "H2",
      "text": "Market sizing a micro-market"
    },
    {
      "level": "H2",
      "text": "In Summary"
    },
    {
      "level": "H2",
      "text": "Market Sizing FAQ"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Most Popular Messaging Apps Worldwide 2023"
    },
    {
      "level": "H3",
      "text": "How to Research a Company: The Ultimate Guide"
    },
    {
      "level": "H3",
      "text": "How To Create Better Competitive Analysis Reports"
    },
    {
      "level": "H3",
      "text": "Fresh Updates: Analyze Entire Companies With Company Analysis"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Liz March"
}