{
  "url": "https://www.similarweb.com/blog/research/market-research/marketplace-wish-aliexpress/",
  "slug": "marketplace-wish-aliexpress",
  "title": "Marketplace Apps Trends: Wish & AliExpress In Focus | Similarweb",
  "description": "The Wish app is challenging AliExpress for Marketplace dominance throughout Europe, achieving massive accelerated growth in several countries. Learn more.",
  "content": "HomeBlogResearchMarket ResearchMarketplace Apps Around the World - Wish and AliExpress Research Intelligence Marketplace Apps Around the World – Wish and AliExpress Start your free trial by Similarweb 2 Min. August 15, 2018 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The global expansion of Wish is being led by huge increases in Android app installations around the world. Around Europe, Wish is challenging and overtaking AliExpress in terms of app penetration. In Argentina and Brazil, Wish is just beginning to establish its presence in competition with a giant incumbent. Founded in 2010, wish.com began life as an affiliate site making money by allowing consumers to create wish lists for products purchased elsewhere. Today Wish sells directly to consumers through its site and its app, Wish – Shopping Made Fun. Similarweb’s app analytics helps the largest eCommerce companies investigate and understand the relative performance and rates of growth of competing apps in different countries around the world. As a low-cost, online-only, general goods marketplace, Wish is a clear competitor for AliExpress. This post will explore the growth of the Wish – Shopping Made Fun Android app throughout the world in comparison to AliExpress – Smarter Shopping, Better Living in each country. App Penetration for Wish Over the past 12 months the Wish – Shopping Made Fun Android app has made significant strides in terms of app installations across various countries – most prominently, Hungary, where it increased 3x from 6% of Android devices to 18%. Australia, Israel, Italy and the UK also saw huge increases in the percentage of current installs. Competition with AliExpress Drilling into the countries where Wish’s growth has been the most explosive allows comparison with the AliExpress app. In Hungary, Wish – Shopping Made Fun shot past AliExpress – Smarter Shopping, Better Living and is now installed on almost one in five Android devices there. In the UK, Wish was already slightly ahead in Jun 2017, but a year later the app was installed on more than three times more devices than the AliExpress app. Starting from Nothing in South America In two South American countries, the Wish app had next to no penetration at all a year ago, rising to overtake AliExpress in Argentina and Brazil and begin to challenge the local incumbents in each market. Argentina In Argentina, the shopping app with the highest penetration by far belongs to MercadoLibre with 22% current installs on Android devices in June 2018. Just one year ago Wish – Shopping Made Fun was installed on 0.2% of Android devices in the country, while a year later the app had moved past offerings from AliExpress and Amazon to reach 4.8% penetration. This rate of accelerated growth for Wish’s mobile app is reflected by the changing volumes of desktop traffic to wish.com in Argentina which show initial investments in email campaigns and other offline marketing efforts driving massive improvements in both organic and direct traffic. Brazil In Brazil the Wish – Shopping Made Fun app has not quite overtaken AliExpress in terms of installs, but its rate of growth is significantly higher increasing its proportion of current installs by five times in the space of a year. This suggests that it will surpass AliExpress – Smarter Shopping, Better Living in the near future and try to challenge Mercado Libre: Encuentra tus marcas favoritas also. Desktop traffic sources from Brazil to wish.com reveal that the brand is benefiting therefrom an increasing amount of social traffic with social networks picking driving traffic to the site that was initially coming from email campaigns. by Similarweb Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Marketplace Apps Around the World – Wish and AliExpress"
    },
    {
      "level": "H2",
      "text": "App Penetration for Wish"
    },
    {
      "level": "H2",
      "text": "Competition with AliExpress"
    },
    {
      "level": "H2",
      "text": "Starting from Nothing in South America"
    },
    {
      "level": "H3",
      "text": "Argentina"
    },
    {
      "level": "H3",
      "text": "Brazil"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Similarweb"
}