{
  "url": "https://www.similarweb.com/blog/research/market-research/mortgage-websites/",
  "slug": "mortgage-websites",
  "title": "Mortgage Websites Winners from Real Estate Boom | Similarweb",
  "description": "Find out what mortgage lenders won the greatest market share with the real estate boom. Dive into insights to see what digital strategies worked. Read now.",
  "content": "HomeBlogResearchMarket ResearchHow Mortgage Websites Are Building an Edge Over the Competition Research Intelligence How Mortgage Websites Are Building an Edge Over the Competition Explore More by Caroline Ido , Content Editor 4 Min. February 17, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Interest in mortgages skyrocketed in 2020 – a year defined by lockdowns and stay-at-home orders. Record-low interest rates in the U.S. and the real estate impact also likely helped boost demand. The result: Traffic to mortgage websites shot up by 71% from 2019 to 2020. The extraordinary rise in mortgage industry-related traffic outpaced the greater financial services industry, which climbed just 25% over the same time frame. Seeing growth across the mortgage industry as a whole, raises the question: Which mortgage company websites benefited the most and how? Here we’ll break down the industry insights using Similarweb’s website analysis to investigate what marketing strategies were most effective in helping companies win a greater slice of the market share. Mortgage Websites – The market leaders Our competitive set includes U.S. mortgage lenders: Chase, Bank of America, U.S. Bank, Quicken Loans, Wells Fargo, and Rocket Mortgage. We analyzed these companies’ websites and also focused on their mortgage segments with Similarweb’s segment analysis. BoA and Wells Fargo win for organic Organic traffic was the most relied upon marketing channel for the mortgage lenders. Bank of America and Wells Fargo saw nearly 80% and 66% of all their mortgage traffic coming through organic search, respectively. Interestingly, Rocket Mortgage, the company with the lowest dependence on organic traffic in the group overall (28%), actually saw its share of voice grow the most over 2020. Rocket Mortgage’s traffic rose across channels over the course of the year, including organic traffic, direct, and referral traffic. But how did they grow their organic traffic? A greater focus on website optimization and content strategy was the most likely driver. Quicken Loans invests in paid channels Paid channels also proved to be critical for mortgage lender sites in 2020. The data shows a heavy reliance on paid and partnership channels like paid search, display ads, and referral traffic. Quicken Loans focused more on paid channels like PPC, display ads, and referrals than other sites, likely in an effort to increase brand awareness. Quicken Loans saw a rise in display ad traffic in Q4 but weren’t alone. Rocket Mortgage also saw an upswing in display traffic in Q4. Using Similarweb’s competitive analysis tools, you can dig into your competitors’ data to analyze what’s working, and what’s not. This helps you to learn from their mistakes and sharpen your strategy with ease. Keywords driving traffic to mortgage websites 1. Rocket Mortgage and Chase lead for seasonality Not all seasons see the same search volume for industry keywords. In fact, mortgage industry keyword traffic jumped in February, March, and April 2020. The real estate impact here is clear, considering spring is the peak season. Rocket Mortgage and Chase took advantage of the trend, focusing on seasonal keywords. Chase led for mortgage calculator-related keywords. And Rocket Mortgage was also a traffic leader for multiple seasonal keywords. Similarweb’s Seasonal Keyword Trends feature gives you an in-depth view of when search volume for specific keywords rose historically. Approaching keyword research from a seasonal angle helps you to identify seasonal keyword trends so you can plan ahead and capitalize on anticipated spikes for search volume and traffic. 2. Financial affiliates grab mortgage keyword traffic Mortgage websites top keywords included question queries and long-tail keywords. Other popular search terms: calculators and pre-approval keywords. Most of the traffic leaders were financial affiliates like NerdWallet, Investopedia, and Lending Tree. Pro Tip: Keyword traffic winners are often best-in-class content sites. Even if they aren’t your direct competitors, it’s worth breaking down their strategy to see what they got right. 3. Rocket Mortgage doubles lending keywords’ traffic share As for lending keywords, Chase, Bank of America, and U.S. Bank experienced growth year-over-year in their share of voice. Rocket Mortgage held the largest share of voice for mortgage lending keywords, seeing shares more than double in 2020. Search volume for lending keywords peaked in March for all sites, likely because of record low interest rates. 4. Mortgage Sites disrupting the mortgage space with keywords Own Up and Flyhomes are two companies disrupting the mortgage industry with their keyword strategy. This video explains how they are doing it and introduces other potential movers for the space. Chase dominates for direct traffic Within the competitive set, Chase had the highest reliance on direct traffic, with more than half of its traffic, excluding internal referrals, coming directly to its site rather than from a marketing channel. This could signal that Chase has the highest brand awareness for mortgages. Rocket Mortgage also showed that its brand awareness consistently rose with growing direct traffic in 2020. Its efforts in investing in organic search strategies and referral traffic likely contributed to direct traffic gain. Affiliate partnerships pay off for Chase and Wells Fargo Chase and Wells Fargo captured the most traffic from affiliates. Developing affiliate networks can help you bring in more traffic and leads. The companies doing this successfully are likely eyeing their competitors’ data closely to see who is already gaining the most from affiliates. Another important consideration is traffic growth to affiliate websites. It is crucial to build partnerships with affiliates that are experiencing high growth and to continue to monitor their traffic. With Similarweb’s affiliate analysis tool, you can identify the affiliate partnerships likely to send the most traffic and continue to monitor them over time. Digital research drives the bottom line Even when an industry experiences growth, like the mortgage industry, all companies will not benefit equally. Using a data-driven results-based digital research strategy gives you the tools to expand your share of the market. Similarweb’s website analysis can get you there. Ready to see for yourself? Schedule a demo today. by Caroline Ido Content Editor Caroline, with a background in investing analysis and content editing, holds degrees from Northeastern and Columbia. She enjoys cooking, coffee, and walking. Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "How Mortgage Websites Are Building an Edge Over the Competition"
    },
    {
      "level": "H2",
      "text": "Mortgage Websites – The market leaders"
    },
    {
      "level": "H2",
      "text": "BoA and Wells Fargo win for organic"
    },
    {
      "level": "H2",
      "text": "Quicken Loans invests in paid channels"
    },
    {
      "level": "H2",
      "text": "Keywords driving traffic to mortgage websites"
    },
    {
      "level": "H3",
      "text": "1. Rocket Mortgage and Chase lead for seasonality"
    },
    {
      "level": "H3",
      "text": "2. Financial affiliates grab mortgage keyword traffic"
    },
    {
      "level": "H3",
      "text": "3. Rocket Mortgage doubles lending keywords’ traffic share"
    },
    {
      "level": "H3",
      "text": "4. Mortgage Sites disrupting the mortgage space with keywords"
    },
    {
      "level": "H2",
      "text": "Chase dominates for direct traffic"
    },
    {
      "level": "H2",
      "text": "Affiliate partnerships pay off for Chase and Wells Fargo"
    },
    {
      "level": "H3",
      "text": "Digital research drives the bottom line"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Caroline Ido"
}