{
  "url": "https://www.similarweb.com/blog/research/market-research/regional-banks/",
  "slug": "regional-banks",
  "title": "What the BB&T and SunTrust Merger Means for Banks | Similarweb",
  "description": "The recent $66-billion megadeal to combine BB&T and SunTrust under a new bank, called Truist, is shaking up America's regional banking industry. Learn more.",
  "content": "HomeBlogResearchMarket ResearchSpotlight on Regional Banks: What Does the BB&T and SunTrust Merger Mean for Competitors? Research Intelligence Spotlight on Regional Banks: What Does the BB&T and SunTrust Merger Mean for Competitors? Start your free trial by Daniel Schneider , Director, Content Marketing 2 Min. February 12, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic BB&T and SunTrust Banks, two of the biggest regional banks in America, have recently finalized their much-talked-about mega-merger, creating Truist, a major new player on the country’s regional banking scene. To understand what this means for the finance industry, we’ve created a custom category that isolates the overall traffic to the top 50 regional banks in the US. What we see is that mobile, which accounts for 42% of traffic to this category, has seen a 6% decrease over the past 2 years. Desktop traffic is down about half a percent but remains stable. As illustrated below, just ten players capture over half of all traffic in this competitive space. The remaining 40 regional banks together capture only 40% of total web traffic, highlighting both the difficulty regional banks are facing to compete online and the opportunity mergers and acquisitions offer them to increase market share and improve their financial performance. A Glance At the Top 10 Banks Eight out of the top ten regional banks have seen a decrease in traffic. For most, the decrease was sharper than the average 2% decrease in traffic the top 50 regional banks experienced, thus indicating that the smaller players are actually gaining traffic. Usbank.com and pnc.com hold on to the No. 1 and No. 2 spots, but their overall traffic dropped by -3% and -9%, YoY. SunTrust also saw a drop of 6% in traffic, and as a result, is now getting about the same traffic as BB&T Synchrony.com is the only top bank to buck the trend with a traffic increase of 43%, achieved mostly through its growth in direct (+23%) and organic search (+35%) traffic. What Can We Expect From the Merger of Suntrust and BB&T? TD Ameritrade’s acquisition of Scottrade in September 2017 serves as a good example of how this is likely to play out. After the acquisition, it took the online broker six months to fully shut down scottrade.com’s URL and move its clients to tdameritrade.com – and the results were staggering. Traffic to TD Ameritrade in Q2 2018 saw a whopping increase of 49%, YoY. What this means is that once BB&T and SunTrust combine forces to become Truist Bank and complete their domain migration (to the recently launched truist.com), we expect they will be a top contender among regional banks with the opportunity to beat both US Bank and PNC and capture the largest share of regional bank traffic. Conclusion Truist is currently working on developing its brand awareness, which is especially important in the world of online finance. As always, marketing professionals should keep an eye on the competition’s traffic acquisition strategy to discover high-intent keywords for SEO and PPC marketing campaigns (e.g. “alternative to bbt” or “alternative to suntrust”). These can be leveraged to steal traffic, as well as to uncover potential affiliate opportunities based on the banks’ current and future referral sources. Similarweb’s industry-leading platform provides ready-to-use insights such as the ones mentioned above. Contact us to learn more. This blog post was written based on a deck by Jamie Drayton, Similarweb Lead Financial Services Consultant. by Daniel Schneider Director, Content Marketing Daniel brings over 10 years of content marketing experience, specializing in both B2B and B2C audiences. He thrives at managing delivery of content projects, consistently developing concepts that drive impact. Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Spotlight on Regional Banks: What Does the BB&T and SunTrust Merger Mean for Competitors?"
    },
    {
      "level": "H2",
      "text": "A Glance At the Top 10 Banks"
    },
    {
      "level": "H2",
      "text": "What Can We Expect From the Merger of Suntrust and BB&T?"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Daniel Schneider"
}