{
  "url": "https://www.similarweb.com/blog/research/market-research/trending-topics-2014/",
  "slug": "trending-topics-2014",
  "title": "These Were the Biggest News Stories of 2014 | Similarweb",
  "description": "From Robin Williams to Kim Kardashian, we used data to discover what were the biggest and most popular news stories of 2014 - Click to see it all",
  "content": "HomeBlogResearchMarket ResearchTop Trending Topics of 2014 Research Intelligence Top Trending Topics of 2014 Start your free trial by Ariel Rosenstein 5 Min. December 24, 2014 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic 2014 was a tough year. We worried about the Ebola epidemic, mourned the loss of Robin Williams, and wondered what really happened on board Malaysian Airlines flight 370 (we’re wondering still). Google released its Year in Search to commemorate 2014, which revealed the top trends and stories of the past year. They also made a touching video (which we highly recommend watching). This led us to reflect on which article topics were the most sought-after in 2014, in terms of site traffic and popular pages. Was it the 2014 Ferguson unrest, which began with the fatal shooting of Michael Brown before snowballing into more violence? Perhaps it was Taylor Swift’s record-breaking sale of 1989, or her fallout with Spotify? Did we clamor for more news on the Ebola outbreak, or ISIS, or were we too focused on how Kim Kardashian attempted to “break” the internet?” We used the Similarweb platform to find out. What we discovered might surprise you…but then, 2014 was nothing if not surprising. As we move forward into 2015, let’s take a look back at what was trending in 2014 and the stories that went viral. The Inside Scoop: Industry Analysis From January to November 2014, the News and Media industry grew by 20%, accounting for an impressive 26.6B visits. This makes News & Media our 3rd biggest category in terms of traffic share. What topics were drawing readers in to these news sites? We used Similarweb to reveal the top traffic-driving keywords for the industry in 2014. Robin Williams topped the list, as the prolific actor’s apparent suicide came as a shock to people all over the world. Another actor’s death – Phillip Seymour Hoffman, also came in at 3rd place, illustrating just how much we revere our stars. Within the News and Media industry, some sites had a better year than others. Here’s a look at the sites that saw a rise in rank….and the sites that were not as successful. The mirror.com tops the traffic list, increasing rank place by 41, with bbc.com coming in at a close second with a rank increase of 34. Trending Topics That Captivated Us in 2014 Next we took a look at the popular pages of some leading news sites to see which topics were the most captivating this year. The difference in story popularity can also be attributed to the respective readership of each media outlet, which is interesting to view in terms of audience interests. Ebola, the Ferguson shooting, ISIS, the Malaysian airline crash and the World Cup 2014 were undoubtedly the hottest topics of the year, as you can see from this sampling of news outlets. All 5 subjects were the top keywords driving traffic to each media site we analyzed, drawing a substantial amount of desktop visits. Where each topic placed in terms of popularity varied by news source. Robin Williams’ death was the most read-about topic on the Huffpost,while the World Cup dominated readers’ focus on the New York Times. CNN’s audience was decidedly more concerned with international affairs, as the top 3 most popular topics were global news stories. The topic of ISIS brought in over 63M estimated visits to the site this year, while Ebola came in at 2nd place, followed by the Ukranian crisis at number 3. The Other Story: Media Insights We saw the topics driving traffic to these sites in 2014, but popular articles were a separate metric providing different insights. For example, if we look at individual articles driving traffic to CNN, we get quite a different story. This came as a surprise: topping the list of most popular stories on CNN.com for 2014 was an article titled, “Your Facebook Life in 62 Seconds.” The article covered Facebook’s release of the 62-second clip showing users their most liked posts, stories, and pictures since the year they joined the social network. It’s important to note that more desktop views doesn’t necessarily mean more engagement. While the headline seemed to pique curiosity about the new Facebook highlight, most users lost interest after a few minutes. By contrast, US midterm elections seemed to hold users’ attention for a whole lot longer. For the Nytimes.com, 2014 was about quality over quantity. The website increased average session duration from around 9 minutes to almost 15, which is great progress for a news site. This means users are staying longer to read the articles. As you can see from the graph below, engagement is steadily continuing to increase for The New York Times – an encouraging trend we’re sure they’ll hope to continue for the New Year. While Huffingtonpost.com has seen a boost in rank, the engagement metrics of the site tell a different story. Average visit duration has dropped slightly during the year, from 2min 25sec in January to 2min 13sec in November. Average page visits have also decreased, from 2.29 to 1.91 page views per visit. But perhaps the most concerning trend is the growth in bounce rate. In the past year, bounce rate has grown from 62% to 71% – nearly a 10% increase – alluding to the fact that now readers are leaving the site almost immediately, or after reading just one page. This calls for some action on the part of Huffpost – perhaps it’s time to take a look at refining their marketing strategy. Now that we’ve taken a look at the top trending stories and media sites of 2014, we’re looking forward to what’s in store for the New Year. We hope 2015 will be a year of positive trends, and we can’t wait to see what they’ll be! by Ariel Rosenstein Ari is the Sr. Marketing Director at Similarweb. He has spent the last decade in ad-tech working for Kenshoo and Adquant (acquired). Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "Top Trending Topics of 2014"
    },
    {
      "level": "H2",
      "text": "The Inside Scoop: Industry Analysis"
    },
    {
      "level": "H2",
      "text": "Trending Topics That Captivated Us in 2014"
    },
    {
      "level": "H2",
      "text": "The Other Story: Media Insights"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Ariel Rosenstein"
}