{
  "url": "https://www.similarweb.com/blog/research/market-research/uk-bank-trends/",
  "slug": "uk-bank-trends",
  "title": "U.K. Banks & Financial Service Trends | Similarweb",
  "description": "Check out our ranking of top U.K. banks to learn which digital strategies are working for traditional banks (and a new foreigner). Enter now.",
  "content": "HomeBlogResearchMarket ResearchA Good Time to Disrupt the Old Guard? Here’s the U.K.’s Top 10 Banks Research Intelligence A Good Time to Disrupt the Old Guard? Here’s the U.K.’s Top 10 Banks Get The Full List by Emily Hunt , Market Research & eCommerce Specialist 4 Min. May 28, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Top U.K. banks, including Barclays, Lloyds, HSBC, and Natwest, are known as the “Big Four,” having long dominated Great Britain’s banking sector. However, changes like the rise of fintech (including open banking), Brexit, and COVID-19, have shifted the influence of this “old guard” making it clear that digital banking is essential today. Using Similarweb’s Research Intelligence we’ll look at the performance of top U.K. banks in 2021 and hone in on one “foreigner” that may be disrupting traditional, home-grown leaders. Top U.K. banks at a glance To kick off 2021 (January – April), desktop and mobile visits increased 12% year-over-year (YoY) for the top ten banks, trailing the U.K.’s overall financial industry by 20 ppts (+33%). However, banks’ YoY mobile traffic growth (5 ppts), exceeded that of financial services (1 ppts). We can attribute this to in-person customers transitioning to mobile banking with the closures of physical branches due to the pandemic. Moreover, the rise of competitors’ mobile-only banking apps like Monzo and Revolut, helped propel this growth. So, which banks are winning in this evolving landscape? Legacy bank Lloyds ranks first Founded in 1765, Lloyds ranks first place on our list of top U.K. banks, averaging 27.3 million monthly visits. This legacy bank has the largest customer base in the U.K. and audience loyalty metrics exceed that of other banks in the top five. Exclusive visitors compose 73% of Lloyd’s web traffic. With 73% exclusive visitors, Lloyds’ audience is the most loyal among top U.K. banks (via Research Intelligence) Santander sneaks up to score second Santander, based in Spain, ranked second place, with 22.4 million monthly visits, just behind Lloyds. Santander is the only foreign bank to make our top 10 list. Its traffic growth (+21% YoY) is more than 10ppts higher than legacy Lloyds’, showing Santander’s potential to win over the U.K. market. So, what do we see in this “foreigner”? Conquering online search Online search trends over recent months (February – April) show that Santanders’s digital presence is greater than others on our top 10 list, on every device: Mobile: Among the competitive set, Santander generates the most traffic for the top three trending organic search terms (both branded and non-branded). This includes “santander online banking,” “santander uk,” and “santander bank.” Desktop: Santander also wins more than half of organic trending branded and non-branded searches on desktop devices. These search terms include: “santander UK,” “santander bank,” “santander business log-in,” and “santander student account.” Santander gets the most traffic share among top banks for over half of the top, trending keywords in 2021 (desktop devices) Digital users want Santander by name and the bank is winning! Savvy targeting strategy The popularity of “santander student account,” the fifth trending search term for leaders on our list, illustrates that Santander is targeting Gen-Zs (those born between 1997 and 2012). Traffic for this term, and “santander 123,” another top trending keyword, go to its student account page. This is the second top-performing page for organic search traffic. The student account page is geared towards new customers and helps expand the bank’s market reach. To qualify for a student account, users cannot be existing customers. They also must be over 18 and in school. This young, Gen Z generation is less likely to have banked with or have loyalty to competitor banks like Lloyds. Gen-Z is also more online-savvy than older generations so Santander’s strong online presence is a crucial asset to reach this demographic. Main takeaway If Santander effectively captures this younger audience, many who have not banked with “traditional” banks like Lloyds, they can potentially capture customers of high lifetime value and not compete with the existing top U.K. banks. Santander’s strong digital presence is in line with this targeting tactic and is one that other banking brands should emulate if they want to capture younger (both Gen-Z and millennial) users. Conclusion This is only a glimpse of two leaders within the U.K. banking landscape. To dig deeper, use our Research Intelligence to pull your own insights. Here’s some of our methodology: Download companies within the financial services industry in the U.K., select time period, and order by web traffic. Once the top 10 banks are identified, create a custom industry to closely compare the selected banks. For more resources on the financial services and the U.K. so check out other articles, including: U.K. Cryptocurrency Traffic Soars: Who’s Gaining and Why? Financial Services Benchmarking Examples Top Digital Strategies for Financial Services Also, if you’re not already using Research Intelligence, sign up for a free trial to bank on top digital insights! by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "A Good Time to Disrupt the Old Guard? Here’s the U.K.’s Top 10 Banks"
    },
    {
      "level": "H2",
      "text": "Top U.K. banks at a glance"
    },
    {
      "level": "H2",
      "text": "Legacy bank Lloyds ranks first"
    },
    {
      "level": "H2",
      "text": "Santander sneaks up to score second"
    },
    {
      "level": "H3",
      "text": "Conquering online search"
    },
    {
      "level": "H3",
      "text": "Savvy targeting strategy"
    },
    {
      "level": "H3",
      "text": "Main takeaway"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Emily Hunt"
}