{
  "url": "https://www.similarweb.com/blog/investor/sector-research/digital-heat-travel-flies-online-grocery-drops/",
  "slug": "digital-heat-travel-flies-online-grocery-drops",
  "title": "Potential Consumer Behavior Post-Pandemic | Similarweb",
  "description": "Use our heatmaps to gain quick and easy visibility into the shift in online behaviors as the U.S. and U.K. start to open up their cities. Read now.",
  "content": "HomeBlogStockSector ResearchDigital Heat: Travel Flies, Online Grocery Drops Stock Intelligence Digital Heat: Travel Flies, Online Grocery Drops Get Digital Heat to Your Inbox by Liat Piazza , Investor Insights Manager 5 Min. April 21, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The U.S. and the U.K. are well underway with vaccinating their populations and opening up their cities. You may be wondering, what this means for sectors and industries long term. We have looked at some of the trends in online behaviors in these regions in an attempt to understand what consumer behavior could look like when the pandemic is over for good and lockdowns are a thing of the past. How are we doing this? Digital Heat, an easy-to-use heatmap to help you quickly identify at scale which industries and companies are most impacted by the current economic environment. The report tracks in near real-time year-over-year (YoY) weekly website traffic trends. Key Takeaways: U.S. sectors strengthening growth: Travel & leisure, transportation U.S. sectors weakening growth: Restaurant & delivery, consumer goods U.K. industries strengthening growth: Airlines, live events, OTAs & metasearch U.K. industries weakening growth: Online grocery, retail investing U.S. macro view: key changes this month After many months of below-average growth YoY, traffic to travel & leisure sites and transportation sites finally started to see above-average growth – a result of the easing pandemic-related restrictions. On the contrary, as restaurants and other places of leisure have started to open up, YoY traffic growth to restaurant & delivery sites also started showing below average YoY growth in recent weeks after making dramatic gains during the height of the pandemic. Consumer goods sites are also seeing weakening YoY traffic growth in recent weeks. Similarweb Sector Heatmap Weekly Website Visits YoY Heatmap A blue box represents above-average growth in visits to sites (or a group of sites) A red box represents an above-average decline U.S. micro view: Visits to airlines sites surge U.S. traffic to airlines sites saw YoY growth of almost 150% in the week ending April 16, 2021. The strongest growth (+364% YoY) was seen by flyfrontier.com, which holds 4.5% of the share of the online market (SoM) in the U.S. Southwest.com that holds the largest (and growing) SoM in the U.S. saw a growth of 133%. The airline holds 26.6% SoM, up 3.74 percentage points (ppt) YoY. Weekly Website Visits YoY Heatmap and Market Share Treemap U.S. micro view: Traffic growth drops for grocery & grocery delivery sites Industry average YoY traffic growth to grocery & grocery delivery sites has dropped and is more or less flat after months of positive growth. This shift is interesting given all the conversations around whether the pandemic has caused consumer behavior to shift permanently to a preference for the convenience of online. Instacart.com, which recently delayed its IPO over investor uncertainty around the long-term growth of the business post-pandemic, is seeing strong negative growth (-50% YoY). The grocery pick-up service and the delivery site hold 5.5% SoM, down 1.3ppt YoY. So perhaps these concerns were not in vain. However, it is still early days and only time will tell whether the novelty of feeling safe to do your groceries in person will wear off and consumers will revert back to the convenience of online. Weekly Website Visits YoY Heatmap & Market Share Treemap Want to access more industry and company data? Book a demo now. U.K. macro view: What’s changed? In the U.K. we see a lot of similarities to the macro trends in the U.S. with traffic growth to airlines and OTA & metasearch sites and decline in traffic to online grocery sites. As the U.K. has started to open up after a long few months of lockdown we can also see traffic growth strengthen to live events sites in recent weeks. Traffic to retail investing sites is seeing weakening YoY traffic growth in recent weeks. Similarweb Country Heatmap Weekly Website Visits YoY Heatmap A blue box represents above-average growth in visits to sites (or a group of sites) A red box represents above-average decline U.K. micro view: Traffic rises to live events sites Traffic to live events sites was up more than 200% YoY in the week ending March 25, and 166% YoY in the week ending April 16, 2021, following negative growth during the endless lockdown months. Growth amongst the sites has been variable with viagogo (+671% YoY), seetickets.com (+509% YoY), and eventbrite.co.uk (+284% YoY) seeing tremendous traffic growth. Other players such as ticketmaster.co.uk have seen more modest growth, 57% YoY. Weekly Website Visits YoY Heatmap U.K. micro view: Online grocery sites decline As we saw in the U.S. consumers have jumped at the opportunity to return to the shops to buy their groceries, displayed by a decline in YoY traffic to U.K. online grocery sites after months of strong growth. As a purely online player, the biggest concern here is the decline seen by ocado.com, -30% YoY in the week ending April 16, 2021. Weekly Website Visits YoY Heatmap This report contains a select subset of our digital market monitor offerings. We can also provide sector and industry data for the following countries: U.S., Australia, Brazil, Canada, France, Germany, India, Indonesia, Israel, Japan, Malaysia, New Zealand, and Singapore. Want to access more industry and company data? Book a demo now. Appendix – How to read the maps Cross-Industry Heatmaps These heatmaps display normalized indices based on statistical factor modeling. These indices summarize the relative performance of either a sector or an industry over time. Blue cells represent an above-average growth rate and red cells represent a below-average decline. Industry Analysis Heatmap These heatmaps represent the YoY growth rates of websites within an industry over time. Blue cells represent a high YoY growth rate, and red cells represent a YoY reduction. This post is subject to SimilarWeb legal notices and disclaimers by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Sector Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Earnings Season: How to Leverage Stock Intelligence for Alpha Asset Research by Andrea Pash 7 Min. Oct 23, 2024 Stock Intelligence Ticker Mapping: Unlocking Alpha with Alternative Data Asset Research by Andrea Pash 5 Min. Sep 23, 2024 Stock Intelligence Customer Growth: Tracking Company Success Asset Research SaaS Research by Andrea Pash 6 Min. Aug 15, 2024 Stock Intelligence Web Traffic Heatmaps: Firing Up Sector Macro Trends Sector Research by Andrea Pash 5 Min. Jun 10, 2024 Stock Intelligence Subscription Business Metrics that Define Performance Asset Research by Andrea Pash 5 Min. May 1, 2024 Stock Intelligence The Top EdTech Companies are Changing the Way We Learn Sector Research by Andrea Pash 7 Min. Mar 28, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Digital Heat: Travel Flies, Online Grocery Drops"
    },
    {
      "level": "H2",
      "text": "U.S. macro view: key changes this month"
    },
    {
      "level": "H2",
      "text": "U.S. micro view: Visits to airlines sites surge"
    },
    {
      "level": "H2",
      "text": "U.S. micro view: Traffic growth drops for grocery & grocery delivery sites"
    },
    {
      "level": "H2",
      "text": "U.K. macro view: What’s changed?"
    },
    {
      "level": "H2",
      "text": "U.K. micro view: Traffic rises to live events sites"
    },
    {
      "level": "H2",
      "text": "U.K. micro view: Online grocery sites decline"
    },
    {
      "level": "H2",
      "text": "Appendix – How to read the maps"
    },
    {
      "level": "H3",
      "text": "Earnings Season: How to Leverage Stock Intelligence for Alpha"
    },
    {
      "level": "H3",
      "text": "Ticker Mapping: Unlocking Alpha with Alternative Data"
    },
    {
      "level": "H3",
      "text": "Customer Growth: Tracking Company Success"
    },
    {
      "level": "H3",
      "text": "Web Traffic Heatmaps: Firing Up Sector Macro Trends"
    },
    {
      "level": "H3",
      "text": "Subscription Business Metrics that Define Performance"
    },
    {
      "level": "H3",
      "text": "The Top EdTech Companies are Changing the Way We Learn"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}