{
  "url": "https://www.similarweb.com/blog/investor/sector-research/edtech-companies/",
  "slug": "edtech-companies",
  "title": "Top EdTech Companies: Changing How the World Learns | Similarweb",
  "description": "There is a long list of companies changing the face of the EdTech sector. Explore some of the biggest EdTech companies and the fastest-growing EdTech companies.",
  "content": "HomeBlogStockSector ResearchThe Top EdTech Companies are Changing the Way We Learn Stock Intelligence The Top EdTech Companies are Changing the Way We Learn Get premium EdTech insights by Andrea Pash , Senior Content Marketing Manager 7 Min. March 28, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The EdTech revolution started in the 1920s. With the introduction of the radio came on-air classes disseminated to students within broadcast range. The overhead projector appeared in the classroom in 1930. The handheld calculator made its school debut in 1972. Oh, how the times have changed. Now, it’s tablets and the development of 1:1 device programs. The sector is anticipated to reach a value of $549B by 2033. Using the alternative data that Similarweb Stock Intelligence is built on, we’ve tracked and analyzed the online assets of the top EdTech companies. What are EdTech companies? EdTech companies (education technology) are companies that create hardware and software designed to enhance teacher-led learning in classrooms and improve students’ education. Since the pandemic, EdTech has grown to include all iterations of an online classroom, such as cooking classes, learning to code, and discovering a new language. EdTech companies are also targeting businesses and providing education and training for employees. Top EdTech companies in 2024 There is a long list of companies that are changing the face of education. Here are some of the biggest EdTech companies in the sector today. Duolingo (DUOL) ¡Hola! ¿Cómo estás? ¿No hablas español? Well, there’s an app/website for that. Duolingo (DUOL) offers language certification in over 40 languages, along with literacy and math programs and even a classroom aid for teachers. The app wasn’t launched to the public until June 2012, but since then, it has soared in popularity, becoming the modern language-learning go-to. By offering bite-sized lessons, Duolingo has hooked millions of users across the globe, making the daunting prospect of learning a new language more approachable. Global traffic to Duolingo’s website over the past year has seen consistent growth. Jan. 2023 saw a 9.4% YoY increase in traffic and 3.4% in Jan. 2024. Even the lowest traffic months (Feb. and Nov. 2023) saw YoY growth of 5.6% and 2.1%, respectively. Most of DUOL’s users opt for the free path to learning a new language. Registrations, an indicator of users to the free service, peaked in Jan. 2023 with over 1M visits to the page. Jan. 2024 saw 925K, a 9% year-over-year (YoY) drop. But, once registered, users do continue to return to duolingo.com. Jan. 2023 saw 4.2M visits to the login page. Jan. 2024 still saw a significant number, 3.7M, which is an 11% drop YoY. What DUOL hasn’t done is determine how to convert a free user to a paid user, albeit when it comes to language learning, that isn’t completely necessary. In Jan. 2024, there were 20K visits to Super Duolingo, a premium addition to the Duolingo experience, and in Jan. 2024, 19K visits. The company continues to offer all of its services to schools for free. Udemy (UDMY) Since its launch in 2010, Udemy has become the world’s largest catalog of online courses, with over 202,000 offerings and 57 million registered users, according to the company. In 2023, UDMY’s revenue exceeded $720M, marking a 16% increase from 2022. UDMY, in the wake of the pandemic, did have to pivot, like all online businesses, to ensure it continued to serve and engage its customers. Its active subdomains have remained positive YoY. Total customers in Jan. 2023 saw an increase of 41.5% YoY and total customers in Jan. 2024 still grew 12.4% YoY. The trend is the same in Feb. 2023, with 37.8% YoY growth and 10.2% YoY in Feb. 2024. Its business partnerships have pushed company growth internationally. Tracking client subdomains through Similarweb Technographics provides insight into this international growth. While growth in North America has become a bit stagnant, down 9% YoY in 1Q24 to date (data through February 2024), South America is up 39% YoY in the same quarter. East Asia is up 11%, Western Europe is up 4%, and Eastern Europe is up 2%. Coursera (COUR) For everything that you don’t know, you can easily find an online course at coursera.org. Coursera (COUR) is considered one of the largest EdTech companies that connects students with more than 150 universities, offering over 115 certification courses, and partners with other organizations, government and otherwise, to provide online courses. In 2023, Coursera’s revenue increased by 21% to $635.8M. Compared to other big names in the sector, COUR definitely has room to grow. It trails behind Udemy in both revenue and traffic share, coming in at 7% in 1Q24, which is a 2% increase YoY. DUOL has 10% of the traffic share and UDMY 12% in the same quarter. While the pandemic was definitely a boon for the company, lifting consumer engagement significantly, COUR is maintaining its significance in the EdTech sector. Visits to the checkout page have seen decent YoY growth, considering 1Q22 was down 5% YoY. 1Q23 was up 36% YoY, and 1Q24 (data through February 2024) is up 35% so far. The company’s certificate programs continue to draw interest. 1Q22 saw a 70% increase in traffic YoY, and 1Q24 is already up 35% YoY. Signups and logins, however, have remained low but are slowly beginning to rise, each seeing a 3% YoY increase in 1Q24 so far. Dive further into the EdTech Sector Similarweb Stock Intelligence curated insights generate alpha to support investment strategies. Talk to an expert Fastest-growing EdTech companies The number of new companies entering the EdTech space worldwide is staggering, as are lists of the ones to watch. However, a great way to see how these companies are faring is to break it down by category. One area that is seeing dynamic growth in the EdTech sector is tutoring platforms. Exploding Topics has a few of these companies in their 56 Fast-Growing EdTech Companies & Startups list. Here’s what they look like side by side. GoStudent, a platform out of Vienna, Austria, that helps find tutors across 14 different subjects, was the highest-valued K-12 EdTech in Europe at the end of 2021. But, traffic to gostudent.org has steadily been declining, dropping from 2.6M visits in Jan. 2023 to 1.4M in Feb. 2024. San Francisco, CA-based Cambly focuses specifically on finding English language tutors. Web traffic to cambly.com is trending in the same direction as gostudent.org. In Jan. 2023, there were 2.6M visits to the website, but Feb. 2024 saw only 5.1M. Preply, a tutoring platform from Brookline, MA, provides a marketplace for finding tutors in a variety of different languages and is reported to have over 1M students utilizing their platform. Web traffic to preply.com coincides with that report: in Jan. 2023, preply.com had 14.8M visits. That has grown to 18M in Feb. 2024. STEM (Science, Technology, Engineering, and Mathematics) platforms are another area of growth in the K-12 education space. Denmark’s Labster, hosts virtual labs for students to conduct experiments and practice lab techniques using VR and AR software. The company saw increased traffic to labster.com during the first part of the school year with over 600K visits in Sept., Oct., and Nov. 2023. But since Dec. 2023, the site has not exceeded 499K visits. Numerade, a video learning platform for STEM students out of Los Angeles, CA, has more than 100 million video solutions for high school students as well as university undergrad and graduate students. So far traffic to the numerade.com peaked at 7.4M visits in Apr. 2023. But visits in Feb. 2024 hit 6.8M visits. Cuemath is a live-class platform for learning math and code out of Bengaluru, India. Traffic to cuemath.com at the beginning of 2023 hit 14.9M visits in Feb. It has trended lower since, coming in under 10M visits during the summer months but reaching 12.3M visits in Feb. 2024. A third area seeing a lot of growth centers around employee coaching and growth. Edapp.com, headquartered in Sydney, Australia, is a SaaS platform that supports both retail and corporate training with access to hundreds of free courses. Traffic to the site has seen steady growth from 603K visits in Jan. 2023 to 978K visits in Feb. 2024. Another example of a growing EdTech company is Better Up, a platform designed to increase employee engagement and productivity from San Francisco, CA. Betterup.com has maintained a steady flow of traffic, hitting 4.7M visits in Jan. 2024. Coach Hub, out of Berlin, Germany, provides personalized talent development programs for employees. The company website, coachhub.com, has seen decent growth across the last year, minus a holiday season blip of 117K visits in Dec. 2023. Feb. 2024 saw a high of 209K visits, a 39K jump from the previous month. Tracking top EdTech stocks with Similarweb These insights barely scratch the surface. There are 280 EdTech stocks globally with a market cap of $190 billion. With Similarweb Stock Intelligence, investors get access to global and regional sector intelligence and premium datasets like technographics, subdomains and folders, and conversion analysis data alongside digital traffic and engagement data. This allows them to curate insights and analyses derived from this alternative data source to support and enhance investment strategies around the EdTech sector. Get the Investor Newsflash Don’t miss out! Optimize your investment research with exclusive insights from our monthly newsletter. Sign me up FAQs What is EdTech? EdTech, short for Education Technology, utilizes both software and hardware to enhance learning experiences, whether in the classroom, workplace, or at home. What are some of the top EdTech Companies? Some of the leading EdTech companies include Duolingo, Udemy, and Coursera, known for their innovative learning platforms that cater to a wide range of learning needs. How can you analyze EdTech stocks with Similarweb? With Similarweb, you can gain detailed insights and analyses by accessing a wide range of datasets, including global and regional sector intelligence, technographics, subdomains and folders, and conversion analysis data. This is in addition to digital traffic and engagement metrics, helping you to make informed investment decisions on EdTech stocks. by Andrea Pash Senior Content Marketing Manager Andrea, with her extensive marketing background and 15+ years in finance, pulls insight and crafts content for Stock Intelligence & DaaS at Similarweb. A UC Irvine grad, she's a concert lover and avid traveler. Related Topics: Sector Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Earnings Season: How to Leverage Stock Intelligence for Alpha Asset Research by Andrea Pash 7 Min. Oct 23, 2024 Stock Intelligence Ticker Mapping: Unlocking Alpha with Alternative Data Asset Research by Andrea Pash 5 Min. Sep 23, 2024 Stock Intelligence Customer Growth: Tracking Company Success Asset Research SaaS Research by Andrea Pash 6 Min. Aug 15, 2024 Stock Intelligence Web Traffic Heatmaps: Firing Up Sector Macro Trends Sector Research by Andrea Pash 5 Min. Jun 10, 2024 Stock Intelligence Subscription Business Metrics that Define Performance Asset Research by Andrea Pash 5 Min. May 1, 2024 Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Top EdTech Companies are Changing the Way We Learn"
    },
    {
      "level": "H2",
      "text": "What are EdTech companies?"
    },
    {
      "level": "H2",
      "text": "Top EdTech companies in 2024"
    },
    {
      "level": "H3",
      "text": "Duolingo (DUOL)"
    },
    {
      "level": "H3",
      "text": "Udemy (UDMY)"
    },
    {
      "level": "H3",
      "text": "Coursera (COUR)"
    },
    {
      "level": "H2",
      "text": "Fastest-growing EdTech companies"
    },
    {
      "level": "H2",
      "text": "Tracking top EdTech stocks with Similarweb"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Earnings Season: How to Leverage Stock Intelligence for Alpha"
    },
    {
      "level": "H3",
      "text": "Ticker Mapping: Unlocking Alpha with Alternative Data"
    },
    {
      "level": "H3",
      "text": "Customer Growth: Tracking Company Success"
    },
    {
      "level": "H3",
      "text": "Web Traffic Heatmaps: Firing Up Sector Macro Trends"
    },
    {
      "level": "H3",
      "text": "Subscription Business Metrics that Define Performance"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Andrea Pash"
}