{
  "url": "https://www.similarweb.com/blog/investor/sector-research/top-ecommerce-stocks/",
  "slug": "top-ecommerce-stocks",
  "title": "7 Top eCommerce Stocks for Your Watchlist | Similarweb",
  "description": "The eCommerce industry has exploded since the onset of the pandemic. Use digital data to identify the best eCommerce stocks. Read on for our top picks.",
  "content": "HomeBlogStockSector Research7 Top eCommerce Stocks for Your Watchlist Stock Intelligence 7 Top eCommerce Stocks for Your Watchlist Try Similarweb for free by Liat Piazza , Investor Insights Manager 6 Min. September 13, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The eCommerce industry is booming. While the world has been moving online for some time now, coronavirus has certainly acted as a catalyst to accelerate this shift. According to Statista, global online sales amounted to 4.28 trillion USD in 2020, up 28% from the previous year. But plenty of growth lies ahead in the world of online shopping. Global revenues are expected to reach as much as 6.39 trillion by 2024. Many eCommerce stocks are taking a hit as the incredible pandemic fueled growth seen in 2020 has started to curtail. So is this the perfect buying opportunity? In a huge and growing industry, how can you find the best eCommerce stocks to invest in? Read on to discover our top picks of eCommerce stocks to consider, based on web-traffic alternative data. America, driving the eCommerce industry For this analysis, we looked at the top eCommerce sites by traffic share globally in our universe. We also examined the countries driving the industry forward. In 2Q21 first place went to the U.S., accounting for 30.1% of traffic to eCommerce sites. Followed by Japan (8.6%), Germany (6.2%), Russia (5.7%), and the U.K. (5.4%). 1. Amazon.com, Inc (NASDAQ:AMZN) We’ll keep it brief as there is probably not much you already don’t know about the largest eCommerce player, which has a hand in everything from cloud computing and artificial intelligence to streaming and retail sales. Looking at global traffic to eCommerce sites, four Amazon.com, inc domains (amazon.com, amazon.co.jp, amazon.de, amazon.co.uk) appear in the top 10 sites by traffic share. In addition, amazon.com has the highest conversion rate in the U.S. compared to other players. This means that compared to other eCommerce sites in the U.S., amazon.com has a higher percentage of visits that end in a purchase. 2. eBay (NASDAQ:EBAY) The global eCommerce marketplace recently reported better than expected 2Q21 earnings, and is up 41% YTD at time of writing. “Revenue growth was driven by the acceleration in our payments migration and growth in advertising” stated Jamie Lannone, CEO, in the 2Q21 earnings announcement. Looking at the web traffic data to ebayads.com, eBay’s platform for advertisers, we see that total visits globally were up 86% in 2Q21. Ads aside, the majority of eBay’s revenues continue to come from transactional fees. Converted visits to ebay.com globally totaled 48.3 million in 2Q21, a 1.8% drop from the previous quarter. That said, this was the strongest QoQ conversion growth since 2Q20. 3. Shopify (NYSE:SHOP) Shopify, the eCommerce platform that hosts online stores, is a clear pandemic success story, which has grabbed the attention of Wall Street. For a company like Shopify, digital data can act as a powerful indicator for near real-time trends. Shopify powered traffic and visitor growth, our primary input for GMV, strengthened in July on a two-year basis. Meanwhile, two-year growth in active self-hosted domains, a proxy for Shopify Plus clients, has accelerated in the last two months. Track Shopify’s key digital data points here. 4. Wayfair (NYSE:W) As with many eCommerce sites, the Wayfair domains saw an uptick in traffic when the pandemic started. A year and a half into the pandemic, with vaccinations rolled out in most parts of the world, many eCommerce sites have seen traffic start to tail off at points over the past year as consumers return to stores. But with Wayfair’s online model, shoppers are continuing to visit the site, indicating the company’s ability to attract loyal customers that will continue to choose Wayfair’s online retail shop even when they have more options of in-store home improvement stores. Looking at the U.S., Wayfair’s largest market, we see that wayfair.com has a significant base of loyal users as seen by over 60% returning users on a monthly basis. And with 75.6% of orders coming from repeat customers in 2Q21 it is positive to see that this proportion remains consistent. 5. Walmart (NYSE:WMT) For the U.S. retail giant, both digital and in-store revenues play an important part in the stock’s performance. Walmart is now recovering after its stock dropped earlier this year following an earnings miss for its 4QFY21 earnings report. At present the key question investors are asking about Walmart is: Can the world’s largest retailer ensure that eCommerce sales growth stabilizes in the coming quarters? Walmart needs digital sales to stay strong even as multi-device in-store shopping picks up again. And what we are seeing in the U.S. is encouraging. Walmart.com is seeing stable unique visitor numbers. WMT’s Q2 average total monthly unique visitors came in 1% above the first quarter, although this figure is -22% when compared to 4Q20. At the same time, unique visitors remain much higher than pre-pandemic levels, at +18% vs. the same quarter two years ago. That’s thanks to pandemic tailwinds, but also Walmart’s heavy investment in its digital transformation plans. Spending on eCommerce and supply chain technologies and infrastructure represented 72% of the company’s strategic U.S. capital expenditure for its 2020 and 2021 fiscal years. Read more about Walmart’s online performance here. 6. Etsy (NASDAQ:ETSY) Etsy, inc’s stock is up 26% YTD after skyrocketing in 2020 when the pandemic hit. The marketplace reported strong first and second quarter earnings, however, the stock took a hit as the investors were concerned about slowing growth as consumers return to stores. We use global growth in unique visitors to etsy.com as a strong signal for active buyer growth. In 2Q21 this slowed sequentially vs. 1Q21, indicating incremental buyers may be thinning. In addition, global unique visitors to etsy.com, a historically strong indicator of growth in active buyers on Etsy’s marketplace, saw growth significantly decelerate vs. 1Q21. That said, Etsy (like most eCommerce retailers) faces a very tough comparison to 2Q20, when traffic exploded during the pandemic. Etsy, in particular, experienced very high demand for masks, which were trending in 2020. However, that spike in visitors has now tailed off. Looking at the actual numbers, rather than YoY growth, we also see a sequential slowdown from the peak in 4Q20, and 1Q21. Nonetheless, this was actually the third strongest quarter for Etsy in absolute number terms – despite the growth pullback. These maintained elevated visitor levels are an encouraging sign of long-term growth potential and suggest that Etsy continues to successfully attract new users to its platform. 7. Poshmark (NASDAQ:POSH) Poshmark’s stock is down since its IPO back in January this year. The most recent driver for the stock price decline is a result of management’s guidance for 3Q21 revenue falling below analysts’ expectations. As the fashion resale company is based exclusively online, let’s take a look at the web traffic data to get an indication of what might be in store for the company going forward. Traffic to poshmark.com in the U.S., Poshmark’s largest market, is seeing an upward trend. In 2Q21 monthly visits were up both on a quarterly (6.2%) and yearly (38.6%) basis. This is one to keep an eye on, as consumers are more conscious than ever before on the impacts of fast fashion and fashion waste. Final thoughts As you can see, there are still lots of opportunities to invest in the eCommerce industry, and digital data is the tool you need to truly understand the online landscape for many of these companies. With near-real-time data on over 100 million websites, 4.7 million apps, from 210+ industries, use this alternative dataset to generate more alpha, identify new investment opportunities, and strengthen your investment theses. Try Similarweb for free. by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Sector Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Earnings Season: How to Leverage Stock Intelligence for Alpha Asset Research by Andrea Pash 7 Min. Oct 23, 2024 Stock Intelligence Ticker Mapping: Unlocking Alpha with Alternative Data Asset Research by Andrea Pash 5 Min. Sep 23, 2024 Stock Intelligence Customer Growth: Tracking Company Success Asset Research SaaS Research by Andrea Pash 6 Min. Aug 15, 2024 Stock Intelligence Web Traffic Heatmaps: Firing Up Sector Macro Trends Sector Research by Andrea Pash 5 Min. Jun 10, 2024 Stock Intelligence Subscription Business Metrics that Define Performance Asset Research by Andrea Pash 5 Min. May 1, 2024 Stock Intelligence The Top EdTech Companies are Changing the Way We Learn Sector Research by Andrea Pash 7 Min. Mar 28, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "7 Top eCommerce Stocks for Your Watchlist"
    },
    {
      "level": "H2",
      "text": "America, driving the eCommerce industry"
    },
    {
      "level": "H2",
      "text": "1. Amazon.com, Inc (NASDAQ:AMZN)"
    },
    {
      "level": "H2",
      "text": "2. eBay (NASDAQ:EBAY)"
    },
    {
      "level": "H2",
      "text": "3. Shopify (NYSE:SHOP)"
    },
    {
      "level": "H2",
      "text": "4. Wayfair (NYSE:W)"
    },
    {
      "level": "H2",
      "text": "5. Walmart (NYSE:WMT)"
    },
    {
      "level": "H2",
      "text": "6. Etsy (NASDAQ:ETSY)"
    },
    {
      "level": "H2",
      "text": "7. Poshmark (NASDAQ:POSH)"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H3",
      "text": "Earnings Season: How to Leverage Stock Intelligence for Alpha"
    },
    {
      "level": "H3",
      "text": "Ticker Mapping: Unlocking Alpha with Alternative Data"
    },
    {
      "level": "H3",
      "text": "Customer Growth: Tracking Company Success"
    },
    {
      "level": "H3",
      "text": "Web Traffic Heatmaps: Firing Up Sector Macro Trends"
    },
    {
      "level": "H3",
      "text": "Subscription Business Metrics that Define Performance"
    },
    {
      "level": "H3",
      "text": "The Top EdTech Companies are Changing the Way We Learn"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}