{
  "url": "https://backlinko.com/hub/seo/choosing-keywords",
  "slug": "choosing-keywords",
  "title": "Choose Keywords: A 6-Step Essential Guide",
  "description": "How do you choose the best keyword for SEO? This step-by-step guide has you covered.",
  "content": "Choose Keywords: A 6-Step Essential GuideWritten by Brian DeanLast updated Sep. 20, 2024There’s no doubt about it: Keyword research is THE most important part of SEO. In fact, keywords are so important that they can make or break your entire SEO campaign. In other words: To succeed with SEO, you need to choose the right keywords. What are the “right” keywords, exactly? Keep reading… How to Choose a Keyword From competition to search volume, here’s the exact process for finding the best keywords for SEO. Step #1: Create a Keyword List Your first step is to create a giant list of keywords. Right now you don’t need to worry about competition, CPC or any of that stuff. The goal is just to get a bunch of keywords on a list. (I’ll show you how to pick the best keywords from your list in steps #2-#6.) With that, here’s exactly how to generate keywords for your Keyword List. Google Keyword Planner The Google Keyword Planner is technically designed for Google Ad campaigns. That said: It’s also a GREAT tool for SEO keyword research. (Plus, it’s free to use.) To use it, create a Google Ads account. Then hit “Tools” > “Planning” > “Google Keyword Planner” in the left side menu: Then, click on “Discover new keywords” and enter a keyword related to your business: And Google will spit out a bunch of related terms: They’ll also give you a ton of data on each keyword (like “top of page bid”). You can ignore all that stuff for now. Right now, just grab keywords that are remotely related to your business. And add them to your Keyword List. (As you can see, I like to use Google Sheets for my Keyword List. But you can use Microsoft Excel, Word or anything that works for you.) Semrush Semrush is my favorite keyword research tool. Why? Because it shows you keywords that your competitors already rank for. Here’s how it works: First, go to Semrush’s Organic Research and type a competing site into the tool. Pro Tip: Pick a competitor that’s around your size. If you put a giant authority site into Semrush, you’re going to see keywords that are WAY too competitive. Then, hit Organic Research → Positions to see the keywords that they rank for in Google: Google Suggest Google Suggest is AWESOME for finding long tail keywords. Just enter a keyword that’s related to your business. And Google will hand you a list of suggestions. (And these suggestions are based on what people are searching for right now. That way, you KNOW they’re popular.) Seed Keywords SeedKeywords is a VERY cool free keyword research tool. The cool thing about Seed Keywords is that it helps you find terms that people use to find what your site sells. (Which removes A LOT of guesswork from the keyword research process.) To use it, create a “Scenario”. A Scenario is where you ask people how they would search for your product or service on Google: Then, send your Scenario to people. And see what terms they used: If you’re like me, you’ll find some gems that are pretty much impossible to find any other way. Side note: “Seed Keywords” are terms that you put into a keyword research tool. Most people pick seed keywords out of thin air. Or they use Seed Keywords that they THINK people use in Google. This tool is super helpful because it helps you find seed keywords that people actually use to search. Semrush Keyword Magic Tool Keyword Magic Tool is part of the Semrush’s suite of SEO tools. Like most keyword tools, it generates suggestions based on your seed keyword. Also, Semrush personalizes your KD% score with the help of a proprietary AI. This algorithm assesses thematic relevance, competition level, and metrics of both your domain and other SERPs. Pretty cool. What sets Semrush apart is that it gives you an insane amount of data on each keyword, leveraging advanced AI to give you more information to make better decisions. Which makes choosing the right keywords A LOT easier. (More on that later.) This leads us to our second step… Step #2: Find Low-Competition Terms Now it’s time to size up the competition. Specifically, you want to identify the keywords on your list that aren’t super competitive. Here’s how: MozBar for Chrome This free tool shows you keyword competition inside of the search results. Specifically, it shows you a page’s Page Authority (the quality and quality of links pointing to that specific page): The MozBar also shows you a site’s Domain Authority (an estimate of the site’s overall authority in the eyes of Google) There’s no minimum PA or DA to look for. It varies A LOT depending on the niche. Fortunately, after a few searches, you’ll get an idea of what’s “low competition” in your industry. But in general, the lower the DA and PA, the better. Keyword Difficulty Scores Most keyword research tools have an overall “Keyword Difficulty Score”. For example, Semrush has “Keyword Difficulty”: Same as Ahrefs: And KWFinder uses something called “Keyword SEO Difficulty” The only downside of using a Keyword Difficulty Score is that it bases competition 100% on backlinks. Yes, backlinks are a super important search engine ranking factor. But they’re only one piece of the puzzle. Google also looks at how well a page is optimized for that term, whether the blog post or other piece of content is a good fit for what the searcher wants… and hundreds of other factors. In short: Keyword Difficulty Scores give a general sense of a keyword’s competition level. But they’re not 100% accurate. Step #3: Identify Search Volume Next, you want to see how many people search for the keywords in your list. (aka “Monthly Search Volume”.) You can get this data from inside the Google Keyword Planner. (They call search volume “Avg. Monthly Searches”.) You can even filter the results so it only shows keywords above or below a certain level of competition or CPC. With all that: Even though this data comes straight from Google, the number is an estimated range… not an exact amount. For example, if you look at a keyword like “SEO Tools”, the GKP says that 1k to 10k people search for it every month: Well, I happen to rank in the top 3 for that term. And I can tell you that the actual number is more like 39k: Also, most keyword tools (including Semrush) pull search volume data from the GKP. But there are two tools that estimate monthly searches using their own internal data… Moz and Ahrefs Clickstream Data Moz Pro and Ahrefs both use “Clickstream” data to figure out search volume. In other words: They DON’T pull search volumes from the GKP. Instead, they estimate search volume based on actual user behavior. For example, let’s look again at the term “SEO Tools”. Moz gives a range of “6.5k-9.3k” searches per month: Ahrefs estimates the search volume as 12k per month: I wouldn’t go crazy comparing search volumes from different sources. It’s just to show you that different tools have different ways of estimating search volume. The one question left is: How many searches does a keyword need to make it worth optimizing for? Short answer: it depends. Long answer: There’s no minimum search volume for everybody. Every industry is completely different. For example, in my niche (B2B) a keyword with a search volume of 25k/month is REALLY high. But in a B2C space like fitness, 25k is nothing. So I recommend choosing a keyword that has relatively strong search volume for your industry. Then, move on to step #4… Step #4: Assess Earning Potential It’s one thing for a keyword to have lots of searches and low competition. But the more important question is: Will that keyword make you money? Here are two ways to figure that out: “Top of Page Bid” This is Google’s estimate of how much an advertiser generally spends for a single click. It’s called “Top of page bid” because it’s how much it costs to place your ad (and get a click) at the top of Google’s first page. The higher the “Top of page bid”, the more a keyword is worth. (Also known as “Commercial Intent”.) For example, an informational keyword like “writing tips” has an estimated bid of $2: On the other hand, a keyword with strong buyer intent, like “WordPress hosting” has an estimated bid of $37.41: (That’s 18x more than “writing tips”.) I’m not saying that you need to target keywords with a $20+ cost per click. Instead, use commercial intent (along with search volume, competition, etc.) to find the most effective keywords for you. Product-Keyword Fit The second element of earning potential is called “Product-Keyword Fit”. In other words: Does this keyword have anything to do with what you sell? Obviously, the closer the keyword is to your product or service, the better that searcher is going to convert. That said: You don’t always need to target keywords that are related to what you sell. For example: My site, Backlinko, is an SEO training company. But I don’t ONLY target keywords like: “SEO training” or “online marketing courses”. Instead, I mostly target keywords that my potential customers search for when they’re NOT searching for what I sell. And I create SEO-optimized content around those search terms. For example, I rank in the top 10 for the keyword “SEO audit”: Do I sell software that helps with SEO audits? No. Do I offer a search engine optimization audit service? Nope. But I KNOW that people that search for “SEO Audit” are in my target demographic. And my content is a way to get in front of this valuable group. Step #5: Estimate Organic CTR This step is all about figuring out how many searchers actually click on the search results. I’ll explain: You might have seen charts like these before: They estimate how many clicks the #1 result gets, the #2 result gets, etc. But what those charts DON’T tell you is that the search results are more crowded than ever. For example, Google now uses millions of Featured Snippets to give you an answer to your query… without needing to click on anything. They also have more images, YouTube videos and other features that distract people from the organic results. In other words: Search volume is helpful. But if no one actually clicks on the results, it doesn’t really matter how many people search for that term. That’s why you want to get a rough estimate of organic CTR. Here’s how: Look at the SERPs All you need to do here is check out Google’s first page results for your keyword. If there’s a lot of stuff on the first page, you know that a good chunk of people won’t ever SEE the organic results… never mind click on it. For example, look at the term “life insurance”. There are 4 ads above the fold: A big Featured Snippet: And a “People also ask” box: All before you get to the first organic result! That’s not to say that you should avoid this keyword. After all, it has a “Top of page bid” of $46.95: But it’s one more thing to keep in mind as you choose the best keywords from your list. Ahrefs “Clicks” Ahrefs uses Clickstream data to figure out how many searchers actually click on something. I still recommend looking at the search results. But “Clicks” can help you filter out keywords that have a super low CTR. Step #6: Choose Trending Keywords Last up, it’s time to see whether the keywords on your list are trending up or down. Obviously, you want to pick keywords that are growing in popularity. That way, you can get MORE traffic from those terms over time. Google Trends is your friend here. Set the date range to “Past 12 months”: And look at the line. If a keyword’s popularity is up (or at least stable), that’s a good sign. If not, you might want to go with a different, more relevant keyword. Learn More Advanced Keyword Research Tutorial (5-Step Blueprint): A video tutorial that walks you through this exact process in-detail. 17 Best Free and Paid Keyword Research Tools for SEO: A list of my favorite keyword research tools right now. How to Find Long Tail Keywords: Detailed tutorial that shows you keyword strategies for finding low-competition, long-tail terms.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Choose Keywords: A 6-Step Essential Guide"
    },
    {
      "level": "H3",
      "text": "How to Choose a Keyword"
    },
    {
      "level": "H4",
      "text": "Step #1: Create a Keyword List"
    },
    {
      "level": "H4",
      "text": "Step #2: Find Low-Competition Terms"
    },
    {
      "level": "H4",
      "text": "Step #3: Identify Search Volume"
    },
    {
      "level": "H4",
      "text": "Step #4: Assess Earning Potential"
    },
    {
      "level": "H4",
      "text": "Step #5: Estimate Organic CTR"
    },
    {
      "level": "H4",
      "text": "Step #6: Choose Trending Keywords"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}