{
  "url": "https://backlinko.com/hub/seo/dwell-time",
  "slug": "dwell-time",
  "title": "Dwell Time in SEO: Key to Ranking Success",
  "description": "What is Dwell Time? And how does it impact SEO? Learn everything you need to know about Dwell Time in this actionable guide.",
  "content": "Dwell TimeWritten by Brian DeanLast updated Jun. 10, 2024What Is Dwell Time? Dwell time in SEO refers to the duration a visitor spends on a webpage before returning to the search engine results page (SERP). It indicates user engagement and content relevance, impacting rankings as longer dwell times suggest the content effectively meets the user’s search intent. Since the Google Search API leak highlighted the importance of user engagement metrics, optimizing for dwell time is now more crucial than ever. For example, let’s say you search for “grain free cookies” in Google. The first result looks like a good fit. So you click on it. But when you get there, the site is ugly and hard to use. And the content isn’t helpful. So after 5 seconds you click back to the results. Your Dwell Time was 5 seconds. And that super brief visit tells Google that you weren’t happy with that result. Let’s say you then click on the #2 result. This time, the content is amazing. And the site is easy to navigate. And you spend a solid 4 minutes and 37 seconds reading every word… then click back to the results to continue your research. That long Dwell Time tells Google that you got a lot of value from that result. And if lots of other people also spend a long time on that page, Google will give it a rankings boost. Now, there’s one thing I should point out: Dwell Time and Bounce Rate are similar… but they’re not the same thing. A bounce is when someone visits a page … and hits their back button without clicking anything on the page. It doesn’t matter if the person spent 2 seconds or 2 hours on the page. If a user clicks back to the search results, it’s a bounce. Our search engine ranking factors study did find a correlation between bounce rate and first page Google rankings. But that’s probably a case of correlation… not causation. That’s because Bounce Rate doesn’t tell you much about whether or not a searcher is satisfied with a particular result. But Dwell Time does… Why Is Dwell Time Important? We already know that search engines (like Bing) use Dwell Time in their algorithm: The question is: Does Google care about Dwell Time? They’ve never publicly confirmed or denied anything related to Dwell Time. But there are some clues and signs that Google does use Dwell Time as a ranking signal. For example, a Google Engineer was quoted as saying: “So when search was invented, like when Google was invented many years ago, they wrote heuristics that had figure out what the relationship between a search and the best page for that search was. And those heuristics worked pretty well and continue to work pretty well. But Google is now integrating machine learning into that process. So then training models on when someone clicks on a page and stays on that page, when they go back or when they and trying to figure out exactly on that relationship.” Put another way: Google’s Machine Learning algorithm (RankBrain), pays VERY close attention to how long someone spends on a page. (In other words, Dwell Time) Also, a few years ago Google rolled out an interesting new feature that let you hide a particular website from the SERPs. How did they know which sites you wanted to hide? Well, if you quickly bounced from a page, Google would prompt you to block that entire site: That’s how strongly they feel about Dwell Time. Last up, we have an interesting correlation study published on Moz. This study found a clear correlation between Dwell Time (aka “Time on site”) and Google rankings. With that, here’s exactly how to improve your Dwell Time. Best Practices “The PPT Formula” If you want people to spend a long time on your site, you need to hook them right away. And that’s where The PPT Formula comes into play. It’s a proven content introduction formula designed specifically to increase Dwell Time. Here’s what it looks like: Let’s break it down. The first line of your content should be a brief Preview of your content. This Preview lets Google searchers know that your content is exactly what they’re looking for. (Which means they’ll stick around) Here’s an example from my blog: Your second and third lines are Proof that your content can help them. This INSTANTLY shows people that your material is legit. Watch how I use proof in this intro: Finally, cap things off with a Transition. This transition gently walks the reader from your intro into the next section of your content. Here’s an example: And thanks largely to The PPT Formula (and the other strategies you’re about to learn about), that post has a time on page of 06:58. Embed Videos Embedding videos can significantly boost your page’s Dwell Time. In fact, the Wistia blog increased their Dwell Time by 260% simply by adding a video to their content: There are a few different ways to embed videos in your page. First, you can use a video in place of text content. For example, I use a video to explain an SEO technique from this list post. That video is 1:13. So if someone watches that entire video (which lots of people do), that’s an easy 1+ minute boost to my Dwell Time. You can also embed videos to related content. For example, in this post I briefly touch on click-through-rate. Instead of linking to a blog post, I embed a YouTube video that explains the process in detail: Write Longer Content This is simple math: It takes longer to read a 3,000-word article than a 300-word blog post. To be clear: I’m not saying that you should stuff your content with fluff and filler. Instead, you want to publish quality content that’s VERY thorough and in-depth. For example, this guide to link building from my blog is 4,732 words long: Even though it’s on the longer side, my guide is packed with meaty, actionable strategies: Which makes people stick on my page for 04:21 minutes on average: Community and Comments A Google employee once said that a community can help “a lot” with rankings: Is community a direct ranking signal? Or is it that having an active community indirectly helps you rank better? They didn’t say. Either way, in my experience, having a community DEFINITELY improves your page’s Dwell Time. Here’s why: First, comments are actually content that people want to read. For example, discussions like this keep people reading so they don’t hit their back button. Also, people that leave comments obviously spend extra time on the page… which boosts your page’s average Dwell Time. Maximize PageSpeed It’s no secret that people online are impatient. And if your site takes forever to load, people are going to click away before they read the first word. That’s why you want to make sure that your important web page’s are optimized for PageSpeed. PageSpeed is a confirmed direct ranking signal: And it impacts whether or not your visitors stick around. That’s why it’s smart to do as much as you can to improve your site’s loading speed. Break Content Into Chunks I get comments like this at least once per week: Is it because I’m an amazing writer? Nope. It’s because I make my content SUPER easy to read. Specifically, I break my content up into chunks. For example, take a look at this SEO site audit post from my blog: I use H2 subheaders to separate each topic into distinct sections: I also use bullets to make lots of info easy to skim: Finally, I use A TON of visuals and screenshots. These visuals not only help people implement the material… but they break the content up into bite sized pieces. Mobile Optimized This sounds simple, but stay with me: If your site is hard to use, people WON’T stick around. Unfortunately, I still see lots of sites that still aren’t mobile optimized. To check if your page is optimized for mobile devices, head into the new Google Search Console: Hit “Mobile Usability”. And it’ll let you know which pages on your site Google considers a bad mobile user experience: You even get details on what the problem is… and steps on how to fix it: Measuring Dwell Time How do you actually measure Dwell Time? There’s no “Dwell Time” report in Google Analytics or the Google Search Console. That said: Google Analytics DOES let you know about your site’s “Avg. Session Duration”. This is the average amount of time someone spends on your site after they land on that page. Which is a pretty darn close to Dwell Time. Here’s how to do it: First, login to Google Analytics. And click on “Behavior” → “Site Content” –> “Landing Pages” Then, setup a segment so you’re only looking at “Organic Traffic”. And voila! You can see exactly how long Google searchers spend on each page of your site: What can you do with this information? First, see what’s working… and apply that to other pages. For example, when I look at my Google Analytics, this post stands out: And when I take a look at the page in detail, I can see that: It’s broken up into lots of different sections. The page contains a lot of custom visuals. I mentioned lots of quotes and statements from YouTube. I used internal linking to feature other content that people might want to read. You can also improve pages that have a bad Dwell Time. For example, this page from my site has a Dwell Time that’s 38.5% below my sitewide average: That’s a page I’d want to tweak. And in some cases (like if the page doesn’t have match my keyword’s User Intent), completely overhaul the content. What’s a “Good” Dwell Time? Short answer: it depends. Long answer: A “good” Dwell Time is dependent on dozens of factors, including: Your niche The type of content The search query people use to find your page Seasonal trends And more So instead of worrying about an arbitrary number, I recommend focusing on improving your sitewide Dwell Time using the strategies you just learned about. Learn More Do Website Engagement Rates Impact Organic Rankings?: A deep-dive into how bounce rate, Dwell Time and organic CTR correlate with rankings. The SEO ranking factor you MUST master to rank in Google: In this video you’ll see how I “accidentally” ranked for a popular keyword… and how a poor Dwell Time quickly reversed those rankings. Does Dwell Time Really Matter for SEO? [Data]: More data showing that Dwell Time is almost definitely a Google ranking signal (and tips on how to improve it using Google Analytics).",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Dwell Time"
    },
    {
      "level": "H3",
      "text": "What Is Dwell Time?"
    },
    {
      "level": "H3",
      "text": "Why Is Dwell Time Important?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}