{
  "url": "https://backlinko.com/hub/seo/lsi",
  "slug": "lsi",
  "title": "What are LSI Keywords? And Do They Help With SEO?",
  "description": "What are LSI keywords? And how do you use them? I show you everything you need to know about LSI keywords in this super detailed post.",
  "content": "LSI KeywordsWritten by Brian DeanLast updated Sep. 20, 2024What are LSI Keywords? LSI (latent semantic indexing) keywords are terms that are conceptually related to your target keywords. The technology was introduced in a 1988 paper. And is described as an “approach for dealing with the vocabulary problem in human-computer interaction.” In other words: using related words and phrases (“LSI keywords”) to better categorize a page’s topic. Rather than just basing it on individual keywords. Does Google Use LSI in Their Algorithm? Google doesn’t use LSI keywords in their ranking algorithms. Meaning they’re not a ranking factor. In fact, John Mueller, a Google representative, stated in 2019: “There’s no such thing as LSI keywords – anyone who’s telling you otherwise is mistaken, sorry.” Instead, Google likely uses a more advanced approach to understanding the relevance on a page: one that takes into account much more than seeing if a page has a specific set of related words. Instead, they analyze your page as a whole to determine its overall topic. Although technically not “LSI keywords,” many people in SEO still refer to adding related words and phrases to a page as “adding LSI keywords” (even though the term is technically inaccurate). And it’s likely that Google does pay close attention to the non-target-keyword terms on your page. And use them to evaluate (and rank) your page. This means it’s helpful for SEO to add related terms to the page you want to rank. Whether you call them “latent semantic indexing keywords” or not. Why are Related Words and Phrases On a Page Important? In the early days of SEO, Google, and other search engines would figure out a page’s topic based on the keywords they found on the page. So, if Google saw the keyword “Content Marketing” repeatedly, its algorithms would determine, “This page is obviously about content marketing.” That’s why keyword density was so important back in the day. If you didn’t use your keyword a bunch of times, Google wouldn’t understand that your page was about that term. Fast forward to today, and Google is MUCH smarter. Today, Google’s goal is to figure out a page’s overall topic. Not just tying it to one single keyword. And Google relies on semantically-related terms to understand content at such a deep level. Along with other signals of course, like backlinks. For example, let’s say you just published a blog post about cold brew coffee. Google will still scan various aspects of your page to understand what it’s about. Like your title tag, content, image alt text, etc. But Google will also scan your page and pick up related keywords (like “filter,” “temperature,” “grind,” “cold water,” and “ice”). And when Google sees these related keywords in your content, the algorithm will understand that this page is about the topic of cold brew coffee. In fact, a recent Google research paper states that they use “words frequently occurring together” to understand an article’s main topic: One thing I should point out: Semantically-related terms are NOT synonyms. Instead, they’re terms that are closely tied to your target keyword. For example, take a word like: “jogging.” Well, “running” is just a synonym of “jogging.” Now: There’s nothing wrong with using that synonym in your article (in fact, it can help with your on-page SEO). But it’s not a semantically-related term. Instead, related terms for “jogging” are “shoes,” “cardio,” and “5k.” With that in mind, here’s how to find these semantically related keywords. How to Find LSI Keywords You can find LSI keywords by brainstorming your topic and considering what other words and phrases come to mind. Or you can use tools to make things easier. Here are a few easy ways to find LSI keywords: Google Autocomplete Google Autocomplete is one of the fastest and easiest ways to uncover related terms to sprinkle into your content. Google Autocomplete is one of the fastest and easiest ways to uncover related terms to sprinkle into your content. For example, I published this post about SEO audits: And to optimize that page, I typed “SEO Audit” into Google. And paid attention to the bold words that it suggested to me. These bold words are related keywords. After all, they’re terms that human users search for when they search for anything related to “SEO Audit”. So I included those terms in my content: You could also use Semrush’s Keyword Magic Tool to get even more ideas. Note: A free Semrush account gives you 10 searches in this tool per day. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. Tools like this can give you A LOT more suggested keywords than doing things the old-fashioned way. That said, Google tends to suggest the most popular (and therefore most relevant) terms right off the bat. So I usually only use these tools if I want to optimize my content to the max. Related Searches “Related Searches” is similar to Google Autocomplete. But instead of Google suggesting keywords as you search, they give you related terms at the bottom of the search results. For example, this list of SEO tools is one of my high-priority pages: And considering how insanely competitive this keyword is, I know that I need to nail my LSI… or I have little to no chance of rankings. That’s why I searched for “SEO Tools” and scrolled down to the bottom of the page. Then, I identified bold terms that made sense for my post. And included those in my content: Simple, yet effective. Bold Terms in Google Snippet Descriptions This is another way to find related words and phrases directly from Google. You might have noticed that Google bolds terms in meta descriptions and featured snippets that match your keyword: And if you look closely, you’ll notice something else: Google doesn’t ONLY bold terms that exactly match what you just searched for. They also bold words and phrases that are similar. For example, let’s look at the results when you search for “PC Repair”: Yes, Google bolds the exact term: But they also bold related terms, like “Computer Repair” and “PC Fix”: Needless to say, these are keywords that you want to sprinkle into your content. Google Keyword Planner The Google Keyword Planner is still one of my favorite keyword research tools. As it turns out, the Google Keyword Planner is also helpful for finding terms that are related to your target keyword. For example, if you put “SEO Tools” into the GKP, you get a list of “Keyword ideas”: Some of these will be synonyms and variations of your keyword: But if you dig deep, you can find some sweet phrases that you’d be hard-pressed to get any other way: You don’t need to enter a keyword into the tool. You can also use a landing page. Specifically, you can use a competitor’s landing page that’s ranking above you in the search results. When you do, Google will scan the page and spit out keywords that they consider relevant to that page’s topic. Google Image Tags This is a feature inside Google Images that I don’t see a lot of people talk about. And it’s a goldmine for discovering related terms. To use it, just pop your keyword into Google Images. And Google will hook you up with a bunch of related terms above the image results: How to Use Latent Semantic Indexing Keywords Now that you have a list of related terms (“LSI Keywords”), how do you use them? I’ve tested this quite a bit. And my takeaway is: it doesn’t really matter. In my experience, as long as Google sees these terms somewhere on your page, you’re good. So feel free to include related terms: In your title tag In image alt text As H2 or H3 subheaders In your H1 Throughout the content itself For example, I published this guide to learning SEO: And one of the “Related searches” keywords that I found was: “basics”. So I included that term in my content a few times: That’s all there is to it. That’s not to say that including this word a few times magically skyrocketed this page up the rankings. But including semantically related keywords in high-quality content should be a key part of your overall SEO strategy. Learn More about Semantics in SEO Semantic SEO: Everything you need to know about Google Hummingbird and Semantic SEO. Latent semantic analysis: Wikipedia entry dedicated to some of the technology behind LSI. Super dense but worth reading if you want to understand the “why” behind LSI keywords. SEO Writing: Learn how to write content that meets user intent while also being optimized for search engines like Google.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "LSI Keywords"
    },
    {
      "level": "H3",
      "text": "What are LSI Keywords?"
    },
    {
      "level": "H3",
      "text": "Does Google Use LSI in Their Algorithm?"
    },
    {
      "level": "H3",
      "text": "Why are Related Words and Phrases On a Page Important?"
    },
    {
      "level": "H3",
      "text": "How to Find LSI Keywords"
    },
    {
      "level": "H4",
      "text": "Google Autocomplete"
    },
    {
      "level": "H4",
      "text": "Related Searches"
    },
    {
      "level": "H4",
      "text": "Bold Terms in Google Snippet Descriptions"
    },
    {
      "level": "H4",
      "text": "Google Keyword Planner"
    },
    {
      "level": "H4",
      "text": "Google Image Tags"
    },
    {
      "level": "H3",
      "text": "How to Use Latent Semantic Indexing Keywords"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}