{
  "url": "https://backlinko.com/hub/seo/resource-pages",
  "slug": "resource-pages",
  "title": "Resource Page Link Building",
  "description": "Learn how to use resource page link building to get backlinks from authority websites in your industry.",
  "content": "Resource Page Link BuildingWritten by Brian DeanLast updated Feb. 28, 2022What Is Resource Page Link Building? Resource page link building is the practice of building backlinks from pages that have curated lists of links to external websites (resource pages). Why Does Resource Page Link Building Work So Well? It’s simple: When someone adds your link to their resource page, your link makes their page better. That’s because resource pages are designed to link to awesome content on other websites. Here’s an example: So if you have a resource that’s a good fit for a resource page, you don’t need to twist anyone’s arm to get a link. (As you’ll see in a minute, a simple outreach email usually does the trick.) In fact, some resource pages even have a “Suggest a resource” link: These pages are literally ASKING you to pitch them. Which makes your conversion rate super high. In fact, this strategy works so well that it’s become my go-to link building strategy in 2020. As you can see from this reply, it works GREAT: I’m not alone… Search Engine Land found that building links from resource pages was the 2nd most popular link building strategy among SEO professionals: With that, here’s how to get backlinks with resource page link building: Best Practices Find Resource Pages With Search Strings Your first step is to find resource pages in your industry. Fortunately, most resource pages use the same terms… which makes them easy to find using search strings. For example, check out this resource page: As you can see, they call their page a “links” page. Well, “links” is a word you’ll find in LOTS of resource page titles. So when you search for your keyword and “links”, you can find dozens of resource pages in seconds. With that, here are a handful of search strings you can use to find resource pages: Keyword inurl:resources Keyword “best resources” Keyword” useful resources” Keyword intitle:links Keyword “helpful links” For example, I happen to run an SEO blog. So when I need to get links to my site, I usually use “SEO” as my keyword in these resource page search strings. Then, I sift through the search results to find pages that are actually resource pages: And I usually come across lots of high-quality resource pages, like this one: Simple. Uncover Different Types of Resource Pages There are lots of “resource pages” that aren’t your typical list of links. Yes, they curate content just like a normal resource page. But they don’t use terms like “resources” on their page. This means they DON’T show up with the search strings I just showed you. For example, I actually published a guide to learning SEO some time ago. My guide is basically a resource page. After all, it’s a list of hand-curated resources organized by topic: But you’d never find it with a search string like: keyword + “helpful links”. So to increase your link opportunities, use these search strings to find non-obvious resource pages: Keyword “best sites” Keyword “best blogs” Keyword “blog awards” Keyword “places to learn” For example, let’s say you run a site in the coding niche. Well, when you search for PHP “places to learn” Google will hook you up with a ton of link opportunities from non-traditional resource pages, like this: Reverse Engineer Your Competitor’s Resource Page Links This is a black belt link building strategy that I recently discovered. Here’s how it works: First, pop a competing website into Semrush. And look at their backlinks: Then, search for terms that resource pages use (like “resources”). And Semrush will show you their links that came from pages that used that term somewhere on the page. Like this one: And because they link to your competitor there’s a GREAT chance they’ll link to you too. Look for Broken Links Let’s say you find a resource page in your niche. And you have the PERFECT content for that page. Well, you could email the person that runs that resource page and ask for a link. (Which does work.) OR you could add one simple step and 2-10x your conversion rate. What’s the simple step? Look for broken links on that resource page BEFORE reaching out. (Also known as Broken Link Building.) For example, a while back I wanted to get a link from this page: Well, I could have just asked for a link. But I decided to scan the page for broken links first. I also sent that person that runs the page a list of all of their dead links. And because I was super helpful, they happily added my link to their resource page. Don’t Forget “Mini Resource Pages” “Mini Resource Pages” are links to external resources that are embedded in a blog post or article. For example, check out this post about Pinterest. This page isn’t 100% dedicated to linking out like a normal resource page. But it DOES have a section dedicated specifically to helpful content on other websites: The downside of this approach is that Mini Resource Pages are tricky to find. Unlike normal resource pages, there aren’t any terms that tie them all together. That said, you can sometimes uncover a few of Mini Resource pages with this search strings: Keyword “learn more” Keyword “other resources” Keyword “learn online” Focus On Realistic Targets This is a big time saver. The vast majority of resource pages happily link out to any site that’s worth linking to. But that’s not always the case. For example, this resource page ONLY links to .edu and .gov sites: Are they likely to make an exception for your site? Probably not. So you’re better off moving onto the next site on your list. You’ll probably also come across resource pages that only link to their own stuff: Again, resource pages like this aren’t worth your time. As soon as you see that a page isn’t likely to link to you, I recommend deleting it from your prospects so you can focus on more realistic targets. Use a Mix of Broad and Specific Searches That way, you can find lots of resource pages that might want to add your link. For example, let’s say you run a Paleo diet blog. Search strings like “Paleo” inurl:links will bring up a decent chunk of pages: But don’t stop there. You also want to mix in some BROAD keywords (like “nutrition”, “health” and “fitness”) that also describe your content: That way, you cast a wide net. Email The Person That Manages The Page This is a biggie. Whenever someone tells me: “I emailed a site but never heard back” I always ask WHO they emailed. It makes a big difference. For example, check out this resource page on the Rutgers University website: Well, if you want someone to add your link to that page, you need to contact the right person. Specifically, the person that runs and manages that page. In this case, there’s no “Submit resource” link. So you need to do some digging. Voila! I went to the site’s directory page, and found that department’s “Business Librarian/Information Literacy Coordinator”. That’s the person you want to get in touch with. Otherwise, if you send your message through the dreaded contact form, you’re toast. Make It Easy to Add Your Link Don’t make the person think about where your link makes sense on their page. Instead, give them a specific area of the page where your link should go. For example, take a look at this resource page. Well, my site would be perfect for this section of the page: To be clear: not every resource page is broken up into little sections like this one. But if you do see a section where your link would be a slam dunk addition, don’t be afraid to point that out. Personalize Your Outreach Emails The more you personalize your outreach emails, the better your conversion rate will be. And this DEFINITELY applies to resource page link building. For example, here’s an outreach email I sent a while ago: See how personalized that is? That’s one of the reasons that I got a link. That said: Even though I always send super personalized outreach emails, I usually start with a template. And I make that template as personal as I possibly can. With that, here are two resource page link building templates that you can start with: Template #1: Standard Resource Page Subject: Quick question Hi [First Name], I was looking for some information on [Topic] today, when I came across your excellent [Name of Page]. It was super helpful! Thank you. I especially liked [Personalized Sentence or two]. Anyway, I realized that I recently published a page about [Related Topic]: [URL]. It’s [Brief Description]. It might make a nice addition under the [Section Name] of your page. Anyway, thanks again for all of the excellent resources. And have an awesome week! Talk Soon, [Your Name] Template #2: Resource Page With Broken Link Subject: Found a broken link Hi [First Name], I wanted to let you know that I found a few broken links on your [Resource Page Title]. [URL #1] [URL #2] [URL #3] Your page was super helpful for me when I was recently learning about [Topic], so I wanted to return the favor. Also, I wanted to let you know that I published a piece of content that might make a nice replacement for [URL]. Here’s the link: [URL] Either way, I hope this helps and keep up the awesome work! Talk Soon, [Your Name] Learn More Blogger Outreach: The Definitive Guide: A super detailed guide to blogger outreach with a TON of real life examples and tips from the trenches. Link Building: How to Get Powerful Backlinks: Resource pages are just one of many places that I get backlinks from. Learn about 7 other proven strategies in this video.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Resource Page Link Building"
    },
    {
      "level": "H3",
      "text": "What Is Resource Page Link Building?"
    },
    {
      "level": "H3",
      "text": "Why Does Resource Page Link Building Work So Well?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}