{
  "url": "https://backlinko.com/hub/seo/semrush",
  "slug": "semrush",
  "title": "Semrush: The Ultimate Guide",
  "description": "Learn how to maximize the popular keyword research tool, Semrush. Includes a ton of actual examples, illustrations, and “Pro Tips”.",
  "content": "Semrush Ultimate GuideWritten by Brian DeanLast updated Oct. 14, 2024Semrush is a popular SEO tool suite that specializes in keyword research, competitor analysis, and Google Ad campaign optimization. But it is MUCH more than that: Semrush is software that can help you formulate, maintain, and improve your digital marketing campaigns. Through its 55+ tools and reports, Semrush keeps your domain in check and fighting fit to reach the top of the search engine results pages (SERPs). This guide covers all of Semrush’s key features and functions. For my personal insights and final thoughts on Semrush, check out my detailed Semrush Review. I also highly recommend this super comprehensive analysis of Semrush on TrafficThinkTank.com for another expert perspective. What Is Semrush? Semrush can be used for everything in the realm of SEO and digital marketing. From identifying target keywords and analyzing your competitor’s backlink profile to monitoring your social media presence, Semrush does it all. Semrush should not be viewed as a singular tool. The software boasts a range of toolkits, each of which contains unique features that can be used to tweak, monitor, and improve your SEO campaign. The most popular is the SEO toolkit. Other toolkits include: Pay-per-click (PPC) advertising Social media marketing Content marketing Management Agency growth Sound like a lot? Well, it is. To help you out, I’ve devised this ultimate guide to bring clarity to the many facets of Semrush’s various tools. Along the way, I’ll show you how you can use this tool to improve your domain visibility. And explain how to use Semrush to perform keyword research, conduct site audits, compare your domain to your competitors, and more. Backlinko & Semrush Special Offer: 14-Day PRO Trial With Semrush, you get to analyze data, track rankings, and uncover valuable insights that can help you tailor your content and strategies more effectively. Sign Up Now A Quick Note on This Guide I’ve structured this guide to broadly follow the order in which you’ll find the tools in the left-hand navigation within your Semrush dashboard. This should make it easier to follow along with each tool’s features. But note that some tools are available in multiple places. Like Traffic Analytics, which is available in the Competitive Research section AND in the .Trends toolkit. I’ll discuss them in each case where I think they make the most sense. Also: Many of the tools I discuss below are available for free or included in your Semrush subscription. But some (primarily the apps and those in the .Trends toolkit) may carry their own subscriptions. But they typically offer free trials. Let’s get into it! SEO Dashboard The SEO Dashboard breaks down all the features of the SEO Toolkit into one neat control desk. You can use it to get a brief overview of your website’s online presence. The top banner is dedicated to Domain Analytics. Here, you can: Review your site’s current authority score Check how much organic traffic is coming to your site View how many organic and paid keywords your site is ranking for Keep track of your referring domains and backlinks Other sections of the SEO Dashboard include: Position Tracking Site Audit On-Page SEO Checker Backlink Audit Traffic Analytics To put it simply—the SEO Dashboard allows you to view key metrics quickly. You can access the individual sections by clicking on any of the widgets for a deeper dive. When you create a Semrush project, you’ll also see Copilot AI on your project dashboard. It provides recommendations and insight based on AI analysis of six Semrush tools at a time. Pretty cool. Competitive Research Semrush offers various competitive research tools to help you: Find competitors Track their performance Identify opportunities to beat them in search results Get ideas for link building Let’s take a closer look at what you can do each of these tools: Domain Overview When it comes to competitive analysis, few tools give you a head start quite like Domain Overview. This feature provides you with a full breakdown of how a domain is performing. By identifying your site’s strengths and weaknesses compared to your competitors, you’ll gain insights into what you need to do to outperform them. The Overview report provides a thorough breakdown of a domain’s authority score, organic and paid search traffic, and backlinks. (Like you saw for your own site on your Dashboard.) Clicking on one of these widgets, such as “Backlinks,” will take you to a more in-depth analysis in a corresponding tool (like Backlink Analytics). Further down the page, there are a ton of other useful insights you can find, like: Organic and paid traffic distribution by country, and changes in this over time Top paid and organic keywords and organic position distribution Keywords by intent Your main competitors (organic and paid) Referring domains Indexed pages Branded traffic trends Backlinks, including information on the type (text, image, etc) and nofollow vs dofollow And even competitive positioning maps for both paid and organic competitors. Jumping to the Compare domains tab, you can size your domain up against up to four of your top competitors. The Growth report lets you see changes in a domain’s paid traffic, organic traffic, keywords, and backlink profile over a specific period. Finally, the Compare by countries tab lets you compare up to five countries at a time. Giving you an insight into how well your website is doing in each location. Pretty neat, right? With a free account, you can run 10 Domain Overview searches per day. With a Guru account, you can run 5,000. Reveal any company’s website traffic Spy on your competitors’, prospects’, and potential partners’ website traffic. Get insights Traffic Analytics Traffic Analytics gives you data on a site’s overall website traffic. As in, not just estimated traffic from Google. So you can see where else a site receives traffic from. And how much. When you first analyze a site with Traffic Analytics, you get an estimate of that site’s overall traffic numbers: You also get to see how people interact with the site. For example, you can see a site’s average page views per visit, session duration, and bounce rate. There’s also a chart so you can see how these metrics have changed over time: But the real meat and potatoes of this feature is the Traffic Journey tab. Here, you’ll see a breakdown of any site’s traffic sources: And a list of the exact sites that send your website the most traffic: For example, you can see that I get a decent chunk of traffic from perplexity.ai: You can also see which social media platforms send your competitors the most traffic: This makes it a great way to reverse engineer what’s already working for your competitors. And use these insights to improve your own digital marketing strategy. Note: Traffic Analytics is part of the .Trends toolkit, which I’ll discuss more later. Organic Research The “Organic Research” feature put Semrush on the map. And it still works GREAT. Here’s how to use it: On the Overview tab, you’ll see lots of useful metrics about the website you enter into the tool, including: How many keywords they rank for An estimate of their monthly traffic How much that traffic would cost if they used paid ads to get it instead of organic search How much branded and non-branded traffic they get On the Positions tab, you’ll see all the keywords a domain ranks for (and where they rank). This is SUPER helpful for keyword research. Instead of mining for gold in the Google Keyword Planner or using autocomplete, you get a list of relevant keywords presented to you on a silver platter After all, if your competitor ranks for these keywords, so can you. At least, with a solid SEO strategy. By default, Semrush shows you how much traffic was driven to the website via the chosen keyword for the chosen time period. And all the keywords for which the site ranks in the top 100. But with the positions filter, you can narrow this down to those ranking #1, in the top 3, top 10, and more: You can also tweak the volume filter to only show keywords within a certain search volume range. The keyword difficulty (KD) filter helps you figure out how challenging ranking for target keywords will be. The higher the KD score, the more difficult it is to rank for the keyword. So, if you don’t have much authority yet, you might want to sort by keywords that will be easy or very easy to rank for. You can also filter by the four main types of search intent: Informational: Search queries composed to find specific information or answer a question. For example, “how to make apple sauce.” Navigational: Queries with a much more specific destination in mind. Like “Facebook login,” “YouTube,” or “Backlinko newsletter signup page.” Commercial: Searchers making these queries are looking for information to buy the best product or service to fit their needs. For example, “best laptop for traveling.” Transactional: These searches are made by people who know what they want to do or buy. They want to “buy an iPhone 15” or “sign up for Semrush Pro.” Other filtering options include filtering by SERP features (like local packs and video carousels). And you can also filter for specific keywords—super handy for omitting keywords that contain your competitor’s brand name (which you’re unlikely to rank for). In short: The Positions tab is where I usually start the keyword research process. Unlike many other keyword research tools, this feature gives me a list of terms that I can easily rank for (by filtering the terms by keyword difficulty and using advanced filters to find more relevant terms). Start your keyword research Explore the largest keyword database. Analyze Keyword Gap The Keyword Gap tool shows you a list of keywords that up to four of your competitors rank for. When you find a keyword that multiple competitors rank for, you know that it’s one you have a good shot at ranking for too. Pro Tip: By default, this tool shows you keywords that your competitors rank for in the top 100. Obviously, if two competitors rank between positions 40-50 for the same keywords, this isn’t super helpful because you want to rank in the top 10. That’s why I set up the Position filter to ONLY see keywords that both sites rank in the top 10 for: And that simple filter gives me a much more helpful list of keywords to work with: Still got a lot of keywords even after applying the Position filter? Kick your keyword research up a notch by applying the volume, KD, and advanced filters to narrow your options even further. Backlink Gap Want to know which domains to target for backlinks? Backlink Gap allows you to compare four competitors’ backlink profiles simultaneously. So you can find opportunities to get links to your own site. Just enter your domain and up to four competitors (like the Keyword Gap tool above). You’ll then see a list of all the websites pointing at the domains you entered. These are naturally organized in order of how many of the target sites have a link from that domain. Sites that are linking to more than one of your competitors are decent candidates for your own link building campaigns. Because if a site links to four of your competitors, there’s a high chance they might link to your site as well. Pro tip: When comparing the linking domains, be sure to take into account their Authority Score (AS) and monthly visits. Higher is typically better in both cases. Keyword Research Next up, we have Semrush’s range of keyword research tools. Semrush’s keyword database contains more than 25 billion search terms. And this database powers the suite of helpful tools to help you find opportunities, put a strategy in place, and monitor your results. Keyword Overview So far I’ve covered features that revolve around reverse engineering a competitor’s website. There’s a good reason for that: reverse engineering is Semrush’s specialty. And it’s excellent at it. That said, you can also use Semrush like a traditional keyword overview tool. In other words: You can pop a target keyword (or list of up to 100 keywords) into the Keyword Overview tool and get a list of keyword ideas and metrics for each one. Pro tip: Also enter your domain for personalized results. For example, here’s what I get when I put “backlinks” into Semrush: But what do these metrics all mean? Well, let me break it all down for you: Volume shows the estimated monthly search volume of the keyword in a specified country Global volume is the total number of times the keyword is featured in search queries across the globe (again, as an estimate). Keyword difficulty is an estimate of how easily you could rank for the keyword (you’ll get a personalized one if you entered your domain along with the keywords) Topical authority (personalized) indicates how aligned the keyword is with your domain overall Intent tells you what kind of searches the keyword features in (i.e., informational, commercial, navigational, and transactional) CPC (cost per click) reveals how much it would cost for a PPC ad targeting this keyword Com. Density shows you how much competition there is between advertisers who are bidding for this particular keyword Because I entered my domain (backlinko.com), the tool also shows some personalized metrics. Like Personal Keyword Difficulty and even my potential position in search results if I were to target this term. Spoiler: I do target this term. And I do rank in the top 10 (twice). If you scroll down, you’ll also see some keyword ideas. Covering variations of the target term and related questions. And even the option to start building a keyword strategy (more on that soon). Below that is a SERP analysis, displaying key metrics for the pages ranking for the target term (like Authority Score, backlinks, and search traffic): Towards the bottom, you’ll find even more data about that keyword from a PPC ad perspective. Including Product Listing Ad (PLA) copies (if relevant), standard ad copies, and a history of bidding activity for that term. So you can use the Keyword Overview tool for both SEO and PPC campaigns. Keyword Magic Tool This Semrush feature does one simple thing: It generates A LOT of keyword ideas. For example, when I put “digital marketing” into it… …I get a massive list of 195K related keywords: But: 195K is a lot of keywords to sift through yourself. Fortunately, you can sort this keyword list by search volume, keyword difficulty, CPC, and more. First, you can sort by match type. By default, you’ll see “Broad Match” keywords. Essentially: all the keywords Semrush found that are related to your seed keyword. For example, searching for “best running shoes for men” with this option selected could bring results like “best trail running shoes for men.” You can narrow things down by switching to: Phrase Match: To see keywords containing the exact keyword or phrase in various orders Exact Match: To only see terms containing the exact keyword or phrase in that exact order Related: To see a list of keywords that are similar to the one you entered All Keywords: To see all of the above Another super useful filter (especially for blogs) is the option to switch to question keywords: This is great for finding long tail keywords with low competition. Super cool. But another reason the Keyword Magic Tool is so useful is that it allows you to explore different keyword groups and subgroups related to your primary keyword. You can find these keyword groups in the menu to the left of the main table. And you can organize them by number or volume. By clicking on one of the groups, you can examine suggested topic clusters related to the main keyword. For example, when searching for “Paleo Diet,” one of the main topics that Semrush identifies is “Weight.” This then shows you all the relevant subtopics of “Paleo Diet” and “Weight.” This is great for building topic clusters. Which is a useful way to boost your site’s authority. Speaking of topic clusters… Keyword Strategy Builder The Keyword Strategy Builder (previously Keyword Manager) is an advanced tool that helps you stay on top of your keywords. And seamlessly turn your keyword research into topic research. Making it easy to put together content ideas that can bring you more traffic. You simply enter your target keywords into the tool and it’ll create a map of pillar pages and cluster pages. So you can create authoritative content for your website covering your core topics. Pro tip: You can also add keywords to lists through other tools in the Semrush suite, like Keyword Magic Tool, Keyword Overview, and Organic Research. Scroll down to see a list of pillar pages and cluster pages along with key metrics for each one. Like intent, keyword difficulty, and search volume. Making it super easy to prioritize your content planning. Switch to the table view to see a list of all the keywords the Strategy Builder found. Again, you’ll see metrics like intent, volume, cost per click, and more. The Keyword Strategy Builder can therefore save you A LOT of time when it comes to planning new content. Start your keyword research Explore the largest keyword database. Analyze Position Tracking This is Semrush’s built-in rank-tracking tool. You can use it to find out how your website is ranking for specific keywords geographically and on what devices. The main statistics the Position Tracking report provides are visibility, estimated traffic, and average position. You can also use it to track your local SEO efforts and create featured snippet reports. It’s a super handy way to keep track of where you rank for important keywords. And the tool will show you position changes over time. This makes it easy to update pages that have seen significant drops. And capitalize on areas where you’ve made big gains. Organic Traffic Insights Finally, we have Organic Traffic Insights. This tool pulls together organic search traffic data from Google Search Console, Google Analytics, and Semrush. The Organic Traffic dashboard then displays your top 50 landing pages organized by session count. This is pretty cool in itself, but that’s not all this tool provides you with. With Organic Traffic Insights, you gain valuable pre-click data, such as where you rank and how many impressions you get. You also gain insightful post-click data, such as goal completion on landing pages and bounce rate—pretty neat! Importantly, you also get to see which keywords your pages rank for. Both those tracked by Google Search Console (GSC): And those that Semrush finds you ranking for: Helping you uncover keywords marked “not provided” in Google Analytics. So you get a full picture of how your content is performing. And which terms are driving you traffic. Link Building Semrush’s link building features let you analyze a site’s backlink profile, anchor text usage, dofollow vs. nofollow links, overall link authority, and more. Let’s take a look at how Semrush’s tools can help with your next link building campaign. Backlink Analytics When you paste a domain into Backlink Analytics, you receive a full breakdown of the site’s backlink profile. The Overview tab provides you with mini-reports. This is really helpful if you’re in a rush. The reports allow you to assess the site’s overall backlink profile and also identify broken links. You can use the Backlinks tab to get a full list of all the links pointing to that domain: And the Referring Domains tab shows a similar report. This time listing all the unique websites linking to the target domain. This makes it a powerful tool for understanding your competitors’ backlink profiles. And to potentially find link building opportunities for your own site. Find all of your backlinks Explore the largest, fastest, and freshest backlink management tool. Analyze Backlink Audit Link-building campaigns can appear spammy if they aren’t done properly. That’s why I love using Semrush’s Backlink Audit tool to monitor new backlinks pointing to my site. You can make sure your backlink profile appears natural (i.e., the opposite of spammy) by disavowing toxic links as and when you attain them. Put your domain into this tool and get an in-depth report on all the links that lead to your site—the good, the bad, and the downright toxic. Your eyes will probably land on the “Overall Toxicity Score” first—and for good reason. This bar scores the healthiness of your domain in terms of backlinks. It breaks down this score into three sections: non-toxic, potentially toxic, and toxic. Ideally, you should have the “non-toxic” percentage in the high 90s and the “toxic” bar at 0%. If you see any number indicating toxic backlinks, click on it to get a breakdown of the suspicious domains. If you think the link is toxic, you can select it and click the “Disavow” button. You can download this list as a .txt file which you can then submit to Google Search Console. Important: Tread carefully with disavow files. They’re not usually needed, as Google can often spot toxic links and ignore them. If you use Google’s disavow tool incorrectly, it can harm your site’s performance. Link Building Tool Semrush’s link-building tool is a streamlined service that helps you find and engage with external sites for potential link-building opportunities. Using data gathered from the target keywords and competitors you enter, the tool seeks out authoritative sites that could provide you with a backlink. Here’s how it works: First, you enter keywords that you want to rank for: Next, add your competitors’ websites: It then analyzes your competitors’ backlink profiles to determine the kind of backlinks you need to compete. Then it collates all the link building opportunities it deems suitable for your website. You’ll see an overview of the data, but you can head to the Prospects tab to see more detail. Any backlink opportunities you like the look of, you can add to the “In progress” list. You can connect with these backlink opportunities through the outreach module. Here, you can use the message templates to construct an effective message addressed to the target domain’s owner. Finally, it helps you keep track of the backlinks you get. Once you’ve acquired some backlinks, you can monitor them to ensure they stay live. Bulk Analysis Ever wondered how all of your competitors size up to one another in terms of backlinks? Well, the Bulk Analysis tool lets you compare a whopping 200 URLs at one time. Once you’ve entered the URLs, the tool will compile a table detailing the exact number of backlinks each domain has. Along with key metrics like the split between follow and nofollow, how many of them are text links vs. image links, and more. Other available metrics include the number of referring IPs and the number of links acquired from educational, governmental, .com, .net, and .org sites. This lets you check your competitors’ backlinks. Then, you can see how many more links you need to catch up. On Page & Tech SEO You can use the On Page and Technical SEO tools to give your website a health check. It has tools to audit and analyze your website’s accessibility, crawlability, and more. Below, I take a closer look at how you can use these tools to boost your website’s performance. Note: You’ll also find the Listing Management and SEO Content Template tools in this part of the suite. But I’ll discuss them in the local SEO and content marketing sections of this guide, respectively.) Site Audit SEO site audits should be a regular part of your digital marketing strategy. And Semrush’s Site Audit tool makes this super easy to do. And you can even automate it. Use it to identify serious errors that can impact your on-page and technical SEO. What’s really cool about the Site Audit tool is that you can compare crawls to understand how your site’s health is changing over time. But my favorite part of Semrush’s SEO audits is that they run automatically. You don’t need to remember to run an audit every month. The tool does it for you. So you can stay on top of technical issues that could be harming your site’s performance. On Page SEO Checker The On Page SEO Checker analyzes your content for traditional on-page SEO opportunities (like optimizing your title tags and H1 tags). But it also lets you know about semantically-related terms that you should include in your content. And sites that you should try to get backlinks from. It works as a checklist of things you can do to improve your overall SEO strategy. Log File Analyzer Semrush’s Log File Analyzer determines how Google’s crawler interacts with your website. For a new webpage to get indexed and start ranking, Googlebot first needs to crawl it. When crawling a domain, search engines have a limited “crawl budget” to spend. The Log File Analyzer can show you how search engine bots (like Googlebot) are spending this crawl budget. It highlights your most crawled webpages and how bot activity differs on the desktop and mobile versions of your site. There are many ways to make the best use of your site’s crawl budget. You can improve your website’s architecture, improve site speed, and strategically use internal links. But how do you know where to begin? The Log File Analyzer can help you identify the weakest parts of your website structure. It highlights navigational issues that are preventing Google from finding and crawling your important pages. To use the Log File Analyzer, you need to get the log file for your domain. You can get your log files using an FTP client. You’ll find them in your /access_log or /logs folder. Pro tip: Ensure that this file is in the access.log file format and is unarchived. You also need to make sure that your log file size is below 1 GB, as the Analyzer won’t accept anything bigger than this. Once uploaded, you can review Googlebot activity on your pages over a chosen period of days. And you can see data like how many hits each page receives, crawl frequency, and when the page was last crawled. This will allow you to identify site errors and find the pages that aren’t getting much attention from Googlebot. You can then update your pages or fix site errors to improve your crawlability—and potentially your site’s performance. Local SEO Semrush’s Local SEO toolkit offers a few different ways to optimize your local SEO presence. From Google Business Profile optimization to local rank tracking. These allow you to effectively manage your online business reputation on a local level. Let’s take a closer look. GBP Optimization Your Google Business Profile (GBP) is one of the most important aspects of your overall local SEO strategy. And there are many ways to optimize your profile to boost your visibility. Semrush’s GBP optimization tool makes it a breeze. Here’s how: Just connect your GBP to your Semrush account. Filling out some basic information about your business. And you’ll then get access to useful insights about your profile: But the next tool is where Semrush’s local SEO toolkit really comes in handy. Listing Management Listing Management helps establish and maintain your local listings. If you’re yet to submit your business data to directories, Listing Management can do it for you. Through it, you can register your business with over 70 directories in the US and 40+ international ones. This includes major platforms like Amazon Alexa, Google, Bing, and Apple. By editing your business data in one place, you avoid discrepancies in NAP data (Name, Address, and Phone number) that are common when submitting data to multiple directories. It also makes updating and editing your listings easy as your business grows and expands to new locations. Streamlining your local SEO efforts. On top of that, the tool provides an easy way to monitor your existing listings. So you can quickly and easily see which directories you’re listed in. And if any have any issues you need to fix. The ultimate local business toolkit Listings, data, and AI-powered reviews — all in one platform. Start now Map Rank Tracker The Map Rank Tracker is Semrush’s powerful tool for understanding how you’re currently performing in local search results. It shows you a heatmap of your current rankings for target keywords in a certain area. So you can quickly understand how your site ranks down to the street level. And compare it to previous scans to see where you’ve lost and gained rankings. You can also select one of your competitors to see how their rankings have changed over time. And you can head to the Competitors tab for a quick share of voice comparison with your top rivals in the area. The Map Rank Tracker is ideal if you’re a local business that wants to monitor the results of your local SEO campaigns. Review Management Finally, the Review Management tool collects all of your business directory reviews. So you can assess and manage your online reputation. First, there’s a graph to show your overall star rating: Then, you can read and respond to all the reviews—without leaving the tool. PPC Advertising Semrush’s Advertising Toolkit can help get your Google Ads campaign up and running. Or it can help you optimize your existing campaigns for better results. Let’s take a closer look at the key paid ads tools on offer: Advertising Research Many people use Semrush strictly for SEO campaigns. But it’s actually a REALLY good PPC tool. Specifically, with the Advertising Research tool, you can see which keywords your competition bids on most often: In this case, you can see that Nike bids on a ton of branded terms. But they also bid on targeted non-branded queries. Even better, you can see the exact ads that they’re running on those terms: And if you find an ad that’s been running for months or years, you KNOW that it’s probably driving results for that competitor. So you can gain insights from these successful ads to use in your own Google Ads campaigns. You can also get an estimate of how much your competition spends to run ads. Based on CPC data from Google Ads itself. You can even get an idea of how these bidding habits change throughout the year, using the Ads History section. This could help you time your own campaign to take advantage of months when the competition promotes their product less. Combine that with the Position Changes report, which shows you how the domain’s ad positions have improved or declined over time. In the Competitors tab, you’ll find the Competitive Positioning Map. This captures the spending habits of all the leading sites in your niche, which gives you a clear idea of how to budget your own PPC campaigns. On the Ads Copies tab, you can review the competitor’s ads that are currently live. With this data, you can learn how to word and structure your own PPC campaigns. AdClarity The Semrush AdClarity app is part of the App Center (which I’ll discuss in more detail later on). With the AdClarity app, you can get useful insights into competitor ad campaigns. Across multiple platforms—not just Google. You’ll get an overview of the competitor’s ad spend and where they’re spending it: Then you’ll see the ad creatives they use. Along with key metrics for each one, like spend, and the number of impressions it received: You can even see a breakdown of their individual campaigns, how long they ran each one for, and how much they spent: Making AdClarity an incredibly powerful competitive analysis tool for a wide range of campaigns. PLA Research Before you launch a Google Shopping ad campaign, you can gain a sneak peek of your competitors’ SEO efforts via the PLA Research tool. The PLA (Product Listing Ad) tool analyzes a domain’s Google Shopping ads. This tool will gather data on target keywords used, and shopping ad positioning: And even their product prices: It condenses this helpful data into an easily digestible report. Helping you better strategize your own Google Shopping ad campaigns. Ads History Ads History allows you to review your competitors’ advertising campaigns based on a specific keyword. Once you enter the keyword that will serve as the basis of your ad campaign, you can view other domains that have used this keyword in their own ads. You can also review how much traffic each competitor pulls in from these ads, how much it costs, and how they ranked over the past 12 months. Why is this useful for your own Google Ads campaign? Because analyzing past ads can help you ace your own campaigns. Study high-traffic campaigns for keyword inspiration, timing insights, and copy structure tips. And then use low-traffic campaigns to learn what you should avoid. Ads Launch Assistant The Ads Launch Assistant is another Semrush app that can help you get more out of your Google Ads campaigns. It’ll provide keyword suggestions based on your URL, language, and location: And it’ll even use AI to help you generate high-converting copy: Once your campaign is live, you can monitor its results within the app through a simple visual report: Social Media Semrush’s Social Media Toolkit offers a range of special features designed specifically to audit and help improve your business’s social media presence. It provides all the tools to schedule posts, analyze performance, and monitor your messages. The Social Dashboard gives you a quick overview of your social media statistics. Once you connect all your social media accounts, you’ll be able to check your total audience and engagement levels. But here’s everything else the Social Toolkit includes: Social Poster Maintaining a social media presence can be difficult. If you’re a small business and don’t have a dedicated social media manager, it’s easy to forget to update your various accounts regularly. Social Poster ensures you never miss a beat with its scheduling calendar, which allows you to schedule posts weeks in advance. Once posted, you can monitor individual post performance using Social Poster’s analytical data. You can do this for accounts including: Instagram Facebook TikTok LinkedIn X (Twitter) Google Business Profile Pinterest You can use the Social Poster to deliver posts at specified times to catch your target audience (more on that shortly). Social Tracker Social Tracker is Semrush’s social media competitor analysis tool. It also works well as a performance indicator, mapping the success of your social media posts and engagement levels. The main aim of the Social Tracker is to identify what’s working for your social media channels. And where you need to improve. Social Tracker is compatible with: Facebook X (Twitter) Instagram YouTube LinkedIn Pinterest Social Tracker allows you to take a cohesive look at your niche. Not only does it show you the performance level of your own social media posts, but it also details your competitors’ success. Social Tracker shows you what, when, and how often your competitors are posting. So you can understand what’s working for them and use that to guide your own strategy. Social Content Insights Semrush’s Social Content Insights tool makes it simple and digestible to monitor and analyze social media content. Helping you keep track of key engagement metrics across multiple platforms, including Facebook, Instagram, X (Twitter), and LinkedIn. The tool lets you tag individual posts too. So you can monitor different parts of your social presence with greater ease and accuracy. For example, you could tag all of your recipe posts across multiple platforms to understand how that content resonates with your audience compared to your cookware guides. By easily monitoring the posts’ performance over time and analyzing various engagement metrics. Social Analytics Social Analytics gives you a more in-depth look at your social media performance. The Overview tab lets you compare your Facebook, Instagram, LinkedIn, and TikTok audiences. This main section uses graphs to highlight new followers, post reach, post engagement, and engagement rate. There are also focus tabs for each of your social media accounts. Here, you can view a more in-depth breakdown of the performance level of each of your socials. You can review everything from link clicks to reactions here. You’ll also gain powerful insights about your audience, including when they’re online. This makes it easy to understand when the best times to post are. And you can use these insights to schedule posts with the Social Poster well in advance. Social Content AI Semrush’s Social Content AI tool offers an easy way to boost your social media presence with the power of artificial intelligence. The tool analyzes your website URL and/or brand description to provide you with 100+ new post ideas each day. All sorted by topic: You can generate social posts for platforms like Facebook, X (Twitter), and LinkedIn. And you can provide tone of voice—even the type of post you’d like to create. Once the tool generates a draft, you can regenerate, rephrase, shorten, or expand it to suit your specific brand’s needs. You can even add visuals. The Social Content AI tool allows time-limited business owners to maintain a consistent social posting schedule. Influencer Analytics The final component of Semrush’s social media toolkit is designed to help you find the right influencers to work with to grow your brand presence. Influencer Analytics is on the Semrush App Center, and it helps you understand who would be a good fit for your business. And how much it might cost to work with them. Choose the perfect match based on insights like audience size, cost, and engagement rate. And even get insights into the best days and times to post with that influencer. Plus, you can even track how your competitors are advertising through influencers. This data can be incredibly useful for forming lucrative influencer marketing strategies. Content Marketing Semrush’s Content Marketing Toolkit helps you overcome creative blocks. It lets you create content that is optimized for both users and search engines. Let’s take a closer look at the tools on offer: Topic Research When planning your content strategy, turn to the Topic Research tool for a succinct list of content ideas that will connect with your target audience. Enter a topic and pick your target location to receive a list of content ideas split into cards. You can organize content inspiration by difficulty, volume, and topic efficiency. You can also use the “Trending subtopics first” toggle to identify topical trends. Opening any of the cards will show you more subtopics. Organized by headlines, questions, and related searches. Use these topic ideas for inspiration for your own content creation campaigns. SEO Content Template The SEO Content Template is designed to help you write content that ranks well in Google. Just enter your target keywords. The tool will then create a content template for you, with tips to help it rank high in search results. Covering semantically related keywords, backlink suggestions, readability score, and recommended text length. Plus, it’ll also show you how your competitors are using your target keywords. Providing useful insights to ensure you create content that has the potential to compete with your rivals. SEO Writing Assistant The SEO Writing Assistant is a powerful tool for creating highly optimized content. You can paste content into the tool, provide a URL, or write directly in the tool’s interface. And it’ll provide real-time feedback on various key aspects of your content’s SEO and readability. It’ll also highlight how many keywords you’ve included, and whether there are any plagiarism issues. It even flags on-page SEO problems, such as alt attribute and link issues. Alternatively, you can attach the SEO Writing Assistant plugin to Google Docs, MS Word, or WordPress, which checks your work’s SEO quality as you type. Saving you valuable editing time in the long run. Brand Monitoring The Brand Monitoring app offers a simple way to keep track of your online reputation. And even find some backlinking opportunities too. Just enter your brand name as a query and the tool will return all the latest mentions of your business from across the web. This can be a great way to discover what people say about your business. Across platforms like X (Twitter), Facebook, websites and blogs, and forum discussions. This can be super useful for finding opportunities where other website owners are talking about your brand but not linking to your site. And you can reach out to them to try and get a valuable link. (If they’re already talking about your brand, this is likely to be easier than cold emailing.) You can narrow down your results by country, language, date range, and more. And you can even monitor keywords, competitors, or specific people. ContentShake AI ContentShake AI is a Semrush app that’s designed to make creating high-quality content as easy as possible. It helps you come up with engaging content ideas. And then it puts that content together for you, writing in your brand’s style. You can generate content from your own idea, or use the tool’s suggestions. To ensure the content matches your style, you can play around with settings like: Audience location Post title Target keywords Word count Brand voice Tone Readability level And if you need to make changes, you can hop into the editor and make use of the tool’s AI suggestions for titles, intros, and more. Or make manual changes, like adding your own images and expertise. Semrush .Trends Semrush .Trends helps you keep close tabs on your rivals. You can use this toolkit to monitor competitor website traffic and stay on top of the new content they post. And you can use it to get a better understanding of your market and target audience. Note: I already discussed Traffic Analytics earlier, but it’s part of the .Trends toolkit Let’s take a closer look: Market Explorer With Market Explorer, you can uncover insights about your target market. And discover who the key players are. You can also see what traffic share domains in your market have. Along with traffic trends and the distribution. In other words: where that traffic comes from. The Market Explorer tool also provides some insights into the demographics, socioeconomics, and behavior of your target audience. Including the social media platforms and websites they visit most often. EyeOn As its name implies, EyeOn lets you keep an “eye on” your closest competitors. Specifically, EyeOn will keep you updated on your rival’s latest posts and activity trends. This tool also monitors social media posts closely and will include data gathered from them in reports. Tracking your competitors’ activity on a regular basis can inform you of any major strategy changes. Which can, in turn, inform your own digital marketing strategies. For example, if you see that a competitor has added many new blog posts, you might want to check which keywords they’re targeting with a tool like Organic Research (which we discussed earlier). Or if they have posted lots of social media content, it might indicate that it’s a profitable marketing channel for your niche. One2Target Many Semrush tools can be used to analyze your demographics. But none get you as familiar with your audience as One2Target. It can determine the income bracket, level of education, household size, and even the employment status of your site’s users. To make it easy for you, One2Target’s statistics are broken down into four tabs: Demographics shows your audience’s age, sex, and location. Socioeconomics shows your audience’s household size, income level, employment status, and education level. Behavior tells you about your audience’s interests, the devices they use, and their most-visited social media platforms. Audience Overlap shows the other websites your target audience uses most often. When you cross-reference these four categories, you can determine the audience that’s statistically going to bring you the most business. And form your digital marketing strategies around that data. Agency Solutions The Agency Solutions feature aims to grow your agency—no matter if you’re just starting or already established. This add-on is ideal for agencies looking to gain new clients and retain existing ones. The tools include: Agency Partners Platform The Semrush Agency Partners Platform is a growing database of agency profiles. Here, businesses can easily explore the different agency profiles offering the services they need. And as an agency, you can create an eye-catching profile that details exactly what services you provide. Once you set up an Agency Partners Platform profile, there’s little else you have to do. Potential clients will reach out to you on this directory via the contact button. And you can manage your leads within the Semrush Customer Relationship Management (CRM). More on that tool soon. Lead Finder Another active means of finding potential clients is via the Agency Solutions Lead Finder. This tool makes it easy to find leads using their location and the web technology they prefer to use. Like Google Ads, HubSpot, or WordPress. Whenever you find a suitable lead for your agency, you can save their details to your lead list. Determining a fitting match is made easy thanks to the wealth of information that Lead Finder provides for each business. Firstly, Lead Finder provides you with the business’s domain name, social media profiles, and contact details. Secondly, you can view metrics like traffic, backlink profile, and site authority. Lead Finder is designed to be used with the Semrush CRM—more on that next. Client Portal & CRM Semrush’s CRM allows you to maintain and organize your client work. Whenever you gain new client work, you can register it in the CRM. On a basic level, CRM allows you to update project statuses, change client information, and edit budgets. On a more impressive level, you can organize your projects by priority, create checklists, and even interact and collaborate with your clients. Collaboration is achieved through the Client Portal. These portals give your clients access to files and tasks and provide them with progress updates. By letting your clients access these project updates, you provide greater transparency. It also means you don’t have to organize regular reports for your clients—as long as you keep your CRM up to date. Clients not on Semrush? Don’t worry: One of the most impressive aspects is that your clients don’t even have to be Semrush users to access their Client Portal. My Reports Do you need to create a white-label report for your client (or your own records)? Well, you can do it through the My Reports section of the Agency Growth Kit. This tool makes it easy to gather data from other areas of your Semrush account to create a professional-looking PDF. Best of all: this tool is also widely compatible with external data sources. Meaning you can integrate data from Google My Business, Google Search Console, Google Analytics, and Facebook Ads. If you’re in a rush, there’s a range of ready-made report templates to choose from. These templates allow you to generate a report almost automatically. The main template options cover all your reporting needs, from monthly SEO reports to full organic research outlines. When you click on one of these templates, all you have to do is fill out the domain information for the site you’re reporting for. In just a few clicks, you’ll have a comprehensive report ready for use. You can also edit the templates to include relevant widgets, which you can add to the report via a simple drag-and-drop system. Alternatively, My Reports also allows you to generate reports totally from scratch. But you can still make use of the drag-and-drop features to create your own custom reports. The Semrush App Center Aside from the range of powerful Semrush tools, there’s also a huge library of apps on the Semrush App Center that you can take advantage of. I’ve already touched on a few of them (like AdClarity and ContentShake AI), but the App Center features dozens of Semrush and third-party apps for every aspect of your digital marketing strategy. Here are a few of the most popular collections of apps: AI Apps Semrush has been at the forefront of implementing artificial intelligence in its range of SEO tools. But there are various AI-powered apps available that can enhance your workflows even further. Like AdCreative.ai, which lets you generate ad creatives, copy, and even photo shoots for your next ad campaign: Or the Ecommerce Booster, perfect if you’re a Shopify site owner looking to rapidly improve your store’s SEO: Small Business Collection As a small business owner, these apps can help you understand your competitors and boost your online presence. This collection includes free apps like the Email Verifier: Along with more focused market research tools, like Keyword Analytics for YouTube: And even the free Local Listings Check app: Explore these apps and lots more in the Semrush App Center. Who Is Semrush For? As this guide has hopefully made clear, you can use Semrush to develop and optimize your entire SEO strategy. You can: Perform competitor analysis Run an SEO audit Find link building opportunities Organize local SEO Gain marketing insights Review existing traffic Semrush is for everybody, but it’s especially useful for: SEO professionals & digital marketing agencies Freelancers PPC advertisers Social media marketers Ecommerce businesses Semrush Pricing Plans There are three main pricing tiers of Semrush: Pro, Guru, and Business. Before selecting a premium pricing plan, you can try out basic Semrush features with a free account. The free plan allows users to perform limited keyword research and a 100-page site audit. Note: A free Semrush account gives you up to 10 credits per day with this tool. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. The package you should opt for depends on the size of your business and your specific digital marketing needs. You also have to pay more for certain packages and add-ons. Here’s an overview of Semrush’s current tier and package prices, along with an overview of what they include: Plans Pro: $139.95 per month Guru: $249.95 per month Business: $499.95 per month Add-ons Regardless of whether you have Pro, Guru, or Business, you can get whatever add-on you need. The add-on price remains the same for each subscription tier. Semrush Local: $20-$40 per month Semrush .Trends: $289 per month (per user) Social Media Management: $29.99 per month Agency Growth Kit: $69-$249 ImpactHero: $200 per month Now It’s Your Turn to Try Semrush I hope you found this ultimate Semrush guide useful, and now feel more confident experimenting with Semrush’s SEO and digital marketing features. Semrush currently helps 116,000 paying customers improve their website’s performance, determine top keywords, boost organic search traffic, and much, much more. Try the benefits for yourself today with a 14-day free trial of a Semrush Pro subscription. Backlinko & Semrush Special Offer: 14-Day PRO Trial With Semrush, you get to analyze data, track rankings, and uncover valuable insights that can help you tailor your content and strategies more effectively. Sign Up Now",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Semrush Ultimate Guide"
    },
    {
      "level": "H2",
      "text": "What Is Semrush?"
    },
    {
      "level": "H3",
      "text": "Backlinko & Semrush Special Offer: 14-Day PRO Trial"
    },
    {
      "level": "H4",
      "text": "A Quick Note on This Guide"
    },
    {
      "level": "H2",
      "text": "SEO Dashboard"
    },
    {
      "level": "H2",
      "text": "Competitive Research"
    },
    {
      "level": "H4",
      "text": "Domain Overview"
    },
    {
      "level": "H3",
      "text": "Reveal any company’s website traffic"
    },
    {
      "level": "H4",
      "text": "Traffic Analytics"
    },
    {
      "level": "H4",
      "text": "Organic Research"
    },
    {
      "level": "H3",
      "text": "Start your keyword research"
    },
    {
      "level": "H4",
      "text": "Keyword Gap"
    },
    {
      "level": "H4",
      "text": "Backlink Gap"
    },
    {
      "level": "H2",
      "text": "Keyword Research"
    },
    {
      "level": "H4",
      "text": "Keyword Overview"
    },
    {
      "level": "H4",
      "text": "Keyword Magic Tool"
    },
    {
      "level": "H4",
      "text": "Keyword Strategy Builder"
    },
    {
      "level": "H3",
      "text": "Start your keyword research"
    },
    {
      "level": "H4",
      "text": "Position Tracking"
    },
    {
      "level": "H4",
      "text": "Organic Traffic Insights"
    },
    {
      "level": "H2",
      "text": "Link Building"
    },
    {
      "level": "H4",
      "text": "Backlink Analytics"
    },
    {
      "level": "H3",
      "text": "Find all of your backlinks"
    },
    {
      "level": "H4",
      "text": "Backlink Audit"
    },
    {
      "level": "H4",
      "text": "Link Building Tool"
    },
    {
      "level": "H4",
      "text": "Bulk Analysis"
    },
    {
      "level": "H2",
      "text": "On Page & Tech SEO"
    },
    {
      "level": "H4",
      "text": "Site Audit"
    },
    {
      "level": "H4",
      "text": "On Page SEO Checker"
    },
    {
      "level": "H4",
      "text": "Log File Analyzer"
    },
    {
      "level": "H2",
      "text": "Local SEO"
    },
    {
      "level": "H4",
      "text": "GBP Optimization"
    },
    {
      "level": "H4",
      "text": "Listing Management"
    },
    {
      "level": "H3",
      "text": "The ultimate local business toolkit"
    },
    {
      "level": "H4",
      "text": "Map Rank Tracker"
    },
    {
      "level": "H4",
      "text": "Review Management"
    },
    {
      "level": "H2",
      "text": "PPC Advertising"
    },
    {
      "level": "H4",
      "text": "Advertising Research"
    },
    {
      "level": "H4",
      "text": "AdClarity"
    },
    {
      "level": "H4",
      "text": "PLA Research"
    },
    {
      "level": "H4",
      "text": "Ads History"
    },
    {
      "level": "H4",
      "text": "Ads Launch Assistant"
    },
    {
      "level": "H2",
      "text": "Social Media"
    },
    {
      "level": "H4",
      "text": "Social Poster"
    },
    {
      "level": "H4",
      "text": "Social Tracker"
    },
    {
      "level": "H4",
      "text": "Social Content Insights"
    },
    {
      "level": "H4",
      "text": "Social Analytics"
    },
    {
      "level": "H4",
      "text": "Social Content AI"
    },
    {
      "level": "H4",
      "text": "Influencer Analytics"
    },
    {
      "level": "H2",
      "text": "Content Marketing"
    },
    {
      "level": "H4",
      "text": "Topic Research"
    },
    {
      "level": "H4",
      "text": "SEO Content Template"
    },
    {
      "level": "H4",
      "text": "SEO Writing Assistant"
    },
    {
      "level": "H4",
      "text": "Brand Monitoring"
    },
    {
      "level": "H4",
      "text": "ContentShake AI"
    },
    {
      "level": "H2",
      "text": "Semrush .Trends"
    },
    {
      "level": "H4",
      "text": "Market Explorer"
    },
    {
      "level": "H4",
      "text": "EyeOn"
    },
    {
      "level": "H4",
      "text": "One2Target"
    },
    {
      "level": "H2",
      "text": "Agency Solutions"
    },
    {
      "level": "H4",
      "text": "Agency Partners Platform"
    },
    {
      "level": "H4",
      "text": "Lead Finder"
    },
    {
      "level": "H4",
      "text": "Client Portal & CRM"
    },
    {
      "level": "H4",
      "text": "My Reports"
    },
    {
      "level": "H2",
      "text": "The Semrush App Center"
    },
    {
      "level": "H4",
      "text": "AI Apps"
    },
    {
      "level": "H4",
      "text": "Small Business Collection"
    },
    {
      "level": "H2",
      "text": "Who Is Semrush For?"
    },
    {
      "level": "H2",
      "text": "Semrush Pricing Plans"
    },
    {
      "level": "H4",
      "text": "Plans"
    },
    {
      "level": "H4",
      "text": "Add-ons"
    },
    {
      "level": "H2",
      "text": "Now It’s Your Turn to Try Semrush"
    },
    {
      "level": "H3",
      "text": "Backlinko & Semrush Special Offer: 14-Day PRO Trial"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}