{
  "url": "https://backlinko.com/hub/seo/ubersuggest",
  "slug": "ubersuggest",
  "title": "The Ultimate Guide to Ubersuggest",
  "description": "Learn everything you need to know about Neil Patel's Ubersuggest SEO tool in this brand new guide.",
  "content": "UbersuggestWritten by Brian DeanLast updated Aug. 05, 2024What Is Ubersuggest? Ubersuggest is a free SEO tool that specializes in generating new keyword ideas. Originally founded as a tool that scraped Google Suggest terms, Ubersuggest was recently acquired by entrepreneur Neil Patel, who has since expanded the feature set significantly. Key Features Keyword Ideas “Keyword Ideas” is the feature that put the original Ubersuggest on the map. And it still works GREAT. To use it, type in a keyword: And Ubersuggest will get to work to find long tail versions of the term that you typed in. You also get key data in each keyword, including monthly search volume, average CPC, PPC competition and SEO competition. Before you choose a keyword you definitely want to dig deeper into that term, analyze the SERPs etc. (I’ll show you how to do this with Ubersuggest in a minute) But it’s helpful to have a high-level overview stats that you can quickly scan. One cool feature inside of Keyword Ideas that I don’t see a lot of people use is the different keyword types. By default, Ubersuggest shows you a list of keyword suggestions: These suggestions are great if you’re already sure that you want to cover a certain topic. But it’s not great for brainstorming completely new keyword and content ideas. That’s because these keywords are based closely on the seed keyword you entered on the Ubersuggest home screen. But what’s cool about Ubersuggest’s keyword tool is that you can use it to generate different types of keywords, including: Related: These are keywords that are related to your seed keyword, but not necessarily on the same exact topic. For example, when I typed in “keto diet”, one of the Related suggestions was: “best restaurants for keto diet”. That’s one of those related keywords that you probably won’t find in many other keyword research tools. Questions: Keywords that are in the form of a question. For example, if you search for “email marketing”, one of the question keywords the tool spits out it: “does email marketing work”. Prepositions: Preposition keywords are terms that have two related concepts in one. For example, a preposition keyword for “SEO tools” is “SEO tools for excel”. I also found quite a few other interesting “SEO tools for X” terms. Comparisons: This might be my favorite feature in all of Ubersuggest. This feature generates a list of “vs”, “or” or “and” terms. Basically: keywords where someone’s comparing two things. In my experience comparison keywords are usually some of the best keywords in a niche. That’s because anyone that searches for a comparison keyword tends to be super knowledgeable about the space. Which means they’re pretty far along in the buying cycle. For example, I recently created a piece of content optimized around the comparison keyword “Ahrefs vs. SEMrush”. This keyword doesn’t get a ton of search volume. But with a CPC of $16.60, this term has a super high commercial intent. Plus, the keyword wasn’t super competitive. Which is why I was able to rank on the first page of Google within two months. Keyword Overview This tool gives you important data on a keyword that you type into it. So instead of listing out a bunch of ideas, this is like using a magnifying glass on a single term. Here’s a breakdown of the info that you get from the Keyword Overview report. Overview and Search Volume Trend: This gives you all the basic info you need, along with how that keyword’s search volume has been trending over the last 12 months. Average Backlinks and Domain Score: Neil Patel tells you approximately how many backlinks you need to rank on the first page for that keyword. He also gives you the average ranking site’s Domain Score (this is basically Ubersugget’s version of Moz Domain Authority). Content Ideas: This gives you a list of content on that topic that drive lots of traffic, backlinks, and social media shares. SERP Overview: If you click on the “SEO Difficulty” card, you’ll get to see the top 100 ranking pages for that term, along with data on their links, social shares and estimated traffic. Content Ideas This is Ubersuggest’s answer to BuzzSumo. Although not as feature-rich as a paid BuzzSumo account, it’s helpful for figuring out what’s already working in that space. Plus, you can filter to include/exclude keyword, only show content with a minimum number of Facebook shares, and more. It would be nice to get a few other social networks here (like Twitter). But I’m sure Neil’s working on it! Pro Tip: Click the “Keywords” button in the “Est. visits” column to get a list of the keywords that the page ranks for in Google. This is mini feature is super helpful for SEO keyword research. That’s because you can see other terms that a page ranks for… terms that you may not have thought of on your own. Traffic Analyzer Overview Here’s where you can get a sneak peak into a competitor’s SEO efforts. (You can also use this tool to analyze your own domain). Here’s an explanation of what you’ll find on this page: Organic Keywords: This is the total number of keywords that this site ranks for in Google. Keep in mind that ranking for lots of keywords doesn’t always mean that a site gets a lot of traffic. That’s because, according to one analysis of Google CTR stats, the top 3 results in Google get about 1/3rd of the clicks. So it’s nice to rank for a bunch of keywords. And most of the time, a high “Organic Keywords” number means high levels of search engine traffic. But it’s more important to rank at the top of the first page for a handful of keywords than just rank in the #10 spot for lots of different terms. Fortunately, Ubersuggest does have a ranking distribution breakdown, which I’ll get into later. Organic Monthly Traffic: This is an estimate of how many visitors that a site gets from Google on a monthly basis. Domain Score: This is an estimate of how much link authority a domain has. The more high-quality backlinks a site has pointing to it, the higher this number will be. In general, it’s harder to compete against sites with a high Domain Score. Backlinks: This is the total number of backlinks that a site has. Traffic Trend Chart: Here’s where you can see how a site’s organic traffic has been trending. There’s usually nothing super actionable you can do with this information. But it is interesting to see how a competitor’s rankings have fluctuated. SEO Keywords Ranking: Here’s a breakdown of where a site tends to rank in Google’s search results. For example, in September I had 32,937 keywords that ranked 51-100, 37,191 that ranked 11-50, 9,536 between 4-10 on the first page, and 4,540 in the top 3. Top Pages This is a list of pages that send a site the most search engine traffic. Why is this helpful? Well, let’s say that you wanted to come up with a bunch of new keyword and content ideas for an SEO campaign. You could use Ubersuggest’s other keyword research features (like Keyword Ideas) to generate a list of keywords. The only issue with this approach is that it’s impossible to know if you actually have a chance to rank for any of those keywords. The “SEO Difficulty” score that Ubersuggest gives you is helpful. But it’s a really rough estimate that’s based 100% on backlinks. It doesn’t take into account content quality, on-page SEO, PageSpeed… or any other important search engine ranking factors. Instead, you’re better off finding pages that already send a competitor traffic. And because you know the exact page that’s ranking, you already have a blueprint of what works. One thing to keep in mind here: It’s important that the site that you reverse engineer has a similar link profile as you. If so, you can be confident that you also have a decent chance of ranking for the same keywords they do. For example, one of my main SEO competitors is Ahrefs. According to Ubersuggest, they have a Domain Score of 90. My Domain Score is also 90. So, at least based on that, I can potentially rank for any keyword that they do. Pro Tip: Sort through a site’s top pages by country. Right now, Ubersuggest supports the US, India, The UK, Australia, Canada and Spain. So if you work in any of these countries, you can see how a competitor is performing there. Keywords This feature is similar to “Top Pages”. But instead of seeing a competitors’ most successful SEO pages, you see the keywords that send them the most traffic. The main benefit of reverse engineering a competitor’s keywords is that you can find keywords that are tough to come up with on your own. For example when I look Ahrefs’s top pages, I discovered a bunch of interesting keywords and content topic ideas. “Funnels” is something that I know is growing in popularity. But because it’s not super-related to SEO, I never thought of covering it. But now that I see it on this list, I’m going to consider creating a piece of content around that term. Site Audit Site Audit is one of Ubersuggest’s two “SEO Analyzer” features. Like it sounds, Site Audit runs an SEO audit of your website. And gives you recommendations on what’s wrong and how to improve. Let’s break down all of the data that you get in this report. Organic Monthly Traffic, Organic Keywords, Backlinks: This is the same info that you get in the Traffic Analyzer report. On-Page SEO Score: This tool audits 100 pages on your website. And assigns each of them an “On-page SEO score”. This is your website’s overall score based on that sample. I’m not 100% sure how the tool sizes up your on-page SEO. But I assume it looks for things like having a keyword in your title, having SEO-friendly URLs and using LSI keywords. Health Check: Here’s where you can see a breakdown of how your site’s pages performed in the audit. Critical Errors: These problems that can hurt a page’s ability to rank. Or even hurt your site’s overall rankings. For example, duplicate content, blocked pages, multiple meta tags on a single page, and more. I recommend checking each of these one-by-one. Also, in some cases, you may find that the error was actually not an error at all. For example, this report says my site has duplicate title tags (the same title tag across multiple pages). But when I look at the actual report, I can see that those pages aren’t indexed in Google anyway (thanks to a noindex tag). Which means I’m actually OK. Warnings: Warnings are all things that won’t make or break your SEO. But they’re still worth fixing. For example, a few of my pages have “a poorly formatted URL for SEO”. URLs are helpful for on-page SEO and organic CTR. But they won’t make or break your rankings. As another example, That said: even though these warnings aren’t critical issues, fixing them can improve your SEO. So they’re worth spending some time on. Recommendations: The recommendations are little bonus steps that can slightly help with your SEO. For example, if you have temporary (302) redirects in place instead of 301 redirects, this isn’t ideal. And it’s something that the tool will tell you about. But according to Google, using a 302 redirects when you should use a 301 is not a huge problem from an SEO point of view. Sitespeed: Here’s where you can see how quickly your site’s pages load (based on the 100-page sample that Ubersuggest uses), on both desktop and mobile. What I like about this report is that you don’t just get a score that leaves you wondering what to improve. Instead, you get an “Advanced Breakdown” that shows you why your site might not be loading quickly. Top SEO Issues: This pulls all of the data from the Site Audit report and shows you what to work on first based on the potential SEO impact of fixing the issue. For example, in my case, they recommend that I get cracking on 3 pages with a low word count. Backlinks Backlinks is the other Ubersuggest “SEO Analyzer” feature. Let me quickly explain how to use the data from this report. Overview: Here’s where you can see a site’s Domain Score, total backlinks and referring domains. It also shows you a site’s estimated Organic Monthly Traffic. But that wasn’t working for me when I tried it. You can even see how many .gov and .edu domains a website has here. According to Google, .edu links aren’t anything special for SEO. But many SEO experts disagree. So you can take this number with a grain of salt. Backlink List: This is a list of backlinks pointing to a website that Ubersuggest has in its index. Each link is broken down into Domain Score, Link Type, Anchor text, and the first and last time Ubersuggest found that live link on the page. Filters: Ubersuggest’s Backlink tool comes with a handful of helpful filters. For example, you can filter to only see followed or nofollow links. Or you can use an advanced filter to zero-in on a certain type of link (for example, links from or not from a certain domain). All in all, this is a great way to see your own backlinks… or find out who is already linking to a competing site. This feature isn’t on par with a paid link analysis tool like Moz ProMoz Pro. But it’s still super useful. Dashboard This is a new feature that you can use to track your organic traffic, setup rank tracking, monitor your links, and more. If you run several websites, you can even create different projects for each one. And use this as a dashboard to see how they’re all doing in one place. To use this feature you will need to create a free Ubersuggest account. And allow it to pull your Google Search Console data. The “Tracked Keywords” report is especially solid. In it, you can see your average ranking position, distribution, and changes in your search engine visibility. You can even check your rankings on desktop and mobile. And if you want to send this to your SEO clients, you can whip up a PDF version of this report. Pretty sweet! Learn More The Definitive Guide to Link Building: Now that you have access to a competitor’s links, what’s next? This guide will help you turn this data into more links. 25 Amazing Free SEO Tools: Ubersuggest isn’t the only helpful free SEO tool on the market. Here’s a list of other free SEO software to try out.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Ubersuggest"
    },
    {
      "level": "H3",
      "text": "What Is Ubersuggest?"
    },
    {
      "level": "H3",
      "text": "Key Features"
    },
    {
      "level": "H4",
      "text": "Keyword Ideas"
    },
    {
      "level": "H4",
      "text": "Keyword Overview"
    },
    {
      "level": "H4",
      "text": "Content Ideas"
    },
    {
      "level": "H4",
      "text": "Traffic Analyzer Overview"
    },
    {
      "level": "H4",
      "text": "Top Pages"
    },
    {
      "level": "H4",
      "text": "Keywords"
    },
    {
      "level": "H4",
      "text": "Site Audit"
    },
    {
      "level": "H4",
      "text": "Backlinks"
    },
    {
      "level": "H4",
      "text": "Dashboard"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}