{
  "url": "https://moz.com/blog/category/content-marketing/p15",
  "slug": "p15",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Lydia Gilbertson May 4, 2017 How Small Digital Publishers Can Grow Their Network and Save Time Content Marketing | SEO Tools Being a small publishing company is hard; most are understaffed and overworked, always playing catch-up with the big players. To compete, you must keep your focus honed, use external apps for the heavy lifting, and consider outside publishing platforms. Read this post By: Dmitry Dragilev April 19, 2017 [Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 Months Keyword Research | Content Marketing | Advanced SEO If you've been struggling to take the number-one spot in the SERPs for a competitive keyword, take a cue from this case study. Dmitry Dragilev shares his team's 8-step methodology for ranking first in a popular niche. Read this post By: Miriam Ellis April 18, 2017 The Best Types of Content for Local Businesses: Building Geo-Topical Authority Local SEO | Content Marketing What's the best way to show local searchers that you're an authority in your niche? You guessed it — through your content. But that can be a pretty vague and overwhelming term; what are some actual ways to make a difference, conversions-wise? Miriam Ellis explains. Read this post By: Simon Penson April 5, 2017 Constant Content: The Silver Bullet for Failing Content Marketing Strategy Content Marketing | Marketing Industry | SEO Basics The State of Content Marketing Survey told us that 92% of marketers don't have a clear plan for content marketing. The only answer: the constant content approach. Read this post By: Everett Sizemore March 22, 2017 How to Do a Content Audit Content Marketing | Technical SEO | On-page SEO Learn how to do content audits for SEO in this Moz guide by Everett Sizemore, including tips for crawling large websites, rendering JavaScript content, and auditing dynamic mobile content. Read this post By: Rand Fishkin March 10, 2017 Better Alternatives to \"Expert Roundup\"-Style Content Content Marketing | Whiteboard Friday Thinking of publishing an expert roundup? Don't—there's a better way. In this Whiteboard Friday, Rand explains why expert roundups aren't the best use of your time and effort, and how to pivot your strategy to create similar content that'll make the juice worth the squeeze. Read this post By: Kerry Jones February 28, 2017 How to Create Content That Keeps Earning Links (Even After You Stop Promoting It) Link Building | Content Marketing Link building is hard. What if your content could do the bulk of the work for you? Kerry Jones shares how well-researched, authoritative content can ensure you earn quality links long after you've stopped actively promoting it. Read this post By: Megan Hannay - @ZipSprout January 24, 2017 How to Create Authentic Hyperlocal Content At Scale Local SEO | Content Marketing Creating local content is hard enough, but when you're a nationally based business, it seems impossible. The key? Discovering and utilizing local content creators. Read this post By: Roxana Nelson January 17, 2017 MozBar Revived! How We Rebuilt MozBar to be More Robust Than Ever—Plus a Brand-New Feature Moz News | On-page SEO | Content Marketing MozBar has been completely rebuilt for speed and reliability — plus the addition of On-Page Content Suggestions! Check out what's changed (and watch us react to the tweets you've sent us). Read this post By: A.J. Ghergich January 17, 2017 What We Learned From Analyzing 1.4 Million Featured Snippets Advanced SEO | Content Marketing From optimal snippet length, to practical application tips, to which queries prefer tables, lists, or paragraphs, learn everything you need to know to supercharge your snippet wins. Read this post By: Simon Penson January 16, 2017 Programmatic Delivery: The Future of Content Marketing and Promotion? Content Marketing | Online Advertising | Public Relations Could programmatic delivery be the answer to the challenges of content distribution and promotion in the future? Simon Penson thinks so. Read on to discover how this new method of paid content delivery could help you. Read this post By: Felicia Crawford January 12, 2017 Simply the Best: 2016's Top Content from the Moz Blog Content Marketing | Advanced SEO | Moz News With every click, visit, thumbs-up, and comment, you voted for the best Moz Blog content of 2016. Revisit your favorite posts and check out what you might have missed throughout the year! Read this post By: Jo Cameron December 27, 2016 Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level SEO Basics | Content Marketing | Keyword Research SERP features are your insight into what content Google thinks best serves the needs of searchers for any given keyword. Learn how to target and win them with this follow-along educational workflow. Read this post By: Eric Enge December 14, 2016 Reach and Influence: Your First Marketing Priority Content Marketing | Social Media The concept of the search box is likely to disappear in the next 5 years. Build a change-proof content strategy via a renewed focus on your reach and influence. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "How Small Digital Publishers Can Grow Their Network and Save Time"
    },
    {
      "level": "H2",
      "text": "[Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 Months"
    },
    {
      "level": "H2",
      "text": "The Best Types of Content for Local Businesses: Building Geo-Topical Authority"
    },
    {
      "level": "H2",
      "text": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Do a Content Audit"
    },
    {
      "level": "H2",
      "text": "Better Alternatives to \"Expert Roundup\"-Style Content"
    },
    {
      "level": "H2",
      "text": "How to Create Content That Keeps Earning Links (Even After You Stop Promoting It)"
    },
    {
      "level": "H2",
      "text": "How to Create Authentic Hyperlocal Content At Scale"
    },
    {
      "level": "H2",
      "text": "MozBar Revived! How We Rebuilt MozBar to be More Robust Than Ever—Plus a Brand-New Feature"
    },
    {
      "level": "H2",
      "text": "What We Learned From Analyzing 1.4 Million Featured Snippets"
    },
    {
      "level": "H2",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Simply the Best: 2016's Top Content from the Moz Blog"
    },
    {
      "level": "H2",
      "text": "Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level"
    },
    {
      "level": "H2",
      "text": "Reach and Influence: Your First Marketing Priority"
    }
  ],
  "author": "Lydia Gilbertson\n          \n            Dmitry Dragilev\n          \n            Miriam Ellis\n          \n            Simon Penson\n          \n            Everett Sizemore\n          \n            Rand Fishkin\n          \n            Kerry Jones\n          \n            Megan Hannay - @ZipSprout\n          \n            Roxana Nelson\n          \n            A.J. Ghergich\n          \n            Simon Penson\n          \n            Felicia Crawford\n          \n            Jo Cameron\n          \n            Eric Enge"
}