{
  "url": "https://moz.com/blog/category/content-marketing/p18",
  "slug": "p18",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Daniel Marks June 21, 2016 Context is King: A Million Examples of Creative Ad Campaigns Getting it Right Content Marketing | Online Advertising We all know the familiar mantra, but when it comes to digital advertising, it's the *context* of your content that leads the monarchy. Are you capitalizing on different contextual opportunities in your marketing campaigns? Read this post By: Katy Katz June 13, 2016 Here’s How to Visually Map a Content Strategy Content Marketing | Blogging When it comes to building a content strategy to guide your brand, seeing is believing, so creating a visual roadmap can help mightily. Read this post By: Tyler Murray June 13, 2016 Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!) Content Marketing | Moz Tools | Moz News Now that Q2 is nearing an end, we're sharing all the fancy updates we've made to Moz Content. If you haven't used it for content ideation and evaluation yet, now's the time to explore the new features and check it out! Read this post By: David Farkas May 25, 2016 Here's How I'm Using Moz Content for Mining Local Link Opportunities Content Marketing | Local SEO | Link Building Searching for new workflows to help you build those local links? Take a look at how one SEO is using Moz Content to uncover content and linking opportunities. Read this post By: Isla McKetta May 25, 2016 Is Your Writing Readable? 3 Concepts to Master for Copy That Converts Content Marketing | User Experience (UX) | SEO Copywriting Chunking, word recognition, and universal design are the cornerstones of readable copy. Are you writing in a way your audience can easily understand? In this post, Isla McKetta doles out the top insights from her research into readability and its utter importance. Read this post By: James Agate May 18, 2016 Learn to Love Your Existing Content - 5 Ways to Get More Visibility Content Marketing If you're feeling burnt out on endlessly creating new content, it may be a good time to examine the assets you already have. This post walks you through identifying, priming, and promoting existing content to earn links, social shares, and boosted traffic. Read this post By: Dan Shure May 4, 2016 An Exploration of Podcasting SEO in 2016 Content Marketing | SEO Basics SEO is everywhere you look. In today's post, Dan Shure dives headfirst into the world of SEO for podcasting, exploring the surprising similarities and differences in ranking for iTunes and uncovering his journey in launching an SEO-oriented podcast. Read this post By: Matthew Barby April 27, 2016 Measuring Content: You’re Doing it Wrong Content Marketing | SEO Reporting The traditional ways of measuring the success or failure of content are broken. In today's post by HubSpot's Matthew Barby, learn why you can’t just rely on metrics like pageviews, visits, or bounce rate to determine whether what you're creating has performed well. Read this post By: Kelsey Libert April 26, 2016 What 300+ Content Marketing Campaigns Can Teach You About Earning Links Content Marketing | Link Building What kind of content is going to earn you the most — and highest quality — links? In a comprehensive look at a whopping 300+ content marketing campaigns spanning from 2013 to the present, Kelsey Libert shares the key ingredients to creating truly stellar content. Read this post By: Nathan Kontny April 19, 2016 Here’s How Personalized Emails Helped Turn Our Brand Around Content Marketing | Email Marketing | Branding If you're looking to build a lasting connection with your customers, becoming a personal, human brand is a great place to start. Read this post By: Ronell Smith April 13, 2016 3 Tactics That'll Make Writing Tighter as Easy as 1-2-3 Content Marketing | Blogging If you're serious about readers seeing the strength of your ideas, writing shorter content must become a part of your repertoire. Read this post By: Rand Fishkin April 12, 2016 Great Content ≠ Long-Form Content Content Marketing | Marketing Psychology | SEO Copywriting \"Great\" content and long-form content are not the same thing. In this post, Rand explains the difference, the reasons for the correlations, and an alternative path to making content that accomplishes your goals and those of your audience. Read this post By: Katy Katz April 5, 2016 How to Steal from Your Favorite Writers to Make Your Copy Sing Content Marketing | Blogging | SEO Copywriting How often do you sit down to read a book and find yourself hooked within the first few sentences? Or even the first few words? I would venture to bet the answer is \"not often.\"In fact, I find that the books which turn out to be my favorite in the end typically take at least 50-100 pages to “pick up pace.” But we expect that when we read a good book. We come to the table knowing what... Read this post By: Rand Fishkin April 1, 2016 How Google May Analyze and Evaluate the Quality, Value, & Rank-Worthiness of Your Content Content Marketing | On-page SEO | Whiteboard Friday Your content has quality links and your keyword targeting is an SEO's dream. Yet for some mysterious reason, that content still isn't ranking. What's missing? In today's Whiteboard Friday, Rand explains some of the advanced tactics Google may be using to evaluate and analyze your content and what you should be looking out for to help resolve your ranking woes. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "Context is King: A Million Examples of Creative Ad Campaigns Getting it Right"
    },
    {
      "level": "H2",
      "text": "Here’s How to Visually Map a Content Strategy"
    },
    {
      "level": "H2",
      "text": "Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!)"
    },
    {
      "level": "H2",
      "text": "Here's How I'm Using Moz Content for Mining Local Link Opportunities"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Is Your Writing Readable? 3 Concepts to Master for Copy That Converts"
    },
    {
      "level": "H2",
      "text": "Learn to Love Your Existing Content - 5 Ways to Get More Visibility"
    },
    {
      "level": "H2",
      "text": "An Exploration of Podcasting SEO in 2016"
    },
    {
      "level": "H2",
      "text": "Measuring Content: You’re Doing it Wrong"
    },
    {
      "level": "H2",
      "text": "What 300+ Content Marketing Campaigns Can Teach You About Earning Links"
    },
    {
      "level": "H2",
      "text": "Here’s How Personalized Emails Helped Turn Our Brand Around"
    },
    {
      "level": "H2",
      "text": "3 Tactics That'll Make Writing Tighter as Easy as 1-2-3"
    },
    {
      "level": "H2",
      "text": "Great Content ≠ Long-Form Content"
    },
    {
      "level": "H2",
      "text": "How to Steal from Your Favorite Writers to Make Your Copy Sing"
    },
    {
      "level": "H2",
      "text": "How Google May Analyze and Evaluate the Quality, Value, & Rank-Worthiness of Your Content"
    }
  ],
  "author": "Daniel Marks\n          \n            Katy Katz\n          \n            Tyler Murray\n          \n            David Farkas\n          \n            Isla McKetta\n          \n            James Agate\n          \n            Dan Shure\n          \n            Matthew Barby\n          \n            Kelsey Libert\n          \n            Nathan Kontny\n          \n            Ronell Smith\n          \n            Rand Fishkin\n          \n            Katy Katz\n          \n            Rand Fishkin"
}