{
  "url": "https://moz.com/blog/category/content-marketing/p34",
  "slug": "p34",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dan Tynski June 19, 2012 8 Attributes of Content That Inspire Action Content Marketing Below is a breakdown of eight elements that inspire action and how to add them into your content. You should be purposefully weaving these elements into your content. At the end of this post, I’ve included an evaluation rubric for you to consistently measure if your content incorporates these attributes. Read this post H By: Hannah Smith June 17, 2012 Companies in \"Boring\" Niches Creating Great Content Content Marketing When I suggest that businesses should think about creating some content I'm frequently met with objections like - But my niche is boring - no one cares! Actually I don't think that there's such a thing as a boring niche, but I do understand where they're coming from... Read this post By: Rand Fishkin June 6, 2012 A Manifesto of Content Marketing Content Marketing Last month in Philadelphia, I gave a short presentation on content marketing to an audience at SEER Interactive's SearchChurch. Since the setting was so unique, I tried a unique format and style that I haven't done previously. It was a bit fun and silly, and also a little heavy-handed (but meant tongue-in-cheek). The fundamentals of what I tried to present, though, are things I solidl... Read this post By: Larry Kim May 29, 2012 Oops, I Ruined the Facebook IPO! Content Marketing Last week’s Facebook IPO may go down in financial infamy as being the biggest and most high profile IPO flop of the century – and this Internet Marketer's content marketing efforts may have inadvertently triggered the epic Facebook IPO meltdown. Sounds ridiculous and completely preposterous, right? Read to the end of the story and decide for yourself! Read this post By: Toby Murdock May 23, 2012 How to Build and Operate a Content Marketing Machine Content Marketing Content Marketing is hot. White hot. SEO and digital marketing thought leaders are declaring that Content Marketing is the next big thing. Even Rand is touting its importance... Read this post J By: John Pring May 17, 2012 In-depth Guide To Content Creation [With Infographic] Content Marketing How can you make creating high quality, shareable content easier? What processes can you follow to minimise the time you spend researching and thinking and maximise the time you spend creating and sharing your content? Read this post By: Justin May 9, 2012 Case Study - Following Rand's Advice On Virality Content Marketing Recently Rand did a great Whiteboard Friday video on how to increase the chances that content will go viral. We used that video as a guide when publishing an infographic on AdChop.com. Read this post K By: Kate Morris April 22, 2012 Modern Business and Content Guidance from Bell Labs Content Marketing I've been reading The Idea Factory, the history of the innovation that came out of Bell Labs around WWII. Innovation, invention and ideas are things that we don't get to talk much about in SEO. It's all about keywords, links, and content, but I want you to take some time today to think about ideas, inventions and innovations. Why? Because we all want to be millionaires (oh hush, yes you do), and while that might not happen to all of us, idea generation is central to our jobs in search marketing. Read this post By: Kieran Flanagan April 20, 2012 #SocialSuccess - An Inbound Marketing Case Study for B2B Content Marketing There has been a lot of great discussion about the term “inbound marketing” of late and exactly what is covered by that phrase. For the purposes of this case study we are using the hubspot definition of inbound and outbound marketing. The following is a case study of how we (Salesforce.com) used inbound marketing along with social advertising and great retargeting to grow both our traffic and leads in the UK. Read this post By: Gianluca Fiorelli April 3, 2012 Content Curation Guide for SEO - What, How, Why Content Marketing Curation Content is a Content Marketing tactic that SEOs should learn and use. This guide will tell them all they need to know about Content Curation: what it is, how to do it, and why to do it for the highest benefit of their campaigns. Read this post A By: Amie Marse April 3, 2012 Content Curation in 45 minutes a day... and FREE Content Marketing I’m sure a lot of you guys have looked into curation and all the lovely softwares available, like Curata and Curation Soft. Obviously with the radically different price points they all do different things, but here’s the gist – a whole lot of this you can do for free. And I have total faith that anyone within the Moz Community can handle this and then some. Heck, I’d ... Read this post By: Simon Penson March 28, 2012 The Future of Effective Content Marketing - Long Term Personas Content Marketing Unless you have had your head buried in the sand in recent months you’ll know that content marketing and outreach is THE critical off page technique to ensure the long-term success of your business. Read this post S By: Samantha Noble March 13, 2012 5 Awesome Content Ideas for Boring Niches Content Marketing Today Mike Essex from Koozai tackles boring niches, and more specifically how you can create awesome content for them. By the end of this video you'll be able to see that there's no such thing as a boring niche, and that by changing your mindset it's easy to find fantastic content ideas. Read this post J By: Julianne Staino March 4, 2012 How to Leverage Content Communities to Expand Your Brand Reach Content Marketing “Content is King!” Ah, the wonderfully overused statement that makes me want to throw my monitor at the wall and then hang my head in shame because it’s actually true. I feel like I can safely assume that we can all agree on the increasing importance of awesome content. Recently, it seems like everyone is championing for companies to evolve the way in which they a... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "8 Attributes of Content That Inspire Action"
    },
    {
      "level": "H2",
      "text": "Companies in \"Boring\" Niches Creating Great Content"
    },
    {
      "level": "H2",
      "text": "A Manifesto of Content Marketing"
    },
    {
      "level": "H2",
      "text": "Oops, I Ruined the Facebook IPO!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Build and Operate a Content Marketing Machine"
    },
    {
      "level": "H2",
      "text": "In-depth Guide To Content Creation [With Infographic]"
    },
    {
      "level": "H2",
      "text": "Case Study - Following Rand's Advice On Virality"
    },
    {
      "level": "H2",
      "text": "Modern Business and Content Guidance from Bell Labs"
    },
    {
      "level": "H2",
      "text": "#SocialSuccess - An Inbound Marketing Case Study for B2B"
    },
    {
      "level": "H2",
      "text": "Content Curation Guide for SEO - What, How, Why"
    },
    {
      "level": "H2",
      "text": "Content Curation in 45 minutes a day... and FREE"
    },
    {
      "level": "H2",
      "text": "The Future of Effective Content Marketing - Long Term Personas"
    },
    {
      "level": "H2",
      "text": "5 Awesome Content Ideas for Boring Niches"
    },
    {
      "level": "H2",
      "text": "How to Leverage Content Communities to Expand Your Brand Reach"
    }
  ],
  "author": "Dan Tynski\n          \n            Hannah Smith\n          \n            Rand Fishkin\n          \n            Larry Kim\n          \n            Toby Murdock\n          \n            John Pring\n          \n            Justin\n          \n            Kate Morris\n          \n            Kieran Flanagan\n          \n            Gianluca Fiorelli\n          \n            Amie Marse\n          \n            Simon Penson\n          \n            Samantha Noble\n          \n            Julianne Staino"
}