{
  "url": "https://moz.com/blog/category/content-marketing/p40",
  "slug": "p40",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Joe Rozsa December 10, 2008 Why Search Engines Make It Hard to Plagiarize Content Marketing Hello fellow Mozzers (hopefully my absence lately doesn't make it wrong to say something like that). This holiday season, I wanted to drop by and say hello and warm wishes to friends I haven't chatted with in a while. And to post one short article about something that really got under my skin this evening. Like many of you, I have a boatload of side websites that I run for business and hobby both. One of those sites gets a decent amount of traffic this time of year, due to the annual controversy surrounding a college football playoff system. My site, BCSFootballPlayoffs.com, is a couple of years old and is a place where I post my two cents on what I feel would be an ideal and exciting college football playoff system. My site gets decent traffic and is ranked #3 on Yahoo for \"college football playoff system\". Read this post By: Jane Copland November 19, 2008 So What Should We Be Asking Bloggers? Content Marketing Last week at Pubcon in Las Vegas, I took part in the session titled, \"5 Bloggers and a Microphone.\" Since then, we've heard a fair bit of feedback that people were disappointed in the session, mainly because the questions we were asked didn't allow us to impart any good blogging knowledge. As was reported in many different places, one attendee asked an in-depth paid search question which... Read this post By: Paul Lalley September 24, 2008 Selling Services and Shoes: Some Copywriting Tips Content Marketing I was looking at snow blowers last week, reading through the literature and trying to compare specs of different models. I don’t know squat about the tech specs of snow blowers, but tell me “this model can shred a big block Chevy” and I’m sold. Not specs. Benefits of snow blower A over snow blower B. That’s what the unknowing (me) want. For example… &nbs... Read this post By: Rand Fishkin September 10, 2008 6 Unique Content Ideas to Boost Your Website's Value & Link-Worthiness Content Marketing The \"build great content\" advice is clearly overused, but for good reason - great content attracts great links and the invaluable attention of the Linkerati. The only problem is... what makes great content? And mor... Read this post G By: Gnet September 9, 2008 Getting Attention as a Blogger Through Blogger Interviews Content Marketing I run a 'kinda-sorta' authority blog on blogging and making money online, I'm always thinking of new ways to be a better blogger, make more money, just be good enough to preach about what I practice, to do that properly I try all sorts of new strategies. This is one of them. I've been thinking really hard about ... Read this post By: Jane Copland September 4, 2008 Snake Oil In Disguise: Useless Information Passing As Good Advice Content Marketing ... Read this post By: Paul Lalley September 4, 2008 Adding Value to Website Content Content Marketing I recently finished a job that changed the way I view what I do. The assignment was to revise operating manuals for a mainframe computer software company. For resource material, I was given the old manual and a summary of updates, upgrades, new procedures, and all of the new information that had to be included in the revised manuals. (Stay with me, this does have a point.) I mean, ... Read this post By: Rishi Lakhani August 19, 2008 Small Business SEO: Content Strategies Content Marketing One of the problems with working on Small Business SEM is content development. So far we know what keywords we are targeting, who our link market is, and ... Read this post By: Danny Dover August 19, 2008 Examining The Internet's Top Blogs: What We Can Learn From Their Success Content Marketing Everyday a fiercely competitive battle takes place online over capturing the attention of millions of readers. As a result the blogosphere constantly changes shape and different players thrust forward as content kings for the day. Lately I have been trying to find out what forces control this volatile scene. I have been looking for recurring themes and hoping to find useful correlations. ... Read this post M By: MitchTurck August 8, 2008 4 Reasons to Have Your Blog Free-Hosted, From an SEM Perspective Content Marketing The past few years have seen numerous discussions raised about the pros and cons of hosting your own blog vs. riding the snake that is WordPress/Blogger/whatever. While it's safe to say that growing your own is the best practice (I think I'm still talking about blogs here...), I've never seen anyone in SEM successfully play devil's advocate on the matter. Or the \"devil'... Read this post By: Danny Dover July 31, 2008 A Foolproof Method for Great Blogging Content Marketing The Foolproof Method for Great Blogging Don’t become an expert by acting like one - This might sound counter-intuitive, but it really does make sense. Many inexperienced bloggers try to make their work sound important and reputable even when it is not. This is an easy mistake to make because emulating the industry leaders is a logical path to success. Don’t be fooled. Real success comes from distinguishing oneself in a useful way, not by pretending to be something one is not. Read this post By: Rand Fishkin July 22, 2008 Headsmacking Tip #3: Run Your Blog Post Titles Through Keyword Research Before You Hit Publish Content Marketing I'm getting to like this series :-) (see #1 and #2). This week, I thought I'd talk about a tip that might cause mild concussions if you haven't been doing it. That's right, it's the ultra-simple \"research before you post\" technique for bloggers. The basic tenet goes something like this - if your blog has any reasonable quantity of link equity and ranking ability, chances are t... Read this post By: Paul Lalley July 16, 2008 Real Tools For SEO Copywriters Content Marketing Forget Google Analytics. Toss your SEO Elite. These tools can only go so far in writing text for a well-optimized site. The tools I find most useful aren’t digital. They’re 100% analog, guaranteed to cut any assignment down to size. Check your SEO copywriter’s tool kit for the following: A ball peen hammer. The ball been hammer ... Read this post R By: Rebecca Haden July 11, 2008 Linguistics and SEO Content Marketing There’s been talk here and there about the right kind of preparation for SEO professionals. My degrees are in linguistics, and I want to be the first to suggest that this is good preparation for SEO. For one thing, hardly anyone knows what it is. I spent all those years having conversations like this:“What’s your major?” “Linguistics.” Pause “Oh.... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "Why Search Engines Make It Hard to Plagiarize"
    },
    {
      "level": "H2",
      "text": "So What Should We Be Asking Bloggers?"
    },
    {
      "level": "H2",
      "text": "Selling Services and Shoes: Some Copywriting Tips"
    },
    {
      "level": "H2",
      "text": "6 Unique Content Ideas to Boost Your Website's Value & Link-Worthiness"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Getting Attention as a Blogger Through Blogger Interviews"
    },
    {
      "level": "H2",
      "text": "Snake Oil In Disguise: Useless Information Passing As Good Advice"
    },
    {
      "level": "H2",
      "text": "Adding Value to Website Content"
    },
    {
      "level": "H2",
      "text": "Small Business SEO: Content Strategies"
    },
    {
      "level": "H2",
      "text": "Examining The Internet's Top Blogs: What We Can Learn From Their Success"
    },
    {
      "level": "H2",
      "text": "4 Reasons to Have Your Blog Free-Hosted, From an SEM Perspective"
    },
    {
      "level": "H2",
      "text": "A Foolproof Method for Great Blogging"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #3: Run Your Blog Post Titles Through Keyword Research Before You Hit Publish"
    },
    {
      "level": "H2",
      "text": "Real Tools For SEO Copywriters"
    },
    {
      "level": "H2",
      "text": "Linguistics and SEO"
    }
  ],
  "author": "Joe Rozsa\n          \n            Jane Copland\n          \n            Paul Lalley\n          \n            Rand Fishkin\n          \n            Gnet\n          \n            Jane Copland\n          \n            Paul Lalley\n          \n            Rishi Lakhani\n          \n            Danny Dover\n          \n            MitchTurck\n          \n            Danny Dover\n          \n            Rand Fishkin\n          \n            Paul Lalley\n          \n            Rebecca Haden"
}