{
  "url": "https://moz.com/blog/category/content-marketing/p43",
  "slug": "p43",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "V By: Vinny Goldsmith November 13, 2007 Plan Ahead to Bring Readers Back Content Marketing We all know a long term strategy to developing content is necessary for our sites to become known as authoritative. Yet most webmasters, bloggers, etc. tend to think of content development along two lines:Quickly conceived short postings about current news and developments in their niche (this is what most blogs are known for)Thoughtful link bait that ... Read this post V By: Vinny Goldsmith November 6, 2007 Finding Your Niche Content Marketing I had mentioned the other day that I was changing my SEO ways. As Gab had correctly observed, I had spread myself too thin. So this week I’ve been doing an audit of each of my sites, looking at current rankings, traffic, etc. And looking at how competitive each niche area was. The whole process got me thinking about how we s... Read this post V By: Vinny Goldsmith October 29, 2007 Slow and Steady SEO Content Marketing Well, the big page rank brouhaha last week caused me to take a good long had look at all of my sites. Not just their PR (relatively unchanged) but their SERPs, objectives and overall long-term strategy.I have a lot of varied interests (boating, real estate, SEO, travel, super heroes, video games, etc. etc.) and I've always felt it was better to have a lot of individual blogs or... Read this post M By: mattm October 2, 2007 Plagiarism - A Case Study Content Marketing As we go through life we invariably at some point run into a chance to or see a case of someone else to plagiarize.Case in point. Just the other day I was checking another Search Marketing site that I read for updates. (gasp! I'm sorry seomoz its just a short fling, it doesn't mean anything) I found out to my dissapointment that his always excellent content had been publish... Read this post V By: Vinny Goldsmith October 1, 2007 Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good Content Marketing Most of us know the basics of long tail searches. I am reminded of this every month when I am checking the statistics on my web sites and I see the wide variety of referring search phrases.On some of my sites, these search phrases are very narrowly defined. Good for me - my content is on target. But the more varied your content, the more varied the resulting search phr... Read this post H By: HollywoodPrince September 18, 2007 Linkbait Within A Non-Tech Niche Content Marketing I have read much of the stuff that you write, and other SEO/SEM folks write, about how to build links, and grow in ranking on Google. One concept that I'm particularly interested in is linkbaiting. I have a problem, however.My blog is in the area of self development, and some other related topics. As you can probably guess, that means that most of my articles are se... Read this post By: Jane Copland September 18, 2007 The Varied Delights of Moderating YOUmoz Content Marketing One of the daily tasks that either myself or Rebecca take care of is moderating YOUmoz submissions. Everyone who has ever submitted a YOUmoz entry will know the process: you compose your piece, hit submit, and wait around for an SEOmoz staff member to publish it. If a piece is original (that is, it doesn't show up in Google when we search for a snippet of its text), is coherent, on-topic and gener... Read this post By: buybigtires September 11, 2007 Passion is the Key Content Marketing Whether in life, SEO, or content generation(for some of us, these have sadly become one and the same) passion is key.I'm sure that all of us have a past teacher or professor that sits on the lid of our mind's eye, and continually stomps around in disgust as we mindlessly churn out \"okay\" content. We rationalize that the keywords all appear in a semi-natural fashion, and... Read this post C By: Carlos del Rio August 30, 2007 WHOmoz: Whatever happened to G-Man and EGOL and 2k.... Content Marketing For those of you who have been following SEOmoz for a while I want to take you on a trip down memory lane -- for those who are new a bit of history. Back before YOUmoz there was a stable of non-staff bloggers including EGOL, 2K, Michael Martinez, Guillaume, and GeoffreyF67 (aka Gman).They made up a strong pool of well-spoken people with very different opinions or perspectives on search optimiza... Read this post K By: Kat French August 24, 2007 When Branding and SEO Collide: A True Fairy Tale Content Marketing Let me spin you a little bedtime story. Once upon a time there was a client who was growing by leaps and bounds. As any smart client should, they decided to do some market research and plan their growth based on reliable data and strategic thinking... Read this post By: Rebecca Kelley August 9, 2007 Dominate the Blogosphere the Wired Way Content Marketing While I was in the Detroit airport earlier this week, I picked up a copy of the current issue of Wired. August's issue focused on a series of \"How To's\", one of them being \"How to Rule the Blogosphere.\" I was interested in reading what tips they had to offer, only to find out that their ... Read this post By: Rand Fishkin August 5, 2007 Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help Content Marketing There are several great sources on the web of \"popular searches\" that help to illustrate the rising trends and consistently buzz-worthy terms and phrases online. These include: Technorati - popular tags & popular searches all on one page Flickr - popular tags Del.icio.us - popular tags Yahoo! Buzz - shows top search terms... Read this post J By: james zolman August 3, 2007 The Origins of Blogging (in Image Form) Content Marketing I stumbled upon this today and I couldn't help myself - I just had to blog it here! ;) ... Read this post By: Rand Fishkin July 30, 2007 You're Wrong, Joel Spolsky & Dave Winer, Blog Comments Have Incredible Value Content Marketing Despite being 10 days old (a lifetime in the blogosphere), I felt obligated to take an alternate position to Joel Spolsky & Dave Winer on the topic of blog comments. Here's Dave: ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "Plan Ahead to Bring Readers Back"
    },
    {
      "level": "H2",
      "text": "Finding Your Niche"
    },
    {
      "level": "H2",
      "text": "Slow and Steady SEO"
    },
    {
      "level": "H2",
      "text": "Plagiarism - A Case Study"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good"
    },
    {
      "level": "H2",
      "text": "Linkbait Within A Non-Tech Niche"
    },
    {
      "level": "H2",
      "text": "The Varied Delights of Moderating YOUmoz"
    },
    {
      "level": "H2",
      "text": "Passion is the Key"
    },
    {
      "level": "H2",
      "text": "WHOmoz: Whatever happened to G-Man and EGOL and 2k...."
    },
    {
      "level": "H2",
      "text": "When Branding and SEO Collide: A True Fairy Tale"
    },
    {
      "level": "H2",
      "text": "Dominate the Blogosphere the Wired Way"
    },
    {
      "level": "H2",
      "text": "Trendspotting with Popular Search Sources & a New Tool from SEOmoz to Help"
    },
    {
      "level": "H2",
      "text": "The Origins of Blogging (in Image Form)"
    },
    {
      "level": "H2",
      "text": "You're Wrong, Joel Spolsky & Dave Winer, Blog Comments Have Incredible Value"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith\n          \n            Vinny Goldsmith\n          \n            mattm\n          \n            Vinny Goldsmith\n          \n            HollywoodPrince\n          \n            Jane Copland\n          \n            buybigtires\n          \n            Carlos del Rio\n          \n            Kat French\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            james zolman\n          \n            Rand Fishkin"
}