{
  "url": "https://moz.com/blog/category/content-marketing/p45",
  "slug": "p45",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "S By: SEMBasics March 27, 2007 How to answer your customers' questions and solve their problems! Content Marketing Let's say that you are finally willing to take the content plunge. That is to say, you've seen the light and are now dedicated to providing your site visitors with the quality content that they need and crave. Let's furthermore say that you read my article 7 Tips for Writing Quality Content&n... Read this post By: Rebecca Kelley March 27, 2007 Kathy Sierra's Unfortunate Situation Content Marketing A few months back I wrote a post about female bloggers, and how I don't get shaken up or outraged about the imbalance between female bloggers and male bloggers in the tech/SEO sphere. For the most part, I still stand by what I wrote, but today I'm going to (sort of) eat my words and talk about Kathy Sierra's unfortun... Read this post By: Rand Fishkin March 21, 2007 Every Site is Linkbait & Linkerati Worthy Content Marketing This week, I've authored several posts on appealing to those folks who provide natural links and those who link due to successful viral marketing campaigns (linkbait): The Secret to Ranking at the Search Engines (on why appealing to link-savvy demographics is imp... Read this post S By: SEMBasics March 21, 2007 7 Tips for Writing Quality Content Content Marketing I hardly need to waste words stating how important it is to come up with quality content for your website. It is, to say the very least, the glue that holds online business together. Provide your visitors with the value that they want and need and you have a chance of succeeding online. On the other hand, if you fail to provide much (if any) value to your website visitors, then you can take sol... Read this post By: Rand Fishkin March 20, 2007 Creating Content that Appeals to a Link-Savvy Audience Content Marketing Yesterday, in my post on the Secret of Search Marketing, I promised to unveil what exactly the \"Linkerati\" want from a website's content. Today, I'll do my best to explain, but first, I need to explain the motivation of the Linkerati and explore their level of influence. Seeing as the word \"Linkerati\" is completely new and invented by yours truly, I feel that I ... Read this post By: Rand Fishkin March 19, 2007 The Secret to Ranking at the Search Engines (that's really no secret at all) Content Marketing How I despise those chessy, awful pages promoting the \"secrets\" of search engine optimization. How I loathe the slick salesman pictured in fuzzy, 1980's-style photography promising you \"the hidden tactics SEOs don't wan't you to know.\" If there is one key to high search engine rankings, a single piece of advice that unlocks the door to the top of Google & Yahoo! it's thi... Read this post By: Rand Fishkin March 15, 2007 Tracking Temporal Trends in Content and Link Growth Content Marketing Since Google released their patent application on historical information way back in March of 2005, search marketers have recognized that trends in temporal link and content analysis do have a real impact on rankings. What isn't quite clear is how this concept functions, and it's the subject of tonight's stay-up-until-2am... Read this post M By: Megan-15336 March 12, 2007 Search Words vs. Company Words: Targeting Long-tail Searches Content Marketing A little over a month ago I wrote about the difference between words people search with and words marketers prefer to use on a website. I came across a good example of this on the Bell Canada site a few days ago. Well, actually, this is a littl... Read this post By: Rand Fishkin March 4, 2007 Blogging in an Oversaturated Market is Usually a Poor Decision Content Marketing If you're a new writer, just entering the blogosphere, you'll find an overwhelming amount of advice telling how to blog, how to monetize your site, what rules to follow for search engines, how to create passionate readers, and how to boost your traffic. One element that's often missing is the all-important subject of what to blog about in the first place. Let me urge you to follow this simple f... Read this post By: Pete Watson-Wailes March 2, 2007 Content Differentiation Content Marketing The recent post on timestamps has created a lot of comments. And it's interesting when you look at them, as to what categories people fall in to. The people who advocate dates and times, and those who'd rather do without them. But behind it, I think there's something more fundamental going on here, and that's what I'm going to try to address. You see... Read this post G By: GeoffreyF67 February 27, 2007 Discover The Secret to Making Obsolete Articles In One Simple Step! Content Marketing Let's take this from the point of view of a normal person who is just wading around the internet looking for something to read on a specific subject. We'll call this guy Bob. Bob heads over to Yahoo (It could be Google or some other search engine) and types in 'how to make waffles'. Here's what he sees: ... Read this post By: Rand Fishkin February 27, 2007 Reasons Why Corporate Blogging Fails Content Marketing The task of corporate blogging encapsulates a plethora of pitfalls. Recently, my consulting work and a number of colleagues have illustrated some of the worst problems plaguing... Read this post I By: IgorMordkovich February 19, 2007 21 Signs That You're a Blogaholic Content Marketing Ok … here is a list that will tell you if you’re a Blogaholic. Just a fun post before we get back to business. So … 21 signs you’re a blogaholic. 1. You’re thinking about naming your kids “Blog” and “Blogriss” 2. At least once, during “intercourse”, you thought... Read this post By: Thomas Schmitz February 15, 2007 Don't Make Me Clink! 5 Reasons You Should Publish Full RSS Feeds Content Marketing Every now and then I see discussions about blogs and whether publishers should show full content, partial content or titles only in their RSS feeds. As someone who uses Google Reader I’ll tell you right now that I would prefer to see your full text in your RSS feed. Remember Steve Krug’s website usability book Don’t Make Me Think? Well, don&r... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "How to answer your customers' questions and solve their problems!"
    },
    {
      "level": "H2",
      "text": "Kathy Sierra's Unfortunate Situation"
    },
    {
      "level": "H2",
      "text": "Every Site is Linkbait & Linkerati Worthy"
    },
    {
      "level": "H2",
      "text": "7 Tips for Writing Quality Content"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Creating Content that Appeals to a Link-Savvy Audience"
    },
    {
      "level": "H2",
      "text": "The Secret to Ranking at the Search Engines (that's really no secret at all)"
    },
    {
      "level": "H2",
      "text": "Tracking Temporal Trends in Content and Link Growth"
    },
    {
      "level": "H2",
      "text": "Search Words vs. Company Words: Targeting Long-tail Searches"
    },
    {
      "level": "H2",
      "text": "Blogging in an Oversaturated Market is Usually a Poor Decision"
    },
    {
      "level": "H2",
      "text": "Content Differentiation"
    },
    {
      "level": "H2",
      "text": "Discover The Secret to Making Obsolete Articles In One Simple Step!"
    },
    {
      "level": "H2",
      "text": "Reasons Why Corporate Blogging Fails"
    },
    {
      "level": "H2",
      "text": "21 Signs That You're a Blogaholic"
    },
    {
      "level": "H2",
      "text": "Don't Make Me Clink! 5 Reasons You Should Publish Full RSS Feeds"
    }
  ],
  "author": "SEMBasics\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            SEMBasics\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Megan-15336\n          \n            Rand Fishkin\n          \n            Pete Watson-Wailes\n          \n            GeoffreyF67\n          \n            Rand Fishkin\n          \n            IgorMordkovich\n          \n            Thomas Schmitz"
}