{
  "url": "https://moz.com/blog/category/content-marketing/p47",
  "slug": "p47",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin October 3, 2006 Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites) Content Marketing With the popularity of sites like Digg, Del.icio.us, Reddit, StumbleUpon & others skyrocketing, website owners, marketers, bloggers and, of course, spammers are seeking to capitalize on the traffic these portals can drive. Many have taken to creating great content in the hopes that the members of these sites will appreciate it, but others have turned to manipulative practices in the hopes o... Read this post By: Rand Fishkin September 14, 2006 Technorati Top 100 - Too Easy to Game? Content Marketing Technorati currently has two Top 100 blog lists - one according to favorites and the other generated based on link popularity. The first measures Technorati users who've marked the blog as a \"favorite;\" as per the screen capture below: ... Read this post By: Rand Fishkin September 12, 2006 Why I Keep Politics Out of A Professional Blog Content Marketing One of the earliest lessons I learned in the forums, blogs & communities of the professional, search marketing sphere was to keep my politics private. It's a sad reality that logical debate and discussion of something critical to our lives must remain sequestered, but the current political environment in the US and in many places abroad prevents rational presentation of fact and opinion on ... Read this post O By: Oatmeal August 17, 2006 Results from our Latest Linkbait Adventure Content Marketing While attending an SES session last week I decided to put together some linkbait. The session itself wasn't particularly interesting and inspiration had struck so I figured I'd make better use of my time and write some kind of guide or howto article. The result was the 5 HTML elements you probably never use blog entry. My original plan ... Read this post By: Rand Fishkin August 15, 2006 Ranking 50 Top Blogs in the Search Space Content Marketing The search & search marketing fields have, over the last 4 years, become overrun with bloggers. It would seem that many of us have been drinking our own Kool-Aid and hopping on the blog bandwagon. Lately, more and more folks have been asking for my take on this trend - what do I read? How often do I visit? Who do I respect? In a controversial move, rather than simply creating a blog... Read this post By: Rand Fishkin July 25, 2006 Technorati's New Favorite Blogs List Content Marketing Along with their recent redesign, Technorati now has a \"most favorited blog list,\" it appears both on the popular page (along with cool data like the most popular online videos, tags, searches and news) and in its own page as a list of the top 100. ... Read this post By: Rand Fishkin July 20, 2006 Top 100 Digg Users Control 56% of Digg's HomePage Content Content Marketing When folks think of Digg, they're often misled into believing that the content seen on the homepage is representative of what a wide base of Internet users think is news-worthy and important. The numbers tell a different story - that of all stories that make it to the front page of Digg, more than 20% come from a select group of 20 users. Digg isn't shy about hiding this fact, their top users p... Read this post By: Rand Fishkin June 14, 2006 Compelling Blogs I've Stumbled On Lately Content Marketing In case you're seeking some inspiration for writing on your own blog or in need of strong examples to point your executive team/marketing director/non-believer business partner to, I thought I'd share a few favorite blogs (outside the webdev/SEO sphere). I've just gone ahead and listed the titles, along with an excerpt: WaiterRant.net... Read this post E By: Ella_D May 31, 2006 Digg-like websites: my French recommendations Content Marketing This is for French readers or French audience, especially in Europe and Quebec. It talks about French digg-like websites. Our blog has hit the first page of major French 2.0 digg-like websites for approximately 28hours now . I think most of our French readers would like to know which s... Read this post E By: Ella_D May 18, 2006 The videoblog industry and SEO - Part 1 Content Marketing Recently, with the success of YouTube, up to 40 videoblog platforms are trying to grasp a part of their marketshare. But what is it all about? The upcoming articles will be trying to identify how the emergence of videoblogging (aka vlogging) can benefit video amateurs and professionals, as well as SEO marketers, journalists and compani... Read this post By: Rand Fishkin May 4, 2006 There Must be a Better Metric for Blog Influence Measurement Content Marketing As I noted early this week, there's a lot to be desired from blog ranking and measurement tools. Technorati's measure of influence via links is the most common method used, followed closely by Alexa data (which can be badly skewed, particularly when the URL is inside a much larger host). At SEOmoz, we used several key indicators... Read this post By: Rand Fishkin May 1, 2006 Tracking Influence in the Blogosphere Content Marketing Let's say I wanted to compare the relative levels of inluence of two bloggers in the same field. Although no method other than direct access to their visitor stats is going to be entirely accurate, there are several pieces of data that can provide a clue as to how \"far and wide\" a blogger's readership extends: Alexa data - though i... Read this post By: Rand Fishkin April 28, 2006 Keotag - A Clever Tag Search Tool Content Marketing Big kudos to Barry Welford who pointed out Keotag at Cre8asite. The site offers a simple search tool for single-word tags (or combinations of them). It allows for direct, quick queries to 17 different \"web 2.0\" type engines (and Google), including Technorati, del.... Read this post M By: mozUser1469147917838 April 25, 2006 The Project: ...There Was Silence - About Google SandBox And Geo-location Issues Content Marketing Note: If you are unaware of The Project topic, please read the previous parts: The project: In the beginning (pt1)So, the ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "Why It Doesn't Pay to Game Digg (or Other Link Aggregation Sites)"
    },
    {
      "level": "H2",
      "text": "Technorati Top 100 - Too Easy to Game?"
    },
    {
      "level": "H2",
      "text": "Why I Keep Politics Out of A Professional Blog"
    },
    {
      "level": "H2",
      "text": "Results from our Latest Linkbait Adventure"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Ranking 50 Top Blogs in the Search Space"
    },
    {
      "level": "H2",
      "text": "Technorati's New Favorite Blogs List"
    },
    {
      "level": "H2",
      "text": "Top 100 Digg Users Control 56% of Digg's HomePage Content"
    },
    {
      "level": "H2",
      "text": "Compelling Blogs I've Stumbled On Lately"
    },
    {
      "level": "H2",
      "text": "Digg-like websites: my French recommendations"
    },
    {
      "level": "H2",
      "text": "The videoblog industry and SEO - Part 1"
    },
    {
      "level": "H2",
      "text": "There Must be a Better Metric for Blog Influence Measurement"
    },
    {
      "level": "H2",
      "text": "Tracking Influence in the Blogosphere"
    },
    {
      "level": "H2",
      "text": "Keotag - A Clever Tag Search Tool"
    },
    {
      "level": "H2",
      "text": "The Project: ...There Was Silence  - About Google SandBox And Geo-location Issues"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Oatmeal\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Ella_D\n          \n            Ella_D\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            mozUser1469147917838"
}