{
  "url": "https://moz.com/blog/category/content-marketing/p48",
  "slug": "p48",
  "title": "Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "M By: mozUser1469147917838 April 8, 2006 The Project: In the Beginning... Content Marketing Like most people in the web industry I got several personal eternity projects waiting for execution. As unlikely as it may seem my recent 3 week sick leave (due to frontal sinusitis) provided me a change to finally tackle a project I had been planning for several years. And since I u... Read this post By: Rand Fishkin April 5, 2006 How to Get Lots of RSS Readers to Click-Through Content Marketing With the popularity of RSS readers skyrocketing (particularly in tech-savvy fields like SEO and webdev), writers in these arenas are realizing how critical it is to have compelling titles and a great first few lines in order to get the RSS subscribers to click-through to the site. This morning, Donna identified one terrific metho... Read this post By: Rand Fishkin March 16, 2006 BlogInfluence Calculations Content Marketing Came across BlogInfluence which purports to give a score to indicate your blog's relative level of importance in the sphere. The rough calculation is based on the number of Technorati and Yahoo! links you've got, added together with Bloglines subscriptions and multiplied by a factor that uses Google's PageRank. It's certainly not a perfe... Read this post By: Rand Fishkin March 9, 2006 BlogBurst Distribution Channels Content Marketing I stumbled onto (yes, literally with the StumbleUpon toolbar) Blogburst today and was relatively impressed with their content partners. The idea is that you submit your blog and the content (if accepted) gets fed to large publishers like the Washington Post, San Francisco Chronicle, Hou... Read this post By: Rand Fishkin November 3, 2005 Teens Dominate Online Content Creation Content Marketing The Pew Internet & American Life Project released a new study yesterday on Teen Content Creators and Consumers (warning PDF). The study has some great information for those of us who have a personal and professional stake in the development of web content. I've pulled out what I feel is the most relevant items for ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Content Marketing"
    },
    {
      "level": "H2",
      "text": "The Project: In the Beginning..."
    },
    {
      "level": "H2",
      "text": "How to Get Lots of RSS Readers to Click-Through"
    },
    {
      "level": "H2",
      "text": "BlogInfluence Calculations"
    },
    {
      "level": "H2",
      "text": "BlogBurst Distribution Channels"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Teens Dominate Online Content Creation"
    }
  ],
  "author": "mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}