{
  "url": "https://moz.com/blog/category/seo-basics/p17",
  "slug": "p17",
  "title": "SEO Basics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rob Ousbey January 10, 2010 Explaining SEO, Role by Role SEO Basics To make a valuable impact, SEO has to be understood by more than just an organisation's search marketers. This post suggests how to explain the concepts, and get buy-in, from different people within an organisation. Read this post By: Dr. Peter J. Meyers January 4, 2010 Are Your SEO Resolutions Actionable? SEO Basics It's that time of year again; the one where we look back on everything we ate during the last two weeks and promise not to do it again in the new year. It's also the time that many of us set new and ambitious goals for our businesses and clients. Unfortunately, while goals are important and ambition can be admirable, we often make the same mistake with our professional resolutions that we do with ... Read this post T By: Tom Critchlow September 7, 2009 How To Integrate SEO Into Your Business SEO Basics One thing that you'll hear over and over again in the SEO industry is \"make sure that you embed SEO in your business\". I know I've said it a lot at conferences and in client meetings but what does it actually mean? Well this post is chock full of tips to help you actually embed SEO in your business. Since I've not long come back from the Seattle SEOmoz Pro Training Seminar (which was tot... Read this post L By: LucyLangdon August 25, 2009 Project Management for SEO SEO Basics Coming up with the right SEO answer is just one part of improving your website's performance online. The strategy you devise then needs implementation and, more often than not, project management. The purpose of this post is to share what I (and a few others) have learned about managing SEO strategies over the years. There isn't much hardcore SEO though- I suggest you take a look at this if you want some of that! Read this post L By: LucyLangdon June 22, 2009 How You Can Use SEOmoz in your Sales Process SEO Basics The aim of this post is to describe a few of the ways SEO agencies (or, indeed, in-house SEO's looking for more budget from the boss) can use SEOmoz to pitch and close SEO projects. We use SEOmoz at several different stages in our sales process. Pre Sales A customer rings up and says 'I want to rank first page for bicycle shop'. While t... Read this post By: Rishi Lakhani May 6, 2009 Small Business SEO: Starting with the Right Success Metrics SEO Basics It’s been a while since I put together a Small Business SEO post. I thought it’s high time I tackled another key issue facing small businesses – deciding whether their SEO activity is progressing or not. SEO, and indeed SEM, is a unique marketing channel. It is quantifiable, responsive and flexible to an extent which I would argue other channels aren’t. However, that is my personal opinion. And the way in which I rate SEM successes is different, not unique certainly, but definitely different. Read this post D By: Duncan Morris December 11, 2008 The Exact Science of Hindsight and How This Helps in SEO SEO Basics Over the last few months I've found myself doing slightly less SEO, and in its place I've been thinking about how we can improve the SEO services we offer our clients. SEOs, I've found, tend to be quite a creative bunch, both in the type of work that gets done but also in the way that the work gets done. One of the joys of being in SEO is that the tasks that need to be done and the best way of doing these tasks is permanently evolving. The creative urges mean that often when asked to do two similar tasks a week apart, the tasks are done in a completely different way. From a job satisfaction and creativity point of view, this is fantastic; starting from scratch each time on a task means the creative juices can really flow. From a management and consistency point of view, re-inventing the wheel each time is a nightmare! Read this post D By: Duncan Morris October 10, 2008 Interviewing for SEO Jobs SEO Basics | Marketing Industry Earlier this year Rand did a white board friday talking about how to get an seo job. A couple of years ago Rebecca covered the SEOmoz hiring process, with a full re-cap of how Jane became a 'mozzer. Read this post By: Rishi Lakhani October 9, 2008 Small Business SEO: It's About Education and Empowerment SEO Basics There has been a spate of posts recently that talk about spammy SEO agencies offering guarantees, trying to con webm... Read this post By: Rand Fishkin September 30, 2008 Headsmacking Tip #8: Give Your SEO Campaigns Time to Take Effect SEO Basics It's been a few weeks since I last posted a headsmacker, but this topic has been begging for some exposure. Recently we've worked with some fellow SEOs who've felt the harsh constraint of overly eager, impatient management. They're campaigns followed solid tactics, stuck to best practices and even... Read this post D By: Duncan Morris September 16, 2008 The 3 Cornerstones of SEO SEO Basics For the first time in a while I was let out of the office and sent to a Sales meeting. For as long as we have been running the company the typical stereotypes of coder vs salesman have been applied to Will. Taken to extremes people think that I can't string a sentence together and Will doesn't know how to turn a computer on. At sales meetings Will likes to talk in terms of the foll... Read this post By: Rand Fishkin May 12, 2008 Do I Really Need to Build Web Access to My Service? SEO Basics Yes, whiny title writer, you most certainly do. Check out this piece from the AP on PapaJohns.com: The nation's third-largest pizza delivery chain trumpeted the $1 billion milestone Wednesday, noting that its U.S. online sales have been growing at an average clip of more than 50 percent per year. In 2001, the chain's online sales totaled $20.4 million. Last year, its online sale... Read this post By: Rand Fishkin April 1, 2008 I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO SEO Basics Ever since SEOmoz took venture capital investment last fall, I've been reading a lot of blogs and sites geared towards the startup world. Even though we've been around for 5 years (and Gillian and I have been doing web marketing for 10), I still think of us very much like a startup - we've grown from 3 people 3 years ago to 14 people today and we're worrying about things like burn rate, product... Read this post By: Rishi Lakhani March 5, 2008 SEO SWOT Analysis -- Revisiting Marketing Models SEO Basics I work with mostly small independent sites with little or next to nothing budgets and help them turn things around if possible. My biggest success story was a client who had 1 or 2 patients a week through word of mouth, and then grew to an average of 50 referrals through online marketing monthly, as well as a huge established practice. I cant take all the credit – he worked hard at... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Basics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Basics"
    },
    {
      "level": "H2",
      "text": "Explaining SEO, Role by Role"
    },
    {
      "level": "H2",
      "text": "Are Your SEO Resolutions Actionable?"
    },
    {
      "level": "H2",
      "text": "How To Integrate SEO Into Your Business"
    },
    {
      "level": "H2",
      "text": "Project Management for SEO"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How You Can Use SEOmoz in your Sales Process"
    },
    {
      "level": "H2",
      "text": "Small Business SEO:  Starting with the Right Success Metrics"
    },
    {
      "level": "H2",
      "text": "The Exact Science of Hindsight and How This Helps in SEO"
    },
    {
      "level": "H2",
      "text": "Interviewing for SEO Jobs"
    },
    {
      "level": "H2",
      "text": "Small Business SEO: It's About Education and Empowerment"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #8: Give Your SEO Campaigns Time to Take Effect"
    },
    {
      "level": "H2",
      "text": "The 3 Cornerstones of SEO"
    },
    {
      "level": "H2",
      "text": "Do I Really Need to Build Web Access to My Service?"
    },
    {
      "level": "H2",
      "text": "I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO"
    },
    {
      "level": "H2",
      "text": "SEO SWOT Analysis -- Revisiting Marketing Models"
    }
  ],
  "author": "Rob Ousbey\n          \n            Dr. Peter J. Meyers\n          \n            Tom Critchlow\n          \n            LucyLangdon\n          \n            LucyLangdon\n          \n            Rishi Lakhani\n          \n            Duncan Morris\n          \n            Duncan Morris\n          \n            Rishi Lakhani\n          \n            Rand Fishkin\n          \n            Duncan Morris\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rishi Lakhani"
}