{
  "url": "https://moz.com/blog/category/seo-basics/p6",
  "slug": "p6",
  "title": "SEO Basics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Bridget Randolph September 11, 2017 The Beginner’s Guide to Structured Data for SEO: How to Implement It SEO Basics | Technical SEO Learn to identify opportunities and implement structured data for SEO on your website. This guide focuses on the most basic types of markup and the most common use cases, plus resources to help with the more technical aspects of implementation. Read this post By: Bridget Randolph September 6, 2017 The Beginner's Guide to Structured Data for SEO: A Two-Part Series SEO Basics | Technical SEO SEOs have been talking about structured data for a few years now, but only 17% of marketers are using it. There's still a lot of confusion around what structured data is, what it’s for, and how and when to implement structured data for SEO purposes. Read this post By: Jen Carney August 2, 2017 Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger Reach Content Marketing | SEO Basics | Social Media You've spend too much time and effort on content creation to share it only once. Check out 4 smart strategies you can implement today to improve the reach of your existing content. Read this post By: Rand Fishkin July 28, 2017 5 Tactics to Earn Links Without Having to Directly Ask Link Building | Whiteboard Friday | SEO Basics Stop bumming out journalists, bloggers, and content creators by begging for links. Try out some of Rand's tactics in this Whiteboard Friday to earn those links without the painful ask (and low success rate). Read this post By: Bridget Randolph July 19, 2017 \"SEO Is Always Changing\"... Or Is It?: Debunking the Myth and Getting Back to Basics SEO Basics We're so fond of the idea that SEO is hard because it's always changing. But is that really true? Bridget Randolph challenges a common industry refrain and brings us back to the basics of what's really important in our work. Read this post By: Brian Childs July 17, 2017 SEO for Copywriters: Tips on Measuring SEO Impact - Next Level Content Marketing | SEO Analytics | SEO Basics Learn how to use Google Analytics to track and measure the SEO impact of your content efforts. Read this post By: Russ Jones June 26, 2017 Paint by Numbers: Using Data to Produce Great Content Content Marketing | SEO Basics | Blogging It happens to the best of us. Sometimes it is hard to find that inspiration for writing even though we feel a drive to produce more and better content to push marketing numbers. Sometimes we should stand back and let the numbers do the writing for us. Read this post By: Brian Childs June 15, 2017 How to Target Multiple Keywords with One Page - Next Level Keyword Research | SEO Tools | SEO Basics In this edition of our educational Next Level series, you'll learn an easy workflow for researching and targeting multiple keywords on one page. Read on and level up! Read this post By: Bill Sebald June 14, 2017 How to Build SEO Strategies Effectively (and Make Them Last) SEO Basics With all the obstacles of everyday SEO work, how can you build a strategy that lasts? Bill Sebald shares 5 considerations every strategy requires, how to map your course, and how to reset your frame of mind to do your best work in 2017. Read this post By: Rand Fishkin June 2, 2017 Ranking Fluctuations: What to Expect + How to React SEO Basics | Whiteboard Friday Rankings fluctuations can be panic-inducing, but they happen to everyone. In this Whiteboard Friday, Rand discusses why ranking fluctuations occur, the importance of keeping your cool during those darker moments, and how to identify when you should actually be concerned. Read this post By: Jo Cameron May 17, 2017 Tasty SEO Report Recipes to Save Time & Add Value for Clients [Next Level] SEO Reporting | SEO Tools | SEO Basics By the end of this article you’ll know how to whip up intelligent SEO reports for your clients (or potential clients) that will deliver actionable insights any search chef worth their salt would be proud of. Jo Cameron combines basic metrics and a few culinary metaphors to take your client reporting to the next level. Read this post By: Simon Penson April 5, 2017 Constant Content: The Silver Bullet for Failing Content Marketing Strategy Content Marketing | Marketing Industry | SEO Basics The State of Content Marketing Survey told us that 92% of marketers don't have a clear plan for content marketing. The only answer: the constant content approach. Read this post By: Rand Fishkin March 31, 2017 Minimum Viable SEO: If You Only Have a Few Minutes Each Week... Do This! SEO Basics | Whiteboard Friday You know SEO is important, but you barely have time for lunch, much less keyword research. In this Whiteboard Friday, Rand covers a minimum viable SEO strategy to give those with limited time a plan forward. Read this post By: Brian Childs March 16, 2017 Giving Away the Farm: Proposal Development for New SEO Agencies SEO Basics By developing an approach that feels less like a sales process, you can build client trust, avoid unrealistic expectations, decrease contract churn, and more. Learn why offering a little extra during the client proposal could net you bigger gains in the long run. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Basics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Basics"
    },
    {
      "level": "H2",
      "text": "The Beginner’s Guide to Structured Data for SEO: How to Implement It"
    },
    {
      "level": "H2",
      "text": "The Beginner's Guide to Structured Data for SEO: A Two-Part Series"
    },
    {
      "level": "H2",
      "text": "Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger Reach"
    },
    {
      "level": "H2",
      "text": "5 Tactics to Earn Links Without Having to Directly Ask"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "\"SEO Is Always Changing\"... Or Is It?: Debunking the Myth and Getting Back to Basics"
    },
    {
      "level": "H2",
      "text": "SEO for Copywriters: Tips on Measuring SEO Impact - Next Level"
    },
    {
      "level": "H2",
      "text": "Paint by Numbers: Using Data to Produce Great Content"
    },
    {
      "level": "H2",
      "text": "How to Target Multiple Keywords with One Page - Next Level"
    },
    {
      "level": "H2",
      "text": "How to Build SEO Strategies Effectively (and Make Them Last)"
    },
    {
      "level": "H2",
      "text": "Ranking Fluctuations: What to Expect + How to React"
    },
    {
      "level": "H2",
      "text": "Tasty SEO Report Recipes to Save Time & Add Value for Clients [Next Level]"
    },
    {
      "level": "H2",
      "text": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Minimum Viable SEO: If You Only Have a Few Minutes Each Week... Do This!"
    },
    {
      "level": "H2",
      "text": "Giving Away the Farm: Proposal Development for New SEO Agencies"
    }
  ],
  "author": "Bridget Randolph\n          \n            Bridget Randolph\n          \n            Jen Carney\n          \n            Rand Fishkin\n          \n            Bridget Randolph\n          \n            Brian Childs\n          \n            Russ Jones\n          \n            Brian Childs\n          \n            Bill Sebald\n          \n            Rand Fishkin\n          \n            Jo Cameron\n          \n            Simon Penson\n          \n            Rand Fishkin\n          \n            Brian Childs"
}