{
  "url": "https://moz.com/blog/category/seo-basics/p7",
  "slug": "p7",
  "title": "SEO Basics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Felicia Crawford March 16, 2017 Your Daily SEO Fix: Link Building & Ranking Zero Link Building | Moz Tools | SEO Basics In Week 2 of our limited edition Daily SEO Fix video series, we explore all things link building — plus how to find and track your keywords that are ripe for a SERP feature opportunity. Read this post By: Felicia Crawford March 9, 2017 Your Daily SEO Fix: The Keyword Research Edition Keyword Research | Moz Tools | SEO Basics You have SEO quandaries, we have tools to solve them. Check out four quick videos (starring real, live Mozzers!) designed to help you level up your skills and get the most out of both our free and paid tools. Read this post By: Maryna Samokhina February 20, 2017 Strategic SEO Decisions to Make Before Website Design and Build SEO Basics | Technical SEO | Design Asking the right SEO questions before you build a site sets you up for success later on. Check out the most important considerations to make before going all-in with a new website. Read this post By: Sean Martin February 16, 2017 How We Increased Our Email Response Rate from ~8% to 34% Email Marketing | SEO Basics | Blogging Are you wasting time with inefficient outreach emails that get ignored? By testing three tweaks to an existing template, the folks at Directive Consulting were able to more than triple their reply rate and win more guest posting opportunities. Read this post By: Brian Childs February 15, 2017 Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz SEO Basics | Moz Tools | Advanced SEO We're now offering more targeted, in-depth SEO classes for beginner and intermediate marketers. If you need a leg up learning the rules of the SEO game, be sure to check out our revamped courses. Read this post By: Alexis Sanders February 9, 2017 A Guide to JSON-LD for Beginners Technical SEO | SEO Basics Structured data is a must-have for many sites, but it can be hard to get a handle on the technical considerations. Learn the important basics of JSON-LD and how to ramp up your education as you apply it. Read this post By: Daniel Marks February 7, 2017 3 Not-So-SEO-Friendly Trends to Watch Out For SEO Basics | Marketing Industry | Advanced SEO The constant refrain of \"SEO is dead!\" gets old pretty quickly, but there are some real and present threats to the industry we should be aware of. Daniel Marks describes the trends in question and gives some advice on how to prepare for the uncertain future. Read this post By: Kane Jamison January 25, 2017 Easy Marketing Investments to Improve Your E-Commerce Store E-Commerce SEO | SEO Basics | Conversion Rate Optimization (CRO) Learn the best ways to invest time and money into an e-commerce site with a few small-scale investments that can help drive performance on conversions, SEO, and more. Read this post By: Zee Hoffmann Jones January 2, 2017 How to Delegate SEO Work Effectively SEO Basics Feeling swamped or overwhelmed by your projects? Learn tools and tips on project management, organization, and delegation to keep your clients happy and your head clear. Read this post By: Jo Cameron December 27, 2016 Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level SEO Basics | Content Marketing | Keyword Research SERP features are your insight into what content Google thinks best serves the needs of searchers for any given keyword. Learn how to target and win them with this follow-along educational workflow. Read this post By: Rand Fishkin December 9, 2016 The 10 Types of Content That Work Best for SEO Content Marketing | Whiteboard Friday | SEO Basics After analyzing hundreds of SERPs, Rand has identified and classified the 10 distinct content types that work best for SEO. In this Whiteboard Friday, he explains those types and how to use them effectively in your content marketing strategy. Read this post By: Alexis Sanders November 14, 2016 What Is Semantic Search and What Should You Do About It? Keyword Research | SEO Basics Semantic search is the present and future, and it's important to have a good handle on what it is and how you can use it to your advantage. This post presents 5 strategies for getting started with semantic SEO. Read this post By: Ronell Smith November 8, 2016 5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love Content Marketing | SEO Basics If your brand is struggling to get a handle on what content to create next, it's time to take that concern off the table by learning how to produce content the audience craves. Read this post By: Rand Fishkin November 4, 2016 How Can Small Businesses/Websites Compete with Big Players in SEO? Advanced SEO | Whiteboard Friday | SEO Basics It may seem like an uphill battle to compete with big sites in the SERPs, but there are tangible SEO benefits to running a smaller site. In this Whiteboard Friday, Rand explains how small sites can target opportunities the big sites can't, despite their natural advantages. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Basics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Basics"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Link Building & Ranking Zero"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: The Keyword Research Edition"
    },
    {
      "level": "H2",
      "text": "Strategic SEO Decisions to Make Before Website Design and Build"
    },
    {
      "level": "H2",
      "text": "How We Increased Our Email Response Rate from ~8% to 34%"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz"
    },
    {
      "level": "H2",
      "text": "A Guide to JSON-LD for Beginners"
    },
    {
      "level": "H2",
      "text": "3 Not-So-SEO-Friendly Trends to Watch Out For"
    },
    {
      "level": "H2",
      "text": "Easy Marketing Investments to Improve Your E-Commerce Store"
    },
    {
      "level": "H2",
      "text": "How to Delegate SEO Work Effectively"
    },
    {
      "level": "H2",
      "text": "Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level"
    },
    {
      "level": "H2",
      "text": "The 10 Types of Content That Work Best for SEO"
    },
    {
      "level": "H2",
      "text": "What Is Semantic Search and What Should You Do About It?"
    },
    {
      "level": "H2",
      "text": "5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love"
    },
    {
      "level": "H2",
      "text": "How Can Small Businesses/Websites Compete with Big Players in SEO?"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Maryna Samokhina\n          \n            Sean Martin\n          \n            Brian Childs\n          \n            Alexis Sanders\n          \n            Daniel Marks\n          \n            Kane Jamison\n          \n            Zee Hoffmann Jones\n          \n            Jo Cameron\n          \n            Rand Fishkin\n          \n            Alexis Sanders\n          \n            Ronell Smith\n          \n            Rand Fishkin"
}