{
  "url": "https://moz.com/blog/category/seo-basics/p9",
  "slug": "p9",
  "title": "SEO Basics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Ben Newton July 21, 2016 Architecting a Unicorn: SEO & IA at Envato (A Podcast by True North) SEO Basics | User Experience (UX) Today, we're bringing you something just a little different. In this podcast episode, True North explores the rocky relationship between SEO, information architecture, and entrepreneurship for one hugely successful online business. Read this post By: Kaitlin McMichael July 19, 2016 The 15 Most Popular Myths About International SEO, Debunked International SEO | Advanced SEO | SEO Basics If you've been hesitant to start on a global site strategy, the obstacle standing in your way may be nothing more than a myth. Kaitlin McMichael explains the most common misconceptions in international SEO and what you really need to do to harness the power of the international market. Read this post By: Rand Fishkin July 15, 2016 How to Choose a Domain Name SEO Basics | Whiteboard Friday How to choose a domain name: make it brandable, pronounceable, short, intuitive, bias to .com, avoid names that infringe on another company, use broad keywords, and if not available, modify. Read this post By: Katy De Leon June 28, 2016 6 Mistakes to Avoid When Setting up and Using Google Analytics SEO Analytics | SEO Tools | SEO Basics Are you getting the most out of your Google Analytics data? If not, isn't it time you changed that? Read this post By: George Freitag June 17, 2016 Why Listing Accuracy is Important Local SEO | Whiteboard Friday | SEO Basics Whether you manage a single local listing or hundreds, the consistency of your NAP data across the web can make or break your business. With answers for just about everyone, Moz Local's George Freitag stars in this week's Whiteboard Friday covering all the boons and secrets of listing accuracy (give him a warm welcome, folks!). Read this post By: Bill Sebald June 8, 2016 Revisiting Digital Marketing Cornerstones: 140-Character Tips from Marketers Advanced SEO | Marketing Industry | SEO Basics Digital marketing should never feel like grunt work, but it's a rut we've all fallen into. The best remedy? Getting inspired. Snap out of it with the best SEO, client management, and marketing advice you can get, all in 140 characters or less. Read this post By: Angela Petteys May 11, 2016 Everything You Need to Know About Using Yoast SEO for Wordpress SEO Basics | SEO Tools If you have a self-hosted Wordpress site, you'll want to bookmark this guide. Angela Petteys outlines everything you'll need to know about setting up and optimizing the Yoast SEO plugin to get your site search engine-friendly. Read this post By: Purna Virji May 5, 2016 How Voice Search Will Change Digital Marketing — For the Better Keyword Research | Advanced SEO | SEO Basics Voice search is poised to create a seismic shift in our industry. Purna Virji is here to answer three huge questions: who's using voice search, how is it different from text queries, and how can you prepare? Read this post By: Garrett Mehrguth May 4, 2016 10 Free Online Marketing Tools Every Small Business Owner Needs SEO Tools | Advanced SEO | SEO Basics May 1st–7th is Small Business Week! In honor of small businesses everywhere, Garrett Mehrguth's put together a list of free SEO tools that will bolster your online marketing efforts without whittling away your budget. Read this post By: Dan Shure May 4, 2016 An Exploration of Podcasting SEO in 2016 Content Marketing | SEO Basics SEO is everywhere you look. In today's post, Dan Shure dives headfirst into the world of SEO for podcasting, exploring the surprising similarities and differences in ranking for iTunes and uncovering his journey in launching an SEO-oriented podcast. Read this post By: Serge Stefoglo May 2, 2016 The Start-to-Finish Guide to Optimizing Your WordPress Blog Posts [Plus a Checklist] SEO Basics | Blogging Sooner or later, you'll be faced with using WordPress to create blog posts. Sergey Stefoglo goes through the ins and outs of uploading and optimizing posts with the Yoast SEO plugin for WordPress, offering a downloadable checklist to help make sure you've hit all the marks. Read this post By: Rand Fishkin April 29, 2016 8 Old School SEO Practices That Are No Longer Effective Advanced SEO | Whiteboard Friday | SEO Basics Are you guilty of living in the past? Using methods that were once tried-and-true can be alluring, but it can also prove dangerous to your search strategy. In today's Whiteboard Friday, Rand spells out eight old school SEO practices that you should ditch in favor of more effective and modern alternatives. Read this post By: Kristina Kledzik April 21, 2016 How Long Do Backlinks Take to Show Effect? Link Building | SEO Reporting | SEO Basics The eternal question: How much time does it take for a link to affect rankings? Kristina Kledzik breaks out the entire process from start to finish. Read this post By: Rand Fishkin April 8, 2016 How to Make the SEO Case to Small Businesses SEO Basics | Whiteboard Friday | SEO Consulting Belief in the process can be the make-or-break factor when it comes to convincing small businesses they need SEO. Overcoming skepticism can be daunting, but there are strategic ways to go about pitching your case to potential clients that will smooth the way for you. In today's Whiteboard Friday, Rand covers a 5-step process to making the SEO case to those small and medium businesses that need a little extra push to help you help them. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Basics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Basics"
    },
    {
      "level": "H2",
      "text": "Architecting a Unicorn: SEO & IA at Envato (A Podcast by True North)"
    },
    {
      "level": "H2",
      "text": "The 15 Most Popular Myths About International SEO, Debunked"
    },
    {
      "level": "H2",
      "text": "How to Choose a Domain Name"
    },
    {
      "level": "H2",
      "text": "6 Mistakes to Avoid When Setting up and Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Why Listing Accuracy is Important"
    },
    {
      "level": "H2",
      "text": "Revisiting Digital Marketing Cornerstones: 140-Character Tips from Marketers"
    },
    {
      "level": "H2",
      "text": "Everything You Need to Know About Using Yoast SEO for Wordpress"
    },
    {
      "level": "H2",
      "text": "How Voice Search Will Change Digital Marketing — For the Better"
    },
    {
      "level": "H2",
      "text": "10 Free Online Marketing Tools Every Small Business Owner Needs"
    },
    {
      "level": "H2",
      "text": "An Exploration of Podcasting SEO in 2016"
    },
    {
      "level": "H2",
      "text": "The Start-to-Finish Guide to Optimizing Your WordPress Blog Posts [Plus a Checklist]"
    },
    {
      "level": "H2",
      "text": "8 Old School SEO Practices That Are No Longer Effective"
    },
    {
      "level": "H2",
      "text": "How Long Do Backlinks Take to Show Effect?"
    },
    {
      "level": "H2",
      "text": "How to Make the SEO Case to Small Businesses"
    }
  ],
  "author": "Ben Newton\n          \n            Kaitlin McMichael\n          \n            Rand Fishkin\n          \n            Katy De Leon\n          \n            George Freitag\n          \n            Bill Sebald\n          \n            Angela Petteys\n          \n            Purna Virji\n          \n            Garrett Mehrguth\n          \n            Dan Shure\n          \n            Serge Stefoglo\n          \n            Rand Fishkin\n          \n            Kristina Kledzik\n          \n            Rand Fishkin"
}