{
  "url": "https://ahrefs.com/blog/es/algoritmo-busqueda-google/",
  "slug": "algoritmo-busqueda-google",
  "title": "Cómo funciona el algoritmo de búsqueda de Google",
  "description": "El algoritmo de búsqueda de Google es fácilmente una de las tecnologías más influyentes jamás creadas. Pero, ¿qué es y cómo funciona",
  "content": "Bill Widmer Viviendo como nómada digital más de 8 años. Bill tiene una misión de viajar por el mundo y ganarse la vida utilizando el SEO y el marketing de contenidos. Contenido El algoritmo de búsqueda de Google es posiblemente una de las tecnologías más influyentes jamás creadas. Con unas 5.600 millones de búsqueda en Google al día, podemos afirmar con seguridad que Google tiene un gran impacto en el mundo; y en tu negocio.Pero, ¿qué es el algoritmo de búsqueda de Google? ¿Cómo funciona? Y, lo más importante, ¿cómo puedes posicionarte mejor en Google y conseguir más tráfico?Esta guía trata de desmitificar el misterioso algoritmo de búsqueda de Google:¿Qué es el algoritmo de búsqueda de Google?¿Cómo funciona el algoritmo de búsqueda de Google?¿Cuáles son los factores de posicionamiento del algoritmo de búsqueda de Google?Una nota sobre los algoritmos de búsqueda de GoogleDónde encontrar las actualizaciones oficiales de Google¿Qué es el algoritmo de búsqueda de Google?El algoritmo de búsqueda de Google Search se refiere al proceso que Google usa para ordenar el contenido. Tiene en cuenta cientos de factores, incluyendo las menciones de las palabras clave, la usabilidad y los backlinks.Nota al margen. Google tiene varios algoritmos de búsqueda que trabajan juntos para devolver los mejores resultados. En este artículo vamos a poner foco sobre todo en los algoritmos de posicionamiento de Google, porque pensamos que es a lo que la mayor parte de la gente se refiere cuando hablan del algoritmo de búsqueda de Google.¿Cómo funciona el algoritmo de búsqueda de Google?El algoritmo de Google es extremadamente complejo y su funcionamiento exacto no es información pública. Se cree que hay bastante más de 200 factores de posicionamiento; y nadie los conoce todos.Incluso aunque los conocieran, no importaría, porque el algoritmo siempre cambia constantemente. Google lanza actualizaciones de su algoritmo, de media, seis veces al día. Eso son hasta 2.000 veces al año.Dicho esto, Google da pistas sobre cómo posicionar bien en sus resultados.¿Cuáles son los factores de posicionamiento del algoritmo de búsqueda de Google?Cuando piensas en un “algoritmo de búsqueda”— en lo que se refiere a SEO (search engine optimization, optimización para motores de búsqueda)—lo primero que te viene a la cabeza son probablemente los factores de posicionamiento de Google. En otras palabras, ¿en qué se fija Google a la hora de decidir qué páginas posicionar y en qué orden?Si nos fijamos en la página “Cómo funciona la Búsqueda” de Google veremos que revela directamente algunos de los factores de posicionamiento más importantes de Google: EnlacesNovedadMenciones de keywordsExperiencia de usuarioAutoridad temáticaVamos a verlos por partes.1. EnlacesGoogle quiere mostrar páginas donde “sitios web de renombre en el tema [estén] enlazando a la página”. Dicho en otras palabras, quiere ver enlaces de sitios con autoridad (que también son relevantes en el tema) apuntando a tus páginas.Conseguir estos enlaces es lo que se conoce como link building, y quizá sea una de las tareas más importantes que deberías hacer para que Google confíe en tu sitio y lo enseñe. Este ha sido constantemente el factor más decisivo para Google a la hora de determinar la fiabilidad de un sitio desde su concepción en 1996.Puedes ver si los enlaces están limitando que tu contenido se posicione comparando tu perfil de enlaces con el de tus competidores.En primer lugar, introduce la URL la página que intentas posicionar en el Explorador de Sitios de Ahrefs y verás cuántos enlaces y dominios de referencia (sitios webs que enlazan) tiene actualmente tu página.Después, ve al Explorador de palabras clave e introduce la palabra clave principal a la que estás apuntando con esa página. Haz scroll. Encontrarás la sección “Resumen de página de resultado” (SERP), donde podrás ver cuántos backlinks y dominios de referencia tienen tus competidores.Si ves que las páginas de tus competidores tienen más enlaces que la tuya (como nos pasa a nosotros en el ejemplo de arriba), quiere decir que probablemente tengas que priorizar el conseguir enlaces para posicionar por encima de ellos.Aquí van algunas estrategias para empezar con el link building:Guest blogging (autor invitado)Crear activos enlazablesLink building aprovechando enlaces rotosPRO TIPSi quieres profundizar más en la comprensión del panorama de enlaces de tus palabras clave objetivo y el tipo de enlaces que necesitas para posicionar, revisa los dominios que enlazan a todos tus competidores, excepto a ti. Para hacer esto, introduce los tres competidores mejor posicionados en tu palabra clave objetivo en la herramienta Link Intersect (intersección de enlaces) y tu página en “Pero no enlazan a”, así:Cuando pulses en “Mostrar oportunidades de enlace” verás todos los sitios que enlazan a las páginas de tus competidores, pero no a la tuya. Estos son los primeros sitios a los que puedes contactar para conseguir enlaces.2. NovedadLa novedad del contenido se refiere a cuán “nuevo”, o reciente, es el contenido de tu página web. ¿Cuándo fue la última vez que se actualizó?Este factor importa más en unas búsquedas que en otras. Por ejemplo, si buscas algo relacionado con noticias, Google normalmente posicionará resultados publicados en las últimas 24 horas.Sin embargo, si buscas un tema que no tiene que actualizarse con tanta frecuencia, la novedad no tiene un peso tan influyente. Por ejemplo, los resultados mejor posicionados de “cómo organizar almacenamiento autocaravana” son de hace dos o tres años: Esto es porque las buenas ideas para organizar el espacio en una autocaravana son más o menos las mismas ahora que hace dos o tres años. Así que la novedad de la publicación no tiene mucho impacto. Las guías como esta es lo que llamamos “contenido evergreen”. Es decir, contenido que estará en buen estado en los próximos años sin necesitar actualizaciones frecuentes.En general, al determinar la importancia de la novedad en las palabras clave que estás atacando, deberías siempre analizar la SERP de las mismas. ¿Parece que el contenido que está mostrando Google es novedoso? Si es así, necesitarás actualizar el contenido con frecuencia para tener alguna posibilidad de permanecer en las primeras posiciones.3. Menciones de palabras claveUna de las cosas por las que Google se preocupa es “el número de veces que tu término de búsqueda aparece [en la página que intentas posicionar]”.En general, es una buena práctica intentar incluir tu palabra clave exacta en la página varias veces en distintos lugares, incluyendo:El título.Al menos un subtítulo.La URL de la página.El párrafo de introducción.Dicho esto, no pensamos que necesites preocuparte por incluir la keyword más allá de eso. De forma natural vas a mencionar la palabra clave que quieres posicionar a lo largo del contenido, ya que es el tema sobre el que estás escribiendo.Por ejemplo, nuestro post sobre contenido evergreen menciona las palabras “evergreen content” 18 veces; no nos esforzamos nada para conseguir esto.En su lugar, presta más atención para asegurarte de que tu página cumple la intención de búsqueda y responde a lo que el usuario busca. En otras palabras, asegúrate de que has cubierto todo lo que los usuarios pueden querer saber.Google subraya la importancia de esto en su página “Cómo Funciona la Búsqueda”:Por ejemplo, si buscas “perros”, seguramente no querrás ver una página que contenga la palabra “perros” cientos de veces; por eso los algoritmos determinan si las páginas incluyen contenido relevante aparte de esa palabra, como imágenes o vídeos de perros, o incluso una lista de razas.Una forma de hacer esto es usar la herramienta de Ahrefs Content Gap, para buscar subtemas de una palabra clave dada que deberías mencionar en tu página. Introduce tu sitio en el Explorador de Sitios y ve a “Content Gap” en el menú de la izquierda.Después, ve a Google, busca la palabra clave a la que te diriges con tu página y recoge los 3 ó 5 primeros resultados que tengan la misma intención de tu página (por ejemplo, si tu página es un post de un blog, elige otros posts de blogs).Una vez que tengas las URLs de tus competidores, introdúcelas en la herramienta como hice en la captura de pantalla de abajo, y después pulsa en “Mostrar palabras clave”.Hice esto mismo con nuestra guía “¿Qué son las palabras clave?”. En la captura de abajo, el resultado nos dice que podemos mejorar el artículo añadiendo alguna sección como con ejemplos:O usando el término “palabra(s) clave” en lugar de su nombre en inglés:Además, al usar este tipo de investigación “brecha de contenidos” o content gap, puedes encontrar oportunidades para otros artículos relacionados con el que ya estás optimizando. Podríamos encontrar palabras clave como “mejores prácticas palabras clave seo” o “que es keyword research”.Si quieres aprender más sobre cómo optimizar una página para una palabra clave y dónde ubicarla, revisa nuestra guía de SEO on-page.4. Experiencia de usuarioGoogle afirma que se preocupa de “si la página tiene una buena experiencia de usuario”. Pero, ¿qué se considera una buena experiencia de usuario?La experiencia de usuario (UX, de su nombre en inglés, user experience) engloba muchas cosas, incluyendo: Velocidad de carga de la página (Google recomienda menos de dos segundos)Que no haya intersticiales intrusivos, como anuncios y pop-ups.Navegación intuitiva y enlaces internosAdaptación a móvilDiseño web Meta etiquetas (tener un título meta y una descripción que se alineen con la intención de búsqueda)Y másLa velocidad, en concreto, se ha vuelto más importante para Google en los últimos años. En el verano de 2021 Google lanzó una actualización importante. Por eso, ahora es más importante pasar el test de de las Core Web Vitals (métricas web principales en español), que en esencia es un test de velocidad.Puedes revisar tu CWV y aprender a mejorar el rendimiento de tu sitio introduciendo tu web en Site Audit de Ahrefs, haciendo clic en la pestaña de “Performance Report” (informe de rendimiento). Tendrás que activar el escaneo de CWV en la configuración (verás un aviso como este al principio del informe, como puedes ver en la imagen de abajo).Una vez que hayas dado permiso al CWV con la API de Google, realiza un nuevo escaneo en tu sitio. Cuando esté hecho, recibirás un informe mostrando las páginas que necesitan mejorar y las páginas con errores.Para ver estas páginas, haz clic en el número que se muestra al lado de “Needs improvement” (necesita mejorar) o “Poor” (pobre). Te mostrará qué páginas no pasan la puntuación de Lighthouse o el rendimiento de CrUX (son puntuaciones de velocidad de página parte del informe de CWV).Si quieres aprender más sobre cómo optimizar tu sitio para una mejor experiencia de usuario, sigue nuestra guía de auditoría de sitios web.5. Autoridad temáticaGoogle quiere mostrar “sitios que muchos usuarios ven cómo valiosos para búsquedas parecidas”. Esto se refiere a sitios que tienen contenido adicional, de valor, sobre búsquedas relevantes respecto a lo que ya se está buscando.Aunque Google no es explícito sobre lo que quiere decir “los usuarios parecen valorar”, podemos asumir con seguridad que los enlaces temáticos son una parte de esto. Así que además de crear mucho contenido relacionado, necesitas conseguir enlaces de sitios relevantes sobre la misma temática.Por ejemplo, si queremos posicionarnos en “mejor proteína en polvo”, es más probable que Google te posicione si los usuarios también vienen a tu sitio en busca de contenido sobre temas como:El mejor momento del día para consumir proteína en polvo¿Pueden las mujeres embarazadas tomar proteína en polvo?¿De dónde viene la proteína en polvo?Además de tener contenido sobre estos temas, también deberías conseguir enlaces temáticamente relevantes.Tener mucho contenido relacionado y enlaces contextualmente relevantes pueden mostrarle a Google (y a sus usuarios) que eres una autoridad en ese tema y puede ayudarte a posicionar mejor en los resultados de búsqueda. Claro, estamos asumiendo que también optimizas los otros factores de posicionamiento.¿Listo para tachar este factor de posicionamiento de tu lista? Empieza a crear content hubs para SEO.Una nota sobre los algoritmos de búsqueda de GoogleGoogle actualiza su algoritmo casi cada día, y lanza actualizaciones principales de dos a tres veces al año que pueden tener un gran impacto en los rankings.En otras palabras, las cosas cambian. Es importante permanecer al día de los factores de posicionamiento de Google para no quedarte atrás en las SERPs por una penalización de Google o un cambio en la intención de búsqueda.Algunas de las actualizaciones principales de Google incluyen:Actualización de interstitials intrusivos Cambio a la indexación “mobile-first” (También llamado “Mobilegeddon”)RankBrainPandaPenguinHummingbirdPigeonPor supuesto, esto no es una lista detallada. Echa un vistazo a nuestro diccionario SEO para una lista completa de las actualizaciones de Google y otros términos comunes de SEO o a nuestra página con el historial de actualizaciones del algoritmo de Google.Dónde encontrar las actualizaciones oficiales de GoogleGoogle tiene varios canales que lanzan actualizaciones públicas sobre cambios en su algoritmo y tiene mucha documentación pública sobre cómo funciona su algoritmo.Aquí van algunos recursos muy útiles para estar al día de lo que hace Google:Artículo sobre cómo funciona el algoritmo de búsqueda de GoogleCuenta oficial de Google en TwitterEl canal de YouTube de Google Search CentralSi quieres estar al tanto de la última información de lo que Google hace con su algoritmo, también ofrece sesiones de consulta habituales, llamadas Google Search Central. Ahí, personas como John Mueller, el analista senior de tendencias web, responderá tus preguntas en directo.Reflexiones finalesEl algoritmo de búsqueda de Google es un tema complejo con muchos elementos cambiantes en constante evolución. Pero su objetivo de devolver los mejores resultados para búsqueda concreta es algo permanente.A pesar de las muchas actualizaciones de Google, los fundamentos del SEO no han cambiado mucho desde el nacimiento de los motores de búsqueda. Si te enfocas en los factores de posicionamiento que has aprendido en este artículo, serás capaz de posicionarte en las páginas de resultados.En resumen:Crea contenido de alta calidad, con un buen formato, que se alinee con la intención de búsqueda de tus palabras clave.Mantén tu contenido actualizado.Asegúrate de que tu sitio tenga una buena experiencia de usuario.Consigue enlaces relevantes en la temática.Estas son las cosas que le importan al algoritmo de búsqueda de Google, según Google. ¿Listo para profundizar más? Revisa estos otros artículos en el blog de Ahrefs:Cómo posicionar mejor en Google (en 6 sencillos pasos)SEO básico: guía para pincipiantes para el éxito en SEO12 buenas prácticas de posicionamiento que todo el mundo debería seguir¿Alguna duda o comentario sobre el algoritmo de búsqueda de Google? Pregúntanos lo que quieras por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo funciona el algoritmo de búsqueda de Google"
    },
    {
      "level": "H2",
      "text": "¿Qué es el algoritmo de búsqueda de Google?"
    },
    {
      "level": "H2",
      "text": "¿Cómo funciona el algoritmo de búsqueda de Google?"
    },
    {
      "level": "H2",
      "text": "¿Cuáles son los factores de posicionamiento del algoritmo de búsqueda de Google?"
    },
    {
      "level": "H3",
      "text": "1. Enlaces"
    },
    {
      "level": "H3",
      "text": "2. Novedad"
    },
    {
      "level": "H3",
      "text": "3. Menciones de palabras clave"
    },
    {
      "level": "H3",
      "text": "4. Experiencia de usuario"
    },
    {
      "level": "H3",
      "text": "5. Autoridad temática"
    },
    {
      "level": "H2",
      "text": "Una nota sobre los algoritmos de búsqueda de Google"
    },
    {
      "level": "H2",
      "text": "Dónde encontrar las actualizaciones oficiales de Google"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Bill Widmer"
}