{
  "url": "https://ahrefs.com/blog/es/analisis-palabras-clave-seo/",
  "slug": "analisis-palabras-clave-seo",
  "title": "Análisis de palabras clave para SEO: cómo decidir si merecen la pena",
  "description": "No puedes depender solo de palabras clave con mucho volumen: hay mucho más por explorar.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Si eliges las palabras clave solo en base a su volumen de búsqueda te estás equivocando. También tienes que considerar si la keyword tiene sentido para tu empresa y si es realista que consigas posicionarte.Este es el proceso:Vamos a ver los cuatros pasos en más detalle.Contenido1. ¿Me traerá suficiente tráfico?La gente suele confiar en el volumen de búsqueda para esto, pero puede ser engañoso.Por ejemplo, “ají de gallina” se busca unas 5.900 veces al mes en España. Pero la página mejor posicionada recibe bastante menos tráfico:Es justo lo contrario que pasa con “frases inspiradoras”. La página mejor posicionada recibe unas 37.000 visitas, mientras que la palabra clave arroja unas 7.700 búsquedas al mes. Estas son algunas de las razones por las que puede pasar:¿Cuál es la solución?Usa la página mejor posicionada como una aproximación del potencial de tráfico, en lugar de los volúmenes de búsqueda.Si eres usuario de Ahrefs, la métrica de Tráfico potencial (TP) en Keywords Explorer te da este dato. Incluso puedes ordenar y filtrar ideas de keywords por TP para asegurarte de que pones el foco en palabras clave que es probable que te lleven un tráfico decente.Si no eres usuario de Ahrefs, introduce la URL de una página que esté en el primer puesto en nuestro Comprobador de tráfico de sitio web:TIP: REVISA LA TENDENCIA DEL VOLUMEN DE BÚSQUEDASi el interés en el tema está cayendo, puede que no llegues ni de cerca al tráfico de la página que actualmente está en el puesto número uno para cuando quieras posicionarte. Puedes comprobar esto en Keywords Explorer o Google Trends.Por ejemplo, Keywords Explorer muestra que las búsquedas de “cómo funciona wordle” están cayendo:Algo que tiene su eco en Google Trends:2. ¿Puedo ofrecer a los usuarios lo que quieren?Google quiere posicionar el tipo de contenido que los usuarios buscan. A menos que puedas crearlo, tus posibilidades de posicionarte en la primera página son prácticamente nulas.Aquí tienes cinco tipos de contenido habituales y los recursos que necesitarás para crearlos:¿Cómo sabes lo que buscan las personas?La respuesta es bastante obvia en algunas palabras clave. Por ejemplo, la gente que busca “calculadora de préstamos” está claro que lo que quieren es una herramienta interactiva, mientras que los que buscan “comprar homepod mini” quieren una página de producto.Si en tu palabra clave no queda tan claro, los resultados de la primera página suelen dibujar una imagen relativamente clara.Por ejemplo, todos los resultados de la primera página de “días entre fechas” son calculadoras interactivas:Esto quiere decir que a menos que tengas acceso a equipos de desarrollo y diseño, no puedes crear lo que quieren los usuarios y te costará mucho posicionarte.Por otro lado, la mayoría de resultados de la primera página de “diferencia entre dos fechas excel” son sobre todo posts de blogs y algunos vídeos:Esto quiere decir que todo lo que necesitas es un redactor que pueda crear el tipo de contenido que quieren los usuarios o grabar un tutorial en vídeo.TIP: SIEMPRE OBTEN RESULTADOS DE BÚSQUEDA NO PERSONALIZADOSGoogle personaliza los resultados de búsqueda de muchas formas, así que siempre deberías analizar los resultados de la primera página en modo incógnito. También es mejor que hagas la búsqueda desde la ubicación desde donde quieres posicionarte, ya que esto también puede influir en los resultados. Algunas formas de hacerlo:Usa una VPNUsa la barra de herramientas SEO de AhrefsUsa Keywords Explorer de AhrefsSi usas nuestra barra de herramientas SEO, haz clic en el icono de extensión en tu navegador, activa “SERP tools” (herramientas de la página de resultados) y elige una ubicación en la sección “Local search simulator” (simulador de búsqueda local).Si usas Keywords Explorer de Ahrefs, elige un país del menú desplegable.3. ¿La palabra clave tiene sentido para mi empresa?Si te posicionaras en el tipo de contenido que buscan los usuarios, ¿tendría algún valor para ti?La forma más habitual de responder a esto es mapear las palabras clave según el buyer’s journey, viaje del comprador o trayecto del comprador.La idea es sencilla: en las fases iniciales del trayecto del consumidor es menos probable que compre tu producto o servicio (por lo que esa palabra clave te resulta menos valiosa).Aquí tienes un ejemplo aplicado a nuestra empresa:Este modelo está bien, pero tiene algunos fallos, como Tim Soulo cubre en su guía de keyword research.Por eso, hemos desarrollado nuestro propio modelo para determinar el llamado “valor” de una keyword. Se llama potencial comercial o potencial de negocio y puntúa las palabras clave entre el 0 y el 3, en función de lo fácil que es presentar tu producto o servicio en tu contenido.Aquí tienes un ejemplo para nuestro caso en Ahrefs:El modelo que más te guste depende de ti, simplemente asegúrate de tener la intención de búsqueda en cuenta cuando juzgues el valor de una palabra clave.4. ¿Tiene sentido pensar que conseguiré posicionarme en esta palabra clave?Algunas palabras clave son más difíciles que otras.Aquí van tres preguntas para saber qué probabilidad hay de que posiciones en una palabra clave.A. ¿Cuántos enlaces necesito?Los enlaces son uno de los principales factores de posicionamiento para Google. Esto quiere decir que si compites contra páginas que ya tienen muchos enlaces, necesitarás conseguir muchos enlaces a tu página; y es difícil.Para hacerte una idea general de cuántos enlaces necesitarás para posicionar, revisa el texto que incluimos debajo de la puntuación de dificultad de palabra clave (KD) en Keywords Explorer de Ahrefs (o usa nuestro Comprobador de dificultad de palabras clave).Sin embargo, hay dos advertencias importantes respecto a este número:Estima cuántos enlaces necesitas para posicionarte entre los 10 primeros resultados, no en el primero. Probablemente necesitarás al menos todos estos enlaces de alta calidad, quizá más, para llegar al primer puesto.No tiene la calidad de los enlaces en cuenta. Algunos enlaces pueden emitir “votos” más fuertes que otros. Si las páginas mejor posicionadas tienen muchos enlaces de baja calidad o mediocres, probablemente no necesites tantos enlaces de alta calidad para posicionarte entre los 10 primeros resultados.Para hacerte una idea mejor de cuántos enlaces buenos necesitas, tendrás que auditar el perfil de enlaces de las páginas mejor posicionadas.Aquí tienes un buen punto de entrada, cortesía de Glen Allsopp, fundador de Detailed.com:Typical day as an SEO. “Damn…first result has 500 referring domains.” Exclude nofollowed links: 450 RDExclude .blogspot links: 335 RDExclude .pl & .ru links: 290 RDExclude scraper sites: 250 RDExclude ‘directory’: 215 RDText links only: 185 RD“Not too bad”.— Glen Allsopp 👾 (@ViperChill) May 1, 2018Típico día como SEO. “Maldita sea… El primer resultado tiene 500 dominios de referencia.”Excluir enlaces nofollow: 450 dominiosExcluir enlaces .blogspot: 335 dominiosExcluir enlaces .pl y .ru: 290 dominiosExcluir enlaces de sitios de scrapping: 250 dominiosExcluir “directorios”: 215 dominiosEnlaces de solo texto: 185 dominios Por ejemplo, Keywords Explorer nos dice que la página mejor posicionada en “social media analytics” tiene enlaces de más de 3.300 dominios. Pero si introducimos la URL en Site Explorer de Ahrefs, revisamos el informe de enlaces y aplicamos los filtros de Glen (junto a un par más para excluir enlaces de dominios de poca autoridad sin tráfico), ese número baja un 86%, a 462. En este caso, siguen siendo muchos enlaces, pero puedes ver cómo estos filtros podrían hacer que algunas palabras clave pasaran de “nunca conseguiré tantos enlaces” a “creo que puedo conseguirlos”.B. ¿Cuánta “autoridad” tienen las webs en los resultados de búsqueda?Google ha negado sistemáticamente el uso de cualquier métrica de autoridad web en sus algoritmos de búsqueda. A pesar de eso, cuando Tim encuestó a su audiencia de SEO en Twitter, casi dos terceras partes dijeron que sí tenían en cuenta alguna medida de autoridad al analizar sus posibilidades de posicionarse en una palabra clave.Do you pay attention to Domain Rating (or any other “website authority” metric) when analysing your chances to rank for a given keyword?— Tim Soulo 🇺🇦 (@timsoulo) April 27, 2022Si quieres hacer lo mismo, echa un vistazo a la columna de DR (Domain Rating, clasificación de dominio) en la columna de Keywords Explorer. Si las páginas mejor posicionadas tienen un DR similar al tuyo o inferior (usa Site Explorer o comprobador de “autoridad” de sitios web gratuito para verlo), es una buena señal. Si sus puntuaciones de DR son muy superiores, puede que su elevada autoridad les esté ayudando indirectamente a posicionarse por un par de razones:Hacen más PR (relaciones públicas)Las webs de autoridad alta cuentan con muchas páginas de alta autoridad. Si tienen muchos enlaces internos apuntando desde esas páginas a la que tú ves que se posiciona en tu palabra clave objetivo, puede que eso sea en parte por lo que se posiciona tan bien.Son marcas más conocidasA veces la gente quiere ver resultados de marcas conocidas, por lo que es probable que los algoritmos de Google tengan esto en cuenta, directa o indirectamente. Probablemente sea en parte por esto por lo que ves a grandes marcas como Mercadona o Carrefour posicionándose en algunos términos de búsqueda, incluso con pocos enlaces. TIP: ENCUENTRA PALABRAS CLAVE DONDE SITIOS SIMILARES POSICIONANAquí tienes cómo encontrar palabras clave donde al menos una web con un DR igual o inferior al tuyo se posicione entre los cinco primeros resultados:Introduce un tema en Keywords Explorer.Ve al informe de Términos que concuerdan.Introduce el DR de tu web en el filtro “DR más bajo” y elige “In top 5” del menú desplegable. C. ¿Qué calidad tiene el contenido?Incluso aunque puedas crear el tipo de contenido que buscan los usuarios con relativa facilidad, derrotar a la competencia en calidad puede que no sea fácil.Esto es importante, ya que los algoritmos de Google están diseñados para destacar las páginas que demuestren E-E-A-T, que son las siglas en inglés de experience (experiencia, en el sentido de contar con experiencia de primera mano) expertise (conocimiento, pericia, capacidades), authoritativeness (autoridad), y trust (confianza).Aquí tienes lo que significa cada una:Experience (experiencia): ¿Tienes experiencia de primera mano en el tema?Expertise (conocimiento): ¿Tienes los conocimientos o pericia necesarios en el tema?Authoritativeness (autoridad): ¿Se te reconoce como la fuente a la que acudir en el tema?Trust (confianza): ¿es la página segura, precisa, honesta y fiable?En resumen, cuanto mayor sea la puntuación de las páginas mejor posicionadas en lo que respecta a estas variables, más difícil será crear contenido que tenga alguna posibilidad de desbancarlas.Por ejemplo, los tres primeros resultados de “bulto en el cuello” están escritos o revisados por personal sanitario: Estas también son probablemente fuentes de referencia sobre información de condiciones médicas.Como resultado, a menos que seas un médico y tu web tenga una reputación parecida, no serás capaz de demostrar un nivel cercano de E-E-A-T en tu contenido.Sin embargo, si miras los resultados de una palabra clave como “mejores proyectores de menos de 300 euros” resulta bastante obvio por el uso de imágenes de stock que los autores no tienen experiencia de primera mano con ninguno de los productos que recomiendan:Esto sería mucho más fácil de mejorar en lo que respecta a la calidad. Solo necesitas demostrar experiencia de primera mano.Reflexiones finalesNo siempre merece la pena tratar de posicionarse en palabras clave que te puedan generar muchísimo tráfico. También deben tener sentido para tu empresa y tú necesitas ofrecer a los usuarios la versión con mayor calidad de lo que están buscando para tener una oportunidad.¿Alguna pregunta? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Análisis de palabras clave para SEO: cómo decidir si merecen la pena"
    },
    {
      "level": "H2",
      "text": "1. ¿Me traerá suficiente tráfico?"
    },
    {
      "level": "H2",
      "text": "2. ¿Puedo ofrecer a los usuarios lo que quieren?"
    },
    {
      "level": "H2",
      "text": "3. ¿La palabra clave tiene sentido para mi empresa?"
    },
    {
      "level": "H2",
      "text": "4. ¿Tiene sentido pensar que conseguiré posicionarme en esta palabra clave?"
    },
    {
      "level": "H3",
      "text": "A. ¿Cuántos enlaces necesito?"
    },
    {
      "level": "H3",
      "text": "B. ¿Cuánta “autoridad” tienen las webs en los resultados de búsqueda?"
    },
    {
      "level": "H4",
      "text": "Hacen más PR (relaciones públicas)"
    },
    {
      "level": "H4",
      "text": "Son marcas más conocidas"
    },
    {
      "level": "H3",
      "text": "C. ¿Qué calidad tiene el contenido?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}