{
  "url": "https://ahrefs.com/blog/es/aprender-seo/",
  "slug": "aprender-seo",
  "title": "Cómo aprender SEO (Hoja de ruta completa)",
  "description": "Aprender SEO puede ser abrumador. Pero con un poco de tiempo, esfuerzo y la hoja de ruta adecuada, es algo que cualquiera puede aprender.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Aprender SEO puede parecer abrumador. Es un tema complejo, y el sector está plagado de información. Pero con un poco de tiempo y la hoja de ruta adecuada, es algo que cualquier persona puede aprender.Esta es la hoja de ruta que vamos a cubrir en esta guía:Vamos allá.Aprende los fundamentos del SEOPon tu conocimiento en prácticaProfundiza tu conocimiento SEOPermanece al díaEnseña a otras personas lo que sabes1. Aprende los fundamentos del SEOSi no estás familiarizado con las bases del SEO es por aquí por donde deberías empezar. En concreto, necesitas entender cómo funcionan los motores de búsqueda y cuáles son las cuatro facetas principales del SEO. Vamos a verlas rápidamente.Cómo funcionan los motores de búsquedaLos motores de búsqueda funcionan encontrando contenido y guardándolo en un índice (index) enorme. Después usan procesos complejos, también conocidos como algoritmos de búsqueda, para ordenar el contenido a partir de su índice cuando el usuario realiza una búsqueda. En otras palabras, cuando buscas algo en Google, no estás buscando en toda la web; estás buscando en el índice de Google.Esto quiere decir que si Google no puede encontrar e indexar tu contenido, no puedes posicionar, porque no estás indexado.Google construye su índice a partir de dos fuentes principales: Sitemaps o mapas del sitio: Un sitemap es un archivo que incluye todas las páginas importantes de tu sitio web que quieres que los motores de búsqueda indexen. Puedes enviar tu sitemap a Google para avisarle de que tu página existe. Enlaces de páginas web conocidas: Google ya tiene miles de millones de páginas en su índice. Si una de estas páginas te enlaza, Google puede “seguir” el enlace para descubrir tu página.Ten en cuenta que Google también puede descubrir páginas nuevas en tu sitio web al “seguir” enlaces de páginas conocidas en tu web.Por ejemplo, si Google ya tiene tu página principal en su índice, puedes enlazar internamente a posts nuevos publicados en tu blog desde ahí. Google debería ser capaz de “seguir” estos enlaces para descubrir los posts nuevos que hayas publicado en tu blog.Aprende más: ¿Cómo funcionan los motores de búsqueda? Una guía para principiantesKeyword researchKeyword research o investigación de palabras clave es el proceso de descubrir qué buscan tus clientes. Es importante porque no serás encontrado si las personas no buscan las palabras clave a las que apuntas.Ya que Google no tiene esta información accesible, la mejor forma de encontrar las palabras clave es con una herramienta de keyword research como el Explorador de palabras clave de Ahrefs. Para usarlo, introduce uno o varios temas relacionados con tu sector, pulsa en buscar y ve a uno de los informes de ideas de palabras clave. Verás los volúmenes de búsqueda mensuales de palabras clave y algunas otras métricas SEO.En el Explorador de palabras clave, también mostramos la métrica de “Potencial de tráfico” para cada palabra clave. Es una estimación de cuánto tráfico recibe la página mejor posicionada en esa palabra clave, que normalmente es un buen indicador de cuánto tráfico puedes recibir al conseguir la primera posición.Como las páginas suelen posicionarse por más de una palabra clave, el “Potencial de tráfico” suele ofrecer una estimación más precisa del potencial de una palabra clave que su volumen de búsqueda.Aprende más: Cómo hacer investigación de palabras clave para SEOSEO On-pageEl SEO On-page consiste en optimizar el contenido de tu página para posicionar más alto en los motores de búsqueda. Tiene mucho que ver con entender lo que los usuarios quieren y dárselo; es un proceso conocido como optimizar para la intención de búsqueda.Por ejemplo, si miramos los primeros resultados de la palabra clave “mejor proteína en polvo” vemos que todos son artículos que comparan las mejores selecciones:Esto nos indica que aunque los usuarios están buscando proteína en polvo, todavía están valorando sus opciones y no están listos para comprar. Por eso sería difícil posicionar un página de producto de un e-commerce en esta búsqueda. No es lo que quieren los usuarios.Aprende más: SEO On-Page: guía completa para principiantesLink buildingEl link building es el proceso de conseguir enlaces de otras webs a la tuya. Es importante porque los enlaces son uno de los tres principales factores de posicionamiento de Google.Probablemente por eso existe una clara correlación entre las webs que te enlazan y el tráfico orgánico.Sin embargo, no todos los enlaces son iguales. Los enlaces de sitios web de alta calidad normalmente tienen más impacto que los enlaces de sitios web irrelevantes y de poca calidad. En otras palabras, si tu web habla de Bitcoin, un enlace de un sitio web sobre criptomonedas probablemente impactará de forma más positiva en el posicionamiento que el de un sitio de viajes.Conseguir enlaces de alta calidad a tu web es probablemente uno de los aspectos más desafiantes del SEO y una de las habilidades más demandadas en SEO.Aprende más: La guía para principiantes al link buildingSEO técnicoEl SEO técnico se asegura de que los motores de búsqueda como Google puedan encontrar, rastrear e indexar tu contenido. A menos que puedan hacer estas tres cosas, es improbable que tus páginas aparezcan en los resultados de búsqueda.Vamos a echar un vistazo a estas tres cosas más en detalle. Encontrar: en primer lugar Google necesita saber que tu página existe y dónde encontrarla. Rastrear: Google ahora necesita permiso para rastrear la página. Es aquí donde un programa informático descarga el contenido de la página. Indexar: Google necesita permiso para añadir tu página a su índice.Puedes resolver la primera parte del proceso al asegurarte de que tu página tiene enlaces de otras páginas conocidas en tu sitio web y que está en un sitemap que has enviado a Google.En lo que respecta a rastrear e indexar, necesitas asegurarte de que no estás bloqueando a Google para que haga alguna de estas cosas. Esto se hace usando un archivo llamado robots.txt (rastreo), y una meta etiqueta o meta tag llamada meta robots (indexación).Aprende más: La guía para principiantes al SEO técnico2. Pon tu conocimiento en prácticaAquí va una cita acertada:Saber la teoría del SEO es una cosa; aplicar ese conocimiento para posicionar una web es otra cosa completamente distinta. Aprenderás más sobre SEO en las trincheras que de ninguna otra forma.Will Critchlow, CEO SearchPilotPor ejemplo, cuando estaba empezando en SEO, creé un sitio web de bodybuilding, ya que en aquellos tiempos estaba interesado en el tema. En primer lugar, me aseguré de que mi SEO técnico estaba en su sitio y que Google pudiera encontrar, rastrear e indexar todo el contenido que publicaba. Después hice algo de keyword research para encontrar temas sobre los que escribir. Después de eso, empecé a publicar contenido optimizado.Este es el primer post que publiqué en agosto de 2012:Finalmente, conseguí algunos enlaces.Aquí va uno de los enlaces que conseguí con un post invitado (sigue activo todavía… ¡10 años después!)Este sitio web acabó funcionando bastante bien, lo que validó que la teoría SEO que había aprendido tenía sentido. Sin embargo, también cometí algunos errores. Por ejemplo, recuerdo en concreto que el posicionamiento de una página se desplomó después de que decidiera reescribir el texto sin ningún motivo concreto. Esto me enseñó una lección valiosa que no había aprendido en ninguna otra parte: si no está roto, ¡no lo toques!3. Profundiza tu conocimiento SEOEs imposible aprender absolutamente todo sobre cada aspecto del SEO. El tema es demasiado amplio. Así que una vez que has pasado el tiempo suficiente en las trincheras y aprendido qué aspectos de SEO disfrutas, es hora de que elijas algún nicho y profundices tu conocimiento en un área.Esto es lo que se conoce como SEO tipo T.Ser un SEO tipo T significa que tienes un conocimiento amplio de todo el SEO, pero destacas en un área particular. El área en que elijas especializarte debería ser aquel que se te dé mejor y más disfrutes.En mi caso se trata del link building; por eso he escrito gran parte de nuestro contenido sobre este tema.Aquí van unos pocos ejemplos más de SEOs tipo T:Patrick Stox: SEO técnicoNick Eubanks: Keyword researchJon Cooper: Link buildingMarie Haynes: Recuperación de penalizaciones de GoogleAleysa Solís: SEO internacional.Juan González Villa: SEO para ecommerce.Álvaro Peña: experto en Link building.¿Te has fijado en que la especialidad de Marie Haynes es híper concreta? En lugar de elegir una faceta amplia del SEO (como keyword research o link building) ha decidido especializarse en el nicho de la recuperación de penalizaciones de Google. Como resultado de esto, probablemente no hay ningún SEO en el mundo que sepa más sobre este tema que Marie.Ir a por algo tan concreto como esto es una buena idea si estás aprendiendo SEO para convertirte en un experto SEO bajo demanda. Pero si lo que buscas es posicionar sitios web, probablemente sea mejor mantener las cosas algo más generales y quedarte con una de las cuatro facetas principales del SEO.En cualquier caso, siempre deberías probar lo que aprendas en tu sitio web. Ahí es donde ocurre el aprendizaje real.4. Permanece al díaA pesar de lo que muchas personas digan, los fundamentos del SEO apenas cambian. Pero los pequeños detalles están cambiando constantemente. Hay actualizaciones de Google varias veces al año, cambios en cómo los motores de búsqueda gestionan aspectos del SEO técnico, gente lista a la que se le ocurren nuevas tácticas, etc.Con esto en mente, aunque no deberías pasarte todo el día leyendo noticias de SEO, es importante que te mantengas al día.Aquí tienes unas pocas formas de hacerlo:Ve a eventos y meetups de SEOEl SEO es un sector enorme con grandes conferencias. Por ejemplo, BrightonSEO atrae a más de 4.000 personas, SEOntheBeach, que se celebra en la Manga, reúne a cientos de personas y agota sus entradas meses antes de su celebración. Hay varios encuentros más pequeños, que puedes encontrar en meetup.com, como este de mi ciudad o este en Madrid. Todos estos son sitios donde personas con intereses comunes que hacen SEO comparten conocimiento y tácticas, así que hay mucho que se puede aprender al involucrarse.Aprende más: 8 eventos (online y offline) a los que asistirEscucha podcasts sobre SEOLos podcasters a menudo entrevistan a SEOs para hablar de sus éxitos, fallos y experiencias, lo que convierte a los podcasts en una gran forma de estar al día sobre la marcha. Por ejemplo, en este episodio del podcast de Authority Hacker, la maestra del link building Bibi comparte su aproximación creativa a los emails de outreach para enlaces. O, en español, también existen podcast de gran calidad, como Campamento Web o SEO desde cero.Aprende más: 15 podcasts para mejorar tu SEOÚnete a grupos de Facebook de SEOFacebook tiene una actividad de SEOs que siempre están dispuestos a responder preguntas y ofrecer consejos si los necesitas. De hecho, nuestro grupo, Ahrefs Insider, tiene casi 17.000 miembros y es muy activo.Aprende más: Los 4 mejores grupos de Facebook para SEOs (más votados)Únete a comunidades SEO en SlackSi prefieres no distraerte con Facebook, puedes unirte a una comunidad SEO en Slack. Algunas son gratis, mientras que otras cobran una suscripción mensual. Traffic Think Tank (TTT), es un grupo en inglés que puede ser una buena opción si estás abierto a las comunidades de pago.Aprende más: 11 comunidades en Slack para SEOs y profesionales del marketing digitalLee blogs de SEO… Como el que estás leyendo ahora mismo, en el que publicamos ideas únicas, procesos y estudios. Por ejemplo, cuando Google cambió la forma en que genera los títulos de las SERP, pasando a usar menos las etiquetas de título, estudiamos casi un millón de páginas y publicamos los resultados para la comunidad.Aprende más: 29 blogs maravillosos de SEO que seguir (puntuados y ordenados)Ver vídeos en YouTube sobre SEO… Como nuestro canal de YouTube (tanto en español, como en inglés), donde publicamos contenido parecido al de nuestro blog. Fuentes oficialesGoogle publica actualizaciones oficiales del algoritmo y anuncios en el Blog del Centro de la Búsqueda y ofrece sesiones semanales de preguntas y respuestas en su canal de YouTube, en inglés. También puedes seguir a los representantes de búsqueda, como John Mueller y Gary Illyes en Twitter.Lee noticias SEOAlgunos de los medios de noticias SEO más relevantes publican en inglés. Como Search Engine Roundtable, que se describe a sí misma como el pulso del marketing de búsqueda y publica actualizaciones en todo lo relacionado con la búsqueda. Search Engine Land y Search Engine Journal también publican noticias de forma frecuente. Si no se te da bien el inglés siempre puedes echar un vistazo al blog de USEO∂, que tiene una de las mejores newsletters en español sobre SEO.5. Enseña a otras personas lo que sabes (opcional)Mira de nuevo la hoja de ruta y verás una recomendación para que compartas lo que aprendes con otras personas.Puede parecer contraintuitivo, ya que quieres aprender más sobre SEO, pero en mi opinión, enseñar a otras personas me ayuda a retener y asimilar el conocimiento. Lo creo porque me fuerza a articular las cosas, lo que a menudo me lleva a la conclusión de que no sé tanto como pensaba.Aunque puedes hacer esto en público en un blog o canal de YouTube, también puedes hacerlo de forma semi privada (en grupos y comunidades) o privada (mensajes directos, cara a cara).Si no tienes la piel muy fina, hacer esto en público suele ofrecer una línea adicional de defensa frente a la desinformación, ya que las personas suelen ser lo bastante amables como para señalar cuando te equivocas.Por ejemplo, aquí puedes ver a Bill Slawski señalando algo incorrecto en uno de mis artículos en Twitter: Probablemente Google no posiciona las páginas en función de la precisión del contenido. Danny Sullivan lo admitió en Google y el post mío que señalas tampoco dice eso.Esto me lleva a un punto importante…No trates de enseñar a otros SEOs a menos que una de estas cosas sea cierta:Has investigado y entendido a fondo lo que estás enseñando.Estás enseñando algo basándote en experiencia y pruebas personales (y has dejado esto claro).Lo último que debes hacer es contribuir a la desinformación de un sector en el que ya hay demasiados conocimientos equivocados.Reflexiones finalesEl famoso psicólogo K. Anders Ericsson teorizó que aprender una nueva habilidad lleva 10.000 horas de práctica. Seguro que tendrás un buen conocimiento de SEO en ese tiempo, pero la verdad es que nunca paras de aprender. He estado involucrado en SEO durante más de 11 años y aprendo cosas nuevas todo el tiempo.Pero recuerda, aprender no es solo leer y retener información. También hay que poner en práctica lo que lees, probar las cosas por tu cuenta y encontrar formas de mejorar las creencias populares a lo largo del tiempo.¿Alguna duda? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo aprender SEO (Hoja de ruta completa)"
    },
    {
      "level": "H2",
      "text": "1. Aprende los fundamentos del SEO"
    },
    {
      "level": "H3",
      "text": "Cómo funcionan los motores de búsqueda"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H3",
      "text": "SEO On-page"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H3",
      "text": "SEO técnico"
    },
    {
      "level": "H2",
      "text": "2. Pon tu conocimiento en práctica"
    },
    {
      "level": "H2",
      "text": "3. Profundiza tu conocimiento SEO"
    },
    {
      "level": "H2",
      "text": "4. Permanece al día"
    },
    {
      "level": "H3",
      "text": "Ve a eventos y meetups de SEO"
    },
    {
      "level": "H3",
      "text": "Escucha podcasts sobre SEO"
    },
    {
      "level": "H3",
      "text": "Únete a grupos de Facebook de SEO"
    },
    {
      "level": "H3",
      "text": "Únete a comunidades SEO en Slack"
    },
    {
      "level": "H3",
      "text": "Lee blogs de SEO"
    },
    {
      "level": "H3",
      "text": "Ver vídeos en YouTube sobre SEO"
    },
    {
      "level": "H3",
      "text": "Fuentes oficiales"
    },
    {
      "level": "H3",
      "text": "Lee noticias SEO"
    },
    {
      "level": "H2",
      "text": "5. Enseña a otras personas lo que sabes (opcional)"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}