{
  "url": "https://ahrefs.com/blog/es/branded-content/",
  "slug": "branded-content",
  "title": "Branded content: guía completa con ejemplos",
  "description": "Guía completa de branded content con ejemplos y un método para que puedas llevar tu proyecto al siguiente nivel.",
  "content": "Iván Fanego Iván Fanego es CEO y fundador de AppCritic, el servicio especializado que ayuda a empresas a posicionarse, crecer y desarrollar a sus clientes con una mezcla agnóstica de Estrategia y Marketing de Contenidos, Construcción de Relaciones y Automatización. Contenido Existen varias definiciones de lo que es el branded content, pero explicado de forma sencilla, consiste en llevar a cabo acciones de marketing y comunicación que buscan conectar con el público objetivo de una marca, transmitiendo sus valores y aportando valor en forma de entretenimiento o información útil.El branded content lleva más de 100 años entre los profesionales del marketing. A veces lo confundimos con otras técnicas, a veces lo ignoramos y, a veces, lo disfrutamos sin saber que se trata de “contenido de marca”.En este artículo vamos a ver qué es, por qué es importante, en qué se diferencia de otras técnicas y disciplinas de marketing y comunicación y algunos ejemplos realmente notables. Hablaremos de los orígenes y de su futuro y te daremos algunas pistas sobre cómo enfocar una acción de branded content.Cuando acabes de leer tendrás mucho más claro qué es y qué no es, pero también te dejaremos con algunas dudas, porque, como estás a punto de comprobar, existen ciertas áreas grises donde las cosas no están tan claras.Pero de eso se trata. Buscamos traspasar fronteras y adentrarnos en la intersección entre arte, ciencia… y marketing, comunicación y publicidad.Empecemos por el principio.Qué es el Branded ContentEl branded content o contenido de marca es un tipo de marketing que busca conectar con el público objetivo de una empresa con el fin de entretener, informar o aportar valor, comunicando los valores de la marca.En España tenemos la definición oficial de la BCMA (Branded Content Marketing Association):Branded Content es un activo/ s de comunicación producido/s o coproducido/s por una marca que, mediante formatos que cumplan un rol de entretenimiento, información y/o utilidad, tiene el fin de comunicar sus valores y conectar con una audiencia, que al encontrarlo relevante le dedica voluntariamente su tiempo de atención.IAB, citando a Forrester, nos dice que Branded Content es: El contenido que es desarrollado o curado por una marca para aportar al consumidor valor añadido como el entretenimiento o la educación. Está diseñado para construir reputación de marca y afinidad. No es un anuncio pagado, un patrocinio o un product placement.Hay varios elementos comunes. Podemos destacar:Activo de comunicación / contenido. La palabra “content” no está de adorno.Producido, coproducido o “curado” por una marca. La marca o empresa juega un papel fundamental.Utilidad, valor añadido y dedicación voluntaria. Esto es importante, la persona quiere consumir este contenido de marca, el contenido tiene valor por sí mismo y la persona le dedica su tiempo y atención de forma voluntaria.De la definición de IAB (y Forrester) también podemos deducir “qué no es”: algo que veremos más adelante en detalle. Antes, vamos a ver por qué es importante y por qué (es posible) que tu empresa deba considerar el branded content.Por qué es importante el branded content y por qué puede ser útil en tu empresa¿Por qué deberías hacer branded content? ¿Es solo para grandes marcas? ¿Qué te puede aportar? Estas son algunas de las preguntas que vamos a responder.Empecemos por las obviedades: las empresas necesitan clientes. Para que, como empresa, puedas tener clientes, deben conocerte. Y, a veces, amarte. El branded content busca resolver esto: conectar con tu público objetivo, generar un vínculo y ayudarte a cumplir tus objetivos de negocio.Pero, para eso, tienes muchas opciones: puedes hacer publicidad tradicional o digital, puedes hacer marketing directo, puedes hacer… Bueno, dejémoslo en que existen muchos tipos de marketing que puedes hacer.El branded content es un tipo de marketing y comunicación que entra en lo que podríamos denominar de “no interrupción”. Como recordarás de la definición de unas líneas más arriba, nuestro público conecta con nosotros de forma voluntaria.Pero, ¿por qué deberías hacer branded content?Vamos a ver algunos motivos.Crisis de la publicidad tradicionalYa estamos tan avanzados en el siglo XXI que cuesta hablar de lo digital como algo nuevo, pero la transición entre los medios de comunicación masivos y analógicos ha sido más lenta de lo esperado. Sin embargo, la penetración de la televisión ha caído de forma continuada en las últimas décadas:Fuente: AIMC. Statista.Los medios tradicionales como la televisión lideraron la inversión publicitaria hasta hace poco y, en muchos sectores y dependiendo del público, los medios analógicos siguen suponiendo la mayor parte de la inversión.Crisis de la publicidad digitalCuando llegó la publicidad digital (de eso hace varias décadas) una de las grandes promesas es que todo se iba a poder medir y segmentar. Podríamos llegar con el mensaje adecuado a las personas adecuadas. La publicidad sería tan relevante que sería casi información.Por desgracia, ninguno de esos supuestos se cumplió y acabamos rodeados de banners irrelevantes e intrusivos que nos esforzamos por (a) ignorar y (b) bloquear, en una especie de escalada armamentística sin fin.El fenómeno adblockingLos bloqueadores de publicidad se empezaron a popularizar en 2005, pero desde 2015 son algo prácticamente mainstream.Muchas personas no saben que los tienen instalados. A nivel global, el 35% de los usuarios usan un adblocker, en España, es el 36%, como podemos ver en Digital 2023, de We Are Social:La publicidad digital (y no digital) cada vez está concentrada en menos manosCon el tiempo hemos pasado de oligopolios nacionales y locales (los grandes grupos mediáticos eran los dueños de los soportes publicitarios más importantes, como periódicos o canales de televisión) a un oligopolio global que es casi un duopolio.En el informe sobre gasto publicitario de la consultora Warc podemos ver como más de la mitad de la inversión global en publicidad (no solo digital) está en manos de cinco empresas: Alphabet (Google, YouTube), Amazon, Meta (Facebook, Instagram), Alibaba y Bytedance.Pero si miramos un poco más de cerca los datos, vemos que la mayor parte del pastel se reparte entre Alphabet-Google y Meta-Facebook.Fuente: Warc Ad Spend Outlook, 2023-24Los oligopolios no son buenos para los clientes. Cuando no hay competencia, hay menos opciones, y esto es lo que pasa con el mercado publicitario.Las personas tienden a ignorar y a no confiar en la publicidadY hay muchos estudios que lo demuestran. Pero antes de citar alguno, me gustaría preguntarte: ¿cuál fue el último anuncio que viste? ¿Lo recuerdas? ¿Te generó confianza?Es curioso que como profesionales del marketing dediquemos tantos esfuerzos a la publicidad, pero como personas “normales” dediquemos tanto tiempo a escapar de ella e ignorarla.Por ejemplo, en España, solo el 22% de las personas confía en la publicidad que ve en redes sociales, según YouGov (gráfico de Statista):Las plataformas de pago dificultan llegar a las audiencias más valiosasLlegar a ciertas audiencias, al menos a las más valiosas, es cada vez más difícil.Puede que Netflix o Spotify tengan sus planes con anuncios, pero… ¿es la audiencia que quiere ahorrarse 5€ la más adecuada para tu marca? Quizá no.Como dice Scott Galloway, Profesor de la Universidad de Nueva York y autor del libro The Four, la publicidad se está convirtiendo en un impuesto para los pobres.¿Cómo sabes que tu vida no ha ido por el buen camino? Estás viendo mucha publicidad: la publicidad se ha convertido en un impuesto para los pobres y los que no saben usar la tecnología.Scott Galloway, profesor de Marketing en NYU Stern SchoolEl branded content busca dar solución a esos problemas.Dejamos de interrumpir a nuestro cliente o cliente potencial, y pasamos a aportar valor con nuestros contenidos, que consumen de forma voluntaria.La crisis de la publicidad nos impulsa a buscar nuevas formas de conectar con nuestro público objetivo. Pero… ¿qué podemos conseguir con el branded content?Con branded content podemos atacar casi cualquier objetivo de marketing. En términos generales, el branded content casa mejor con la parte superior del embudo de marketing, pero no tiene por qué ser así.Podemos hacer branded content para mejorar la percepción de nuestra marca, para atraer nuevos clientes o para fidelizar a los que tenemos.En el apartado de “Cómo hacer branded content” los veremos en más detalle.Ahora, vamos a ver cómo empezó el branded content.Orígenes del Branded Content¿Es algo “nuevo”? ¿Una moda? Para hablar de los orígenes del branded content contamos con la experiencia de Fernando de Córdoba, estratega de marca y contenidos que ha trabajado para marcas como ING, Coca Cola o Suanfarma y autor del libro “Los Secretos de las Marcas”.En palabras de Fernando:El branded content es tan antiguo como la propia comunicación.Durante la revolución industrial, cuando la existencia de una mayor oferta de bienes hace necesaria la aparición de anuncios, la publicidad era un acontecimiento por sí misma.Sin embargo, la saturación pronto hizo que los anunciantes buscasen nuevas maneras de relacionarse con sus audiencias potenciales.Así surge el que muchos consideran el primer branded: la revista The Furrow (el surco), del fabricante de maquinaria agrícola John Deere, que empezó a publicarse a finales del siglo XIX.Imagen: ContentlyEn The Furrow se encontraba toda la actualidad e información que un granjero pudiera necesitar para su labor… además de detallada información sobre los productos de la marca.A día de hoy, The Furrow sigue publicándose.Con el paso del tiempo el branded content fue sirviendo diferentes propósitos, como el desarrollo de un canal de comunicación nuevo.Por ejemplo, la llegada de la radio a España fue, en algunos casos, branded content puro. Unión Radio, antecesora de la Cadena SER, era una unión de fabricantes de radios que estaban interesados en ofrecer una programación que justificase la inversión en uno de sus aparatos; algo que se repitió décadas después con la llegada de la televisión.La historia de Unión Radio está narrada en este libro de Ángeles Afuera.No es casualidad que grandes galas con cantantes y cómicos llevasen el nombre de Philips o Telefunken, dos de los principales fabricantes de receptores de TV.La historia del branded content se remonta a más de un siglo, pero todavía hay dudas sobre qué es y qué no es branded content.En el entorno profesional, sobre todo en grandes empresas, me he encontrado muchas confusiones entre distintas disciplinas dentro del marketing. Estas son algunas de las más habituales.Diferencias entre Branded content y otras disciplinas de marketingEl branded content tiende a confundirse o mezclarse con otras disciplinas dentro del mundo del marketing.Vamos a comentar algunos de los casos más habituales y las diferencias y similitudes.Product placementUn error muy habitual y que no termino de entender, porque no veo apenas relación. El product placement o emplazamiento de producto consiste en situar elementos de una marca o producto en un contenido, generalmente audiovisual. Cuando ves a los protagonistas de una serie pedir una marca de cerveza concreta, tomarse un refresco en el que muy claramente se ve la marca o usar un portátil con una fruta por logo estás viendo (casi seguro) un ejemplo de product placement.Tom Hanks va a Burger King en “La Terminal”.No es branded content porque no cumple ninguno de los requisitos. No se trata de contenido producido o coproducido por una marca.Publicidad nativaLa publicidad nativa es aquella que se integra de forma tan profunda en el contenido que es casi indistinguible del propio contenido. Uno de los formatos más habituales son los bloques de artículos relacionados, que suelen aprovecharse para espacios pagados con plataformas como Outbrain o Taboola.Ejemplo de “publicidad nativa” en Expansión, con Taboola.No es branded content porque no deja de ser publicidad, algo camuflada.Inbound MarketingInbound marketing es una estrategia de marketing que busca atraer a los clientes con contenido útil y relevante.El término inbound marketing fue acuñado por HubSpot en 2005. Aunque inicialmente se basaba en un funnel, en 2018 reconvirtieron su metodología con la idea de flywheel, o volante de inercia, con estos tres componentes:Atraer. Atraer a las personas adecuadas.Interactuar. Ayudar a esta gente con sus frustraciones y objetivos para que sea más probable que te compren.Deleitar. Hacer todo lo posible por ellos. Ayudarles a encontrar el éxito con tu producto.Lecturas complementariasGuía completa para principiantes de Inbound Marketing.No es branded content, pero aquí nos empezamos a acercar más a las ideas y principios. No siempre, pero por lo general cuando hablamos de “inbound marketing” suele ser más en entornos B2B, con objetivos más relacionados con la captación de leads.Marketing de contenidos y estrategia de contenidosPara algunos puristas, es un pecado juntar ambos términos. Y, sí, hay matices. De hecho, desde el blog de Ahrefs, ya hemos reflexionado sobre este tema en alguna ocasión.El marketing de contenidos te ayuda a atraer, interactuar, convertir y retener clientes a los que puede que no llegues de otra forma.Por su parte, la estrategia de contenidos se enfoca en la visión y plan de tu contenido. Es donde das respuesta a preguntas como por qué y cómo crear contenido, para quién es el contenido y, finalmente, cómo utilizarás el contenido para hacer marketing para tu negocio.¿No es branded content? No tiene por qué, pero aquí opino que las fronteras se vuelven confusas y empieza a ser opinable.No deja de ser contenido, producido o coproducido por una marca, que trata de cumplir un rol de información (o entretenimiento) y que se consume de forma voluntaria…Cuando hablamos de branded content, se suele pensar más en grandes producciones relacionadas con el mundo audiovisual, pero… No tiene por qué ser así.Por cerrar el debate: no creo que los términos sean lo más importante. Al final, se trata de estrategias y tácticas basadas en contenidos, en aportar valor a clientes y potenciales clientes, ya sea en forma de entretenimiento, información o ambas.Así que pasemos a ver cuáles son las ventajas y desventajas de hacer Branded Content.Ventajas y desventajas de hacer branded contentExisten muchos motivos por los que hacer branded content, pero tampoco es la respuesta a todos los problemas ni la estrategia milagrosa que muchos tratan de vender. Vamos a ver lo bueno y lo no tan bueno.Ventajas de hacer branded contentEstá claro que aquí somos partidarios del contenido como una estrategia de marketing clave para generar negocio. El blog de Ahrefs, este mismo que estás leyendo, tiene más de 670.000 visitas al mes, con más de 160.000 palabras clave a nivel global.Por ejemplo, cuando alguien busca en Google desde España palabras clave como “marketing de afiliados”, “hreflang” o backlinks, encontrará uno de nuestros artículos y aprenderá conceptos básicos (o avanzados) sobre marketing online o SEO con nosotros.Y si aprende con nosotros pasarán dos cosas: nos conocerá y le causaremos una buena impresión.Y esto no son meras métricas de vanidad: gracias al blog, generamos ingresos. De hecho, es junto a nuestro canal de YouTube una de las principales vías de captación de clientes para nuestro conjunto de herramientas SEO.Veremos más adelante cómo el SEO puede ser parte del branded content para ser más efectivo. Pero antes, vamos a ver algunas de las ventajas del branded content.No interrumpes y aportas valor.Esta es quizá una de las primeras diferenciaciones claras del branded content: estamos creando algo para entretener o informar, estamos aportando valor a la vida del cliente potencial o de la sociedad, no interrumpiéndole con algo que no quiere ver mientras trata de hacer otra cosa.Puedes llegar a otros públicos que podrían ignorarte.Como veíamos al principio del post, muchos elementos de la publicidad (sobre todo de la tradicional) están en crisis. Muchas empresas han confiado en la compra de medios como única vía para llegar a su público. Pero cada vez hay más gente que no ve la televisión lineal (el principal medio publicitario) y la penetración ha caído con los años: en el caso de España, de más del 90% a finales de los 90, a poco más del 79% en 2022, como veíamos al principio.El branded content nos permite llegar a públicos que han aprendido a ignorar y bloquear la publicidad.Tus mensajes pueden dejar una huella más profunda.Como dice Eduardo Prádanos, Fundador de la agencia Fluor Lifestyle y uno de los colaboradores de este post, “el impacto se compra, la huella se gana”.Cuando consigues entretener o resolver un problema, creas una vinculación emocional, difícil de medir, pero más profunda que con un pre-roll en YouTube, por poner un ejemplo.Desventajas de hacer branded contentNo es oro todo lo que reluce. Si alguien te dice que hacer branded content es fácil y rápido, que es la estrategia de marketing perfecta… Es muy posible que te esté engañando o que no tenga ni idea de lo que habla (y no sé qué es peor).Vamos a ver algunos problemas del branded content.No es fácil conseguir una audiencia.El cementerio está lleno de proyectos de branded content con buenas intenciones, una buena ejecución, interesantes y relevantes… Pero que no consiguieron levantar una audiencia lo bastante grande como para justificar su presupuesto.Es el mayor reto de un proyecto de contenidos, ser capaz de competir con la sobredosis de contenido existente.Los costes no son triviales.Crear contenido puede ser rentable, pero no es barato. Sobre todo, cuando hablamos de proyectos audiovisuales, que, en muchos casos requieren de inversiones en el rango de los cientos de miles o (incluso) millones de euros.Eso no quiere decir que no se pueda hacer por menos, claro, pero en proyectos como Aprendemos Juntos de BBVA, podemos imaginarnos que los costes no son bajos.Los proyectos de branded content tienen una venta interna más compleja que la de otros tipos de marketing.Es difícil medir el impacto directo en ventas de un proyecto de branded content, el éxito suele ser también más incierto (porque dependemos de que de verdad guste o interese a nuestro público) y, para muchas empresas, queda la sensación de que tienen que invertir a ciegas y sin muchas garantías de éxito.Cualquier departamento de marketing está acostumbrado a la publicidad, y en grandes empresas nadie pestañea por invertir unos cuantos millones de euros en un anuncio de televisión que (probablemente) será ignorado, pero el branded content no deja de ser nuevo (incluso hoy) para muchos comités de dirección y equipos directivos de marketing.En mi experiencia personal en grandes empresas (incluyendo grandes bancos y organizaciones sociales), he visto esta reticencia muchas veces.Por eso es importante estructurar bien un proyecto de branded content, argumentando bien cómo vamos a convertirlo en realidad y por qué es una buena inversión para nuestra empresa.Es justo lo que vamos a ver ahora.Cómo hacer branded content (y cómo el SEO puede ayudarte)Existen muchas metodologías y enfoques a la hora de crear contenidos, estrategias de contenido y de branded content.Hace un par de años, Joshua Hardwick, director de contenidos en Ahrefs, compartió un canvas muy sencillo para crear una estrategia de contenidos.Como decía antes, existen matices y diferencias entre el branded content y la estrategia de contenidos, pero las preguntas fundamentales son casi las mismas. Al igual que en cualquier estrategia de marketing, tenemos que responder a preguntas básicas como:¿Para quién estás creando contenido? En otras palabras, quién es tu público objetivo.¿Por qué estás creando contenido? Qué objetivos buscas.¿Qué tipo de contenido vas a crear? El tipo de contenido tendrá que ajustarse en parte a tu público y objetivos.¿Dónde vas a publicar el contenido? La distribución es el gran olvidado de los proyectos de branded content (lo que provoca las bajas audiencias de las que hablábamos hace unas líneas).¿Cómo crearás el contenido? Una vez que tienes claro lo que quieres hacer, ¿cómo vas a convertirlo en realidad? ¿Qué tipo de perfiles y recursos necesitas?No entraremos en excesivo detalle en cada punto, porque esto acabaría siendo un libro más que un post, pero sí veremos algunas ideas y conceptos clave de cada punto.Además, veremos cómo el SEO puede ayudarte a diseñar un proyecto de branded content más efectivo.Para quién creas branded content: analiza tu público objetivoLa piedra angular de cualquier proyecto de marketing debería ser entender las necesidades de las personas a las que te diriges. Un muy buen primer paso es hacer investigación de mercados, lo que te permitirá entender mejor a tu público objetivo.Dicho esto, un error habitual (que yo mismo he cometido muchas veces) es el usar marcos de análisis, como el de buyer persona o jobs to be done, sin adaptarlos a un proyecto de contenidos.Cuando lanzamos un proyecto de contenidos, estas son algunas de las preguntas que me gusta hacerme:Cómo es la personaLa edad, ubicación y datos demográficos no son para mí, ni de lejos, lo más importante. Quizá conozcas el famoso meme en el que te hablan sobre un perfil y tienes que adivinar quién es:Es hombreNació en 1948Se crió en Reino UnidoSe casó dos veces.Vive en un castillo.Es rico y famoso.Siempre que hago este ejercicio en clase, cuando llego al “vive en un castillo” la mayoría del alumnado lo tiene claro: es el Rey (Príncipe hasta hace unos años) Carlos III de Reino Unido:Fotografía: Mark Tantrum, Wikimedia.Pero, el giro de guión, no tarda en llegar.Hay otra persona que cumple exactamente las mismas características. También es un príncipe, pero el príncipe de las tinieblas y es conocido por haber devorado murciélagos en un escenario en sus años mozos.No es otro que Ozzy Osbourne:Fotografía de F darkbladeus - Trabajo propio en I Am Ozzy book signing fan photograph Changing Hands, Tempe, Dominio público.Y este, es el meme:Traducción del popular meme de buyer persona, del que no hemos encontrado la fuente original.Hay quien usa este meme para desprestigiar completamente este tipo de análisis.Personalmente, no estoy de acuerdo. Ningún modelo es perfecto, se trata de que seamos conscientes de las limitaciones de cada uno. Saber, por ejemplo, dónde vive una persona o en qué año nació, puede servir para hacernos una idea de cuáles son sus referencias culturales.Aunque Ozzy y Carlos son muy distintos, es probable que compartan referencias culturales como series inglesas de televisión de los 60 y 70, acontecimientos históricos y muchas otras cosas que nos pueden ayudar a crear contenido para este perfil.Simplemente, no des nunca por hecho que un modelo es completamente cierto.Pero, como decía, no me gusta pararme en valores sociodemográficos (aunque tengan su utilidad).Creo que tiene sentido ir más allá y pensar en términos de contenido.Algunas preguntas que me ayudan son:¿Qué temas le interesan?¿Qué formatos prefiere?¿Con qué frecuencia consume contenidos?¿Cómo es el contenido que le gusta? ¿Qué ángulos? ¿Qué tipos?¿Qué objetivos quiere cumplir con el contenido que le ofrezcamos?¿Qué problemas y frustraciones quiere resolver?Buscamos la intersección entre sus intereses y los de nuestro producto, servicio o marca (o territorios cercanos), así que algo que tenemos que saber es lo que le interesa.¿Cómo podemos averiguarlo?La investigación de mercados puede ser un buen punto de partida. Puedes conseguir datos primarios (mediante encuestas o entrevistas a tus clientes, entre otros métodos), o usar datos secundarios, como informes de terceros. Todo depende de tus recursos.Y algo que podemos hacer también es usar técnicas SEO para averiguar más sobre lo que puede interesar a nuestro público objetivo (o audiencia objetivo, como me gusta decir).Es curioso, porque creo que son pocos los profesionales de branded content que aprovechan el conocimiento que podrían extraer de herramientas SEO como las nuestras, ya sea Keyword Explorer, Content Explorer y muchas otras.Vamos a ver alguna idea para que puedas usar técnicas SEO para conocer mejor a tu público objetivo.Haz keyword research para entender las temáticas y tipos de contenido que interesan a tu audiencia.Keyword research o investigación de palabras clave es uno de los pilares fundamentales del SEO.IMPORTANTELa investigación de palabras clave es el proceso de descubrir lo que tu audiencia o público objetivo escribe en motores de búsqueda (como Google) para buscar productos, servicios e información en espacios en los que te interesa posicionarte.En este post nos vamos a limitar a analizar ideas de palabras clave para entender mejor qué temáticas e ideas concretas de contenido pueden interesar más a tu audiencia.Tenemos una guía completa si quieres profundizar y aprender más. Para empezar un análisis de palabras clave, solemos arrancar con una serie de palabras clave semilla o seed keywords, que sirven como punto de partida.Pueden tener que ver con tu producto, servicio o territorio en el que te quieres posicionar.Algunos ejemplos:Si eres una editorial de libros de ciencia ficción, algunas palabras clave semilla podrían ser desde la propia palabra clave (“ciencia ficción”), como nombres de autores conocidos (“Isaac Asimov”, “Arthur C. Clarke”) o novelas populares de ciencia ficción.Si eres una marca de cafeteras, podrían ser cosas como “café”, “capuccino”, “cafetera italiana”, etc.No tienes que limitarte a tus productos y servicios directos, si eres una empresa de seguros (por ejemplo) y lanzas un proyecto de branded content relacionado con ciencia, podría interesarte averiguar qué conceptos relacionados con ciencia tienen más búsquedas.De lo que se trata (simplificando mucho, mucho) es de entender qué temas generan más interés.RecomendaciónCuando hablamos de “branded content” no tenemos por qué limitarnos en exclusiva a territorios temáticos 100% relacionados con productos y servicios. Puede ser algo más aspiracional o relacionado con la propuesta de marca a un nivel más elevado.Un ejemplo de esto lo encontramos en BBVA, uno de los mayores bancos españoles, que en 2018 lanzó “Aprendemos Juntos”, un proyecto de branded content centrado en educación (ahora, también en sostenibilidad) que ha reunido a figuras como la del filósofo José Antonio Marina, la escritora Elsa Punset, el médico Mario Alonso Puig o el antropólogo Juan Luis Arsuaga a lo largo de más de 400 vídeos, que suman más de 2.500 millones de visualizaciones y han generado 30 millones de interacciones.BBVA no tenía ningún posicionamiento (ni SEO ni de ningún tipo) en temas relacionados con educación, pero, con el tiempo, ha conseguido generar estas asociaciones.Dicho esto, por regla general, cuanto más alejado esté el territorio del branded content del “nativo” de tu marca o empresa, más tiempo y más esfuerzo costará alcanzar ese posicionamiento (y no hablo solo de SEO).Vamos a ver un ejemplo.Supongamos que somos una empresa de asesoramiento financiero y vamos a crear un proyecto de branded content sobre educación financiera y finanzas personales. Sí, no suena muy original, pero tiene sentido.¿Cómo podemos saber qué temas y qué tipos de contenido tienen posibilidades de éxito en el espacio de la educación financiera y las finanzas personales?Empecemos eligiendo algunas palabras clave semilla. Por simplificar, vamos a centrarnos sobre todo en “finanzas personales”.Si introducimos la palabra clave “finanzas personales” en una herramienta de keyword research, como Keywords Explorer, veremos información muy interesante:Aquí vamos a simplificar muchísimo, por cuestiones de espacio, si tienes alguna duda, entra en los enlaces que te dejo en cada concepto:La dificultad de la palabra clave estima cuán difícil es posicionarse (aparecer en los resultados) de esa palabra clave. Hay muchos matices, aquí te los contamos.El volumen es la estimación del número de veces que se busca al mes en el mercado que has elegido (España, en este ejemplo). El volumen global es la estimación de cuántas veces se busca en todos los países de la base de datos de Ahrefs. Aquí te contamos más sobre el volumen de búsqueda.El tráfico potencial es una estimación de las visitas que recibe el enlace que está en primera posición.Visto así, no parece una palabra clave del todo interesante: no es fácil y (si nuestro interés está sobre todo en España) no tiene mucho volumen.Pero, si alguna vez has reflexionado o buscado información sobre tus finanzas personales, ¿lo has hecho pensando o buscando “finanzas personales” literalmente o en cosas similares a “cómo ahorrar más”, “qué es el tipo de interés compuesto”, “aprender a invertir” o “presupuesto personal”?Seguramente, lo segundo.Por eso, el primer paso debería ser hacer un pequeño brainstorming de palabras clave relacionadas con ese espacio.Nota al margen.Hay que añadir, que en el caso de que no se te ocurriera ninguna palabra clave semilla, podrías extraer ideas del propio Keywords Explorer de Ahrefs.Simplemente, podrías usar los informes de Términos que concuerdan, Términos relacionados y Sugerencias de búsqueda, para encontrar muchas otras palabras clave e ideas de contenido.Usando los ejemplos anteriores (“cómo ahorrar más”, “qué es el tipo de interés compuesto”, “aprender a invertir”, “presupuesto personal”) podríamos obtener muchas otras ideas.Por ejemplo, empecemos con “presupuesto personal”:No tiene mala pinta: parece que hay cierto interés en este tema.Si bajamos un poco, podemos ver en la vista general de la SERP (página de resultados) algunas ideas más que pueden ser interesantes:“Cómo hacer un presupuesto” parece algo más general, pero “plantilla presupuesto excel” parece algo más prometedor:Y, efectivamente, con una dificultad muy aceptable (5), tenemos muy buenas cifras de tráfico potencial.Es posible que alguien interesado en finanzas personales y presupuestos, quiera plantillas en Excel que le ayuden a planificar su presupuesto.Así que ahora, partiendo de una idea general sobre “finanzas personales” ya tenemos un ángulo y un tipo de contenido muy específico que puede resultar interesante: plantillas en Excel. Con esto, podríamos crear un descargable (bajo registro o en abierto) que contuviera una plantilla de presupuesto.Haciendo lo mismo con “aprender a invertir”, podemos sacar otras muchas ideas.Esta vez, vamos a agrupar los términos que concuerdan por tema principal (parent topic):Podemos ver que hay interés por libros para aprender a invertir. Los cursos son algo que también interesa.Así que es muy posible que crear contenidos recomendando libros o cursos funcione (o, incluso, crear nuestro propio libro o curso).Esto es solo la punta del iceberg: hacer keyword research es un proceso largo, con ciertas complejidades.Pero puede ser un punto esencial de tu proyecto de branded content.Y no tiene que limitarse a Google, en Ahrefs también puedes aprender mucho sobre lo que funciona en YouTube y otros motores de búsqueda.Aquí debajo tienes recursos de sobra para aprender más. Te recomiendo, sobre todo, que eches un vistazo a la guía de keyword research y, si estás pensando en un contenido que implique vídeo, la guía sobre YouTube SEO.Lecturas complementariasInvestigación de palabras clave: Una guía completa para principiantes en SEO¿Deberías centrarte en palabras clave sin volumen de búsqueda? Depende…YouTube SEO: Aprende a posicionar tus vídeos en YouTubeHay muchas otras cosas que podrías hacer: cómo analizar las iniciativas de branded content de la competencia para ver qué les funciona mejor o estudiar lo que hacen medios de comunicación afines al territorio que quieres conquistar. Si quieres aprender más sobre cómo analizar a tu competencia en SEO, lee esta guía.Pero lo importante es lo que decíamos al principio: ¿para quién creas Branded Content? ¿Qué le interesa y por qué debería dedicar su tiempo a tu contenido, en lugar de a otro cualquiera?No te limites a las variables sociodemográficas, ve más allá y piensa en qué soluciones concretas necesita, qué tipo de contenido consume y cómo puedes captar su atención (y mantenerla).Por qué haces branded content: tus objetivosApenas hemos hablado de objetivos hasta ahora. Aquí voy a citar al gran Joshua Hardwick, cuando nos dice que cada pieza de contenido debería tener un propósito.Estoy de acuerdo. Añado que deberíamos contar con objetivos para nuestra iniciativa de branded content.En general, hay cuatro objetivos que podemos tener en cuenta:Incrementar el conocimiento de marca.Crear interés y deseo educando a clientes potenciales sobre sus problemas y cómo tu producto o servicio puede resolverlos.Fomentar el interés e incitar a la compra educando más a clientes potenciales sobre tu producto o servicio y por qué es la mejor solución para ellos.Fidelizar clientes, construir fidelidad.Es importante que sean específicos.Michal Pecánek escribió una completa guía en este mismo blog para definir objetivos de marketing a la que deberías echar un vistazo.Su primer consejo, me parece de lo más relevante: plantea objetivos específicos. Las desgastadas siglas de SMART son útiles:Hay una gran diferencia entre este objetivo:Incrementar las ventas un 30%.Y este otro:Incrementar las ventas del producto XYZ en el segmento de grandes empresas en Estados Unidos de 1 millón de dólares a 1,3 millones a finales de 2021.Debemos aspirar al segundo ejemplo.Lecturas complementariasObjetivos de Marketing: cómo establecerlos adecuadamente (con ejemplos)Cómo establecer los objetivos SEO correctos con 3 ejemplosCuál es el tipo principal de contenido que crearásEsto es algo que, si seguiste los pasos del primer punto (“para quién creas branded content”) ya deberías tener relativamente claro. El tipo de contenido debería ser el que más consuma tu audiencia. Pero (siempre hay un pero) es posible que en algunos casos necesites matizarlo. Me explico.En un mundo ideal, no siempre vas a tener todos los recursos posibles. Si eres un emprendedor independiente, una startup con poco dinero en caja o una empresa pequeña (o un departamento dentro de una empresa grande con poco presupuesto) es posible que no puedas hacer contenido con elevados valores de producción.Quizá necesites hacer vídeos, pero el vídeo es mucho más caro que el texto. Mi consejo aquí es que busques nuevas formas y uses el ingenio: los valores de producción no suelen ser tan importantes como parece.Quizá no puedas contratar actores famosos, pero (casi) siempre podrás producir algo usando herramientas que te faciliten el flujo de trabajo.Dónde vas a publicar tu branded content: el modelo de distribuciónLa falta de audiencia e interés suele ser uno de los puntos débiles de muchos proyectos de branded content. Como auténtico fan de esta disciplina, muchas veces me he encontrado en la difícil situación de “defender” proyectos que, sencillamente, no funcionaban a nivel de audiencia.En muchos sentidos, el SEO es un canal infrautilizado. Sobre todo en muchos proyectos de branded content.De hecho, en un análisis que realizamos en Ahrefs, más del 90% de páginas no reciben tráfico de búsqueda orgánica de Google.El SEO también puede ayudarnos a mejorar la distribución de nuestro contenido y tener más alcance. En gran parte, como vimos al principio, nos sirve para entender el contenido que mejor puede conectar con nuestra audiencia.Pero también puede ser útil para encontrar alianzas (otros medios o influencers que quieran sumarse o colaborar con nuestro proyecto).Vamos a ver cómo podrías hacerlo, continuando con el ejemplo de las finanzas personales.Encuentra alianzas con medios e influencers que den más alcance a tu proyecto de branded contentVe a Content Explorer.Escribe “finanzas personales” (podrías hacerlo con muchos otros temas, claro).Elige “en el título” (in title).Elige “spanish” (español) en idioma, “solo activos”, “filtrar resultados explícitos” (aunque es poco probable que nos encontremos algo subido de tono) y DR (rating de dominio) a partir de 25 (cuanto más alto, más autoridad).Algo así:Cuando pulses en “Mostrar resultados”, verás más de 17.000 páginas que han hablado sobre finanzas personales:Puedes filtrar más, ordenar por tráfico, consultar la pestaña de autores y sitios web…Pero, si dedicas un rato a investigar desde Content Explorer, podrías encontrar colaboradores para tu contenido, webs que te ayuden a distribuirlo mediante alianzas o sitios para intercambiar enlaces.TRUCOEn Content Explorer tienes disponibles una serie de casos de uso que te pueden servir de base, para cosas como:Encontrar temas de baja competencia.Oportunidades para participar como autor invitado.Contenido de éxito en Pinterest.…¿Lo mejor? Puedes acceder a estos casos de uso con un par de clics:Y, una vez que carguen, puedes editarlos para que se ajusten a tus necesidades.¿Contenido de éxito en Pinterest? Y, ¿por qué no X (Twitter)?Fácil, haz clic en el caso de uso y edita el filtro de compartidos:Y, si estás empezando, puede que los filtros que usamos para encontrar oportunidades como autor invitado te parezcan demasiado estrictos.Así que edítalos en segundos:De nuevo, es solo un consejo general, podrías hacer algo mucho más ajustado dedicando tiempo y analizando a fondo a la competencia o medios relevantes.Pero esta guía ya es lo bastante larga (sin contar todos los recursos que estamos enlazando), así que pararemos aquí.Simplemente quédate con una idea clave: no dejes de lado la distribución de tu contenido. Si nadie lo ve, será como si no lo hubieras creado (peor, porque habrías perdido tiempo y dinero).Ahora que nos acercamos al final de esta guía, toca hablar un poco sobre cómo podemos organizar nuestro proyecto de branded content.Cómo crear y organizar tu proyecto de branded contentCada proyecto es único. Es posible que vayas a hacer un documental o, incluso, una película. O una serie de vídeos y tutoriales que distribuyas en YouTube e Instagram. O un libro que se pueda descargar desde tu web. O, quizá, sea una herramienta interactiva.No quiero dejar este apartado completamente huérfano, así que aquí van algunos consejos generales que me han ayudado en mi carrera.No te olvides de los consejos básicos de toda gestión de proyectos. Es decir, duplica (o triplica) los plazos iniciales (porque siempre hay retrasos y tendemos a ser demasiado optimistas), ten siempre un plan B (y C) y forma un equipo dedicado. Expuestas las obviedades (que casi siempre nos saltamos, todo sea dicho), vamos a ver algunas ideas más específicas.Gestiona las expectativas y alinea la visión.Hace años lancé un proyecto de branded content de cierta envergadura en uno de los grandes bancos de España (se trataba de una herramienta online, apoyada por una serie de contenidos audiovisuales y de texto).Fue una experiencia durísima, porque casi nadie del departamento de marketing entendía un proyecto de contenidos. La mayoría, a pesar de estar en 2016-17, seguían pensando en términos de publicidad de televisión, GRP y, como mucho, banners y anuncios en redes sociales.Han pasado años y las cosas han cambiado, pero creo que sigue siendo importante hacer entender que los proyectos basados en contenido, necesitan tiempo y pensarse desde una óptica de interesar a las personas.Crea un equipo multidisciplinar.Por poca complejidad que tenga tu proyecto, es difícil que puedas hacerlo todo con perfiles no especializados. Posiblemente necesitarás:Redactores/asGuionistasProductoras de vídeoDiseñadores/as gráficos.…Y, quizá, gente que sepa de usabilidad o desarrollo (depende lo que vayas a hacer).Todo esto, sin contar con que necesitarás gente que sepa del tema que vas a abordar. En el ejemplo de las finanzas personales, si quieres crear algo realmente reseñable, vas a necesitar contar con gente que sepa mucho de finanzas personales (o acabarás creando contenido plano y poco relevante).Este es uno de los puntos más descuidados: no sirve de nada contar con las personas más expertas en redacción o en vídeo, si no hay alguien detrás que sepa de verdad de lo que se está hablando.Incorpora visión de negocio.Relacionado con el primer punto, debes pensar en cómo se relaciona tu proyecto con el negocio de la empresa. ¿Traerá más clientes? ¿Incrementará la visibilidad de la marca? ¿Abaratará el coste medio de la publicidad? Cuanto más presupuesto vayas a consumir, más tendrás que fijarte en esto.Organízate. Sí, prevé lo que necesites y organiza el proyecto. No es exactamente lo mismo, pero este artículo sobre cómo crear un calendario editorial puede ayudarte.Y, ahora sí, vamos a ver algunos ejemplos realmente destacables, ofrecidos por grandes figuras del branded content en España y más allá.Cómo medir acciones de Branded Content Para este apartado vamos a contar con la colaboración de Rebeca Saez, Branded Content Manager en Havas Media Group para Telefónica España.El análisis y medición del branded content es una tarea transversal a los diferentes momentos de creación, es por eso que mencionaremos aspectos a tener en cuenta basándonos en los diferentes puntos de la sección “Cómo hacer Branded Content”.Para quién creas branded content: analiza tu público objetivoEn este punto es muy importante tener un benchmark de competencia o de acciones de la misma temática, de este forma podemos tener una idea tanto cualitativa (formatos, frecuencia, contenido llamativo, etc), como cuantitativa basándonos en datos públicos de interacciones y visibilidad (por ejemplo en X podemos ver las impresiones de un contenido y el dato de views nos aporta el equivalente a impresiones).En la siguiente tabla podéis ver aspectos a tener en cuenta en la realización del benchmark de competencia:Con el ejemplo de Keyword Explorer podemos tener adicionalmente el dato de tráfico potencial, siendo la estimación de visitas de los contenidos más destacados. Ese dato nos sirve para marcar una estimación de KPI, aquí la recomendación sería decidir si nos vamos a equiparar al dato de los primeros enlaces, teniendo en cuenta el esfuerzo de difusión que vamos a realizar, o si preferimos ser más conservadores y situarnos en una posición intermedia para ver cómo funciona el contenido, y a partir de ahí ajustar el KPI acorde a primeros resultados.Por qué haces branded content: tus objetivosEn este apartado hay que dejar algo muy claro, cuando hacemos branded content trabajamos normalmente la parte superior del embudo, por lo tanto trabajamos el conocimiento y la consideración del producto, servicio o marca. Esto significa que cuando medimos branded content nuestras principales métricas tienen que ver con ese objetivo de conocimiento de marca.Los podemos dividir en dos:Visibilidad: que se traduce en impresiones, alcance, páginas vistas o views.Consumo: que se traduce en interacciones, tiempo de permanencia, o eventos realizados en el contenido (por ejemplo suscripción a newsletter o al canal).Por medir, podemos medir todo lo que queramos, pero no es recomendable obsesionarse con un dato como el de conversión o clics en branded content, principalmente porque no suele ser su objetivo o función. Existen otras disciplinas que trabajan esos objetivos, como el performance, display o paid social. De la misma forma tampoco debemos comprarnos con este tipo de disciplinas, y debemos manejar las expectativas en caso de que tengamos clientes que quieran realizar esa comparación.Hay dos estudios que nos dan respuesta sobre el uso de metodologías de medición y principales métricas.El primero es el BCMA Content Scope 2022 que menciona las siguientes:Y el segundo es el informe Branded Content 2021 de la IAB donde se mencionan las siguientes métricas: Debemos tener en cuenta que algunos objetivos y su medición no son cuantitativos, sino cualitativos. En estos casos debemos realizar mediciones del interés generado, el reconocimiento de la marca y se aplican estudios de imagen de marca con herramientas específicas.Cuál es el tipo principal de contenido que crearás.En este apartado es muy importante recordar que la respuesta es: “el tipo de contenido debería ser el que más consuma tu audiencia.”Y, por tanto, debemos de tener presente que no todos los contenidos se miden igual, según el formato mediremos de una forma u otra, aunque existan métricas comunes como las impresiones, es muy recomendable que tengamos delimitadas las diferentes métricas por cada formato y el proceso de medición para obtener esos datos.Por ejemplo, no es lo mismo cómo medimos un contenido escrito, que uno audiovisual o de audio. Ni tampoco podremos disponer del mismo nivel de profundidad de datos. En el caso del escrito trabajaremos con métricas de visualización y consumo, en el de audiovisual de views en diferentes variaciones (view de 3 segundos, al 50%, etc), y en el caso de audio podremos tener las escuchas pero es un área que en cuanto a medición aún está en evolución en las diferentes plataformas de distribución.Dónde vas a publicar tu branded content: el modelo de distribuciónEl modelo de distribución puede marcar que el branded content llegué al público objetivo o caiga en el olvido. Un gran ejemplo es Aprendemos Juntos del BBVA que inició su distribución en Prisa, apoyado de paid media y otros múltiples canales de difusión.Es por eso que es fundamental desde un principio tener muy claro los esfuerzos de distribución, es habitual dividirlos en 4 áreas:La distribución orgánica en canales propios, de embajadores, empleados, etc. Aquí mediremos con métricas habituales de estos canales de comunicación según el formato y el canal.La distribución en paid media. Aquí hay que tener muy claro el mix de medios y las métricas que cada disciplina aporta, lógicamente las impresiones o clics son métricas transversales, pero cada disciplina debe tener sus propios objetivos y métricas para saber si están aportando al objetivo global.La distribución en medios online y papel de forma nativa. Este punto se suele tratar de forma diferenciada porque aquí hablamos de aquellos contenidos que se trasladan como contenidos a los medios. Por ejemplo, un contenido deportivo trasladado a un medio como Marca como contenido ad hoc dentro del soporte y sus propios canales de distribución. La medición de estos contenidos es con datos que reporta el soporte y es recomendable negociar previamente qué datos pediremos, KPIs garantizados de páginas vistas e impresiones, así como espacios de visibilidad.La distribución con influencers es un punto adicional, lo separo del paid media porque no solo trabajamos la visibilidad, si no la afinidad y la relación que tienen con sus comunidades. Es muy importante hacer una buena revisión del perfil, pedir datos y comprobar que su comunidad es realmente la que encaja con el contenido. Adicionalmente hay que negociar objetivos de visibilidad, interacción y tener previamente acordado la forma en la reportarán estos datos.Cosas que me hubiera gustado saber hace 10 años:La experiencia es un grado y a lo largo de estos años hay cosas que me hubiera encantado saber cuando empecé:Mide en tiempo real para tomar decisiones y para reordenar cualquier aspecto que no funcione. No se trata de hacer un informe eterno diario, pero marca una serie de métricas clave y controla su evolución desde el día 1.En medios online negocia que se puedan hacer pruebas con diferentes titulares y negocia los espacios destacados en home, así como los formatos en redes sociales.Hay que medir antes, durante y después. Solo así podrás conocer el verdadero consumo del contenido.Aprovecha el tráfico y consumo para crear audiencias, por ejemplo incluyendo el píxel de Meta.Ten en cuenta que en la distribución y creación del contenido el diseño y programación puede dar errores con embeds como el de Youtube.Es más importante priorizar el consumo que el diseño del canal, muchos CMS tienen conflictos con la medición y los embebidos.Ejemplos de branded contentNo hay mejor forma de entender todo lo que hemos hablado que analizando ejemplos.Para elaborar este apartado, hemos pedido a cinco profesionales de las estrategias de contenido y el branded content que compartieran su ejemplo favorito de branded content y por qué lo era.Vamos a darles paso.“La escuela de decoración” de IKEA:Marca: IKEA.Quién lo cuenta: Fernando de Córdoba, Estratega de marca, contenidos y narrativa. Autor del libro “Los Secretos de las Marcas”.Fue un programa emitido en Atresmedia hace unos años con un formato factual, siguiendo la estela de los reality de decoración estadounidenses y canadienses. En cada programa, unos decoradores de Ikea acudían a diferentes hogares para ayudarles a redecorar una habitación.https://youtu.be/E-hWJqy1TQ4?si=X2I63jhYXzYF8czOMe parece una aproximación muy interesante porque la clave de todo ello no era hablar del diseño sueco o los precios asequibles de Ikea. De hecho, el logo de la marca que pagaba apenas aparecía unos segundos en pantalla mientras visitaban “la tienda” (así la llamaban).La clave era mucho más profunda: todo el programa respiraba la filosofía de Ikea, que nos habla de que la decoración de un espacio es mucho más que ponerlo bonito, que tiene un impacto: es una manera de cambiar a mejor nuestra vida y de poder lograr lo que nos propongamos.Por ello, en los programas veíamos por ejemplo a una mujer que reformaba su buhardilla para comenzar un emprendimiento, unos compañeros de piso que mejoraban su convivencia reordenando las zonas comunes, o un niño con discapacidad que cambiaba su habitación para que su mejor amigo pudiera pasar tiempo con él y sentirse más integrado.“Rediséñame”, una competición de diseño de moda con ropa de segunda mano para VintedMarca: Vinted.Quién lo cuenta: Sonia Got, Social Media Manager de Mediaset España.‘Rediséñame’ es un concurso de televisión emitido en Divinity y producido por Mediaset con Vinted.Se trata de una competición de diseño de moda con ropa de segunda mano presentada por María Verdoy y con las influencers Rocío Osorno y Mery Turiel como jurado. En cada programa tres personas expertas en diseño tienen que crear el mejor outfit para un caso determinado con prendas en venta en la plataforma Vinted.Los participantes plantean casos como vestir con estilo en la recta final del embarazo, cómo arreglarse para una primera cita tras una ruptura o cómo llevar el look perfecto a una graduación. Una vez elaborados los looks los concursantes se los prueban y las influencers eligen el outfit ganador. La primera temporada se emitió en abril y la segunda temporada se estrena en la segunda mitad de 2023.Es un caso en el que el universo de la TV y de la marca encajan de un modo totalmente nativo, con un formato tradicionalmente televisivo, una integración de la marca natural como fuente de las prendas que se utilizan y unos valores de marca (economía circular) que se transmiten en cada programa, sin necesidad de forzar el mensaje.Vinted (una plataforma de compraventa de ropa de segunda mano, con 65 millones de usuarios) ya hace habitualmente publicidad convencional centrada en las ventajas del mercado de las prendas de segunda mano, pero este formato de entretenimiento de larga duración le permite mostrar las posibilidades de este mercado aplicadas a la vida real.Además, impacta también a un público mayor que el de sus usuarios principales, lo que le permite ampliar la franja de edad de su público y dota a la marca de una mayor confianza al verla asociada a su canal de consumo habitual y a una presentadora que ya conocen.“FUCK! LA FAMA”: Un branded podcast audaz que conecta con los jóvenes cinéfilosMarca: European Film Challenge.Quién lo cuenta: Roger Casas, Fundador de la agencia El Cañonazo y vicepresidente de la Branded Content Marketing Association.¿Cómo eliges vestuario para el Festival de Cannes? ¿Cómo lidiar con la ansiedad y la conciliación de la vida familiar con los rodajes en el extranjero? Estas son solo algunas de las preguntas que “FUCK! LA FAMA” aborda en sus conversaciones con los mayores talentos alternativos del cine europeo. Este podcast, producido por El Cañonazo Transmedia y The Film Agency y para European Film Challenge, se está haciendo popular entre los grupos de WhatsApp del mundillo del cine indie (y no tan indie) de España y países de habla hispana.En él participan personalidades como las actrices Irene Escolar y Rocío Saiz; directores como Albert Serra y Elena Martín Gimeno, y la productora Marisa Fernández Armenteros, entre otras. Las entrevistas las realizan Laura M. Santamarina y Jesús Choya Zataraín, dos jóvenes talentos que conectan por su frescura y conocimiento del mundo del cine.El objetivo de European Film Challenge está claro: crear contenido exclusivo para los cinéfilos jóvenes. “FUCK! LA FAMA” ofrece una visión íntima de la industria audiovisual donde los invitados comparten la cara menos conocida.Las conversaciones se dan en un formato al alza: el vídeo podcast conversacional, que en tan solo un par de meses ha logrado conectar con su público objetivo, lo que muestra la capacidad que tienen los podcast para conectarse con audiencias de nicho y crear un impacto genuino. Puedes ver el trailer de “FUCK! LA FAMA” aquí. Salomon, cómo transmitir emociones vinculadas al deporte al aire libreMarca: Salomon.Quién lo cuenta: Amanda Pons, Marketing Strategist durante más de 10 años y docente en la Universidad de Nebrija además de otras escuelas de negocio. Finalizando su doctorado sobre comunicación de marcas sin ánimo de lucro en la Universidad Complutense de Madrid.https://www.youtube.com/watch?v=05sUhlxFBk0Durante unos años, Salomon desarrolló en su canal de Youtube contenidos sobre historias vinculadas al deporte al aire libre contadas de una forma única. Aunque hay varios capítulos, el caso de ”Trail dog” sigue emocionando cada vez que lo enseño.A través de Gaëtan y sus dos perros, la pieza (con más de 700.000 visualizaciones en YouTube) transmite la pasión de disfrutar de actividades al aire libre acompañado de aquellos que nos hacen disfrutar. El montaje, la música, los mensajes, el tratamiento al completo de este vídeo y todos los demás que conforman las temporadas que se hicieron, reflejan muchos de los sentimientos que compartimos las personas que practicamos esos deportes de los que habla la marca francesa, independientemente del nivel al que se practiquen.Por ejemplo, en uno de los vídeos hablan de los famosos “downhill”, donde dos corredores se dedican a descender montañas a ritmos frenéticos… Y divirtiéndose, como gusta a los fans de la marca.Crear entretenimiento, sumado a un espectáculo visual en el que un mensaje o emoción queda dentro de ti, es lo que podemos considerar un branded content efectivo, porque gracias a esto, y en el caso de Salomon, ayuda a que confiemos en la marca para ropa de competición. Considero que representa a los entusiastas de estas actividades.“La LEGO Película”: cómo transformar un juguete en una experiencia de entretenimiento completaMarca: LEGO.Quién lo cuenta: Eduardo Prádanos, director del Curso Superior en Branded Content y Transmedia Storytelling en IAB Spain y Fundador de FLUOR Lifestyle, agencia con multitud de proyectos en branded content y transmedia.https://www.youtube.com/watch?v=1qhm19E452sLa LEGO Película transforma un producto de juguete en una experiencia de entretenimiento completa y por la que la gente paga dinero para ir a verla en los cines.Es una película de animación que lleva a los espectadores al universo de la marca, cuyos elementos principales son la creatividad y la fantasía, ya que ofrece un mundo imaginario lleno de personajes y situaciones creativas. También usa el humor inteligente, al combinar humor dirigido a niños y adultos, lo que permite ampliar su público. Y lo mejor es la integración de producto: muestra los productos LEGO de forma natural en la trama.La trama no es posible sin esos personajes concretos, algo que vertebra los mejores casos de branded content en ficción. Se dirige a niños y a sus padres y madres.A diferencia de la publicidad tradicional de juguetes, que a menudo se centra en las características del producto, esta película crea una experiencia inmersiva que promueve la marca LEGO a través de un relato que engancha a niños y adultos.¡Y, lo mejor de todo es que al salir del cine, quieres llenar tu casa de productos LEGO!De todos los que hemos hecho en FLUOR Lifestyle, me viene a la cabeza ahora ‘Sigue la pista’, el juego de narrativa interactiva para ‘La zona’, la serie de Movistar+.Un proyecto de branded content y narrativa transmedia que ganó muchos premios nacionales e internacionales: los propios espectadores, con sus decisiones, eran los protagonistas de la trama policial de corrupción e intriga.Branded content con libros físicos: más allá del blog de AhrefsMarca: Ahrefs.Quién lo cuenta: Erik Sarisky, International SEO & Marketing Manager en Ahrefs e Iván Fanego, fundador de AppCritic y autor de “A nadie le interesan tus anuncios”.Ya hemos hablado de Ahrefs y su blog (el que estás leyendo ahora mismo) como un gran ejemplo de contenidos que ayudan a generar negocio, pero también hemos experimentado con otros formatos. Formatos que incluso van más allá de lo digital.En las fiestas navideñas de 2023 publicamos un libro para niños titulado “White Haired SEO (Super Exciting Odyssey)” del que regalamos 100 copias.Aquí podéis ver a Tim Soulo, nuestro director de Marketing, perfectamente caracterizado:🎁 Christmas giveaway! 🎁We’ve just published a beautiful children’s book titled “White Haired SEO (Super Exciting Odyssey)” and we’re giving away 100 copies!To enter: - Like + RT this post - Tell us which country you’re from and who you plan to give this book to (your kid,… pic.twitter.com/E9zd2vVgiU— Ahrefs (@ahrefs) December 13, 2023 Muchos profesionales SEO tienen hijos e hijas, así que nos pareció una gran manera de celebrar las fiestas a su lado. Para los más pequeños es una aventura en la que una niña que se teletransporta al mundo online de su madre, donde tiene que llevar un libro a la cima del monte Fjoogle. Y, para los padres y madres, hemos dejado varios guiños y bromas sobre la industria SEO.Nota al margen.Hace no mucho tiempo, experimentamos con un libro de SEO para principiantes. Puedes encontrarlo aquí a la venta (en inglés).Aprendemos Juntos: la gran apuesta de BBVAMarca: BBVA.Quién lo cuenta: Iván Fanego, fundador de AppCritic y autor de “A nadie le interesan tus anuncios”, y de este post, por cierto.Aunque ya lo mencionamos de pasada en el artículo, merece la pena cubrir más en profundidad el que probablemente sea el ejemplo de branded content más potente de los últimos años.https://www.youtube.com/watch?v=--Oh8kd508MAprendemos Juntos arrancó en 2018 como un ambicioso proyecto de branded content centrado en la educación y en hacer realidad la promesa de marca de la entidad financiera: crear oportunidades.En “Aprendemos Juntos”, ni se habla de BBVA, ni habla BBVA. El foco está en expertos de talla internacional que debaten sobre metodologías, filosofía, educación y más. El formato principal son entrevistas largas (aproximadamente de una hora), que, además, se distribuyen en formato de clips cortos en redes sociales.Para distribuir el contenido, cuentan con un media partner. El País, uno de los principales medios de comunicación españoles, cuenta con secciones dedicadas a Aprendemos Juntos.El alcance va más allá del mero contenido y, con una plataforma educativa, han conseguido llevar sus métodos al 20% de institutos de España. Es decir, aportan algo real y tangible, no solo contenidos interesantes.¿Qué resultados, además de los 2.500 millones de visualizaciones y los más de 7 millones de seguidores han conseguido?El impacto va más allá de las métricas de vanidad de visualizaciones y me gusta. El público que ha sido expuesto a los contenidos de Aprendemos Juntos, muestra mayor afinidad de marca:Puedes aprender mucho más del proyecto en esta clase de UNIR.Es un proyecto de gran envergadura y con unos elevados valores de producción. Obviamente, no está al alcance de todo el mundo, pero es toda una referencia a tener en cuenta.Reflexiones finalesEn este post (o guía, o como prefieras llamarlo) hemos cubierto desde definiciones oficiales a por qué tu empresa debería plantearse el branded content como una estrategia de marketing. Hemos visto que branded content no es product placement, ni publicidad encubierta y hemos repasado los matices que lo diferencian de otras estrategias basadas en contenido como el inbound marketing o la estrategia de contenidos “tradicional”.Si tuviera que quedarme con algo, sería con este gráfico que veíamos al principio:Para que sea branded content, tiene que aportar algo que interese de verdad a nuestro público objetivo.La pérdida de efectividad de la publicidad, y sus costes crecientes, son algunos de los motivos por los que el branded content tiene cada vez más sentido, para cada vez más marcas y organizaciones.Podemos hacer branded content para fortalecer nuestra marca, posicionarnos en territorios que nos interesen o potenciar las ventas, y, en función de los objetivos que elijamos, tendremos que plantear nuestro proyecto de una u otra forma.Hemos visto también cómo podemos abordar nuestro proyecto de branded content, poniendo especial énfasis en la distribución del contenido, uno de los aspectos más olvidados.Recuerda que la mentalidad de largo plazo es algo que debes tener en cuenta, los proyectos basados en contenidos tardan más (en general, no siempre) en generar resultados, así que es algo que debes dejar claro desde el principio en tu empresa.Hemos visto cómo puedes usar técnicas SEO para dar más visibilidad a tu proyecto, pero también es algo que puedes hacer para dar forma a tu estrategia antes de lanzarla, entendiendo mejor lo que busca tu público objetivo y tus temáticas.Si has llegado hasta aquí, espero que hayas aprendido algo que te ayude a mejorar o lanzar tu proyecto de branded content.Si quieres preguntar alguna duda, añadir otro ejemplo o aportarnos cualquier matiz te esperamos en nuestro X (o Twitter, como prefieras llamarlo) en español.En la elaboración de este post hemos contado con varios profesionales destacados en el branded content del mundo de habla hispana. Aunque los hemos mencionado a lo largo del artículo, me gustaría dedicarles unas palabras adicionales de agradecimiento: sin vosotros y vosotras, no habría sido posible.Aquí tenéis la lista completa de colaboradores y colaboradoras de esta guía de Branded Content.Colaboradores de este artículoFernando de Córdoba, también conocido como Gamusino en X-Twitter, ha hecho un repaso magnífico sobre los orígenes del branded content y nos ha traído el caso de IKEA. Fernando es un consultor en marca y contenidos, con más de una década de experiencia, que ha trabajado para marcas como ING, Santander o Coca Cola. Su libro, “Los Secretos de las Marcas”, es un gran acercamiento al branding y las curiosidades.Roger Casas es fundador y CEO de El Cañonazo, agencia y productora centrada en transmedia y branded content. Además, es vicepresidente de la Branded Content Marketing Asociation- España, forma parte de la Red de Industrias Creativas RIC Crea, y es antiguo miembro del consejo de Innovación Audiovisual, y director de Industria España de MestizoLab. Recientemente, ha publicado el libro “Tu atención, por favor”, donde analiza la crisis de atención y cómo sobrevivir a ella (como empresa).Sonia Got es Social Media Manager en Mediaset España. Cuenta con un grado en Periodismo y un máster en Dirección de Comunicación y Gestión de la Publicidad por ESIC, además de tener formación en Transmedia, Branded Content, Brandverse y Big Data.Rebeca Saez, es Branded Content Manager en Havas Media Group para Telefónica España. Es consultora de marketing y contenidos en REDTORRES, y ha trabajado desde 2010 para diferentes primeras marcas especializándose en Branded Content y estrategia de contenidos en agencias como Tinkle, OMD y PHD Media.Eduardo Prádanos. Fundador y director creativo de FLUOR Lifestyle, agencia que ha ganado decenas de premios en branded content y transmedia. Director del Curso Superior en Branded Content y Transmedia Storytelling en IAB Spain.Amanda Pons, Marketing Strategist con más de 10 años de experiencia y docente en la Universidad de Nebrija, además de otras escuelas de negocio. Actualmente está finalizando su doctorado en la Universidad Complutense de Madrid, sobre la comunicación de marcas sin ánimo de lucro. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Branded content: guía completa con ejemplos"
    },
    {
      "level": "H2",
      "text": "Qué es el Branded Content"
    },
    {
      "level": "H2",
      "text": "Por qué es importante el branded content y por qué puede ser útil en tu empresa"
    },
    {
      "level": "H3",
      "text": "Crisis de la publicidad tradicional"
    },
    {
      "level": "H3",
      "text": "Crisis de la publicidad digital"
    },
    {
      "level": "H3",
      "text": "El fenómeno adblocking"
    },
    {
      "level": "H3",
      "text": "La publicidad digital (y no digital) cada vez está concentrada en menos manos"
    },
    {
      "level": "H3",
      "text": "Las personas tienden a ignorar y a no confiar en la publicidad"
    },
    {
      "level": "H3",
      "text": "Las plataformas de pago dificultan llegar a las audiencias más valiosas"
    },
    {
      "level": "H2",
      "text": "Orígenes del Branded Content"
    },
    {
      "level": "H2",
      "text": "Diferencias entre Branded content y otras disciplinas de marketing"
    },
    {
      "level": "H3",
      "text": "Product placement"
    },
    {
      "level": "H3",
      "text": "Publicidad nativa"
    },
    {
      "level": "H3",
      "text": "Inbound Marketing"
    },
    {
      "level": "H3",
      "text": "Marketing de contenidos y estrategia de contenidos"
    },
    {
      "level": "H2",
      "text": "Ventajas y desventajas de hacer branded content"
    },
    {
      "level": "H3",
      "text": "Ventajas de hacer branded content"
    },
    {
      "level": "H3",
      "text": "Desventajas de hacer branded content"
    },
    {
      "level": "H2",
      "text": "Cómo hacer branded content (y cómo el SEO puede ayudarte)"
    },
    {
      "level": "H3",
      "text": "Para quién creas branded content: analiza tu público objetivo"
    },
    {
      "level": "H4",
      "text": "Haz keyword research para entender las temáticas y tipos de contenido que interesan a tu audiencia."
    },
    {
      "level": "H3",
      "text": "Por qué haces branded content: tus objetivos"
    },
    {
      "level": "H3",
      "text": "Cuál es el tipo principal de contenido que crearás"
    },
    {
      "level": "H3",
      "text": "Dónde vas a publicar tu branded content: el modelo de distribución"
    },
    {
      "level": "H4",
      "text": "Encuentra alianzas con medios e influencers que den más alcance a tu proyecto de branded content"
    },
    {
      "level": "H3",
      "text": "Cómo crear y organizar tu proyecto de branded content"
    },
    {
      "level": "H2",
      "text": "Cómo medir acciones de Branded Content"
    },
    {
      "level": "H3",
      "text": "Para quién creas branded content: analiza tu público objetivo"
    },
    {
      "level": "H3",
      "text": "Por qué haces branded content: tus objetivos"
    },
    {
      "level": "H3",
      "text": "Cuál es el tipo principal de contenido que crearás."
    },
    {
      "level": "H3",
      "text": "Dónde vas a publicar tu branded content: el modelo de distribución"
    },
    {
      "level": "H3",
      "text": "Cosas que me hubiera gustado saber hace 10 años:"
    },
    {
      "level": "H2",
      "text": "Ejemplos de branded content"
    },
    {
      "level": "H3",
      "text": "“La escuela de decoración” de IKEA:"
    },
    {
      "level": "H3",
      "text": "“Rediséñame”, una competición de diseño de moda con ropa de segunda mano para Vinted"
    },
    {
      "level": "H3",
      "text": "“FUCK! LA FAMA”: Un branded podcast audaz que conecta con los jóvenes cinéfilos"
    },
    {
      "level": "H3",
      "text": "Salomon, cómo transmitir emociones vinculadas al deporte al aire libre"
    },
    {
      "level": "H3",
      "text": "“La LEGO Película”: cómo transformar un juguete en una experiencia de entretenimiento completa"
    },
    {
      "level": "H3",
      "text": "Branded content con libros físicos: más allá del blog de Ahrefs"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Aprendemos Juntos: la gran apuesta de BBVA"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    },
    {
      "level": "H3",
      "text": "Colaboradores de este artículo"
    }
  ],
  "author": "Iván Fanego"
}