{
  "url": "https://ahrefs.com/blog/es/busqueda-semantica/",
  "slug": "busqueda-semantica",
  "title": "¿Qué es la búsqueda semántica? Cómo impacta el SEO",
  "description": "La búsqueda semántica es un proceso de recuperación de información utilizado por los motores de búsqueda modernos para devolver los resultados de búsqueda más relevantes.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido ¿Alguna vez has notado que Google puede manejar casi cualquier pregunta que le hagas en estos días?Solo mira el resultado de esta consulta:A pesar de no mencionar a Yoda por su nombre, Google entendió de quién estábamos hablando y qué queríamos saber sobre él.Esto no sería posible sin una búsqueda semántica.En esta publicación, aprenderás:¿Qué es la búsqueda semántica?Por qué es importante la búsqueda semánticaLas tecnologías de Google que juegan un papel en la búsqueda semánticaCómo adaptar tu SEO para búsqueda semántica¿Qué es la búsqueda semántica?La búsqueda semántica es un proceso de recuperación de información utilizado por los motores de búsqueda modernos para devolver los resultados de búsqueda más relevantes. Se centra en el significado detrás de las consultas de búsqueda en lugar de la coincidencia tradicional de palabras clave.La terminología proviene de una rama de la lingüística llamada semántica, que se ocupa del estudio del significado.¿Por qué es importante la búsqueda semántica?Aunque hay innumerables variables en juego, los principios de la búsqueda semántica, por qué es necesario y cómo está influenciado son fáciles de entender.Los usuarios a menudo no usan el mismo idioma que el contenido deseadoMuchas búsquedas son involuntariamente ambiguasLa necesidad de comprender la jerarquía léxica y las relaciones entre entidadesLa necesidad de reflejar intereses y tendencias personales.Los usuarios a menudo no usan el mismo idioma que el contenido deseadoPeor aún, a veces ni siquiera sabemos cómo articular una consulta de búsqueda correctamente.Digamos que escuchaste una canción desconocida en la radio. Te gustó y empezaste a buscar letras aleatorias en Google hasta que finalmente lo encontraste.Para agregar otra capa de complejidad, compara lo que escribes en Google con lo que le dices a Siri, Alexa o al Asistente de Google. Las palabras clave ahora se convierten en conversaciones.Hay muchas maneras de expresar la misma idea, y los motores de búsqueda deben lidiar con todas ellas. Deben poder hacer coincidir el contenido de su índice con su consulta de búsqueda en función del significado de ambos.Por desafiante que pueda parecer esto, es solo el comienzo.Muchas búsquedas son involuntariamente ambiguasAlrededor del 40% de las palabras en inglés son polisémicas, tienen dos o más significados. Podría decirse que es el desafío más importante que la búsqueda semántica está tratando de resolver.Por ejemplo, la palabra clave “python” tiene 533,000 búsquedas mensuales solo en los Estados Unidos:Si alguna vez buscara “python”, probablemente me estaría refiriendo al lenguaje de programación. Pero cualquiera fuera de la industria tecnológica probablemente esperaría la serpiente real o la legendaria compañía de comedia británica.El problema aquí es que las palabras rara vez tienen un significado definitivo sin contexto. Además de las palabras polisémicas, tiene innumerables sustantivos que también pueden ser adjetivos, verbos o ambos. Y todavía estamos en el alcance de los significados literales. Se vuelve aún más interesante si profundizamos en los significados inferidos (piense en el sarcasmo).El contexto lo es todo en semántica, y nos lleva a los dos puntos restantes.La necesidad de comprender la jerarquía léxica y las relaciones entre entidadesEchemos un vistazo a la siguiente consulta de búsqueda y al resultado de búsqueda superior:Eso es realmente impresionante. Esto es lo que Google tiene que hacer para comprender esta consulta:Saber que “pareja” significa esposa / novia / esposo / novio / cónyuge.Comprender que Obi-Wan apareció en múltiples películas y series interpretadas por diferentes actores.Hacer las conexiones.Mostrar los resultados de búsqueda de una manera que refleje la ambigüedad de “obi wan”.Ni siquiera puedo imaginar qué tipo de resultados de búsqueda obtendría si hiciera esa búsqueda en 2010 o antes.Ahora, demos un paso atrás para explicar los conceptos.La jerarquía léxica ilustra la relación entre palabras. La palabra pareja es superior (hipernym) a esposa, novio, cónyuge y otros.Como se mencionó anteriormente, nuestras consultas a menudo no coinciden con la frase exacta del contenido deseado. Saber que “asequible” es cualquier cosa entre barato, de rango medio y de precio razonable es crucial.Las entidades, en este ejemplo, son personajes de películas y series (Obi-Wan), personas con un trabajo específico (actor) y personas asociadas con ellos (socios). En general, las entidades son objetos o conceptos que pueden identificarse claramente, a menudo personas, lugares y cosas.Y como si todas las complejidades del lenguaje no fueran suficientes, debemos ir más allá de eso.La necesidad de reflejar intereses y tendencias personales.Volvamos al ejemplo de “python”. Si busco esto, de hecho obtengo todos los resultados relacionados con el lenguaje de programación.No importa cuánto nos disgusten todas las formas en que se utilizan nuestros datos personales, al menos es útil para los motores de búsqueda. Google utiliza datos limitados junto con su historial de búsqueda para ofrecer resultados de búsqueda más precisos y personalizados.Todos somos conscientes de esto. Simplemente escribe cualquier tipo de servicio en tu barra de búsqueda y obtendrás resultados localizados:Pero lo que es más fascinante es la capacidad de Google para ajustar temporalmente los resultados de búsqueda en función de la intención de búsqueda que cambia dinámicamente.Por ejemplo, coronavirus no es un término nuevo. Siempre ha sido el nombre de un grupo de virus. Pero como todos sabemos, la intención de búsqueda cambió rápidamente a principios de 2020. La gente comenzó a buscar información sobre una cepa particular de coronavirus (SARS-CoV-2), y la SERP tuvo que ajustarse en consecuencia.Como puede ver en el historial de posiciones de SERP para “coronavirus” anterior, ninguno de los cinco principales resultados de búsqueda actuales se posicionó antes de 2020.Ves lo mismo en la industria del comercio electrónico durante los grandes eventos de ventas como Navidad o Black Friday. La intención de búsqueda durante ese tiempo es altamente transaccional, mientras que las personas normalmente prefieren ver comparaciones o reseñas.¿Qué tecnologías de Google juegan un papel en cómo funciona la búsqueda semántica?Google continuously pushes out algorithm updates and technologies that further improve its capabilities of understanding natural language and search intent.There are four important milestones that make the semantic search what it is in 2020.Knowledge GraphHummingbirdRankBrainBERTKnowledge GraphKnowledge Graph de Google, lanzado en 2012, es una base de conocimiento de entidades y las relaciones entre ellas.Puedes imaginarlo luciendo así, pero con cinco mil millones de entidades:En resumen, es una tecnología que inició y permitió el cambio de la coincidencia de palabras clave a la coincidencia semántica.Existen dos métodos principales para alimentar el Gráfico de conocimiento:Datos estructurados (más sobre eso más adelante)Extracción de entidad del textoPara el segundo punto, el motor de búsqueda necesita comprender el lenguaje natural. Es entonces cuando entran en juego las tres actualizaciones algorítmicas a continuación.HummingbirdEn 2013, Google lanzó un algoritmo de búsqueda llamado Hummingbird para obtener mejores resultados de búsqueda. Fue especialmente útil para consultas de búsqueda complejas.Hummingbird fue la primera actualización colosal que enfatizó el significado de las consultas de búsqueda sobre palabras clave individuales. Fue el catalizador muy necesario para escribir sobre temas, no palabras clave.RankBrainSi alguna vez has encontrado la frase Indexación semántica latente o palabras clave LSI, olvídalo. Google resuelve el problema que LSI se creó para resolver con un algoritmo llamado RankBrain.Y ya discutimos el problema anteriormente. Se trataba de la falta de coincidencia entre el lenguaje utilizado en las consultas de búsqueda y el contenido deseado.RankBrain de Google funciona con tecnologías que son muy superiores a LSI. En términos laicos, RankBrain comprende el significado de palabras y frases incluso desconocidas mediante el uso de sofisticados algoritmos de aprendizaje automático.Y eso es enorme teniendo en cuenta que el 15% de todas las consultas de búsqueda son nuevas.Podemos considerar a RankBrain como una actualización de Hummingbird, no como un algoritmo de búsqueda independiente. Es una de las señales de posicionamiento más fuertes, pero lo único que puedes hacer de manera proactiva para optimizarlo es satisfacer la intención de búsqueda.BERTLas representaciones bidireccionales de codificador de transformadores (BERT) son la gran actualización más reciente de cómo funciona la búsqueda semántica. Afecta aproximadamente al 10% de todas las consultas desde finales de 2019.No te preocupes; También me llevó bastante tiempo recordar qué significa BERT.Todo lo que necesitas saber es que BERT mejora la comprensión de oraciones y consultas largas y complejas. Es una solución para lidiar con la ambigüedad y los matices porque se esfuerza por comprender mejor el contexto de las palabras.Y aunque no puedes hacer nada para optimizar BERT per se, es bueno saber lo que significa y lo que hace en pocas palabras.Cómo adaptar tu SEO para búsqueda semánticaYa he rociado algunos consejos y sugerencias en todo el artículo. Ahora pongámonos realmente procesables.Apunta temas, no palabras claveEvaluar la intención de búsquedaUsa HTML semánticoUsar marcado de esquemaConstruir su marca para convertirse en una entidad de Knowledge GraphDesarrollar relevancia a través de enlaces1. apunta temas, no palabras claveEn los viejos tiempos de SEO, podrías haberte posicionado con piezas separadas de contenido sobre el mismo tema, pero orientadas a palabras clave ligeramente diferentes como:etiquetas de open grpahmetaetiquetas deopen graphog metaetiquetasetiqueta de open graph¿Qué es el open graph?etiquetas de open graph de FacebookEse ya no es el caso. Google ahora entiende que todas estas búsquedas significan casi lo mismo, y clasifica principalmente las mismas páginas para todas ellas.Ten esto en cuenta al crear contenido. El objetivo ya no es clasificar solo una palabra clave, sino cubrir un tema en profundidad para que Google clasifique tu página para muchas palabras clave similares y de cola larga.Por ejemplo, nuestro artículo sobre metaetiquetas Open Graph se clasifica bien para cientos de palabras clave. Muchas de estas son otras formas de buscar lo mismo, pero algunas son subtemas como “og: title”, “og url” y “og: image”.Podemos clasificar para todas estas palabras clave porque escribimos un artículo en profundidad sobre el tema, no solo sobre una sola palabra clave.Mirar este informe para una página de alto rango sobre el tema es una buena manera de entender sobre qué subtemas escribir. Por ejemplo, supongamos que deseas escribir una publicación sobre el cultivo de espárragos. Si conectas la página de clasificación superior para “espárragos en crecimiento” en el Explorador de sitios de Ahrefs y verificas el informe de Palabras clave orgánicas, verás que se clasifica para estas palabras clave, entre otras:Cuan profundo plantar espárragoscondiciones de cultivo de espárragoscuando plantar espárragosmejor lugar para plantar espárragoscómo cosechar espárragoscómo cuidar las plantas de espárragosEstas son todas las cosas que te gustaría mencionar para crear una publicación en profundidad que obtenga la mayor cantidad de tráfico orgánico posible.Sin embargo, una palabra de precaución. Dirigirse a un tema en particular no significa que debas cubrir absolutamente todo lo relacionado con ese tema o profundizar demasiado.Toma este artículo como ejemplo. Podría haber pasado decenas de horas investigando el procesamiento del lenguaje natural y profundizando en los tecnicismos de la búsqueda semántica. No hice eso porque a la mayoría de la gente no le importa.Lo que nos lleva al siguiente punto.2. Evaluar la intención de búsquedaTodavía puedes publicar contenido sobre un tema determinado que no se alinea con la intención de búsqueda.Digamos que eres un geek de los datos de marketing y ves una oportunidad para enfocarte en el tema “Informe SEO”. Naturalmente, deseas compartir todo lo que se necesitas para crear el mejor informe de SEO. Entonces se te ocurre algo como “Usa el poder de la CONSULTA para crear el mejor informe de SEO”.De hecho, puede ser el contenido que finalmente conduce al mejor informe de SEO. Pero la mayoría de las personas que buscan este tema no estarán familiarizadas con muchas funciones de hojas de Google. Solo quieren algo que pueda hacer el trabajo por ellos:Entonces, antes de comenzar a delinear una nueva pieza de contenido, mira las páginas de mayor clasificación para inferir la intención de búsqueda.Lectura recomendada: Intención del buscador: El “Factor de clasificación” pasado por alto para el que debe estar optimizando3. Usa HTML semánticoAntes de que pudiéramos avanzar a la búsqueda semántica, tuvimos que comenzar a hacer un cambio hacia una Web semántica. El concepto original de WWW podría interpretarse como documentos estandarizados entrelazados sin un significado explícito. Por ahora, debería estar claro que necesitamos un significado.Y todo comienza con tu HTML básico.Compara los siguientes elementos HTML:El HTML semántico agrega significado al código para que las máquinas puedan reconocer bloques de navegación, encabezados, pies de página, tablas o videos.HTML5 proporciona los elementos más semánticos, que los temas más modernos de CMS ya usan. Si el tuyo no lo hace, generalmente hay un complemento que puede usar para agregarlos.Pero el HTML semántico sigue siendo bastante limitado. Si bien dice, “esta es una tabla, esto es un pie de página”, no transmite el significado del contenido real. Es por eso que marcamos esquemas.4. Use schema markupSchema markup es una forma adicional de marcar sus páginas. También se conoce como datos estructurados, que se pueden describir como un marco semántico común para la Web.El vocabulario de Schema.org contiene cientos de tipos asociados con propiedades. Puedes usarlos para marcar tu contenido de una manera que sea fácil de entender para Google sin algoritmos complejos.Por ejemplo, sería más fácil para Google extraer significado de contenido estructurado como este:tiempo de cocción: 20 minutos calorías: 80… que de un lenguaje natural como este:Tardará 20 minutos en hacer los panqueques. Aún mejor, estos son panqueques bajos en calorías, alrededor de 80 por porción.Entonces, cuando un usuario quiere saber cuánto tiempo lleva cocinar un panqueque, o cuántas calorías tiene, Google puede servir la información de la mejor manera.Lecturas complementarias¿Qué son los datos estructurados? ¿Y por qué deberías implementarlo?Fragmentos enriquecidos: ¿qué son y cómo se obtienen?5. Construye tu marca para convertirte en una entidad de Knowledge GraphEl título se explica por sí solo porque ya hablé sobre entidades, por lo que solo te señalaré nuestro artículo sobre cómo ingresar al Gráfico de conocimiento.Entre todos los consejos para ajustar tu SEO a la búsqueda semántica, este es el más difícil de convertir en realidad. Es una consecuencia a largo plazo de la construcción de marca y la aplicación del resto de estos consejos.6. Desarrollar relevancia a través de enlacesLos enlaces fueron históricamente uno de los primeros indicadores de relevancia. Si el documento A está vinculado al documento B, podrían haber sido vistos como relacionados.Tanto los enlaces internos como los externos de páginas relevantes que utilizan texto de anclaje natural ayudan a Google a descubrir de qué se trata su contenido, incluso antes de procesarlo.Lecturas complementariasLa guía amigable de Noob para la construcción de enlacesCómo obtener vínculos de retroceso: 7 tácticas que no requieren nuevo contenidoCreación de enlaces a la página de recursos: la única guía que necesita9 estrategias de construcción de enlaces fáciles (que cualquiera puede usar)ConclusiónLa búsqueda semántica ha cambiado todo el ecosistema de contenido. Los usuarios obtienen contenido más relevante y valioso, y eso motiva a los editores a producir dicho contenido.Si bien existen tecnologías y algoritmos sofisticados, los principios de la búsqueda semántica son fáciles de entender. Ahora deberías estar listo para hacer los cambios necesarios y para su SEO a prueba de futuro.¿Tienes alguna pregunta o comentario sobre la búsqueda semántica? Hazme ping en Twitter.Si desea obtener más información sobre los aspectos técnicos de la búsqueda semántica, siga a Dawn Anderson y vea sus presentaciones. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es la búsqueda semántica? Cómo impacta el SEO"
    },
    {
      "level": "H2",
      "text": "¿Qué es la búsqueda semántica?"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante la búsqueda semántica?"
    },
    {
      "level": "H3",
      "text": "Los usuarios a menudo no usan el mismo idioma que el contenido deseado"
    },
    {
      "level": "H3",
      "text": "Muchas búsquedas son involuntariamente ambiguas"
    },
    {
      "level": "H3",
      "text": "La necesidad de comprender la jerarquía léxica y las relaciones entre entidades"
    },
    {
      "level": "H3",
      "text": "La necesidad de reflejar intereses y tendencias personales."
    },
    {
      "level": "H2",
      "text": "¿Qué tecnologías de Google juegan un papel en cómo funciona la búsqueda semántica?"
    },
    {
      "level": "H3",
      "text": "Knowledge Graph"
    },
    {
      "level": "H3",
      "text": "Hummingbird"
    },
    {
      "level": "H3",
      "text": "RankBrain"
    },
    {
      "level": "H3",
      "text": "BERT"
    },
    {
      "level": "H2",
      "text": "Cómo adaptar tu SEO para búsqueda semántica"
    },
    {
      "level": "H3",
      "text": "1. apunta temas, no palabras clave"
    },
    {
      "level": "H3",
      "text": "2. Evaluar la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "3. Usa HTML semántico"
    },
    {
      "level": "H3",
      "text": "4. Use schema markup"
    },
    {
      "level": "H3",
      "text": "5. Construye tu marca para convertirte en una entidad de Knowledge Graph"
    },
    {
      "level": "H3",
      "text": "6. Desarrollar relevancia a través de enlaces"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Michal Pecánek"
}