{
  "url": "https://ahrefs.com/blog/es/cac-coste-adquisicion-cliente/",
  "slug": "cac-coste-adquisicion-cliente",
  "title": "Cómo Usar & Reducir el CAC (Coste de Adquisición de Cliente)",
  "description": "El Coste de Adquisición de Cliente (CAC) es la cantidad media de dinero que gastas para adquirir un solo cliente.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido El coste de adquisición de cliente (CAC o Customer Acquisition Cost en inglés) es la cantidad media de dinero que gastas en adquirir un solo cliente.Calculas el CAC dividiendo los gastos de adquisición de cliente por el número de clientes adquiridos. Así que si consigues diez clientes nuevos con 1.000$ de gasto en marketing y ventas en un periodo concreto, la fórmula sería: CAC = 1000/10 = 10$.Es una métrica de marketing importante que es especialmente útil cuando la relacionas con el valor de vida del cliente (también conocido como LTV o CLV). Pero, como con la mayoría de cosas en analítica de datos, hay unas pocas dificultades que deberías conocer.En este artículo aprenderás:Cómo usar el CACCómo reducir tu CACCuáles son los problemas del CACCómo usar el CACCAC es una métrica promediada. No tiene en cuenta lo diverso que es el valor de tus segmentos de clientes. Es importante tener esto en cuenta porque deberías estar dispuesto a gastar más en adquirir a los clientes más valiosos.Dicho esto, hay dos formas de usar el coste de adquisición de clientes adecuadamente.1. Usa el CAC en relación al LTVCAC es un indicador de rendimiento excelente cuando lo mides junto al LTV. Eso es porque el LTV es otra “métrica monetaria” promediada.El consenso de la industria es que un ratio ideal de LTV:CAC para los negocios de SaaS (software as a service, o software como servicio) está entre 3:1 y 4:1. Así que si tu LTV es de 350$ y tu CAC es de 100$, estás justo en la mitad de esos ratios.Pero como los modelos de negocio varían, deberías hacer los cálculos por ti mismo para ver cómo los otros costes del negocio y los márgenes impactan en ese ratio. El rango 3:1 y 4:1 parece algo arbitrario y no he encontrado ningún dato o estudio que lo corrobore.Así que para ilustrar cómo los costes de la empresa pueden afectar, he creado unos pocos escenarios hipotéticos:NOTA AL MARGEN *Otros costes mensuales incluyen gastos fijos del negocio más allá del CAC, como personal e infraestructura. Al incluir estos, puedes calcular el LTV neto y el punto de inflexión en meses cuando cubres el CAC y empiezas a generar beneficios. A juzgar solo por estos números, todos estos modelos de negocio parecen tener sentido aunque los ratios LTV:CAC estén fuera del punto de referencia en dos de ellos. Sin embargo, a pesar de estos números, necesitamos profundizar en la efectividad del gasto en marketing para tomar cualquier decisión racional basada en CAC.¿Por qué? Porque reducir tu CAC y ser más efectivo en marketing no es algo que vaya necesariamente de la mano.Si el CAC es demasiado bajo, estás limitando tu exposición y gastando de menos en tus actividades de marketing. Eso puede tener buen aspecto en el papel en el corto plazo, pero te estarías perdiendo oportunidades sustanciales de crecimiento en el largo plazo.El CAC también puede crecer mucho más rápido en términos porcentuales que tu LTV mientras te mantienes con más beneficios. Un CAC de 10$ a 100$ de LTV es técnicamente peor que un CAC de 70$ a 170$ de LTV. La diferencia para cubrir tus otros costes y márgenes es de 90$ en comparación a los 100$ del segundo escenario.En conclusión, disminuir tu CAC no siempre debería ser tu objetivo. Necesitas tomar en cuenta tu LTV, crecimiento de base de clientes y efectividad general de marketing cuando pienses en ajustar tu CAC.2. Usa el CAC solo para canales de publicidad de performancePor tentador que sea, no intentes segmentar tu CAC por todos tus canales de marketing. Solo funciona para tus canales de performance como PPC (pay per click, o pago por clic).Hay dos razones para esto. Ya he hablado de la primera, así que aquí va la segunda:El CAC te encierra en la toma decisiones de corto plazo si lo relacionas con canales de marketing separados. Por ejemplo, medir el CAC en campañas de display no tiene sentido. Eso es porque estos anuncios normalmente aparecen en fases tempranas en el customer journey, cuando las personas que los ven no están listas para comprar tu producto o ni siquiera saben que existe. Por otro lado, en lo que respecta a canales de performance, Google Ads incluso tiene un equivalente al CAC integrado. Se llama Coste Por Conversión (Cost Per Conversion):Vista de grupo de anuncios en Google Ads.Podemos tomar este coste por conversión específico de un canal y usarlo para optimizar el rendimiento de ese canal.Pero puede que estés pensando que eso no refleja el CAC por completo. Cierto, solo cubre el coste del último paso en el customer journey. Pero es lo mejor que podemos hacer aquí, ya que no puedes atribuir el coste de otros canales a este.La atribución es asignar crédito a canales de marketing que han contribuido a la conversión. Imagina un jugador de fútbol marcando un gol después de recibir un pase de otros tres jugadores y uno más que ha allanado el camino. Todos han sumado para marcar el gol. Pero algunos negocios no pueden hacer que esto funcione igual en marketing.Los informes por defecto en Google Analytics funcionan con un modelo defectuoso de atribución “último clic no-directo” (last-non direct click). Esto es como darle el 100% del crédito al jugador que marcó el gol. Este jugador podría ser una analogía de canales de marketing de performance, que son los que normalmente se llevan todo el crédito. Hablaré un poco más sobre atribución en la sección de problemas del CAC.En conclusión: si intentas contabilizar el CAC para todos tus canales, entrarás en problemas de atribución, y no estarías contando con otros canales enfocados en marca.Cómo reducir tu CACEspero que esté quedando claro que siempre debes tratar de conseguir la máxima efectividad, lo que no necesariamente significa reducir tu CAC. Pero no hay duda de que deberías equilibrar tu publicidad pagada con canales de marketing y tácticas más baratas y, a menudo, más sostenibles.Aquí van unas formas para reducir tu CAC intrínsecamente:Con SEO y marketing de contenidosLa búsqueda orgánica es el principal generador de tráfico y conversión para muchos negocios, incluido el nuestro:Datos de Ahrefs Site Explorer.La belleza del SEO es que es un canal apropiado para todas las fases del embudo de marketing—desde el descubrimiento a la retención. La gente busca en Google todo el rato.Así que no solo el SEO puede hacer crecer tu negocio por sí mismo, también ayuda enormemente a tus otros canales—como anuncios pagados de búsqueda. Esto es porque normalmente pujas por palabras clave más cercanas a la fase de conversión, pero una estrategia de marketing de contenidos sólida incluye contenido a lo largo de todo el customer journey.En otras palabras, la combinación de un gran SEO y PPC asegura que tu marca esté presente a lo largo de todo el customer journey. La probabilidad de que la gente convierta sería más baja si solo supieran de tu marca una vez que están listos para la compra.Por ejemplo, nuestro artículo “¿Qué es HTTPS? Todo lo que tienes que saber” no está enfocado en un tema que la gente suela buscar cuando están listos para registrarse en un conjunto de herramientas SEO. Pero es un contenido relevante de “top-of-the-funnel” (de las primeras fases del embudo) porque algunos usuarios tienen webs y puede que quieran afrontar el SEO en el futuro.Promocionar un artículo como este con anuncios de búsqueda sería un gasto cuestionable en el mejor de los casos. Pero gracias al SEO, este artículo recibe casi 30 mil clics desde búsqueda orgánica cada mes. Esto nos costaría más de 12.000$ si lo pagáramos el tráfico en Google Ads:Y esto sin tener en cuenta que ni siquiera podrías obtener tantos clics de Google Ads. Porque la mayoría de la gente se salta los anuncios y hace clic solo en resultados orgánicos.Claro, para las keywords más cercanas a la fase de conversión a menudo quieres que tu web aparezca tanto en resultados orgánicos como pagados. Posicionar más alto en los resultados de búsqueda orgánica para palabras clave competitivas puede generar tráfico “gratis” que de otra forma podría costarte cientos o miles de dólares en Google Ads:Informe de Mejores Páginas en Ahrefs Site Explorer ordenadas por el valor de cada página, si pagáramos por los clics en Google Ads.Con Optimización de la Tasa de Conversión (CRO, Conversion Rate Optimization)CRO es el proceso de ajustar tu web o app para convertir un mayor porcentaje de visitantes.Si no optimizas tu web o app para conversiones, es altamente ineficiente—incluso si atrae montones de visitantes. CRO es quizá una de las formas más eficientes de hacerte ganar más dinero y disminuir tus costes de adquisición.Pongamos que llevas 100.000 usuarios a tu web cada mes, el 5% se registran para una prueba gratuita, de los cuales el 15% convierte a una suscripción de 100$/mes. Tu gasto de marketing mensual es de 100.000$.En este caso simplificado puedes ver cómo el incremento de tu tasa de conversión influye en los ingresos y el CAC:Si incrementas tus tasas de conversión en un 30%, tu CAC cae un 41% y tus ingresos crecen un 69%. Y no has hecho nada para que más gente vaya a tu web; solo has trabajado con los que ya tenías.CRO es un campo completo de marketing que es bastante complejo. Necesitas saber sobre UX, copywriting, economía conductual, testeo de usuarios, analítica y estadística.Puedes intentar aprender CRO por ti mismo porque es útil para todo el marketing. Pero invertir en un especialista CRO es probablemente una de las formas más rápidas y efectivas de obtener retorno en tu gasto en marketing.TIPLo que ves por defecto en los informes de Google Analytics en los objetivos o tasas de conversión de e-commerce se basa en el número de sesiones, no de usuarios. Ten esto en cuenta cuando revises las conversiones a nivel de usuario, como registros o pagos. Puedes crear una métrica personalizada de tasa de conversión en base a usuarios.Crea un equilibrio sólido entre marketing de performance y construcción de marcaAunque en realidad no puedes atribuir las actividades de construcción de marca a conversiones, juegan un papel crucial en convertir a los visitantes en clientes. Pero no es algo que pase de un día a otro.De hecho, si estás por detrás con la construcción de marca, en realidad va a incrementar tu CAC en el corto plazo (~1 año), porque estas actividades no tienen un efecto inmediato en tus ventas. Pero compensará mucho en el largo plazo, incluyendo un mejor CAC.Como regla general, el equilibrio ideal entre gasto en marketing para incremento de ventas y para construcción de marca es más o menos 40:60. Es uno de los conceptos de marketing más importantes a tener en cuenta.Existe mucha investigación sobre esto. La lección clave es que está demostrado que la construcción de marca es el principal generador de crecimiento y éxito en el largo plazo.¿Cuáles son los problemas del CAC?Ya he mencionado que el CAC es una métrica promediada con problemas de atribución. Voy a desarrollar esto algo más antes de profundizar en otros dos problemas menores.Los problemas de atribución para conseguir más datos granularesLa segmentación más útil que podrías hacer con el CAC sería con tus segmentos de clientes. Por ejemplo, si miras nuestro modelo de precios, estamos dispuestos a gastar muchas veces nuestro CAC medio en adquirir clientes para el plan de Agencia:Pero es casi imposible conseguir datos fiables para saber que gastamos X$ en el segmento A o Y$ en el segmento B, que es lo que necesitaríamos para este cálculo. La mayor parte de los canales de marketing apuntan a varios segmentos.Hay algunas soluciones posibles para crear modelos de atribución más fiables, pero normalmente necesitan de montones de datos y recursos para crear un ecosistema de datos personalizados. E incluso esto no puede resolver algunos de los problemas de atribución a los que algunos negocios B2B se enfrentan al dirigirse a segmentos de gran empresa.Por esta razón, sugeriría a la mayor parte de la gente mantenerse con fórmulas fáciles de CAC.Ten en cuenta tu ciclo de ventaEs intuitivo tomar el gasto mensual en marketing y ventas y dividirlo por el número de nuevos clientes que has conseguido ese mes. También hice eso en los ejemplos. Pero esto solo puede funcionar si tu gasto es de alguna forma constante mes tras mes.El problema reside en el ciclo de tu negocio. Si consideramos los nuevos usuarios de marzo, una parte significativa de los mismos convirtieron gracias a las actividades de marketing en febrero o incluso antes.Vale, es imposible hacer seguimiento hacia atrás de todo, pero deberías saber cuántos días de media lleva a tus visitantes convertir desde su primera visita. Si tienes una prueba de 14 días, entonces el ciclo medio de venta estará probablemente entre 2 y 4 semanas. Considera meses para los clientes de gran empresa.Así que si quisieras calcular el coste de clientes adquiridos en marzo y tu ciclo medio de venta es de 4 semanas, deberías usar tu gasto de marketing de febrero en la fórmula.Es más útil para empresas establecidasSi casi nadie en tu mercado sabe de ti, no será fácil mantener el CAC en un rango razonable. Conseguir tus primeros clientes es un reto.Por esta razón, te recomendaría empezar a usar el CAC cuando ya tengas al menos un canal de marketing generando clientes de forma consistente.Reflexiones finalesComo pasa con todas las métricas de marketing, no deberías obsesionarte con el CAC. Es una métrica importante, pero ya deberías saber por qué puede no ser el mejor KPI de marketing. Recuerda los obstáculos y el resto de aspectos cuando analices el CAC.¿Tienes otras perspectivas sobre el CAC? ¿Quieres preguntar algo sobre esta métrica? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el primer directorio de herramientas de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Usar & Reducir el CAC (Coste de Adquisición de Cliente)"
    },
    {
      "level": "H2",
      "text": "Cómo usar el CAC"
    },
    {
      "level": "H3",
      "text": "1. Usa el CAC en relación al LTV"
    },
    {
      "level": "H3",
      "text": "2. Usa el CAC solo para canales de publicidad de performance"
    },
    {
      "level": "H2",
      "text": "Cómo reducir tu CAC"
    },
    {
      "level": "H3",
      "text": "Con SEO y marketing de contenidos"
    },
    {
      "level": "H3",
      "text": "Con Optimización de la Tasa de Conversión (CRO, Conversion Rate Optimization)"
    },
    {
      "level": "H3",
      "text": "Crea un equilibrio sólido entre marketing de performance y construcción de marca"
    },
    {
      "level": "H2",
      "text": "¿Cuáles son los problemas del CAC?"
    },
    {
      "level": "H3",
      "text": "Los problemas de atribución para conseguir más datos granulares"
    },
    {
      "level": "H3",
      "text": "Ten en cuenta tu ciclo de venta"
    },
    {
      "level": "H3",
      "text": "Es más útil para empresas establecidas"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek"
}