{
  "url": "https://ahrefs.com/blog/es/certificacion-seo/",
  "slug": "certificacion-seo",
  "title": "Certificaciones SEO: ¿Merecen Realmente la Pena?",
  "description": "Las certificaciones SEO se otorgan a aquellas personas que completan un curso SEO y demuestran su conocimiento al completar un test o cuestionario.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Si quieres aprender SEO, puedes juntar todas las piezas a partir de blogs y vídeos o hacer un curso de SEO. Pero, ¿qué pasa con una certificación SEO?Tras pasar horas investigando las certificaciones SEO y tomar tres de ellas (mira mis tres certificados) mi opinión es esta:La mayoría de las certificaciones SEO no merecen la pena.Explicaré por qué en este artículo. Pero, primero, vamos a cubrir lo básico…Qué son las certificaciones SEODónde encontrar certificaciones SEO de GooglePor qué no siempre las certificaciones SEO merecen la penaLas mejores certificaciones SEO¿Qué es una certificación SEO?Las certificaciones SEO se otorgan a aquellos que completan un curso SEO y demuestran su conocimiento terminando un test o cuestionario.Es la última parte la que diferencia un certificado SEO de un curso de SEO.Para que algo cuente como certificación SEO:Debe haber un cuestionario/prueba en el que puedas aprobar o fallar.Después de pasar el cuestionario/prueba el proveedor del curso debe ofrecer una prueba de tu logro—normalmente en forma de un certificado o insignia.Aquí tienes el aspecto que puede tener:¿Existe un certificado SEO de Google?Más o menos.Google ofrece una certificación de “Fundamentos de Marketing Digital” a través de su Digital Garage (Google Actívate en España, Garage Digital en Latinoamérica). Incluye 26 módulos, ~14 horas de material y cubre muchos aspectos del marketing digital—con tres dedicados exclusivamente al SEO. Está acreditado por IAB Europa (Interactive Advertising Bureau Europe) y The Open University.Google también ofrece la certificación de “SEO Fundamentals” (Fundamentos de SEO) en el Digital Garage. Es gratis, tiene ~2.5 horas de material, cubre las cuatro facetas principales del SEO (on-page, off-page, keyword research, técnico) y fue creado por la Universidad de California, Davis.Si buscas aprender Google Analytics, también está la Certificación de Google Analytics. Lee esto para aprender más sobre cómo superar el Examen de Calificación Individual y dónde encontrar tu certificado.Por qué probablemente las certificaciones SEO no merecen la penaSi quieres un certificado SEO que añadir a tu CV y LinkedIn para atraer ofertas de empleo tengo malas noticias: la mayoría de empleadores no se preocupan por tus certificaciones SEO.¿Cómo lo sabemos?Preguntamos a 15 responsables de contratación por las capacidades y requisitos que consideran importantes a la hora de contratar a un especialista SEO. El 86% dijo que las certificaciones SEO no son importantes, mientras que el resto decía que son solo algo importantes. Ningún responsable de contratación dijo que fueran muy importantes.Pero esta no es la única razón por la que las certificaciones SEO probablemente no merezcan la pena para la mayoría. Aquí van algunas más:Las certificaciones SEO no garantizan una buena formación SEORecibir un certificado SEO no significa necesariamente que hayas aprendido algo útil. Solo significa que has aprendido algo. Así que no permitas que un certificado nuble tu juicio al aprender SEO. Si el temario no te parece útil, ni te molestes.Las certificaciones SEO solo te enseñan teoría, no habilidades prácticasSi quieres convertirte en un experto SEO, mi consejo es montar una web tan pronto como puedas después de aprender las bases del SEO. Eso es porque saber la teoría solo te puede llevar hasta cierto punto. Ensuciarte las manos intentando posicionar una web te enseñará más que una certificación SEO.Las certificaciones SEO llevan mucho tiempoMira la duración de la certificación de Google en Marketing Digital de arriba: hay 14 horas de material. No es una cantidad despreciable de tiempo que pasar en una certificación SEO. Hay un coste de oportunidad, ya que podrías pasar ese tiempo construyendo y posicionando una web. Como dije arriba, ese es probablemente un uso mejor de tu tiempo si ya sabes las bases del SEO.Las certificaciones SEO normalmente se enfocan en lo básicoProbablemente haya algunas certificaciones SEO que profundicen en un área de SEO como keyword research o SEO técnico, pero las que he encontrado eran bastante básicas. No es algo malo si eres nuevo en SEO, pero hay formas más rápidas de aprender lo básico, como nuestra guía para principiantes al SEO o nuestro breve curso en vídeo “SEO para principiantes”.Las certificaciones SEO son solo estratagemas de marketingPasar una certificación SEO te da un certificado (y, a veces, también una insignia). Puedes mostrar esto en tu CV, perfil de Linkedin, web, donde sea. Eso incrementa el conocimiento de marca para el creador de la certificación SEO. Creo que es por lo que muchas son fáciles de aprobar. Los aprobados generan conocimiento de marca.¿Cuál es la mejor certificación SEO?Después de investigar innumerables certificaciones SEO y tomar tres de ellas, mi opinión es que no hay una “mejor certificación SEO”. No puedo recomendar ninguna de las que he completado—al menos no por la certificación.Si solo estuviera juzgando estas “certificaciones” por el contenido del curso, sería otra historia.Todas las “certificaciones” que he tomado tenían vídeos bien producidos, conceptos bien explicados y compartían en general un buen conocimiento SEO. La certificación de Fundamentos SEO de Google tenía una música de fondo irritante y tenía aspecto de pasada de moda, pero es un tema menor.Es el examen y la certificación lo que decepciona en estos cursos, en mi opinión.Para empezar, si has fallado en el examen, puedes volver a repetirlo poco después (entre 0 y 12 horas) después de tu intento inicial. Puede sonar como algo positivo si quieres aprobar, pero disminuye el valor del certificado. Si las cosas fueran así en los exámenes de la universidad, el mercado laboral pronto se saturaría con graduados y los títulos perderían mucho de su valor.Pero esto no es nada comparado con los exámenes en sí mismos…Aquí van algunas de las preguntas en uno de los exámenes:Pregunta 1:¿Cuál de los siguientes tipos de enlaces beneficiará a la autoridad de un sitio? Elige dos respuestas:Enlaces ganados a partir de gran contenidoEnlaces de redes de blogsEnlaces de sitios relacionados con la industriaEnlaces pagadosEnlaces recíprocosSi eres nuevo en SEO, el problema aquí es que todos los enlaces son “beneficiosos” para la autoridad de un sitio. Eso no quiere decir que todos los tipos de enlaces te ayuden a posicionarte más alto en Google, pero eso no está relacionado con la autoridad del sitio.Aquí va otra pregunta de un examen diferente:Pregunta 17 de 60¿Verdadero o Falso? ¿Deberías usar guiones, guiones bajos o espacios entre las palabras en tus URLs?VerdaderoFalsoEsta no es en realidad una pregunta de verdadero o falso, ya que Google recomienda que uses guiones normales mejor que guiones bajos en las URLs.Aquí va otra pregunta, esta vez de la certificación de Fundamentos SEO de Google:¿Cuál de los siguientes es un aspecto del SEO on-page?Desarrollar enlaces hacia tu sitioAcompañar en redes socialesMejorar el código fuenteOptimizar las palabras clave del sitioIncorrecto: por favor, revisa el vídeo de “Introducción al SEO on-page”.Puedes ver que lo hice mal. Imagino que la respuesta correcta es “optimizar las palabras clave del sitio”, pero de verdad que no tengo ni idea de lo que quiere decir. Parece algo que podrías haber visto en Warrior Forum en 2009.Resumiendo, la parte del certificado parecía una ocurrencia posterior en todas las certificaciones que terminé. Parecía que alguien había creado el curso y después había puesto a otra persona con muchos menos conocimientos a ver el curso y crear el examen.¿Quiere decir esto que es igual para todas las certificaciones SEO?Probablemente no. Hay varias otras certificaciones SEO, así que puede que las certificaciones de pago tengan más calidad.Aquí van unas pocas certificaciones pagadas en SEO que aparecieron durante mi investigación: ClickMinded SEO Training - 997$ Moz SEO Essentials - 595$ Yoast All-around SEO Training - 89£/añoPara ser claro, no tomé ninguna de estas certificaciones. Son solo las que encontré que eran realmente certificaciones SEO (no cursos) y que fueron creadas por empresas/personas reputadas.Si te preguntas por qué no incluyo otros recursos populares (por ejemplo, “SEO That Works” de Brian Dean) que habitualmente aparecen en listas de “certificaciones SEO”, es porque no son certificaciones. Son cursos. No hay examen o certificado.Nuestro curso SEO para principiantes es igual. No tiene un examen o certificado al final, pero es un gran sitio para empezar si eres nuevo en SEO:https://www.youtube.com/watch?v=xsVTqzratPsReflexiones finalesLa mayoría de responsables de contratación SEO ven los certificados por algo poco importante al contratar especialistas SEO, y yo estoy de acuerdo. No buscaría certificados SEO en CVs si estuviera contratando porque sé que muchos se pueden pasar con una mezcla de ensayo y error y sentido común.Así que, aquí va mi consejo:Si quieres incrementar tu conocimiento en SEO, encuentra un buen curso de SEO (aquí está el nuestro gratis) y después pon en práctica lo que aprendas.Si quieres conseguir un trabajo, haz lo mismo, porque los resultados hablan más alto que un “certificado SEO”¿Alguna pregunta? ¿En desacuerdo con mi opinión? Debatamos en Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software. En esta guía te explica cómo sacar partido a WhatsApp Business. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Certificaciones SEO: ¿Merecen Realmente la Pena?"
    },
    {
      "level": "H2",
      "text": "¿Qué es una certificación SEO?"
    },
    {
      "level": "H2",
      "text": "¿Existe un certificado SEO de Google?"
    },
    {
      "level": "H2",
      "text": "Por qué probablemente las certificaciones SEO no merecen la pena"
    },
    {
      "level": "H3",
      "text": "Las certificaciones SEO no garantizan una buena formación SEO"
    },
    {
      "level": "H3",
      "text": "Las certificaciones SEO solo te enseñan teoría, no habilidades prácticas"
    },
    {
      "level": "H3",
      "text": "Las certificaciones SEO llevan mucho tiempo"
    },
    {
      "level": "H3",
      "text": "Las certificaciones SEO normalmente se enfocan en lo básico"
    },
    {
      "level": "H3",
      "text": "Las certificaciones SEO son solo estratagemas de marketing"
    },
    {
      "level": "H2",
      "text": "¿Cuál es la mejor certificación SEO?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}