{
  "url": "https://ahrefs.com/blog/es/checklist-seo-on-page/",
  "slug": "checklist-seo-on-page",
  "title": "Una checklist completa de SEO on-page para 2024",
  "description": "La checklist más completa de SEO on-page para 2024 para que Google comprenda de qué trata tu página.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Si has invertido tiempo y esfuerzo en escribir un contenido de calidad, no te olvides del SEO on-page (es decir, del que haces en la propia página que acabas de crear). Ayuda a Google a comprender de qué trata tu página y a llegar a la mayor cantidad de personas posible en los resultados de búsqueda.Además, muchas de las mejoras de SEO on-page (recuerda, ese SEO que haces directamente en la página) son muy rápidas y fáciles de realizar.Usa esta checklist para alcanzar la perfección en lo que respecta al SEO on-page:Si lo que buscas es esta misma lista en formato interactivo y lista para reutilizar, aquí va en otros formatos.Hojas de cálculo de GoogleMicrosoft ExcelDocumentos de GoogleMicrosoft WordPDFVamos a hacer un repaso rápido.☑ URL descriptiva breveGoogle dice que es mejor usar palabras que sean relevantes para tu contenido en las URL de las páginas, por lo que tienes que evitar URL aleatorias y galimatías como dominio.com/734/834753956756. Es mejor usar algo breve y descriptivo como dominio.com/hombre/camisas.Solo te llevará unos 2 segundos cambiar este parámetro en la mayoría de CMS (sistemas de gestión de contenido, Content Management System).Si no tienes claro qué palabras o frases utilizar, la palabra clave principal suele ser una buena opción. Eso es lo que hacemos en el blog de Ahrefs el 90% de las veces.Por ejemplo, nuestra palabra clave objetivo para esta publicación es “checklist seo on page”, así que esa es la URL de la publicación: /checklist-seo-on-pageAlgunas prácticas recomendadas a tener en cuenta:Evita repetir palabras. Si tu página trata sobre camisas para hombres y ese apartado está dentro de la subcarpeta /hombres/, no tienes que repetir la palabra “hombres”. Es mejor usar directamente algo como dominio.com/hombre/camisas/ que dominio.com/hombre/camisas-hombre/Evita las fechas. Si un buscador encuentra algo como dominio.com/blog/2020/consejos-moda/ en 2024, asumirá que está desactualizado, aunque actualizaras el contenido ayer. Es mejor usar algo como dominio.com/blog/consejos-moda.Evita ser demasiado específico. Si tu URL es dominio.com/blog/20-mejores-consejos-moda/, quedará raro si añades más consejos a tu publicación. Usar algo menos específico, como dominio.com/blog/mejores-consejos-moda/, te dará más libertad.Lecturas complementariasCómo Crear URL amigables con el SEO (paso a paso)☑ Etiqueta de título y meta descripción convincentesGoogle dice que las etiquetas de título suelen ser la información principal que utilizan las personas que están usando buscadores para decidir en qué resultado hacer clic. Si el tuyo es aburrido y monótono, probablemente no recibirás todos los clics que deberías, incluso aunque posiciones bien.Lo mismo ocurre con las metadescripciones, que Google suele usar para el fragmento descriptivo.No existe un enfoque único para las etiquetas de título, pero la fórmula ABC es un buen punto de partida para las publicaciones de blogs:Para la metadescripción, mi consejo es tratar de ampliar tu título para ofrecer más detalles y contexto.Si te resulta difícil o simplemente prefieres una solución rápida, puedes usar nuestro generador gratuito de etiquetas de título con IA y nuestro generador de metadescripciones. Dile a las herramientas de qué trata tu página y el tono de escritura que deseas y generarán algunas opciones.Recuerda también que deben ser breves y concisas. Si son demasiado largas, se cortará alguna palabra en los resultados de búsqueda. Esto queda raro y hace que parezca menos profesional. Puedes utilizar una herramienta gratuita como esta para verificar el aspecto antes de publicar, o Site Audit de Ahrefs para encontrar todos los problemas de tu web.Lecturas complementarias¿Qué son los títulos SEO? Te enseñamos cómo crear las title tagsMetadescripción: qué es y cómo escribirla☑ Asegúrate de que el título está en H1Google recomienda usar solo un H1 por página. Tiene sentido usarlo para el título de tu página, ya que H1 es el titular de mayor nivel.La mayoría de CMS (sistemas de gestión de contenido) hacen esto automáticamente, pero puedes verificar que tu título esté en H1 de forma gratuita con la barra de herramientas SEO de Ahrefs.Simplemente haz clic en la pestaña Content (contenido):Si el texto que debería estar en H1 no lo está, ¡habla con tu equipo de desarrollo!Lecturas complementarias¿Qué es una etiqueta H1? Consejos y prácticas SEO☑ Ve al grano rápidamenteLa gente quiere lo que les prometiste en tu título y metadescripción, así que no te andes con tonterías. Ve al grano y dale a la audiencia aquello que vino a buscar en la primera frase.No existe una forma única de hacer esto. Todo depende de lo que busquen las personas.Por ejemplo, cuando las personas buscan “plantilla gratuita de plan seo”, quiere encontrar… una plantilla. Por eso la incluí al principio del artículo:Pero cuando las personas buscan “mejor auricular” quieren varias recomendaciones argumentadas.☑ Subtítulos descriptivosJohn Mueller de Google dijo que el gigante de las búsquedas utiliza titulares para ayudar a comprender mejor el contenido de una página. Por eso debes asegurarte de que sean claros y descriptivos.Es fácil fallar en este punto. Nosotros también hemos sido culpables en más de una ocasión.Por ejemplo, mira estos dos subtítulos de nuestra lista de consejos para blogs:¿Tienes alguna idea de lo que significan a primera vista?Yo tampoco. Y muchos otros subtítulos de nuestra publicación tampoco estaban claros.Si sospechas que te podría pasar lo mismo, prueba esto: pídele a ChatGPT que los reescriba para que sean más claros.Esto es exactamente lo que hizo Sam para nuestra publicación, y ChatGPT aclaró los títulos en segundos.Por ejemplo, “Crea un proyecto ‘haz 100’” podría convertirse en “Lanza un Proyecto de 100 Artículos para el Blog”.Asegúrate de que tus subtítulos tengan la jerarquía adecuada. Eso ayuda a Google a comprender la estructura y facilita la lectura a los lectores.☑ Cumple con la intención de búsquedaLa intención de búsqueda es el motivo detrás de la búsqueda, lo que trata de resolver la persona que la escribe en un buscador. A menos que tu página se alinee con la intención y ofrezca a las personas lo que buscan, tus posibilidades de posicionarte son casi nulas.Para mostrar lo importante que es esto, mira este gráfico:Esto muestra nuestra posición en el ranking de la palabra clave “comprobador de enlaces” (backlink checker) a lo largo del tiempo. Puedes ver que a finales de 2018, de repente pasamos de tener dificultades para posicionarnos por encima del puesto número 5 a ocupar constantemente el puesto número 1.¿Cómo? Optimizando nuestra página para la intención de búsqueda.Este era el aspecto de la página antes del cambio:Así es ahora:Dejando a un lado los pequeños ajustes de diseño, hay una diferencia importante: ahora hemos integrado un comprobador de enlaces gratuito. Antes, simplemente pedíamos a las personas que iniciaran una prueba de nuestro software SEO.Al atender a lo que las personas realmente querían, mejoramos el posicionamiento de la página y su tráfico de búsqueda estimado de ~18.000 pasó a ~215.000 visitas mensuales. ¡Eso supone multiplicar los resultados por 12!Pero, ¿cómo sabíamos lo que querían las personas?Por aquel entonces, teníamos que hacer un análisis manual de los principales resultados de búsqueda. Todavía puedes hacerlo, pero es mucho más fácil hacer clic en el botón “Identificar intenciones” en Keywords Explorer:Así usarás IA para analizar los principales resultados de búsqueda y saber qué quieren conseguir las personas cuando buscan esas palabras clave.Lecturas complementariasCómo optimizar para la intención de búsqueda☑ Cubre el tema por completoAlinear tu contenido con la intención de búsqueda no es suficiente. También debes cubrir el tema en su totalidad para darle a las personas todo lo que necesitan saber. Esto puede ayudarte a posicionarte en más palabras clave, así como a generar más tráfico.Para encontrar lo que buscan las personas, busca subtemas comunes entre las páginas mejor posicionadas.Hay algunas maneras de hacerlo.Revisa manualmente las páginas mejor posicionadasBusca tu palabra clave objetivo en Google, abre algunas páginas de las mejor posicionadas y revisa los puntos en común.Por ejemplo, muchos de los mejores resultados de “mejores CRM” cuentan con una sección de características o funcionalidades:Revisa otras palabras clave en las que se posicionan las mejores páginasLas páginas suelen posicionarse en palabras clave relacionadas con los subtemas que cubren. Si ves que muchas páginas posicionadas para tu palabra clave principal también posicionan para esas palabras clave relacionadas, probablemente sea un subtema importante.A continuación te contamos cómo encontrar estas palabras clave:Ve a la herramienta de Análisis Competitivo en AhrefsIntroduce la URL de tu página en el campo “Este objetivo no se posiciona por”. (Si aún no has publicado la página, introduce la URL que quieras usar).Ingresa las URL de algunas páginas similares bien posicionadas en los campos “Pero estos competidores sí”.Busca palabras clave que representen subtemas.Por ejemplo, los tres primeros resultados de “mejores crm” también se encuentran entre los 10 primeros para muchas palabras clave relacionadas con pymes y pequeñas empresas:Esto te indica que hablar de CRM que es bueno para pequeñas y medianas empresas es importante.Encuentra subtemas con la ayuda de la IAActualmente está en versión beta, pero el nuevo AI Content Grader de Ahrefs encuentra subtemas “que faltan”. Para hacerlo, compara el contenido de las tres páginas mejor posicionadas para tu palabra clave objetivo con su contenido.Para usarlo, simplemente introduce tu palabra clave objetivo y la URL de tu página (si aún no la has publicado, usa la URL que vayas a usar).Por ejemplo, aquí está una de sus sugerencias para la palabra clave “mejores zapatillas para correr para pies planos”:☑ Aporta “información adicional”La información adicional o “ganancia de información” es una medida de cómo de único es tu contenido. Google describe un mecanismo para puntuar esto en una patente concedida en junio de 2022.Dos meses después, en agosto de 2022, Google lanzó la actualización de contenido útil, que describieron como “parte de un esfuerzo mayor para asegurarnos de que se muestre más contenido original y útil, creado por personas y para personas, en los resultados de búsqueda”.¿Están relacionadas estas dos cosas? Nadie lo sabe. Pero lo que sí sabemos es que Google se preocupa por la originalidad del contenido que muestra y, casi con seguridad, cuenta con mecanismos para identificar dicha originalidad.Esto significa que cubrir lo que cubren otras páginas que ya están en las primeras posiciones no es suficiente para una página bien optimizada. También necesitas aportar algo nuevo y valioso.Por ejemplo, mi compañero Chris recopiló datos sobre cómo la gente gestiona los enlaces de baja calidad para su publicación sobre cómo eliminar enlaces:Ryan entrevistó a tres especialistas en marketing B2B para obtener información única para su publicación sobre marketing de contenidos B2B:Iván Fanego se apoyó en los ejemplos de varios profesionales para elaborar su guía de Branded Content:Y trabajé con Patrick Stox para crear un flujo de trabajo interactivo y una plantilla para mi guía de auditoría de contenido:Ninguna de estas publicaciones es completamente única. Contienen mucha información que probablemente puedas encontrar en otros lugares, y no pasa nada. Lo que importa es que aportemos al menos algo nuevo.☑ Muestra experiencia y conocimientosLos algoritmos de Google están diseñados para mostrar contenido que demuestre E-E-A-T: Experiencia, Expertise, Autoridad y Confianza.Si eres una persona experta en tu campo o creas tu contenido a partir de una experiencia personal, tu página ya tiene E-E-A-T. Pero nadie lo lo sabrá sin leerlo, por lo que debes intentar mostrarlo de la manera más obvia posible en la página. Veamos dos formas de hacer esto.Muestra tus credencialesSanitas hace esto muy bien. Lo primero que ves en su blog es que el contenido está validado por profesionales:Destaca lo que te hace singularSi has dedicado tiempo y esfuerzo a agregar información adicional o “ganancia de información” a tu contenido, no lo entierres. Asegúrate de que se vea cuanto antes para que las personas sepan que pueden confiar en ti.Por ejemplo, para seleccionar nuestra lista de los mejores grupos de Facebook para SEO, les pedimos a los más de 12.000 miembros de nuestro grupo exclusivo para clientes que votaran por sus favoritos. En lugar de enterrar este hecho en lo más profundo de la publicación, lo destacamos en el primer párrafo.Así que pedimos a los 12.200 miembros de Ahrefs Insider, nuestro grupo de Facebook solo para clientes, que votaron por sus favoritos.Lecturas complementariasE-E-A-T es el nuevo E-A-T. Lo que significa la nueva “E” para el SEO.☑ Buena legibilidadPara que una página quiera enlazar con la tuya (algo que es un importante factor de posicionamiento) y se comparta, las personas deben consumir el contenido. Esto no sucederá si es difícil de leer.Puedes utilizar herramientas gratuitas como Hemingway y Grammarly si escribes en inglés o Lorca si escribes en español para arreglar esto.Por ejemplo, Hemingway le da a mi guía sobre enlaces tóxicos un nivel de lectura de 7:Y Lorca puntúa la introducción de este mismo artículo que estás leyendo con un 70:Dado que el 54% de los estadounidenses carece de competencia literaria (esencialmente leyendo por debajo del equivalente a un nivel de sexto grado) y que solo un tercio de los españoles puede leer un texto largo, esto implica que estamos resultando confusos para gran parte de los lectores. Si pudiéramos bajar el nivel de dificultad, más personas podrían leerlo.Nota al margen.Esto no es absolutamente necesario para todos los temas. Depende de quién sea tu audiencia. Si se trata de temas técnicos o complejos, no te preocupes. Pero si publicas contenido para las masas, la accesibilidad es importante.Aquí hay algunos consejos más para mejorar la legibilidad:Utiliza oraciones y párrafos cortos.Utiliza listas con viñetasUsa imágenes☑ Optimiza para conseguir fragmentos destacadosLos fragmentos destacados ofrecen una respuesta breve directamente en los resultados de la búsqueda.Pero esto es lo interesante: Google extrae el fragmento de una de las páginas mejor posicionadas. Esto significa que si tu página ya se encuentra entre las 10 primeras palabras clave en las que Google muestra un fragmento destacado, es posible que exista la oportunidad de conseguirlo sin mucho esfuerzo.Esto es exactamente lo que logré hacer hace un par de meses, lo que generó un aumento de ~38,9% en el tráfico de búsqueda estimado a nuestra página:Esto es lo que pasó:En Site Explorer de Ahrefs, usé el informe de Palabras clave orgánicas para encontrar las 10 clasificaciones de palabras clave principales de la página con fragmentos destacados que no eran de nuestra propiedad.Me di cuenta de una tendencia: muchas de las palabras clave eran de personas que buscaban lo más buscado en Google (singular) en lugar de una lista de las búsquedas principales (plural):Después de buscar algunas de estas palabras clave en Google, vi que el fragmento casi siempre se extraía de este breve párrafo en una publicación de la competencia:Así que… agregué un párrafo similar a nuestra publicación (usando nuestros datos):Este mejora rápida de SEO on-page consiguió para nuestra página 163 fragmentos destacados más:Lecturas complementariasFragmentos destacados: un acceso directo a la cima de Google☑ Imágenes optimizadasLas imágenes de tu página pueden posicionarse en Google Imágenes y enviarte más tráfico. Hay tres cosas que debes hacer para optimizarlas.Los nombres de archivo deben ser descriptivos.Google dice que los nombres de archivo ofrecen pistas sobre el tema, así que evita nombres de archivos aleatorios como IMG_73097.jpg y usa nombres breves y descriptivos, como perro-marron.jpg.Asegúrate de incluir un alt (texto alternativo) descriptivo.Google también dice que el texto alt de la imagen les ayuda a comprender el tema, por lo que se aplican las mismas reglas que a los nombres de archivos: mantenlos breves y descriptivos.La mayoría de los sistemas de gestión de contenido tienen un espacio para incluir texto alternativo en la interfaz de usuario, por lo que no tendrás que perder tiempo con HTML:Las imágenes deben estar comprimidasLas imágenes comprimidas son más pequeñas y más rápidas de cargar. Algunas plataformas como Shopify afirman hacer esto automáticamente, pero los resultados no siempre son excelentes. Generalmente es mejor usar un plugin como TinyIMG o Shortpixel.Lecturas complementariasSEO de imágenes: 12 consejos prácticos (para aumentar el tráfico orgánico)Cómo optimizar el texto alternativo para SEO☑ Enlaces internos a otras páginasLos enlaces internos son enlaces de una página de tu web a otra, también de tu web. Ayudan a Google a comprender de qué trata una página y a aumentar su autoridad, lo que puede ayudar a posicionar mejor.Por esto, cuando publicas una página nueva, merece la pena añadir enlaces internos desde esa página nueva a otras páginas relevantes. Esto no ayudará a posicionar la nueva página, pero podría ayudar al posicionamiento de las páginas a las que enlaza internamente.Para encontrar oportunidades relevantes, puedes usar Site Audit de Ahrefs:Ve a la herramienta Internal link opportunities (oportunidades de enlace interno)Introduce la URL de tu página recién publicada en la cajaElige Source page (página de origen) en el menú desplegableNota al margen.Site Audit debe haber rastreado tu web después de publicar la nueva página; de lo contrario, esto no funcionará.Presta atención a estas columnas:Página fuente → tu página recién publicada, donde añadirás el enlaceContexto de palabra clave → en qué parte de la página agregar el enlacePágina de destino → dónde enlazarPor ejemplo, aquí el informe sugiere que enlace desde mi publicación sobre enlaces tóxicos a nuestra guía de enlaces malos:Lecturas complementariasEnlaces internos para SEO☑ Enlaces útiles a recursos externosCitar recursos valiosos es útil para los lectores. Incluso Google lo dice.¿Eso quiere decir que es un “factor de posicionamiento”? No. Pero sí mejora la credibilidad de tu contenido ante quienes lo leen, y eso puede afectar a cosas que sí importan, como enlaces y compartidos.Esto es algo que hacemos habitualmente en el blog de Ahrefs:☑ Enlaces internos desde otras páginasSi intentas mejorar el posicionamiento de la página que estás optimizando, te interesará añadirle enlaces internos desde otras páginas de tu web.Para encontrar oportunidades relevantes, utiliza una vez más Site Audit de Ahrefs:Ve a la herramienta de Page explorer (explorador de páginas)Introduce tu palabra clave objetivo (o parte de ella) en el recuadroElige Text page (texto de página) en el menú desplegable.Así encontrarás páginas en tu web que mencionen tu palabra clave objetivo, que pueden ser buenos lugares para agregar enlaces internos.Por ejemplo, nos dice que nuestra guía para eliminar enlaces menciona la palabra “tóxico”:Si buscamos en esa página, esta es la mención:Parece el lugar perfecto para añadir un enlace interno a nuestra guía sobre enlaces tóxicos.☑ Marcado schema relevanteEl marcado schema es un código que ayuda a los motores de búsqueda a comprender la información de una página. También está detrás de muchos fragmentos enriquecidos que ves en Google, lo que puede generar más clics.Si no tienes claro si merece la pena priorizar el marcado schema para tu página, busca su palabra clave objetivo en Google y revisa los primeros resultados. Si todos o muchos son resultados enriquecidos, probablemente merezca la pena agregar el marcado schema.Si usas WordPress, puedes añadir schema fácilmente con un plugin como Yoast o RankMath. Si no, puedes usar una herramienta como Generador de marcado de esquemas de Merkle para generar el código JSON-LD por tu cuenta y agregarlo manualmente.Lecturas complementariasMarcado schema: qué es y cómo implementarloSigue aprendiendoTienes más recursos SEO en nuestra página:Guía para principiantes de SEO on-pageGuía para principiantes de contenido SEOCómo optimizar para la intención de búsqueda¿Dudas? ¿Preguntas? Te esperamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Una checklist completa de SEO on-page para 2024"
    },
    {
      "level": "H2",
      "text": "☑ URL descriptiva breve"
    },
    {
      "level": "H2",
      "text": "☑ Etiqueta de título y meta descripción convincentes"
    },
    {
      "level": "H2",
      "text": "☑ Asegúrate de que el título está en H1"
    },
    {
      "level": "H2",
      "text": "☑ Ve al grano rápidamente"
    },
    {
      "level": "H2",
      "text": "☑ Subtítulos descriptivos"
    },
    {
      "level": "H2",
      "text": "☑ Cumple con la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "☑ Cubre el tema por completo"
    },
    {
      "level": "H3",
      "text": "Revisa manualmente las páginas mejor posicionadas"
    },
    {
      "level": "H3",
      "text": "Revisa otras palabras clave en las que se posicionan las mejores páginas"
    },
    {
      "level": "H3",
      "text": "Encuentra subtemas con la ayuda de la IA"
    },
    {
      "level": "H2",
      "text": "☑ Aporta “información adicional”"
    },
    {
      "level": "H2",
      "text": "☑ Muestra experiencia y conocimientos"
    },
    {
      "level": "H3",
      "text": "Muestra tus credenciales"
    },
    {
      "level": "H3",
      "text": "Destaca lo que te hace singular"
    },
    {
      "level": "H2",
      "text": "☑ Buena legibilidad"
    },
    {
      "level": "H2",
      "text": "☑ Optimiza para conseguir fragmentos destacados"
    },
    {
      "level": "H2",
      "text": "☑ Imágenes optimizadas"
    },
    {
      "level": "H3",
      "text": "Los nombres de archivo deben ser descriptivos."
    },
    {
      "level": "H3",
      "text": "Asegúrate de incluir un alt (texto alternativo) descriptivo."
    },
    {
      "level": "H3",
      "text": "Las imágenes deben estar comprimidas"
    },
    {
      "level": "H2",
      "text": "☑ Enlaces internos a otras páginas"
    },
    {
      "level": "H2",
      "text": "☑ Enlaces útiles a recursos externos"
    },
    {
      "level": "H2",
      "text": "☑ Enlaces internos desde otras páginas"
    },
    {
      "level": "H2",
      "text": "☑ Marcado schema relevante"
    },
    {
      "level": "H2",
      "text": "Sigue aprendiendo"
    }
  ],
  "author": "Joshua Hardwick"
}