{
  "url": "https://ahrefs.com/blog/es/como-usar-google-analytics/",
  "slug": "como-usar-google-analytics",
  "title": "Cómo Usar Google Analytics 4 para Principiantes [Guía 2021]",
  "description": "Google Analytics 4 (GA4) es una herramienta gratuita de analítica web de Google que te permite hacer seguimiento y medir el tráfico y comportamiento de los usuarios en tu web.",
  "content": "Kayle Larkin Estratega SEM data driven. Dedicada a hacer la analítica fácil de entender y accesible a propietarios/as de empresas. Contenido Crear una web de éxito sin datos es difícil. Muy difícil. Como caminar sobre la cuerda floja con los ojos vendados, es posible—pero es bastante más fácil con las luces encendidas.Aquí Google Analytics.Google Analytics enciende las luces metafóricas de tu web para revelar quiénes la visitan, cómo la encuentran y qué están haciendo ahí. Después puedes usar estos datos para poner un pie delante del otro y mejorar tu web con confianza.En esta guía aprenderás:Qué es Google AnalyticsPor qué deberías usar Google AnalyticsCómo configurar Google AnalyticsCómo usar Google AnalyticsCómo mejorar tu web con Google Analytics¿Qué es Google Analytics 4?Google Analytics 4 (GA4) es una herramienta de analítica web de Google que te permite realizar seguimiento y medir el tráfico y comportamiento de los usuarios en tu web de forma gratuita. Se estima que lo usan unos 28,8 millones de páginas web, lo que supone una cuota estimada del 85,9% del mercado de analítica web.Este es su aspecto:Nota al margen. GA4 reemplazó a Universal Analytics en octubre de 2020. Ahora viene por defecto en todas las propiedades de Google Analytics. ¿Por qué deberías usar Google Analytics?Empezaste tu web para informar a clientes potenciales de tus productos o servicios y convertirlos en clientes fieles. Para hacerlo eficazmente, tienes que saber de dónde vienen los visitantes, qué es lo que más les interesa y qué puntos de contacto ayudan a convertirlos en clientes. Registrar y analizar tus datos con GA4 te ayudará a elaborar estrategias de marketing digital para atraer más visitantes y generar más dinero. ¿Es Google Analytics gratis?Google Analytics es completamente gratis pero tiene algunos límites de recogida y configuración. La mayoría de las PYMEs (pequeñas y medianas empresas) nunca los superarán. Si te preocupa, busca la marca de verificación verde junto al título de cada informe; esto confirma que no estás viendo datos muestreados en el informe. Nota al margen.Google Analytics 360 es la versión de pago de Google Analytics, que de media cuesta 150.000$ al año. Este servicio soporta volúmenes de gran empresa de hasta 500 millones de hits al mes, además de implantación y soporte técnico. Cómo configurar Google AnalyticsAl igual que no puedes pescar ningún pez sin antes lanzar tu red, Google Analytics no puede recoger datos sin estar instalado. Así que cuanto antes lo configures, mejor.Sigue estos tres pasos para instalar y probar Google Analytics:1. Crea y configura tu cuenta de Google AnalyticsSigue estas instrucciones para crear tu cuenta de forma correcta:Ve a analytics.google.com.Haz clic en Comenzar Gratis.Introduce un nombre de cuenta (esto es con propósitos internos. Recomendamos que uses el nombre de tu empresa).Editar la compartición de datos (opcional).Haz clic en Siguiente.Introduce un nombre de propiedad (es solo para uso interno y el dominio de tu web funcionará bien, especialmente si trabajas con varias páginas web dentro de una empresa).Comprueba el huso horario y la moneda (esto debería ser la ubicación del negocio).Haz clic en Mostrar opciones avanzadas.Activa la opción de “Crear una propiedad de Universal Analytics” (se considera mejor práctica para mantener las funcionalidades de medición mejoradas de GA4 activadas).Introduce la URL de la web.Haz clic en Siguiente.Introduce la información de la industria y el tamaño del negocio (opcional).Haz clic en Crear.Acepta el acuerdo y los términos de servicio de Google Analytics (asegúrate de familiarizarte con esto antes de aceptar, ya que existen reglamentos específicos de privacidad que pueden aplicar en tu ubicación).Comprueba los detalles de los flujos de datos (web stream) (asegúrate de que todo está bien, incluye cosas como HTTP vs. HTTPS, y www vs. no-www. Esto puede sesgar la precisión de los datos).2. Añade la etiqueta de GA tag a tu webNecesitas instalar la etiqueta de GA en tu web antes de que Google Analytics pueda recoger datos. La forma más fácil de hacer esto depende de la configuración de tu web.Si usas WordPress…Instala el plugin GA Google Analytics.Ve a la configuración del plugin.Copia tu ID de medición de Google Analytics.Pega el ID de medición en la caja de GA tracking en los ajustes del plugin.Elige Global Side Tag entre las opciones de Tracking Method (método de seguimiento).Haz clic en Guardar cambios.Si usas Wix…Ve a las Marketing Integrations (integraciones de marketing).En Google Analytics, haz clic en Connect (conectar).Haz clic en Connect Google Analytics (conectar Google Analytics).Pega el ID de seguimiento de Google Analytics en el pop-up.Activa la casilla de IP Anonymization (anonimización de IP) si deseas ocultar las direcciones IP de los visitantes a Google. Haz clic en Save (guardar).Si usas otro CMS/plataforma…Google tiene enlaces a instrucciones para la mayoría de CMS aquí. Sin embargo, te darás cuenta de que no todas las plataformas ofrecen soporte nativo para el nuevo ID “G-” de GA4. Así que en algunos casos tendrás que instalarlo manualmente copiando el código completo de gtag.js en la sección <head> de tu web.Como solución alternativa, puedes usar Google Tag Manager (GTM). GTM es quizá una opción avanzada para un principiante. A pesar de eso, sigue siendo mi método preferido para añadir etiquetas on-page porque normalmente necesito añadir varias etiquetas de rendimiento de marketing (Facebook, HubSpot, etc.)Si quieres aprender más sobre Google Tag Manager, lee esto.3. Prueba tu configuraciónLos errores de seguimiento de Google Analytics son habituales, así que es importante que pruebes tu configuración antes de dar por terminado el trabajo.Hay unas pocas formas de hacer esto, pero la más directa de lejos es usar la extensión de Google para Chrome Tag Assistant. Es un producto legacy (abandonado), pero todavía funciona y está disponible para su descarga.Aquí tienes cómo probar tu configuración con la extensión:Instala la extensión.Abre tu web.Haz clic en el icono de la extensión en tu barra de navegación.Haz clic en Activar y actualiza tu página web.Una etiqueta instalada de forma incorrecta estará triste y roja:Una etiqueta correctamente instalada aparecerá feliz y verde:Cómo configurar el seguimiento de objetivosGoogle Analytics automáticamente comienza a medir tráfico a tu web e interacciones de usuario como scroll de página, enlaces salientes, búsquedas en el sitio, interacciones con el vídeo y descargas de archivo.Todos estos eventos con seguimiento automático tienen la opción de marcarse como objetivos. Cualquier objetivo adicional, como formularios completados o llamadas telefónicas, tendrán que configurarse usando GTM.En tu propiedad de GA4, haz clic en “configurar” en el menú de la izquierda (parece un icono en forma de tabla).Simplemente activa el botón “marcar como conversión” en los eventos que te gustaría que activaran conversiones en esta pantalla.Cómo usar Google AnalyticsCon todo correctamente configurado, probablemente te estés preguntando cómo usar esta cosa. Esta pregunta es difícil de responder porque no hay una única forma de usar Google Analytics. Te puede decir cientos de cosas sobre tu web, así que la forma en que lo uses dependerá de los datos que necesites saber.Por esa razón, en lugar de intentar explicar cada informe, simplemente voy a cubrir las bases de cómo puedes usar GA4 para entender cómo los usuarios llegan a tu sitio, qué hacen ahí y el camino multicanal que realizan los clientes hasta la conversión.AdquisiciónLos informes de adquisición te dicen cómo llegan los usuarios a tu sitio. En GA4 se dividen en dos categorías: Adquisición de Usuarios y Adquisición de Tráfico.Los informes de Adquisición de Usuarios se basan en interacción con los usuarios, mientras que los de tráfico se basan en interacción en las sesiones. Esta distinción es importante porque un usuario puede tener varias sesiones. Por esta razón, vamos a explicar el informe de adquisición de usuarios.Para obtener el informe de Adquisición de Usuario:Haz login en Google Analytics.Haz clic en para expandir los informes de Ciclo de vida.Haz clic para expandir los informes de Adquisición.Haz clic en Adquisición de Usuarios.Puedes segmentar tu informe añadiendo una comparativa de demográficos de Usuario, Dispositivo o Evento Personalizado, como un código de cupón específico.Por ahora, vamos a permanecer en una vista de alto nivel y dejar esto en “Todos los Usuarios”:El gráfico de barras y gráfico de dispersión se rellenarán automáticamente usando las métricas que establezcas en la tabla de abajo.En el ejemplo anterior, elegimos “Primer medio del usuario” como dimensión en la primera columna de la tabla. Esto nos muestra la fuente a través de la cual los usuarios fueron adquiridos por primera vez. Por ejemplo, “orgánico” combina tráfico de todas las fuentes orgánicas: Google, Bing, Yahoo, etc.InteracciónLos informes de interacción te dicen qué hacen los usuarios en tu sitio. La vinculación se mide como el tiempo medio en que tu sitio fue el foco del navegador, el número de usuarios únicos que hicieron scroll al menos en el 90% de la página web, contabilización de eventos y contabilización de conversiones.Vamos a echar un vistazo a solo uno de los informes de interacción: Páginas y pantallas.Para llegar a este informe:Haz login en Google Analytics.Haz clic en para expandir los informes de Ciclo de vida.Haz clic para expandir los informes de Interacción.Haz clic en Páginas y pantallas.Segmenta tu informe añadiendo una comparativa por el canal de marketing que quieras analizar. Por ejemplo, incluye la dimensión “Primer medio del usuario” con un valor de “organic” (orgánico).El gráfico de barras y el de dispersión se rellenarán automáticamente usando las métricas que establezcas en la tabla de abajo.Puedes editar la dimensión que cambiará el atributo descriptivo o datos característicos en la columna 1. Por ejemplo, elegir “Título de página y clase de pantalla” mostrará el título de la página, mientras que “Ruta de página + cadena de consulta y clase de pantalla” mostrará la URL.Las columnas que quedan en la tabla muestran “métricas”. Una métrica es un elemento específico de la dimensión. Por ejemplo, la dimensión de “título de página” puede asociarse con una métrica como nuevos usuarios, scrolls de usuarios únicos y otras métricas de interacción.ConversionesEl informe de conversiones te dice qué actividades de usuario contribuyen al éxito de tu negocio. Para un ecommerce, esto puede ser realizar una compra. Para una web de generación de leads, se puede tratar de enviar un formulario.En GA4, los “objetivos” se miden como eventos de conversión. Los datos de eventos que ves en tus informes de GA4 se activan a medida que los usuarios interactúan con tu sitio web.Para llegar al informe de Conversiones:Haz login en Google Analytics.Haz clic para expandir los informes de Ciclo de vida.Haz clic para expandir los informes de Interacción.Haz clic en Conversiones.Nota al margen. El informe de Conversiones técnicamente es un tipo de informe de Interacción, pero quería señalarlo porque es uno de los informes más importantes en GA4.El gráfico de barras y el de dispersión se rellenarán automáticamente usando las métricas que establezcas en la tabla de abajo.Dentro de la tabla, encontrarás eventos listados por nombre, número de conversiones asociadas, usuarios totales e ingresos por evento. Haz clic en el nombre de un evento para abrir un informe sobre ese evento específico.Para una tienda de eCommerce, puede que quieras ver información adicional sobre usuarios que comiencen el proceso de checkout. Para hacer eso, haz clic en el nombre de evento “begin_checkout” (empezar_checkout).Esto abrirá un nuevo informe que mostrará la fuente de tráfico, el número de conversiones y su valor para únicamente el evento elegido.Haz clic en los menús desplegables en la esquina superior izquierda del gráfico de líneas para ajustar las métricas y dimensiones en el informe.Por ejemplo, puedes elegir ver el número de conversiones o valor del evento. Puedes también elegir ver el origen de los eventos por fuente de Evento, medio de Evento, campaña de Evento, overtime o por métricas de Google Ads.Añade una dimensión secundaria, como ciudad, a la tabla de explorador haciendo clic en el icono de más azul al lado de la Columna 1.Cómo mejorar tu web con Google AnalyticsConfigurar Google Analytics y entender cómo configurar informes es solo el comienzo. La ventaja de aprender cómo usar GA4 es que puedes responder preguntas de marketing con datos reales.Si acabas de instalar Google Analytics, tienes que esperar al menos 24-48 horas para permitir que los datos se carguen en los informes—aunque recomiendo esperar al menos 3-4 semanas antes de tomar una decisión en base a los informes.Debajo tienes tres formas fáciles en las que puedes usar los datos de Google Analytics para mejorar tu sitio web.Mejorar tráfico: ¿Qué canales me traen más tráfico?A un nivel muy básico, el marketing en motores de búsqueda tiene que ver con conseguir más usuarios vinculados a un sitio. Para hacer esto, en primer lugar necesitas saber qué canales traen la mayoría del tráfico.Aquí va cómo puedes encontrar tus canales de marketing con mejor rendimiento:Ve al informe de Adquisición de Usuarios en Adquisición.Establece la Columna 1 como Primer medio del usuario.Haz clic en el encabezado de Nuevos Usuarios para ordenar la tabla en orden descendente por volumen de tráfico.Estos canales de marketing son los que traen la mayoría de usuarios nuevos (visitantes por primera vez) a tu web.Explora otras métricas en la tabla para entender mejor la contribución de cada canal de marketing al rendimiento de tu sitio web.Por ejemplo, al hacer clic en la tasa de interacción o el tiempo medio de interacción, te indica qué esfuerzos de marketing están consiguiendo la confianza de los visitantes. La tasa de vinculación es el porcentaje de sesiones que interactuaron con su sitio web dividido por todas las sesiones. En cambio, el tiempo de interacción es la duración media del tiempo que tu web estuvo en primer plano en la ventana del navegador del usuario. Para medir cómo mejora, añade una comparación para tu rango de fechas de referencia en la esquina superior derecha.Mejora la efectividad del contenido: ¿qué páginas te traen la mayoría del tráfico?Entender qué contenido te trae la mayoría del tráfico orgánico te ayudará a afinar tu estrategia de marketing de contenidos.Aquí tienes cómo hacerlo:Ve al informe de Páginas y Pantallas en Interacción.Haz clic en Todos los usuarios en la parte superior de la página.Cambia la dimensión a Primer medio del usuario.Elige organiccomo el valor de dimensión.Haz clic en Aplicar.Haz clic en Nuevos Usuarios en el encabezado para ordenar la tabla por orden descendente por volumen de tráfico.Estas páginas landing son las que están atrayendo la mayoría de nuevos usuarios (visitantes por primera vez) a tu web. Vas a querer crear más artículos parecidos.Por otro lado, haz clic en la cabecera por segunda vez para ordenar la tabla por valor ascendente. Si hay páginas landing orgánicas con cero tráfico de usuarios, vas a querer evaluar de nuevo su relevancia para los objetivos de negocio y ajustar tu estrategia en consecuencia. Esto puede incluir volver a publicar el contenido o eliminarlo de tu web. Mejora la segmentación geográfica: ¿de dónde vienen mis mejores clientes?Si inviertes en publicidad o varias ubicaciones SEO, necesitas conocimiento específico sobre la ubicación para entender dónde incrementar o disminuir los esfuerzos de marketing. Para esto puedes usar el informe de Detalles Demográficos.Aquí tienes cómo hacerlo:Ve al informe Detalles Demográficos en Grupos Demográficos.Ordena la tabla por tasa de vinculación, evento específico o ingresos totales.Este informe es muy útil para ajustar la segmentación de ubicación de los anuncios.Si quieres ser más específico con tu segmentación, haz clic en el desplegable País en la primera columna de la tabla y cámbiala a Ciudad o Región.Reflexiones finalesConfigurar Google Analytics puede parecerse a aprender Klingon, pero una configuración de informe básico es todo lo que necesitas para empezar. Invertir veinte minutos de tu día en aprender cómo configurar GA4 y cómo conseguir un puñado de informes será algo que se pague por sí mismo una y otra vez.El éxito está en los datos.¿Alguna pregunta? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, creador del primer directorio de herramientas profesionales de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Usar Google Analytics 4 para Principiantes [Guía 2021]"
    },
    {
      "level": "H2",
      "text": "¿Qué es Google Analytics 4?"
    },
    {
      "level": "H2",
      "text": "¿Por qué deberías usar Google Analytics?"
    },
    {
      "level": "H2",
      "text": "¿Es Google Analytics gratis?"
    },
    {
      "level": "H2",
      "text": "Cómo configurar Google Analytics"
    },
    {
      "level": "H3",
      "text": "1. Crea y configura tu cuenta de Google Analytics"
    },
    {
      "level": "H3",
      "text": "2. Añade la etiqueta de GA tag a tu web"
    },
    {
      "level": "H4",
      "text": "Si usas WordPress…"
    },
    {
      "level": "H4",
      "text": "Si usas Wix…"
    },
    {
      "level": "H4",
      "text": "Si usas otro CMS/plataforma…"
    },
    {
      "level": "H3",
      "text": "3. Prueba tu configuración"
    },
    {
      "level": "H2",
      "text": "Cómo configurar el seguimiento de objetivos"
    },
    {
      "level": "H2",
      "text": "Cómo usar Google Analytics"
    },
    {
      "level": "H3",
      "text": "Adquisición"
    },
    {
      "level": "H3",
      "text": "Interacción"
    },
    {
      "level": "H3",
      "text": "Conversiones"
    },
    {
      "level": "H2",
      "text": "Cómo mejorar tu web con Google Analytics"
    },
    {
      "level": "H3",
      "text": "Mejorar tráfico: ¿Qué canales me traen más tráfico?"
    },
    {
      "level": "H3",
      "text": "Mejora la efectividad del contenido: ¿qué páginas te traen la mayoría del tráfico?"
    },
    {
      "level": "H3",
      "text": "Mejora la segmentación geográfica: ¿de dónde vienen mis mejores clientes?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Kayle Larkin"
}