{
  "url": "https://ahrefs.com/blog/es/como-crear-una-newsletter/",
  "slug": "como-crear-una-newsletter",
  "title": "¿Cómo crear una newsletter? La guía más completa para crear un boletín informativo exitoso",
  "description": "Descubre la guía más completa sobre cómo crear un boletín informativo exitoso. Aprende los pasos clave y las mejores prácticas para desarrollar una newsletter impactante y aumentar tu alcance.",
  "content": "Chus Naharro Especialista en newsletters y marketer. Te ayudo a crear, crecer y rentabilizar tu newsletter con propósito. Contenido Todo el mundo habla de lo importante que son las newsletters hoy en día. Sin embargo, cuando te pones a crearla, no sabes ni por dónde empezar.Es normal sentir agobio al querer crear un boletín informativo exitoso y sufrir la temida parálisis por análisis. Son muchos los aspectos que hay que tener en cuenta para hacer una newsletter que destaque.Algunos de ellos son:Cómo va a ser la newsletterQué herramienta de envío elegirCómo mejorar la tasa de aperturaCómo captar nuevos suscriptoresCómo rentabilizarlaNo te preocupes, en esta guía aprenderás cómo crear una newsletter que tus suscriptores amen, evitando los errores más comunes y que te ayude a aumentar tus ingresos. Estoy segura de que te ayudará a enfrentar el desafío de crear una newsletter exitosa.Contenido¿Qué es una newsletter?Una newsletter o boletín informativo es un correo electrónico que se envía de forma periódica a una lista de suscriptores.Es un tipo de email que ofrece contenido relevante y útil a los destinatarios y que cumple con un objetivo concreto.Ventajas de crear una newsletterLas newsletters forman parte de cualquier estrategia de email marketing. O deberían.Son muchas las empresas que envían boletines a su lista de contactos. Sin embargo, muchos profesionales independientes y creadores de contenidos se han sumado a las bondades que ofrece este formato de contenidos.Las ventajas de enviar un boletín informativo son:Canal directoMedición del impactoFidelización de los usuariosCanal directoLos correos electrónicos son un canal de comunicación directo. Los usuarios han dado el consentimiento de recibir los emails al suscribirse a la lista.Esto es una ventaja si lo comparamos con la dependencia de algoritmos que sufren las redes sociales.Con las newsletters somos nosotros los que elegimos cuándo y cómo llegamos a la audiencia. Y lo hacemos directamente en su bandeja de entrada del correo electrónico.Medición del impactoEnviar newsletters tiene un bajo coste si lo comparamos con otras estrategias de marketing como las campañas de publicidad.Al ser un email, podemos medir distintos datos como los clics en los enlaces del correo y si se traducen en conversión. Esto es especialmente importante si estamos usando la newsletter como un canal de venta.Fidelización de los usuariosConseguir un nuevo cliente cuesta más que fidelizar a uno existente. Enviar boletines con cierta periodicidad nos ayuda a conservar la relación con los usuarios que pertenecen a la lista y estar en su top of mind.Si llegas a la bandeja de entrada de tus suscriptores con frecuencia, te tendrán en mente a la hora de comprar tus productos o contratar tus servicios.Esto es un activo muy importante y que todos perseguimos.5 elementos básicos para definir tu newsletterCuando te planteas crear tu newsletter, hay cinco aspectos en los que debes pensar antes de ponerte manos a la obra.Estos son:¿Por qué vas a crear una newsletter?Tienes que saber cuál es el objetivo que persigues con tu newsletter. A mí me gusta decir que hay tantos objetivos como empresas y proyectos existen.En el Estudio de Newsletters que publico cada año salen datos muy interesantes de por qué la gente envía boletines.Existen los siguientes motivos para crear una newsletter. Te invito a pensar cuál es el objetivo que tienes tú.Conseguir ventasTrabajar tu marca personalOfrecer contenidos exclusivosConstruir una audiencia en InternetDifundir contenidos propios o de tercerosCompartir novedades y lanzamientos de tu negocioInformar a socios y miembros de organizaciones o clubesTal vez tú tengas otro propósito con el boletín que vas a crear.¿Quién es tu público objetivo?El público objetivo es aquel al que te vas a dirigir y va a recibir tu newsletter. Define al detalle, como si se tratara de un buyer persona, a dicho público.Cuanto más concretes, mejor.Ponle un nombreAsígnale un trabajoQué intereses tieneCuáles son sus problemasDesde dónde va a leer tu newsletterEn qué momento del día y de la semanaEn qué canales digitales se mueveQué marcas sigue…Tener este perfil creado te ayuda a definir otros elementos importantes para tu newsletter.Por ejemplo, saber desde dónde va a leer tu newsletter y en qué momento te vendrá bien para definir el día y la hora de envío.Conocer en qué canales digitales se mueve te será útil para saber en qué plataforma difundir tu newsletter.Conocer sus problemas es muy interesante para saber cómo puedes resolverlos con tu newsletter.Lo que me lleva al siguiente punto.¿Cuál es tu propuesta de valor?La propuesta de valor se enfoca en lo que la audiencia valora y cómo la newsletter lo proporciona.Piensa en la respuesta a esta pregunta: ¿por qué se suscriben a tu newsletter? Esto te dará pistas de cuál es el motivador por el que tu audiencia quiere recibir tu boletín.Existen diferentes propuestas de valor:Para aprenderPara inspirarsePara informarsePara ganar dineroPara entretenersePara ahorrar tiempoPara conectar con otras personasHay que decir que dichas propuestas no son excluyentes. Es decir, una newsletter puede informar a la vez que inspirar a los suscriptores.RecomendaciónUna fórmula que te ayudará a definir tu propuesta de valor consiste en completar la siguiente frase: [NOMBRE NEWSLETTER] ayuda a [PÚBLICO OBJETIVO] a resolver [PROBLEMA] compartiendo [CONTENIDO]Un par de ejemplos:Fuente: Newsletter BonilistaFuente: Newsletter Sin OficinaLa habilidad para desarrollar y expresar esta propuesta de valor es un factor determinante en el éxito de la newsletter ya que influye en otros aspectos como el tipo de contenido, la frecuencia de envío, la promoción, la captación, la capacidad de monetización y el éxito general.¿Qué contenidos vas a enviar?El boletín es un canal más dentro de tu estrategia de contenidos. Por ello, debes tener una planificación sobre los temas que vas a compartir y el tipo de contenido.Te ayudará a tener un calendario editorial para definirlo previamente y no enfrentarte a la temida página en blaco. Además, si cuentas con otros canales de marketing y tienes campañas activas, lo ideal es que todo tenga coherencia.Aunque profundizaremos más acerca del tipo de newsletters más abajo, sí que debes conocer que existen diferentes tipos de contenidos que puedes compartir en tu boletín informativo.Comentarios personales: surgen de una reflexión sobre un tema determinado que quieras compartir.Noticias e información: es contenido basado en actualidad y tendencias sobre determinado sector o general.Historias: el storytelling cobra protagonismo en muchos emails. Mucha gente comparte historias que enlazan con un aprendizaje o con la promoción de algún producto o servicio.Contenido original: es un texto que exclusivamente se distribuye a través de la newsletter; es decir, nace y muere en el email.Contenido reutilizado: es lo contrario al contenido original. El contenido reutilizado parte de contenidos que has publicado en otros canales: Youtube, redes sociales, blog… y se lo envías a tu lista de suscriptores.A la hora de planificar los contenidos que más pueden interesar a tu público objetivo te puedes ayudar con la herramienta Content Explorer de Ahrefs.Introduce el término del que quieres hablar en tu newsletter y verás datos interesantes como el tráfico orgánico que reciben las páginas web o el número de veces que se comparten en redes sociales.Por ejemplo, puedes filtrar para que se muestren los que más veces se han compartido en Twitter han tenido para hacerte una idea del contenido que más se comparte.Si bien la herramienta Content Explorer está más pensada para la estrategia de contenidos de un blog, te ayudará a definir algunos temas de los que puedes hablar y otros competidores ya lo están haciendo en sus páginas web.¿Cada cuánto tiempo vas a enviar tu boletín?La frecuencia de envío de una newsletter vendrá determinada por tu compromiso, disponibilidad y objetivo con la misma.La frecuencia más común en un boletín es la semanal*. Es decir, enviar un email a tu lista de suscriptores una vez a la semana es una buena periodicidad para estar presentes en sus bandejas de entrada.Sin embargo, hay otras marcas y profesionales cuyo objetivo está más enfocado a la venta y apuestan por la frecuencia diaria, así como otros que no disponen de mucho tiempo y la envían cada dos semanas.* Según el Estudio de NewslettersEl mayor consejo que puedo darte en cuanto a frecuencia es elegir una que te permita ser constante para no dejar «huérfana» a tu lista. Esto quiere decir que es más recomendable enviar una newsletter semanal si no puedes comprometerte a enviar cada día un email que cumpla la propuesta de valor planteada.Tipos de newsletters que existenActualmente, podemos clasificar los boletines en tres grandes categorías:Newsletters con contenidos propios u originalesNewsletters de curaciónNewsletters híbridasVamos a ver las particularidades de cada grupo y ejemplos para que te quede más claro.1. Newsletters con contenidos propios u originalesEste tipo de newsletters comparte contenidos escritos de forma genuina para dicho formato. Podemos decir que es como escribir un blog, pero el contenido únicamente se comparte a través del email. Dicho contenido no lo encontrarás en ningún otro canal.Un ejemplo de newsletter de este tipo es Suma Positiva de Samuel Gil, en la que él, cada semana, reflexiona y escribe acerca de tecnología, negocios y startups.Newsletter para difundir contenidosDentro de las newsletters con contenidos originales, encontramos un subgrupo. Son los boletines que difunden contenidos propios pero publicados previamente en otros canales. Por ejemplo, artículos de un blog, un vídeo de Youtube, un nuevo episodio de un podcast…Este tipo de newsletters tienen el objetivo de derivar tráfico a la web o a dichos canales para que la audiencia se mantenga informada.RecomendaciónDentro de esta práctica, a mí me gusta aconsejar el hecho de incluir una pequeña introducción más exclusiva para dar un motivo a la audiencia de abrir la newsletter. Un ejemplo es el de nuestra propia newsletter, en la que recopilamos los últimos artículos y vídeos que hemos publicado en nuestro blog o canal de Youtube.Otro ejemplo que entra dentro de este subgrupo es la newsletter llamada UI from Mars de Cris Busquets. Cada semana, destaca el último artículo que ha publicado en su blog y, luego, hace una recopilación de contenidos de terceros.2. Newsletters de curaciónLas newsletters de curación son aquellas que recopilan contenidos que han publicado terceras personas o medios. Son esos boletines que enlazan a varias fuentes y que van acompañados de un pequeño resumen o aportación por parte del remitente.Personalmente, en este tipo de newsletters, lo más interesante es tener esa opinión o nota personal de la persona que la envía.Mira este ejemplo de Juan González Villa. Cada semana, envía su newsletter 10 links azules, una recopilación de noticias y enlaces de SEO para estar al día de la actualidad del sector.Si quieres conocer más ejemplos de newsletters de SEO, echa un vistazo al artículo Las 10 mejores newsletters de SEO.3. Newsletters híbridasSi combinamos los boletines que comparten contenido original con los de curación, obtenemos las newsletters híbridas o mixtas.Esta tipología es muy interesante porque permite aportar una visión más personal o especializada por parte del remitente junto con la recopilación de enlaces a otros contenidos que interesan al público de la newsletter.Un ejemplo es mi Chusletter, la newsletter de newsletters, donde cada semana comparto un tema formativo para crear mejores newsletters y enlazo a distintos contenidos que son de interés para enviar mejores emails.Elegir la plataforma de envío correctaLo primero que debes saber es que existen multitud de plataformas para enviar tu boletín informativo.Y lo segundo que debes conocer es que no existe la plataforma perfecta.Dicho esto, vamos a ver los aspectos que debes tener en cuenta para elegir la plataforma que mejor se adapte a tus necesidades y a la newsletter que quieres enviar.Las hay de dos tipos:Herramientas gratuitasHerramientas de email marketingHerramientas gratuitas para enviar boletinesLeer la palabra «gratuita» es atractivo, ¿verdad? Sin embargo, no es oro todo lo que reluce. Vamos a ver algunas ventajas e inconvenientes.ProsLa principal ventaja es que es gratis; es decir, no hay que hacer una inversión monetaria para enviar los boletines.En cuanto al crecimiento de la base de datos, este tipo de plataformas plantean funcionalidades muy interesantes para llegar a más gente gracias a recomendaciones de otras personas.ContrasSin embargo, existen algunas limitaciones en cuanto a funcionalidades que afectan a muchos tipos de newsletters.No se pueden crear segmentos de usuariosNo se pueden crear automatizaciones de emailsLas métricas y los informes de rendimiento son limitadosPocas posibilidades en cuanto a diseño y maquetación del contenidoNo existen integraciones con herramientas de terceros como CRMEjemplos de plataformas gratuitas: principalmente encontramos Substack como la opción más asentada hoy en día para enviar tu newsletter de forma gratuita.Es tu opción si…Solo quieres enviar una newsletter, compartir conocimiento y probar, empieza por esta opción para validar.Siempre hay tiempo de cambiar a algo más dedicado si lo necesitas.Herramientas de email marketing para enviar newslettersEste tipo de herramientas surgieron específicamente para enviar emails masivos, por lo que las características que ofrecen satisfacen muchas de las necesidades que tienen los emprendedores y los negocios que utilizan el email marketing en general y las newsletters en particular.Por supuesto, también existen ventajas y desventajas.Pros Estas herramientas de email marketing permiten:Crear segmentaciones de usuarios que cumplen determinados requisitosCrear automatizaciones en base a diferentes comportamientos o casuísticasHacer test A/B para elegir qué asunto o contenido tendrá mejor rendimientoPersonalizar el diseño de cada email y usar plantillas prediseñadasIntegraciones con otras herramientas como CRM y CMSMétricas e informes más avanzados para obtener más información de la lista y las campañasContrasEl mayor punto negativo es que se requiere una inversión ya que, para acceder a todas esas funcionalidades, hay que contratar un plan de pago.No obstante, en la gran mayoría de estas herramientas ofrecen un plan freemium limitado a un número determinado de suscriptores. Esto te da opción a probarla y decidir si encaja dentro de tu estrategia.Ejemplos de plataformas gratuitas: MailChimp, MailerLite, ActiveCampaign, ConvertKit… ¡Hay muchísimas!Es tu opción si…Necesitas unas métricas más avanzadas, más integraciones y posibilidades de automatización y segmentación.Anatomía de un boletínExisten distintos elementos que cualquier* boletín o newsletter debería considerar para incluir en cada email.Nota al margen.* Habrá algunas newsletters a las que por su tipología o decisiones estratégicas no les encaje alguno de estos elementos. No obstante, lo menciono a nivel general.Vamos a verlos uno a uno.Asunto y remitenteCabeceraÍndiceSeccionesBotones para compartirOpción de suscribirseEnlaces y botonesBajaAsunto y remitenteEl asunto y el remitente son los dos primeros elementos en los que nos fijamos al recibir un email.El asunto responde al título que aparece en la bandeja de entrada y que da pistas sobre la temática del email.El remitente es la persona o empresa que lo envía.Habitualmente, se cree que escribir un buen asunto es síntoma de conseguir la apertura de dicho email. No obstante, según este estudio de Litus, un 42 % de los encuestados se fijan antes en el remitente que en el asunto.Esto es una clara señal de que nos importa más quién lo envía que el qué recibimos.Cabecera¿Es imprescindible incluir un logo en una newsletter? Yo te diría que no, pero ayuda a contextualizar y a trabajar la imagen de marca.En muchas newsletters observamos que incluyen el logo acompañados de un pequeño claim o frase que resume el propósito de esta.Te dejo un par de ejemplos.Fuente: Newsletter KloshletterFuente: Newsletter MakinProcessNo siempre es imprescindible, pero con la gran oleada que existen hoy en día de newsletters, trabajar una asociación visual junto con el remitente te ayudará a que los suscriptores te recuerden más.ÍndiceLas newsletters que incluyen varias secciones o tratan distintos temas apuestan por apuntar cada uno en un pequeño índice debajo de la cabecera.Esto es muy útil porque ayuda a la lectura y el suscriptor se hace una visión global de los contenidos que se van a tratar.Fuente: Newsletter Mentes ArtificialesSeccionesHay algunos boletines que están formados por distintas secciones o estructuran el contenido en bloques diferenciados.Es interesante dividir cada una de estas secciones para ayudar al escaneo del lector.En ocasiones, se ven muchas newsletters que solo envían texto sin formatear y sin encabezados o subsecciones.Fragmentar el contenido, destacar frases o ideas, e incluir negritas es una buena práctica para facilitar la lectura del contenido.Enlaces y botonesUna newsletter sin llamada a la acción o CTA no tiene sentido. Por eso, la gran mayoría de boletines incluyen enlaces (mínimo uno) o botones.Ten en cuenta que, para mejorar la usabilidad y accesibilidad del email, es conveniente que dichos enlaces estén resaltados en otro color e incluso subrayarlos. De la misma forma que aparecen los hipervínculos en cualquier web.En el caso de incluir varios enlaces y una llamada a la acción principal, es recomendable que, para esta, se apueste por un botón. Destacará más entre todo el contenido y al usuario le quedará claro qué es lo que esperamos que haga.Aquí te dejo un ejemplo de cómo destaco yo el CTA principal con un botón y el resto de enlaces los dejo con mi color corporativo.Fuente: Newsletter ChusletterHay otras newsletters que minimizan los enlaces y solo incluyen la llamada a la acción principal que suele ser la venta de un servicio o producto. En este caso, suelen incluirlo en la parte final a modo de posdata.BajaEl último elemento que toda newsletter debe incluir por ley es la opción a cancelar la suscripción. El típico unsubscribe o darme de baja.Sé que las bajas duelen y no son agradables. A nadie le gustan las despedidas. Sin embargo, en el ámbito de los boletines, es mejor que una persona se vaya por su propia decisión que no lo haga y se quede sin abrir dichos emails o sin convertir nunca porque se convertirá en un suscriptor inactivo.7 Estrategias que funcionan para conseguir suscriptoresLlegamos a la parte que estabas esperando. Todo creador de newsletter tiene una preocupación principal: ¿cómo hacer crecer la lista?Existen muchas técnicas. Como no quiero hacer esta guía interminable, te hablaré de las estrategias más extendidas y que mejor funcionan.Haz visible el formulario de registroNo pierdas la oportunidad de decir que tienes una newsletter y coloca el formulario de suscripción en una posición destacada tanto en tu web como en redes sociales.Te muestro el ejemplo de cómo es la página principal de mi web. Nada más aterrizar, muestro el formulario que es la puerta de entrada para el embudo que he montado en mi negocio.Crea un lead magnetRegalar un recurso gratuito a cambio de que se suscriban a tu newsletter también suele funcionar muy bien.No obstante, hay que mencionar que tiene algunos riesgos como, por ejemplo, devaluar la calidad de los suscriptores que captes.Por eso, es importante que pienses muy bien qué regalar a cambio de conseguir el email. Cuanto más alineado esté con el contenido de tu newsletter, mucho mejor para captar suscriptores de calidad.Algunos ejemplos de lead magnets son:GuíasListado de herramientasPlantillasAudiosVídeos exclusivosFuente: Lead magnet de Oscar FeitoFacilita la difusiónUna de las formas más orgánicas y efectivas de crecer es fomentando el boca-oreja. Es decir, haciendo que sean tus suscriptores los que compartan el boletín en sus redes sociales o la reenvíen.Para ello, es imprescindible ponerlo fácil. Fíjate en cómo Jaime Mesa de la Ecommpills incluye un botón para animar a compartir cada edición.Haz un sistema de referidosCrea recompensas exclusivas (y de interés) para que tus suscriptores sean los primeros interesados en conseguir nuevas altas en tu lista.Esta estrategia es muy similar a la anterior, pero, en este caso, hay un incentivo de por medio en forma de recompensa.Cada suscriptor tiene un enlace único con un identificador. Dicho enlace dirige al formulario de suscripción del boletín y permite contabilizar cuántos nuevos suscriptores provienen de dicho identificador.Aleyda Solís tiene una newsletter dedicada a profesionales del SEO llamada #SEOFOMO. Fíjate en las recompensas que ofrece a cambio de los referidos que consigan los suscriptores.Colabora con otros que tengan audiencias similaresLa promoción cruzada o cross-promotion es una de las estrategias que mejor funcionan a la hora de conseguir suscriptores.Principalmente, consiste en aparecer en otros boletines para llegar a audiencias complementarias a tu proyecto. Es una buena forma de captar suscriptores acostumbrados a recibir newsletters y que les interese tu temática.De hecho, los datos de mi Estudio de Newsletters han corroborado que esta técnica está creciendo entre las personas que tienen newsletter.TIP: A la hora de hacer estas colaboraciones, busca creadores que tengan audiencias similares a la tuya o complementarias.Patrocina otras newslettersEn ocasiones, te interesa llegar a audiencias más grandes con las que no siempre vas a poder hacer una promoción cruzada. En ese caso… toca pagar.Localiza newsletters donde se encuentren tus potenciales lectores y patrocínalas.Sé constante y haz buen contenidoMantener el ritmo de publicación y compartir contenidos interesantes para tu audiencia es el primer paso para hacer crecer tu lista y fidelizar a los suscriptores. No te olvides de este punto porque es clave.Existen algunas técnicas más que pueden tener más sentido dependiendo de qué tipo de proyecto tengas entre manos. No obstante, espero haberte descubierto algunas que no conocías y que las pongas en práctica.Formas de ganar dinero con una newsletterExisten diferentes maneras de rentabilizar una newsletter. Después de invertir tiempo, esfuerzo y, en ocasiones, dinero, seguro que tienes curiosidad por conocer cuáles son esas opciones para monetizar tu boletín.Vamos a ver los tipos que hay:PatrociniosEnlaces patrocinadosVenta de servicios y/o productosAfiliaciónNewsletters de pagoPatrociniosLos patrocinios son una forma de dar visibilidad a un anunciante interesado en llegar a tu audiencia. Normalmente consisten en un texto acompañado de imagen (en algunos casos) y un enlace hacia la página de aterrizaje de dicho anunciante.Normalmente cada newsletter incluye un único patrocinio por cada edición.Fuente: Newsletter Tech 101Enlaces patrocinadosLos enlaces patrocinados es una forma menos visible de patrocinio. En este caso se trata de un texto mucho más escueto acompañado de un enlace.Muchas newsletters apuestan por esta forma de monetización ya que les permite incluir varios enlaces clasificados en una misma edición.No obstante, el precio por clasificado suele ser menor que por un espacio patrocinado ya que la visibilidad y extensión no es la misma.Fuente: Newsletter The Steal ClubVenta de servicios y/o productosLa rentabilidad para un boletín de un profesional o tienda online es conseguir la venta a través de anunciar los productos o servicios a través de dicho email.Aquí encontramos distintos estilos para hacer dichas llamadas a la acción, ya que dependerá de lo que se ofrezca.Te dejo algunos ejemplos de cómo lo hacen algunos profesionales.Noemí Carro aprovecha un espacio al final de su newsletter para incluir un enlace a sus consultorías.Fuente: Newsletter Pequeñas Marcas MolonasSi vendes infoproductos como, por ejemplo, cursos, una newsletter también puede ser una buena vía de monetización. Especialmente si tu audiencia está muy cualificada.El caso de María Sajim, especialista en comunidades, es un buen ejemplo. Ella comparte en su newsletter contenidos relacionados con cómo crear comunidades. Cuando abre las puertas de su curso, lo anuncia en su newsletter, ya que sus seguidores son los potenciales alumnos.Fuente: Newsletter Community BuildersPor último, te quiero compartir el ejemplo de Vitamina Jota, una tienda online que vende jamones, productos ibéricos y embutidos.Maxi, su fundador, tiene una newsletter en la que comparte historias y curiosidades acerca de la crianza del cerdo, así como su experiencia vendiendo jamones.Al final de cada newsletter, aprovecha para colocar un enlace a la tienda online.Fuente: Newsletter Vitamina JotaAfiliaciónEl marketing de afiliados es algo de lo que ya se ha hablado largo y tendido en este blog. No obstante, otra forma de ganar dinero con una newsletter es a través de los afiliados.Es decir, conseguir una comisión por cada venta o contratación que se haga a través de dicho enlace.Importante: es un tema delicado del que te interesa informarte, ya que algunas políticas de herramientas de email marketing no permiten hacer marketing de afiliados a través de sus envíos.No obstante, yo lo menciono porque algunos creadores utilizan su boletín para comisionar a través de recomendaciones de herramientas o cursos de los que se llevan un porcentaje por cada venta.Fuente: Newsletter Carla con WifiNewsletters de pagoLas newsletter de pago tienen cada vez más relevancia. Se trata de la forma más directa de rentabilizar una newsletter ya que, para leer el propio contenido, hay que pagar una membresía.Plataformas como Substack o Ghost han bajado mucho la barrera de entrada para crear newsletters de pago fácilmente.La Creator Economy ha democratizado mucho el pago directo a creadores que comparten contenido de alto valor y las newsletters son una pieza fundamental en esta tendencia.Fuente: Newsletter Club Escribe PROMétricas que no debes perder de vista en una newsletterElegir los KPI que medirán el rendimiento de tu boletín es una tarea imprescindible.Dentro de las newsletters, encontramos diferentes métricas que podemos tomar como referencia para determinar el éxito de los emails que envíes.Número de suscriptoresBajasTasa de apertura (Open Rate)Tasa de clics (Click to open rate)Rebotes duros (Hard bounces)Número de suscriptoresPara medir el éxito de una newsletter, es necesario tener cada vez más suscriptores. Si este número es creciente, es una buena señal ya que nos indica que nuestra estrategia de captación está funcionando correctamente.BajasLas bajas son el número de suscriptores que cancelan su suscripción; es decir, que deciden darse de baja para dejar de recibir tus emails.Si bien no hay que obsesionarse con esta métrica, sí que conviene tenerla en consideración ya que, si es mayor que la captación, indica que no estamos captando al público objetivo que nos interesa.Tasa de aperturaLa tasa de apertura u open rate indica el porcentaje de personas que abrieron el email respecto de todos los emails entregados.Los elementos que influyen para conseguir más o menos aperturas son dos:Utilizar un remitente reconocibleEscribir un asunto atractivo y que genere curiosidad¿Cuál es la tasa de apertura media?Esta cifra va a depender mucho del tipo de newsletter. No obstante, según los datos del Estudio de Newsletters, te puedo indicar que, en las newsletters catalogadas como de autor o que no son corporativas, la tasa media está entre el 50 % y 65 %.En newsletters de empresa, esta cifra está en torno al 25 %.Tasa de clics (CTOR)La tasa de clics o Click to open rate indica el porcentaje de personas que hicieron clic en algún enlace del email. Se toma como referencia el total de personas que abrieron dicho email. Por eso, se denomina Click to open rate.Esta métrica es muy interesante porque denota el verdadero interés de la audiencia en el contenido o los productos que están enlazados dentro del cuerpo de tu boletín.Rebotes durosLos rebotes duros o hard bounces pasan desapercibidos y es un dato que hay que vigilar. Corresponde a los emails que se envían y son inexistentes como, por ejemplo, emails que se han escrito erróneamente o ya no existe dicha dirección.Es conveniente hacer limpieza y eliminar este tipo de correos ya que nunca llegarán nuestros emails a dichos destinatarios y son señales de una lista de baja calidad.Reflexiones finalesComo has leído en esta guía, crear un boletín puede parecer sencillo, pero son muchos aspectos los que hay que tener en cuenta para que realmente tenga un propósito en tu estrategia de negocio o posicionamiento.Mucha gente se lanza a crear su newsletter sin definir a quién se va a dirigir, de qué va a escribir y cómo va a presentar el contenido. Y esto es lo que produce la mayor desmotivación para seguir adelante.No caigas en el error de la parálisis por análisis. Elige una herramienta sencilla que simplemente te permita enviar emails. Si no lo tienes claro, empieza por una gratuita y ya tendrás tiempo de cambiar dependiendo de tus necesidades.No olvides que la gasolina para que el proyecto funcione son los suscriptores, así que explora nuevas formas de llegar a tu público objetivo, sé original y no te olvides de crear el mejor contenido para ellos. Si haces eso, la monetización vendrá automáticamente.Espero que esta guía te haya arrojado algo de luz entre toda la información que hay en Internet sobre cómo crear un boletín exitoso.Si necesitas más ayuda o te ha quedado alguna duda, me puedes encontrar en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "¿Cómo crear una newsletter? La guía más completa para crear un boletín informativo exitoso"
    },
    {
      "level": "H2",
      "text": "¿Qué es una newsletter?"
    },
    {
      "level": "H2",
      "text": "Ventajas de crear una newsletter"
    },
    {
      "level": "H3",
      "text": "Canal directo"
    },
    {
      "level": "H3",
      "text": "Medición del impacto"
    },
    {
      "level": "H3",
      "text": "Fidelización de los usuarios"
    },
    {
      "level": "H2",
      "text": "5 elementos básicos para definir tu newsletter"
    },
    {
      "level": "H3",
      "text": "¿Por qué vas a crear una newsletter?"
    },
    {
      "level": "H3",
      "text": "¿Quién es tu público objetivo?"
    },
    {
      "level": "H3",
      "text": "¿Cuál es tu propuesta de valor?"
    },
    {
      "level": "H3",
      "text": "¿Qué contenidos vas a enviar?"
    },
    {
      "level": "H3",
      "text": "¿Cada cuánto tiempo vas a enviar tu boletín?"
    },
    {
      "level": "H2",
      "text": "Tipos de newsletters que existen"
    },
    {
      "level": "H3",
      "text": "1. Newsletters con contenidos propios u originales"
    },
    {
      "level": "H3",
      "text": "2. Newsletters de curación"
    },
    {
      "level": "H3",
      "text": "3. Newsletters híbridas"
    },
    {
      "level": "H2",
      "text": "Elegir la plataforma de envío correcta"
    },
    {
      "level": "H3",
      "text": "Herramientas gratuitas para enviar boletines"
    },
    {
      "level": "H3",
      "text": "Herramientas de email marketing para enviar newsletters"
    },
    {
      "level": "H2",
      "text": "Anatomía de un boletín"
    },
    {
      "level": "H3",
      "text": "Asunto y remitente"
    },
    {
      "level": "H3",
      "text": "Cabecera"
    },
    {
      "level": "H3",
      "text": "Índice"
    },
    {
      "level": "H3",
      "text": "Secciones"
    },
    {
      "level": "H3",
      "text": "Enlaces y botones"
    },
    {
      "level": "H3",
      "text": "Baja"
    },
    {
      "level": "H2",
      "text": "7 Estrategias que funcionan para conseguir suscriptores"
    },
    {
      "level": "H3",
      "text": "Haz visible el formulario de registro"
    },
    {
      "level": "H3",
      "text": "Crea un lead magnet"
    },
    {
      "level": "H3",
      "text": "Facilita la difusión"
    },
    {
      "level": "H3",
      "text": "Haz un sistema de referidos"
    },
    {
      "level": "H3",
      "text": "Colabora con otros que tengan audiencias similares"
    },
    {
      "level": "H3",
      "text": "Patrocina otras newsletters"
    },
    {
      "level": "H3",
      "text": "Sé constante y haz buen contenido"
    },
    {
      "level": "H2",
      "text": "Formas de ganar dinero con una newsletter"
    },
    {
      "level": "H3",
      "text": "Patrocinios"
    },
    {
      "level": "H3",
      "text": "Enlaces patrocinados"
    },
    {
      "level": "H3",
      "text": "Venta de servicios y/o productos"
    },
    {
      "level": "H3",
      "text": "Afiliación"
    },
    {
      "level": "H3",
      "text": "Newsletters de pago"
    },
    {
      "level": "H2",
      "text": "Métricas que no debes perder de vista en una newsletter"
    },
    {
      "level": "H3",
      "text": "Número de suscriptores"
    },
    {
      "level": "H3",
      "text": "Bajas"
    },
    {
      "level": "H3",
      "text": "Tasa de apertura"
    },
    {
      "level": "H3",
      "text": "Tasa de clics (CTOR)"
    },
    {
      "level": "H3",
      "text": "Rebotes duros"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Chus Naharro"
}