{
  "url": "https://ahrefs.com/blog/es/como-crear-un-blog/",
  "slug": "como-crear-un-blog",
  "title": "Cómo crear un blog que genere ingresos",
  "description": "La guía más detallada para crear un blog rentable, con consejos que te ayudarán a conseguir tráfico gratuito de buscadores",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido Una verdad incómoda: no todos los blogs generan ingresos. De hecho, la mayoría no lo hace.De los que ganan dinero, pocos consiguen ganarse la vida exclusivamente con su blog. Y la mayoría apenas consiguen unos ingresos decentes.Pero lo que también es cierto es que existen blogs que tienen mucho éxito.La oportunidad que buscas puede ser muy jugosa a nivel internacional y te puede llevar a:Unirte al 31% de blogueros que obtienen unos ingresos secundarios decentes de 6.000 $ al año.Ser parte del 15% que gana al menos 30.000 $ al año.O llegar hasta el 6%-10% de bloggers que ganan más de 10.000 $ al mes.¿100.000 $ al mes? Eso también es posible con los blogs, pero solo bloggers con mucho foco y paciencia lo consiguen.En España tenemos datos menos fiables y públicos, pero, como verás en los ejemplos de abajo, también hay casos muy potentes.Sin más preámbulos, vamos a empezar a crear un blog rentable. También veremos algunas formas de atraer tráfico gratuito desde los motores de búsqueda.Vamos a empezar a crear un blog, paso a paso.Empezando por elegir nuestro nicho, una de las claves que determinará nuestra rentabilidad.1. Encuentra un nicho rentable Aquí tienes algunos nichos que han demostrado ser rentables, tanto a nivel internacional como en España:NichoContenido típicoEjemplo de blogÚltimo informe mensual de ingresosPáginas vistas (últimos datos disponibles)Alimentación y cocinaRecetas clasificadas por tipo de comida y dieta, reseñas de utensilios de cocina, consejos y trucos, listiclesPinch of yum95.196 $ (fuente)4.245MSalud y bienestarAlimentación, relaciones, fitness, belleza, psicologíaHot Beauty Health9.655 $ (fuente)208.6KPaternidad / MaternidadEmbarazo, consejos para educar a los niños, reseñas de productos, recetas de comida, trabajos de padre o madre que se queda en casa, actividades infantiles, consejos domésticosThe Soccer Mom Blog11.288 $ (fuente)500KNoticiasCualquier cosa de interés periodístico en un nicho o varios nichos (también cotilleos)HuffPostAdquirida por AOL en 2011 por 315 millones de dólares, y luego por BuzzFeed (fuente). Según esta fuente, genera 14 millones de dólares al mes.5,8 millones (tráfico orgánico mensual marzo 2023, vía Ahrefs)Tecnología (España)Análisis en profundidad, artículos de opinión, noticias y entrevistas, además de guías de compra.XatakaXataka nació en 2004 como el blog principal de Weblogs. En 2018 la empresa española se vendió a Webedia por una cantidad desconocida (los rumores apuntan a los 10 millones de euros). Fuente24,8 millones (tráfico orgánico mensual en la fecha del informe, vía Ahrefs)TecnologíaAnálisis de software y hardware, ofertas exclusivas, cómo utilizar herramientas de software, comparaciones, artículos de opinión, ganar dinero en internet, noticias tecnológicas, guías de compra, juegos99signals5.242 $ (fuente)18.000 (tráfico orgánico mensual en la fecha del informe, vía Ahrefs)Desarrollo personalTrucos de vida, libertad financiera, bienestar, psicología, motivación, espiritualidad, forma físicaLet’s Reach Success6.652 $ (fuente)115.500MascotasSalud de las mascotas, reseñas de productos, actividades para mascotas, viajar con mascotas, adopción de mascotas, adiestramiento, consejos, listiclesYou did what with your weiner?7.720 $ (incluye ingresos ajenos al contenido, fuente)40.000 (tráfico orgánico mensual en la fecha del informe, vía Ahrefs)Negocios online (España)Consejos para ganar dinero y generar ingresos en internetUna vida onlineUnos 4.000 € al mes (fuente)32.800 (tráfico orgánico mensual en la fecha del informe, vía Ahrefs)Negocios onlineGanar dinero en internet, crear una empresa, entrevistas, cursos completos, tutoriales, inspiraciónSmart Passive Income166.559 $ (fuente)68.000 (tráfico orgánico mensual en la fecha del informe, todos los blogs, vía Ahrefs)FinanzasInvertir, ahorrar dinero, jubilación, reseñas de productos financieros, guías de compra, finanzas familiares, hipotecas, economía colaborativa, deuda, consejos profesionales, iniciativa empresarial, libertad financieraMillennial Money33.473 $ de media (fuente)1,5 millones de visitas en 2017ModaIdeas para conjuntos, decoración del hogar, belleza, consejos de estilo, ideas para regalos, artículos de opinión, guías del compradorChic Pursuit11.376 $ (fuente)135.3KEstilo de vidaCualquier cosa relacionada con resolver los problemas de la vida y vivir una vida más felizAbby Organizes41.700 $ (fuente)Más de 400.000ViajesGuías de ciudades, artículos, consejos de viaje, reseñas de equipos y lugares, vida en la carretera, nomadismo digitalLocal Adventurer41.000 $ (fuente)541.800Viajes (España, LATAM)Consejos para generar ingresos viajando, guías de viajes, marketing.Inteligencia Viajera41.000 € en 2019 (fuente) En meses posteriores han ingresado mucho más (millones), gracias a cursos.En su pico de tráfico superaban las 100.000 visitas, ahora, según Ahrefs, unas 18.000 visitas de búsqueda orgánica al mes.Marketing / SEO (España)Gestión de negocios, campañas de marketing, SEO…Romuald FonsLa fuerte marca personal de Fons le permite generar 20.000 € a la hora. (Fuente).10.000 visitas de tráfico orgánico al mesMarketing/SEO (España)SEO, marketing, blogging, marketing digital…Dean RomeroDean Romero pasó de cobrar 1 € por post como redactor a generar decenas de miles de euros en sus empresas, gracias al SEO y su propio blog. (Fuente).Unas 4000 visitas de tráfico orgánico al mes.Bricolaje/artesaníaDecoraciones DIY, proyectos de bricolaje de fin de semana, tutoriales de manualidades, trucos de vida, reseñas de productos, recetas de comida, reparaciones DIY, renovacioneJennifer Maker15.158 $ (fuente)125.400¿Tu nicho ideal no está en la lista? Revisa estos factores:Busca programas de afiliación en tu nicho de interés. Una búsqueda sencilla, como “programa de afiliación de juegos de mesa”, debería bastar.Comprueba si hay suficientes productos en Amazon que puedas recomendar a través de un programa de afiliados (que no estén excluidos por el programa).Mira otros blogs de tu sector y comprueba si tienen anuncios. Si los tienen, comprueba su tráfico orgánico con nuestro comprobador gratuito de tráfico web. Sus ingresos oscilarán entre 0,01 y 0,25 $ por página vista de tráfico orgánico al mes. Si están activos en otros canales, eso son páginas vistas adicionales.Busca un blog similar al que quieras crear en tu nicho elegido y utiliza una herramienta como Site Explorer de Ahrefs para ver los enlaces patrocinados: son algunos de los acuerdos que potencialmente también podrías conseguir (porque ya están contratando patrocinios con un competidor).Puedes buscar programas de afiliación utilizados en cualquier sitio con estos cuatro pasos.Pero, ¿dónde queda escribir sobre algo que te apasione de verdad?Obviamente, lo mejor es que tus intereses o aficiones coincidan con un nicho rentable. De lo contrario, es fácil perder el interés por tu blog.Pero también puedes verlo de otra manera. Si tratas tu blog como un negocio, no es necesario que te apasione el nicho para tener éxito. Puedes, por ejemplo, crear blogs en alguno de los nichos que acabamos de ver y contratar a alguien para que cree contenidos.Lecturas complementariasCómo encontrar el nicho perfecto para un sitio de marketing de afiliación [2.2] (en inglés)Consejos de investigación de palabras clave para sitios de marketing de afiliados2. Encuentra un ángulo único Hay más de 600 millones de blogs (Web Tribunal). Es probable que haya mucha competencia para lo que quieres crear, así que una buena idea es encontrar una forma de diferenciarte.Aquí tienes algunas ideas:Escribe desde tu experiencia personal. Por ejemplo, a la gente le podría interesar la opinión sobre productos para padres que vengan de un padre con formación en salud.Atiende a un segmento específico. Personas con presupuestos ajustados, zurdos, personas con alergias alimentarias, etc.Trata temas complejos con palabras sencillas. Oversimplified es un buen ejemplo. En español, podríamos decir que Visual Politik hace un buen trabajo. También son muy interesantes los análisis “fáciles” que hace Andrés Oppenheimer en su canal de YouTube, donde ha llegado a entrevistar a figuras como Obama, Bill Gates o Elon Musk.Ofrece conocimientos más profundos que el resto. Por ejemplo, puedes profundizar mucho con tus reseñas de productos.Utiliza muchos elementos visuales personalizados. La mayoría de la gente ojea el contenido. Las infografías, los vídeos y los gráficos originales pueden ayudar a captar la atención de las personas.Llena el vacío en la blogosfera. Por ejemplo, si crees que falta un blog de comida económica, ésa podría ser tu oportunidad.Piensa en la perspectiva y punto de vista de tu blog como inversión a largo plazo. Te ayudará a establecer una marca con la que las personas quieran repetir experiencias y recomendar a más gente.3. Elige un método para monetizar A continuación vamos a ver nueve formas con las que puedes monetizar tu blog.Dependiendo del nicho que elijas, puede haber más oportunidades (por ejemplo, los blogs de comida pueden elaborar recetas para otros o un blog sobre marketing puede ofrecer servicios a empresas).Normalmente, la mayoría de bloggers utilizan varios métodos a la vez. Ten en cuenta que algunos métodos (como puede pasar con algunas plataformas publicitarias) solo estarán disponibles para los blogs que cumplan los requisitos (normalmente, se trata de tener suficiente tráfico), y otros están reservados a bloggers que ya se han hecho un nombre en el sector (por dar charlas y conferencias o tener cierta fama).MétodoCómo funcionaIngresos habitualesPublicidadMuestras anuncios en tu blog y cobras en función del número de clics o impresiones que reciben los anuncios.0,01-0,25 $ por página vista.Programas de afiliaciónPromocionas productos en tu blog y recibes una comisión por las ventas realizadas a través de tu enlace único de afiliado5%-50% (hasta 90%) por venta. En algunos casos, como en el software, las comisiones son recurrentes (durante toda o parte de la vida del cliente)Contenido patrocinadoRecibes una remuneración por publicar en tu blog contenidos que promocionan una marca o un producto concretos.25-$1.000 por artículo.Venta de productosVendes productos físicos o digitales en tu blog y te quedas con los ingresos generados por las ventas.Depende. Por ejemplo, si vendes libros, podrían ser de 9 a 30 €.Cursos en líneaCreas y vendes cursos online en tu blog, y los alumnos pagan por acceder al contenido de tus cursos.Normalmente entre 50 y 400 dólares por venta. Depende del mercado. Si hay mucha competencia y tu blog aún no es popular, deberías considerar un precio más bajoAfiliaciones por suscripciónOfreces contenidos o servicios prémium a suscriptores que pagan una cuota mensual o anual para acceder a ellos.Normalmente entre 10 y 100 € por suscripción.Eventos y ponenciasGeneras ingresos hablando en eventos, conferencias o talleres relacionados con tu nichoCon ciertos niveles de fama, se pueden cobrar algunos cientos de euros, y puede llegar a los miles. En entornos internacionales, suele empezar en torno a los 10.000 $ y llegar hasta los 100.000 $ para ponentes de alto nivel.Coaching y tutoríaOfreces servicios de coaching o tutoría personalizados a los lectores.La tarifa habitual en EE.UU. por una hora de coaching oscila entre 50 y 250 dólares. En España, hablamos de cifras más modestas, de 50-100 €. Tener un blog puede contribuir a tu popularidad y permitirte subir tu tarifa.Vender el blogVendes tu blog a un comprador que está interesado en adquirir tu contenido, audiencia y métodos de monetización.El precio medio de un sitio de contenido es de 101.400 dólares, según Empire Flippers.4. Elige un nombreEsta es la parte en la que toca darle a la creatividad. Mi consejo: es igual que elegir un nombre para una empresa, es decir, aplican las mismas reglas. Debe ser:SencilloFácil de recordarRelevanteÚnicoPiensa a largo plazo; evita las tendenciasAhora, la gran pregunta: ¿Deberías elegir un nombre y un dominio “optimizados para buscadores”? ¿Existe algo así?Google dice que los dominios de coincidencia exacta o “parcial” no potencian el SEO, por lo que desaconseja hacerlo (fuente).Esto quiere decir que para elegir el nombre de dominio, el SEO no debe ser un criterio.Puedes utilizar un dominio con una palabra clave relevante, como “blog de bicicletas”, si el contenido del blog es relevante para las bicicletas. Pero también puedes elegir un nombre más abstracto. Google seguirá evaluando, sobre todo, la calidad del contenido y los enlaces.5. Elige una plataforma de blogging y configura el dominioAquí tienes básicamente dos opciones:Plataforma autoalojada. Obtienes el alojamiento (una parte de tu propio servidor) y la plataforma por separado.Plataforma alojada. Consigue todo lo que necesitas para empezar a publicar en un solo lugar.Aunque la segunda opción pueda parecer la mejor, hay muchas buenas razones para optar por la primera.La opción de autoalojamiento más popular es WordPress, que utilizan entre el 40% y el 45% de los sitios web de todo el mundo. Esta plataforma es gratuita, pero necesitas un servidor, un dominio y un certificado SSL para utilizarla.Suena un poco técnico, pero es bastante fácil de configurar, y puedes tener todo listo en menos de una hora. Además, algunas empresas de alojamiento cuentan con soluciones adaptadas a WordPress, lo que facilita aún más el proceso.En mi opinión, las principales razones por las que tanta gente opta por WordPress son que es fácil de usar, gratuito, personalizable y tiene plugins para todo, incluido SEO, que es importante si quieres conseguir tráfico orgánico.Las plataformas alojadas como Wix o Weebly ofrecen todo bajo un mismo techo, pero no tendrás el mismo grado de personalización (menos plugins y probablemente menos plantillas entre las que elegir).En cuanto al coste, pude conseguir el paquete completo necesario para hacer funcionar WordPress durante todo un año por aproximadamente por unos 30 ó 90 euros al año, dependiendo de tus necesidades:El plan de 29,70 € al año incluye:Un servidor en el que se pueden albergar hasta 2 blogs de WordPress diferentes (o cualquier tipo de sitio, siempre que esté basado en WordPress).50.000 visitas.Una forma super fácil de configurar WordPress.Un dominio gratis el primer año.Un certificado SSL durante un año (SSL es importante para la seguridad, la credibilidad y la clasificación).Y lo configuro todo en unos minutos. Por supuesto, cuando mi número de visitantes alcance el límite, tendré que contratar un plan más caro.Vamos a compararlo con las soluciones alojadas. Todas ellas tienen niveles gratuitos, pero supongamos que no queremos su marca y queremos nuestro propio dominio.Estos son los precios:Wix. A partir de 29 € al mes (para un paquete comparable).Weebly. 168 € al año.WordPress. También tiene una opción de alojamiento, por 48 € al año.PRO TIPSi eliges tener tu propio alojamiento, elige un proveedor con servidores ubicados en el país del que quieras recibir más tráfico. Esto aumentará la velocidad de tu sitio en ese país.6. Diseña tu blogHay dos opciones: Puedes crear una plantilla diseñada a medida u obtener una genérica gratis (o por poco dinero, adquirir una plantilla premium).Si optas por una plantilla personalizada, obtendrás algo original y adaptado a tus necesidades. La parte negativa es que tendrás que esperar para que te la hagan, y te costará más. También tendrás que asegurarte de que recibirás ayuda y soporte durante al menos un año.Así que lo que hacen la mayoría de bloggers cuando empiezan es utilizar una plantilla gratuita o elegir una de un mercado como Envato. Mientras tu blog no sea exactamente igual al de tu competencia, no pasará nada. Con el tiempo, podrás invertir en algo personalizado para que tu blog tenga un aspecto único.En el diseño web, la usabilidad triunfa sobre la estética. Así que intenta tener esto en cuenta cuando elijas el aspecto de tu blog:Claridad. Evita los diseños llamativos y que distraigan.Velocidad. A nadie le gustan los sitios web lentos.Arquitectura. Por ejemplo, algunas plantillas empiezan con una gran cabecera de introducción, mientras que otras van directamente a las últimas entradas del blog.Diseño responsive. Tiene que tener buen aspecto y funcionar bien en todos los dispositivos.Que tenga ubicaciones para publicidad. Cuando revises las plantillas, piensa dónde pueden ir tus anuncios (si eliges este método de monetización).La mayoría de los sistemas de gestión de contenidos (CMS), como WordPress, te permiten cambiar entre plantillas con unos pocos clics. Así que prueba unos cuantos diseños para ver cuál te encaja mejor.7. Encuentra temas con potencial de búsqueda Ahora, ya tienes todo listo para empezar a crear contenidos. Pero no vamos a ponernos a escribir sobre temas aleatorios: adoptaremos un enfoque estratégico.Haremos dos cosas:Encuentra temas que puedan traerte tráfico gratuito desde buscadores como Google.Encuentra suficientes temas para completar un calendario editorial durante meses.Naturalmente, como es tu blog, puedes escribir sobre lo que quieras. Pero si quieres que tu contenido sea rentable, establecer contenido diseñado para posicionar es probablemente la mejor idea. Básicamente, es el tipo de contenido que la gente busca en motores de búsqueda.Así que, en lugar de limitarnos a hacer un brainstorming de ideas, haremos una investigación de palabras clave (o keyword research) para ver qué busca la gente, cuánto tráfico podríamos conseguir y lo difícil que sería posicionarse.Para ello, necesitarás una herramienta como Keywords Explorer de Ahrefs. Y, puesto que nuestro blog es nuevo y queremos posicionarnos relativamente rápido, intentaremos encontrar palabras clave fáciles en las que sea más fácil posicionarse. El proceso es el siguiente.Vamos a:Introducir palabras clave semilla (también conocidas como seed keywords) relacionadas con tu nicho. Para un blog de comida, podría ser algo como “receta”. También podemos incluir más ideas como “pasta, pita, receta, salsa, sopa, taco, envoltura, etc.”.Ir al informe de Términos que concuerdan.Fijar los filtros: KD máx. 20 (dificultad de palabra clave); DR (clasificación de dominio) más bajo hasta 20 en el top 10; Tráfico potencial y volumen, mínimo 200. De esta forma, filtraremos las palabras clave más difíciles que pueden estar fuera de nuestro alcance por ahora, pero seguiremos obteniendo palabras clave que pueden aportar un tráfico considerable.Como hay más de 2.800 ideas de palabras clave en esa lista, tendrás de sobra para tu calendario editorial durante meses. También puedes hacer que la lista sea más manejable aumentando el volumen mínimo, disminuyendo aún más el KD, o excluyendo patrones de palabras clave no deseadas (como palabras clave relacionadas con marcas).Y aquí tienes algunos ejemplos de palabras clave relativamente fáciles de esa lista:TP se refiere al Tráfico potencial de una palabra clave.También puedes obtener ideas de palabras clave de la competencia. Es una gran técnica para encontrar las palabras clave menos obvias. En nuestro caso, son palabras clave relacionadas con la comida y la cocina que no contienen la palabra “receta”. He aquí el proceso a seguir Ahrefs.Ve a Site ExplorerIntroduce la URL del blog (asegúrate de que has elegido Subdominios)Abre el informe Palabras clave orgánicasEstablece filtros: posición: 1-20, KD: máx. 20, volumen: mín. 200, Palabra clave no contiene “receta”Haciendo esa investigación en el conocido blog de Directo al paladar obtuvimos casi 39.000 palabras clave. Veamos algunos ejemplos y su potencial de tráfico:Algo importante que hay que comprobar al elegir las palabras clave es el tipo de contenido dominante. Esta es la parte clave para identificar la intención de búsqueda: lo que las personas esperan cuando buscan algo.Si ves que la primera página de Google está dominada por un tipo de contenido que no puedes crear o que no tiene sentido para tu web o blog (por ejemplo, una página de producto), omite esa palabra clave porque tus posibilidades de posicionarte serán probablemente bajas.Un blog de comida que no ofrezca ensaladeras como producto probablemente no debería intentar posicionarse en la palabra clave “ensaladera”, ya que la página de resultados (SERP) está dominada por páginas de producto. “Ensaladas”, es otra historia.Consulta nuestras guías detalladas para dominar keyword research (investigación de palabras clave):Lecturas complementariasKeyword research: Tu primer paso en SEO , de AhrefsAnálisis de palabras clave de la competencia: cómo encontrar las keywords de tus competidoresInvestigación avanzada de palabras clave: 5 consejos para encontrar palabras clave sin explotarCómo hacer keyword research para sitios de afiliadosNota al margen.¿Qué pasa con el contenido no SEO? ¿Merece la pena si no es probable que genere tráfico orgánico? Creo que la respuesta es sí, pero la decisión depende de ti. Si crees que un tema será interesante para tus lectores, puedes distribuirlo en otros canales (correo electrónico, redes sociales). Ese tipo de contenido aún puede generar páginas vistas y aumentar la vinculación con tu blog.Es más, el contenido que no esté pensado para buscadores puede ayudarte con el SEO. Si consigue enlaces, puede ayudar a tu sitio a aumentar su autoridad y facilitarte el posicionamiento para todas tus palabras clave.8. Crea un calendario editorial Un calendario de contenidos (también conocido como calendario editorial) es un sistema utilizado para organizar, gestionar y programar la producción de contenidos.¿Por qué es necesario?Al hacer keyword research (investigación de palabras clave), se te ocurrirán muchas ideas de temas sobre los que escribir. Así tendrás todo organizado.Te ayuda a mantener el rumbo para alcanzar tu objetivo de creación de contenido (deberías tener uno).Ayuda a organizar el trabajo con personal externo y bloggers invitados (cuando llegues a ese punto).Como blogger principiante, es probable que no necesites un calendario complejo. Puedes organizarlo todo utilizando una herramienta gratuita como Notion, Asana, Trello o incluso un calendario de Google.Aquí tienes algunas ideas para tener información útil en tu calendario:Palabra clave.Fecha de vencimiento.Estado o grado de progreso.Categoría.Autor (si hay varios autores).Cualquier etiqueta que te resulte útil en tu flujo de trabajo, como “patrocinado” o “externalizado”.Potencial de tráfico.Ya que estamos, creo que Notion ofrece una gran funcionalidad (y gratuita) para crear calendarios de contenido o calendarios editoriales. Puedes crear una base de datos de temas y cambiar entre vistas para usar la perspectiva que necesites en cada momento.9. Crea entradas de blog optimizadas Google quiere ofrecer contenido relevante y útil para cualquier consulta de búsqueda. Así que nuestro trabajo como bloggers consiste en comprender qué busca realmente una persona y hacer que ese contenido destaque sobre el resto, sin olvidarnos de su función original. En eso consiste la optimización de contenidos.Vamos a ver cuatro cosas:Formato y ángulo del contenido, es decir, las partes que nos faltaban para entender cómo alinear el contenido con la intención de búsqueda (lo que la persona que busca quiere conseguir con este contenido).Los apartados que el SEO nos indica que podríamos incluir en nuestro contenido.Qué significa contenido de calidad para GoogleAspectos técnicos de SEO en la página: títulos, meta descripciones, texto ALT, etc.Formato y ángulo del contenido Elegir el formato del contenido consiste básicamente en decidir si una entrada o post en el blog va a ser un:Listicle o listadoRecetaGuíaArtículo de definiciónTutorialEn cuanto al ángulo del contenido, es el punto de venta único de una página o entrada de blog. Debe captar la atención de la persona que busca e indicar qué tiene de especial la página. Por ejemplo “mejor”, “gratis”, “en 2023”, “top”,…¿Cómo elegir estos dos aspectos? Igual que hicimos con el formato de contenidos durante la investigación anterior: recurre a las páginas de resultados de los motores de búsqueda (SERP).Por ejemplo, para la palabra clave “cómo ganar dinero por Internet”, podemos ver que los listados dominan las SERP, y algunos de los ángulos interesantes que se utilizan son “en 2023” (o 2024), “mejores”, “sin moverte de casa”, “En España” o “sin invertir”:Lo que esta SERP nos muestra es el tipo de contenido que mejor sirve a la intención de búsqueda. Por tanto, si nos alineamos con la intención de búsqueda pero seguimos ofreciendo algo único y convincente, es probable que tengamos una buena oportunidad de posicionar.Dicho de otra forma, necesitamos un listado o listicle y un ángulo que no se haya utilizado todavía, algo como “5 formas probadas de ganar dinero por Internet”.Qué incluir en tu postLos temas de conversación y los activos que incluyas en un post son importantes no solo para el lector, sino también para los motores de búsqueda.Pueden ayudar a que tu contenido sea más relevante para la palabra clave objetivo, a posicionarte en palabras clave secundarias y a conseguir más enlaces.Lo primero es la estructura de tu post. Puedes hacerte una idea de cómo está estructurado el contenido de las primeras posiciones utilizando nuestra barra de herramientas SEO gratuita. Solo tienes que ir a cualquier artículo que esté entre los mejor posicionados para tu palabra clave, abrir la barra de herramientas e ir al informe Content (contenido).Por ejemplo, aquí podemos ver que uno de los artículos sobre “cómo ganar dinero por Internet” menciona una serie de ideas que podríamos tratar. Además, también habla de métodos no recomendables o de la distinción entre ingresos pasivos y activos.Esto ya es suficiente para hacerse una idea de cómo es un contenido relevante. Para profundizar un poco más, puedes revisar palabras clave secundarias por las que también se posicionan los contenidos mejor posicionados y las palabras que usan con frecuencia.Abre Keywords ExplorerIntroduce tu palabra claveVe al informe Términos relacionados La pestaña También posiciona por te mostrará las palabras clave secundarias, y También habla de te mostrará las palabras mencionadas con frecuencia. También puedes activar Todos los términos para combinar ambas pestañas; asegúrate igualmente de elegir la opción ver para Top 10.He aquí algunos ejemplos de esa lista que podrían ser buenos puntos o subtemas para un artículo sobre cómo ganar dinero por Internet:Naturalmente, esto no significa que debas copiar artículos que encuentres bien posicionados en Google.A pesar de los resultados, Google intenta constantemente recompensar el contenido de mayor calidad y originalidad y degradar a los imitadores. Así que uso estos informes como inspiración para crear una pieza única que aporte algo nuevo a las SERP (páginas de resultados).Además de los puntos en común, es una buena idea incluir contenido que merezca enlaces (también conocido como cebo para enlaces o link bait): investigación original, infografías, recursos gratuitos, ideas originales, historias inspiradoras, etc.No solo harán que tu contenido sea más interesante, sino que también pueden incitar a la gente a enlazarlo. Los enlaces amplifican el alcance de tu contenido y mejoran tu perfil de enlaces (si son enlaces de calidad).ConsejoSi aparece un fragmento destacado en tu palabra clave, suele ser una buena idea optimizarlo. Podría ser tu atajo para alcanzar el primer puesto en la SERP.Por ejemplo, un fragmento destacado puede ser una pista para incluir una definición de la palabra clave objetivo o para estructurar tu entrada de una determinada manera.Nuestro artículo sobre ¿Qué es el contenido SEO? cuenta con un fragmento destacado porque incluimos una definición clara y directa sobre lo que es.Para obtener más información, consulta nuestra guía completa sobre Cómo optimizar para los fragmentos destacados de Google.Crea contenidos de calidadProducir contenidos de calidad es la mejor forma de atraer a los lectores y hacer que vuelvan.Si tienes una idea de cómo crear contenidos mejores que los de la competencia, deberías intentarlo.Pero además de eso, necesitas saber lo que Google considera “contenido de calidad”. Al fin y al cabo, tu contenido debe traer tráfico desde ese motor de búsqueda.Según las directrices de Google, un contenido de calidad es interesante y útil, y eso significa que es:Fácil de leer.Claramente organizado.Único y novedoso.Proporciona información esencial para resolver el problema de alguien que busca en Internet. Ya hemos hablado de ello en el capítulo anterior.En línea con las directrices E-E-A-T de Google. En pocas palabras, debes demostrar claramente qué te hace estar cualificado para ofrecer contenido útil sobre un tema determinado, es decir, por qué deberían confiar en ti los lectores. Para saber más, consulta nuestra guía sobre E-A-T y la última actualización del concepto.Técnicas No nos olvidemos de los “aburridos pero necesarios” aspectos técnicos de la optimización para motores de búsqueda.Aquí tienes algunas prácticas recomendadas fáciles que vale la pena seguir:Incluye la palabra clave de destino en el título. La forma más fácil de hacer que tu título sea relevante para el tema, pero que se ajuste a los 60 caracteres.Escribe una meta descripción atractiva. Probablemente no te ayude a mejorar tu posicionamiento, pero puede ayudarte a conseguir clics desde la SERP.Utiliza direcciones URL cortas y descriptivas. Basta con utilizar tu tema o palabra clave como slug (como puedes ver en este mismo artículo). (El slug es la parte final de la URL, en este artículo, sería “como-crear-un-blog”) Todo esto se optimiza pensando en el usuario, para ayudarle a entender dónde se encuentra en el sitio web (además, las URL son visibles en las SERP).Añade texto ALT a tus imágenes. El texto debe ser conciso y preciso. Google utiliza este texto alternativo (y el contenido que lo rodea) para entender las imágenes.Enlaza a recursos internos y externos. Cita otras páginas cuando sea pertinente y cuando quieras dirigir a la gente hacia contenidos útiles.Optimiza para resultados enriquecidos. Son los formatos especiales de contenido que se encuentran en las SERP más allá de los enlaces azules estándar. Por ejemplo, las recetas pueden mostrarse encima de los enlaces azules como un carrusel con una imagen grande, valoraciones y tiempo de preparación. Consulta la guía de resultados enriquecidos de Google para ver los resultados enriquecidos elegibles para tu tipo de contenido.10. Promociona tu blog En esta sección, quiero mostrarte algunas formas de promocionar eficazmente tu blog de forma gratuita.Evidentemente, ninguna de las formas consiste en invertir en anuncios.El motivo es que, a menos que vendas algún producto de gran valor a través de tu blog, como un curso, un producto físico o una membresía a una comunidad, es probable que no obtengas un ROI (retorno de la inversión, del inglés return on investment) positivo con los anuncios. Son matemáticas muy sencillas: si el coste medio del anuncio es superior a lo que te pagan por mostrar anuncios en tu blog, pierdes dinero.Vamos a profundizar.Crea una lista de correo electrónicoCrear una lista de correo electrónico parece una táctica cliché, pero no la subestimes.Como nos cuenta Chus Naharro, especialista en newsletters y creadora de contenidos,Las newsletters forman parte de cualquier estrategia de email marketing. O deberían.Son muchas las empresas que envían boletines a su lista de contactos. Sin embargo, muchos profesionales independientes y creadores de contenidos se han sumado a las bondades que ofrece este formato de contenidos.Las ventajas de enviar un boletín informativo son:Canal directoMedición del impactoFidelización de los usuariosEn su guía para crear una newsletter, nos da mucho más detalles, pero algunos de los puntos que menciona son la independencia de los algoritmos de las redes sociales o que nos ayudan a conservar la relación con nuestros usuarios.No está sola, tenemos también a Abby Lawson, de Abby Organizes:Nuestra lista de correo electrónico se ha convertido en uno de los mayores contribuyentes, si no EL mayor, al éxito de nuestro negocio, y si hubiera empezado a hacerla crecer antes, sería todavía más grande. Nuestra lista de correo electrónico nos permite mantenernos en contacto con nuestros seguidores más fácilmente y conocerlos mejor. Nos ha ayudado a vender más productos y a aumentar nuestro tráfico. Sin ella, no sé si habríamos podido dar el salto a que Donnie y yo escribiéramos un blog a tiempo completo, y agradecemos muchísimo a nuestros suscriptores que nos sigan en nuestro viaje.El correo electrónico va a ser tu línea directa con tu audiencia. No pagas casi nada por llegar a un público que sabes que está interesado en tu blog (o en realidad nada, si usas una herramienta de e-mail marketing gratuita), y puedes utilizar la lista para ofrecer productos o servicios. ¿Necesitas recurrir a todo tipo de trucos para conseguir que la gente se suscriba? Lo dudo; es el camino más rápido para que se suscriban personas poco comprometidas. La mejor forma de conseguir que la gente se suscriba es colocar un formulario de suscripción junto a un contenido realmente bueno.Por supuesto, puedes ofrecer algún tipo de oferta especial a tus suscriptores, como contenido exclusivo. Pero asegúrate de que sea relevante.Por cierto, permíteme mencionar una práctica importante aunque contraintuitiva. Una vez que tu lista crezca, elimina los contactos que no hayan abierto tus correos electrónicos en los últimos dos meses. Te ayudará a conseguir una mejor entregabilidad del correo electrónico y a mantener bajos los costes de tu plataforma de e-mail marketing.Lecturas complementarias¿Cómo crear una newsletter? La guía más completa para crear un boletín informativo exitoso.8 maneras fáciles (pero eficaces) de hacer crecer tu lista de correo electrónico Consigue enlaces Si quieres tráfico gratuito de Google, vas a necesitar enlaces. Cuanto más competitivas sean las palabras clave en las que te quieras posicionar, más enlaces de calidad necesitarás.¿Por qué enlaces? Los enlaces son uno de los factores de posicionamiento más importantes para Google.Hay dos formas de conseguir enlaces para tu contenido:De forma orgánica. La gente enlaza a tu contenido porque cree que es útil o enlaza a una parte específica de tu entrada de blog que contiene información a la que quiere referirse (como datos, análisis o investigación). Es la razón por la que deberías incluir linkbait o cebo para enlaces (como se explica en la sección anterior).Contacto (outreach). Escribes a otras webs y les pides un enlace. Tiene sentido hacerlo cuando no tienes ninguna duda de que tu enlace mejorará el contenido de la web a la que escribes.En realidad, lo mejor es que combines ambas tácticas. De este modo, cuando te pongas en contacto con la gente y presentes tu contenido, tendrás algo convincente a lo que enlazar.Existen bastantes técnicas para conseguir enlaces mediante outreach. Te mostraré un ejemplo: hacer link building con enlaces rotos. Consiste en encontrar enlaces rotos en el contenido de otras páginas, que apunte a tus competidores, ponerte en contacto con quien administre la web o gestione el contenido y pedirle que cambie el enlace roto por uno nuevo que lleve a un contenido tuyo que cumpla una función similar y que esté activo.Abre Site Explorer.Introduce la URL de tu competidor (puede ser todo el sitio o una página concreta).Ve al informe de Enlaces rotos y mira las páginas rotas junto a los sitios que las enlazanPara hacerlo a mayor escala, utiliza Content Explorer de Ahrefs:Escribe tu tema y establece el modo En título (In title)Establece filtros: Solo rotas, idioma preferido y Dominios de referencia mín. 20 (opcional, para filtrar sitios web con menor autoridad)Elige una página rota de los resultados y haz clic en Enlaces para saber qué páginas han enlazado y por qué (mira el texto de anclaje y el que lo rodea)Ponte en contacto con estos sitios web y comprueba si pueden enlazar a tu contenido en su lugarEso es lo básico. Puesto que vivimos en tiempos en los que los enlaces son la moneda de cambio de la web, puede ser difícil conseguir un enlace. Consulta nuestras guías sobre link building y outreach para aumentar tus posibilidades (sin spamear a la gente):Lecturas complementariasLa guía para principiantes al link buildingLas 8 únicas herramientas de link building que necesitas (gratuitas y de pago)¿Deberías comprar enlaces en 2023? DependeReutiliza tus contenidos Tu público objetivo está disperso en múltiples canales, cada uno con un potencial de alcance distinto. Por eso, al reutilizar, puedes ampliar el alcance de tu contenido:Las entradas de blog pueden convertirse en hilos de Twitter.Las entradas de blog pueden convertirse en vídeos (y viceversa).Los artículos o vídeos individuales pueden agruparse y convertirse en un curso o libro electrónico gratuito.Los ebooks pueden convertirse en campañas de drip email o por goteo (es decir, enviarse en secuencias).Los extractos de libros electrónicos pueden convertirse en artículos de invitados.Las entradas de blog pueden convertirse en respuestas en Quora.Y así sucesivamente.Por ejemplo, puedes encontrar algunos de nuestros contenidos del blog reutilizados en nuestro canal de YouTube, y viceversa.Este vídeo, que hablaba de plantillas de posts para escribir mejor contenido SEO, obtuvo más de 52.000 visitas en YouTube.Y en formato post, en nuestro blog, genera unas 1.400 visitas al mes.En nuestro blog en español hemos hecho varias veces algo parecido. Por ejemplo, este vídeo sobre estrategias de marketing digital tiene más de 36.000 reproducciones:Y también cuenta con su versión en post: 7 estrategias de marketing digital que funcionan.Puedes hacerlo con todo tu contenido. Pero si eres un equipo de una persona, probablemente querrás priorizar. Dirígete a nuestra guía sobre reutilización de contenidos, donde te mostramos cómo calcular si tu inversión de tiempo merecerá la pena.Ve donde esté tu audienciaPiensa en otros blogs, newsletters, podcasts: estos son los lugares donde probablemente se reúne tu audiencia. Y antes de que vengan a ti, tienes que ir a ellos. Si vas a estos sitios:Tu blog puede ganar más notoriedad.Puedes conseguir tráfico directo a tu blog.Puedes ganar un enlace que puede ayudarte a potenciar tu SEO (excepto en el caso de las newsletter que se envían exclusivamente por correo electrónico; solo pueden conseguirte enlaces indirectamente).Encontrar estos lugares no es difícil. Probablemente ya conozcas algunos buenos, y puedes utilizar Google para encontrar más.Para saber cuál de ellos puede proporcionarte el mejor enlace, utiliza la barra de herramientas SEO de Ahrefs mientras realizas una búsqueda en Google y fíjate en el Domain Rating (clasificación de dominio) de la web (cuanto más alto, mejor). Tenlo en cuenta: Los que tienen DR superior a 80 pueden ser más difíciles de conseguir.DR es una escala de 100 puntos.Un buen truco que puedes hacer en Ahrefs es buscar artículos de un autor prolífico y excluir los sitios web de ese autor de los resultados. De este modo, puedes encontrar webs en las que el autor haya escrito como invitado y presentarte para escribir tú.Abre Content Explorer.Utiliza operadores de búsqueda; ejemplo: author: \"Aleyda Solis\" (-site:aleydasolis.com AND -site:orainti.com)Ordena la lista por DR para obtener primero las páginas con más autoridad. También puedes marcar la opción “una página por dominio” para ver solo las webs en las que ha colaborado (es decir, si ha escrito 5 artículos en una página, solo verás uno).Lecturas complementariasGuest Blogging para SEO: Cómo construir enlaces de alta calidad en escalaCómo hacer link building con podcastsOtras tácticas Aquí tienes más tácticas gratuitas y eficaces de promoción de blogs que deberías tener en cuenta:Comparte en comunidades. Las comunidades siempre acogen el material realmente bueno, es decir, original y útil para los demás miembros de la comunidad.Avisa a las personas o marcas que has mencionado. No confundir con ego baiting. Si has encontrado a alguien o algún sitio lo suficientemente interesante como para mencionarlo, háblales de ello. Menciónalos en Twitter o simplemente escríbeles. Esta táctica será probablemente más eficaz a medida que crezca la reputación de tu blog.Responde a las peticiones de los periodistas. Si colaboras con tu opinión, proporcionando una cita o quote, sobre un tema en el que tienes experiencia, puedes aparecer en medios de comunicación relevantes (o, simplemente, grandes) y conseguir enlaces. ¿Eres nuevo en esto? Consulta nuestra guía completa sobre cómo utilizar HARO para link building. En español, puedes usar Reportaro.Amplifica tu contenido en redes sociales. Al igual que tú, tu audiencia dividirá su atención entre diferentes plataformas de redes sociales. Consejo: adáptate a la plataforma; no te limites a compartir enlaces a las entradas de tu blog, crea contenido nativo para cada red.Acepta artículos de invitados y haz entrevistas. Puede que no sea la mejor táctica para los principiantes (ya que los autores invitados suelen elegir blogs con más reputación y autoridad), pero es algo que puedes hacer más adelante, a medida que crezca tu reputación. Beneficios: páginas vistas gratuitas, enlaces (ver más abajo) y, por supuesto, un gran contenido para tus lectores.Algunos de los contenidos más enlazados del blog makingsenseofcents.com son entrevistas.11. Mantén tu blog en formaHay otras cosas que tienes que hacer además de lanzar nuevos contenidos.Supervisa la salud SEOIdealmente, querrás que tu sitio no tenga ningún problema de SEO. Sin embargo, basta con que evites los más críticos, que pueden afectar gravemente a tu posicionamiento o incluso eliminarte de los resultados de búsqueda.Para ello, necesitarás herramientas SEO que supervisen tu sitio automáticamente, informen de los problemas y sugieran soluciones. Estas dos herramientas deberían ser más que suficientes:Ahrefs Webmaster Tools (es gratuita, y es una funcionalidad también incluida en la suscripción completa a Ahrefs).Google Search Console.Echa un vistazo a esta guía para entender las claves del SEO técnico. Este breve post puede ser un buen complemento para configurar las dos herramientas citadas anteriormente y resolver los problemas más comunes.Actualiza tus artículos con regularidad para mejorar el SEOActualizar las publicaciones puede ayudarte a recuperar posiciones perdidas y a mejorar las páginas que nunca llegaron a tener una posición suficientemente alta.Los contenidos de bajo rendimiento pueden dividirse en dos categorías:Ya se posicionan entre los 10 primeros resultados. Es probable que estos artículos necesiten una actualización menor, como actualizar información obsoleta o ampliar algunos datos.Se posicionan por debajo de los 10 primeros resultados. Es probable que estos artículos necesiten una revisión más profunda. Es posible que tengas que reescribir la mayor parte del contenido para tener más posibilidades de posicionarte.Para encontrar artículos que nos merezca la pena actualizar, puedes utilizar dos tipos de herramientas.La primera es nuestro plugin gratuito para WordPress. Si vas a utilizar WordPress para tu blog, esta herramienta supervisará el posicionamiento de la palabra clave objetivo y, en función de ello, te sugerirá la acción adecuada.También puedes utilizar una herramienta que haga seguimiento de tu posicionamiento, como Rank Tracker de Ahrefs. Rastrea tus objetivos de palabras clave principales y, a continuación, utiliza el filtro de posición para encontrar las páginas posicionadas entre las posiciones 1 y 10 (para actualizar) y por debajo de la posición 11 (para reescribir).Nota al margen.Según profesionales SEO que encuestamos, normalmente se tarda entre tres y seis meses en conseguir resultados. Así que espera al menos tres meses antes de hacer cambios significativos en tus publicaciones.Una vez que encuentres tus entradas de blog de bajo rendimiento, hay algunas cosas que puedes hacer, dependiendo del caso:Cambiar el formato (por ejemplo, cambia de un artículo a una guía).Añadir un subtema que falta.Actualizar estadísticas que se hayan quedado anticuadas, datos, etc.Añadir enlaces internos desde otras páginas.Añadir más recursos útiles: citas, imágenes, estadísticas, etc.Demostrar más experiencia de primera mano sobre el tema.… y mucho más. Lee nuestra guía completa sobre cómo republicar contenido antiguo para SEO para más consejos sobre el tema.PREGUNTAS FRECUENTESPreguntas frecuentes sobre cómo crear un blog rentable.¿Cómo cobran los bloggers? Estas son las formas más habituales de monetizar un blog:Publicidad.Marketing de afiliación.Publicaciones patrocinadas.Escribir para otras personas o empresas, como freelance.Vender productos, servicios o afiliaciones.Dependiendo del método de monetización, las normas de pago también difieren. Por ejemplo, para el marketing de afiliación, puede que cobres pasados 30 días desde la compra y solo si el comprador no devuelve el producto. Mientras que para las publicaciones patrocinadas, puedes conseguir que te paguen por adelantado.En este artículo tienes nueve formas de monetizar un blog (como recordarás de la tabla del punto 3). Pero dependiendo del nicho, este número puede variar (por ejemplo, puede haber hasta 18 formas de monetizar un blog de comida).¿Cómo crear un blog sin dinero? Es posible crear un blog sin gastar absolutamente nada de dinero utilizando herramientas de blog gratuitas y alojamiento gratuito. Sin embargo, no es necesariamente la mejor forma de empezar. Es un mundo competitivo, y los mejores blogs utilizan servicios y herramientas de pago para conseguir ventaja.En lugar de eso, intenta mantener los costes bajos si tu presupuesto es ajustado. Por ejemplo, utiliza una plantilla de blog gratuita en lugar de una personalizada, encuentra alojamiento WordPress barato y utiliza herramientas gratuitas siempre que sea posible. Paga por las herramientas solo si las consideras una buena inversión.Por último, pero no por ello menos importante, si tienes poco dinero y quieres utilizar el blog como ingreso principal, esto puede ser difícil de conseguir. Un blog puede tardar en dar beneficios considerables, así que es mejor que te prepares para contar con otras fuentes de ingresos antes de que eso ocurra (espera un poco antes de dejar tu trabajo).¿Cómo empezar un blog siendo principiante? Si quieres crear un blog que genere dinero, todo se reduce a:Elegir un nicho rentable, un ángulo único y un nombre.Planificar cómo vas a monetizar.Elegir una plataforma de blogging y registrar tu dominio.Crear contenido basado en el tráfico potencial y en los intereses de tu audiencia.Promocionar tu contenido.Puedes empezar a escribir en el blog el mismo día, y no requiere ninguna habilidad especial como saber programar. Aunque tendrás que rellenar algunos “espacios en blanco”, como tu nicho, tu nombre y los temas sobre los que escribirás.¿Qué tipo de blogs generan dinero? En esencia existen cinco tipos de blogs que generan dinero:Blogs de nicho. Profundiza en un nicho o tema concreto. Ejemplos de nichos rentables: comida y cocina, salud y forma física, paternidad y maternidad, noticias, tecnología, empresas, finanzas, viajes.Blogs de afiliados/análisis y reviews. Blogs creados con el propósito de recomendar productos y ganar dinero mediante comisiones de programas de afiliados.Blogs personales. Blogs sin ningún tema o nicho en particular, aparte de las experiencias y opiniones personales del autor.Blogs de marca personal. Su objetivo principal es dar a conocer a su autor/a en un sector concreto. Estos blogs se diferencian de los blogs personales en que el contenido se orienta más específicamente hacia el área de especialización de quien escribe.Blogs empresariales/corporativos. Promocionan productos, servicios y marcas propiedad de la empresa.¿Por qué fracasan la mayoría de los blogs?Razones más comunes por las que fracasan los blogs y los bloggers:Rendirse antes de tiempo.Falta de consistencia al publicar.Escriben para sí mismos, sin tener en cuenta a su público y la demanda de los temas.Nunca monetizan su blog.No aportan un valor único.No invierten en su blog,Ignoran el SEO.No promocionan sus contenidos.¿La gente sigue leyendo blogs?En total, el 77% de los usuarios de Internet leen blogs (Social Media Today) y casi el 26% de los habitantes del Reino Unido de entre 5 y 18 años leen blogs (Statista).¿Cuántas veces a la semana debo publicar en mi blog?Los blogs que publican de dos a seis veces por semana tienen un 50% más de probabilidades de obtener buenos resultados (Orbit Media).Pero puedes publicar menos y tener éxito. Por ejemplo, Financial Samurai, uno de los blogs más destacados en el nicho financiero, ha estado publicando tres posts por semana.Reflexiones finales Llevar un blog a la rentabilidad puede ser un trabajo tedioso. Pero si te lo tomas en serio y dedicas tiempo, puedes poner en práctica estos consejos para que tu blog empiece a ganar tracción. A continuación, puedes leer las historias de otros blogueros de éxito.Carrie Forest creó el blog Clean Eating Kitchen para ayudar a las mujeres que se recuperaban de problemas de salud crónicos, después de haber luchado ella misma contra ellos. Su blog empezó a generar ingresos cuando empezó a hacer SEO. Ahora el blog genera 20.000 dólares al mes; puedes leer la historia de su fundadora aquí.Jennifer Marx, de Jennifer Maker, empezó su blog cuando estaba arruinada. Lo convirtió en un negocio con el que ha conseguido ganar seis cifras al mes en pocos años. Escucha su historia.Michelle Schroeder-Gardner empezó Making Sense of Cents en 2011 para hacer un seguimiento de su progreso financiero. Ahora su blog gana 40.000 $ al mes, y ella trabaja solo unas horas a la semana desde su velero (o donde quiera que esté actualmente). Lee su historia y descubre algunos de sus consejos sobre blogs.Abby y su marido han hecho del blogging un negocio familiar a tiempo completo. En su último informe de ingresos, explica cómo lo consiguió y comparte algunos consejos sobre blogs.En España tenemos también casos:Ángel Alegre de Vivir al Máximo dejó su trabajo en Microsoft para emprender online. Su blog ha sido la piedra angular de varios negocios online que le permiten vivir por su cuenta.AyudaWP, de Fernando Tellado es uno de los blogs clásicos centrados en WordPress. En su blog puedes encontrar consejos de todo tipo, desde hosting, a tutoriales completos de WordPress o WooCommerce.En Estrategia para Profesionales Libres, Andrés Pérez Ortega lleva compartiendo desde 2004 reflexiones sobre marca personal y estrategias para personas libres. Vende libros, cursos y distintos servicios.¿Tienes preguntas o comentarios? Te esperamos en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo crear un blog que genere ingresos"
    },
    {
      "level": "H2",
      "text": "1. Encuentra un nicho rentable"
    },
    {
      "level": "H2",
      "text": "2. Encuentra un ángulo único"
    },
    {
      "level": "H2",
      "text": "3. Elige un método para monetizar"
    },
    {
      "level": "H2",
      "text": "4. Elige un nombre"
    },
    {
      "level": "H2",
      "text": "5. Elige una plataforma de blogging y configura el dominio"
    },
    {
      "level": "H2",
      "text": "6. Diseña tu blog"
    },
    {
      "level": "H2",
      "text": "7. Encuentra temas con potencial de búsqueda"
    },
    {
      "level": "H2",
      "text": "8. Crea un calendario editorial"
    },
    {
      "level": "H2",
      "text": "9. Crea entradas de blog optimizadas"
    },
    {
      "level": "H3",
      "text": "Formato y ángulo del contenido"
    },
    {
      "level": "H3",
      "text": "Qué incluir en tu post"
    },
    {
      "level": "H3",
      "text": "Crea contenidos de calidad"
    },
    {
      "level": "H3",
      "text": "Técnicas"
    },
    {
      "level": "H2",
      "text": "10. Promociona tu blog"
    },
    {
      "level": "H3",
      "text": "Crea una lista de correo electrónico"
    },
    {
      "level": "H3",
      "text": "Consigue enlaces"
    },
    {
      "level": "H3",
      "text": "Reutiliza tus contenidos"
    },
    {
      "level": "H3",
      "text": "Ve donde esté tu audiencia"
    },
    {
      "level": "H3",
      "text": "Otras tácticas"
    },
    {
      "level": "H2",
      "text": "11. Mantén tu blog en forma"
    },
    {
      "level": "H3",
      "text": "Supervisa la salud SEO"
    },
    {
      "level": "H3",
      "text": "Actualiza tus artículos con regularidad para mejorar el SEO"
    },
    {
      "level": "H2",
      "text": "PREGUNTAS FRECUENTES"
    },
    {
      "level": "H3",
      "text": "¿Cómo cobran los bloggers?"
    },
    {
      "level": "H3",
      "text": "¿Cómo crear un blog sin dinero?"
    },
    {
      "level": "H3",
      "text": "¿Cómo empezar un blog siendo principiante?"
    },
    {
      "level": "H3",
      "text": "¿Qué tipo de blogs generan dinero?"
    },
    {
      "level": "H3",
      "text": "¿Por qué fracasan la mayoría de los blogs?"
    },
    {
      "level": "H3",
      "text": "¿La gente sigue leyendo blogs?"
    },
    {
      "level": "H3",
      "text": "¿Cuántas veces a la semana debo publicar en mi blog?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}