{
  "url": "https://ahrefs.com/blog/es/como-escribir-contenido-calidad/",
  "slug": "como-escribir-contenido-calidad",
  "title": "Cómo escribir contenido de calidad para las búsquedas",
  "description": "La mayoría del contenido de internet está creado por SEOs o escritores que investigan un poco y repiten lo mismo que ya han encontrado. Quizá sirva para generar algo de tráfico, pero no causará una impresión. Entonces, ¿qué hace que un contenido sea de calidad? ¿Cómo se puede medir? Te lo contamos.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido Muchos de los contenidos que se pueden encontrar en internet están creados por SEO o escritores que investigan un poco y repiten la misma información que se han encontrado. Algunos contenidos pueden, incluso, cubrir bien un tema y abordar los aspectos principales, pero la información suele ser básica y todos los artículos terminan siendo los mismos. Es cierto que este tipo de contenido puede generar tráfico de búsqueda, pero no va a causar una buena impresión.El contenido de calidad es un contenido útil, profundo y memorable que demuestra conocimientos reales.Crear contenido de cero es una batalla cuesta arriba y es posible que muchas de las páginas que ocupan los primeros puestos lleven años en esas posiciones. De hecho, la media de “edad” de las 10 primeras páginas es de más de 2 años.Estas páginas han tenido tiempo de acumular muchos enlaces y es posible que hasta hayan actualizado su contenido. Por ello, si quieres competir con estas páginas, tienes que esforzarte al máximo y crear contenidos de calidad.En este artículo veremos lo siguiente:Cómo crear contenido de calidadCómo medir el éxito de los contenidosEmpecemos.Cómo crear contenido de calidadCrear contenidos es una tarea laboriosa, pero garantizar su calidad requiere aún más trabajo, recursos y experiencia. Se necesita un buen proceso y el equipo adecuado.Aquí tienes un framework que puede ser útil.¿Qué contenidos deberías crear?En vez de empezar con una lista de palabras clave como suelen hacer los SEO, prefiero empezar con una investigación a nivel de página y, luego, trabajar hacia atrás hasta llegar a las palabras clave y los temas.Introduce cada uno de tus competidores de búsqueda orgánica en el informe Páginas principales del Site Explorer de Ahrefs y exporta los archivos. Te recomiendo que los guardes en una carpeta nueva.Exporta las páginas principales de los sitios de la competencia.Ahora tenemos que combinar todos los archivos con las mejores páginas de los diferentes competidores. Es posible que quieras hacer esto con una de las opciones de herramientas online para combinar archivos CSV si te resulta más fácil.Personalmente, suelo hacerlo con el Windows Command Prompt. Aquí tienes el proceso con el Command Prompt. Estos son los cinco pasos que debes seguir:Guarda los archivos en una carpeta nueva.Obtén la ruta pulsando la tecla “mayús” + clic derecho en la carpeta y “Copiar como ruta”, o cópiala de la barra de direcciones cuando veas el contenido de la carpeta.Abre Command Prompt, que lo puedes encontrar buscando “cmd”.Escribe “cd”, pulsa “Espacio”, haz clic con el botón derecho y pega. A continuación, pulsa “Intro”.Escribe “copiar *.csv como-se-llame.csv” y pulsa “Intro”.Para MacOS, utiliza Terminal en vez de Command Prompt y el comando para combinarlos es “cat *.csv >como-se-llame.csv” para el quinto paso. Por lo demás, las instrucciones deberían ser las mismas.El resultado es una lista fácilmente filtrable de las páginas más exitosas que tus competidores han creado en tu nicho.Combina el archivo CSV con las páginas principales de los competidores.Con este archivo, haz clic en “Insertar” > “Tabla dinámica” > pulsa “Aceptar”.A partir de ahí, selecciona “Palabra clave principal” y “Tráfico” o “Valor del tráfico” y, opcionalmente, “URL” si quieres ver qué páginas de la competencia están posicionándose por ciertos términos.Utiliza “Datos” > “Ordenar” para hacerte una idea del contenido de valor de tu nicho. Es posible que tengas que ajustar el ancho de la columna para que sea más fácil leerlo.Este es el proceso:Proceso para convertir estos datos en una tabla dinámica.Terminarás con algo así:Tabla dinámica con las páginas principales.Una vez hayas determinado los contenidos que aportan valor a los competidores, es hora de priorizar cuáles tienen más valor comercial para ti. A continuación, puedes volver a la investigación de palabras clave para determinar lo que deberías incluir en el contenido.Investigación de palabras claveVer todo lo que busca la gente es como tener un superpoder: la gente te dice todo lo que quiere, literalmente. Te están dando una guía del contenido que les resulta útil y eso es exactamente lo que tienes que incluir en tu contenido.Introduce un término en el Keywords Explorer de Ahrefs y ve al informe “Términos que concuerdan”. Es conveniente agrupar todos estos términos de una manera que tenga sentido para ti. Sugerimos algunas agrupaciones, ya sea por términos comunes o por temas principales.Informe de “Términos que concuerdan” para la búsqueda “marketing de contenidos”.Es posible que quieras ir aún más lejos en la agrupación. Por ejemplo, para los términos principales (búsquedas cortas con un alto volumen de búsqueda) que son principalmente informativos, es posible que el tema principal en sí (“qué es el tema principal”) y la “definición del tema principal” tengan la misma intención y se puedan agrupar.Con los términos o grupos de términos, hay que determinar lo que se debería enfocar como una página o solo como parte de otra página. No hay una respuesta correcta o incorrecta. Una vez más, tan solo hay que organizar los datos de una manera que tenga sentido para ti.Es posible que no quieras crear páginas para cosas sobre las que no tienes mucho que decir o si no hay mucha gente buscando esos términos.Hay un ejercicio que me gusta hacer que ayuda a la gente a entender esta parte. Imprimo o escribo todos los términos en fichas y pido a los participantes o grupos que los organicen de la forma que les parezca más adecuada. Incluso comparto cómo los agrupo yo. Lo curioso es que es raro que dos agrupaciones sean exactamente iguales.Hay veces en las que una página con más contenido sobre un tema funciona mejor que otro. En otras ocasiones, una página más específica y especializada funcionará mejor. Lo importante ahora es crear el contenido. Más adelante, podrás probar si funciona mejor combinado o separado.Ahora que sabes sobre qué quieres escribir, veamos el proceso.Crea un esquema o resumen de contenidosCada artículo y vídeo que creamos en Ahrefs comienza con un esquema. Utilizamos los datos del proceso de investigación de palabras clave para elaborar el contenido principal que queremos incluir.A partir de ahí, añadimos cualquier punto importante que queramos destacar, los datos que tengamos y cualquier otra información o experiencia que pueda ser útil para los lectores.Es posible que te interese leer algunas de las páginas que ya están posicionadas para obtener ideas adicionales. Fíjate en el tipo de lenguaje y los temas relacionados que se mencionan. Es posible que muchos de estos términos no aparezcan en la investigación tradicional de palabras clave.También tenemos un informe en el Keywords Explorer que puede ayudarte a ver los temas y el lenguaje que se utiliza. Se llama Informe “También habla de” y te muestra el tipo de lenguaje que se utiliza en estas páginas de ranking.Hasta para algo de lo que puede que no sepas absolutamente nada, puedes hacerte una idea del tipo de lenguaje que se utiliza en el sector. Puede que te interese incluir este tipo de terminología cuando escribas sobre tu tema.Informe “También habla de” para “neurocirugía”.Con esto, hemos cubierto lo básico del esquema, pero hay un par de elementos adicionales que me gustaría añadir.Escribe para los fragmentos destacadosPara el contenido informativo, te recomiendo que investigues un poco más e incluyas los fragmentos destacados, que actualmente son elegibles, o incluso que escribas un fragmento destacado que creas que tiene posibilidades de convertirse en el fragmento principal.Esta es, sin duda, la sección más importante para posicionarse en las consultas informativas. Puedes ver lo que ya es elegible para un snippet y el tipo de cosas que estos fragmentos mencionan, así como por qué uno puede ser mejor que otro. Ahora tan solo tienes que crear algo que sea mejor.Un ejemplo: para la búsqueda de “cómo crear contenidos”, el fragmento destacado es de ciudadano2cero.com.Resultado de la búsqueda en Google de “cómo crear contenidos”.Si añades “-ciudadano2cero.com” a tu búsqueda, estarás eliminando este sitio de los resultados y, si hay un segundo fragmento destacado, lo verás. Con esta búsqueda, no hay otro fragmento destacado, pero salimos en el primer puesto (¡!).Resultado de la búsqueda en Google de “cómo crear contenidos -ciudadano2cero.com”.Puedes repetir este proceso, eliminando más sitios de los resultados para ver más fragmentos destacados elegibles. También puedes obtener información sobre lo que se necesita para obtener fragmentos destacados y averiguar por qué uno puede considerarse mejor que otro.Para algunos términos de cabecera que son más informativos por naturaleza, puede que tengas que refinar la consulta como “qué es el término de cabecera” para que esto funcione.Enlaces internosEl otro aspecto que me gusta incluir son los enlaces internos sugeridos que irán a la nueva pieza de contenido.¿Alguna vez has tenido un contenido que se posicionó bien al principio, pero que cayó poco después? El contenido nuevo puede heredar algunas señales y posicionarse bien durante un tiempo, pero, al final, tiene que posicionarse con sus propias señales.Para dar a tu contenido la mejor oportunidad de posicionamiento, enlázalo donde tenga sentido en el resto de tu contenido.Si el contenido ya existe, lo puedes ver fácilmente en el informe “Internal link opportunities” (oportunidades de enlaces internos) de Site Audit de Ahrefs. Por ejemplo, para el post sobre auditoría de contenido que escribimos hace no mucho, hay nueve oportunidades a las que podemos enlazar utilizando texto de anclaje relevante.Informe “Internal link opportunities” (oportunidades de enlaces internos) para “cómo hacer una auditoría”.Con un blog nuevo, lo que se puede hacer es utilizar el “Page Explorer” dentro de Site Audit para buscar términos relevantes dentro del texto de otras páginas. En este caso, se puede ver que tenemos 33 páginas que hablan de auditorías de contenido. Estas pueden, potencialmente, enlazar al post sobre auditorías de contenido.En la mayoría de los nichos, no se llega muy lejos solo con el contenido y es posible que se necesiten enlaces para mejorar el posicionamiento. Puedes ir a por los enlaces externos más adelante, pero los enlaces internos son un objetivo más fácil.Por ejemplo, cuando desautoricé los enlaces a algunos de los artículos de nuestro blog, todos ellos perdieron varias posiciones para términos importantes, además de bastante tráfico. Con el esquema en la mano, veamos cómo crear el contenido.Producción de contenidosEn mi opinión, es muy difícil que una sola persona sea capaz de crear contenidos de calidad. Normalmente, se necesita un equipo de personas con diferentes habilidades.El equipo ideal diría que incluiría un SEO, un experto, un redactor y un editor implicados en el proceso.Es posible que una persona pueda desempeñar más de una de estas funciones y existen herramientas en las que puedes apoyarte para las distintas funciones (excepto la de experto), pero el contenido generado raramente será tan bueno como el creado por un equipo como este.Por ejemplo, en este artículo, hago el papel de SEO, experto y escritor. Puedo desempeñar cómodamente los papeles de SEO y experto en este caso. De hecho, gran parte del artículo trata de mis procesos personales.Sin embargo, nunca he sido un gran escritor. Alguien a quien le guste escribir y tenga facilidad con las palabras posiblemente producirá contenido mucho más rápido que yo. Además, es posible que sus contenidos sean más fáciles de entender y más agradables de leer.InvestigaciónLos SEO disponen de las herramientas y la experiencia necesarias para investigar, orientar correctamente y crear contenidos que posiblemente se posicionen bien en las búsquedas. Sin embargo, la mayoría de los SEO probablemente no escribirán sobre SEO, por lo que no serán expertos.He conocido a muchos SEO que saben muchísimo de nichos específicos en los que se mueven sus clientes, pero no están directamente implicados en él y no son expertos de verdad.En el mejor de los casos, pueden aparentar que saben copiando lo que han dicho otros, que puede que ni siquiera sea correcto. Esto es muy común en el caso de los artículos sobre SEO, en los que la gente copia y repite lo que alguien ha dicho sin saber que la información es incorrecta. De este modo, la mala información se propaga a todavía más SEO.Un SEO puede, incluso, ser capaz de identificar algunos de los idiomas o abreviaturas que se utilizan en un nicho, o temas relacionados relevantes, y tal vez, incluso, repetir algunos puntos que han leído, pero carecen de experiencia real y conocimientos únicos.La creación de contenidos para las búsquedas requiere al menos una investigación y unos procesos básicos. Se crea mucho contenido, pero nunca se ve. Según nuestro estudio de tráfico de búsqueda, tan solo el ~4% de las páginas obtienen más de 10 visitas al mes desde la búsqueda orgánica.Conocimiento/insightsLos expertos tienen años de conocimientos y experiencia en lo que hacen, pero, la mayoría de las veces, la gente que escribe artículos para búsquedas no los tiene.Los expertos están ocupados siendo los expertos y rara vez son los que crean el contenido. Lo que realmente quieres es diferenciar tus artículos, mostrar esa experiencia y proporcionar estos conocimientos adicionales.Esto requiere un trabajo adicional. Si puedes entrevistar al experto o pedirle que revise el contenido para comprobar que es correcto y añada sus ideas adicionales, podrías diferenciarte de la mayoría.Si encuentras un unicornio, es decir, un experto que quiere escribir su propio contenido, apóyalo con la investigación y la edición necesarias para mejorarlo.EscrituraLa producción de un buen escritor es increíble. Sus artículos son claros, van al grano y es un gusto leerlos. Cualquiera puede escribir, pero escribir bien es realmente un arte y una habilidad.Cuando escribes, quieres cubrir bien un tema. Una página puede estar orientada a uno o dos términos o temas principales, pero las mejores páginas suelen recibir tráfico de cientos de palabras clave diferentes.EdiciónUn buen editor presta atención a los detalles. Hacen sugerencias y dan información a los escritores sobre cómo mejorar sus artículos y comunicar con mayor eficacia. Hacen mucho más que tan solo comprobar si hay alguna errata.Cómo medir el éxito de los contenidosExisten muchos indicadores que puedes utilizar para medir el éxito. No hay una plantilla ideal, así que mide lo que sea importante para ti.Diferentes indicadores tienen diferentes casos de uso. Los SEO pueden querer fijarse en los rankings, el tráfico o los enlaces. No obstante, en última instancia, las empresas tienen que medir aspectos como las conversiones, los clientes potenciales cualificados y los ingresos.Cuanto más te acerques al dinero a la hora de elaborar informes, más impactante será ese informe para las partes interesadas. Si el contenido no está cumpliendo con tus objetivos o expectativas, es posible que te convenga volver a revisar y auditar el contenido creado para la búsqueda periódicamente a fin de evaluar el rendimiento y averiguar si puedes mejorarlo o cómo hacerlo.Si utilizas WordPress, echa un vistazo al plugin SEO para WordPress de Ahrefs, que ayuda con las auditorías de contenido y mucho más. Si no usas WordPress o tan solo quieres una guía visual, este diagrama te explicará cómo tomo mis propias decisiones.Reflexiones finalesCrear contenidos de calidad es un trabajo duro y requiere muchos recursos. Si escatimas en algunas áreas, la competencia tendrá más posibilidades de superarte.Ser el líder no es nada fácil: eres tú quien pone el listón. Quienes vienen detrás saben qué expectativas tienen que cumplir o superar si quieren ganar. Por tanto, te recomiendo que evalúes tus contenidos más importantes de vez en cuando para asegurarte de que sigues estando donde tienes que estar.Escríbenos en Twitter si tienes alguna pregunta. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo escribir contenido de calidad para las búsquedas"
    },
    {
      "level": "H2",
      "text": "Cómo crear contenido de calidad"
    },
    {
      "level": "H3",
      "text": "¿Qué contenidos deberías crear?"
    },
    {
      "level": "H3",
      "text": "Investigación de palabras clave"
    },
    {
      "level": "H3",
      "text": "Crea un esquema o resumen de contenidos"
    },
    {
      "level": "H4",
      "text": "Escribe para los fragmentos destacados"
    },
    {
      "level": "H4",
      "text": "Enlaces internos"
    },
    {
      "level": "H3",
      "text": "Producción de contenidos"
    },
    {
      "level": "H4",
      "text": "Investigación"
    },
    {
      "level": "H4",
      "text": "Conocimiento/insights"
    },
    {
      "level": "H4",
      "text": "Escritura"
    },
    {
      "level": "H4",
      "text": "Edición"
    },
    {
      "level": "H2",
      "text": "Cómo medir el éxito de los contenidos"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Patrick Stox"
}