{
  "url": "https://ahrefs.com/blog/es/como-funcionan-motores-de-busqueda-2/",
  "slug": "como-funcionan-motores-de-busqueda-2",
  "title": "¿Qué es un motor de búsqueda y cómo funciona?",
  "description": "Un buscador funciona rastreando la web con bots (conocidos como arañas). Las arañas siguen enlaces entre páginas para descubrir nuevo contenido que añadir a su índice.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Los buscadores o motores de búsqueda funcionan rastreando miles de millones de páginas gracias al uso de rastreadores web. También conocidos como arañas o bots, los rastreadores navegan por la web y siguen enlaces para encontrar páginas nuevas. Estas páginas se añaden a un índice, que es desde donde los motores de búsqueda presentan los resultados.Entender cómo funcionan los buscadores es crucial si haces SEO. Después de todo, es difícil optimizar algo si no sabes cómo funciona.Eso es lo que aprenderás en esta guía.Contents Empieza aquí 1¿Qué son los motores de búsqueda? 2Fundamentos de SEO 3Keyword research 4Contenido SEO 5SEO On-Page 6Link Building 7SEO técnico Part 1Fundamentos de los buscadoresVamos a empezar aprendiendo qué es un buscador, por qué existen y cómo ganan dinero.¿Qué es un motor de búsqueda? Un buscador o motor de búsqueda es una base de datos de contenido web en la que se pueden realizar búsquedas. Se compone de dos partes principales: Un índice de búsqueda (index). Una biblioteca digital de información sobre páginas web.Algoritmo(s) de búsqueda. Programa(s) informático(s) que ordenan resultados del índice de búsqueda.¿Cuál es el objetivo de los motores de búsqueda?Todo motor de búsqueda tiene el objetivo de ofrecer los mejores (más relevantes) resultados para sus usuarios. En parte, es así como consiguen su cuota de mercado.¿Cómo ganan dinero los motores de búsqueda?Los motores de búsqueda tienen dos tipos de resultados de búsqueda:Resultados orgánicos del índice de búsqueda. No puedes pagar para salir ahí.Resultados pagados de los anunciantes. Puedes pagar para salir ahí.Cada vez que alguien hace clic en un resultado de búsqueda pagada, el anunciante paga al motor de búsqueda. Esto se conoce como publicidad de pago por clic (pay-per-click en inglés o PPC) y es por lo que la cuota de mercado es importante. Más usuarios implican más clics en anuncios y, por tanto, más ingresos.Part 2Cómo construyen su índice los buscadoresCada buscador tiene su propio proceso para construir un índice de búsqueda. Debajo tienes una versión simplificada del proceso de Google.[1]Vamos a verlo por partes.URLTodo comienza con una lista conocida de URLs. Google las descubre de muchas formas, pero estas tres son las más habituales: A partir de enlaces. Google tiene un índice de cientos de miles de millones de páginas web.[2] Si alguien enlaza a una nueva página desde una página conocida, Google la puede encontrar a partir de ahí.A partir de sitemaps. Los sitemaps o mapas del sitio le dicen a Google qué páginas y archivos piensas que son importantes en tu sitio.[3]A partir de envíos de URL. Google permite que los propietarios de sitios web soliciten el rastreo de URL individuales en Google Search Console.RastreoEl rastreo es cuando un bot informático llamado araña visita y descarga URL conocidas. El rastreador de Google es Googlebot.[4]Procesamiento y renderizaciónEl procesamiento es cuando Google trabaja para entender y extraer información clave de las páginas rastreadas. Para hacerlo, tiene que renderizar la página, que consiste en ejecutar el código de la misma para entender el aspecto que tiene de cara a los usuarios.Nadie fuera de Google conoce todos los detalles de este proceso. Pero no importa. Todo lo que tenemos que saber es que involucra extraer enlaces y almacenar contenido para su indexación.IndexaciónLa indexación consiste en añadir al índice de búsqueda la información que se ha procesado de las páginas rastreadas.El índice de búsqueda es donde buscas al usar un motor de búsqueda. Por eso es tan importante que te indexen los principales motores de búsqueda como Google y Bing. Los usuarios no pueden encontrarte a menos que estés en el índice.Recomendación¿Lo sabías?Google tiene el 91,43% de la cuota de mercado de motores de búsqueda. En España supera el 95%. Te puede generar más tráfico que otros motores de búsqueda, ya que es el que usa la mayoría de las personas.[5]Part 3Cómo los motores de búsqueda ordenan los resultadosDescubrir, rastrear e indexar contenido solo es la primera parte del puzle. Los motores de búsqueda también necesitan una forma de ordenar los resultados que coinciden. Este es el trabajo de los algoritmos de búsqueda.¿Qué son los algoritmos de búsqueda?Los algoritmos de búsqueda son fórmulas que ordenan y clasifican los resultados relevantes del índice. Google tiene en cuenta muchos factores en sus algoritmos.Los factores de posicionamiento en GoogleNadie conoce todos y cada uno de los factores de posicionamiento de Google porque Google no los ha revelado. Sin embargo, sí conocemos algunos de los factores clave. Vamos a verlos.Enlaces (backlinks)Los backlinks son enlaces de una página de una web a otra. Son uno de los factores de posicionamiento más fuertes de Google.[6] Probablemente sea por eso que observamos una fuerte correlación entre los dominios que enlazan a una web y el tráfico orgánico en nuestro estudio de más de 1.000 millones de páginas.[7] En cualquier caso, no todo es cantidad. La calidad también importa. Las páginas con unos pocos enlaces de alta calidad a menudo desbancan a las que tienen muchos enlaces de baja calidad.¿LO SABÍAS?Puedes revisar los enlaces dirigidos a tus webs en Ahrefs.Regístrate gratis en Ahrefs Webmaster Tools, introduce tu dominio en Site Explorer y ve al informe de Enlaces.Nuestro rastreador es el quinto más activo de internet, [8] así que tendrás una perspectiva bastante completa de tus enlaces.RelevanciaRelevancia es la utilidad de un resultado dado para la persona que usa el buscador. Google tiene muchas formas de determinar esto. En el nivel más básico, busca páginas que contengan las mismas palabras clave que la búsqueda. No obstante también revisa los datos de interacción para ver si a otros les pareció útil el resultado.[9]Novedad/ActualidadLa novedad es un factor de posicionamiento que depende de la búsqueda y es más fuerte para búsquedas que demandan resultados actuales.[9] Por eso ves una publicación reciente como resultado de “nuevas series netflix”, pero no en “cómo resolver cubo de rubik”. Velocidad de páginaLa velocidad de página es un factor de posicionamiento en escritorio y móvil. [10][11] Pero es más un factor negativo de posicionamiento que positivo. Esto quiere decir que afecta negativamente a las páginas más lentas, más que de forma positiva a las páginas más rápidas que la velocidad de la luz.RecomendaciónPuedes comprobar tu velocidad de página de forma gratuita en Ahrefs.Regístrate gratis en Ahrefs Webmaster Tools, rastrea tu sitio con Site Audit, ve al informe de Rendimiento. En general, cuanto menos color rojo veas, mejor. Adaptación a móvil - mobile firstLa adaptación a móvil ha sido un factor de posicionamiento en móvil y escritorio desde que Google pasó a la indexación mobile-first en 2019[12] (se indexa la versión móvil de las webs, en lugar de la de escritorio).Part 4Cómo personalizan los resultados los motores de búsquedaGoogle ajusta los resultados de búsqueda para cada usuario. Para ello, usa información como la ubicación, el idioma y el historial de búsqueda para hacerlo. [9] Vamos a ver más de cerca qué implican estas cosas.UbicaciónGoogle usa tu ubicación para personalizar los resultados para quienes tienen una intención local. Por eso, todos los resultados de “restaurante italiano” son de restaurantes locales. Google sabe que es improbable que vayas a recorrer medio mundo para ir a comer.IdiomaGoogle sabe que no tiene sentido mostrar resultados en inglés a los usuarios en español. Por eso presenta versiones localizadas del contenido (si existen) a las personas que hablan otros idiomas.Historial de búsquedaGoogle almacena lo que haces y los sitios a los que vas para ofrecerte una experiencia de búsqueda más personalizada. [13] Cualquiera puede abandonar estas opciones, pero la mayoría probablemente no lo hace.Conclusiones principalesUn motor de búsqueda tiene dos partes principales: índice (index) y algoritmos.Para construir su índice, rastrea páginas conocidas y sigue los enlaces para descubrir nuevas.El objetivo de los algoritmos de búsqueda es devolver los mejores resultados; es decir, los que resulten más relevantes.La calidad de los resultados de búsqueda es importante para conseguir cuota de mercado.Nadie conoce todos los factores de posicionamiento de los resultados orgánicos de Google.Algunos de los factores de posicionamiento clave son los enlaces, la relevancia y la novedad/actualidad.Google personaliza sus resultados en base a tu ubicación, idioma e historial de búsqueda.ReferenciasComprender conceptos básicos del SEO en JavaScript. Google. Consultado el 16 de agosto de 2022.Cómo la Búsqueda de Google organiza la información. Google. Consultado el 16 de agosto de 2022.Acerca de los sitemaps. Google. Consultado el 16 de agosto de 2022.Robot de Google. Google. Consultado el 16 de agosto de 2022.Cuota de mercado de buscadores a nivel mundial. Statcounter. Consultado el 16 de agosto de 2022.Google Preguntas y respuestas, Q&A+ #Marzo. YouTube. Consultado el 16 de agosto de 2022.El 90,63 % del contenido no recibe tráfico de Google. Y cómo puedes formar parte del otro 9,37 %. Ahrefs. 31 de enero de 2020. Consultado el 16 de agosto de 2022.CloudFlare Radar. CloudFlare. Consultado el 16 de agosto de 2022.Cómo se generan los resultados automáticamente. Google. Consultado el 16 de agosto de 2022.Utilización de la velocidad del sitio en la clasificación de los resultados de búsqueda. Google. Consultado el 16 de agosto de 2022.La velocidad de las páginas en el posicionamiento de las búsquedas móviles bookmark_border. Google. Consultado el 16 de agosto de 2022.Prácticas recomendadas para la indexación centrada en los móviles y los sitios web móviles. Google. Consultado el 16 de agosto de 2022.Buscar y controlar los datos de Actividad en la Web y en Aplicaciones. Google. Consultado el 16 de agosto de 2022. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Colaboradores Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Colaboradores",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es un motor de búsqueda y cómo funciona?"
    },
    {
      "level": "H2",
      "text": "Fundamentos de los buscadores"
    },
    {
      "level": "H3",
      "text": "¿Qué es un motor de búsqueda?"
    },
    {
      "level": "H3",
      "text": "¿Cuál es el objetivo de los motores de búsqueda?"
    },
    {
      "level": "H3",
      "text": "¿Cómo ganan dinero los motores de búsqueda?"
    },
    {
      "level": "H2",
      "text": "Cómo construyen su índice los buscadores"
    },
    {
      "level": "H3",
      "text": "URL"
    },
    {
      "level": "H3",
      "text": "Rastreo"
    },
    {
      "level": "H3",
      "text": "Procesamiento y renderización"
    },
    {
      "level": "H3",
      "text": "Indexación"
    },
    {
      "level": "H2",
      "text": "Cómo los motores de búsqueda ordenan los resultados"
    },
    {
      "level": "H3",
      "text": "¿Qué son los algoritmos de búsqueda?"
    },
    {
      "level": "H3",
      "text": "Los factores de posicionamiento en Google"
    },
    {
      "level": "H4",
      "text": "Enlaces (backlinks)"
    },
    {
      "level": "H3",
      "text": "Relevancia"
    },
    {
      "level": "H3",
      "text": "Novedad/Actualidad"
    },
    {
      "level": "H3",
      "text": "Velocidad de página"
    },
    {
      "level": "H3",
      "text": "Adaptación a móvil - mobile first"
    },
    {
      "level": "H2",
      "text": "Cómo personalizan los resultados los motores de búsqueda"
    },
    {
      "level": "H3",
      "text": "Ubicación"
    },
    {
      "level": "H3",
      "text": "Idioma"
    },
    {
      "level": "H3",
      "text": "Historial de búsqueda"
    },
    {
      "level": "H2",
      "text": "Conclusiones principales"
    },
    {
      "level": "H2",
      "text": "Referencias"
    }
  ],
  "author": "Joshua Hardwick  Patrick Stox  Sam Oh Joshua Hardwick Joshua Hardwick"
}