{
  "url": "https://ahrefs.com/blog/es/como-incrementar-autoridad-sitio-web/",
  "slug": "como-incrementar-autoridad-sitio-web",
  "title": "¿Cómo aumentar la Autoridad de un Sitio Web (Domain Rating)?",
  "description": "Aprende lo que es la autoridad de un sitio web, cómo se calcula el Domain Rating (DR) y cómo incrementar el puntaje de forma correcta.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Si estás buscando posicionarte más alto en Google y ganar más tráfico orgánico, puedes haber leído que aumentar la autoridad de tu sitio web es la solución. Sin embargo, la realidad es que si bien aumentar la autoridad de tu sitio web nunca es malo, incrementar el número en sí mismo no debería ser tu principal prioridad.Por el contrario, debes concentrarte en qué es lo que provoca que ese número aumente: backlinks de alta calidad desde sitios web con mucha autoridad.En esta guía, aprenderás:¿Qué es la autoridad de un sitio web? (Domain Rating) ¿Cómo se calcula el Domain Rating? ¿Cómo aumentar el Domain Rating de tu sitio web? (La forma correcta)https://www.youtube.com/watch?v=cl1Ch9ARdQs¿Qué es la autoridad del sitio web? (Domain Rating)La autoridad del sitio web es una métrica obtenida de proveedores de herramientas de SEO. Básicamente mide la fuerza relativa de los backlinks de un sitio, comparados con todos los demás sitios en su índice.Prácticamente todas las buenas herramientas de SEO tienen esta métrica, pero su nombre y forma de calcularlo varía en cada caso.En Ahrefs, nuestra métrica de autoridad de sitio web es el Domain Rating (DR).Como la mayoría de las métricas de los demás sitios, va en una escala del 0 al 100.Nota al margen. Puedes revisar la autoridad de tu dominio colocándolo en nuestro verificador de autoridad del sitio. ¡Es gratis!. Ahora bien, es esencial comprender que la escala de Domain Rating es logarítmica. Esto significa que es mucho más difícil aumentar el DR de 69 a 70, que de 9 a 10.Una buena forma de visualizar esto es pensar en los rankings de los videojuegos.Quizá comiences como “Scout”, y podrá llevarte algunas horas ganar tu placa de “Ranger”. Pero avanzar al siguiente nivel podría tomarte meses, y solo los jugadores verdaderamente dedicados alcanzarán el status de “Epic”.La escala logarítmica también implica que un sitio con un DR de 20 posee el doble de autoridad que uno con DR de 10.¿Cómo se calcula el Domain Rating?Antes de intentar aumentar la autoridad de tu sitio web, necesitas comprender cómo se calcula el Domain Rating.Exploremos entonces los 3 aspectos principales que impactan en el Domain Rating:La cantidad de sitios web enlazando hacia tu sitioEl DR de los dominios enlazantesLa cantidad de sitios a los que cada dominio de referencia enlaza1. La cantidad de sitios web enlazando hacia tu sitioEn Ahrefs, tenemos una métrica llamada dominios de referencia. Este es el número de sitios web que enlazan hacia una página o sitio web.Puedes ver esto para cualquier sitio que analices en el Site Explorer.Algunas personas creen que cuanto más alto es este número, más alto será el Domain Rating. Sin embargo, no es tan sencillo porque en nuestros cálculos de DR solo consideramos los enlaces “follow”. Los enlaces con etiqueta UGC, “sponsored” y nofollow no mejorarán el DR.Asimismo, los múltiples enlaces provenientes del mismo sitio web no mejorarán el DR del sitio, ya que tenemos en cuenta sólo los dominios de referencia y no los backlinks.2. El DR de los dominios enlazantesCualquiera puede obtener miles de enlaces provenientes de sitios de baja calidad. Por este motivo, también tenemos en cuenta el DR de los sitios enlazantes cuando calculamos el DR de cada sitio.Esto significa que los backlinks de sitios web con un DR alto tienden a incrementar el DR de tu sitio en mayor medida que aquellos sitios que tienen un DR bajo.Este es un punto interesante para conocer: significa que a medida que el DR de un dominio de referencia aumenta, también aumenta el de tu sitio.Por ejemplo, si construyes un enlace en un sitio web con DR 15, y el dueño de ese sitio trabaja duro para crear autoridad y enlaces a lo largo del tiempo, entonces quizás en un año ese mismo enlace puede provenir de un sitio con un DR 40. Así que aunque hayas construido ese único enlace, si esto sucede tu DR aumentará a lo largo del tiempo.La oportunidad aquí es que merece la pena colocar enlaces en sitios que muestren potencial, incluso cuando su DR esté bajo en ese momento.¿Cómo puedes juzgar el “potencial”?Primero, revisa su contenido, si es de alta calidad, entonces es muy probable que en un futuro atraiga enlaces de alta calidad de forma natural.Segundo, revisa su crecimiento en Site Explorer de Ahrefs. Si hay una tendencia de crecimiento lenta pero segura en el gráfico de dominios de referencia, entonces es probable que las cosas continúen en esa dirección y sus DR aumenten a lo largo del tiempo.3. La cantidad de sitios a los que cada dominio de referencia enlazaDigamos que consigues 2 enlaces “follow”: uno en The Guardian y uno en IMDB. Ambos sitios tienen DR idénticos, pero ¿cual enlace creés que aumentará más tu DR?Respuesta: depende de la cantidad de sitios a los que cada uno de ellos enlaza con al menos un enlace follow. Cuanto más enlaces únicos salientes posea un sitio, menos “DR equity” pasará.Entonces, revisemos el reporte de Dominios enlazados para cada sitio y filtremos solo los enlaces “follow”.Parece ser que The Guardian enlaza alrededor de 50 veces más de sitios que los que enlaza IMDB (272,218 vs. 5,256). Entonces, el enlace de IMDB aumentará más tu DR que el de The Guardian.Veamos cuanta diferencia puede ocasionar en el DR.Este sitio web tiene un dominio de referencia, que es IMDB. Su DR es de 34.Este sitio web también tiene un dominio de referencia, pero esta vez es The Guardian. Su DR es 1.5.Es crucial remarcar que esto no provoca que todos los enlaces de IMDB posean más autoridad que los enlaces de The Guardian. Existen muchos factores que contribuyen a un buen backlink.¿Cómo aumentar tu Domain Rating?Construye más enlaces “follow” hacia tu sitio y su Domain Rating aumentará. Es tan sencillo como eso. Solo ten en cuenta que si el sitio donde construyes el enlace tiene un bajo DR, o enlaza hacia muchos otros sitios, el aumento en el Domain Rating puede ser bajo.También es importante destacar que construir enlaces en páginas random no siempre te ayudará a aumentar tu ranking o tu tráfico orgánico. Como seguramente ese sea tu principal objetivo, debes concentrarte en construir enlaces directamente hacia las páginas que quieres posicionar en Google. Eso tendrá un mayor impacto en el tráfico orgánico y los rankings que simplemente “aumentar el DR”.Sabemos esto porque lo hemos estudiado. La cantidad de dominios de referencia que apuntan hacia una página correlaciona con el tráfico orgánico más que el DR del sitio web que posiciona.Dicho esto, construir enlaces hacia la página que quieres posicionar en Google no siempre es sencillo.Por ejemplo, sería difícil para una imprenta conseguir que las personas enlacen hacia una página que vende tarjetas de negocios, simplemente porque hay muy poco incentivo para hacerlo. Así que, si estás teniendo problemas…Aquí veremos cómo aumentar indirectamente la autoridad de tu sitio web (dominio) de una forma significativa:Crea contenido que las personas quieran enlazarContacta con sitios web relevantes y de autoridadUsa enlaces internos para mejorar la “autoridad” de páginas importantes1. Crea contenido que las personas quieran enlazarEsto implica cumplir con estos tres atributos:No comercialLas personas tienden a enlazar más hacia páginas que no tratan sólo sobre hacerte ganar dinero a ti. Por eso es tan difícil conseguir enlaces hacia páginas de ventas y revisiones de afiliados.ProvechosoExisten dos maneras de crear contenido que las personas puedan aprovechar.La primera es crear algo con utilidad. Piensa en post de blogs, calculadoras y herramientas gratis. Nuestro verificador de backlink gratis es un buen ejemplo de esto. Ha atraído backlinks de más de 1.850 dominios de referencia.La segunda es crear contenido que pueda ser citado. Piensa en estadísticas, estudios e ideas únicas a las que bloggers y periodistas podrían hacer referencia.Nuestro estudio mostrando cuánto tiempo lleva posicionar en Google es un buen ejemplo, habiendo atraído backlinks de más de 880 dominios de referencia.Tener un historial de haber conseguido enlacesInstala la barra de herramientas de SEO de Ahrefs, busca en Google la temática de tu idea, y luego observa la cantidad de dominios de referencia hacia las páginas mejor posicionadas.KW: Calculadora de interésCalculadora de interés compuesto - MoneychimpCalculadora de interés compuesto - Investor.govCalculadora de interés simple - WebmathSi tienen una cantidad decente de enlaces, entonces eso es señal de que esa es una temática digna de ser enlazada. ¿Por qué? Porque puedes observar que las páginas sobre esa temática tienen un historial de atraer enlaces.Dicho esto, asegúrate de evitar temáticas que ya hayan pasado su fecha de caducidad.Por ejemplo, observa los resultados mejor posicionados para “the dress ilussion” (La ilusión del vestido):KW: La ilusión del vestidoLa ciencia detrás de la ilusión del color del vestidoIlusión óptica: el debate del color de vestido se vuelve globalEsta es la razón por la que la gente ve “el vestido” diferenteHay, en efecto, muchos sitios enlazando hacia esas páginas, pero esto es porque ese fue un tema de moda por un corto período de tiempo en 2015, cuando una foto se volvió viral. Si estos artículos fueran publicados hoy, sería difícil conseguir enlaces que apunten hacia ellos.¿Tienes dificultades para encontrar un título ganador?Ve al Keyword Explorer, busca una keyword semilla, y luego observa el reporte de “All Keywords”. Deberías ver miles de ideas de keywords potenciales basadas en esa keyword inicial.Aquí, dentro del filtro “Incluir”, añade palabras como quién, qué, cuándo, por qué, cómo, guía, herramienta, calculadora, estadísticas y estudio. Inclúyelas como una lista separada por comas y luego haz click en “Cualquier Palabra””Esto sirve para filtrar temas de alta utilidad y potencial para ser citados.Finalmente, filtra las keywords con Dificultad de Keyword (KD) elevada, digamos más de 40, para hallar temáticas con historial de conseguir enlaces. La lógica aquí es que como el “Keyword Difficulty” está basado en la cantidad promedio de dominios enlazantes hacia los resultados mejores posicionados en el buscador, entonces las páginas que posicionen para keywords con alto KD tendrán muchos backlinks.Busca entonces una temática relevante en los resultados, y luego crea tu contenido en línea con la intención de búsqueda.2. Contacta con sitios web relevantes y de autoridadTener contenido que las personas quieran enlazar es genial, pero nadie puede enlazar hacia un contenido que no sabe que existe.Es por esto que debes contarles al respecto.Ahora bien, hay miles de formas de encontrar personas relevantes para contactar, así que acá van 3 grupos para considerar cuando comiences:Personas que aparecen en tu artículoPersonas que han escrito artículos sobre temáticas similaresPersonas que han enlazado a artículos con temáticas similaresAprende más sobre cómo encontrar y alcanzar a estas personas en nuestra guía de blogger outreach.3. Usa enlaces internos para mejorar la “autoridad” de páginas importantesSigue realizando este proceso para aumentar constantemente la autoridad de tu sitio y mejorar el SEO. Puedes usar el Método Middleman para dirigir algo de esa “autoridad” hacia las páginas que quieres posicionar.ConclusionesMejorar la autoridad de tu sitio web nunca debe ser tu objetivo principal. Por el contrario, concéntrate en construir enlaces de alta calidad desde sitios relevantes y de autoridad hacia las páginas que deseas posicionar. Como resultado de este proceso, Tu Domain Rating aumentará de forma natural.Dicho esto, los enlaces no son el único factor de posicionamiento de Google. Si tu propósito real es posicionar bien en Google, mira nuestra guía de 6 pasos.Y si aún no estás posicionando en la primera página, lee nuestra guía interactiva para posicionarte en la primera página.¿Tienes preguntas? Háblame en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "¿Cómo aumentar la Autoridad de un Sitio Web (Domain Rating)?"
    },
    {
      "level": "H2",
      "text": "¿Qué es la autoridad del sitio web? (Domain Rating)"
    },
    {
      "level": "H2",
      "text": "¿Cómo se calcula el Domain Rating?"
    },
    {
      "level": "H3",
      "text": "1. La cantidad de sitios web enlazando hacia tu sitio"
    },
    {
      "level": "H3",
      "text": "2. El DR de los dominios enlazantes"
    },
    {
      "level": "H3",
      "text": "3. La cantidad de sitios a los que cada dominio de referencia enlaza"
    },
    {
      "level": "H2",
      "text": "¿Cómo aumentar tu Domain Rating?"
    },
    {
      "level": "H3",
      "text": "1. Crea contenido que las personas quieran enlazar"
    },
    {
      "level": "H4",
      "text": "No comercial"
    },
    {
      "level": "H4",
      "text": "Provechoso"
    },
    {
      "level": "H4",
      "text": "Tener un historial de haber conseguido enlaces"
    },
    {
      "level": "H3",
      "text": "2. Contacta con sitios web relevantes y de autoridad"
    },
    {
      "level": "H3",
      "text": "3. Usa enlaces internos para mejorar la “autoridad” de páginas importantes"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}