{
  "url": "https://ahrefs.com/blog/es/como-posicionarse-mejor-google/",
  "slug": "como-posicionarse-mejor-google",
  "title": "Cómo posicionarse en Google en 10 pasos simples",
  "description": "Cientos de factores podrían mejorar tu posicionamiento en Google, pero algunos son más difíciles que otros. En esta guía te contaremos cómo puedes posicionarte mejor trabajando en tus páginas internas.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Cientos de factores podrían mejorar tu posicionamiento en Google, pero algunos son más difíciles que otros.Por lo que si quieres posicionarte en Google, tienes que ser metódico. Empieza por trabajar en las cosas fáciles que están bajo tu control y, luego, pasa a cosas más difíciles, si es necesario.Este es el proceso:Antes de empezar…El proceso de esta guía funciona mejor para páginas internas. Si quieres posicionar tu homepage, lee nuestra guía de SEO para páginas de inicio. Si tienes un negocio local y quieres posicionarte en las búsquedas locales, lee nuestra guía sobre SEO local.1. Elige una palabra claveSi ya sabes cuál es la palabra clave con la que quieres posicionarte mejor, sáltate este paso. De lo contrario, tendrás que encontrar una página que pueda posicionarse mejor con la palabra clave deseada.Aquí tienes una forma fácil de hacerlo:Pega tu dominio en el Site Explorer de AhrefsDirígete al informe de Palabras clave orgánicasFiltra los puestos del 2 al 10Ahora deberías ver todas las palabras clave con las que te posicionas en la primera página de Google, pero no en la primera posición. Solo tienes que elegir una.Un consejo: busca tus principales objetivos de palabras clave para la página correspondiente.Por ejemplo, nuestro post sobre marketing de afiliados se sitúa en la cuarta posición con la palabra clave “marketing de afiliados que es”. Pero esta no es exactamente la palabra clave objetivo de la página, por lo que es posible que no sea la mejor para intentar mejorar el posicionamiento.RECOMENDACIÓNSi no tienes ninguna posición en la primera página, intenta posicionarte mejor con palabras clave en las páginas dos o tres. Suele ser más fácil mejorar el posicionamiento de las páginas que ya funcionan bastante bien, pero, si no tienes ninguna, mejorar el posicionamiento en las páginas dos o tres es tu mejor opción.2. Encaja con la intención de búsquedaLa intención de búsqueda es el “porqué” de la consulta. Es la razón por la que el 90 % de los resultados de “freidora de aire” son publicaciones de blogs y no páginas de ventas. Google entiende que los usuarios no están listos para comprar el producto; tan solo quieren compararlo.Es necesario alinear la página con la intención de búsqueda para tener más posibilidades de posicionarse.Lo aprendimos a las malas cuando intentamos posicionarnos con “backlink checker”.Esta es la primera página que creamos:Se puede ver que explica cómo comprobar los backlinks de un sitio con Ahrefs y ofrece a los usuarios una prueba gratuita.Esta página funcionó bien y se posicionó entre los puestos 6 y 10 durante años, pero nunca estuvo entre las cinco primeras.En 2018, nos dimos cuenta de que se trataba de un problema de intención de búsqueda. Todas las páginas mejor posicionadas con “backlink checker” eran herramientas gratuitas.Para solucionarlo, añadimos una herramienta gratuita a la página. Casi de la noche a la mañana, la página se disparó al n.º 1 y ahí sigue desde entonces.Para ver hasta qué punto una página se ajusta a la intención, comprueba las tres C de las páginas mejor posicionadas:Content type (tipo de contenido): ¿se trata principalmente de artículos de blog, productos, categorías, landing pages, etc.?Content format (formato del contenido): ¿son principalmente tutoriales, artículos de listas, guías prácticas, recetas, herramientas gratuitas u otros?Content angle (enfoque del contenido): ¿existe un argumento de venta dominante, como precios bajos o lo fácil que es?Por ejemplo, todas las páginas que encabezan el ranking de “receta de tortilla de patatas” son entradas de blog con recetas y el argumento de venta predominante es “lo fáciles que son de hacer”.3. Cubre el tema en su totalidadAunque el contenido se ajuste a la intención de búsqueda, es posible que no ofrezca a los usuarios todo lo que buscan. Puede que haya subtemas que estén buscando y que esperen que los cubras.Por ejemplo, la mayoría de los resultados más buscados para “cómo escribir un comunicado de prensa” son entradas de blog sobre cómo hacerlo. Esto da una idea clara de la intención de búsqueda.Pero si te fijas en estos posts, la mayoría incluyen una plantilla o enlaces a plantillas.Es posible que Google sepa que los usuarios valoran más los posts con plantillas, por lo que, probablemente, deberías incluir una si quieres posicionarte mejor con esta palabra clave.Aquí tienes un par de formas de encontrar subtemas para incluir en tu contenido:Echa un vistazo a las páginas mejor posicionadas y busca patrones comunes. Presta especial atención a los subtítulos.Encuentra las palabras clave que usan las páginas mejor posicionadas y que tú no utilizas. Suelen corresponder a subtemas.Así es como puedes hacer el último punto en el Site Explorer de Ahrefs:Pega tu página en Site ExplorerDirígete al informe Brecha de contenidoPega algunas de las URL mejor posicionadasPor ejemplo, esto es lo que obtenemos si introducimos nuestro post sobre la estrategia go-to-market.4. Actualiza la páginaLa actualización es un factor de posicionamiento de Google que depende de la consulta. Si existe la posibilidad de que los usuarios valoren el contenido actualizado, Google posicionará mejor las páginas actualizadas.Por ejemplo, la gente valora la actualización cuando busca “lo más buscado en Google”. Quieren las búsquedas más populares de Google en la actualidad, no las de hace 10 años. Por eso el ranking y el tráfico de nuestra página caen cuando el contenido se queda obsoleto y vuelven a subir cuando actualizamos la página.Si no estás seguro de si Google valora la actualización, comprueba las fechas de las páginas mejor posicionadas.Por ejemplo, todos los resultados de “mejores auriculares” se han actualizado recientemente. Sin embargo, muchos de los resultados de “mejores parques londres” no se han actualizado desde hace meses o, incluso, años, ya que no se construyen parques nuevos a diario.Si tu palabra clave requiere que el contenido se actualice, puedes posicionarte mejor actualizando la página.5. Mejora el SEO on-pageDejar claro a Google y a los usuarios el propósito y la relevancia de tu página es el trabajo del SEO on-page. Es el ingrediente que hace destacar el trabajo realizado para que la intención coincida y el tema se trate en su totalidad.Aquí tienes algunas formas de mejorar el SEO on-page:Utiliza etiquetas H1-H6 para estructurar jerárquicamente tu contenido. Google recomienda lo siguiente: pon el título en un H1, los subtítulos en H2, los “subsubtítulos” en H3, etc.Utiliza una URL corta y descriptiva. Google dice que, si las URL son sencillas, transmiten información sobre el contenido.Escribe una title tag y una metadescripción convincentes. Esto puede ayudarte a obtener más clics y enviar señales positivas sobre tu contenido a Google.Optimiza las imágenes. Google recomienda utilizar nombres de archivo y textos alternativos breves pero descriptivos. También merece la pena comprimir las imágenes para mejorar la velocidad de la página, que es un factor de ranking.Perfecciona la redacción. Google afirma que a los usuarios les gustan los contenidos bien escritos y fáciles de seguir. Utiliza párrafos cortos, buena gramática y técnicas de redacción que mantengan el interés de los lectores.Más información: SEO on-page: Guía completa para principiantes6. Añade enlaces internosLos enlaces internos son enlaces de una página de tu web a otra. Son importantes porque son la forma en la que el PageRank se distribuye por tu web. En otras palabras, los enlaces internos aumentan la autoridad de una página web y le indican a Google que es importante.Una forma sencilla de encontrar oportunidades de enlaces internos relevantes es la siguiente:Créate una cuenta gratuita de Ahrefs Webmaster ToolsRastrea tu sitio web con Site AuditDirígete a la herramienta Oportunidades de enlaces internosEstablece la URL de destino en la página que quieres posicionar mejorEsta herramienta recopila todas las palabras clave con las que tu página objetivo se sitúa entre las 100 primeras y encuentra menciones de las mismas en tu sitio. A continuación, las sugiere como oportunidades de enlaces internos contextuales.Por ejemplo, supongamos que establecemos como página objetivo nuestra guía para crear una estrategia de marketing de contenidos. En ese caso, hay 13 oportunidades potenciales de enlaces internos.Aquí tienes una de ellas:En este caso, nos sugiere que enlacemos internamente la frase “content marketing strategy” (estrategia de marketing de contenidos) en nuestra lista de herramientas de marketing de contenidos.Enlazar internamente esta frase puede ayudar a que nuestro post se posicione mejor.Si no ves ningún resultado en este informe, es porque:Tu página de destino no está entre las 100 primeras con ninguna palabra clave.No mencionas ninguna de las palabras clave con las que está posicionada tu página.En cualquier caso, puedes encontrar oportunidades en Google buscando site:dominio.com \"[palabra clave]\".Por ejemplo, en nuestro blog abundan las menciones de “content marketing strategy”.7. Combina páginas similaresTener muchas páginas parecidas sobre el mismo tema es lo mismo que dispararse en el pie. Esto se debe a que los backlinks se reparten entre las páginas y son un factor de posicionamiento. Así que puedes terminar con muchas páginas débiles en vez de una lo suficientemente fuerte para rankear.Para resolver este problema, redirige las páginas más débiles sobre un tema a la más fuerte. Así se consolidan los backlinks y se crea una página con más capacidad de posicionamiento.Para encontrar páginas de tu web sobre la palabra clave que quieres posicionar mejor, busca en Google site:dominio.com [palabra clave].Por ejemplo, nuestro sitio tiene dos páginas muy similares sobre “meta keywords”. Tenemos un post que explica las palabras clave meta y una página de glosario que hace lo mismo.Redirigir una de ellas a la otra para consolidar backlinks puede ayudarnos a posicionarnos mejor en esta palabra clave, creando así una página más fuerte a partir de dos páginas más débiles.RECOMENDACIÓNTen en cuenta la intención de búsqueda cuando hagas esto. Si tus páginas responden a intenciones de búsqueda distintas, es posible que redirigirlas no sea la mejor idea. Esta táctica es mejor cuando las páginas son muy similares.8. Construye más backlinksLos backlinks son uno de los factores de posicionamiento más importantes de Google.Andrey Lipattsev, estratega sénior de calidad de búsqueda de Google, lo confirmó en 2016.Por desgracia, la creación de backlinks de alta calidad es una de las partes más complicadas del SEO. Esto se debe a que no es algo que puedas controlar del todo: tienes que crear algo digno de ganar backlinks y, luego, convencer a la gente para que te enlace.Por eso, es el último paso de nuestro proceso.Aquí tienes un buen punto de partida si eres nuevo en el link building:Pega una página de la competencia en Site ExplorerDirígete al informe EnlacesBusca backlinks que puedas replicarPor ejemplo, digamos que queremos construir enlaces a nuestra guía de SEO para principiantes. Si buscamos en Google páginas competidoras con la Barra de herramientas SEO de Ahrefs instalada, encontraremos que una de ellas tiene enlaces de 57 dominios de referencia.Según Site Explorer de Ahrefs, esta es una de las páginas de las que obtuvo un backlink:Si nos ponemos en contacto con el autor y le presentamos nuestra guía para principiantes sobre SEO, existe la posibilidad de que la añada a su página.Lecturas complementariasLink Building para SEO: Guía para principiantesCómo conseguir backlinks: 15 tácticas probadas9 estrategias sencillas de link building9. Haz un seguimiento de los rankingsEl seguimiento de rankings es la única manera de saber si tus esfuerzos por posicionarte mejor en Google están funcionando.Aunque puedes hacerlo de forma gratuita buscando directamente en Google, no suele ser fiable. Esto se debe a que factores como la ubicación y el historial de búsqueda pueden afectar a la posición que ocupa una página en el ranking. Utilizar una herramienta de seguimiento de rankings como Rank Tracker de Ahrefs es mucho más preciso.Puedes rastrear 10 000 palabras clave en esta herramienta, pero normalmente solo necesitas rastrear la palabra clave principal para cada página.Haz clic en el icono de gráfico situado junto a cualquier palabra clave en Rank Tracker para ver el progreso de su posición a lo largo del tiempo.10. Repite el procesoEstar en los primeros puestos de Google con una palabra clave está muy bien, pero estar en los primeros puestos con muchas palabras clave es aún mejor. Así que una vez que hayas seguido este proceso para una palabra clave, repítelo para más.Antes de que te des cuenta, estarás mejor posicionado con cientos de palabras clave y conseguirás toneladas de tráfico orgánico.Reflexiones finalesPuedes hacer muchas cosas para posicionarte mejor en Google, pero lo mejor es empezar con lo más fácil y, si no consigues resultados, invierte en cosas como el link building.¿Dudas? ¿Preguntas? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo posicionarse en Google en 10 pasos simples"
    },
    {
      "level": "H2",
      "text": "1. Elige una palabra clave"
    },
    {
      "level": "H2",
      "text": "2. Encaja con la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "3. Cubre el tema en su totalidad"
    },
    {
      "level": "H2",
      "text": "4. Actualiza la página"
    },
    {
      "level": "H2",
      "text": "5. Mejora el SEO on-page"
    },
    {
      "level": "H2",
      "text": "6. Añade enlaces internos"
    },
    {
      "level": "H2",
      "text": "7. Combina páginas similares"
    },
    {
      "level": "H2",
      "text": "8. Construye más backlinks"
    },
    {
      "level": "H2",
      "text": "9. Haz un seguimiento de los rankings"
    },
    {
      "level": "H2",
      "text": "10. Repite el proceso"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}