{
  "url": "https://ahrefs.com/blog/es/como-crear-una-pagina-wikipedia/",
  "slug": "como-crear-una-pagina-wikipedia",
  "title": "¿Cómo crear una página de Wikipedia? (Paso a paso)",
  "description": "Aprende cómo crear una página de Wikipedia de principio a fin y cómo obtener las mejores chances de que sea aprobada.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Tener una página de Wikipedia sobre ti o tu empresa es un hecho que mejora el valor de tu marca. Y ni siquiera necesitas visitar Wikipedia para comprobarlo.Busca en Google cualquier marca notable, y lo más probable es que veas algo como esto:Tesla, Inc.Fabricante de vehículosLa mayor parte de la información que se muestra proviene de Wikipedia y Wikidata.Sin embargo, conseguir una página de Wikipedia es complicado. Y lo digo suavemente.Pasé horas investigando las pautas oficiales, intenté aplicar ingeniería inversa al proceso desde el punto de vista de los revisores y obtuve la aprobación de nuestra página de marca sin hacer nada sospechoso:Su solicitud para la Creación de artículos: Ahrefs ha sido aprobada.Y a pesar de intentar mejorar la página gradualmente, fue marcada y eliminada dos semanas después.Wikipedia: Artículos para eliminar / AhrefsEl resultado fue eliminado.¿El problema? Fuentes supuestamente malas y un prejuicio contra de la industria del SEO.A pesar de no lograr que la página fuera aprobada y resistiera los procesos de revisión, aprendí mucho sobre Wikipedia y la creación de una página de marca.En esta guía, aprenderás a crear una página de Wikipedia de principio a fin, y a tener la mejor oportunidad de obtener su aprobación a largo plazo:Comprueba tu notoriedadEncuentra fuentes para establecer la notoriedadCrea una página de usuarioConstruye tu reputaciónCrea un esquemaRedacta tu páginaDale formato, cita y categorizaPreparación para la solicitud de revisiónAjustes y cooperaciónControla tus entradasVamos a empezar con el factor decisivo.1. Comprueba tu notoriedadLa razón más común por la que las páginas de Wikipedia fallan en el proceso de revisión es la falta de notoriedad.Y aquí está la dura realidad: Tu marca es menos notable de lo que crees.No tenía ninguna duda sobre la notoriedad de Ahrefs. Tenemos el conjunto de herramientas de SEO más popular y casi todos en la industria nos han mencionado en algún momento:What’s your primary, paid SEO tool of choice these days? (if you use multiple, tick the one you use most)— Rand Fishkin (@randfish) December 17, 2019Además de eso, nuestros dos mayores “competidores” ya tienen páginas de Wikipedia. Así que debería ser bastante fácil conseguirlo para nosotros también, ¿verdad?Bueno, aquí está el resultado de la solicitud de mi primer artículo:Solicitud rechazada el 18 de mayo de 2020 por Sulfurboy (conversación).Así que, incluso para nosotros, fue necesario un gran esfuerzo para reunir suficientes buenas fuentes para tener la oportunidad de cumplir los criterios de notoriedad.Y ya conoces nuestros resultados. Algunos editores pensaron que era lo suficientemente bueno, y algunos descartaron la mayoría de las fuentes por no ser fiables debido a la afiliación con la industria del marketing y el SEO.Entonces, ¿cómo sabes qué usar como fuentes?¿Qué significa la notoriedad para Wikipedia?Los criterios de notoriedad que se aplican a las empresas establecen que:Por lo general, una organización se considera notable si ha sido objeto de una cobertura significativa en fuentes secundarias fiables e independientes. La cobertura trivial o eventual de un tema por parte de fuentes secundarias no es suficiente para establecer la notoriedad. Todo el contenido debe ser verificable. Si no se pueden encontrar fuentes independientes, de terceros y confiables sobre un tema, entonces Wikipedia no debe tener un artículo sobre eso.Hay bastantes términos que necesitan ser explicados más a fondo. Eso es porque incluso algunas fuentes bien establecidas no siempre cumplen los criterios.Por ejemplo, estoy seguro de que has visto muchas marcas con secciones como esta en su página de inicio, mostrando los logotipos de sitios web conocidos como Forbes y Entrepreneur:Siento decepcionarte, pero esto no establece automáticamente la notoriedad en Wikipedia. Muchas páginas de sitios web como estos son generadas y patrocinadas por usuarios. Eso los descalifica para ser fuentes legítimas de WikipediaPermítanme ampliar los criterios de la fuente para que quede claro el motivo:Confiable - debe estar escrito por una fuente que tenga credibilidad establecida. Esto incluye la mayoría de las fuentes periodísticas y académicas, libros de editoriales de renombre y la mayoría de los blogs y plataformas líderes en la industria con procesos editoriales adecuados.Independiente - la fuente debe ser imparcial. Solo señalar lo que sus clientes consideran relacionado con su negocio. Eso hace que muchas reseñas y guías prácticas no cumplan con este criterio de independencia.Secundaria - la fuente tiene que incluir el propio pensamiento, evaluación, análisis, interpretación o síntesis del autor. Por ejemplo, la investigación original y los archivos de la SEC son fuentes primarias.Como casi cualquiera puede publicar en Forbes o Entrepreneur, a menudo no se cumplen los criterios de fiabilidad e independencia, a menos que sus equipos editoriales creen el contenido.Luego está el criterio de mención no trivial.Tenemos enlaces de fuentes prestigiosas, pero la mayoría de ellos son menciones pasajeras como esta:El consenso de Wikipedia sobre cuál es una mención no trivial parece ser el de aquella que cuenta con al menos dos párrafos dedicados al tema de su página. Cuanto más completo y dedicado un artículo, es mejor. Un ejemplo en nuestro caso es este:El ucraniano Dmitry Gerasimenko creó el servicio Ahrefs: ahora gana millones y compite con Google. Fuente.¿Cómo estimar rápidamente la notoriedad?Asegúrate de cumplir principalmente estos primeros dos pasos, idealmente los tres:Tu compañía no es “común y corriente”Tienes una cobertura significativa en fuentes confiables e independientesLa entidad tiene ‘enlaces rojos’ dispersos por Wikipedia1. Tu compañía no es “común y corriente”Esta es la única condición de notoriedad que no tiene nada que ver con las fuentes. Algo común y corriente puede definirse como que no se destaca del resto. Este ensayo de Wiki da principalmente ejemplos de negocios locales, pero aparentemente puede extenderse bastante..Sólo revisa este comentario en nuestra discusión de la página de eliminación:Eliminar - Compañía de SEO común y corriente. El SEO es, por su naturaleza, un negocio que puede corromper y corromperse, especialmente cuando se combina con la edición paga. SEO y la edición paga son dos especies de la misma familia de plagas, la corrupción de Internet. [Se omite el resto del comentario]. Robert McClenon (habla) 00:34, 26 de julio de 2020 (UTC) ¿Que podemos deducir de esto? Tener el mayor rastreador comercial y desarrollar un motor de búsqueda no es suficiente para destacar para algunos editores. No esperaría este tipo de prejuicio en otras industrias, pero asegúrate de que tu empresa se destaque en lo suyo.2. Tienes una cobertura significativa en fuentes confiables e independientesEs imposible que no sepas de las menciones de marca en los sitios de noticias más prominentes como The New York Times, The Wall Street Journal, The Guardian, o Financial Times.Si hay al menos un artículo en ese tipo de sitios que menciona su marca en detalle, lo más probable es que puedas celebrarlo. Probablemente no será difícil encontrar otras fuentes legítimas para citar en tu página.3. La entidad tiene “enlaces rojos” dispersos por WikipediaEs otro indicador de tener una marca notable en la propia Wikipedia. Estas menciones suelen estar marcadas en rojo, lo que significa que aún no hay una página para la marca.Puedes ver un enlace rojo de Ahrefs en una página francesa sobre backlinks:Haciendo clic en él, nos dirige a la página de creación de un artículo. Esto se debe a que Wikipedia anima a los colaboradores a crear páginas sobre “enlaces rojos”. ¿Por qué? Para que Wikipedia sea la mejor enciclopedia posible, necesita información sobre todas las cosas que se mencionan en ella.Si te preguntas cómo encontrar estos enlaces rojos, búscalos en Google. Sólo tienes que combinar el operador de búsqueda site:wikipedia.org con tu marca entre comillas. Google recuperará todas las páginas de Wikipedia que contengan la mención de tu marca.Naturalmente, también recupera las citas de tus artículos, así que tendrás que descartarlas. Desafortunadamente para nosotros, resultó que aunque teníamos bastantes enlaces rojos, ninguno de ellos estaba en la Wiki en Inglés.Aunque el enlace rojo del artículo francés podría habernos ayudado a establecer la notoriedad en la Wiki francesa, no tiene mucho o ningún efecto en la versión en inglés. Eso es porque los wikis en diferentes idiomas son entidades propias (hablaremos sobre eso más adelante).2. Encuentra fuentes para establecer la notoriedadLa mayoría de las veces, al comenzar no tendrás la suerte de tener una fuente demasiado importante o enlaces rojos.Si ese es el caso, como lo fue para nosotros, sigue estos consejos en orden. Es el método más eficiente, y puedes perder mucho tiempo buscando fuentes que tal vez ni siquiera existan.Comprueba que tus dominios de referencia no tengan una cobertura insignificanteProfundiza en libros y revistasRevisa las menciones de marca en la búsqueda de cobertura no vinculadaA. Comprueba que tus dominios de referencia no tengan una cobertura insignificanteBuscar en el perfil de backlinks de su sitio web es la forma más eficiente de encontrar fuentes adecuadas. Para ello, pega tu sitio web en el Site Explorer de Ahrefs, y luego ve al informe de Dominios de Referencia. Esto muestra todos los sitios que te vinculan ordenados por popularidad.Observa la lista de sitios web de noticias populares, revistas y las mejores fuentes de la industria. Cuando te encuentres con uno, haz clic sobre “Enlaces al objetivo” para ver los enlaces individuales, y luego comprueba su contexto.La fuente anterior parece prometedora porque proporciona información sobre nuestra empresa. Y hay una posibilidad de que haya al menos dos párrafos sobre nuestra marca y productos. Podemos confirmar si ese es el caso revisando la página manualmente.Nota al margen. Si tienes dudas sobre si una fuente determinada es apropiada, intenta revisar el consenso de Wiki sobre las fuentes populares. En el caso de las menciones y referencias, por lo general se pueden detectar de inmediato.Si no puedes encontrar al menos una buena fuente en tu perfil de backlinks, entonces probablemente no cumples con las pautas de notoriedad y no deberías continuar. En su lugar, lea esta sección sobre qué hacer en esta situación.B. Profundiza en libros y revistasSi existe la posibilidad de que tu empresa haya sido mencionada en libros o revistas, éstas también pueden ser fuentes notables.Como hay innumerables libros sobre marketing y SEO, y nuestro software es popular entre los profesionales de la industria, este fue el caso para nosotros. Desafortunadamente, como no poseemos muchos de estos libros, no pudimos buscar menciones de primera mano. En su lugar, utilizamos la Búsqueda de libros de Google.Si estás siguiendo los pasos, sólo tienes que ir a la Búsqueda de libros de Google y buscar su marca. Debería devolver cualquier libro con menciones y mostrar su contexto en el recorte.No es mucho, pero puedes construir tus referencias y el texto de la página Wiki a su alrededor.Nota al margen. Conocía algunos libros que presentaban nuestra marca pero no estaban disponibles en la Búsqueda de libros de Google. Si ese es tu caso, consigue el libro o prueba suerte con muestras de libros de Amazon.Para las revistas, recomiendo usar los directorios de revistas más populares y confiables. Usé JSTOR durante mis años de universidad, y es recomendado por Wikipedia también.Para ser honesto, no encontré nada útil para Ahrefs en JSTOR. Tuve más suerte con otras revistas, pero después de hojear las contribuciones, no eran buenas fuentes de marketing y SEO. Estudié marketing como parte de mi especialidad, y es una triste verdad que muchas piezas de marketing académico están lejos de la realidad. Ten en cuenta esto para tu industria.Además, algunas fuentes son también las llamadas revistas depredadoras que no cumplen los criterios de fiabilidad e independencia.Mi opinión es que es mejor que te quedes con JSTOR y no pierdas el tiempo buscando en otra parte.C. Revisa las menciones de marca en búsqueda de cobertura no vinculadaRecomendaría hacer esto solo si sientes que te falta una gran fuente más, ya que implica buscar en la web menciones de marcas no vinculadas.Puedes hacerlo con los operadores de búsqueda de Google. Sólo tienes que conectar diferentes noticias, revistas y blogs de la industria con tu marca:Sin embargo, esto es bastante tedioso y consume mucho tiempo, así que vamos a racionalizar este proceso con la ayuda del Content Explorer de Ahrefs.El Content Explorer es una base de datos con capacidad de búsqueda de más de tres mil millones de páginas, en la que se pueden utilizar operadores de búsqueda similares para filtrar los resultados.En nuestro caso, quiero ver todas las menciones de “Ahrefs” excepto las de nuestra página web.Utiliza el operador -site: para excluir los resultados de tu sitio web.Esto devuelve más de 250.000 resultados:Desafortunadamente, no hay forma de filtrar los sitios web que son buenas fuentes para Wikipedia, pero podemos reducir los resultados con filtros para obtener una muestra más pequeña con la que trabajar.Primero, seleccionemos las páginas que están activas y en inglés, ya que son los únicos tipos de páginas que podemos enlazar desde Wikipedia.En segundo lugar, filtremos los sitios web “autorizados”. Para ello, podemos usar la clasificación de dominio (DR), que refleja la fuerza del perfil de enlaces de un sitio web. Las fuentes adecuadas para Wiki tienden a tener un DR bastante alto, así que estableceré este filtro en DR 70+.Por último, cambiemos el botón de “una página por dominio” y usemos la función “resaltar los dominios no enlazados” para resaltar los resultados que no nos enlazan.Recuerda, ya hemos revisado los dominios de referencia, por lo que ahora solo estamos interesados en los sitios que no enlazan con nosotros ahora. Para exportarlos, sólo tenemos que presionar “Exportar”, marcar “Sólo páginas con dominios resaltados” y obtener los datos:Así es como se ve en Google Sheets ordenado por DR:Acabamos de filtrar más de 250 mil páginas a sólo 174 dominios. Ahora puedes hojear fácilmente las columnas de Título del contenido y URL manualmente en busca de fuentes de Wikipedia potencialmente adecuadas.¿Qué hacer si no cumples los criterios de notoriedad de Wikipedia en Inglés?En primer lugar, existe una alta probabilidad de que no cumplas con los criterios. Si lo intentaste y tu envío fue rechazado, no presiones a menos que puedas mejorar la página y sus fuentes. El número de envíos rechazados está registrado, así que puede que te arrepientas una vez que te conviertas en una entidad notable.No estoy aquí para decirte cómo vencer al sistema. Pasé mucho tiempo leyendo las directrices de la Wiki para asegurarme de que todo lo que hacía era totalmente legal.Así que no te rindas con la notoriedad de tu sitio. Aquí hay dos maneras de mejorarla:1. Intensifica tus relaciones públicasAparecer en las principales publicaciones es una de las tareas de marketing más desafiantes para las empresas. Tus opciones y oportunidades dependen en gran medida de tu industria. Normalmente es una combinación de lo siguiente:Producto excepcionalSer disruptivo en la industriaFidelización del capital humano y actividades CSRCrear contenido que vale la pena enlazarEmpleados conocidos y embajadores de marcaSupervisión activa y búsqueda de oportunidades de prensaTambién vale la pena señalar que no toda la cobertura de los medios de comunicación se hace de la misma forma.Digamos que has creado una gran infografía con datos que atraen a los periodistas. Puede que consigas referencias de fuentes deseables, pero lo más probable es que sean inútiles para crear tu página Wiki. Eso es porque el foco del artículo estará en tu contenido, no en la compañía en sí misma.Recomendaría consultar con profesionales de relaciones públicas si quieres mejorar tus relaciones y no sabes por dónde empezar. Este es un juego a largo plazo que está entrelazado con la estrategia de marca y la gestión.2. Prueba Wikipedia en otros idiomas¿Tu negocio tiene raíces en un país que no es de habla inglesa? Probablemente será más cubierto por los medios locales que por los internacionales.Los principios de la notoriedad siguen siendo los mismos en toda la Wikipedia, pero los criterios dependen de la localidad. Si eres una startup con base en la Bay Area, tendrás mucho más trabajo para ser notable que una startup en República Checa, el país del que provengo.Y tiene sentido. La cantidad de fuentes confiables e independientes es proporcional al número de hablantes de ese idioma. Una cobertura sólida en dos buenas fuentes sería casi seguro suficiente para un negocio con base en República Checa, mientras que probablemente no lo sea para uno con base en los Estados Unidos.Eso resume la parte más complicada de crear tu página Wiki. De aquí en adelante se vuelve más sencillo.3. Crea una página de usuarioWikipedia es un proyecto de colaboración abierta dirigido por su comunidad de colaboradores, editores y administradores. La única manera de convertirse en un miembro de confianza de la comunidad es tener una cuenta asociada con ediciones y contribuciones valiosas.En resumen, registrarse y crear una página de usuario Wiki es necesario para ser tenido en cuenta. También es necesario comunicarse con otros miembros y revelar tu conflicto de intereses (COI - por sus siglas en inglés).Lo has leído correctamente. La creación o edición de contenidos para tu propio interés se desaconseja por razones obvias. Y aunque no está prohibido enviar un borrador de la página de tu empresa, debes hacer saber a los editores que tienes un COI.Y uno de los lugares para hacer esto es justo en tu página de usuario:El usuario, de acuerdo con los Términos de uso de la Fundación Wikimedia, revela que ha sido pagado por “Ahrefs” por sus contribuciones a Wikipedia.Solo usa una de las plantillas donde introduces el nombre de tu empleador.4. Construye tu reputaciónPor favor, considera hacer un esfuerzo para mejorar Wikipedia independientemente de tu página. Es lo correcto, y también aumentará la reputación de tu cuenta y tus posibilidades de conseguir que se aprueben las ediciones de COI.Como puedes ver en mi página de usuario arriba, he listado temas que me gustan editar. Quiero animarte a que hagas lo mismo y contribuyas a algunos artículos antes de enviar tu página para una revisión.Cuanto menos relacionadas sean tus contribuciones con la edición de tu COI, mejor. Esto muestra a otros miembros que tomas en serio a Wikipedia y no la consideras como una cuenta de un solo propósito.Construir tu reputación de esta manera tiene otro gran beneficio. También aprenderás a navegar por el CMS de Wikipedia, así que cuando crees tu página, ya estarás listo.5. Crea un esquemaOlvida el proceso habitual de creación de esquemas. Necesitas concentrarte en el contenido de tu página de Wikipedia alrededor de tus fuentes de citas. Eso significa no incluir nada que no puedas citar más tarde.Recuerda que el contenido basado en tres fuentes completas suele ser mejor que el contenido con 20 fuentes de baja calidad. Eso ayuda a garantizar que las mejores fuentes no sean pasadas por alto por los editores.También recomiendo que te inspires para la estructura en otras compañías relacionadas a tu sitio que ya tienen una página bien establecida.6. Redacta tu páginaPiensa en todas las páginas de Wikipedia que has leído hasta ahora. No son los típicos artículos o entradas de blog.Hay cinco conceptos que debes tener en cuenta al redactar tu página:Simplicidad - usa frases simples y evita cualquier lenguaje innecesario.Tono neutro - transmita información, no emociones.Objetividad - sé imparcial y no utilices palabras típicas de marketing.Verificación - respalda la información citando sus fuentes.Originalidad - no copies el texto de sus fuentes, tienes que interpretarlo.No te lo tomes a la ligera. La redacción es probablemente la segunda razón más común de rechazo después de la falta de notoriedad:Esta solicitud parece más un anuncio que una entrada en una enciclopedia. Los artículos de enciclopedia deben escribirse desde un punto de vista neutral y deben referirse a una serie de fuentes publicadas independientes y confiables, y no sólo a materiales producidos por el creador del tema en cuestión. Esto es importante para que el artículo pueda cumplir con la política de verificación de Wikipedia y se pueda establecer la notoriedad del tema. Si aún cree que este tema es digno de ser incluido en Wikipedia, por favor reescriba su envío para cumplir con estas políticas.El mejor plan de ataque es enviar tus fuentes a un amigo imparcial, dejar que lo escriban y lo publiquen. Si eso no es una opción, controla tus impulsos y escribe la mejor página para los lectores, no para tu empresa.Yo era muy consciente de esto al redactar la página de Ahrefs, sin embargo, algunos editores señalaron algunas secciones que no eran neutrales desde su punto de vista.Nota al margen. Puedes hacer el borrador de la publicación en el CMS de Wiki de inmediato, no hay necesidad de hacer esto en otro lugar. Sólo tienes que ir a tu Sandbox, que más tarde utilizarás para copiar y pegar el texto y enviarlo para su revisión.7. Dale formato, cita y categorizaSi has hecho los deberes y te has ganado una reputación, ya deberías estar bastante familiarizado con el funcionamiento del CMS de Wikipedia. Sólo voy a destacar algunas cosas aquí.Primero está la plantilla de cuadro de información adecuada para perfiles de empresa:Encontraras esto en Insertar -> Plantilla -> Cuadro de información de empresa:Luego viene la citación, que es muy fácil de realizar. Wiki genera citas basadas en una URL o en el ISBN de un libro.El sistema no es perfecto, sin embargo. He encontrado algunas inexactitudes en la información de las citas. Asegúrate de revisar lo que genera Wiki y corrígelo cuando sea necesario.Y por último, es bueno incluir categorías para conectar mejor tu página con el resto de Wikipedia.Si bien puede hacerse en la etapa de redacción, los enlaces de la categoría deben ser desactivados hasta que la página sea aprobada. Es más fácil añadir la categorización después de eso.Primero tienes que activar la opción en Preferencias -> Gadgets -> Edición -> HotCat:Entonces sólo usa la plantilla de categorización al final de tu mensaje haciendo clic aquí:Una vez más, puedes inspirarte mirando las categorías de negocios relacionados. Esto es lo que necesitaba:8. Preparación para la solicitud de revisiónLo último que te recomendaría que hagas antes de someter el artículo a revisión es revisar las discusiones actuales sobre los Artículos para Eliminar (AfD - por sus siglas en inglés).Revisa algunas de esas páginas propuestas para AfD, los argumentos de los editores de Wiki, y aprende de eso. Las discusiones sobre fuentes específicas y por qué no pueden ser usadas para establecer la notoriedad son especialmente útiles.Cuando termines de perfeccionar el artículo, estarás listo para pasar por el proceso de Artículo para la Creación (AfC - por sus siglas en inglés)El proceso de AfC te dice todo lo que necesitas saber y hacer, incluyendo la divulgación de tu COI antes de empezar. Fui por la opción “Me pagan para editar” como empleado de Ahrefs:También se recomienda divulgar la publicación después de terminar la página a partir de los comentarios…… y páginas de discusión:Borrador: Ahrefs.Redacté este artículo bajo COI como se indica en mi página de usuario. Además de la cobertura de los medios, hay enlaces rojos en páginas Wiki multilingües, como la página de backlinks en francés o la página de marketing de motores de búsqueda en chino.El recuadro que ves arriba en esta página podría hacer que el proceso de revisión sea más rápido. Eso es porque categoriza y resalta el borrador para los editores más adecuados.Puedes revisar el directorio de Proyectos de Wiki y añadirlo al final de tu entrada en la página de conversaciones. En mi caso, era {{WikiProject Marketing & Advertising}} (Wiki Proyecto de Marketing & Publicidad).9. Ajustes y cooperaciónLa revisión podría llevar entre unas horas y unas semanas. Mi primera solicitud fue rechazada en un día o dos:Entonces, ¿qué salió mal?Probablemente cometí el error de incluir demasiadas fuentes donde las menciones a Ahrefs eran bastante triviales. Aunque todavía es válido usarlas como referencias, no cuentan para su notoriedad.Como mencioné anteriormente, no esperes a que los revisores hagan clic en todas tus referencias. En mi caso, combiné grandes fuentes con otras menos significativas.De todos modos incluye algunas fuentes que no se consideran significativas. El propósito es respaldar la información que hace que la página fluya bien y resaltar algunos hechos interesantes.La segunda solicitud tomó mucho más tiempo. Recibí una notificación de un editor con una pregunta adicional sobre el COI…comentario: Parece bastante notable, pero ¿hay un conflicto de intereses en juego? - Sagotreespirit (habla) 17:48, 22 de mayo de 2020 (UTC)Comentario: Gracias por comprobarlo. Sí, hay un COI y lo informé según WP:PCD durante la presentación de AfC. - Mpecan (habla) 06:01, 25 de mayo de 2020 (UTC)… pero no continuaron la conversación.Unas semanas más tarde, alguien más comentó sobre nuestras fuentes y algunas partes que pueden no haber sido neutrales. Les agradecí, arreglé los problemas y finalmente conseguí que la página fuera aprobada después de dos meses de la presentación inicial.No importa lo buena que sea tu presentación, siempre habrá espacio para mejorar. Prepárate para comprometerte con los editores en las páginas de conversación y en los comentarios. Aunque los criterios de aceptación de las presentaciones son subjetivos hasta cierto punto, no intentes discutir.Sí, algunos de tus competidores pueden haber aprobado páginas Wiki que son peores en todos los aspectos, pero eso no es un argumento válido para conseguir que tu página sea aprobada.Alguien comentó a nuestro favor en la discusión de la página de borrado, y uno de los argumentos fue con respecto a otras compañías de software de SEO con páginas Wiki aprobadas:Bueno, eso se fue de las manos. La discusión en nuestra página provocó discusiones de AfD para todas las empresas de software de SEO con una página Wiki. Algunas industrias simplemente lo tienen más difícil en Wikipedia.10. Controla tus entradasTu trabajo no está terminado, incluso si tu página se aprueba y es mantenida. Algunas páginas son más susceptibles a los ataques y a la mala edición que otras. Este es el precio que tenemos que pagar por tener proyectos de colaboración abierta.Asegúrate de supervisar tu página para que te notifiquen si alguien hace una edición. Sólo marca la casilla cuando envíes un artículo o publiques cambios:Dicho esto, ten en cuenta que solo debes revertir o editar los cambios que no son verificables. Si alguien añade algo malo sobre tu empresa que esté respaldado por fuentes válidas, déjalo ahí. Esa es la parte de mantener las páginas neutrales y objetivas.Les deseo buenos editores.ConclusionesTenía tres objetivos con esta guía:Ayudarte a entender si tu marca es lo suficientemente popular para una página de Wikipedia.Ayudarte a superar el proceso de publicación de Wikipedia de la manera más eficiente.Convencerte de que contribuyas a Wikipedia regularmente.Por supuesto, el mejor escenario sería tener una marca tan popular e interesante que los colaboradores independientes crearían la página para ti. Esto probablemente sucederá una vez que alcances un cierto nivel de notoriedad.Es posible que también te estés preguntando acerca de los servicios pagos que aseguran poder crearte tu página de Wikipedia. Para mí, la mera existencia de éstos es sospechosa, así que ni siquiera los he revisado. Tuve una persona que me contactó en los medios sociales, diciendo que era un editor que aceptaría mi propuesta. Ignoré eso, y tú también deberías ignorarlo.Como ya sabes, una presentación aprobada puede ser fácilmente eliminada de todos modos y una aprobación incompleta solo daría a los revisores más argumentos. Todo lo que necesitas saber sobre la evaluación de tu notoriedad está arriba.¿Olvidé mencionar algo? ¿Tienes alguna pregunta o quieres comentar sobre tu propia experiencia con respecto a las páginas de marca de Wikipedia? Háblame en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Cómo crear una página de Wikipedia? (Paso a paso)"
    },
    {
      "level": "H2",
      "text": "1. Comprueba tu notoriedad"
    },
    {
      "level": "H3",
      "text": "¿Qué significa la notoriedad para Wikipedia?"
    },
    {
      "level": "H3",
      "text": "¿Cómo estimar rápidamente la notoriedad?"
    },
    {
      "level": "H4",
      "text": "1. Tu compañía no es “común y corriente”"
    },
    {
      "level": "H4",
      "text": "2. Tienes una cobertura significativa en fuentes confiables e independientes"
    },
    {
      "level": "H4",
      "text": "3. La entidad tiene “enlaces rojos” dispersos por Wikipedia"
    },
    {
      "level": "H2",
      "text": "2. Encuentra fuentes para establecer la notoriedad"
    },
    {
      "level": "H3",
      "text": "A. Comprueba que tus dominios de referencia no tengan una cobertura insignificante"
    },
    {
      "level": "H3",
      "text": "B. Profundiza en libros y revistas"
    },
    {
      "level": "H3",
      "text": "C. Revisa las menciones de marca en búsqueda de cobertura no vinculada"
    },
    {
      "level": "H3",
      "text": "¿Qué hacer si no cumples los criterios de notoriedad de Wikipedia en Inglés?"
    },
    {
      "level": "H4",
      "text": "1. Intensifica tus relaciones públicas"
    },
    {
      "level": "H4",
      "text": "2. Prueba Wikipedia en otros idiomas"
    },
    {
      "level": "H2",
      "text": "3. Crea una página de usuario"
    },
    {
      "level": "H2",
      "text": "4. Construye tu reputación"
    },
    {
      "level": "H2",
      "text": "5. Crea un esquema"
    },
    {
      "level": "H2",
      "text": "6. Redacta tu página"
    },
    {
      "level": "H2",
      "text": "7. Dale formato, cita y categoriza"
    },
    {
      "level": "H2",
      "text": "8. Preparación para la solicitud de revisión"
    },
    {
      "level": "H2",
      "text": "9. Ajustes y cooperación"
    },
    {
      "level": "H2",
      "text": "10. Controla tus entradas"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Michal Pecánek"
}