{
  "url": "https://ahrefs.com/blog/es/como-escribir-un-titulo/",
  "slug": "como-escribir-un-titulo",
  "title": "Cómo escribir un título irresistible en 3 pasos fáciles",
  "description": "Un buen titular atrapará la atención del lector, hará que le den al clic a la vez que describe de forma precisa el contenido. Aprende cómo escribir un título irresistible aquí.",
  "content": "Brett G. Friedman Creativo orientado a datos, amante del té, nerd de las palabras y propietario de BrettGFriedman.com, la dirección en Internet que llamo casa. Contenido Incluso aunque hayas escrito el mejor post del mundo, nadie lo va a leer si no tiene un título ganador.¿Por qué?Porque tienes que ganar el clic. Y ese es el trabajo del titular.En este post aprenderás a escribir un título irresistible que atraiga clics sin ser clickbait.Pero antes…¿Qué es un título?¿Por qué son los títulos importantes?Cómo escribir un título en 3 pasos4 consejos para escribir titulares¿Qué es un título?Un título es un titular, un nombre.Un buen titular hace tres cosas:Atrapa la atención del lectorIncita la curiosidad del lector para que haga clicDescribe de forma precisa el contenidoSi puedes hacer tres cosas en una sola frase, conseguirás todos los lectores que quieras.¿Por qué son los títulos importantes?Un buen titular lleva a la gente a tu artículo. De hecho, tu título será, en la mayor parte de casos, el único factor que tenga en cuenta la gente para decidir si tu artículo merece ser leído.Y los titulares compiten por la atención de formas diferentes dependiendo de la plataforma donde aparecen.En redes socialesTu artículo está atrapado en un scroll infinito de noticias alarmantes, publicaciones de las personas favoritas de tu audiencia y anuncios creados para llevar a sus cerebros de la navegación a la compra. Recuerda que la gente tiene un período de atención cada vez más limitado. Tu título necesita competir y ganar frente a todos estos competidores bien entrenados.En los textos de asunto del emailEl trabajador de oficina medio recibe 121 emails al día. Incluso aunque solo el 10% sean newsletters con enlaces a posts de blogs, la mayoría no leerá 12 posts al día. Elegirán los pocos que más les atraigan en base a sus titulares.En los resultados de búsquedaLa web media recibe casi 2/3 de su tráfico desde Google. Un buen titular incrementará las probabilidades de que los usuarios hagan clic en tu página frente a otros resultados.Cómo escribir un título en 3 pasosEscribir un titular no es tan difícil. Puedes conseguir lo básico con un sistema sencillo de tres pasos. Simplemente ten unas pocas cosas en cuenta cuando trabajes en esto:Deberías escribir tus titulares para los usuarios de Google, ya que lo más probable es, como mencionamos antes, que la mayor parte de tu tráfico venga de la búsqueda.Normalmente es mejor escribir tu titular antes de escribir tu post, así que este sistema sigue esta aproximación. Dicho esto, todavía puedes usar cada paso para refinar un titular ad-hoc.Deberías evitar el clickbait teniendo el auténtico contenido del artículo en mente a medida que recorres los pasos. A menudo, escribir un titular después de escribir el artículo hace que exageres lo que los lectores van a recibir del artículo. Si el artículo no cumple adecuadamente, bueno, entonces es clickbait.Pero vas a cumplir. Porque tienes la guía para expertos de Rebekah Bek 😉Ahora, ¡vamos a escribir ese título!Elige un formatoAñade un ángulo ganadorHazlo humano 1. Elige un formatoPongamos que estás escribiendo un post sobre las mejores proteínas en polvo. Cualquiera de estos titulares podría funcionar:Listicle: Las 10 Mejores Proteínas en Polvo para Construir Músculo en 2021Cómo-hacer: Cómo Elegir la Mejor Proteína en Polvo para TiTutorial: La Mejor Proteína en Polvo: Elige la Mejor en 6 PasosPieza de opinión: ¿De Verdad Existe algo como la Mejor Proteína en Polvo? La Ciencia Dice que NoReview / Análisis: Review de Optimum Nutrition Gold Standard : La Mejor Proteína en PolvoComparativa: Optimum Nutrition vs. MyProtein: ¿Cuál es la Mejor Proteína en Polvo?Pero, recuerda, en la mayor parte de webs la fuente de tráfico más importante es Google. Así que no deberías elegir el formato del titular que mejor te suene. Deberías elegir el que los usuarios estén en realidad buscando, para que tengas las mejores probabilidades de posicionarte.¿Cómo puedes hacer esto?Mira las páginas que actualmente estén mejor posicionadas en tu palabra clave objetivo en Google y comprueba cuál es el ángulo dominante. Puedes ver que en el top tres de los artículos de “best protein powder” (mejores proteínas en polvo) son todos listicles o listículos.Simplemente sé consciente de que los resultados de búsqueda de Google están personalizados en base a factores como tu ubicación e historial de búsqueda. Para evitar esto, usa la barra de herramientas SEO de Ahrefs en una pestaña de incógnito para simular una búsqueda en tu país e idioma objetivo.Ten en cuenta que el tipo de titular que funciona mejor variará por tema. Mientras que un titular de listicle es lo mejor para un post sobre las mejores proteínas en polvo, un titular tipo “cómo hacer” es mejor para el post que estás leyendo ahora mismo. Y tu tema podría necesitar una pieza de opinión. Todo depende de los datos de búsqueda.PRO TIPSi estás escribiendo un titular para un post existente que no se alinea con el ángulo dominante en los resultados de búsqueda, considera si podrías cambiar el ángulo con ediciones menores. Por ejemplo, rápidamente puedes convertir un tutorial en un listicle cambiando unas pocas palabras: Escribe Tu Mejor Titular: Un Sistema de 6 Pasos→6 Formas de Escribir un Buen Titular 2. Añade un ángulo ganadorAhora que tienes el formato, necesitas encontrar el ángulo que mejor posicione.Usando los mismos artículos del último paso, busca palabras diferenciadoras. Por ejemplo, cuando miras los listicles, la mayoría de artículos empiezan “# Best Protein Powders for…” (# Las Mejores Proteínas en Polvo para…)Lo que viene después de ese “for” (“para”) es el ángulo. En el caso de “best protein powder” (“mejor proteína en polvo”) el ángulo dominante es el género, por ejemplo, “Para Hombres” o “Para Mujeres”.Pero también hay otras opciones en la SERP, como:“For better nutrition” (para mejor nutrición)“For every diet” (para todas las dietas)“For you” (para ti)Al elegir tu ángulo, necesitas equilibrar lo que los usuarios quieren con lo que puedes escribir de forma adecuada. Si eres un experto y sabes que un ángulo adecuado tiene más sentido que otro, deberías adoptar ese ángulo.Si no existe un ángulo dominante obvio, enfócate en un beneficio claro, un factor diferenciador de tu producto o servicio o, simplemente, algo en lo que no se hayan enfocado todavía, siempre y cuando sea algo que tus lectores quieran conseguir.Por ejemplo:“For weight loss” (para perder peso)“For building muscle” (para ganar músculo)“For bulking” (para ponerse grande)Una vez que tengas las partes básicas de tu titular, como el formato y el ángulo, solo necesitas hacer una cosa más… 3. Hazlo humanoPara impactar de verdad a tus lectores, necesitas hacer que tu título sea humano.Si eres una persona humana, debería ser fácil. Usa adjetivos o figuras retóricas que usarías para describir de forma casual el artículo a tu mejor amigo.Así que en lugar de “10 best protein powders for weight loss” (las 10 mejores proteínas en polvo para perder peso), podrías tener:“10 best protein powders for effortless weight loss” (las 10 mejores proteínas en polvo para perder peso sin esfuerzo)“10 best protein powders for shedding the pounds” (las 10 mejores proteínas en polvo para perder esas libras/kilos de más)“10 best protein powders to get shredded” (las 10 mejores proteínas en polvo para ponerse cuadrado)Para hacer este proceso más fácil, usa el lenguaje de tus lectores. En cualquier sector hay jerga, hay argot y existe esa forma personal en la que la gente “que entiende” habla sobre sus cosas favoritas. Si tienes tiempo, lee todos los artículos que puedas sobre el tema.También puedes buscar sobre tu tema en redes sociales. Reddit, Twitter y LinkedIn son sitios geniales para encontrar frases de nicho y lenguaje específico de ciertas comunidades. Algunos subreddits incluso cuentan con una Wiki y un Glosario que define palabras clave.Usando esta información podrías elegir un título como “17 Protein Powders That Help You Hit Your Macronutrient Goals” (17 Proteínas en Polvo que te Ayudarán a Conseguir tus Objetivos de Macronutrientes) o “14 Protein Powders for Fast, Easy Transportation, Preparation, and Consumption” (14 Proteínas en Polvo de Rápido, Fácil Transporte, Preparación y Consumo),4 consejos para escribir titularesElegir un formato y ángulo ganadores y “hacerlo humano” es suficiente para el proceso paso a paso “básico” para escribir un título ganador.Dicho esto, tras años de escribir títulos, tenemos cuatro consejos para ti.1. Añade concreciónCuanto más específico sea tu título, más fácil será de leer. Cuanto más fácil sea de leer, a más gente le gustará. A cuanta más gente le guste, más probable será que hagan clic en él.Es así de fácil. Y la especificidad viene de elementos tangibles, del mundo real.Por ejemplo, en lugar de “Protein Powders for Weight Gain” (Proteínas en Polvo para Ganar Peso), prueba “15 Tasty Protein Powders to Help You Gain 1lb Per Week in Muscle” (15 Deliciosas Proteínas en Polvo para Ayudarte a Ganar 1 Libra de Músculo a la Semana).2. Sorprende y deleitaSi tu objetivo es conseguir tráfico desde otros sitios distintos a la búsqueda orgánica, como redes sociales, alinear la intención de búsqueda puede que no sea tan importante. Puede que consigas más impacto diciendo algo interesante e inusual que haga que la gente se detenga y haga clic.No hay una fórmula real para esto; depende de que conozcas a tu audiencia, el lenguaje que usa y lo que sea probable que conecte con ellos.3. Crea brechas de curiosidadDale tu información a cualquiera excepto a aquel cuya curiosidad intentas provocar, por ejemplo “¡Todo el mundo está haciendo esto menos tú!”. Simplemente asegúrate de respaldar esa afirmación en tu artículo para que no sea otro caso de clickbait.4. Prueba variantes del titularCuando publiques tu artículo en redes sociales, puedes elegir un título distinto. Prueba variantes sobre el tema principal para ver si un titular recibe más clics, me gusta, comentarios y compartidos. Después, úsalo como tu título de post principal.Reflexiones FinalesCrear un título ganador no es una ciencia muy avanzada. Es ciencia de marketing. Y eso es bastante más fácil. De hecho, si usas el sistema de tres pasos de arriba, podrás medirte con los mejores redactores de tu sector.Una vez que estés listo para convertirte en el mejor redactor de títulos, revisa los clásicos del copywriting. Todos tienen sus propias fórmulas basadas en evidencias para escribir titulares, con teorías que los respaldan.Estos son los cinco libros que más me han enseñado:Publicidad Científica de Claude Hopkins. Introdujo el concepto de “copy testing” (testeo de copies) al detallar los titulares más efectivos usados en el marketing de respuesta directa alrededor de 1923.Tested Advertising Methods, de John Caples (Métodos de Publicidad Probados). Los métodos de Claude Hopkins refinados durante otra década. Incluye las fórmulas de títulos que todavía reciben clics casi un siglo después.Breakthrough Advertising de Eugene Schwartz (Publicidad Innovadora). Introdujo la idea de ‘Brand Awareness’ (reconocimiento de marca) y cómo llegar a cada nivel de consumidor.Las Fórmulas Secretas de el Mago de la Publicidad, de Roy Williams. Este es más moderno, un favorito personal que adopta una de las aproximaciones más singulares a la redacción que puedes encontrar.Great Leads de Michael Masterson (Leads Geniales). Enfocado en cómo escribir la primera línea del copy para conseguir el mayor impacto en tu audiencia.Y cuando ya seas un experto completamente actualizado en la redacción de titulares, optimiza el resto de tu artículo con la guía mágica de redacción SEO de Si Quan Ong.Siéntete libre de contactarme en Twitter y darme unos titulares.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software en AppCritic. Aquí puedes leer su guía sobre WhatsApp CRM. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo escribir un título irresistible en 3 pasos fáciles"
    },
    {
      "level": "H2",
      "text": "¿Qué es un título?"
    },
    {
      "level": "H2",
      "text": "¿Por qué son los títulos importantes?"
    },
    {
      "level": "H3",
      "text": "En redes sociales"
    },
    {
      "level": "H3",
      "text": "En los textos de asunto del email"
    },
    {
      "level": "H3",
      "text": "En los resultados de búsqueda"
    },
    {
      "level": "H2",
      "text": "Cómo escribir un título en 3 pasos"
    },
    {
      "level": "H3",
      "text": "1. Elige un formato"
    },
    {
      "level": "H3",
      "text": "2. Añade un ángulo ganador"
    },
    {
      "level": "H3",
      "text": "3. Hazlo humano"
    },
    {
      "level": "H2",
      "text": "4 consejos para escribir titulares"
    },
    {
      "level": "H3",
      "text": "1. Añade concreción"
    },
    {
      "level": "H3",
      "text": "2. Sorprende y deleita"
    },
    {
      "level": "H3",
      "text": "3. Crea brechas de curiosidad"
    },
    {
      "level": "H3",
      "text": "4. Prueba variantes del titular"
    },
    {
      "level": "H2",
      "text": "Reflexiones Finales"
    }
  ],
  "author": "Brett G. Friedman"
}