{
  "url": "https://ahrefs.com/blog/es/consejos-marketing-contenido/",
  "slug": "consejos-marketing-contenido",
  "title": "17 Consejos accionables de contenido para 2022",
  "description": "Aquí va una lista de 17 consejos que mejorarán tu marketing de contenidos y te ayudarán a conseguir más visitantes, leads y ventas.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido ¿No puedes hacer que tu estrategia de marketing de contenidos funcione?No te asustes. Aquí va una lista de 17 consejos que mejorarán tu marketing de contenidos y te ayudarán a recibir más visitas, leads y ventas:Conoce para quién creas contenidoTrata temas con potencial de tráfico de búsquedaAborda los temas que mejor le funcionan a los competidoresPrioriza los temas usando el “potencial de negocio”Cumple las 3 C de la intención de búsquedaCrea un calendario editorialPromociona tu contenidoDiseña imágenes compartiblesReutiliza tu contenidoAñade “link triggers”Actualiza tu contenidoContacta a bloggersTen opinión propiaArroja nueva luz en el sector con otra perspectivaNo te obsesiones con el número de palabrasGestiona un portfolio de contenidoCrea hubs de contenido1. Conoce para quién creas contenidoUna agencia de CRO (conversion rate optimization, optimización de la tasa de conversión) escribe sobre CRO y atrae a otros profesionales CRO. Pero los profesionales CRO no necesitan servicios de CRO. Así que el blog de la agencia no atrae leads útiles, y la agencia declara que el marketing de contenidos no funciona.Pero si la agencia CRO hubiera dado algún paso atrás y puesto por escrito a quién quería dirigirse, estaría claro el tipo de contenido que tenía que crear. No “tácticas avanzadas de CRO”, sino “cómo optimizar tu página principal y conseguir más leads”.Por eso el primer paso de crear cualquier estrategia de contenidos es tener claro para quién estás creando contenido.Si ya sabes a quién te diriges, asegúrate de ponerlo por escrito y compartirlo con tu equipo completo. Si no, usa la plantilla de abajo para averiguarlo en el caso de tu empresa.Lectura recomendada: Cómo Crear Buyer Personas Detallados para Tu Empresa [Plantilla Gratuita de Persona] - en inglés2. Trata temas con potencial de tráfico de búsquedaEl tráfico proveniente del email o redes sociales es un gran impulso, pero tiene una vida corta.Sin embargo, si creas contenido sobre temas que la gente esté buscando de forma constante en Google, tienes el interés continuo garantizado. Mientras tu artículo se posicione en Google, recibirás de forma consistente tráfico de búsqueda pasivo.Aquí tienes cómo encontrar estos temas:Ve a Explorador de palabras clave de AhrefsIntroduce un tema relevante para tu sectorVe al informe de Términos que concuerdan (matching terms)Cambia a la pestaña de PreguntasAquí, tienes unos 3.000 temas potenciales a los que podrías dirigirte. Revisa la lista y elige los que sean relevantes para tu web.Lectura recomendada: Cómo hacer investigación de palabras clave para SEO3. Aborda los temas que mejor le funcionan a los competidores¿No sería maravilloso si supieras qué artículos de tus competidores reciben la mayor cantidad de tráfico para que pudieras replicar su éxito?Bien, buenas noticias, puedes hacerlo.Aquí tienes los pasos cómo hacerlo:Ve a Explorador de sitios de AhrefsIntroduce un dominio de la competenciaVe al informe de Mejores páginasVerás que todas las páginas están ordenadas por tráfico orgánico, además de la palabra clave que envía a cada página la mayor parte del tráfico.Por ejemplo, podemos ver que el artículo de Beardbrand sobre los estilos de barba recibe una estimación de 105.000 visitas orgánicas al mes. La palabra clave que envía la mayoría del tráfico es “beard styles” (estilos de barba).Si fuéramos propietarios de un ecommerce competidor, podríamos abordar también este tema.4. Prioriza los temas usando el “potencial de negocio”El tráfico de búsqueda por sí mismo es una métrica de vanidad. Si no mejora tu negocio (es decir, si no consigue más leads o más ingresos), conseguir más tráfico carece de sentido.En Ahrefs puntuamos los temas usando el “potencial de negocio”.Emparejar “potencial de negocio” con “potencial de tráfico de búsqueda” nos mantiene enfocados en la creación de contenido que realmente genere crecimiento.Por eso nuestro blog gira en torno a temas alrededor del SEO y marketing de contenidos y no temas de moda como “buscar por imagen”.Incluso a pesar de ser una búsqueda popular (284.000 a nivel global) y tiene el potencial de generar muchísimo tráfico, no tiene nada que ver con nuestro producto (“0” en potencial de negocio).5. Cumple las 3 C de la intención de búsquedaEl objetivo de Google es ofrecer a sus usuarios los resultados de búsqueda más relevantes para cualquier consulta. Así que, para posicionarte en Google, necesitas demostrar que eres el resultado de búsqueda más relevante.Eso implica satisfacer la intención de búsqueda—el por qué detrás de una búsqueda.Podemos revisar las páginas de resultados de motores de búsqueda (SERPs, search engine results pages en inglés) de Google para averiguar la intención de búsqueda. Hazlo buscando en Google tu palabra clave objetivo, después, analiza las páginas mejor posicionadas en busca de las 3 C de la intención de búsqueda.A. Tipo de contenidoEl tipo de contenido normalmente entra en una de estas cinco categorías: post de blog, producto, categoría, landing page o vídeo. Por ejemplo, si buscamos “cómo aprender hacer uñas esculpidas”, vemos que los primeros resultados son casi todos vídeos. Si quieres posicionar en esta palabra clave, probablemente tendrás que crear un vídeo.B. Formato del contenidoEl formato del contenido aplica sobre todo a los posts en el blog, ya que suelen ser o tutoriales, listicles, artículos de noticias, columnas de opinión o reviews.Por ejemplo, los resultados mejor posicionados en “mejores entrenamientos en casa” son en su mayoría listicles de rutinas y selecciones de canales de YouTube:Mientras que los mejores resultados en “cómo aprender gramática coreana” son sobre todo vídeos, y algunos tutoriales y guías específicamente pensadas para hispanohablantes:Para tener más oportunidades de posicionarte, sigue la tendencia.C. Ángulo del contenidoEl ángulo del contenido se refiere al principal “argumento de venta” del contenido. Por ejemplo, la gente que busca “cómo hacer sangría” en España está interesada en recetas fáciles, clásicas y auténticas:Mientras que usuarios anglosajones que buscan “how to make sangria” lo que quieren es que sea fácil (easy en inglés):Lectura recomendada: ¿Qué es la Intención de Búsqueda? Una Guía Fácil para Principiantes6. Crea un calendario editorialHacemos un seguimiento de todos nuestros esfuerzos de contenidos con un calendario editorial:Cada entrada del calendario también tiene información sobre cada pieza individual, como:TemaAutorColaboradoresStatusFecha de entregaImágenesSlug URLCategoríaY demás.Esto mantiene a todas las personas alineadas en todo el proceso de gestión del contenido. El editor y cada colaborador sabe en qué fase están, cuándo es la fecha de entrega y qué hay que hacer después.Esto es lo que nos ha permitido publicar dos o más posts en el blog cada semana durante los últimos años.Incluso aunque seas un profesional del marketing de contenidos independiente, un calendario de contenido hace que seas honesto con tu propio proceso. Ya no se escribe solo cuando llega la inspiración. Te comprometes a una agenda y publicar.Lectura recomendada: Cómo Crear un Calendario Editorial que Te Funcione7. Promociona tu contenidoSi no pones tu contenido frente a la gente a la que le importa, tu contenido recién publicado será prácticamente invisible.En Ahrefs promocionamos cada pieza de contenido que publicamos. Como mínimo:Enviamos nuevos posts del blog a nuestros suscriptores de la newsletter.Lo compartimos en todas nuestras cuentas sociales (Facebook, Twitter, LinkedIn).Contactamos a la gente que mencionamos en nuestro contenido.Ponemos publicidad (Facebook, Twitter, Quora, etc.)Al menos tendrás que hacer todo esto para dar a conocer tu contenido—o, si tu sitio es nuevo, incluso más. Te recomendamos seguir esta checklist de promoción de contenido:https://www.youtube.com/watch?v=PoVYweKH4ck8. Diseña imágenes compartiblesSomos grandes fans de crear imágenes personalizadas para nuestro contenido. Estas imágenes ayudan a simplificar conceptos complejos y mejoran la legibilidad de nuestro contenido.Además, son un contenido genial para compartir en redes sociales. Incluso en un nicho “aburrido” como el SEO, imágenes como estas se pueden volver virales.Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021Nuestro equipo de ilustradores interno crea estas imágenes. Pero no tienes que gastar una fortuna para diseñarlas. Las imágenes personalizadas no tienen que ser dignas de museo para que las gente las quiera compartir. Después de todo, el conocido blog WaitButWhy solo usa monigotes y dibujos a mano. Además, herramientas como Canva te facilitan la creación de imágenes.Antes de publicar, revisa tu contenido de nuevo. Elige sitios donde una imagen personalizada pueda añadir “valor”, por ejemplo, para ilustrar mejor un concepto, para llevar la narrativa a un nuevo nivel, hacer que el contenido sea entretenido, etc.9. Reutiliza tu contenidoHaz que tu contenido rinda más—conviértelo a distintos formatos y compártelo en distintas plataformas.Por ejemplo, convertimos nuestra guía de marketing de influencers en un vídeo y nuestro vídeo sobre cómo conseguir más suscriptores de YouTube en un post para el blog.También:Convertimos un post del blog en un hilo de Twitter.Convertimos vídeos de YouTube en tuits.Convertimos posts del blog en posts de Instagram.Como el experto en marketing de contenidos Ross Simmonds dice, “Crea una vez, distribuye para siempre.”10. Añade “link triggers”Los enlaces son uno de los tres principales factores de posicionamiento. Si quieres que tu contenido posicione bien, necesitas enlaces.Una forma—además del link building— es incluir “link triggers”, o “activadores de enlaces” (la razón que hace que la gente enlace a cierta pieza de contenido) en tu contenido al escribirlo. No solo facilitará contactar y construir enlaces, sino que también puede ayudar a atraerlos de forma natural.Aquí tienes cómo hacerlo:Ve a Keywords Explorer de AhrefsBusca tu palabra clave objetivo y haz scroll hasta el resumen de la página de resultados (SERP).Encuentra un artículo parecido con muchos dominios de referenciaHaz clic en el número que está en la columna de EnlacesEcha un vistazo a la columna Ancla y enlace entrante en busca de puntos en común.Por ejemplo, si hacemos esto con el post de Elena de Francisco sobre copywriting, vemos que unas pocas personas la están enlazando gracias a algunos de sus ejemplos prácticos y accionables. Si escribimos sobre el mismo tema, tendremos que crear nuestros propios casos reales/ejemplos listos para usar.Si escribimos sobre el mismo tema, tendremos que crear nuestras propias técnicas de redacción SEO.11. Actualiza tu contenidoEl contenido se puede “echar a perder”. La información se queda desactualizada, la intención de búsqueda de tu keyword puede cambiar y tu posicionamiento caer.Cuando eso pase, tendrás que actualizar tu contenido.¿Actualizas todo? No, especialmente si tienes cientos de posts en el blog como nosotros. En lugar de eso, tendrás que priorizar. Lo haces siguiendo este diagrama de flujo:Como alternativa, puedes usar nuestro plugin gratuito de SEO para revisar tu sitio en busca de posts con bajo rendimiento. Después sigue la guía de abajo para aprender la forma más adecuada de republicar tu contenido.Lectura recomendada: Volver a publicar contenido: cómo actualizar publicaciones de blog antiguas para SEO12. Contacta a bloggersBlogger outreach o el contacto a bloggers es el proceso de poner tu producto o contenido frente a bloggers y periodistas relevantes enviándoles emails personalizados.El objetivo: convencer a la gente con acceso a audiencias grandes de hablar sobre ti y enlazar a tu sitio web.Pero el contacto con bloggers no es spam. No te da permiso para scrapear los emails de todo el mundo en tu sector y contactarlos rogando un enlace.En lugar de eso, es algo más de largo plazo. Claro, quieres algo suyo—por eso les contactas. Pero también quieres hacer networking, permanecer en su radar y hacerte amigo suyo. En lugar de quemar puentes solo por un tuit, quieres construir una relación que pueda llevar a algo más en el futuro: una colaboración, alianza, etc.Así que, ¿cómo haces un contacto de calidad con bloggers?Escribimos una guía de principio a fin sobre cómo hacerlo (y además, hacerlo escalable) así que te recomiendo que le eches un vistazo.Lectura recomendada: Contacto con Bloggers: Cómo Hacerlo a Escala (Sin Sentirte un Idiota) - En inglés13. Ten opinión propiaTodos queremos que nuestro contenido se posicione bien en Google y genere tráfico de búsqueda. Pero solo puedes llegar hasta cierto punto jugando a ese juego. Y, por desgracia, muchos sitios web lo hacen. Por eso las SERPs están llenas de contenido indistinguible.No lo olvides: posicionar es meramente una parte de la ecuación. Con el tiempo, el lector necesita consumir tu contenido y comprar lo que vendes. Si eres uno entre muchos, no hay razón para que se suscriba a tu lista, realice una prueba gratuita o compre tu producto. Tienes que destacar.Destacar implica compartir una opinión. Wirecutter destaca entre todas las webs de afiliados porque comparte opiniones, por ejemplo, aquí está la mejor sartén que no se pega, los mejores auriculares inalámbricos, la mejor cámara réflex, etc.También compartimos habitualmente nuestras opiniones en nuestro blog. Por ejemplo, mi compañero Michal Pecanek afirmó con rotundidad que hay algunas métricas SEO conocidas que simplemente no son importantes:Lecturas complementariasLas Opiniones no son Opcionales en el Marketing de Contenidos (en inglés)Por qué Wirecutter gana: Contenido con opinión (en inglés)14. Arroja nueva luz en el sector con otra perspectivaLas finanzas no son lo mío. Pero a pesar de eso he leído casi todos los artículos escritos por el redactor financiero Morgan Housel. Tú también lo harías—si leyeras sus artículos:Permite que te hable sobre Robert Wadlow. Era enorme, el ser humano más grande que se haya conocido.Una anomalía en una glándula pituitaria bombardeó el cuerpo de Wadlow con la hormona del crecimiento, lo que le llevó a un tamaño asombroso. Medía 1,83m con 7 años, 2,13m con 11 y, cuando murió con 22 años superaba los 2,7 metros, pesaba 226 kilos y llevaba zapatos del 75. Su mano medía unos 30 centímetros de ancho.Era lo que las historias de ficción retratarían como un héroe sobrehumano, capaz de correr más rápido, saltar más alto, levantar más peso y aplastar a más tipos malos que cualquier persona normal. Como un Paul Bunyan en la vida real.Escribe sobre finanzas, pero no es un discurso aburrido escrito en el idioma de Wall Street. Te educa desde varios ángulos: historia, psicología, biología, espacio y guerra. Las finanzas son solo el lienzo sobre el que pinta; sus pinceles son las otras lentes que usa para presentarte el tema.Tu sector puede ser “aburrido”, pero no dejes que tu contenido lo sea.Encuentra otra lente a través de la que mirar a tu sector de una forma nueva. Por ejemplo, Animalz escribió sobre el marketing de contenido a través de la lente de un agujero negro.Como Morgan dice:La clave de la persuasión es enseñar a la gente algo nuevo a través de la lente de algo que ya conocen. Esto es crítico al escribir. Los lectores quieren aprender algo nuevo, y cuando mejor aprenden es cuando pueden relacionar un tema nuevo con algo que ya conocen. 15. No te obsesiones con el número de palabrasLeer una página de recetas hoy implica finalizar el equivalente a “Guerra y Paz” de León Tolstói antes de que, al fin, puedas aprender a cocinar ese plato de tres minutos.Google’s ranking bias for recipe sites that share the chef’s entire life story via an Ayn Rand novel length of content prior to the actual recipe knows no bounds. Esp on mobile just give us the recipe I’m trying to shop not learn the history of the universe.— Adam Singer (@AdamSinger) October 2, 2019Esto pasa por la creencia popular de que los artículos más largos generan más tráfico orgánico. Pero según nuestro estudio de 900 millones de páginas, existe una moderada correlación negativa entre el número de palabras y el tráfico orgánico en los posts de más de 2.000 palabras.En otras palabras, el post de 10.000 palabras recibe menos tráfico de búsqueda que el post medio de 2.000 palabras.Así que deja de obsesionarte con el número de palabras. Nadie quiere leer contenido más largo. Cubre los temas con la profundidad necesaria, corta los aspectos no importantes y ve al grano.16. Gestiona un portfolio de contenidoNo puedes esperar que cada pieza de contenido que creas cumpla todos tus objetivos de marketing de contenidos. Al igual que en finanzas, necesitas diversificar.Dependiendo de tus objetivos y prioridades de tu empresa, puede que necesites lo siguiente:Contenido optimizado para búsquedaLinkbaitContenido que asista a las ventasContenido de liderazgo intelectualY más.Incluso aunque posicionar en Google es importante para nosotros, el contenido diseñado para posicionar no es el único tipo de contenido que creamos. También publicamos estudios basados en datos (para conseguir enlaces y liderazgo intelectual), actualizaciones de producto (para retención), columnas de opinión (por el liderazgo intelectual), y herramientas gratuitas (para generar ventas directas).Lectura recomendada: Riesgo - Beneficio. Cómo Construir un Portfolio de Contenidos Diversificado (en inglés)17. Crea hubs de contenidoHace poco organizamos nuestras mejores guías gratuitas en un punto de partida principal para todos nuestros lectores.Esto se conoce como un content hub o hub de contenidos. Los content hub son grupos enlazados entre sí de contenido sobre un tema parecido. Este es el aspecto que tienen en la teoría:Ya que nuestro blog se muestra en orden cronológico inverso, una página hub ayuda a nuestros lectores a descubrir más contenido nuestro de forma organizada.Si tienes mucho contenido de calidad, considera crear páginas hub para enlazarlas entre sí.Lectura recomendada: Content Hubs para SEO: Consigue Más Tráfico y Links con Clusters TemáticosReflexiones finalesEspero que te vayas de este post con unos cuantos consejos accionables de marketing de contenidos para aplicar en tu empresa.¿Preguntas? ¿Dudas? ¿Sugerencias? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "17 Consejos accionables de contenido para 2022"
    },
    {
      "level": "H2",
      "text": "1. Conoce para quién creas contenido"
    },
    {
      "level": "H2",
      "text": "2. Trata temas con potencial de tráfico de búsqueda"
    },
    {
      "level": "H2",
      "text": "3. Aborda los temas que mejor le funcionan a los competidores"
    },
    {
      "level": "H2",
      "text": "4. Prioriza los temas usando el “potencial de negocio”"
    },
    {
      "level": "H2",
      "text": "5. Cumple las 3 C de la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "A. Tipo de contenido"
    },
    {
      "level": "H3",
      "text": "B. Formato del contenido"
    },
    {
      "level": "H3",
      "text": "C. Ángulo del contenido"
    },
    {
      "level": "H2",
      "text": "6. Crea un calendario editorial"
    },
    {
      "level": "H2",
      "text": "7. Promociona tu contenido"
    },
    {
      "level": "H2",
      "text": "8. Diseña imágenes compartibles"
    },
    {
      "level": "H2",
      "text": "9. Reutiliza tu contenido"
    },
    {
      "level": "H2",
      "text": "10. Añade “link triggers”"
    },
    {
      "level": "H2",
      "text": "11. Actualiza tu contenido"
    },
    {
      "level": "H2",
      "text": "12. Contacta a bloggers"
    },
    {
      "level": "H2",
      "text": "13. Ten opinión propia"
    },
    {
      "level": "H2",
      "text": "14. Arroja nueva luz en el sector con otra perspectiva"
    },
    {
      "level": "H2",
      "text": "15. No te obsesiones con el número de palabras"
    },
    {
      "level": "H2",
      "text": "16. Gestiona un portfolio de contenido"
    },
    {
      "level": "H2",
      "text": "17. Crea hubs de contenido"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}