{
  "url": "https://ahrefs.com/blog/es/consigue-enlaces-competidores/",
  "slug": "consigue-enlaces-competidores",
  "title": "7 Formas Accionables de Saquear los Enlaces de Tus Competidores",
  "description": "Aprende a encontrar los enlaces de tus competidores que potencian su posicionamiento, consíguelos para tu sitio e incrementa tu tráfico orgánico",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido ¿Tus competidores posicionan en los primeros resultados de Google para tus palabras clave objetivo? Es probable que sea porque tienen un perfil de enlaces entrantes sólido.Los enlaces son quizá la pieza más crucial en el puzzle SEO—sufrirás para posicionar sin ellos.¿Cómo lo sabemos? Porque Google nos ha dicho que es así…“Te puedo decir cuáles son [los principales factores de posicionamiento]. El contenido. Y los enlaces que apuntan a tu sitio.” - fuenteNota al margen. Incluso sin que Google lo admitiera, probablemente este es el tema del que estamos más seguros en la comunidad SEO. Los links son la base del algoritmo PageRank de Google y los SEOs han visto correlaciones positivas entre los enlaces y el posicionamiento desde, bueno, desde siempre.Pero el que tus competidores tengan montones de enlaces entrantes (backlinks) es algo malo, ¿no?No exactamente.Si la gente está felizmente enlazando a tus competidores, es posible que también te enlacen alegremente a ti.(Esto es especialmente cierto si creas un contenido incluso mejor que el de tus competidores).En este artículo haré un recorrido por siete formas accionables para averiguar quién está enlazando a tus competidores y cómo puedes replicar sus enlaces.Pero primero, necesitas identificar quiénes son tus competidores de verdad.Cómo identificar a tus competidores (pista hay DOS “tipos” distintos)¿Crees que ya tienes una buena idea de quiénes son tus competidores? No tan rápido. La mayor parte de sitios tienen dos “tipos” de competidores.Puedes robar enlaces de ambos tipos, pero la aproximación será diferente para cada uno de ellos.Pero antes de entrar en explicaciones, haz una copia de esta Google Sheet—la necesitarás para registrar a tus competidores a medida que avanzamos por esta sección.Aquí va una explicación de los tipos de competidores:1. Competidores a nivel de dominioEstos son los sitios que compiten contigo en las SERPs, en conjunto.Con esto, quiero decir que no solo compiten contigo por uno dos términos de búsqueda, están compitiendo contigo por muchas búsquedas a lo largo de muchas páginas.Aquí tienes cómo encontrar a tus competidores a nivel de dominio:Ve al Site Explorer -> introduce tu dominio -> Dominios Competencia (competing domains)Por defecto, este informe muestra una lista de dominios competidores ordenados por el número de palabras claves comunes (es decir, solape de palabras clave).Puedes ver como, sin que sea una sorpresa, moz.com es nuestro mayor competidor en las SERPs.Pero hay unos pocos competidores indirectos también, —backlinko.com, hubspot.com, wordstream.com, etc.Nota al margen. También te darás cuenta de que están sitios como quora.com, support.google.com y forbes.com en este informe. No calificaría estos como competidores a nivel de dominio —sí, compiten con nosotros por un montón de palabras clave, pero son sitios bastante genéricos que se salen de nuestro nicho. Esto se ve en el hecho de que hay muy poco color verde en la visualización del solape de palabras clave (esto es, la barra azul/verde/amarilla que ves arriba.¡Por ejemplo, competimos con wordstream.com por más de 11.500 palabras clave comunes!Datos del informe de Dominios Competencia en Site Explorer. Si están posicionando por tantas palabras clave (y lo están) es más que probable que tengan muchos enlaces entrantes.Esto nos lleva a un punto importante:Los competidores a nivel de dominio no son siempre tus competidores “tradicionales” del mundo real. Por ejemplo, no son siempre competidores en un sentido de negocio; puede que simplemente estén compitiendo por muchas palabras clave similares.Nota al margen. Wordstream no vende herramientas SEO como nosotros—venden productos PPC y servicios. Pero son un competidor en sentido SEO; están compitiendo por palabras clave similares y están en un nicho similar, lo que quiere decir que las tácticas que usan para obtener enlaces entrantes pueden funcionarnos también a nosotros.Toma nota de tus cinco competidores más relevantes en la Google Sheet, así:La segunda columna empezando por el final—el enlace al Site Explorer— se rellenará automáticamente en la hoja de cálculo a medida que añades competidores.¡IMPORTANTE! La columna final te permite etiquetar si el sitio compite o no contigo en sentido de negocio—asegúrate de hacerlo.El objetivo es hacerse con los enlaces entrantes de todos estos sitios. Permanece atento para aprender cómo 🙂2. Competidores a nivel de páginaEstos son los sitios que, aunque quizá no son competidores en global (es decir, sin tener en cuenta el solape de palabras clave en todo el sitio), al menos compiten contigo a nivel de página para temas o palabras clave específicas.Por ejemplo, tenemos un post con 75 consejos SEO, que en inglés apunta a palabras clave como “SEO tips”.Pero aquí está el tema: mientras que entrepreneur.com no es un competidor a nivel de dominio, compiten con nosotros en este término. Su lista de consejos SEO posiciona en el top 10, ¡por encima nuestra!Aquí tienes cómo encontrar competidores a nivel de página:Elige una página o post en tu web, después pega la palabra clave principal por la que intentas posicionar esa página (por ejemplo “SEO tips” o “consejos SEO”) en el Keywords Explorer.Después haz scroll la vista general de la SERP.Todos estos son competidores a nivel de página.Verás algo de solape entre los competidores a nivel de dominio y a nivel de página (por ejemplo, searchenginejournal.com también salía en nuestro análisis de competencia a nivel de dominio) pero algunos—como los que están resaltados arriba—solo compiten a nivel de página.Apunta todos los competidores relevantes a nivel de página que posicionan por encima de ti en tus palabras clave objetivo, junto al número de dominios de referencia a cada página, como:Nota al margen. No pasa nada por incluir páginas que estén entre los competidores a nivel de dominio; es posible que haya algo de solape. Oh, y si quieres incluir más de una página, puedes—simplemente filtra por la columna “Mi página” para ver datos de cada página de forma individual.Correcto—¡pasemos a las tácticas! 🙂1. Descubre MILES de oportunidades potenciales de enlaces investigando los enlaces a la home de tus competidoresMira al informe de Texto Ancla (anchor) para tu dominio.Site Explorer -> Perfil de enlaces -> Texto Ancla (Anchors)Probablemente te darás cuenta de que la mayoría de enlaces usan anclas con la marca.Nota al margen. No olvides seleccionar el modo “URL” del desplegable, en lugar del modo por defecto “dominio/*”—esto asegurará que solo ves enlaces a tu página home, en lugar de a cada página en el dominio.Esto es porque la gente tiende a enlazar a la página home cuando hace una mención general de una marca, en lugar de a algo más específico (por ejemplo, algo que se ha dicho en un post, o quizá un producto particular; en ese caso, enlazarían directamente a la página en cuestión).Por eso, analizar los enlaces a la página home de tus competidores te dirá donde los están mencionando.Por ejemplo, moz.com—uno de los competidores a nivel de dominio de nuestra hoja de cálculo—ha sido mencionado en más de 20.000 webs.Como sabemos que la mayoría de estos enlaces son menciones de marca, la pregunta es: “¿por qué les mencionaron a ellos [Moz], pero no a nosotros [Ahrefs]?”¡Buena pregunta!—esto es lo que necesitas averiguar y solucionar.Aquí tienes cómo:Introduce uno de los competidores a nivel de dominio desde la hoja de cálculo—idealmente que esté marcado como competidor “directo” en la última columna—en el Site Explorer.Después ve al informe de Enlaces (y añade un filtro dofollow).Ahora verás todos los enlaces entrantes que apuntan a la página home de tu competidor.Nota al margen. El filtro “Contenido” es bastante útil—filtra por los enlaces que aparecen en el contenido principal de la página. Ahora mismo, no es posible añadir los filtros “contenido” y “dofollow” a la vez en el informe de Enlaces. Pero si quieres hacerlo, intenta filtrar por enlaces solo de “contenido”, exporta los datos y después filtra solo por los enlaces dofollow en Excel o Google Sheets.Después, criba entre estos e intenta responder a la pregunta de arriba (es decir, ¿por qué mencionaron y enlazaron a mi competidor… pero no a mí?!”) Normalmente puedes averiguar esto bastante rápido mirando al texto ancla, texto que lo rodea y el título de la página.Responder a esta pregunta te descubrirá algunas oportunidades para hacer con enlaces rápidamente.Por ejemplo, aquí va una lista de herramientas de marketing de contenidos de Curata que menciona a Moz, pero no a Ahrefs:(Probablemente podríamos conseguir un enlace de esta misma página contactando con Curata y sugiriendo que también podrían añadir a Ahrefs a su lista).Aquí está un enlace en Buffer donde se cita a Rand Fishkin—el fundador de Moz:(“¡Ey, Buffer! Aquí está Josh [Hardwick] de Ahrefs—¿quieres añadir un consejo más a la lista” ;))CONSEJO RÁPIDO: BUSCA LOS NOMBRES DE FUNDADORES (Y OTROS REPRESENTANTES DE LA EMPRESA) PARA ENCONTRAR RÁPIDAMENTE CITAS Y TESTIMONIOS¿Sabes quién fundó o cofundó las empresas de la competencia?Busca sus nombres en el informe de Enlaces—esto descubrirá enlaces que existen porque el fundador fue citado o dio un testimonio.Puedes contactar con estos sitios y ofrecerles una cita o un testimonio.Nota: Haz esto solo cuando tenga sentido. No vayas por ahí ofreciendo citas para artículos que no han sido actualizados en 6 años. O testimonios de productos/servicios que nunca has usado.Conclusión: aprende por qué y dónde se menciona a tus competidores y copiales.2. Encuentra los Posts Invitados de tus Competidores… ¡Después Escribe para los MISMOS Sitios!El guest blogging o autor invitado sigue siendo una de las formas más fáciles de conseguir enlaces de alta calidad para tu sitio.Es muy probable que tus competidores ya estén usando esta táctica ahora mismo.(Puede que incluso hayas detectado algunos posts invitados mientras saqueabas los enlaces de la página home de tus competidores) Debajo tienes tres tácticas sencillas que puedes usar para localizar los posts invitados de tus competidores fácilmente.Nota al margen. Usaré al colaborador de Ahrefs Benjamin Brandall de Process.st para los ejemplos.Método 1: Usa búsquedas avanzadas de GoogleTu punto inicial para encontrar posts invitados de competidores debería ser la búsqueda de Google.Hay varias búsquedas que puedes probar, pero esta me parece la más efectiva:\"Nombre del autor\" + \"post invitado\" -site:dominiodelcompetidor.com -site:https://twitter.comY aquí están los resultados para Benjamin:Puedes usar otra búsqueda para encontrar otros resultados más:\"Nombre del autor\" + inurl:AutorMétodo 2: Usa búsqueda inversa de imágenesPuedes usar la búsqueda inversa de imágenes de Google (click con el botón derecho en una imagen mientras usas Chrome) para encontrar posts que tengan la foto del autor.¡Qué guapo, Benjamin!Nota al margen. Este método es también útil cuando buscas aportaciones tipo “ronda de expertos”.Método 3: Usa el Content Explorer de AhrefsTambién puedes usar el Content Explorer de Ahrefs para encontrar contenido escrito por un autor concreto. Como en Google, esta herramienta tiene varios operadores avanzados de búsqueda.Vamos a probar la siguiente búsqueda:author:Nombre del autorAquí está lo que hemos encontrado de Benjamin:En resumen: si a tu competidor ya le han aceptado un post en un sitio en concreto, entonces es bastante posible que también a ti te puedan publicar ahí.3. Encuentra a Los “Superfans” De Tus Competidores…¡Y Después Entabla Relaciones Con Ellos!Soy un GRAN fan de Ryan Stewart (Webris).Su contenido relacionado con SEO es de lo mejor de la web, en mi opinión. (¡Creo que es su amor por Google Sheets lo que me incita a ello!)PERO, parece que no soy el único—el resto del equipo de Ahrefs también parece respetar su trabajo.Es probable que sea por eso que hemos enlazado al sitio de Ryan, WEBRIS, ¡un montón!En resumen, ¡somos superfans!Pero ¿qué uso tiene este conocimiento?Bien, imagina que puedes identificar a los superfans de tus competidores, ¿no tendría sentido construir una relación con esas personas?Sí, lo tendría. Aquí tienes por qué:Si están enlazando a tu competidor (¡mucho!) seguramente podrías convencerles de que te enlazaran también a ti, ¿no? Esto es especialmente cierto si estás creando contenido parecido e incluso mejor que el de tu competidor.Si puedes conseguir que se hagan superfans de tu marca, también, probablemente te enlazarán a ti (¡mucho!). No enlazamos a Ryan porque nos lo pida, simplemente leemos su contenido, lo disfrutamos y acabamos referenciándolo en nuestros posts.Aquí tienes una forma fácil de encontrar a los superfans de tus competidores:Ve al Site Explorer -> introduce el dominio de tu competidor -> Mejor por EnlacesDespués añade un filtro de estado HTTP para limpiar los resultados.Copia las primeras diez URLs y pégalas en la herramienta de Link Intersect.Nota al margen. La herramienta Link intersect está disponible en la cuenta Ahrefs Standard o superior.¡IMPORTANTE! Asegúrate de elegir “URL” en el desplegable. Y elige el “muéstrame quién está enlazando a cualquiera de los objetivos de abajo” en lugar de “muéstrame quién está enlazando a todos los objetivos de abajo”.Dale a “Mostrar oportunidades de enlace”.Puedes ver que somos un superfan, porque enlazamos a siete de las diez páginas más enlazadas de Ryan. Pero parece que Matthew Woodward es también un superfan, ya que también enlaza a cuatro de las páginas.Nota al margen. No son visibles en la captura de arriba, pero Robbie Richards y Nathan Gotch (Gotch SEO) también parecen ser superfans, ya que cada uno enlaza a tres de los posts de RyanEn conclusión: está bien forjar relaciones con los llamados superfans de tus competidores—aquellos con los que tienes relaciones genuinas y que casi seguro que te enlazarán en un momento u otro.4. Detecta Oportunidades de Enlace Fácilmente Replicables Encontrando Sitios Que Enlazan a Más de Un CompetidorSi un sitio enlaza a más de uno de tus competidores probablemente querrás intentar conseguir un link de ese sitio.Estos “hubs” o centros pueden ser un terreno fértil para construir enlaces.Así que vamos a cambiar de tercio por un momento y asumir que tengo una web que vende cuadricópteros.¿Cómo puedo encontrar sitios que enlacen a 2 o más de mis competidores?Fácil. Usa el Link Intersect de Ahrefs.Aquí está el proceso:Ve a la herramienta Link Intersect -> introduce todos los competidores a nivel de dominio (de la hoja de cálculo) -> elige “todos los objetivos de abajo” -> Mostrar oportunidades de enlaceEn este caso, encontramos 14 dominios que enlazan a todos nuestros competidores.La mayor parte de estos enlaces son de foros pero a menudo verás webs como YouTube, Reddit y Pinterest (como sitios para compartir imágenes).Para ver enlaces individuales, haz click en los números.En el ejemplo de arriba, Link Intersect encontró 14 sitios que enlazan a los cinco dominios. Ya los comprobé todos y descubrí que:12 de los dominios eran foros;2 eran basura.Fácilmente podríamos coger 12 de estos enlaces (es decir, los de los foros).Y antes de que digas “los enlaces de foros” son basura…Estos son enlaces de foros relevantes de nicho—del tipo donde nuestros clientes potenciales probablemente pasan el rato.Y ahí es exactamente donde queremos promocionar nuestro negocio.Nuestros clientes están ahí. Nuestros competidores están ahí. ¡Así que deberíamos estar ahí también!Pero espera, podemos abrir la búsqueda incluso más: repite la búsqueda con la herramienta Link Intersect configurada para mostrar sitios que enlacen a CUALQUIERA de los dominios.Herramientas > Link Intersect > Introduce los dominios > Establece en “cualquiera de los objetivos de debajo” > Mostrar oportunidades de enlaceEsta vez recibiremos muchos más resultados—ordenados por el número de intersecciones.Nota al margen. Por el número de intersecciones nos referimos al número de competidores (de los cinco que hemos introducido) que cada sitio enlaza. A medida que te mueves por la lista, te darás cuenta de que este número poco a poco empieza a reducirse, hasta que llegas a sitios que solo tienen una intersección—es decir, solo enlazan a uno de tus competidores. En general, los enlaces fácilmente replicables probablemente estén en el rango de más de 3 intersecciones.Trabajando en esta línea con este informe encontrarás algunas oportunidades de hacerte con enlaces.Y lo que es más, estos “hubs de enlaces” pueden también darte información de valor en un nicho. Ya he mencionado los foros arriba, pero también puedes descubrir:Sitios de noticias o blogs que hablen de tu sector;Comunidades o portales específicos de tu sector (por ejemplo, inbound.org en marketing);Directorios sectoriales específicos de calidad.En resumen: todos estos son lugares donde tus clientes potenciales están. ¡Y todos son lugares en donde deberías promocionar tu negocio en el futuro!5. Roba enlaces de los Competidores a Nivel de Página (¡Creando Algo Incluso Mejor!)Todos estamos familiarizados con la técnica del rascacielos, ¿no?Encuentra el contenido más enlazado de tu competidor > crea algo incluso mejor > roba sus enlaces.Es una gran forma de saquear enlaces entrantes porque ya tienes una lista de sitios a los que contactar una vez que tu contenido es público.Aquí tienes cómo encontrar el contenido más popular de tu competidor con Ahrefs:Site Explorer -> introduce un competidor a nivel de dominio -> Páginas -> Mejor por enlacesSIDENOTE. De nuevo, merece la pena añadir un filtro de estado HTTP 200 para limpiar las cosas un poco.Como puedes ver, esto normalmente arrojará unos pocos resultados irrelevantes como la página home de tu competidor o su blog. Pero hay algunas buenas oportunidades ahí:Guía SEO para Principiantes (Search Engine Optimization) [7.850 Dominios de referencia]—nosotros estamos de acuerdo en que esta guía de Moz es fantástica, pero tenemos una guía igual de excelente para aprender SEO en nuestro blog. Así que, efectivamente, ya tenemos el contenido “rascacielos” creado.Historia de los Cambios del Algoritmo de Google [5.703 Dominios de referencia]—esta es otra pieza fantástica de contenido, pero es muy extensa. Quizá podríamos publicar una versión más resumida (por ejemplo “Todo lo que Necesitas Saber Sobre los Cambios en el Algoritmo de Google (en X minutos)”).Estas son ideas muy en bruto, pero puedes ver cómo funciona; hacemos algo mejor y pillamos los enlaces para nosotros.Consejo rápido: Encuentra más enlaces para robar de otras páginas parecidasHas encontrado una página con un montón de enlaces entrantes (que podemos robar).Pero, ¿por qué limitarte a robar enlaces de solo una página?Aquí va un truco fácil para ampliar tus horizontes:Keywords Explorer -> pega el título de la página -> Vista general de la SERP Esto te mostrará el top 10 de páginas en ese tema.Te darás cuenta de que, en la mayor parte de los casos, los otros nueve resultados son muy similares a la página que encontraste originalmente (en el informe de Mejor por enlaces).Y estas páginas es probable que también tengan multitud de enlaces entrantes.¡Así que también puedes robar estos enlaces!En resumen: encuentra el contenido más popular de tus competidores, haz algo mejor, después roba sus enlaces. (Y si quieres incluso más oportunidades de enlaces, encuentra páginas parecidas de la competencia ¡y roba también sus enlaces!)6. Sigue los NUEVOS Backlinks de Tus Competidores… Y Después Ve a por Nuevas oportunidadesMuchos de tus competidores atraerán nuevos enlaces entrantes con regularidad.Pero esto es algo malo, ¿no? No siempre.Aquí hay dos razones:Prueba que la gente está enlazando en tu nicho—algunos nichos son muy reacios a enlazar; si tus competidores pueden conseguir enlaces, quiere decir que hay links que se pueden conseguir. (A menos que los estén comprando, claro).Te provee con un flujo constante de nuevos enlaces con los que hacerte—¿los competidores están atrayendo enlaces a lo loco? ¡Hazte con ellos!Puedes hacer esto estableciendo alertas para los nuevos enlaces entrantes de tus competidores.Aquí tienes cómo:Alertas -> Enlaces -> Añadir AlertaAquí puedes añadir el dominio (o URL) que desees monitorizar, elegir la frecuencia de las alertas y listo.Pero aquí está el tema:Si el competidor al que quieres echar un ojo tiene una web fuerte, popular que recibe miles de enlaces cada semana, va a ser muy difícil que revises todos los enlaces que Ahrefs reportará.Eso es por lo que es mucho más lógico establecer alertas para URLs concretas (es decir, competidores a nivel de página).Pongamos que estamos intentando atraer nuevos enlaces a nuestra listas de consejos SEO.Podríamos establecer alertas de enlaces para estas páginas específicas:Nota al margen. ¡Ahora ves por qué registramos competidores a nivel de página en nuestra Google Sheet! 🙂Después, tan pronto como Ahrefs te mande una nueva notificación, contacta a la página que enlaza y explica que tu contenido es mejor, lo que implica que se merece más su enlace (nota: tu contenido debe ser objetivamente mejor, en otro caso, ni te molestes en contactar).En resumen: ahora tendrás una lista casi inagotable de oportunidades para hacerte con enlaces que se envía directamente a tu bandeja de entrada cada día/semana/mes/etc. ¡IMPORTANTE! Tienes que reaccionar a estas oportunidades frescas tan rápido como puedas. Es más probable que el autor o editor esté más dispuesto a modificar contenido recién publicado, así que ¡no pierdas el tiempo!7. Encuentra los Enlaces Rotos de tus Competidores… ¡Y Píllalos para Ti Mismo!El broken link building tiene mala fama.Pero todavía puede dar resultados… ¡Y excelentes!Un buen lugar para empezar es comprobar enlaces rotos que apunten a tus competidores. Podemos hacer eso con Ahrefs.Volviendo a los cuadricópteros por un momento, aquí va un ejemplo rápido:Site Explorer -> introduce el dominio de un competidor -> Páginas - Mejor por Enlaces -> añade un filtro 404 (Esa última parte —el filtro 404—es la auténtica gema aquí; significa que verás las páginas rotas con más enlaces entrantes en el sitio).Un click en el número de dominios de referencia te mostrará qué webs enlazan a estas páginas rotas.Esta oportunidad tiene buena pinta:Parece que había una Guía de Compra de Drones en droneflyers.com y esta página todavía la enlaza. Así que podríamos crear nuestra propia guía y contactar el sitio, ofreciendo nuestro contenido como una solución para su enlace roto.De hecho, podríamos hacer eso para todas las webs que tengan enlaces a esa página muerta.Cuatro enlaces puede que no parezca una gran victoria, pero recuerda, este no era la única página rota.Lo que es más, a veces tendrás suerte y descubrirás una página rota con cientos o incluso miles de enlaces.Lecturas complementariasUna Guía Fácil (Pero Completa) para el Broken Link Building (en inglés).En resumen: encuentra páginas rotas con un montón de enlaces en tu nicho, replica el contenido (si no tienes algo parecido) y ¡hazte con los enlaces!Una Guía Rápida para Calificar y Priorizar EnlacesSolo porque PUEDAS replicar los enlaces entrantes de tus competidores no quiere decir necesariamente que DEBAS.Algunos pueden ser basura.Otros pueden ser buenos enlaces, pero casi imposibles de replicar.Eso es por lo que necesitas calificar y priorizar todas las oportunidades.Calificar es fácil… Pregúntate esto: ¿si Google revisara manualmente la página tendrían un problema con el enlace? ¿Parece natural?”.Priorizar es algo más difícil… El hecho de que quieras el enlace no quiere decir que (a) lo merezcas, (b) sea fácil de replicar.Deberías, por tanto, enfocarte en enlaces que de verdad puedes conseguir (y que es probable que consigas).Aquí está lo básico:Enlaces que probablemente puedas conseguir—enlaces de páginas de recursos relevantes para tu nicho, posts invitados, foros, citas/testimonios, comentarios en el blog (sí, ¡todavía hay algunos que merece la pena tener solo por el tráfico de referencia!), etc.Enlaces que probablemente no serás capaz de conseguir: enlaces donde se tuvo que hacer algo especial para conseguir un enlace, como lanzar una campaña de PR cara o asistir a un evento (en el pasado).Enlaces que seguro que no podrás conseguir: enlaces que son parte de una red de blogs, o enlaces pagados (estos son enlaces que probablemente no quieras de ninguna forma).Siendo sincero, necesitas usar tu propio criterio para esto. Un enlace que es un encaje perfecto para un sitio puede ser horrible para otro.No persigas enlaces spameros de baja calidad—no te ayudarán nada.¿Ves algún patrón? ¡Es algo bueno!Replicar los enlaces entrantes de tus competidores está bien, pero hay una meta más profunda: entender cómo tus competidores construyeron sus enlaces en conjunto.Esto quiere decir que no debes mirar los enlaces de forma aislada, en su lugar necesitas una perspectiva de alto nivel de las estrategias y tácticas que la competencia usa con éxito.Haz esto y entenderás en qué tácticas de link building (y tipos de contenido) deberías enfocarte en el futuro.Lecturas complementariasEl Formato Visual Que Deberías Usar para Link Building (No, NO son Infografías) - en inglés.Deconstruyendo el Linkbait: Cómo Crear Contenido Que Atraiga Enlaces - en inglés.3 Técnicas de Link Building White Hat que Van Más Allá de los Enlaces - en inglés.Cómo Conseguir Enlaces y Conseguir Cobertura usando HARO [Caso de Estudio] - en inglés.Así que, ¿cómo haces esto?Bien, si sigues todos los consejos de arriba, probablemente no tendrás que hacer un esfuerzo especial para entender qué funciona y qué no en tu sector; aprenderás como resultado de seguir las tácticas concretas de arriba.Puede que te des cuenta de que tus competidores están escribiendo muchos posts invitados.O que están recibiendo enlaces de muchos foros sectoriales (como foros de coches).O que, por cualquier motivo, tu sector ama enlazar posts de listas o infografías o casos de estudio.(Los casos de estudio y la investigación original suelen atraer muchos enlaces en la industria SEO, por ejemplo).Nota al margen. Esa página de arriba es la home, así que no cuenta; esto quiere decir que cuatro de nuestros seis posts más enlazados son estudios de algún tipo.En resumen: usa estos aprendizajes para influir no solo en las tácticas de link building que persigas, si no también para el tipo de contenido que crees en el futuro.Pensamientos finalesEs posible conseguir algunos grandes enlaces haciéndote con los enlaces entrantes de tus competidores.Pero es poco probable que los vayas a desbancar haciendo solo esto—siempre estarán un paso por delante.En realidad, lo mejor que puedes esperar cuando saqueas los enlaces de tus competidores es conseguir un porcentaje decente (¿20-30%?) de sus enlaces. Y si solo tienes una fracción de los enlaces que tus competidores tienen, bueno, probablemente no los vas a adelantar.Por eso deberías usar los enlaces de tus competidores como una “base”, y después utilizar otras tácticas de link building para conseguir MÁS enlaces que tus competidores.Haz esto ¡y serás imparable! 🙂Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software, como el “Estado del WhatsApp Marketing 2020”. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "7 Formas Accionables de Saquear los Enlaces de Tus Competidores"
    },
    {
      "level": "H2",
      "text": "Cómo identificar a tus competidores (pista hay DOS “tipos” distintos)"
    },
    {
      "level": "H3",
      "text": "1. Competidores a nivel de dominio"
    },
    {
      "level": "H3",
      "text": "2. Competidores a nivel de página"
    },
    {
      "level": "H2",
      "text": "1. Descubre MILES de oportunidades potenciales de enlaces investigando los enlaces a la home de tus competidores"
    },
    {
      "level": "H2",
      "text": "2. Encuentra los Posts Invitados de tus Competidores… ¡Después Escribe para los MISMOS Sitios!"
    },
    {
      "level": "H3",
      "text": "Método 1: Usa búsquedas avanzadas de Google"
    },
    {
      "level": "H3",
      "text": "Método 2: Usa búsqueda inversa de imágenes"
    },
    {
      "level": "H3",
      "text": "Método 3: Usa el Content Explorer de Ahrefs"
    },
    {
      "level": "H2",
      "text": "3. Encuentra a Los “Superfans” De Tus Competidores…¡Y Después Entabla Relaciones Con Ellos!"
    },
    {
      "level": "H2",
      "text": "4. Detecta Oportunidades de Enlace Fácilmente Replicables Encontrando Sitios Que Enlazan a Más de Un Competidor"
    },
    {
      "level": "H2",
      "text": "5. Roba enlaces de los Competidores a Nivel de Página (¡Creando Algo Incluso Mejor!)"
    },
    {
      "level": "H2",
      "text": "6. Sigue los NUEVOS Backlinks de Tus Competidores… Y Después Ve a por Nuevas oportunidades"
    },
    {
      "level": "H2",
      "text": "7. Encuentra los Enlaces Rotos de tus Competidores… ¡Y Píllalos para Ti Mismo!"
    },
    {
      "level": "H2",
      "text": "Una Guía Rápida para Calificar y Priorizar Enlaces"
    },
    {
      "level": "H2",
      "text": "¿Ves algún patrón? ¡Es algo bueno!"
    },
    {
      "level": "H2",
      "text": "Pensamientos finales"
    }
  ],
  "author": "Joshua Hardwick"
}