{
  "url": "https://ahrefs.com/blog/es/consejos-seo/",
  "slug": "consejos-seo",
  "title": "12 consejos rápidos de SEO para aumentar el tráfico orgánico",
  "description": "¿Estás buscando una colección de consejos prácticos de SEO que puedas implementar fácilmente para mejorar la clasificación de los motores de búsqueda de tu sitio? Entonces no busques más.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La mayoría de las listas de consejos de SEO son bastante inútiles. Ofrecen consejos genéricos como “redactar mejor contenido” y “mejorar la experiencia del usuario”, y te abruman con cientos de ellos..Si has leído esta publicación en el pasado, sabrás que este es un error que cometimos antes.Antes de volver a publicar, enumeraba más de 200 consejos de SEO mediocres.Así que decidimos reescribir la publicación y enfocarnos solo en los consejos más prácticos que puedes hacer en 15 minutos o menos.Estos son los consejos de SEO:Mejorar el contenido existente con subtemas faltantesEnvíe correos electrónicos a todas las personas a las que vinculaAgregar enlaces internos a páginas nuevasRealizar una auditoría de contenido anualReutilizar publicaciones de blog como videosResponder a las solicitudes de HARO relevantesSupervise los vínculos de retroceso de la competencia para detectar contenido de bajo rendimientoReparar páginas con backlinks rotosConvierte imágenes en backlinksInstalar un complemento de almacenamiento en cachéOptimizar para fragmentos destacados de ‘definición’Inserta tus videos en publicaciones relevanteshttps://www.youtube.com/watch?v=73lj6m6Xulc&feature=emb_title1. Mejorar el contenido existente con subtemas faltantesLa mayoría de los primeros borradores no son perfectos. Es casi seguro que perderás puntos importantes, que pueden obstaculizar la capacidad de tu página a clasificar en los motores de búsqueda.Entonces, esto es lo que puedes hacer:Conecta las URL de las dos o tres páginas de mayor rango para tu palabra clave objetivo principal en la herramienta Content Gap de Ahrefs. Luego, ingresa la URL de tu página en la parte inferior. Haz clic en “Mostrar palabras clave” y verás las palabras clave para las que se clasifican una o más de las páginas de mayor rango, pero no las ves.Parece que una de las otras páginas de clasificación superior se clasifica para búsquedas relacionadas con cómo y dónde agregar marcado de esquema.Pero no clasificamos para esas palabras clave porque no cubrimos los subtemas en nuestra publicación.Si rectificamos ese problema cubriendo el tema en la publicación, es probable que también podamos clasificar esas palabras clave. Aún mejor, hacer esto puede ayudar a mejorar nuestra clasificación de palabras clave principal porque Google verá la página como más completa.2. Envía correos electrónicos a todas las personas con las que se vinculaLos backlinks son un factor de clasificación importante, pero la construcción de enlaces puede ser una tarea ardua. Tienes que encontrar prospectos, examinarlos, encontrar sus correos electrónicos y luego, de alguna manera, convencerlos de que se vinculen contigo.Si eso suena desalentador, una forma más fácil de comenzar es enviar correos electrónicos a todas las personas a las que se vinculas.Por ejemplo, recomendamos un montón de herramientas de construcción de enlaces en esta publicación.Sería bastante fácil comunicarse con sus fundadores o gerentes de marketing y hacerles saber la recomendación.Así es como podría verse eso para Buzzstream:Hola, [nombre]:Soy usuario de Buzzstream desde hace mucho tiempo y superfan de su herramienta. Solo quería hacerles saber que les recomendé a todos en nuestra última publicación sobre herramientas de construcción de enlaces. Espero que envíe algunos clientes bien merecidos a su web.Salud,JoshTen en cuenta que no debes solicitar un enlace en este correo electrónico. Ese no es el punto de este consejo. El punto es hacer contacto y comenzar una conversación. Si tu contenido es único y está bien escrito, a menudo recibirá cumplidos. Eso naturalmente conduce a oportunidades compartidas y, a veces, enlaces como publicaciones de invitados y otras colaboraciones.3. Agregue vínculos internos a páginas nuevasLos enlaces internos son vínculos de retroceso de una página a otra en su sitio web. Ayudan a los visitantes a navegar de una página a otra, distribuyen la “autoridad del enlace” en todo su sitio, y Google también utiliza su texto de anclaje para comprender el contexto.La mayoría de los enlaces proporcionan un poco de contexto adicional a través de su texto de anclaje. Al menos deberían, ¿verdad?— 🍌 John 🍌 (@JohnMu) November 23, 2017El problema es que cada vez que publica una página nueva, tendrá pocos o ningún enlace interno. Entonces, si desea que su página tenga la mejor oportunidad de clasificar, tiene sentido agregar algunas.Para encontrar oportunidades relevantes, busca en Google site: tuweb.com “palabra clave”.Por ejemplo, si quisiéramos agregar enlaces internos a una publicación recién publicada sobre las mejores prácticas de SEO, buscaríamos algo comosite:ahrefs.com/blog \"seo best practices\".Cada resultado aquí es una página en nuestro sitio que contiene la frase “mejores prácticas de SEO”.Si hay muchos resultados relevantes, instala la barra de herramientas SEO de Ahrefs. Esto superpondrá las métricas de SEO en los resultados de búsqueda. Luego, puedes observar la clasificación de URL de cada página para priorizar la adición de enlaces internos de las páginas de mayor autoridad.Aquí hay una buena oportunidad de enlace interno en nuestra publicación sobre por qué el SEO es importante:4. Realiza una auditoría de contenido anualLas auditorías de contenido implican analizar todas las páginas de tu sitio web para ver si deben mantenerse como están, actualizadas, consolidadas o eliminadas.Después de nuestra última auditoría de contenido en el blog de Ahrefs, eliminamos 48 publicaciones de blog.¿Disminuyó nuestro tráfico? No Aumentó en un 7.57%.Si tu sitio se ejecuta en WordPress, la forma más fácil de realizar una auditoría de contenido es con el complemento gratuito de WordPress de Ahrefs. Instálalo, sigue las instrucciones y te dará sugerencias de acciones para todas sus publicaciones y páginas.IMPORTANTE. Estas son sugerencias, no instrucciones. DebeS evaluar cada página individualmente y nunca eliminar aquellas que son importantes para Tu negocio, incluso si tienen poco o ningún valor de SEO.Si no estáS usando WordPress, usA las instrucciones y la plantilla de Hojas de cálculo de Google en esta publicación para hacer lo mismo.5. Reutiliza las publicaciones de blog como videosLa gente disfruta de diferentes formatos de contenido según sus preferencias personales. A algunos les gustan los videos donde otros prefieren leer. Por lo tanto, una manera fácil de llegar a una audiencia más amplia es reutilizar las publicaciones de blog como videos.Por ejemplo, el año pasado, publicamos una publicación de blog sobre posicionarse mejor en Google, que luego reutilizamos como un video.https://www.youtube.com/watch?v=Rm1MbJneLSI&feature=emb_title¿Cómo averiguar qué publicaciones de blog son las mejores para reutilizar?Si la publicación ya recibe mucho tráfico orgánico, entonces es un buen candidato para la reutilización. ¿Por qué? Porque luego puedes incrustar el video en la publicación de su blog para atraer a más visitantes.También debes considerar la posibilidad de reutilizar publicaciones sobre temas que la gente busca en YouTube.Por ejemplo, si comprobamos la palabra clave “SEO local” en el Explorador de palabras clave de Ahrefs y cambiamos el motor de búsqueda a YouTube, vemos que obtiene unas 500 búsquedas mensuales en los EE. UU.Es por eso que reutilizamos nuestra publicación sobre SEO local como un video.La reutilización de publicaciones de blog en videos también puede ayudarlo a reclamar múltiples lugares en los resultados de búsqueda de Google gracias al carrusel de videos.6. Responder a las solicitudes pertinentes de HAROHARO es un servicio que conecta a periodistas con fuentes. Es gratis registrarse y cuando lo haga, recibirá correos electrónicos diarios con solicitudes de periodistas.Por ejemplo, aquí está Bankrate (DR 89) buscando un experto bancario para responder algunas preguntas sobre los CD sin penalización:Al recibir este correo electrónico, todo lo que necesitas hacer es verificar que cumples con los requisitos y responder al correo electrónico. Si usan tu respuesta en su publicación, generalmente te acreditarán con un enlace externo.El problema con HARO es que envían tres correos electrónicos al día. Dado que la mayoría de las solicitudes no serán relevantes para ti, eso puede resultar abrumador.Afortunadamente, este problema se resuelve fácilmente con los filtros de Gmail.Esto es lo que debe hacer:Una vez que te hayas registrado en HARO y te hayas suscrito a los temas que te interesan, dirígete a tu Gmail y presiona el símbolo de intercalación en la barra de búsqueda. En el campo “De”, ingresa [email protected], ingresa “[HARO]” en el campo “Asunto”, y luego ingresa la palabra clave o palabras clave que deseas monitorear en el campo “Tiene las palabras”.A continuación, presiona buscar y verifica algunos resultados para asegurarte de que sean relevantes. Si es así, presiona el cursor y haz clic en “Crear filtro”.Luego, tendrás opciones para marcarlo como importante, aplicar etiquetas o reenviarlo a otro miembro del equipo para que se encargue.7. Supervisar los backlinks de la competencia para detectar contenido de bajo rendimiento.Si aún no estás en el primer puesto para su palabra clave objetivo, entonces podría deberse a que los competidores tienen vínculos de retroceso de mayor calidad. Puedes tener una idea de si este es el caso con el verificador SERP gratuito de Ahrefs.Si las páginas que te superan en rango tienen más sitios web vinculados a ellas (dominios de referencia), te podría estar frenando.Una forma de comenzar a solucionar este problema es monitorear a las personas que enlazan a contenido que no lo merece y luego tratar de que esas personas enlazen hacia ti.¿Cómo? Primero, abre algunas páginas de alto rango con vínculos de retroceso y busca información inexacta, desactualizada, engañosa o faltante (que cubre tu contenido). Básicamente, estás buscando áreas en las que tu página supere a la de ellos.Por ejemplo, la lista de operadores de búsqueda de Google de Moz tiene toneladas de enlaces, pero faltan muchos operadores como define :, cache: y site :.Armado con esta información, el siguiente paso es crear una nueva alerta de backlinks en las Alertas de Ahrefs. Simplemente pega la URL de tu competencia, luego configura el Alcance en “Nuevos enlaces externos” y la frecuencia de alerta en diaria o semanal.Busca en cada correo electrónico de alerta los enlaces que te mereces más que tu competidor.Por ejemplo, esta página se vinculó recientemente a la lista de operadores de Moz cuando se habla del sitio: operador, aunque Moz no incluye ese operador en su página:Debido a que tendría más sentido para ellos hacer referencia a nuestra página, valdría la pena contactarlos para ver si consideran cambiar el enlace.8. Reparar páginas con vínculos de retroceso rotosLos backlinks a páginas muertas se desperdician. No ayudan a la clasificación de la página porque ya no existen, y probablemente tampoco ayudan a otras páginas a clasificar mucho.¿Cómo saber si tienes backlinks rotos?Filtra por páginas 404 en el informe Best by Links en Site Explorer de AhrefsSi hay páginas con dominios de referencia, entonces los enlaces externos están rotos.Hay tres formas de solucionar estos problemas:Restablecer: si la página muerta se eliminó por error, vuelve a colocarla. Todos los backlinks apuntarán a una página que funciona.Redirigir: si la página muerta existe en una nueva URL, redirige la antigua URL a la nueva. Si la página anterior ya no existe, pero tiene una página similar en su sitio, redirije allí la URL anterior. Lee esto para aprender a realizar redireccionamientos.Solicita un cambio de enlace: si alguien cometió un error al enlazar tu página (por ejemplo, agregó un espacio al final de la URL), entonces vale la pena comunicarse para informarle.Solo debes saber que solo vale la pena solucionar estos problemas si las páginas muertas tienen enlaces externos de alta calidad. Si no es así, generalmente está bien dejarlos como 404.Puedes comprobar la calidad de los vínculos de retroceso de una página en el informe de vínculos de retroceso.Por ejemplo, esta URL muerta tiene un par de enlaces externos:Pero si miramos los backlinks reales, vemos que son basura y no vale la pena preocuparse por ellos:Por otro lado, esta URL muerta tiene algunos backlinks de alta calidad, por lo que vale la pena redireccionarla:9. Convierte imágenes en backlinksSi tienes ilustraciones o infografías personalizadas en su sitio, es muy probable que otros las utilicen en su contenido.Por ejemplo, aquí hay un gráfico de nuestra publicación sobre palabras clave de cola larga en otro blog:La mayoría de las veces, las personas enlazan a la fuente de la imagen cuando usan sus imágenes, pero no siempre. Y ese es el caso aquí. Si verificamos el código fuente de esa página, no hay ningún enlace a ahrefs.com.Otro problema común son las personas que enlazan directamente a la imagen en lugar de a la página de la que proviene.Por ejemplo, si verificamos el código fuente de otra página donde aparece esa ilustración, están vinculados al archivo PNG.Ninguna de estas situaciones es ideal. Si ves a personas haciendo esto, vale la pena comunicarse y pedirles amablemente que agreguen o corrijan el enlace de la fuente.Pero, ¿cómo encontrar personas que usan tus imágenes sin la atribución adecuada en primer lugar?Una forma es hacer clic con el botón derecho en una imagen de su sitio y luego hacer clic en “Buscar imagen en Google”.Verifica los resultados para ver si enlazaron hacia ti. Si no es así, comunícate.Aquí hay otra forma:Pega tu sitio web en el Explorador de sitios de Ahrefs, ve al informe de enlaces externos y luego busca enlaces con .png o .jpg en las URL.Si hacemos esto para el blog de Ahrefs, vemos cientos de sitios enlazados directamente a imágenes.Nota al margen. Site Explorer solo encuentra instancias en las que las personas enlazan a los archivos de imagen en lugar de a las páginas. No encontrará sitios que hayan usado tus imágenes sin vincularlos a su sitio. Tendrás que usar Google para eso.10. Instala un complemento de almacenamiento en cachéEl almacenamiento en caché ayuda a acelerar tu sitio web para los visitantes, y hay un par de razones por las que eso es importante:Primero, la velocidad de la página es un factor de clasificación tanto en dispositivos móviles como en computadoras de escritorio.En segundo lugar, la probabilidad de que un visitante rebote aumenta a medida que aumenta el tiempo de carga de la página.Aunque muchos factores afectan la velocidad de la página, la instalación de un complemento de almacenamiento en caché es una ganancia rápida y fácil que toma dos minutos.Para hacerlo en WordPress, inicia sesión en su backend, luego ve a:Complementos> Agregar nuevo> buscar “WP Super Cache”> Instalar> ActivarFinalmente, ve a la página de configuración del complemento y asegúratge de que el almacenamiento en caché esté activado.11. Optimiza para los fragmentos destacados de “definición”La mayoría de las búsquedas de definiciones muestran un fragmento destacado como este:Google extrae esta información de una de las páginas de mayor rango. En este caso, proviene de nuestra publicación de blog sobre SERP.Pero aquí está la cuestión: si no tuviéramos una definición en nuestra página, no podríamos aparecer en el fragmento. Google sabe que los buscadores están buscando una definición, por lo que extraerá de una página con esa información.Entonces, esto es lo que puede hacer:Ingresa tu dominio en el Explorador de sitios de Ahrefs, ve al informe de Palabras clave orgánicas y luego filtra las 10 clasificaciones principales con fragmentos destacados.A continuación, filtre las palabras clave “qué es” y “qué son” mediante el filtro Incluir.Revisa los resultados y asegúrate de que haya una definición relevante en cada página.Por ejemplo, nos ubicamos en la posición nueve para “qué son los blogs invitados” …… pero no hay forma de que podamos poseer el fragmento porque no hay una definición en la página:Al agregar una definición clara a esa publicación, existe la posibilidad de que podamos clasificar en el fragmento destacado y obtener más tráfico.Lectura recomendada: Cómo optimizar los fragmentos destacados de Google en 202012. Inserta tus videos en publicaciones relevantes¿Alguna vez has notado que hay una pestaña “Videos” en la búsqueda de Google?Lo interesante de esta pestaña es que no solo muestra videos de YouTube. También muestra páginas de resultados web con incrustaciones de video relevantes.Por ejemplo, echa un vistazo a la pestaña Videos para “marketing de afiliación”:El resultado principal es este video, que subimos a YouTube:https://www.youtube.com/watch?v=W-nbsnXtSZI&feature=emb_titlePero el resultado no lo lleva a un video de YouTube. Lo lleva a nuestra publicación sobre marketing de afiliados, donde incorporamos ese video.Si verificamos los datos en Google Search Console, vemos que nuestros videos incrustados son responsables de 46,000 visitas durante los últimos tres meses.Es cierto que ese es un pequeño porcentaje de nuestro tráfico de búsqueda orgánica (aproximadamente el 2%), pero ciertamente no nos quejamos de las 15.000 visitas adicionales al mes por tan poco esfuerzo.Además, si tu sitio está en un nicho muy visual como las recetas, probablemente verás un impulso aún mayor.ConclusionesNinguno de estos consejos debería tomar más de 15 minutos. Podrías implementarlos todos en tres horas. Eso no es mucho, considerando el impacto que deberían tener.¿Hay algo más que puedas hacer para impulsar el tráfico? Absolutamente. Lee esto para obtener más ideas.¿Tienes preguntas sobre los consejos anteriores? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "12 consejos rápidos de SEO para aumentar el tráfico orgánico"
    },
    {
      "level": "H2",
      "text": "1. Mejorar el contenido existente con subtemas faltantes"
    },
    {
      "level": "H2",
      "text": "2. Envía correos electrónicos a todas las personas con las que se vincula"
    },
    {
      "level": "H2",
      "text": "3. Agregue vínculos internos a páginas nuevas"
    },
    {
      "level": "H2",
      "text": "4. Realiza una auditoría de contenido anual"
    },
    {
      "level": "H2",
      "text": "5. Reutiliza las publicaciones de blog como videos"
    },
    {
      "level": "H2",
      "text": "6. Responder a las solicitudes pertinentes de HARO"
    },
    {
      "level": "H2",
      "text": "7. Supervisar los backlinks de la competencia para detectar contenido de bajo rendimiento."
    },
    {
      "level": "H2",
      "text": "8. Reparar páginas con vínculos de retroceso rotos"
    },
    {
      "level": "H2",
      "text": "9. Convierte imágenes en backlinks"
    },
    {
      "level": "H2",
      "text": "10. Instala un complemento de almacenamiento en caché"
    },
    {
      "level": "H2",
      "text": "11. Optimiza para los fragmentos destacados de “definición”"
    },
    {
      "level": "H2",
      "text": "12. Inserta tus videos en publicaciones relevantes"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}