{
  "url": "https://ahrefs.com/blog/es/creacion-contenido/",
  "slug": "creacion-contenido",
  "title": "Creación de Contenido: La Guía Completa para Principiantes",
  "description": "La creación de contenidos es el proceso de encontrar temas para atraer a tu audiencia objetivo, y después planificar, crear y publicar contenido sobre esos temas.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido En los tres últimos años hemos publicado:256 posts en el blog 181 vídeos en YouTube (33 en el canal en español)260 newsletters+3.000 tuits3 cursosVale, ni de lejos soy la única persona responsable de toda esta producción. Pero creo que puedo decir que nuestro equipo sabe una cosa o dos sobre crear y escalar contenido.En esta guía aprenderás a hacer lo mismo para tu negocio, paso a paso.Pero primero, vamos a asegurarnos de que estamos en la misma página…¿Qué es la creación de contenido?¿Por qué es importante crear contenido?Cómo crear contenidoCómo escalar la creación de contenido¿Qué es la creación de contenido?La creación de contenido es el proceso de encontrar temas para atraer a tu audiencia objetivo, y después planificar, crear y publicar contenido sobre esos temas.¿Por qué es importante crear contenido?El contenido es importante porque es un mecanismo efectivo para introducir y hacer avanzar a la gente en tu embudo de marketing Si no estás familiarizado con el concepto de embudo de marketing (o funnel de marketing), es una representación visual del proceso de atraer y retener clientes.Aquí va cómo funciona:La gente primero descubre tu marca. Su interés y deseo crece hasta que consideran comprar lo que vendes. Con el tiempo, actúan y se convierten en clientes. Si tu producto o servicio les impresiona, se convertirán en clientes fieles y potencialmente incluso recomendarán tu marca.Pero aquí está el tema:No todos los que descubren tu marca desearán tu producto. No todo el mundo que desee tu producto considerará comprarlo. No todo el que considere comprar lo hará, y no todo el que compre se convertirá en un fiel partidario de la marca.Eso es por lo que el embudo de marketing tiene forma de embudo; la gente se cae del proceso en cada fase.¿Qué tiene esto que ver con el contenido?El contenido no solo tiene el poder de atraer a la gente a tu embudo de marketing, también de incrementar la eficiencia de tu embudo.Por ejemplo, nuestra guía de keyword research posiciona alto en Google en “keyword research” (investigación de palabras clave) y recibe unas 5.600 visitas de búsqueda estimadas al mes. Esto atrae a nuestra audiencia objetivo y mejora nuestro descubrimiento de marca:Pero no es lo único que hace esta guía. También crea interés y deseo por nuestro producto al mostrar a los lectores cómo pueden resolver sus problemas usando Ahrefs.Claro, la mayoría de lectores no considerarán comprar nuestro producto y actuartras leer este único post. Eso es por lo que tenemos cientos de posts de blog. Construimos interés y deseo a través de la exposición repetida a nuestro producto y marca.Para los lectores que alcanzan la fase de consideración de nuestro embudo, contenido como nuestra página “Ahrefs vs.” promueve la acción al mostrar cómo nuestro producto se compara favorablemente con la competencia.Para los que se convierten en clientes, nuestros posts en el blog, cursos y sección de ayuda dedicada promueven la fidelidad y recomendación enseñándoles cómo pueden sacar el mayor provecho de nuestro producto.Cómo crear contenidoEl proceso de crear contenido es más o menos el mismo para cada canal y lo veremos más abajo. Pero, primero, es importante entender que no deberías profundizar en la creación de contenido sin antes crear una estrategia de contenidos sólida.Tu estrategia de contenidos te mantiene en el camino adecuado y asegura que hay un propósito claro detrás de cada pieza de contenido que creas.Aquí tienes cómo crear contenido en tres pasos:Encuentra temas probadosElige un tipo y formato de contenidoPlanifica, crea y publica1. Encuentra temas probadosNo tiene sentido crear contenido por crear contenido. Sea lo que sea lo que planeas crear, necesitas asegurarte de que es algo que atraiga a tu audiencia objetivo.Cómo lo hagas depende del canal para que estés creando contenido.Si creas contenido para tu web o YouTube…… vas a querer hacer keyword research para encontrar los temas que la gente busca.Puedes publicar contenido sobre otros temas, pero te costará conseguir atención a no ser que ya tengas mucho tráfico o suscriptores, estés dispuesto a pagar publicidad o tengas un canal probado de distribución como una gran lista de email.La forma en que investigas temas es más o menos la misma para ambos canales:a) Haz brainstorming de temasToma un cuaderno y piensa sobre temas generales que puede que tu audiencia esté buscando. Si vendes cafeteras, puedes anotar cosas como “coffee” (café), “espresso” y “french press” (prensa francesa).b) Usa una herramienta de keyword research para ampliar a partir de tus ideasIntroduce los temas de tu brainstorming en una herramienta de keyword research como Keywords Explorer, elige Google o YouTube como tu motor de búsqueda y ve al informe de Matching terms (términos coincidentes).Revisa las palabras clave y añade todo tema prometedor para contenido a una lista de ideas de keywords.Por ejemplo, “best coffee maker” (la mejor cafetera) y “how to make whipped coffee” (cómo hacer café batido) son ideas de contenidos prometedoras para una tienda de café online. Son cosas que nuestra audiencia objetivo probablemente esté buscando y tienen volumen de búsquedas, así que las añadiremos a una lista de palabras clave.Añadiendo ideas a una lista de palabras clave en Keywords ExplorerSigue haciendo esto hasta que tengas 30-50 ideas potenciales de contenido.PRO TIPSi estás buscando ideas de contenido para una nueva web, a menudo merece la pena filtrar por palabras clave con puntuación de dificultad de palabra clave (Keyword Difficulty o KD) baja. Hablando en general, será fácil posicionarse en estas. Para hacerlo, establece el filtro de KD en un máximo bajo, como 10.c) Revisa a los competidoresLa gente tiene la tendencia de usar las mismas palabras clave “semilla” en las herramientas de keyword research, lo que significa que acabas con las mismas ideas de palabras clave que cualquiera. Esto no es necesariamente malo, pero te mantiene “dentro de la caja”.Por eso, también merece pena mirar sobre qué están creando contenido tus competidores.Si buscas ideas de contenido para tu página web, primero tienes que identificar a tus competidores. La forma más fácil de hacer esto es dirigirte a tu lista de palabras clave en Keywords Explorer, después ve al informe de Traffic Share by Domains (cuota de tráfico por dominios) para ver qué webs reciben la mayor parte del tráfico para esas palabras clave.Busca webs que parezca que están enfocadas en tu tema, después dale al símbolo de intercalación (^) y ve al informe de Top Pages (páginas principales) para ver cuáles de esas páginas atraen la mayor parte del tráfico estimado.En nuestro caso, vemos algunas buenas ideas de contenido con potencial de tráfico de búsqueda que no podríamos haber encontrado de otra forma, como: keurig troubleshooting (resolución de problemas keurig) nespresso reusable pods (cápsulas reutilizables nespresso) how to descale a keurig (cómo quitarle el sarro a keurig) how to steam milk (cómo vaporizar leche) nespresso vs keurig (nespresso vs keurig)Si quieres incluso más ideas, repite este proceso para más competidores. Simplemente ve al informe de Competing Domains (dominios competencia) en Site Explorer, busca sitios relevantes, dale al símbolo de intercalación para comprobar el tráfico estimado de búsqueda, después introduce el sitio en Site Explorer y revisa el informe de Top Pages (páginas principales).Si estás buscando ideas de contenido para YouTube, primero tienes que encontrar canales competidores. Haz esto buscando en YouTube un tema que ya hayas encontrado. Por ejemplo, si buscamos “how to make coffee in a cafetiere” (cómo hacer café en una cafetera de pistón) vemos unos cuantos canales relacionados con café.Después, revisa tus vídeos para encontrar temas que puede que se te hayan pasado.En nuestro caso, vemos vídeos relacionados con:moka potAeropressDIY whipped creambaratza encoreAhora podemos usarlas como palabras clave “semilla” en una herramienta de keyword research en YouTube, para encontrar incluso más temas que la gente está buscando.Si estás creando contenido para otros canales como redes sociales o email…… ese es un juego diferente. La gente en estas plataformas ya está suscrita a tu contenido, así que no necesitas necesariamente publicar cosas que estén buscando. Necesitas publicar cosas que encuentren interesantes.Nota al margen. Esto es también más o menos cierto para YouTube, ya que a menudo atraerás visualizaciones de vídeo de las recomendaciones de “sugerencias” en la barra lateral. Aquí van unas pocas formas de hacer eso: Comprueba tu analítica. La mayoría de herramientas de email marketing te dicen qué emails reciben la mayor parte de interacciones en términos de aperturas y clics y la mayoría de herramientas en redes sociales te dicen cuáles son las publicaciones que mejor funcionan. Usa estos datos para entender a tu audiencia. Comprueba el feedback de cliente. Busca consultas comunes en los tickets de soporte de cliente. Revisa las búsquedas internas. Mira lo que tus usuarios buscan en tu sitio usando Google Analytics. Pregunta o haz encuestas a tus clientes. Nadie sabe qué tipo de contenido quieren ver tus clientes mejor que tus clientes.También puedes usar keyword research para encontrar ideas, incluso aunque no crees contenido para un canal enfocado a búsqueda. Después de todo, si mucha gente busca algo, está claro que a mucha gente le interesa. Esos temas a menudo funcionarán bien en canales no enfocados en búsqueda, como redes sociales o email.2. Elige un tipo y formato de contenidoAsumiendo que has elegido un tema de tu lista de ideas, el próximo paso es decidir el tipo y el formato del contenido que vas a crear.Tipo de contenidoSi creas contenido para YouTube, el tipo de contenido ya está decidido: vídeo. Es lo mismo en el caso del email y redes sociales: estarás escribiendo algún tipo de email o publicación en redes sociales.Pero si creas contenido para tu web, tienes unas pocas opciones distintas, incluyendo:Post de blogPágina de productoPágina landingHerramienta interactivaArtículo de wiki/ayudaEl mejor tipo de contenido para la tarea dependerá del tema y propósito de tu contenido.Por ejemplo, si quisiéramos compartir algunos consejos SEO, un post para el blog sería el mejor tipo de contenido porque su propósito es incrementar el reconocimiento de marca y educar a clientes potenciales. No tendría sentido como página landing o herramienta interactiva, y no sería práctico ocultarla en una wiki destinada para clientes.Si quisiéramos crear contenido sobre cómo Ahrefs queda en comparación con su competencia, una página landing es quizá el mejor formato. El propósito de este contenido no es en realidad incrementar el reconocimiento de marca; es alimentar el interés e incitar a la compra.Si quisiéramos crear contenido explicando cómo usar una funcionalidad individual en Ahrefs, probablemente crearíamos un artículo para wiki, porque el propósito del contenido es retener a clientes y la fidelidad de marca.Si el tipo de contenido más apropiado no te resulta obvio de forma inmediata desde el teclado, abre una ventana de incógnito, busca tu palabra clave y mira el tipo de contenido dominante en la SERP.Si hacemos esto para “SEO tips” (consejos SEO) podemos deducir por los títulos, URLs y descripciones que todos los resultados son posts de blog:Los resultados de búsqueda de “SEO tips” son todos posts de blog.Si hacemos esto para “keyword rank tracker” (una herramienta para monitorizar tu posicionamiento en buscadores), los resultados son sobre todo páginas landing con herramientas interactivas:Los resultados de búsqueda de “keyword rank checker” son sobre todo páginas landing con herramientas interactivas.PRO TIPUsa la barra de herramientas SEO de Ahrefs para simular una búsqueda en el país e idioma al que te diriges de forma gratuita.Formato de contenidoIncluso aunque tu canal elegido limite el tipo de contenido que puedes crear, normalmente tienes unas pocas opciones en lo referente al formato de contenido, incluyendo:Cómo hacer o “How-to”TutorialListicleGuíaNoticia/actualizaciónHistoria de marcaEncuestaReview / análisisSi estás creando contenido para redes sociales o email, no existe una regla definida y rápida para el mejor formato de contenido. Simplemente elige el que te parezca más apropiado para el tema.Si estás creando contenido para tu web o YouTube, los resultados de búsqueda pueden ayudarte a entender qué formato puede funcionar mejor.Por ejemplo, si buscamos en Google “guest blogging” (autor invitado), vemos que todos los posts mejor posicionados son guías:Si hacemos lo mismo en YouTube, son todos tutoriales “cómo hacer” y listicles:3. Planifica, crea y publicaEl proceso de crear tu contenido es esencialmente el mismo independientemente de su canal intencionado, tipo y formato:PlanificaCreaPublicaVamos a ver más en profundidad cada parte del proceso:PlanificaciónLa planificación empieza con la creación de un esquema. Si estás creando publicaciones cortas para redes sociales, esto podría no ser estrictamente necesario. Pero sin duda es la mejor aproximación para tipos más complejos de contenido como posts de blog y vídeos.Así es cómo empezamos casi todos los posts y vídeos que publicamos.Por ejemplo, este es mi esquema para este mismo artículo:Esquema: creación de contenidoIntro¿Qué es la creación de contenido? ¿Por qué es importante la creación de contenido?Cómo crear contenidoPaso 1…Paso 2…Etc.Cómo escalar la creación de contenidoReflexiones finales / conclusión¿Cómo decidí qué incluir?Ya que el propósito de este post es posicionar en búsqueda orgánica, mi punto de partida fue analizar páginas relevantes de entre las primeras posiciones en busca de subtemas comunes.Para hacer esto, introduje unas pocas guías de entre las mejor posicionadas en la herramienta de Content Gap de Ahrefs y establecí el número de intersecciones al máximo para ver las palabras clave por las que todas estas páginas se posicionan. Esto reveló un par de subtemas bastante obvios para incluir:También usé el informe gratuito de SEO on-page barra de herramientas SEO de Ahrefs para comprobar los subtítulos en los posts mejor posicionados en subtemas comunes. Esto reveló que la mayoría de los posts hablaban sobre por qué el contenido es importante, así que los añadí a mi esquema.Sin embargo, no solo me inspiré en los posts mejor posicionados. También añadí una sección sobre escalar contenido (ver más abajo). Ninguno de los posts mejor posicionados habla sobre esto, pero sé por experiencia que muchos creadores de contenido se enfrentan a este problema. También sentí que podría compartir algunas reflexiones valiosas para diferenciar nuestro post de cualquier otro ahí fuera.Recuerda, rara vez tiene sentido crear una copia exacta del contenido que está ya por ahí. Si quieres que la gente recuerde tu contenido, necesitas ir más allá.CreaciónCon tu esquema listo, es hora de ponerse a trabajar y dar cuerpo a tu contenido.Hemos compartido consejos y procesos para hacer esto de forma eficiente en unos cuantos posts, pero aquí van unos pocos consejos para que empieces: Simplemente escribe. Es fácil procrastinar y quedarse mirando la página en blanco durante horas. Lo he hecho un millón de veces. Lucha contra esto forzándote a ti mismo a escribir sin editar. Incluso si crees que lo que escribes es tonto, no pares. Simplemente sigue escribiendo. Usa una fórmula probada para la intro. Tu introducción es quizá la parte más importante de tu contenido, pero también la más difícil. Lucha contra esto usando una fórmula probada para la introducción como la fórmula PAS. Usa el método de la pirámide invertida. La mayor parte de la gente entierra información importante bajo banalidades que “está bien saber”. No hagas esto. Ponte como misión poner lo que “necesitas saber” antes de lo que “está bien saber”. Todas las personas que consuman tu contenido lo agradecerán.Comprueba los recursos de abajo si quieres saber más:Lecturas complementariasRedacción SEO: 12 consejos fáciles para un mejor contenido y mejor posicionamiento¿Qué es la Redacción de Contenido? 11 Tips para ganar más tráfico y lectores¿Qué es la redacción SEO? Cómo Ser un Mejor Redactor SEOUna vez que tienes tu borrador armado, te recomendaría encarecidamente que le pidieras feedback a un compañero o amigo. Hacemos esto con todo nuestro contenido. Le doy feedback a Sam sobre sus guiones de vídeo, me da feedback sobre mis posts de blog y yo le doy feedback a otros redactores.Aquí va un ejemplo de este mismo post:No me entiendas mal, esto a veces puede ser un poco desmoralizador, pero casi siempre llevará a un mejor contenido.PublicaciónFinalmente—la parte fácil. Formatea, finaliza y sube tu contenido a tu canal elegido y estás en el juego. Dicho esto, hay a menudo más partes móviles en este proceso de las que te podrías imaginar, lo que me lleva a…Cómo escalar la creación de contenidoTodo lo de arriba es suficiente para hacer que tus esfuerzos de creación de contenido despeguen. Pero hay un límite en lo que puedes hacer por ti mismo. Si de verdad quieres escalar tus esfuerzos de producción de contenido, necesitarás involucrar a otras personas y sistematizar tus procesos.En esta sección, cubriremos cinco formas de hacer eso en base a nuestra propia experiencia:Pon alguien al mando de cada canalDivide el proceso de creación de contenido en tareas más pequeñasCrea SOPsContrata a redactores expertosUsa un calendario editorialReutiliza contenido para varios canalesPon alguien al mando de cada canalCrear y gestionar contenido para cada canal de marketing por tu cuenta es una tarea imposible. Necesitas delegar esa responsabilidad.Así es cómo hacemos las cosas en Ahrefs. Creamos contenido para dos canales principales: el blog y YouTube. Yo estoy encargado del blog, y Sam está al mando de YouTube.Aquí van unas pocas responsabilidades clave para cada coordinador de canal: Planifica y coordina contenido. ¿Qué se publica y cuándo? ¿Qué tareas tienen que ser terminadas antes de que podamos salir con el contenido en vivo? Contrata a creadores de contenido. Escalar contenido implica contratar más creadores de contenido. Estos pueden ser bloggers, guionistas o, a veces, otra cosa. En cualquier caso, alguien tiene que encontrar y revisar a esas personas. (Ya de paso, estamos contratando) Crea guías de contenido y estilo. Todo el mundo necesita estar en la misma página si vas a escalar y mantener una voz de marca consistente. Las guías de contenido te ayudan con esto. (Todavía estamos trabajando en la nuestra).Claro, es posible poner a una persona a cargo de varios canales, pero rara vez es eficiente. Si divides demasiado a la gente, acabarán produciendo gran cantidad de contenido mediocre para varios canales en lugar de contenido excepcional para un único canal.Divide el proceso de creación de contenido en tareas más pequeñasHay muchos elementos móviles cuando creas contenido. No puedes matarte para escribir un post y tenerlo listo para publicar. Necesitas imágenes, dar formato, editar y probablemente otras cosas más.Así como es ineficiente para una única persona gobernar sobre varios canales, es ineficiente para una única persona hacer todo esto.¿Cómo puedes resolver esto?Divide el proceso en tareas más pequeñas y asigna cada una a la persona más adecuada para el trabajo.Aquí tienes nuestro proceso de creación de contenido para el blog:Cada color representa a una persona distinta de nuestro equipo.Crea SOPsLos SOPs (Standard Operating Procedures o Procesos Operativos Estándar en español) son documentos explicativos sobre cómo hacer tareas específicas dentro de tu organización. Deberías crearlos para tantas de las tareas individuales del paso previo sea posible.Por ejemplo, aquí está nuestro SOP para poner nombre a las imágenes de los posts del blog:No es nada especial, pero tener todo documentado así nos permite delegar cada parte del proceso de creación de contenido de forma más efectiva. También hace la vida más fácil cuando hacemos el onboarding de nuevos empleados, ya que nuestra colección de SOPs actúa de forma efectiva como una biblioteca de formación.Tenemos SOPs para nuestro proceso de creación de vídeos, aunque fue Sam el que los creó ya que está a cargo de ese canal.Contrata a redactores expertosCrear en solitario cada pieza de contenido es virtualmente imposible, así que necesitarás contratar a redactores si quieres escalar. Pero aquí es donde quizá mucha gente cometa un error crucial, porque buscan redactores en lugar de expertos en la materia.Aunque es cierto que necesitas contratar a buenos redactores, es improbable que creen ningún contenido de valor real sin conocimiento y experiencia de primera mano.Esto es por lo que nunca hemos anunciando explícitamente que buscamos redactores; buscamos “educadores”:Nuestra reflexión es que es más fácil enseñar a alguien a escribir mejor de lo que es enseñarlos a hacer SEO. También queremos que nuestros empleados compartan sus perspectivas y experiencias únicas, por lo que contratar redactores simplemente no es suficiente para nosotros.Sin embargo, no todo el mundo hace las cosas así. Muchas marcas tienen éxito escalando su contenido usando una aproximación de arriba a abajo. Donde un estratega de contenidos planifica cada pieza, crea un esquema, y se lo envía a un redactor que lo convierte en una pieza con todas las de la ley.La mejor aproximación no está escrita en piedra, depende de muchas cosas como la complejidad de tus temas, voz de marca y logística.Usa un calendario editorialLa consistencia es la clave en la creación de contenido, así que es clave planificar por adelantado y tener el seguimiento de todo en un único lugar.Aquí es donde un calendario editorial o calendario de contenido viene bien.Aquí está el aspecto de nuestro calendario del blog:Cada uno es distinto, pero nosotros normalmente planificamos contenido 1-3 meses por delante.Tu calendario de contenido debería listar detalles clave para cada pieza de contenido. Aquí van unas pocas cosas que seguimos:StatusEncargadoEncargado de fasePalabra clave (keyword)Fecha de publicaciónTenemos un calendario de contenido parecido pero separado para nuestro canal de YouTube.Lectura recomendada: Cómo Crear un Calendario Editorial que Te FuncioneReutiliza contenido para varios canalesCrear contenido es un proceso que consume tiempo, así que tiene sentido sacar todo lo que puedas de cada pieza reutilizándola en otros canales.Por ejemplo, hemos reutilizado nuestro post del blog sobre palabras clave long-tail para YouTube:https://www.youtube.com/watch?v=FiSbnT-qwyETambién hemos creado tuits de algunos de los puntos clave del post:Long-tail keywords are terms with low search volumes. They get their name because of where they end up on the search demand curve.Despite what many people think, it has nothing to do with how long a keyword is, how specific it is, or how well it’s likely to convert. pic.twitter.com/ARPPwT6Zed— Ahrefs (@ahrefs) March 23, 2021 Las palabras clave long-tail (de larga cola) son términos con bajos volúmenes de búsqueda. Reciben su nombre por dónde acaban en la curva de demanda de búsqueda.A pesar de lo que mucha gente cree, no tiene nada que ver con lo larga que es una palabra clave, lo específica que es o de su probabilidad de convertir.Ten en cuenta que cuando hablamos sobre reutilizar contenido, no decimos que republiques la misma pieza tal cual en otros canales. Si comparas nuestro post y vídeo sobre palabras clave long-tail, te darás cuenta de que están lejos de ser idénticos. Eso es porque lo que funciona bien en un formato no siempre lo hará en otro, así que deberías siempre reutilizar en lugar de republicar.Reflexiones finalesEscalar con éxito la producción de contenido de alta calidad puede impactar enormemente en tu negocio. Somos la prueba viviente de eso, como lo son muchos otros negocios que tomaron una aproximación similar al contenido como Buffer y Wise.Pero recuerda: no caigas en la trampa de crear contenido sin una estrategia de contenido sólida. Esa es una forma segura de desperdiciar tiempo, dinero y recursos.¿Tienes preguntas? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software en AppCritic. Aquí puedes leer su guía sobre WhatsApp CRM. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Creación de Contenido: La Guía Completa para Principiantes"
    },
    {
      "level": "H2",
      "text": "¿Qué es la creación de contenido?"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante crear contenido?"
    },
    {
      "level": "H2",
      "text": "Cómo crear contenido"
    },
    {
      "level": "H3",
      "text": "1. Encuentra temas probados"
    },
    {
      "level": "H4",
      "text": "Si creas contenido para tu web o YouTube…"
    },
    {
      "level": "H5",
      "text": "a) Haz brainstorming de temas"
    },
    {
      "level": "H5",
      "text": "b) Usa una herramienta de keyword research para ampliar a partir de tus ideas"
    },
    {
      "level": "H5",
      "text": "c) Revisa a los competidores"
    },
    {
      "level": "H4",
      "text": "Si estás creando contenido para otros canales como redes sociales o email…"
    },
    {
      "level": "H3",
      "text": "2. Elige un tipo y formato de contenido"
    },
    {
      "level": "H4",
      "text": "Tipo de contenido"
    },
    {
      "level": "H4",
      "text": "Formato de contenido"
    },
    {
      "level": "H3",
      "text": "3. Planifica, crea y publica"
    },
    {
      "level": "H4",
      "text": "Planificación"
    },
    {
      "level": "H4",
      "text": "Creación"
    },
    {
      "level": "H4",
      "text": "Publicación"
    },
    {
      "level": "H2",
      "text": "Cómo escalar la creación de contenido"
    },
    {
      "level": "H3",
      "text": "Pon alguien al mando de cada canal"
    },
    {
      "level": "H3",
      "text": "Divide el proceso de creación de contenido en tareas más pequeñas"
    },
    {
      "level": "H3",
      "text": "Crea SOPs"
    },
    {
      "level": "H3",
      "text": "Contrata a redactores expertos"
    },
    {
      "level": "H3",
      "text": "Usa un calendario editorial"
    },
    {
      "level": "H3",
      "text": "Reutiliza contenido para varios canales"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}