{
  "url": "https://ahrefs.com/blog/es/crecer-lista-email/",
  "slug": "crecer-lista-email",
  "title": "8 tácticas eficaces para hacer crecer una lista de email",
  "description": "Las listas de correo electrónico son uno de los activos de marketing más importantes de una empresa. Pero, ¿cómo se hace crecer una lista de email? Te enseñaremos las tácticas más eficaces para conseguirlo.",
  "content": "Bill Widmer Viviendo como nómada digital más de 8 años. Bill tiene una misión de viajar por el mundo y ganarse la vida utilizando el SEO y el marketing de contenidos. Contenido Las listas de email son uno de los activos de marketing más importantes de una empresa. En vez de tráfico momentáneo procedente de publicaciones temporales en redes sociales o anuncios de pago, se trata de gente que ha interactuado contigo y a la que tienes acceso directo.Con una lista de correo electrónico sólida, puedes ganar dinero con un simple clic siempre que lo necesites. A diferencia de otros canales de marketing, aquí tienes todo el control y la propiedad.Entonces, ¿cómo hacer que una lista de email crezca? Vamos a repasar los consejos y tácticas más eficaces que he aprendido al hacer crecer varias listas de correo electrónico a decenas de miles de suscriptores.ContenidoEl growth mindset de email que necesitasAntes de sumergirnos en lo práctico, vamos a aclarar un poco las cosas. Cuando se trata de hacer crecer una lista de email, no solo se quieren tantos números en bruto como sean posibles.No solo se vuelve caro rápidamente, sino que también perjudica la “entregabilidad” de tus correos cuando envías contenido a muchas direcciones de email no comprometidas (y francamente inexistentes).En su lugar, es preferible centrarse en el crecimiento de una lista de email altamente comprometida. Calidad y cantidad.Eso significa que tienes que limpiar la lista con frecuencia, nunca comprar listas genéricas, y siempre ofrecer algo de valor a los suscriptores de tu newsletter. Hablaré más sobre este último punto más adelante.Ocho tácticas clave para hacer crecer tu lista de emailAhora que ya estás pensando en clientes potenciales de calidad, hablemos de tácticas para hacer crecer tu email list.1. Coloca los formularios de suscripción en las zonas correctasEmpieza con buen pie y asegúrate de que tienes los formularios de suscripción a tu lista de email en los espacios más comunes de tu web:Página de inicioBarra lateralAl final del contenido de tu blogEstos son puntos obvios, pero pueden pasarse por alto. Lo que queremos es empezar con una base sólida antes de entrar en las tácticas más avanzadas.Algo como esto funciona bien:¿Qué deberías poner en el formulario?Aunque puedes poner el típico “Únete a más de 7.000 personas inteligentes como tú”, es mejor poner algo más orientado a lo que quiere tu audiencia.A no ser que tu contenido sea algo especial para tus lectores (que, seamos sinceros, más vale que lo sea si quieres hacer crecer un negocio online), nadie se va a apuntar a otra newsletter genérica de spam por email.2. Atrae tráfico web de alta calidadLa calidad de tu lista de email comienza con la calidad del tráfico de tu web. No importa lo bien que conviertan tus formularios de suscripción, de nada servirá si la gente adecuada no visita tu web.Ahí es donde entran en juego el SEO y el marketing de contenidos. Un contenido de calidad, orientado a palabras clave relevantes, puede atraer tráfico de calidad de forma automática desde motores de búsqueda como Google.El SEO tiene un proceso de aprendizaje y requiere tiempo para que funcione, pero es una de las formas más eficaces de marketing de contenidos para hacer crecer una lista de suscriptores de email.Se empieza con la investigación de palabras clave para saber qué palabras clave buscan tus clientes ideales y cómo posicionarse para esas palabras clave.Puedes hacerlo rápidamente con un análisis de la brecha de contenido de la competencia. Simplemente introduce tu web en el Site Explorer de Ahrefs y haz clic en el botón Brecha de contenido en la parte inferior del menú de la izquierda.A continuación, introduce tres o más de tus competidores. Si no sabes quiénes son tus competidores, puedes encontrarlos con el informe Dominios competencia bajando un poco en la barra lateral izquierda.Una vez que hagas clic en Mostrar palabras clave, obtendrás una lista de todas las palabras clave con las que se posicionan tus competidores, pero tú no. A veces pueden ser decenas de miles de palabras clave, por lo que es mejor empezar con aquellas con las que se posicionan todos los competidores para obtener los resultados más relevantes, por lo que cambiamos la intersección a tres en este caso:A partir de ahí, tendrás una lista de ideas concretas sobre los contenidos que podrías crear.¿Quieres profundizar más? Empieza con estas guías SEO:SEO básico: guía para principiantes para el éxito en SEOCómo crear contenido relevante que se posicione en los buscadores3. Crea ampliaciones de contenidosUna ampliación de contenido es exactamente lo que parece: una “mejora” del contenido que estás leyendo en ese momento.Algunos ejemplos pueden ser:Una “guía definitiva” para quemar grasa en un artículo sobre ejercicios para adelgazar.Una hoja de cálculo presupuestaria en un artículo sobre cómo crear un presupuesto.Una serie de vídeos sobre cómo tocar el ukelele en un artículo sobre los mejores ukeleles para principiantes.Puedes ser tan creativo como quieras. ¿Qué puedes ofrecer a tus lectores que sea realmente valioso para ellos y relevante para lo que están leyendo en ese momento?Por ejemplo, personalmente he conseguido miles de direcciones de email creando una hoja de cálculo en la que comparo más de 50 autocaravanas pequeñas como mejora del contenido de mi guía sobre las mejores autocaravanas pequeñas.Este es el aspecto del formulario de suscripción:Aquí puedes ver la hoja de cálculo que obtienen al suscribirse:Era más probable que mis lectores se suscribieran a mi lista porque iban a recibir algo relevante que les resultaba realmente útil durante su búsqueda para decidir qué autocaravana comprar.¿Estás preparado para hacerlo tú?Para saber qué páginas podrían aprovecharse de una ampliación, echa un vistazo a las páginas con más tráfico en Google Analytics. Solo tienes que ir a “Páginas y pantallas” en GA4 (o Comportamiento > Todo el contenido > Páginas de destino en la versión antigua de GA), y se ordenará automáticamente por número de visitas.A continuación, crea ampliaciones de contenido que tengan sentido para las páginas con más tráfico.Piensa en ampliaciones que puedas utilizar en varias páginas para ahorrar tiempo y costes. Por ejemplo, una guía definitiva para adelgazar puede promocionarse a través de artículos sobre los mejores alimentos para adelgazar, los mejores ejercicios para adelgazar, etc.Una vez más, la optimización de motores de búsqueda va a ser tu mejor aliado con esta táctica. Si combinas ampliaciones de contenido con posts que ya estén posicionados en Google, conseguirás que tu lista crezca de forma automática.4. Organiza sorteosEmpezaré con un gran disclaimer: Los sorteos genéricos son un gran medio para hacer crecer una lista de emails… llena de emails falsos o sin compromiso.Mucha gente crea direcciones de correo (que en realidad nunca comprueban o utilizan) con el único propósito de apuntarse a sorteos. O se apuntan e inmediatamente se dan de baja, una vez finalizado el sorteo.En vez de regalar algo genérico, como dinero en efectivo o aparatos electrónicos de lujo, regala algo directamente relacionado con tu mercado objetivo.Por ejemplo, si te dedicas al fitness, regala equipamiento de fitness. Si te dedicas a la carpintería, regala equipos para trabajar la madera… Te puedes hacer una idea.Mejor aún, si vendes productos propios, los puedes regalar. Así, aunque alguien cancele su suscripción, seguirá pensando en ti cada vez que utilice tus productos.Un ejemplo de regalo bien hecho es éste de iKamper:Esto es lo que lo bueno que tiene:Regala sus propios productos.Se ha asociado con otras marcas importantes del sector de la acampada al aire libre.Todos los productos del sorteo son relevantes para los clientes de iKamper (no hay productos genéricos ni dinero en efectivo).En otras palabras, únicamente la gente que podría ser cliente potencial de iKamper se apunta realmente al sorteo.Además, al asociarse con otras marcas, está aumentando su cobertura a la vez que construye relaciones con socios poderosos.Si vas a hacer un sorteo, asegúrate de que sea legal. Fíjate en que en el post se dice que Instagram no avala el sorteo. Esta es una de las cosas que tienes que hacer para organizar un sorteo de forma legal. Estas normas difieren de un país a otro.5. Utiliza pop-ups de intención de salidaLos pop-ups son molestos, ¿verdad?Desde luego lo son si es algo que no te interesa.Por eso solo deberías utilizar pop-ups de intención de salida con, bueno, intención. No te limites a bombardear a tus lectores con un “¡Suscríbete a mi newsletter!” sin ofrecerles nada que les interese.En su lugar, utiliza los pop-ups de intención de salida tan solo para ofrecer a tus lectores algo que realmente quieran. Un código de descuento puede funcionar, aunque eso no garantiza la retención de clientes.El enfoque que he descubierto que funciona mejor es combinar estos pop-ups con las ampliaciones de contenido que vimos en la táctica nº 3. Esto hace que la ampliación sea obvia y se reduzcan así las posibilidades de que el pop-up sea realmente molesto.Hablando de ser menos molesto… aquí tienes otros consejos para evitar molestar a tus lectores:Asegúrate de que cerrar el pop-up sea algo sencillo y obvio. Haz que la “X” de la esquina sea fácil de ver y asegúrate de que se cierra si los usuarios hacen clic fuera del recuadro.Muestra el pop-up después de que el usuario pase un tiempo en una página o después de cierta profundidad de desplazamiento para que no se muestre de inmediato, para no espantar al usuario. En la mayoría de las herramientas se pueden establecer estas condiciones en la configuración de los pop-ups.De esta forma, se maximizan los beneficios de los pop-ups y se minimizan las molestias.Aquí tenemos un ejemplo de pop-up muy bueno con intención de salida:Es bueno por las siguientes razones:Es fácil de cerrar. (Hay una “X” visible y una opción de “No, gracias”).Ofrece algo de valor, no solo te pide que te suscribas.Es muy relevante para el público de Tim Ferriss (habla mucho sobre cómo mejorar tu vida).Hay muchas herramientas y plugins que puedes utilizar para crear el pop-up y gestionar tus suscriptores. Personalmente utilizo ConvertKit para gestionar mi lista y Thrive Lightboxes para hacer mis pop-ups, pero utiliza el que más te guste.6. Nunca hagas spam a tu listaEs un consejo obvio, pero merece la pena repetir que no hay que enviar montones de emails sin sentido a una lista de email. Esto se reduce a:No envíes mensajes que no le interesen a tus suscriptores.No envíes más de cuatro correos al mes, a no ser que se trate de algo urgente sobre lo que la gente quiera recibir información con más frecuencia (como noticias o actualizaciones del mercado).La retención de suscriptores también contribuye enormemente al crecimiento sostenible.7. Utiliza un “riego por goteo”Lo último que quieres es dejar que se “enfríe” tu lista de emails. Es fácil olvidarse de enviar mensajes con cierta frecuencia. Además, no todos los miembros de la lista se encuentran en la misma fase del embudo de marketing.Ahí es donde entra en juego el “riego por goteo”. Se trata de una serie de correos que se configuran de antemano para “gotear” a tu lista a lo largo del tiempo. Es básicamente una forma de asegurarse de que el contacto es constante sin necesidad de escribir un email de difusión cada semana.Por ejemplo, una campaña de goteo puede ser algo así:Un lector se suscribe a tu lista para obtener la guía definitiva para perder peso.Tu software de marketing por email le envía un correo de bienvenida junto con un PDF.Al día siguiente de suscribirse, recibe otro correo con una versión en vídeo de la guía que también promociona tus productos.Una semana más tarde, recibe un correo que le pregunta cómo va con sus objetivos.Etc.Estos emails “por goteo” pueden promover tu contenido más antiguo, compartir contenido nuevo, dar consejos y mejores prácticas, y ocasionalmente promover productos relevantes para tu lista.Además, te ofrecen la ventaja añadida de que solo tienes que programar los correos una vez y, a partir de ahí, dejar que la automatización se encargue de todo.Hablando de automatización…8. Segmenta tu lista¿Te gustaría recibir emails sobre consejos para adelgazar si estás intentando ganar masa muscular? Probablemente no. Por eso, si ofreces contenido sobre diferentes temas dentro de un nicho, lo mejor es segmentar tu lista para que tus lectores solo reciban los correos más relevantes para lo que les interesa.Hay varias formas de segmentar una lista:Segmenta en función de la ampliación de contenidos a la que se hayan suscrito (por ejemplo, la guía de adelgazamiento entra en el segmento de adelgazamiento, la guía de musculación entra en el segmento de musculación).Basta con preguntar a los suscriptores sobre sus preferencias en el correo de bienvenida. Ofrece una lista con temas que estén enlazados con distintas etiquetas para los diferentes segmentos. Por ejemplo, podrías hacer una lista como esta: Me interesa perder peso.Me interesa ganar masa muscular.Me interesa tener más energía y estar más sano en general.Segmenta en función de los productos adquiridos por el suscriptor.Cada software de automatización de email funciona de una forma distinta en referencia a cómo gestiona las automatizaciones y etiquetas. Pero así es cómo se hace con ConvertKit (el que uso):Haz clic en el menú desplegable Automate y, a continuación, en Rules.Haz clic en + New Rule (Regla nueva) en la parte superior derecha, y te pedirá que elijas un Trigger (Activador) y una Action (Acción). Dependiendo de la estrategia de segmentación que busques, entre las tres que he mencionado anteriormente, tendrás un trigger diferente.Hagamos algo sencillo en este ejemplo: selecciona Subscribe to a form como desencadenante y Subscribe to a sequence como acción. (Ten en cuenta que tendrás que configurar el formulario y la secuencia por adelantado para que funcione). Esto hace que cada vez que alguien se suscriba a través del formulario que has elegido, se añadirán a la secuencia (el “goteo”) que has seleccionado.Además, haz clic en el signo + debajo de Subscribe to a sequence action (Suscribirse a una acción de secuencia) y añade la segunda acción Add tag (Añadir etiqueta) con la etiqueta de segmento correspondiente para ese formulario en particular. Esto añadirá una etiqueta a cualquiera que se suscriba a ese formulario, permitiéndote así “segmentarlos”.Cuando estés satisfecho con la configuración, haz clic en Save rule (Guardar regla). Esto es todo lo que tienes que hacer.Reflexiones finalesUna vez más, se puede decir que tu lista de emails es uno de los mayores activos de tu negocio. Es una lista de clientes que controlas, a diferencia de otros canales de marketing.Las tácticas que he descrito anteriormente me han ayudado a crear varias listas de decenas de miles, con personas que se comprometen e interesan cuando les envío un correo.Trata a tu lista como si fuera oro, nunca te aproveches de ella y recuerda que hay gente real al otro lado de esos correos. Esa es la forma de hacer crecer y mantener una lista de email de buena calidad. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "8 tácticas eficaces para hacer crecer una lista de email"
    },
    {
      "level": "H2",
      "text": "El growth mindset de email que necesitas"
    },
    {
      "level": "H2",
      "text": "Ocho tácticas clave para hacer crecer tu lista de email"
    },
    {
      "level": "H3",
      "text": "1. Coloca los formularios de suscripción en las zonas correctas"
    },
    {
      "level": "H3",
      "text": "2. Atrae tráfico web de alta calidad"
    },
    {
      "level": "H3",
      "text": "3. Crea ampliaciones de contenidos"
    },
    {
      "level": "H3",
      "text": "4. Organiza sorteos"
    },
    {
      "level": "H3",
      "text": "5. Utiliza pop-ups de intención de salida"
    },
    {
      "level": "H3",
      "text": "6. Nunca hagas spam a tu lista"
    },
    {
      "level": "H3",
      "text": "7. Utiliza un “riego por goteo”"
    },
    {
      "level": "H3",
      "text": "8. Segmenta tu lista"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Bill Widmer"
}