{
  "url": "https://ahrefs.com/blog/es/cuota-de-voz/",
  "slug": "cuota-de-voz",
  "title": "¿Qué es Share of Voice? Cómo medirlo en todos los canales",
  "description": "La cuota de voz (SOV) es tradicionalmente una medida de tu cuota publicitaria en comparación con la competencia.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido La cuota de voz (SOV) es tradicionalmente una medida de tu cuota publicitaria en comparación con la competencia. Sin embargo, dado que la mayoría de las marcas ahora luchan por la visibilidad en canales orgánicos como las redes sociales y las búsquedas, podemos ampliar esa definición a la visibilidad de tu marca en el mercado.La fórmula para calcular la participación de la voz es:SOV = Valor de visibilidad de marca / Valor de visibilidad total del mercado… donde el ‘valor de visibilidad’ depende de la métrica más adecuada para el canal que está midiendo.En esta guía, aprenderás por qué SOV es uno de los KPI de marketing más esenciales y cómo medirlo en el complejo mundo del marketing omnicanal actual.¿Por qué es importante SOV?Cómo medir el SOV en la búsqueda orgánicaCómo medir el SOV para Google AdsCómo medir SOV para redes socialesCómo medir SOV para canales de medios de comunicación¿Por qué es importante el SOV?Existe una fuerte relación entre SOV y participación de mercado. Si tienes un 17% de SOV, también puedes esperar que tu participación de mercado se acerque al 17%.Dicho esto, debes esforzarte por obtener un SOV más alto que la participación de mercado. Esto se conoce como exceso de participación de voz (eSOV) y es un factor clave a largo plazo responsable de aumentar tu participación de mercado.Permíteme resaltar la palabra “a largo plazo” porque alcanzar el equilibrio no ocurre de la noche a la mañana. Es realista esperar una tasa de crecimiento anual del 0,7% en la cuota de mercado por cada diez puntos porcentuales de eSOV. Puede que no parezca mucho, pero esos puntos decimales pueden valer millones en tu industria.Sin embargo, ten en cuenta que gastar más en comunicaciones no significa necesariamente crear eSOV. Se trata de aumentar su SOV en relación con la competencia.Lidl en el Reino Unido es un ejemplo estelar de cómo la teoría del SOV se está convirtiendo en realidad. En 2013, tenían aproximadamente un 3% de participación de mercado y SOV. A partir de 2014, comenzaron a aumentar su cobertura en los medios y duplicaron su participación de mercado en solo cinco años.Vea este video para más detalles:https://www.youtube.com/watch?v=bb-6PCbsdycPero hay más que debes saber …Los investigadores han descubierto que las marcas pequeñas tienen que gastar de más para mantener su participación de mercado, mientras que las marcas más grandes pueden salirse con la suya con un SOV más bajo que su participación de mercado y aún así mantenerse firmes. Por eso la curva del gráfico no es lineal.¿Por qué pasa esto? Todo se reduce al hecho de que cuanto más grande es su marca, más eficientemente se gastan sus dólares de marketing.Dicho esto, es probable que tu empresa aún no compita con las grandes marcas a través de anuncios televisivos en horario estelar. Y a diferencia de las grandes marcas, probablemente no tengas un equipo de analistas e investigadores en tu nómina que te mantenga actualizado sobre su SOV general.Afortunadamente, aún puedes medir el SOV para trozos más pequeños del pastel y usarlo como un KPI. Nos centraremos en hacer precisamente eso en varios canales de marketing a continuación.Cómo medir el SOV en la búsqueda orgánicaLa búsqueda orgánica es la mayor fuente de tráfico para muchas empresas, incluidos nosotros:Si bien el número anterior puede ser impresionante, no nos dice nada sobre SOV. Para calcular eso, usa uno de estos dos métodos:1. Tráfico orgánico general en comparación con la competenciaPrimero, haz una lista de los dominios de tus competidores. Usaremos solo competidores comerciales directos porque siempre habrá blogs y otros sitios web apareciendo en los primeros resultados. Estos pueden generar un tráfico significativo en su industria, pero no poseen ninguna participación de mercado.A continuación, pega tus dominios y lod de tus competidores en el análisis por lotes de Ahrefs para ver el tráfico orgánico estimado de cada sitio y la cantidad de palabras clave que clasifican.Exporta los datos y elimina cualquier otra cosa que no sean las columnas Objetivo, Palabras clave y Tráfico.A continuación, cree dos columnas nuevas para compartir tráfico y palabras clave.Ingresa esta fórmula en la fila uno de la primera columna nueva:=iferror(arrayformula(if(row(B$1:B)=1,\"Keyword share\",if(B1:B=\"\",\"\",B1:B/sum($B$2:B)))))Y esta fórmula en la primera fila de la segunda columna nueva: =iferror(arrayformula(if(row(C$1:C)=1,\"Traffic share\",if(C1:C=\"\",\"\",C1:C/sum($C$2:C)))))Nota al margen. Aquí hay una hoja de ejemplo con celdas con fórmulas resaltadas en verde.Ahora viene el inconveniente de este método rápido. Cuanto más amplio sea el público objetivo de un sitio web determinado, más palabras clave y oportunidades de tráfico habrá.Eso significa que los sitios web con un porcentaje de palabras clave anormalmente alto probablemente se dirijan a un público más amplio. Además de eso, algunos sitios se clasifican para palabras clave de alto volumen sin prácticamente ningún valor para su negocio. Esos pueden sesgar bastante los datos.Por ejemplo, uno de nuestros ‘competidores’ recibe mucho tráfico orgánico en una publicación de blog en español que explica qué es un CEO.Aunque eso aumenta su SOV cuando se usa este método, la publicación del blog tiene prácticamente cero ‘valor comercial’ y es poco probable que atraiga a ningún cliente.En conclusión, toma estos números con un grano de sal.Pasaremos a un método que elimina estos inconvenientes e inexactitudes hasta cierto punto.2. Seguimiento de una muestra representativa de las palabras clave de su sectorLa única forma de evitar las diferencias entre las audiencias objetivo de los sitios web es elegir las palabras clave desde las que desea considerar el tráfico.El mejor enfoque aquí es tomar tu hoja maestra de investigación de palabras clave, pegar todas las palabras clave principales en Rank Tracker, agregar los dominios de tus competidores y verificar la visibilidad en la pestaña Descripción general de los competidores:La métrica de visibilidad muestra el porcentaje de todos los clics de tus palabras clave rastreadas que aterrizan en el sitio web respectivo.Solo un par de notas rápidas al hacer esto:Primero, solo deseas realizar un seguimiento de las palabras clave principales. Esa es la palabra clave “cabezona” que obtiene la mayor cantidad de clics para un tema. Las hojas maestras de investigación de palabras clave a menudo contienen decenas de miles de palabras clave, y aquí solo deseas trabajar con la muestra más representativa. Esta muestra incluirá las palabras clave a las que ya está orientado con contenido y aquellas a las que aún no debe orientarse.En segundo lugar, excluye siempre las palabras clave de marca suyas y de la competencia.Una vez que haya hecho eso, simplemente copia y pega las palabras clave en Rank Tracker. Si tienes una empresa con una ubicación específica, asegúrate de realizar un seguimiento de las ubicaciones correctas en este paso. Solo voy tras nuestro mercado más grande aquí: Estados Unidos.También debes etiquetar la lista de palabras clave para poder filtrar las palabras clave SOV más adelante:Haz clic en “Agregar palabras clave” y deberías ver el informe Descripción general. Si ya realizas un seguimiento de otras palabras clave, deberás filtrar las “palabras clave de SOV” mediante la etiqueta:El informe Vista general es útil para realizar un seguimiento de tu progreso, pero deberá cambiar a la pestaña Vista general de los competidores para ver cómo se compara con tus competidores.Puedes ver nuestra comparación de visibilidad aquí:Para obtener una representación porcentual, diríjete al informe de porcentaje de tráfico para ver cómo se divide el pastel entre tu y los competidores rastreados:Solo ten en cuenta que este es solo un canal y que las proporciones anteriores no se corresponden con el SOV general o las cuotas de mercado. La relación entre SOV, participación de mercado y efectividad publicitaria solo funciona cuando se analiza el SOV en todos los canales.Cómo medir el SOV para Google AdsVamos a tomar una ruta diferente aquí e ir tras el porcentaje de impresiones. Eso es porque es la única métrica adecuada para el seguimiento de SOV que ofrece Google Ads, que siempre será más precisa que las métricas de herramientas de terceros.El porcentaje de impresiones (IS) representa el porcentaje de veces que se mostraron tus anuncios del total de impresiones que podrían haber recibido según su orientación.Independientemente de lo valiosa que sea esta métrica para los especialistas en PPC, todavía hay un inconveniente que debemos tener en cuenta para el seguimiento de SOV. Es la parte “basada en la orientación de sus anuncios”. Para dar un ejemplo extremo, supongamos que te diriges a una sola palabra clave de concordancia exacta en un área geográfica pequeña. Hacer eso facilita alcanzar el 100% de IS con una oferta, un anuncio y una página de destino optimizados.Dicho esto, este objetivo de PPC podría ser algo así como “aumentar el IS del 54% al 70% en el Reino Unido entre los compradores potenciales de herramientas de investigación de palabras clave para fin de año”.Cómo medir el SOV para las redes socialesEn primer lugar, nos centramos únicamente en los canales orgánicos. Con los anuncios sociales pagados, puedes ver métricas como la frecuencia de los anuncios, el alcance, las impresiones y el tamaño estimado de la audiencia, pero no hay forma de compararlos con la competencia. Eso hace que sea imposible crear un seguimiento SOV social pagado viable.Afortunadamente, las mediciones de SOV sociales orgánicas son bastante sencillas. Se trata de realizar un seguimiento de todas las menciones de marca tuyas y de la competencia.Si bien hay muchas herramientas de monitoreo de redes sociales para esto, solo tengo experiencia con Brand24. Sin embargo, el concepto debería funcionar en todos los ámbitos. Monitorea las palabras clave (nombres de marca) en los canales de redes sociales seleccionados, y la herramienta te muestra la cantidad de menciones durante un período específico. Si no muestra SOV, simplemente compara las menciones de tu marca con las menciones generales del mercado.La siguiente captura de pantalla muestra cómo se vería eso. En este caso, estamos filtrando las menciones de Ahrefs en Twitter. Para obtener SOV, simplemente dividiría nuestras menciones de marca por el número total de menciones de marca en la categoría. Entonces, si ves un total de 500 menciones de tres marcas que estás rastreando, y 133 de esas menciones pertenecen a su marca, su SOV es del 26.6%:Sin embargo, no voy a dejar esto sin un “pero”.Como sabes, las redes sociales están plagadas de bots, así que ten en cuenta que muchas menciones de marcas no vendrán de una persona real. Para corregir eso, tendrás que ajustar el monitoreo aplicando algunos filtros basados en lo que ofrece su plataforma de monitoreo social.Cómo medir SOV para canales de medios de comunicaciónEstoy seguro de que ahora entiendes la esencia. Podemos seguir y seguir en términos de canales de marketing, así que terminaré esto con canales de marketing masivo que dieron origen a SOV.La métrica esencial de los medios de comunicación para canales como la televisión o la radio son los puntos de clasificación brutos (GRP). No solo es adecuado para medir el SOV, sino que también se usa a menudo como una unidad de precio para cotizar los costos de la campaña.El GRP se calcula multiplicando el alcance de la audiencia por la frecuencia de exposición durante un período específico. Si tu anuncio se transmite cinco veces con un alcance del 12% y tres veces con un alcance del 15%, su GRP es 60 + 45 = 105.Todas las casas de medios serios tienen y compartirán las métricas que necesitas. Me gustaría poder agregar algo de experiencia personal aquí, pero solo he publicado anuncios impresos. Todo lo que puedo decir es que nosotros, los especialistas en marketing predominantemente “digitales”, podemos aprender mucho al mirar el panorama general.ConclusionesEl seguimiento de SOV te permite establecer objetivos de marketing para eSOV, que es crucial para aumentar la participación de mercado. Solo ten en cuenta que medir es una cosa y actuar es otra.Lograr eSOV es un tema completamente diferente. Debes centrarte en eSOV para la activación de ventas a corto plazo y canales de construcción de marca a largo plazo. La combinación de canales que utiliza para lograrlo debe derivarse de tu estrategia de marketing. Mira estos dos videos para obtener más información sobre las estrategias de marketing y la efectividad publicitaria de los mejores.¿Tiene alguna pregunta o comentario? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es Share of Voice? Cómo medirlo en todos los canales"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante el SOV?"
    },
    {
      "level": "H2",
      "text": "Cómo medir el SOV en la búsqueda orgánica"
    },
    {
      "level": "H3",
      "text": "1. Tráfico orgánico general en comparación con la competencia"
    },
    {
      "level": "H3",
      "text": "2. Seguimiento de una muestra representativa de las palabras clave de su sector"
    },
    {
      "level": "H2",
      "text": "Cómo medir el SOV para Google Ads"
    },
    {
      "level": "H2",
      "text": "Cómo medir el SOV para las redes sociales"
    },
    {
      "level": "H2",
      "text": "Cómo medir SOV para canales de medios de comunicación"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Michal Pecánek"
}