{
  "url": "https://ahrefs.com/blog/es/cursos-seo/",
  "slug": "cursos-seo",
  "title": "Los 12 mejores cursos SEO (gratis y de pago) del 2024",
  "description": "Tanto si quieres empezar en SEO como avanzar en tu carrera, esta lista de cursos SEO es para ti.",
  "content": "Iván Fanego Iván Fanego es CEO y fundador de AppCritic, el servicio especializado que ayuda a empresas a posicionarse, crecer y desarrollar a sus clientes con una mezcla agnóstica de Estrategia y Marketing de Contenidos, Construcción de Relaciones y Automatización. Contenido La formación es esencial en SEO, tanto si estás empezando, como si quieres avanzar en tu carrera. Hemos seleccionado una lista de cursos para todos los niveles en español.Antes de empezar con la lista de 12 cursos SEO que hemos preparado, en la que encontrarás tanto cursos básicos como intermedios y avanzados, gratuitos y de pago, vamos a responder a algunas preguntas habituales que surgen al hablar de formación y cursos SEO.ContenidoPreguntas y respuestas sobre la formación SEO¿Qué debo estudiar para ser SEO?No existe algo como “una carrera oficial SEO”, ni un certificado que todas las empresas acepten como válido. Como vas a comprobar en este artículo, hay muchos cursos, para casi cualquier nivel y especialización, hay másters, cursos cortos y una gran variedad de formaciones, pero gran parte de lo que hace un profesional SEO solo se puede aprender con experiencia real, con proyectos propios o de terceros.Debes estudiar para ser SEO, pero también tienes que practicarlo. Y, añado, aunque no te dediques al 100% al SEO (como es mi caso) entender las bases del marketing en buscadores te convertirá en un profesional de marketing más completo.Como mínimo, debes conocer las principales disciplinas dentro del SEO y, después, profundizar en alguna, para convertirte en lo que llamamos una persona profesional en “SEO con forma de T”: es decir, alguien que sabe las bases de todo, pero conoce al menos un área con cierta profundidad.¿Cuánto cuesta un curso de SEO?En esta lista tienes un máster de 5000 € de más de 200 horas y cursos de gran calidad completamente gratuitos.La decisión es tuya, pero, si estás empezando, yo recomendaría aprender lo básico con cualquiera de los cursos gratuitos para principiantes que te recomendamos antes de pagar un máster completo o un curso de cientos de euros.¿Cuánto tiempo se tarda en aprender SEO?Depende de ti.El SEO no es imposible, pero tampoco fácil. No esperes aprender todo de la noche a la mañana. Aunque muchos de los cursos que puedes encontrar en esta lista se completan en unas pocas horas (o menos), asimilar y poner en práctica ese conocimiento lleva mucho más.Puedes adquirir las bases y tener una idea general en unas pocas horas (5 ó 10), pero tardarás cientos de horas y meses, o años de trabajo, en dominar de verdad la disciplina.Y, en cualquier caso, siempre hay algo nuevo que aprender: nuevas herramientas, cambios, novedades… El SEO nunca se está quieto.¿Es difícil aprender SEO?Es muy opinable, pero desde mi punto de vista:El SEO técnico resulta más complejo si no tienes cierta base tecnológica.El SEO on-page, al menos en su base, es relativamente sencillo de aplicar y entender, pero a medida que profundizas, puedes encontrar temas más complejos.La investigación de palabras clave (keyword research) requiere algunas habilidades técnicas (más que nada, de uso de herramientas SEO), pero, sobre todo, capacidad de investigación y curiosidad.El link building, bien hecho, tiene cierto grado de complejidad. La experiencia es clave para detectar las mejores oportunidades.Lecturas complementariasGuía SEO para principiantesLa guía para principiantes al SEO técnico¿Cuánto ganan las personas que se dedican al SEO en España?Según la encuesta de salarios SEO que realizamos junto a Chartud:El salario bruto anual más común en el sector SEO oscila entre los 20.000€ y 30.000€ (44% de los encuestados)Le sigue el rango de 30.000€ a 45.000€ (23%)Un 17% gana menos de 20.000€ brutos al año.El 10% de las personas encuestadas reporta ingresos entre 45.000€ y 60.000€, y el 3% entre 60.000€ y 75.000€.Existen otros estudios sobre este tema:Según Talent, el sueldo medio está en 25.000 € al año, con 20.800 € como salario de entrada en perfiles junior y 44.289 € para perfiles con más años de experiencia.En TalentUnity analizaron anuncios de distintas plataformas (como Glassdoor o Page Personnel) para calcular sueldos medios en distintas disciplinas online. En el caso del SEO, encontraron que los salarios más habituales estaban entre 25.000 y 52.000 € anuales.¿Quiere decir esto que no vas a poder ganar más de 50.000 € al año? No. Conozco especialistas independientes en SEO técnico que no bajan de 100 € por hora y a los que no les falta el trabajo, llegando a superar las 6 cifras de facturación anuales.Además, en Ahrefs hicimos una encuesta a 111 profesionales en Brighton SEO. Los datos están sesgados con profesionales de Reino Unido y otros países de la UE, donde generalmente los precios son más elevados, pero dado que podrías ofrecer tus servicios a nivel internacional, son datos que te pueden interesar:El salario mediano anual era de 49.211 $ (unos 45.000 €).El más alto, 229.652 $ (unos 210.000 €)Las personas especializadas en SEO Técnico eran las que tenían mayores salarios (y más puestos directivos).Más de la mitad (52,3%) aprendió SEO trabajando. Aunque los cursos sean un buen punto de partida, sin experiencia real será difícil que avances en tu carrera.Aproximadamente la mitad trabajaba en agencias SEO, un 42% en empresas y poco más del 8% por su cuenta.Las personas que más ganaban, de promedio, eran las que trabajaban por su cuenta (casi un 10% más de media).La experiencia media era de 6,9 años.Como ves, como ocurre en cualquier carrera profesional, lo que ganes depende de tu experiencia y conocimientos y dónde lo apliques. Pero está claro que puedes ganarte bien la vida trabajando en SEO.Ahora… ¿Cómo empezar a aprender SEO? Si todavía no sabes qué rama te interesa más, ni tienes claro de qué va cada una, lo mejor es empezar por alguno de estos cursos básicos.Cursos SEO de nivel básico (gratis y de pago)Estos cursos son ideales para empezar a entender de qué va el SEO. Hemos elegido cursos que empiezan desde lo más básico, sin necesidad de conocimientos previos, y que te llevarán de la mano hasta que entiendas los fundamentos.Curso SEO para principiantes, de AhrefsQuién ofrece el curso: Ahrefs Duración: 2 horas Profesor: Sam Oh Nivel: Principiante / básico Precio: gratis (no requiere registro) Enlace: Curso de formación en SEO: aprende a conseguir tráfico orgánico de las búsquedasQué aprenderásA lo largo de 14 lecciones Sam Oh nos habla de:Los fundamentos de la optimización de motores de búsqueda y su funcionamiento.Por qué es importante el SEO.Cómo hacer keyword research.Cómo optimizar las páginas web para los motores de búsqueda.Estrategias de link building para conseguir enlaces relevantes para tu web.Las prácticas recomendadas de SEO técnico para principiantes.Este curso cubre los fundamentos SEO, incluyendo investigación de palabras clave, SEO on-page, SEO técnico, y link building.El curso está traducido y doblado al español.Curso en optimización para motores de búsqueda (SEO), de HubSpot (con certificación gratuita)Quién ofrece el curso: HubSpot Duración: 3:39 horas Profesor/a: Alejandro Lenis, Luis Azuaje, Juanita Moreno Nivel: Principiante / básico Enlace: Curso en optimización para motores de búsqueda (SEO)Qué aprenderásCómo evaluar y mejorar el SEO de tu sitio webCómo conseguir enlaces a tu web para aumentar tu visibilidad en la búsqueda orgánicaKeyword research (investigación de palabras clave)Creación y presentación de informes SEOIncluye nociones básicas de uso de Google Analytics y Google Search ConsoleEl curso de formación SEO de HubSpot está diseñado para profesionales del marketing, creadores de contenido y cualquier persona que desee mejorar la visibilidad de su sitio web.Las lecciones son prácticas y están bien explicadas. Además, si apruebas el examen final, obtendrás una certificación gratuita.Fundamentos de SEO para principiantes, de Iván FanegoQuién ofrece el curso: Videocation Duración: 55 minutos Profesor: Iván Fanego (el autor de este post, es decir, yo) Nivel: Principiante / básico Precio: 9,99€ al mes (incluye el resto de cursos de Videocation, más de 200) Enlace: Fundamentos de SEO para principiantesQué aprenderásBeneficios del SEO.Cómo funcionan los buscadores.Keyword research.Qué no hay que hacer.Bases de SEO técnico y link building.Traté de condensar en menos de una hora el conocimiento SEO más importante, ese 20% de cosas que, al final, supone el 80% de los resultados. Obviamente, no puedo ser completamente objetivo con este curso, pero creo que es una buena puerta de entrada para entender las bases del SEO en menos de una hora.Diplomado: de CERO a SEO, de Arianna LupiQuién ofrece el curso: Arianna Lupi Duración: 8 semanas Profesor: Arianna Lupi Nivel: Principiante / básico Precio: 397 $ (acceso durante 4 meses) Enlace: De CERO a SEOQué aprenderásSEO básicoMétricasPresentación de informesCómo vender servicios SEOSi quieres empezar por las bases, pero con un curso más profundo, de mayor duración y que te lleve de la mano por cada tema, puedes probar con el programa de 8 semanas de Arianna Lupi, de CERO a SEO.Bonus: Bloguear para negocios (Blogging for business), de AhrefsCon cualquiera de los 4 cursos mencionados tendrás una base sólida sobre la que empezar a construir.Pero no puedo cerrar el apartado de cursos básicos sin mencionar “Bloguear para negocios” (Blogging for business), el curso que Tim Soulo (director de Marketing de Ahrefs) lanzó hace unos años y que, personalmente, me parece uno de los mejores cursos que he hecho (en general, no solo de SEO).Aunque se centre en blogs, vale para cualquier tipo de negocio. Tras años de haberme peleado con profesionales SEO incapaces de explicar lo que hacían, este curso me abrió los ojos. El único motivo por el que no encabeza esta lista es porque no está traducido al español, aunque con ciertas nociones de inglés, lo podrás seguir perfectamente.Cursos SEO de nivel intermedio (gratis y de pago)En este apartado incluimos cursos que requieren algo más de nivel, aunque tengan una parte de introducción.Cómo crear una web, posicionarla y ganar dinero con ella, de Romuald FonsQuién ofrece el curso: BigSEO / Romuald Fons Duración: +7 horas Profesor/a: Romuald Fons Nivel: Intermedio (pero puede ser apto para principiantes, empieza desde la base) Precio: gratis (no requiere registro) Enlace: Cómo crear una web, posicionarla y ganar dinero con ellaQué aprenderás22 vídeos (y sumando) en los que Romuald Fons desgrana paso a paso cómo crear una web para generar ingresos gracias al SEO.Cómo encontrar temáticas rentablesCómo encontrar temáticas SEOCómo elegir dominio, empezar a usar WordPress…Llega a cubrir temas que van más allá del SEO, como el uso básico de WordPress, configuración de herramientas, de Adsense, e incluso analiza el dinero que genera con la web de irrigadores dentales que crea a lo largo del curso. Si lo que te interesa es crear un proyecto que genere ingresos pasivos, es probablemente la mejor opción (además, tengo que añadir que Romuald Fons es tremendamente carismático y hace unos vídeos muy entretenidos).Puede ser útil para niveles intermedios y principiantes, ya que cubre muchos temas en profundidad, pero explicando todo desde la base.Curso de SEO y posicionamiento en Google, de Jorge JaramilloQuién ofrece el curso: Udemy Duración: 7 horas Profesor/a: Jorge Jaramillo Nivel: Básico a intermedio Precio: 109,99 (17,99€ con código, fluctúa bastante) Enlace: Curso de SEO y Posicionamiento en Google [ACTUALIZADO]Qué aprenderásEl curso parte desde las bases, pero llega hasta contenidos relativamente medios o incluso algo avanzados. Casi 30.000 estudiantes han puntuado con un 4,3 sobre 5 este curso de 7 horas que incluye:Diferencias entre SEO y SEM.Diferentes entre white, gray y black hat SEO.Mejoras de velocidad en la página.CDN y seguridad.SEO Local.Es un curso muy completo que te va acompañando con ejemplos y casos prácticos.Dispara tus visitas 2, de Dean Romero y Jesús RoldánQuién ofrece el curso: Dispara tus visitas 2 Duración: varias horas Profesor/a: Dean Romero, Jesús Roldán Nivel: Intermedio Precio: 397 € Enlace: Dispara tus visitas 2Qué aprenderásLos fundamentos de todas las disciplinas básicas (keyword research, seo on-page, etc.)Cómo encontrar nichos rentablesUso de herramientas (Search Console, DinoRank, Ahrefs…)Generación de contenidosUn curso muy completo que incluye soporte y resolución de dudas. Más de 1300 personas han apostado por una de las leyendas SEO de este país.Cursos SEO de nivel avanzado y especializados (gratis y de pago)La oferta de cursos avanzados es mucho más reducida: la mayor parte de la oferta se concentra en los cursos básicos. A modo de ejemplo, no tienes más que ir a Udemy (una de las plataformas de cursos más populares), poner “SEO” en el buscador y echar un vistazo al reparto entre cursos de nivel principiante, intermedio y experto:¡Solo el 3,5% son cursos avanzados!¿Por qué? Yo diría que por dos motivos: hay más personas en la base de la pirámide (sin conocimientos) y una vez que saben las bases y están trabajando, es más probable que sigan aprendiendo en su puesto.En cualquier caso, aquí van algunos cursos avanzados o especializados en temas concretos.Curso de SEO para Ecommerce de EcommasterQuién ofrece el curso: Ecommaster Duración: varias horas Profesor/a: Sergio Vázquez, Iván Torrente, Juan Seguí, Miguel Ángel Pau Nivel: De intermedio a avanzado Precio: 90 € Enlace: Curso de SEO para EcommerceQué aprenderásAuditorías SEOUso de herramientasSEO on-page y off-pageOptimización para ecommerceEl curso incluye la grabación de sesiones de hasta 2 horas en las que se profundiza en todo tipo de técnicas. Está claramente enfocado a eCommerce y venta online, con secciones específicas para WooCommerce y otras plataformas de ecommerce.Curso de SEO avanzado, PosgradoSEO de BIGSEOQuién ofrece el curso: BIGSEO Duración: 2 horas Profesores: Profesionales en activo. Nivel: De intermedio a avanzado Precio: 997 € Enlace: Curso de SEO avanzado - PosgradoSEOQué aprenderásSEO Estratégico, Técnico y AnalíticoProcesos SEO de profesionales especializados.Todas las disciplinas de base (keyword research, link building…)Arquitectura web, optimización, etc.BIGSEO ya ha aparecido antes en este post. En este curso avanzado (pero que cuenta con lecciones introductorias e intermedias) profundizan en aspectos técnicos, estratégicos y mucho más específicos.Máster en Search Marketing de Internet RepúblicaQuién ofrece el curso: Internet República Duración: 200 horas Profesores Carlos Estévez, Tomás Rufino, Aleyda Solís, Agustín Díaz Serrano Nivel: avanzado Precio: 5.000 € Enlace: Máster en Search MarketingQué aprenderásDesarrollar e implementar estrategias de search marketing (SEO/SEM) personalizadas para satisfacer las necesidades de cada proyecto.Llevar a cabo las tareas diarias de un consultor SEO, como auditorías, keyword research y generación de informes.Gestionar proyectos de SEO y SEM para clientes o internamente.Dominio de herramientas como Excel, Google Analytics y herramientas específicas SEO.Internet República es una de las agencias SEO con más experiencia y prestigio en España. Llevan más de 6 años con un máster que abarca mucho más que SEO, ofreciendo una visión completa del Search Marketing (pagado, orgánico y analítica).Además, incluye una triple titulación (la propia de Internet República, de la Universidad Isabel I y de EEME Business School). Conozco personalmente a gente que cursó el máster hace años y lo recomienda sin dudarlo, destacando su enfoque práctico.Bonus: Curso de link building avanzado, de AhrefsQuién ofrece el curso: Ahrefs Duración: 48 minutos Profesor/a: Sam Oh Nivel: Avanzado Precio: gratis (no requiere registro) Enlace: Curso de link building avanzado (en inglés)Otro curso, que, de estar en español, podría encabezar la lista. Sam Oh va directo al grano, aprovechando al máximo 48 minutos para profundizar al máximo en técnicas avanzadas de link building, tocando temas como la creación de un sistema escalable que puedes implementar en tu organización.Lecturas complementariasLink Building para SEO: guía para principiantesAhora te toca elegirHay tantos cursos y formaciones que es fácil caer en la parálisis por el análisis. Así que aquí van unas palabras de ánimo:Si estás empezando, elige uno de los cursos básicos y complétalo. Si no quieres dedicar muchas horas, puedes empezar con el curso para principiantes de Ahrefs que imparte Sam, que en apenas 2 horas te dará una visión global.Si eres más de leer que de ver vídeos, nuestra guía SEO para principiantes es un gran activo.Si estás en un punto más avanzado y estás pensando en una formación más larga, antes de comprar el curso, prueba alguna de las lecciones gratuitas que ofrecen casi todos los cursos.En cualquier caso, recuerda que si no pones en práctica lo que vas aprendiendo, no te servirá de nada. Así que idealmente crea un proyecto propio donde puedas ir probando lo que aprendes.¿Crees que falta algún curso interesante? Cuéntanoslo por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Los 12 mejores cursos SEO (gratis y de pago) del 2024"
    },
    {
      "level": "H2",
      "text": "Preguntas y respuestas sobre la formación SEO"
    },
    {
      "level": "H3",
      "text": "¿Qué debo estudiar para ser SEO?"
    },
    {
      "level": "H3",
      "text": "¿Cuánto cuesta un curso de SEO?"
    },
    {
      "level": "H3",
      "text": "¿Cuánto tiempo se tarda en aprender SEO?"
    },
    {
      "level": "H3",
      "text": "¿Es difícil aprender SEO?"
    },
    {
      "level": "H3",
      "text": "¿Cuánto ganan las personas que se dedican al SEO en España?"
    },
    {
      "level": "H2",
      "text": "Cursos SEO de nivel básico (gratis y de pago)"
    },
    {
      "level": "H3",
      "text": "Curso SEO para principiantes, de Ahrefs"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Curso en optimización para motores de búsqueda (SEO), de HubSpot (con certificación gratuita)"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Fundamentos de SEO para principiantes, de Iván Fanego"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Diplomado: de CERO a SEO, de Arianna Lupi"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Bonus: Bloguear para negocios (Blogging for business), de Ahrefs"
    },
    {
      "level": "H2",
      "text": "Cursos SEO de nivel intermedio (gratis y de pago)"
    },
    {
      "level": "H3",
      "text": "Cómo crear una web, posicionarla y ganar dinero con ella, de Romuald Fons"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Curso de SEO y posicionamiento en Google, de Jorge Jaramillo"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Dispara tus visitas 2, de Dean Romero y Jesús Roldán"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H2",
      "text": "Cursos SEO de nivel avanzado y especializados (gratis y de pago)"
    },
    {
      "level": "H3",
      "text": "Curso de SEO para Ecommerce de Ecommaster"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Curso de SEO avanzado, PosgradoSEO de BIGSEO"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Máster en Search Marketing de Internet República"
    },
    {
      "level": "H4",
      "text": "Qué aprenderás"
    },
    {
      "level": "H3",
      "text": "Bonus: Curso de link building avanzado, de Ahrefs"
    },
    {
      "level": "H2",
      "text": "Ahora te toca elegir"
    }
  ],
  "author": "Iván Fanego"
}