{
  "url": "https://ahrefs.com/blog/es/digital-pr/",
  "slug": "digital-pr",
  "title": "Digital PR: La guía para principiantes para hacer que tu marca no pase desapercibida",
  "description": "Las relaciones públicas digitales y el SEO van de la mano. El digital PR no solo es beneficioso para tu web de por sí, también puede impulsar todos tus esfuerzos de SEO. Te enseñamos algunos consejos sobre por dónde empezar y cómo asegurarte el éxito.",
  "content": "Jenny Abouobaia Jenny es una consultora SEO galardonada que se especializa en el uso de relaciones públicas de marca para maximizar los resultados de SEO para los clientes mediante la construcción de E-A-T, con una amplia experiencia en afiliados de nicho y SEO técnico. Contenido Las relaciones públicas siempre han sido un factor fundamental a la hora de construir una marca. En el mundo digital no es distinto. Simplemente se ha pasado de las vallas publicitarias en edificios y los comentarios de prensa a las campañas creativas digitales y las citas en medios online.¿Lo mejor de todo esto? Las relaciones públicas digitales y el SEO van de la mano. El digital PR no solo es beneficioso para tu web de por sí, sino que también puede impulsar todos tus esfuerzos de SEO. Es la forma más pura de “white hat” link building.Como especialista en el uso de las relaciones públicas digitales para el SEO, voy a profundizar en el digital PR y sus numerosas ventajas. Así como a darte algunos consejos sobre por dónde empezar y cómo asegurarte el éxito.Antes que nada, veamos qué son las relaciones públicas digitales y por qué son tan importantes.¿Qué son las relaciones públicas digitales?El digital PR es una técnica promocional utilizada por marketers y especialistas en relaciones públicas. Cuando se hace bien, utiliza técnicas tradicionales de RRPP en un entorno digital para dar a conocer una marca, empresa o negocio.El objetivo de las relaciones públicas digitales es adelantarse a los acontecimientos y hacer que tu marca no pase desapercibida.Al igual que cualquier otra forma de marketing, las relaciones públicas digitales deben basar su estrategia en los requisitos y objetivos individuales de la marca o empresa. La estrategia combina una serie de técnicas, como la promoción de contenidos, historias o datos, para obtener resultados que beneficien a la estrategia general de marketing.¿Por qué son importantes las relaciones públicas digitales?Las RRPP digitales tienen una gran cantidad de beneficios además de mejorar el conocimiento de la marca. Beneficios como impulsar el tráfico orgánico, leads, ventas, o promover el compromiso social.A veces el digital PR se considera como una forma de link building, pero eso es sólo la punta del iceberg. Las relaciones públicas digitales tienen que llevarse a cabo con el SEO. De hecho , el propio John Mueller (Google) dijo que suele ser más importante que el SEO técnico.Yeah I see it as a great thing. Our industry is growing. More spend. More clients. More jobs. Just need the people. Everyone in the industry should benefit from this— Carrie Rose (@CarrieRosePR) January 23, 2021Aunque las relaciones públicas digitales no son una técnica de SEO, realmente complementan los esfuerzos de SEO al mejorar la experiencia, autoridad y confiabilidad (E-A-T, de sus siglas en inglés expertise, authoritativeness, and trustworthiness) de la marca y quienes están detrás de ella. Además de crear backlinks de alta calidad y mucha autoridad.El hecho es que, independientemente de los canales de marketing orgánicos y de pago en los que te enfoques, las RRPP digitales siempre tienen que formar parte de tu estrategia de marketing, independientemente del tamaño de tu empresa.¿Cuáles son los principales objetivos del digital PR?Si eres nuevo en el mundo de las relaciones públicas digitales, probablemente te preguntes por qué deberías invertir tiempo y dinero en una estrategia de digital PR, y qué sentido tiene exactamente. Analicemos algunas de las razones principales por las que sería una buena estrategia para tu negocio:Cobertura de marcaCrear concienciaFormar relaciones a largo plazo con los periodistasImpulsar los esfuerzos de SEOMayor y mejor cobertura de marcaLa cobertura mediática de las marcas siempre ha sido uno de los principales objetivos de las RRPP, independientemente de si hablamos de un enfoque digital o tradicional.El respaldo de un tercero a tu empresa, especialmente si procede de un medio de comunicación con mucha autoridad, es la mejor publicidad para tu empresa. Tu marca y quienes la respaldan se presentan como expertos en la materia. Esto genera, instantáneamente, una confianza entre tu público y tus clientes potenciales.Crear conciencia y dar forma a la imagen de marca.Si eres “el nuevo” y tu negocio acaba de empezar, crea una presencia online que permita a tu público objetivo saber quién eres, a qué te dedicas y cuáles son tus valores. De esta forma, tu nombre llegará a tu público objetivo de la forma que tú quieras.Si se hace de una forma en que seas noticia, la impresión será más duradera.Pero no se trata sólo de hacerse un nombre al arrancar un negocio. Las marcas consolidadas tienen que buscar formas novedosas y emocionales de llegar a su público ideal para mantener la notoriedad de su marca y evitar que la competencia les saque ventaja.Formar relaciones a largo plazo con los periodistas.A diferencia de lo que ocurría en los medios impresos tradicionales, un periodista digital nunca siempre revela sus fuentes. Esto significa mencionar tu marca y citar con frecuencia a los principales expertos de tu negocio.Ahora bien, muchos consideran que hablar con periodistas con regularidad (en mi caso, a diario) es un proceso largo y tedioso, pero es el primer paso para mantener relaciones con los periodistas, cuyo valor nunca debe subestimarse.Como alguien que ha estado utilizando el digital PR para impulsar los esfuerzos de SEO para sus clientes a lo largo de los años, he construido relaciones continuas con cientos de periodistas.A día de hoy, dispongo de una base de datos personal de miles de periodistas estadounidenses y británicos de los medios de comunicación más grandes. Esto significa que, hoy en día, puedo contactar directamente con los periodistas para las campañas y comunicados de prensa que dirijo para mis clientes.También hay muchísimos periodistas que acuden a mí directamente (o a mis clientes) que buscan citas de expertos. Es decir, cuando escriben un artículo relacionado con mi experiencia, se ponen en contacto conmigo para ver si puedo proporcionarles una cita.Hablar con periodistas al principio no es fácil, pero es posible establecer relaciones duraderas a largo plazo. Merece muchísimo la pena cuando los periodistas acuden a ti y publican con frecuencia tu marca en webs con mucha autoridad.Impulsar los esfuerzos de SEOAunque la finalidad principal de las relaciones públicas es siempre construir tu marca, en el aspecto digital hay muchísimos beneficios secundarios que benefician al SEO.Más adelante hablaremos de cada uno de ellos y de por qué son importantes, pero los más evidentes son los enlaces.Pero no cualquier enlace. No es un enlace al azar de un guest post que nadie va a leer. Estoy hablando de enlaces que realmente consiguen clics. Enlaces que dirigen el tráfico a un contenido o activo, que fomentan la participación y los shares. Enlaces que impulsan la búsqueda de marca.Las páginas con más backlinks suelen aparecer más arriba en los resultados de búsqueda. El tráfico de búsqueda en Google de una página está fuerte y positivamente correlacionado con el número de webs que enlazan con ella, según nuestro análisis de 1.000 millones de páginas:Además, no hay nada más eficaz que ser citado en webs de mucha autoridad como gurú de un cierto tema.¿Cuáles son los principales beneficios de las relaciones públicas digitales?Por ahora sabemos de qué van las relaciones públicas. ¿Qué podemos esperar?Más ventas y clientes potencialesCrear autoridad con enlaces de medios de prestigioCrear enlaces que los competidores no puedan imitarGanar confianza como el experto del sectorConseguir enlaces que generen tráfico de referenciaMás ventas y clientes potencialesEn todos mis años trabajando con clientes como SEO, he descubierto que conseguir más leads y más ventas siempre está en la lista de KPIs, independientemente de otros objetivos que se puedan tener.Lo mejor del digital PR es que permite que tu marca llegue a las personas adecuadas en el momento oportuno. Una campaña bien coordinada puede garantizar que un producto que acabas de lanzar, una venta de temporada o una oferta especial sean vistos por tus clientes ideales y promuevan una gran afluencia de clientes potenciales altamente relevantes y cualificados.RECOMENDACIÓNLa clave es la relevancia. La mayoría de la gente se confunde con la relevancia temática o de nicho, y piensa en ella de la misma forma que en el link building tradicional.La creación de enlaces para SEO en webs de nichos relevantes puede ayudar a mejorar la relevancia temática para que Google comprenda mejor de qué va tu web. Sin embargo, en las relaciones públicas digitales, relevancia significa poner tu empresa, producto o servicio delante de un público relevante.Por ejemplo, si tienes una empresa de ciberseguridad B2B, no te interesa una mención en Cybersecurity Weekly. Lo que realmente quieres es aparecer en los medios que los CEOs y fundadores lean, tales como Harvard Business Review, Forbes y Entrepreneur.Construye autoridad con enlaces de medios reconocidosUno de los principales beneficios de las relaciones públicas digitales es construir enlaces a webs con mucha autoridad. Enlaces que no podrías conseguir a través de otras formas de link building.A lo largo de los años, he conseguido muchísimos enlaces para clientes a través de medios como Forbes, The New York Times, The Telegraph, BuzzFeed, y otros.Estos enlaces no sólo pueden mejorar significativamente la autoridad de tu web dentro de tu nicho (desde el punto de vista de los motores de búsqueda), sino que también pueden hacer que tu marca se destaque de la competencia.Si alguien busca el nombre de tu empresa, todo el mundo espera que el primer resultado sea tu web. Pero posicionarse además en los puestos #2, #3 y #4 no es tarea fácil.Crea enlaces que los competidores no puedan replicar para adelantarte a la competenciaComo ya se ha mencionado, los enlaces adquiridos a través del digital PR son más difíciles de reproducir con los métodos tradicionales de link building. Además, cada caso es distinto.Está claro que tus competidores también pueden hacer digital PR, pero eso no garantiza que estén trabajando en características relevantes para adquirir enlaces o que incluso salgan en algún medio de prestigio.¿Qué significa esto? Si un competidor importante está comprobando continuamente tu perfil de backlinks para robarte tus enlaces, no es tan sencillo como publicar un guest post en la misma web.Gana confianza como experto en la industriaReconozcámoslo, cualquiera puede decirte lo importante que es tener una página “Acerca de” que esté bien escrita, o un vídeo autopromocional en YouTube, para conseguir cierta confianza y autoridad en tu sector. Pero que un medio con autoridad te respalde… no tiene precio.No hay nada que transmita más seguridad a un cliente potencial que alguien con autoridad líder de un sector te presente como un experto. Esto genera, instantáneamente, una confianza entre ti (visto como un especialista en tu campo) y las personas que estén directamente interesadas en lo que tienes que ofrecer.Personalmente he trabajado muchísimo con webs de nicho, por lo que me suelen pedir que comente sobre temas como intercambios de webs, como este ejemplo publicado hace no mucho en affilimate.com:Si sueles proporcionar citas a periodistas que estén bien redactadas y que sean prácticas, lo más seguro es que te añadan como fuente habitual.RECOMENDACIÓNComparte siempre en las redes sociales los artículos en los que se publiquen tus citas, sobre todo en LinkedIn y Twitter. Los periodistas tienen KPIs sobre engagement y cuántas veces se ha compartido algo. En otras palabras, las fuentes que hacen el esfuerzo de mover los contenidos en las redes sociales tienden a ser utilizadas de nuevo.Obtén enlaces que impulsen el tráfico de referenciaCon los enlaces adquiridos mediante los métodos tradicionales de link building, el objetivo es desarrollar señales de confianza de webs con autoridad y relevantes para el nicho. De esta forma, estas webs le “comunicarán” a Google que tu web es una autoridad en el nicho, ofreciendo así a los motores de búsqueda una comprensión mejorada del contenido de tu web.El problema es que estos enlaces no siempre le dicen a tu audiencia que eres una autoridad y, normalmente, no tienen ningún valor real para el usuario.Cuando uno se promociona a sí mismo y a su marca como una autoridad para sus clientes potenciales utilizando métodos de relaciones públicas digitales, los enlaces se utilizarán para dirigir al usuario a un recurso relevante y atractivo.Por ejemplo, una noticia que se haga viral sobre un estudio pionero que haya realizado tu empresa, puede contener un enlace que dirija a los lectores a los resultados.Estos enlaces impulsan el tráfico, los social shares y el engagement.¿Hay alguna desventaja en el digital PR?Altamente competitivoDebido a la naturaleza de las relaciones públicas, el nivel de competencia es extremo. Algunas de las técnicas más populares (como los medios de comunicación “ganados”, en los que presentas a los periodistas tus ideas como experto del sector) se producen rápidamente. Por lo que hay miles de personas esperando al más mínimo interés para lanzarse al ataque.Los periodistas publican sus consultas en diversas plataformas por la tarde y quieren tener todas las respuestas al final del día. Esto te obliga a ser el primero en llegar (además de ofrecer algo único y de alta calidad) para adelantarte a la competencia.Siempre cambianteSólo en los últimos seis meses, he visto cambios drásticos en el espacio de las relaciones públicas digitales, especialmente como alguien que utiliza específicamente las RRPP para impulsar el SEO.Las técnicas que antes tenían mucho éxito ya no funcionan, y las plataformas que antes eran una mina de oro están sobresaturadas y ofrecen pocos resultados.Para los que no están acostumbrados a trabajar en un entorno tan cambiante, como los propietarios de pequeñas empresas, puede ser difícil estar al tanto de cuál es el mejor plan de acción para obtener resultados.(Pero como SEO, estás más que acostumbrado a estar alerta. Es decir, estás más que acostumbrado a que Google cambie de la noche a la mañana su algoritmo).Los resultados no están garantizadosHablando de resultados, esto es lo que ocurre con las relaciones públicas digitales: Nada está garantizado. Principalmente por las dos razones anteriores.Puedes hablar con 20 periodistas y no salir en ningún medio. O que se te ocurra una idea muy buena para una campaña, hagas un estudio y creas activos en torno a los resultados, pero un competidor lanza algo prácticamente igual el día antes de la publicación… Sí, me ha pasado.Además, si no tienes la mejor estrategia o simplemente no está bien ejecutada, lo más probable es que no te elijan los periodistas o no obtengas la respuesta de tu público objetivo.5 técnicas de relaciones públicas digitales que funcionanAhora que hemos visto de qué van las relaciones públicas digitales, así como de sus pros y sus contras, echemos un vistazo a algunas de mis técnicas favoritas de digital PR:Relaciones públicas reactivas (medios ganados)Campañas proactivas basadas en datosComunicados de prensaCampañas creativasRobo de noticias1. Relaciones públicas reactivas (medios ganados)Las relaciones públicas reactivas (también llamadas medios ganados) son un método en el que un periodista publica una consulta para un artículo que está escribiendo, lo que requiere que los expertos en la materia faciliten comentarios que puedan usarse como fuente de autoridad.Este método funciona increíblemente bien para empresas de todos los tamaños y ayuda a construir E-A-T y enlaces de alta autoridad.Existen varias plataformas y métodos distintos para las relaciones públicas reactivas, en función del tipo de webs a las que quieras dirigirte (nichos, geografía, etc.). Todo lo que tienes que hacer es visitar la web y registrarte como fuente, y las consultas te llegarán directamente a tu email.La plataforma más popular en español es Reportaro. Es de pago, con un periodo de prueba gratuito de 15 días. Tiene medios muy populares en España como La Sexta, Antena 3 o ABC.Si te diriges a un público que hable inglés, tienes plataformas muy grandes (y muy saturadas). Tienes HARO y Terkel para EEUU y Reino Unido, y SourceBottle para Australia. Aunque una alternativa muy atractiva son las plataformas de pago menos saturadas y con más calidad como Muck Rack, Prowly, JournoLink y JustReachOut.RECOMENDACIÓNCuando utilices específicamente esta técnica para el SEO, no pierdas el tiempo enviando consultas a webs de las que no quieres obtener enlaces.Utiliza el Site Explorer de Ahrefs para examinar los medios antes del pitching. Si quieres un empujón de SEO, puedes comprobar muy rápido la puntuación de Domain Rating (DR) y el tráfico de una web.Además, comprueba siempre su perfil de backlinks para asegurarte de que no haya nada raro. Evita cualquier web que tenga un perfil de backlinks lleno de enlaces spam o que parezca formar parte de una red pública de blogs (PBN).La clave de las relaciones públicas reactivas es redactar propuestas únicas y prácticas para los periodistas. Ofrece algo que tus competidores no sepan y asegúrate de que esté bien escrito.Los periodistas quieren copiar y pegar. Hazles el trabajo lo más fácil posible.Lectura recomendada: Cómo crear backlinks y obtener prensa con HARO [Case study]2. Campañas proactivas basadas en datosA los periodistas les encantan los datos.¿Has llevado a cabo una investigación innovadora? ¿Tiene estadísticas que llamen la atención?La idea de estas campañas es tener una idea sobre algo de interés periodístico sobre lo que se puedan recopilar datos exhaustivos y, a continuación, dirigirse proactivamente a los periodistas con una historia respaldada por estos datos.Hace poco creé una campaña para un cliente del sector de RRHH sobre mentir en el currículum para puestos en remoto. Realizamos un estudio en el Reino Unido y resultó que más de un tercio de los candidatos mentían para conseguir estos puestos de teletrabajo.Creamos un contenido exhaustivo en el que se detallaban todos los resultados en la web del cliente, junto con una infografía con los datos clave. Cientos de medios de comunicación, entre ellos MSN y Yahoo, hablaron de esta historia: 3. Comunicados de prensa¿Acabas de ganar un premio? ¿Se han fusionado un par de empresas nuevas? Si tienes alguna noticia de interés periodístico, un comunicado de prensa es una buena forma de conseguir tracción, crear conciencia de marca y amplificar tu posición como autoridad en tu sector.Este es un ejemplo de un comunicado de prensa que distribuimos a principios del 2022 sobre actualizaciones importantes de palabras clave:Sin embargo, hay ciertas fórmulas que se pueden seguir a la hora de redactar comunicados de prensa. Tienen que estar escritos y formateados correctamente. Para saber cómo hacerlo, puedes leer esta guía de Rebecca Liew.4. Campañas creativasYa sabemos que a los periodistas les encantan los datos, pero eso no significa que todas las campañas tengan que basarse en ellos para conseguir tracción.Las marcas grandes tienen cada vez más éxito con las campañas creativas que incluyen imágenes llamativas o conceptos innovadores para captar la atención y hacerse virales.Un ejemplo es la campaña del anillo de diamantes Haribo de Taylor & Hart, creada por la agencia creativa de RRPP Rise at Seven: Esta campaña tocó la fibra sensible del país, condujo a 8.500 personas a su landing page y captó casi 40 clientes potenciales… ¡para comprar un anillo de £25.000!5. Robo de noticiasPara que esta técnica tenga éxito tienes que “estar a la última”.El “newsjacking” consiste en seguir las noticias a medida que se producen y aprovecharlas con comentarios y artículos de liderazgo de opinión. Es una técnica permanente que utilizan los profesionales de las RRPP para posicionar a las marcas en el centro de un tema de actualidad.La mayoría de los que hacen newsjacking de forma exitosa cuentan con equipos que controlan las noticias a diario en busca de historias que se puedan aprovechar. Para los novatos, una forma de empezar es configurar Google Alerts para que te avisen de temas específicos. De este modo, puedes responder rápidamente con comentarios de expertos.Lectura recomendada: 9 Técnicas de RRPP con ejemplos de campañasReflexiones finalesLas relaciones públicas digitales son una de las formas más eficaces de establecer tu marca y a quienes la respaldan como una autoridad en su espacio. Además, se complementa con el SEO para potenciar la creación de enlaces.¿Es hora de empezar a utilizar el digital PR para que tu marca no pase desapercibida?Como siempre, si tienes alguna pregunta, nos puedes contactar en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Digital PR: La guía para principiantes para hacer que tu marca no pase desapercibida"
    },
    {
      "level": "H2",
      "text": "¿Qué son las relaciones públicas digitales?"
    },
    {
      "level": "H2",
      "text": "¿Por qué son importantes las relaciones públicas digitales?"
    },
    {
      "level": "H2",
      "text": "¿Cuáles son los principales objetivos del digital PR?"
    },
    {
      "level": "H3",
      "text": "Mayor y mejor cobertura de marca"
    },
    {
      "level": "H3",
      "text": "Crear conciencia y dar forma a la imagen de marca."
    },
    {
      "level": "H3",
      "text": "Formar relaciones a largo plazo con los periodistas."
    },
    {
      "level": "H3",
      "text": "Impulsar los esfuerzos de SEO"
    },
    {
      "level": "H2",
      "text": "¿Cuáles son los principales beneficios de las relaciones públicas digitales?"
    },
    {
      "level": "H3",
      "text": "Más ventas y clientes potenciales"
    },
    {
      "level": "H3",
      "text": "Construye autoridad con enlaces de medios reconocidos"
    },
    {
      "level": "H3",
      "text": "Crea enlaces que los competidores no puedan replicar para adelantarte a la competencia"
    },
    {
      "level": "H3",
      "text": "Gana confianza como experto en la industria"
    },
    {
      "level": "H3",
      "text": "Obtén enlaces que impulsen el tráfico de referencia"
    },
    {
      "level": "H2",
      "text": "¿Hay alguna desventaja en el digital PR?"
    },
    {
      "level": "H3",
      "text": "Altamente competitivo"
    },
    {
      "level": "H3",
      "text": "Los resultados no están garantizados"
    },
    {
      "level": "H2",
      "text": "5 técnicas de relaciones públicas digitales que funcionan"
    },
    {
      "level": "H3",
      "text": "1. Relaciones públicas reactivas (medios ganados)"
    },
    {
      "level": "H3",
      "text": "2. Campañas proactivas basadas en datos"
    },
    {
      "level": "H3",
      "text": "3. Comunicados de prensa"
    },
    {
      "level": "H3",
      "text": "4. Campañas creativas"
    },
    {
      "level": "H3",
      "text": "5. Robo de noticias"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Jenny Abouobaia"
}