{
  "url": "https://ahrefs.com/blog/es/distribucion-contenido/",
  "slug": "distribucion-contenido",
  "title": "Guía para la distribución de contenidos: qué es y cómo llevarla a cabo",
  "description": "No basta con crear contenidos de calidad: hay que asegurarse de que los contenidos lleguen al público objetivo. En esta guía, aprenderás qué es la distribución de contenidos y cómo crear y poner en marcha una estrategia de distribución de contenidos ganadora.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Seguramente hayas oído la expresión “El mejor contenido no gana, lo hace la distribución”.No basta con crear contenidos de calidad: necesitas una estrategia de distribución para asegurarte de que tus contenidos lleguen realmente al público al que van dirigidos. De lo contrario, solo estarás perdiendo tiempo y dinero.En esta guía, aprenderás qué es la distribución de contenidos y cómo crear y poner en marcha una estrategia de distribución de contenidos ganadora:¿Qué es la distribución de contenidos?Tipos de canales de distribución de contenidosCrear una estrategia de distribución de contenidos exitosa¿Qué es la distribución de contenidos?La distribución de contenidos es el proceso de publicación y promoción de contenidos en diversos formatos a través de múltiples canales para llegar al mayor número de personas posible.Tipos de canales de distribución de contenidosLos principales canales de distribución son los propios, los adquiridos y los de pago.Canales propiosUn canal propio es aquel que controlas totalmente.Algunos ejemplos de canales propios son:Web o blogLista de emailTwitterTikTokYouTubeWeb o blogTu sitio web es el canal principal que posees.Los clientes de Ahrefs utilizan las herramientas SEO en nuestro sitio web, pero también publicamos y distribuimos contenido en él.Existen cinco tipos de contenido principales en nuestra web.Guías. Recursos para ayudar a los clientes a atraer más tráfico orgánico a sus webs.Estudios de datos. Información y estadísticas exclusivas sobre nuestro sector.Información de producto. Actualizaciones sobre las novedades de los productos.Herramientas SEO gratuitas. Herramientas interactivas para que los clientes potenciales prueben nuestro servicio de pago.Contenido visual. Gráficos, imágenes e infografías para explicar temas complejos.Lista de emailEn la barra de navegación superior y en la barra lateral de muchos artículos de nuestra web, hay una casilla de suscripción.Cuando un lector facilita su dirección de correo electrónico, le ofrecemos, a cambio, una newsletter semanal en la que compartimos recursos valiosos de SEO y marketing, así como actualizaciones de productos.Por ejemplo, la newsletter de diciembre incluía nuestra nueva métrica Potencial de tráfico, un vídeo resumen y un post con actualizaciones de productos.TwitterAhrefs tiene 140.000 seguidores en Twitter y, allí, distribuimos contenidos variados.Publicamos resúmenes de artículos y enlazamos a los artículos en nuestra web.También publicamos hilos de tweets. Cada hilo es una serie de tweets conectados, similar a una guía paso a paso.TikTokSeguramente hayas oído hablar de Miss Excel, que publica consejos sobre Excel en TikTok.Consigue, con regularidad, más de 100.000 visitas por publicación en TikTok.YouTubeYouTube es un canal en el que distribuimos contenidos de vídeo a los visitantes y a nuestros suscriptores.Además de tutoriales sobre el uso de nuestras herramientas, publicamos casos prácticos y experimentos que esperamos que capten la atención de nuestro público.Muchos de nuestros vídeos proceden de artículos existentes.Canales adquiridosUn canal adquirido o ganado es aquel en el que tu contenido aparece porque es lo suficientemente bueno como para ser aprobado por un editor, un gatekeeper o un moderador.Algunos ejemplos de canales adquiridos son:RedditGrupos de FacebookForosGuest postsCanales de pagoUn canal de pago requiere un pago para poder distribuir el contenido.En Ahrefs, a veces invertimos en canales de pago para distribuir nuestro contenido y poder llegar al mayor número posible de personas relevantes.Algunos ejemplos de canales de pago son:Twitter AdsGoogle AdsQuuu PromotePatrociniosRetargetingPublicidad nativa (Taboola y Outbrain)Cómo crear una estrategia de distribución de contenidos ganadoraHoy en día, con tantos canales disponibles para distribuir contenidos, saber por dónde empezar puede resultar un poco agobiante. Veamos cómo crear, paso a paso, una estrategia de distribución de contenidos sencilla y que funcione.Paso 1. Publica contenido en tu canal principalToda empresa debería empezar por elegir un canal propio en el que centrarse y, a continuación, decidir qué contenido publicar en él.9 de cada 10 veces, este canal suele ser:Web/blogYouTubeUna cuenta de redes sociales (Twitter, Tiktok, Instagram, etc.)La mejor opción de canal dependerá del tipo de contenidos que ya produzcas y de si tienes la experiencia necesaria para crear más contenidos para ese canal.Por ejemplo, si eres una persona tímida delante de la cámara, YouTube probablemente no sea la mejor opción. Lo mejor es que escribas y publiques en tu web o blog.Nuestro canal principal es nuestro sitio web/blog, así que es ahí donde distribuimos la mayor parte de nuestro contenido.PRO TIPSi distribuyes contenido a través de tu web o blog y quieres que la gente te encuentre, es conveniente optimizar el contenido para SEO. Si consigues posicionarte en Google con las palabras clave que te interesan, tu contenido recibirá un montón de tráfico orgánico cada mes.Por ejemplo, según Ahrefs, nuestra guía de operadores de búsqueda de Google se encuentra entre las 100 primeras, con más de 4.200 palabras clave, y recibe unas 15.000 visitas mensuales procedentes de búsquedas orgánicas.Si observamos el gráfico del historial de tráfico orgánico, podemos ver que el tráfico ha fluctuado con el tiempo, pero el artículo ha estado recibiendo miles de visitas orgánicas cada mes desde diciembre de 2018.En otras palabras, optimizar este post para SEO dio como resultado que cientos de miles de personas lo leyeran y lo hicimos publicando y distribuyendo en un solo canal.Lectura recomendada: Cómo escribir contenido SEO que se posicionePaso 2. Empuja el contenido por email y a través de las redes socialesA continuación, tienes que dar a conocer tus contenidos distribuyéndolos a tus canales secundarios: tus redes sociales y tu lista de correo electrónico.El objetivo de la distribución a estos canales es doble:Puedes compartir información y mensajes clave de tu contenido directamente con tus seguidores y suscriptores.Puedes dirigir el tráfico de vuelta a tu contenido principal.Por ejemplo, enviamos todos los posts nuevos del blog a nuestros 140.000 seguidores de Twitter:12 Marketing Podcasts Worth Your Time by @RebLiewWe vetted over 45 marketing podcasts, then shortlisted the most insightful ones to save you time. Did your favourites make the cut? https://t.co/enHVww1BQC— Ahrefs (@ahrefs) February 9, 2022Nuestros más de 100.000 seguidores en Facebook:Nuestros 87.000 seguidores en LinkedIn:Y nuestros cerca de 170.000 suscriptores de la newsletter:Los canales de distribución variarán en función de a quién te dirijas y dónde se muevan online.Nuestros canales son Facebook, Twitter, LinkedIn y el correo electrónico porque tienen sentido para nosotros. No distribuimos contenido en Instagram, Snapchat ni TikTok porque no es donde está principalmente nuestro público.Paso 3. “Empuja” a los canales adquiridosEs un poco más difícil distribuir en canales adquiridos porque tu contenido necesita ser aprobado por un moderador. Aquí hay algunos ejemplos en los que nosotros (Ahrefs) empujamos contenido a canales ganados.RedditCuando nuestro director de marketing, Tim Soulo, distribuyó su guía de investigación de palabras clave, creó una versión breve y simplificada del post para el subreddit /r/bigSEO.Si no incluyera información de valor para el subreddit, los moderadores nunca lo habrían aprobado. De ahí que Reddit sea un canal ganado.Lo mismo ocurre con canales como los grupos de Facebook de terceros.Grupos de FacebookAntes de unirse a Ahrefs, nuestro jefe de contenidos, Joshua Hardwick, creó un vídeo que quería distribuir a la comunidad SEO. Por ello, mostró su vídeo a los administradores de grupos SEO en Facebook y les pidió permiso para publicarlo en sus grupos.Como el contenido era útil, muchos propietarios le permitieron publicar el vídeo.Otros canales ganados en los que puedes mover tus contenidos son los siguientes:Foros (por ejemplo, Quora)Newsletters de tercerosOtros blogs (guest posts)Guest bloggingEl guest blogging consiste en escribir un post para otro blog de tu sector. Es una forma muy buena de distribuir contenidos e ideas, sobre todo si consigues que te publiquen en un sitio con una audiencia grande.Para encontrar sitios relevantes a los que enviar tu artículo como invitado, busca aquellos que ya hayan publicado artículos sobre temas similares.Por ejemplo, si quisiéramos distribuir las ideas compartidas en nuestra guía de investigación de palabras clave, podríamos buscar sitios web que hayan publicado artículos sobre link building porque es posible que estén interesados en un post sobre un tema similar.Así es como se hace en el Content Explorer de Ahrefs:Introduce un tema relacionado, como link buildingCambia el desplegable a En títuloDirígete a la pestaña Sitios webLectura recomendada: Guía del Guest Blogging para SEOPaso 4. “Empuja” a los canales de pagoCuando la distribución de contenidos en canales propios y ganados no es suficiente, es el momento de dar un paso adelante con los canales de pago.Twitter AdsTwitter Ads puede ser una forma rentable de distribuir contenidos. En este vídeo puedes ver nuestros experimentos con los anuncios.Google AdsLos anuncios de Google aparecen encima de los resultados de búsqueda orgánicos en las SERP. Se trata de una forma excelente de llegar a la gente que realmente está buscando tu contenido.Por ejemplo, hace poco distribuimos nuestras herramientas SEO gratuitas a través de los anuncios de Google:TIPPara encontrar palabras clave que tengan potencial de rentabilidad con las que te puedas dirigir en los anuncios de pago, echa un vistazo a las palabras clave con las que se anuncian tus competidores. Para ello, introduce un competidor en el Site Explorer de Ahrefs y dirígete al informe Palabras clave de pago.PatrociniosHace poco decidimos subir un poco nuestro presupuesto de tráfico de pago, utilizándolo para patrocinar a influencers y líderes de opinión de nuestro sector.We’ll be reallocating our paid traffic budget (~$200k💰) for December away from the Google/Facebook—and into sponsoring the industry’s best creators and thought leaders.— Ahrefs (@ahrefs) November 24, 2021Más información sobre nuestros resultados en este hilo:In December 2021 we have reallocated ~$200k (@ahrefs monthly paid traffic budget) into sponsoring creators & thought leaders in our space.In case you missed:https://t.co/VXcP5k7OzSNaturally, quite a few people asked me to share our results & takeaways from this campaign.— Tim Soulo 🇺🇦 (@timsoulo) February 21, 2022Publicidad nativaLos anuncios nativos son anuncios que parecen contenido normal y aparecen en sitios web populares como, por ejemplo, El Economista, Yahoo, MSN, etc.Taboola y Outbrain son mercados populares para anuncios nativos.Esta empresa de café consiguió 10.000 clientes nuevos en seis meses gracias a los anuncios nativos.Facebook adsFacebook te permite impulsar tus publicaciones para que lleguen a más usuarios en su plataforma. Para ello, haz clic en el botón grande “Promocionar publicación” (o Boost post) de la publicación que quieras promocionar.Paso 5. Mide tus resultados con herramientasEl objetivo de la distribución de contenidos es llegar a más gente, por lo que es importante medir el rendimiento para ver la eficacia con la que lo has conseguido. A continuación, te presentamos algunas herramientas que pueden ayudarte.AhrefsSi has publicado contenido en tu sitio web o blog y lo has optimizado para la búsqueda orgánica, es de esperar que, con el tiempo, empiece a posicionarse con palabras clave relevantes en Google.Para comprobarlo, crea una cuenta gratuita de Ahrefs Webmaster Tools e introduce en Site Explorer la URL del contenido que has distribuido. La herramienta mostrará el número de palabras clave y el número estimado de visitas orgánicas mensuales que recibe la página.Por ejemplo, nuestra guía de link building se encuentra entre las 100 primeras para 668 palabras clave y recibe una estimación de 5.300 visitas orgánicas al mes:Twitter (X)X tiene análisis integrados: tan solo tienes que hacer clic en el icono del gráfico de cualquier publicación para ver su alcance.Por ejemplo, el hilo que Joshua publicó sobre la canibalización de palabras clave recibió 275.000 impresiones y 1.400 interacciones.Google AnalyticsGoogle Analytics te ofrece todo tipo de información valiosa sobre tus esfuerzos de distribución de contenidos, incluida la procedencia de los visitantes, el tiempo que han permanecido y si el canal de distribución ha contribuido a una conversión.Lectura recomendada: Las 3 únicas métricas de Google Analytics que tienes que analizarPaso 6. RepiteEl último paso consiste en repetir los seis pasos anteriores.Puedes repetir lo anterior tanto para el contenido reutilizado como para otra pieza de contenido.Por ejemplo, publicamos este estudio sobre Core Web Vitals. Patrick Stox creó un hilo en Twitter y añadió los gráficos clave del estudio a cada tweet.Reflexiones finalesEl propósito de este artículo es compartir los canales de distribución de contenidos más importantes y las ideas sobre cómo desarrollar una estrategia de distribución que llegue a un público más amplio.La elección de las plataformas que utilices para distribuir contenidos y medirlos depende exclusivamente de ti.Recuerda: “No gana el mejor contenido; gana la distribución”. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Guía para la distribución de contenidos: qué es y cómo llevarla a cabo"
    },
    {
      "level": "H2",
      "text": "¿Qué es la distribución de contenidos?"
    },
    {
      "level": "H2",
      "text": "Tipos de canales de distribución de contenidos"
    },
    {
      "level": "H3",
      "text": "Canales propios"
    },
    {
      "level": "H4",
      "text": "Web o blog"
    },
    {
      "level": "H4",
      "text": "Lista de email"
    },
    {
      "level": "H4",
      "text": "Twitter"
    },
    {
      "level": "H4",
      "text": "TikTok"
    },
    {
      "level": "H4",
      "text": "YouTube"
    },
    {
      "level": "H3",
      "text": "Canales adquiridos"
    },
    {
      "level": "H3",
      "text": "Canales de pago"
    },
    {
      "level": "H2",
      "text": "Cómo crear una estrategia de distribución de contenidos ganadora"
    },
    {
      "level": "H3",
      "text": "Paso 1. Publica contenido en tu canal principal"
    },
    {
      "level": "H3",
      "text": "Paso 2. Empuja el contenido por email y a través de las redes sociales"
    },
    {
      "level": "H3",
      "text": "Paso 3. “Empuja” a los canales adquiridos"
    },
    {
      "level": "H4",
      "text": "Reddit"
    },
    {
      "level": "H4",
      "text": "Grupos de Facebook"
    },
    {
      "level": "H4",
      "text": "Guest blogging"
    },
    {
      "level": "H3",
      "text": "Paso 4. “Empuja” a los canales de pago"
    },
    {
      "level": "H4",
      "text": "Twitter Ads"
    },
    {
      "level": "H4",
      "text": "Google Ads"
    },
    {
      "level": "H4",
      "text": "Patrocinios"
    },
    {
      "level": "H4",
      "text": "Publicidad nativa"
    },
    {
      "level": "H4",
      "text": "Facebook ads"
    },
    {
      "level": "H3",
      "text": "Paso 5. Mide tus resultados con herramientas"
    },
    {
      "level": "H4",
      "text": "Ahrefs"
    },
    {
      "level": "H4",
      "text": "Twitter (X)"
    },
    {
      "level": "H4",
      "text": "Google Analytics"
    },
    {
      "level": "H3",
      "text": "Paso 6. Repite"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}