{
  "url": "https://ahrefs.com/blog/es/earned-media/",
  "slug": "earned-media",
  "title": "¿Qué son los earned media? 7 formas de conseguirlos",
  "description": "Los earned media son publicidad obtenida orgánicamente de esfuerzos promocionales, como cobertura de prensa, menciones en redes sociales y rankings en motores de búsqueda.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Los medios ganados son publicidad obtenida orgánicamente de esfuerzos promocionales, como cobertura de prensa, menciones en redes sociales y rankings en motores de búsqueda..Pero, ¿por qué son importantes los medios ganados? ¿Y cómo puedes conseguir más?En esta publicación, exploraremos:Medios ganados vs. pagados vs. propiosPor qué los medios ganados son importantesEjemplos de medios ganadosCómo conseguir medios ganadosMedios ganados vs medios pagados vs medios propiosSi el dinero cambia de manos en cualquier momento, no se trata de medios ganados. Son medios de pago. Ejemplos de esto incluyen anuncios de radio y televisión, vallas publicitarias, patrocinios y publicidad en línea (anuncios de Google, anuncios de Facebook, etc.)Si tienes un control total sobre el recurso o el canal, eso tampoco es un medio ganado. Son medios propios. Los ejemplos incluyen todo lo publicado en su sitio web, boletines informativos, etc.Sin embargo, no todo está tan claramente definido. Cuando se trata de cosas como SEO, se vuelve un poco más confuso.Para posicionarse en Google, se debe crear contenido, que es un medio de propiedad. Pero sólo puede influir en dónde Google posiciona ese contenido y para qué palabras clave clasifica. No tienes control total sobre eso.Por eso, en nuestra opinión, el SEO es un medio ganado.Todo se trata de control. Puedes controlar tanto los medios de pago como los propios, pero no puedes controlar los medios ganados. Y como no puedes controlar por completo dónde quieres posicionarte en Google (solo puede influir en ello), se trata de medios ganados.¿Por qué son importantes los medios ganados?Todos los negocios se esfuerzan por conseguir medios ganados, y hay dos razones principales para ello:1. Los medios generados suelen ser más baratos a largo plazoEn 2019, cuando Parachute lanzó su nuevo colchón de lana, la compañía optó por los medios ganados en lugar de los medios pagados. Sembró el producto con editores e influencers, lo que resultó en toneladas de artículos e historias de Instagram de personas que probaron el colchón.Una reseña de prensa del nuevo colchón de Parachute.En total, gastaron alrededor de $ 20,000 en relaciones públicas y regalos de productos. Según Ariel Kaye, fundador de Parachute, habrían tenido que gastar al menos $2 millones en anuncios de Facebook para obtener la misma cantidad de impresiones que obtuvieron de esta campaña de medios ganados-Y, a diferencia de los medios pagados, donde tienes que gastar más para obtener más impresiones con el tiempo, los medios ganados siguen regalando resultados..Los artículos de prensa a menudo enlazan con el producto o la empresa, lo que mejora su SEO. Y estos artículos también pueden posicionarse en la búsqueda y enviar tráfico de referencia a lo largo del tiempo.2. Los medios obtenidos son excelentes para el desarrollo de la marcaLa “falta de control” con los medios ganados es una ventaja, no una estafa.Dado que las marcas no pueden controlar el mensaje, los consumidores lo consideran más confiable. Los revisores externos pueden ofrecer su opinión imparcial sobre un producto y la gente puede compartir sus pensamientos honestos sobre una empresa o producto en las redes sociales.Como dice el escritor de finanzas Morgan Housel:La era de la información promueve mucho buen comportamiento. Pero más poderosa es su capacidad para revelar un comportamiento malo e ineficiente. Lo que solía ser vigilado por un puñado de reporteros y publicaciones de reseñas ahora lo hacen miles de millones de personas al acecho de cualquier cosa que no parezca correcta.En otras palabras, si la gente real está cantando tus elogios y está claro que no pagaste ni los incentivaste a hacerlo, eso ayuda a que tu marca se destaque en el mercado. Esto es especialmente cierto para las marcas directas al consumidor (DTC).Piénsalo. Parachute no es la única empresa de colchones que vende online en la actualidad. Purple, Casper, Leesa, la lista sigue y sigue. La mayoría de los consumidores probablemente no puedan distinguir a estas empresas, incluso si ven sus anuncios.Los medios ganados son la forma de destacar frente a los clientes potenciales.¿Cuáles son algunos ejemplos de medios ganados?Aquí hay algunos ejemplos de cómo se ven los medios ganados en la naturaleza.Segmento de televisiónArtículo de periódico / revistaPublicaciones de nicho / comercioTweet mencionesDebates de RedditRevisar sitiosInfluenciadoresLos motores de búsquedaSegmento de televisiónEsta es la forma más tradicional de medios ganados. Apareces en un programa de televisión y llegas a millones de espectadores en su sala de estar.Ahrefs aún no ha aparecido en un programa de televisión, pero autores como Eckhart Tolle han vendido millones de libros gracias a la recomendación de Oprah.Periódico revista--featureEl año pasado, Bloomberg presentó nuestros datos sobre las búsquedas más populares de Google en un artículo de Businessweek. No pagamos por esto. Nuestros continuos esfuerzos de promoción llevaron al autor a encontrar nuestro contenido y decidió incluirlo en un artículo.This article also appeared in the physical version of the magazine.Publicaciones de nicho / comercioDado que estamos ubicados en la industria de SEO relativamente pequeña, recibimos menciones regulares en publicaciones enfocadas en nichos como Search Engine Journal.Menciones de TweeterKari tuiteó recientemente lo mucho que ama el blog de Ahrefs. No le pedimos que hiciera esto. Nos ganamos sus elogios publicando y promocionando incansablemente contenido líder en la industria durante años en nuestro blog.Adquirir el hábito de visitar regularmente el @ahrefs blog de nuevo. Aprendí los conceptos básicos de ellos en 2015 y aún los considero una guía básica cuando abordo un nuevo problema (por ejemplo, auditoría de contenido manual, que no he hecho en años).Sigo being super fan de estos chicos 🙃— Kari Beaulieu (@SERP_queen) September 15, 2020Debates de RedditOtro usuario también compartió cuánto amaba nuestro blog. Pero en lugar de compartirlo en sus cuentas sociales, decidió compartirlo con una audiencia mucho más grande en Reddit:Revisar sitiosTambién tenemos muchos usuarios que comparten regularmente su experiencia con nuestro producto en sitios de revisión como G2:Si tienes una empresa local, también son importantes los sitios de reseñas como Yelp, TripAdvisor y Google Maps.InfluencersRand Fishkin es un influencer en la industria del marketing con más de 440.000 seguidores en Twitter. Decidió compartir uno de nuestros artículos con su audiencia. No le pedimos que hiciera eso.Nos ganamos la participación porque publicamos un artículo con toneladas de ideas únicas, todas obtenidas de nuestra experiencia del mundo real.Excelente publicación sobre publicidad de podcasts: los altibajos del proceso * de la vida real * de @itsrbek: https://t.co/6DHzboqU6X— Rand Fishkin (@randfish) November 21, 2018Motores de búsquedaSegún el Site Explorer de Ahrefs, nuestro blog recibe aproximadamente 558.000 visitas mensuales. Toma nota: todas estas son visitas orgánicas. No son anuncios.Google clasifica nuestro contenido en un lugar destacado en su motor de búsqueda, lo que nos envía tráfico.Datos de Ahrefs’ Site ExplorerNota al margen. Si comparamos la estimación en Ahrefs con datos del mundo real de Google Search Console, vemos que Ahrefs subestima ligeramente nuestro tráfico orgánico. Nuestro tráfico real de Google se acerca a las 750.000 visitas mensuales. La razón de esto es simple: aunque tenemos una amplia base de datos de palabras clave en Ahrefs, ninguna herramienta conoce todas las consultas de búsqueda. Por esa razón, los sitios web y las páginas web casi siempre obtendrán más tráfico del que estima Ahrefs.Cómo conseguir medios ganadosEl hecho de que no puedas controlar los medios ganados no significa que no puedas influir en ellos.A continuación, se muestran algunas formas en las que puedes obtener más medios ganados para tu empresa.Utiliza HAROPitch para aparecer en podcastsClasificación de “palabras clave de origen”Haz algo de interés periodísticoAsiste a ferias comercialesEnvíe su producto para recibir reseñasSEO1. Utiliza HAROHelp a Reporter Out (HARO) es un servicio gratuito que conecta a los periodistas con sus fuentes. Después de registrarse, recibirá correos electrónicos diarios del servicio con solicitudes de periodistas.A continuación, se muestra un ejemplo de cómo sería un correo electrónico de HARO:Después de recibir el correo electrónico, todo lo que tienes que hacer es verificar si cumples con sus requisitos y responder. Si usan tu respuesta en su publicación, generalmente te acreditarán con una mención y un enlace externo.Como estos periodistas probablemente obtendrán muchas respuestas de otras personas, ¿cómo se destaca y se asegura de que tu respuesta sea seleccionada? A continuación se ofrecen algunos consejos:Proporciona información experta real. Casey Bond, periodista del Huffington Post, dice: “Siempre que llamas a un experto es porque se supone que te está proporcionando algo que no puedes descifrar por ti mismo o encontrar fácilmente”. No intentes dar una respuesta resumida de un artículo que buscas en Google. Proporciona información real que solo puede provenir de tu experiencia.Comparte sus credenciales. Desafortunadamente, HARO ha sido abusado por profesionales de SEO sin escrúpulos que buscan enlaces rápidos. Los periodistas los han criticado en ocasiones y se han vuelto cautelosos. HARO sigue siendo un gran lugar para obtener cotizaciones de expertos, pero debes demostrar que es un verdadero experto en el tema. Eso significa compartir tus credenciales, identificadores de redes sociales y más.También puede obtener más información sobre el uso eficaz de HARO aquí (consejo n. ° 6) o en este video:https://www.youtube.com/watch?v=73lj6m6Xulc2. Pitch para aparecer en podcastsSi es un experto en la materia, HARO no es la única forma de obtener medios ganados. La ubicuidad de los podcasts significa que también puedes aparecer como invitado y compartir tu experiencia.Esta es una estrategia que hemos utilizado en Ahrefs.En 2019, nuestro director de marketing, Tim Soulo, se propuso aparecer en más de 20 podcasts. Lo logró en solo cuatro meses.La aparición de Tim en el podcast Smart Passive Income¿Cómo encontrar oportunidades de podcasts?Una forma sencilla es identificar a alguien de un calibre similar que haya estado en varios podcasts.Usemos a Tim como ejemplo.Primero, pegamos su sitio web (ahrefs.com) en el Explorador de sitios de Ahrefs, vamos al informe de enlaces externos y escribimos su nombre en el cuadro “Incluir”.En segundo lugar, examinamos la lista para ver los podcasts en los que ha estado.En tercer lugar, encontramos el correo electrónico de los anfitriones del podcast y nos comunicamos con ellos para ver si están dispuestos a entrevistarnos.Lectura recomendada: 12 lecciones que aprendí al hacer más de 20 entrevistas de podcast en 4 meses3. Clasificación de las palabras clave de “fuente”En su presentación para la conferencia de SEO de Chiang Mai de 2019, la consultora de SEO Stacey MacNaught dijo esto:Los periodistas no tienen acceso a datos ni herramientas premium, eso es una ventaja.Stacey MacNaught, SEO Consultant MacNaught Digital¿Qué quiere decir ella? Los periodistas a menudo necesitan respaldar sus argumentos con datos. Y cuando lo hacen, generalmente mencionan y vinculan a la fuente de esos datos.Por ejemplo, tome nuestra mención en Bloomberg. Surgió como resultado de que teníamos algunos datos únicos que ayudaron al autor a exponer su punto.Pero aquí está la cuestión: no se puede simplemente crear datos antiguos, publicarlos en cualquier lugar y esperar publicidad. Si deseas obtener cobertura con esta táctica, necesitas dos cosas:Datos interesantes. Cuando decimos interesante, nos referimos a interesante para los periodistas relevantes.Mecanismo de entrega. Tener datos interesantes es un comienzo, pero a menos que tengas una forma de presentarlos a los periodistas relevantes, tendrás dificultades para obtener cobertura.Hay muchas formas de hacer las dos cosas anteriores. Por ejemplo, puedes crear o seleccionar datos sobre un tema de tendencia y luego usar una herramienta como Content Explorer para encontrar periodistas relevantes y presentar su recurso.Todas estas personas han publicado artículos sobre Playstation 5 en los últimos 30 días. [/ Caption] Esa es la ruta “tradicional” y funciona, pero otra táctica que nos funcionó es crear contenido alrededor de las llamadas palabras clave de “fuente”.Las palabras clave de origen son los términos que los periodistas probablemente buscarán cuando busquen hechos y datos para hacer referencia en sus próximas publicaciones.Ejemplos incluyen:[tema] estadísticas[tema] hechos[tema] cifrasPara encontrar estas palabras clave, ingresa algunas palabras clave relevantes en el Explorador de palabras clave de Ahrefs, vaya al Informe de concordancia de frase y use el filtro “Incluir” para encontrar palabras clave que contengan palabras como estadísticas, hechos y cifras.Busca en la lista una buena palabra clave a la que apuntar.Por ejemplo, si tuviéramos un sitio de café, potencialmente podríamos apuntar a “datos nutricionales del café” o “estadísticas del café”.A partir de ahí, crea una publicación seleccionando una lista de estadísticas actualizadas (medios propios). Luego, dirígete a cualquier sitio que enlace a páginas de estadísticas de la competencia pero obsoletas sobre el mismo tema para crear enlaces a tu página (medios ganados).Hicimos esto en 2020 para el término “estadísticas de SEO”. Como resultado, nuestra página ha obtenido enlaces de más de 350 sitios web y ocupa el puesto número 2 por su palabra clave principal.Aprenda cómo lo hicimos paso a paso en esta publicación o en este video:https://www.youtube.com/watch?v=gMcA-8nalL84. Haz algo de interés periodístico¿Quieres estar en las noticias? Entonces sé las noticias.Cuando se hace bien, los trucos de relaciones públicas pueden ayudar a generar toneladas de menciones en los medios de comunicación en publicaciones y en las redes sociales. Estoy seguro de que has oído hablar de al menos algunas de estas campañas, desde la inmersión estratosférica de Red Bull hasta la campaña Real Beauty de Dove.Tampoco tiene que ser muy caro.Por ejemplo, KFC aprovechó hábilmente su cuenta de Twitter para obtener medios ganados. Siguieron en secreto a 11 personas y esperaron a que alguien observará lo suficiente como para darse cuenta de que era un juego de su “receta secreta”: cinco especias (las cinco Spice Girls) y seis hierbas (seis personas llamadas Herb)..@KFC follows 11 people.Those 11 people? 5 Spice Girls and 6 guys named Herb.11 Herbs & Spices. I need time to process this.— (@edgette22) October 19, 2017El tweet se volvió viral y ayudó a KFC a capturar una cantidad de medios ganados en revistas enfocadas en marketing y en las principales editoriales de noticias.Ahora bien, no existe una forma segura de crear una campaña de relaciones públicas que garantice la prensa.Sin embargo, esta pregunta de Tim Ferriss podría ayudarte a comenzar con el pie derecho: “¿Qué pasa si no puedo presentar mi producto directamente? ¿Qué pasaría si tuviera que vender el producto? ”También recomendaría leer Trust Me, I’m Lying, el libro de Ryan Holiday sobre relaciones públicas y medios.5. Asiste a ferias comercialesEn 2016, estaba trabajando para una startup de tecnología portátil (ahora desaparecida) que estaba lanzando una chaqueta de masaje. Para prepararnos para el lanzamiento, decidimos asistir al Consumer Electronics Show (CES) en Las Vegas para mostrar nuestro producto.Ese viaje resultó en un montón de menciones en las principales publicaciones como Tech in Asia, Digital Trends y Business Insider.El artículo de Tech in Asia incluso se sindicó en otra publicación masiva (en ese momento): Mashable.Este fue un retorno sorprendente para una startup relativamente desconocida con sede en la pequeña Singapur.No hay duda de que las ferias comerciales funcionan para obtener menciones en los medios. Después de todo, los periodistas y blogueros asisten específicamente a estas ferias comerciales para encontrar temas interesantes que cubrir.Pero, por supuesto, no asuma que obtendrá medios ganados solo porque está allí. Aún necesita ser digno de ser noticia.Hay cientos, sino miles, de productos potenciales de los que hablar en una gigantesca conferencia en CES. Los periodistas tienen que elegir entre estas opciones e informar sobre las pocas que creen que su audiencia disfrutará más (o al menos encontrará novedosas).En nuestro caso, el posicionamiento de nuestro producto, la primera chaqueta de masaje del mundo, llamó su atención. No solo nunca se había hecho antes, sino que también teníamos un prototipo real para que lo probaran.Eso lo hizo digno de mención, lo que resultó en nuestras menciones en los medios.Lectura recomendada: Cómo dominar cualquier feria comercial y por qué incluso los emprendedores solitarios deberían intentarlo6. Envíe su producto para recibir reseñasOtra forma en que obtuvimos medios ganados fue acercarnos a los periodistas y ofrecerles una chaqueta para que la probaran.Así logramos conseguir más menciones de prensa en publicaciones como Engadget y Refinery29.Esta estrategia funciona incluso si eres un nombre establecido. Por ejemplo, Tim Ferriss envió más de 1,000 copias avanzadas del Cuerpo de 4 horas, lo que resultó en un monton de reseñas de Amazon y convirtió el libro en un éxito de ventas.Más recientemente, brindamos una vista previa de Ahrefs Webmaster Tools a los periodistas, lo que resultó en menciones en Search Engine Journal y Tech Radar:Mención de prensa para Ahrefs Webmaster Tools en TechRadarAhora, si eres una marca establecida, obtener estas reseñas debería ser relativamente fácil. Pero, ¿y si eres nuevo, como la empresa de chaquetas para la que trabajé? ¿Cómo sabes a qué publicaciones debes dirigirte?La forma más fácil es averiguar quién ha revisado o presentado productos similares al suyo, luego comunícate con ellos y ofrece tu producto para que lo prueben.Para hacer esto, haz una lluvia de ideas de 2-3 marcas de la competencia. Por ejemplo, si has creado un nuevo software de marketing por correo electrónico, tus competidores serían empresas como MailChimp y AWeber.Vaya al Explorador de contenido de Ahrefs e ingresa una consulta como mailchimp AND aweberVerás toneladas de páginas que mencionan a ambos competidores.Luego, puedes exportar la lista de dominios desvinculados, comunicarte e intentar que tu marca se mencione junto con sus competidores.7. SEOLa creación de contenido (medios propios) es un requisito previo para clasificar en Google. Pero como se mencionó anteriormente, no puedes controlar dónde y qué tan alto ocupa tu contenido. (A menos que pagues por ello al estilo de Google Ads, que son medios de pago).Por esa razón, en nuestro libro, SEO es una forma de “medios ganados”.Si bien no puedes dictar tu posición de clasificación orgánica, puedes influir en dónde se ubica. Esto se conoce como optimización de motores de búsqueda (SEO) y, en términos generales, implica:Saber lo que sus clientes están buscando. Haz una investigación de palabras clave para ayudar a determinar para qué temas deseas aparecer en Google.Crear contenido optimizado. Vertiendo tu corazón y tu alma en un fragmento de contenido no garantiza que vas a posicionarlo. Es necesario trabajar el SEO en tu contenido desde el principio siguiendo un marco de SEO comprobado.La construcción de enlaces. Los enlaces son un importante factor de posicionamiento para Google. Si sigues las estrategias anteriores, es probable que ya obtengas enlaces a tu sitio.Nota al margen. El SEO es más que solo investigación de palabras clave, creación de contenido y construcción de enlaces. También necesitas tener un sitio web técnicamente sólido (SEO técnico), páginas bien optimizadas (SEO en la página y mucho más). Nos estamos enfocando en los tres aspectos anteriores aquí porque son su pan y mantequilla. No llegarás a ninguna parte a menos que crees contenido sobre cosas que la gente está buscando y crea enlaces a ese contenido. ¿Quieres aprender más sobre SEO y cómo hacerlo? Lee esta publicación o mire este video:https://www.youtube.com/watch?v=V_bmV3lamsAConclusionesSi hay un hilo que conecta todos los medios ganados y sus estrategias, sería el boca a boca. Y la forma más fácil de impulsar el boca a boca es deleitar a tus clientes.El concepto es relativamente simple:Crea un producto o servicio que tus clientes amen y disfruten;Ofrece un servicio al cliente útil y amigable que resuelva sus problemas;Crea contenido entretenido y educativo que ayude a tus clientes con sus preguntas o problemas.Si marcas estas casillas, tus clientes naturalmente compartirán tu contenido en las redes sociales, dejarán críticas positivas y le hablarán de ti a su audiencia.¿Me perdí algún consejo útil para obtener medios ganados? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué son los earned media? 7 formas de conseguirlos"
    },
    {
      "level": "H2",
      "text": "Medios ganados vs medios pagados vs medios propios"
    },
    {
      "level": "H2",
      "text": "¿Por qué son importantes los medios ganados?"
    },
    {
      "level": "H3",
      "text": "1. Los medios generados suelen ser más baratos a largo plazo"
    },
    {
      "level": "H3",
      "text": "2. Los medios obtenidos son excelentes para el desarrollo de la marca"
    },
    {
      "level": "H2",
      "text": "¿Cuáles son algunos ejemplos de medios ganados?"
    },
    {
      "level": "H3",
      "text": "Segmento de televisión"
    },
    {
      "level": "H3",
      "text": "Periódico revista--feature"
    },
    {
      "level": "H3",
      "text": "Publicaciones de nicho / comercio"
    },
    {
      "level": "H3",
      "text": "Menciones de Tweeter"
    },
    {
      "level": "H3",
      "text": "Debates de Reddit"
    },
    {
      "level": "H3",
      "text": "Revisar sitios"
    },
    {
      "level": "H3",
      "text": "Influencers"
    },
    {
      "level": "H3",
      "text": "Motores de búsqueda"
    },
    {
      "level": "H2",
      "text": "Cómo conseguir medios ganados"
    },
    {
      "level": "H3",
      "text": "1. Utiliza HARO"
    },
    {
      "level": "H3",
      "text": "2. Pitch para aparecer en podcasts"
    },
    {
      "level": "H3",
      "text": "3. Clasificación de las palabras clave de “fuente”"
    },
    {
      "level": "H3",
      "text": "4. Haz algo de interés periodístico"
    },
    {
      "level": "H3",
      "text": "5. Asiste a ferias comerciales"
    },
    {
      "level": "H3",
      "text": "6. Envíe su producto para recibir reseñas"
    },
    {
      "level": "H3",
      "text": "7. SEO"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Si Quan Ong"
}