{
  "url": "https://ahrefs.com/blog/es/eeat-seo/",
  "slug": "eeat-seo",
  "title": "E-E-A-T es el nuevo E-A-T. Qué significa la nueva \"E\" para el SEO.",
  "description": "E-E-A-T es un concepto para valorar, manualmente, los sistemas de ranking de Google. Al principio solo tenía tres factores (E-A-T), pero Google añadió un criterio adicional… la Experiencia.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido E-E-A-T es un concepto utilizado por evaluadores humanos para valorar la calidad de los sistemas de ranking de búsqueda de Google. Originalmente, tan solo constaba de tres factores (E-A-T). Pero en diciembre de 2022, Google añadió el criterio de “experiencia” al concepto.Según Google, ciertos tipos de contenido requieren una experiencia de primera mano para ser dignos de confianza. ¿Qué significa para el SEO?Contenido¿Es E-E-A-T una señal de ranking?No, al menos no directamente. Nada ha cambiado desde la concepción original del E-A-T:Recuerda que estas directrices las utilizan nuestros evaluadores de búsqueda para ayudar a evaluar el rendimiento de nuestros diferentes sistemas de posicionamiento en las búsquedas. No influyen directamente en el posicionamiento. (Fuente).La idea general de Google en este caso es recompensar (posicionar mejor) el contenido de calidad que procede de fuentes fiables. Es decir, el mensajero es tan importante como el mensaje.Cómo entiende Google la experienciaExperiencia en el E-E-A-T significa experiencia de primera mano o experiencia vital en el tema.Esto significa que Google intentará “recompensar” las páginas en las que el contenido haya sido creado por alguien con experiencia real en el tema sobre el que escribe. Por ejemplo:Para una reseña sobre un iPhone, la persona que la redacta debe haber utilizado realmente el producto.Para una guía sobre los mejores bares de jazz de Madrid, esa persona debe haberlos visitado personalmente.Para una receta de comida, debe haberla elaborado realmente.Para un artículo sobre cómo ayudar mentalmente a la gente a superar una enfermedad, la persona que escribe sobre el tema debe haber pasado por ello personalmente o haber ayudado a otra gente.Para una guía sobre cómo tener un negocio exitoso… te haces una idea.Experiencia frente a otros criteriosIndependientemente del tema de la página, el más importante de todos los criterios es la “T”, o fiabilidad (trustworthiness en inglés). Otros criterios, como los conocimientos, la autoridad y la experiencia, ayudan a determinar si la página es digna de confianza (QRG, página 26).Se puede pensar en los demás criterios como pilares para establecer la confianza.Dependiendo del tema, hay otros criterios que entran en juego. Para algunos temas, la propia experiencia puede estar por encima de otros criterios.Hay que tener en cuenta la finalidad, el tipo y el tema de la página, y preguntarse qué es lo que convertiría al creador del contenido en una fuente digna de confianza en ese contexto (QRG, página 26).Por ejemplo, un blog de viajes no tiene por qué estar escrito por un experto para que sea fiable. Por el contrario, una guía del motor es más fiable si la escribe una persona experta en mecánica.Hay que tener en cuenta la diferencia entre experiencia y ser un experto. La experiencia se refiere a los conocimientos y habilidades. Naturalmente, para adquirirlos también se necesita experiencia. Pero:No funciona al revés. La experiencia por sí sola no te convierte en una persona experta.La experiencia no tiene por qué venir de ser un experto.¿A qué tipo de temas se refiere la nueva “E”?Se confirmó que el concepto original de E-A-T se refería a todos los temas. Con la incorporación de la experiencia, Google parece que lo reitera al declarar: “La experiencia es valiosa para casi cualquier tema” (QRG, página 62).La experiencia también cuenta para los temas YMYL (Your Money or Your Life, que se puede traducir como “tu dinero, tu vida”). Pero esta categoría de temas a los que Google presta especial atención no está reservada a los expertos.En otras palabras, si la experiencia personal es fundamental para establecer la confianza sobre el tema, el autor no tiene por qué ser un experto. Google proporciona una lista de ejemplos para comprender mejor este matiz (QRG, página 28):Cómo demostrar experienciaAquí tienes algunas ideas sobre cómo puedes demostrar experiencia de primera mano en tus contenidos. Ten en cuenta que estos consejos se basan en una interpretación de las directrices de Google.Demuestra tu experiencia personal con el tema en cuestiónTomemos como ejemplo las reseñas de productos. Google trató recientemente la oleada de webs de afiliados que alojan reseñas de productos de baja calidad con este documento. Básicamente dice que lo mejor es que las reseñas estén hechas por personas expertas en la materia.Sin embargo, no basta con demostrar que eres un experto. Tienes que aportar pruebas de tu experiencia de primera mano con el producto que has reseñado.Comparte imágenes, audios u otros elementos que prueben tu propia experiencia con el producto para demostrar que tienes conocimientos sobre él y validar la veracidad de tu reseña. (Fuente).Veamos un ejemplo. Thomas Sandlanderer es conocido por sus reseñas de productos en el sector de la impresión 3D. Pero si deja de hacer reseñas detalladas, dejará de ser una fuente fiable. Algo que se debería a la falta de experiencia directa con el producto.En cambio, Thomas sigue manchándose las manos con cada impresora 3D que reseña. ¿Qué mejor prueba para demostrar su experiencia personal que fotos como estas?Explica cómo creaste el contenido.Antes de que E-A-T se convirtiese en E-E-A-T, Wirecutter demostraba por qué la gente podía fiarse de sus reseñas. Del mismo modo, puedes empezar tu contenido con una nota sobre cómo se creó. Una sección como esta es el lugar perfecto para demostrar la experiencia adquirida. Traducción del inglés: Hemos conducido cientos de horas con más de 50 soportes de teléfono en varios coches, incluidas 20 horas como conductor de Lyft.Estudio de caso de Wirecutter SEO: 5 formas de ganar en el marketing de afiliados (en inglés)Demuestra tu experiencia en una página dedicadaEn teoría, no tienes que demostrar tu experiencia con el tema cada vez que escribas sobre él. Esto se debe a que Google aconseja a los evaluadores de calidad que se fijen en la descripción del autor.Por lo tanto, puedes explicar tu experiencia personal con el tema en una página “Acerca de” y enlazar tus perfiles de las redes sociales si aportan pruebas adicionales. Evidentemente, puedes combinarlo con otros métodos para demostrar tu experiencia. Página sobre el autor de un blog que ayuda a afrontar el cáncer (un tema del YMYL). La biografía del autor hace referencia a su experiencia personal con la enfermedad.Tu reputación cuentaTambién se anima a los índices de calidad a buscar fuera de tu web muestras de experiencia (y de confianza en general).Busca reseñas independientes, referencias, artículos de prensa y otras fuentes de información creíble sobre el sitio web o los creadores de contenidos (QRG, página 27).Por ejemplo, la web Best Wallet Hacks cuenta con un índice real de menciones en prensa. Imagínate compararlo con un blog completamente nuevo sobre el mismo tema del que nadie ha oído hablar… ¿cuál es más fiable?Una de las formas en que un motor de búsqueda podría deducir esa información es siguiendo los enlaces a un sitio. Al fin y al cabo, Gary Illyes corroboró que los enlaces y las menciones eran sustanciales para el concepto E-A-T original. Probablemente no haya cambiado con la introducción de la experiencia.I asked Gary about E-A-T. He said it’s largely based on links and mentions on authoritative sites. i.e. if the Washington post mentions you, that’s good.He recommended reading the sections in the QRG on E-A-T as it outlines things well.@methode #Pubcon— Marie Haynes (@Marie_Haynes) February 21, 2018Si te falta la experiencia, invita a alguien que la tengaEl hecho de que la persona autora de la página tenga que demostrar experiencia no significa que el propietario de la web la tenga. Esto significa que puedes demostrar experiencia en temas sobre los que no la tienes invitando directamente a autores o invitados.RECOMENDACIÓNLa experiencia es tan solo una pieza del rompecabezas. Aprende a demostrar y mejorar otros aspectos en nuestra guía sobre cómo mejorar y demostrar E-A-T.En resumen: haz que tu web sea de confianzaAñadir la experiencia a la ecuación abre la categoría de temas del YMYL a creadores con experiencia personal. Por otro lado, sube el nivel de los temas en los que este tipo de experiencia sea fundamental.De todos modos, se trata de otro intento más por parte de Google de proporcionar resultados más útiles y relevantes filtrando las páginas que no son de confianza. Todo depende de la confianza:Por último, hay muchos aspectos de la confianza, entre los que no se incluyen la experiencia, los conocimientos y la autoridad. Por favor, ten en cuenta otros aspectos en tu evaluación global de la confianza, como la información sobre el servicio de atención al cliente en el caso de las tiendas online o las publicaciones revisadas por expertos en el caso de los autores académicos. Si una página no es de fiar por cualquier motivo, tendrá un E-E-A-T bajo (QRG, página 27).Si los QRG están capacitados para identificar otros signos de confianza, también lo están los sistemas de ranking. Así que si se te ocurren otras formas de demostrar tu fiabilidad, hazlo.Se trata también de una advertencia para las webs que intentan engañar al sistema: Una prueba de experiencia no va a camuflar las otras señales de falta de fiabilidad.Reflexiones finalesCon la introducción de E-E-A-T, Google ha actualizado la guía de autoevaluación de la calidad de los contenidos. Los SEO y los creadores de contenidos pueden utilizarla como referencia para alinear los contenidos con E-E-A-T.Por ejemplo, para los editores que emplean IA para la generación de contenidos, Google aconseja revelar al lector el uso de la automatización (Google no está en contra de los contenidos generados con IA). Pero antes hay que preguntarse si el uso de IA para producir contenidos le puede parecer razonable al usuario.¿Tienes comentarios o preguntas? Contáctanos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "E-E-A-T es el nuevo E-A-T. Lo que significa la nueva “E” para el SEO."
    },
    {
      "level": "H2",
      "text": "¿Es E-E-A-T una señal de ranking?"
    },
    {
      "level": "H2",
      "text": "Cómo entiende Google la experiencia"
    },
    {
      "level": "H2",
      "text": "Experiencia frente a otros criterios"
    },
    {
      "level": "H2",
      "text": "¿A qué tipo de temas se refiere la nueva “E”?"
    },
    {
      "level": "H2",
      "text": "Cómo demostrar experiencia"
    },
    {
      "level": "H3",
      "text": "Demuestra tu experiencia personal con el tema en cuestión"
    },
    {
      "level": "H3",
      "text": "Explica cómo creaste el contenido."
    },
    {
      "level": "H3",
      "text": "Demuestra tu experiencia en una página dedicada"
    },
    {
      "level": "H3",
      "text": "Tu reputación cuenta"
    },
    {
      "level": "H3",
      "text": "Si te falta la experiencia, invita a alguien que la tenga"
    },
    {
      "level": "H2",
      "text": "En resumen: haz que tu web sea de confianza"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}