{
  "url": "https://ahrefs.com/blog/es/embudo-marketing-contenidos/",
  "slug": "embudo-marketing-contenidos",
  "title": "Es hora de sustituir el embudo de marketing de contenidos (3 alternativas)",
  "description": "Si lo que buscas es un modelo sobre el que construir tu estrategia de contenidos, probablemente debería ser un modelo sin embudo. Hay muy buenas razones para ello.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido No vas a leer nada bueno sobre el embudo de marketing de contenidos en este artículo, solo cosas malas. Por ejemplo, que es demasiado lineal y simplista para abordar las complejidades de los recorridos de los clientes (customer journeys).Si lo que buscas es un modelo sobre el que construir tu estrategia de contenidos, probablemente debería ser un modelo sin embudo. Hay muy buenas razones para ello.¿Qué es un embudo de marketing de contenidos?En marketing, un embudo es un proceso de varias etapas que guía a los clientes potenciales desde que conocen un producto hasta que lo compran.Dependiendo de la versión, tiene entre 3 y 6 etapas, y se parece a esto:Tradicionalmente, todos los tipos de contenido tienen su lugar designado en cada etapa:Superior: landing pages de productos, ebooks, guías, la mayoría de las publicaciones en redes sociales, etc.Centro: seminarios web, casos prácticos, programas de captación de clientes potenciales, etc.Inferior: casos de éxito, white papers, material de capacitación de ventas, etc.Tiene sentido, ¿verdad? No del todo.¿Qué tiene de malo el modelo de embudo?Simplifica en exceso todo lo que es importante para un profesional del marketing de contenidos. Por eso, el modelo entiende algunas cosas completamente mal e ignora otras.Esto no es solo teórico. He aplicado el enfoque del embudo en varias empresas. Al principio, me daba seguridad y me proporcionaba una sensación de estructura y control. Sin embargo, cuanto más profundizaba, más confuso me resultaba. Empezaba a parecer que la sensación de orden era puramente imaginaria, ya que no había ningún método fiable para verificar si la gente seguía realmente el embudo.1. No entiende el comportamiento del consumidorEl modelo de embudo asume un camino perfectamente lineal, desde el conocimiento hasta la compra, e intenta apresurar a la gente a través del mismo. O, en realidad, te hace pensar que deberías acelerar su recorrido con tus contenidos.Sin embargo, el comportamiento del consumidor es más complejo y no lineal. La gente salta entre etapas, vuelve a visitarlas o toma caminos únicos hacia la compra.Por tanto, el recorrido no es un embudo, sino más bien un laberinto.FuenteLos viajes de los clientes B2C son aún más peculiares. ¿Recuerdas aquella vez que viste un anuncio y compraste ese producto inmediatamente? O a la inversa, cómo el trayecto de ver a comprar duró años:Pero los content marketers no deberían intentar resolver tal laberinto, o atravesarlo en línea recta solo por conveniencia. Más bien deberían adaptarse a él.2. Intenta meter todo con calzadorNo todos los tipos de contenido pueden, ni deben, encajar en etapas rígidas del embudo, como quiere el modelo.Pongamos un ejemplo basado en uno de nuestros artículos. ¿A qué etapa(s) del embudo de marketing sirve nuestro artículo de blog sobre «Cómo encontrar palabras clave de baja competencia»?Como puedes ver, el modelo no puede manejar una de las formas básicas de marketing de contenidos: un artículo de blog. Pero si tomamos cualquier tipo de contenido educativo, nos encontraremos con el mismo problema. Muchos tipos de contenido pueden servir para varias etapas del embudo o funcionar en todas ellas. Pueden atraer y retener a un visitante o incluso llevarle desde el descubrimiento hasta la compra.Por ello, el embudo de marketing de contenidos simplemente no es útil para crear contenidos que sean atractivos para el usuario y eficaces para la empresa.3. Descuida la retención de clientesLa retención de clientes se refiere a la capacidad de mantenerlos. Es importante porque no queremos que los clientes compren una sola vez; lo que se busca es que sigan volviendo para no tener que atraer a un completo desconocido cada vez para conseguir una venta, lo cual es difícil y caro.Según un estudio de Bain and Company, aumentar las tasas de retención de clientes en un 5% incrementa los beneficios entre un 25% y un 95%. Y tiene todo el sentido del mundo si lo piensas: si alguien te pidiera que generaras 1.000 dólares más en ventas en 24 horas, ¿acudirías a los clientes existentes o tratarías de encontrar otros nuevos?Pero si practicas los métodos antiguos del embudo, atender a tus clientes existentes es muy limitado porque el embudo termina en la etapa de compra. No hay nada que un profesional del marketing de contenidos pueda o deba hacer después de que un cliente potencial se convierta en cliente.Es como hacer una fiesta en la que te centras tanto en invitar a nuevos invitados que te olvidas de entretener a los que ya están dentro.4. Ignora la expansión del clienteSi solo persigues clientes nuevos y te olvidas de los que ya tienes, pierdes la oportunidad de hacerles más ventas o de conseguir que recomienden tu negocio a otras personas. Los clientes satisfechos pueden impulsar tu negocio comprando más y hablando de ti a sus amigos.¿Cómo puede ayudar el contenido a conseguirlo? Una buena forma es crear contenidos orientados al producto. Este tipo de contenido está diseñado para mostrar cómo tu producto puede resolver el problema del cliente.El mecanismo es sencillo: mostrar las funciones del producto en acción convierte a un usuario normal en un usuario avanzado. Empiezan a utilizar más funciones y a sacarles más partido, lo que fideliza al cliente y proporciona un buen terreno para la venta adicional.Además, si el contenido es realmente bueno, la gente lo compartirá con los demás, lo que amplificará el alcance de tu marca.Making a habit of regularly visiting the @ahrefs blog again. Learned the basics from them back in 2015 and still consider them a go-to primer when approaching a new problem (e.g. manual content audit - which I haven’t done in years). Still super-fanning these guys 🙃— Kari Beaulieu (@SERP_queen) September 15, 2020Lo mejor: los buenos contenidos no solo serán recomendados por tus clientes. No hace falta que la gente sea cliente tuyo o sepa mucho de tu marca para recomendar tus contenidos en las redes sociales.3 alternativas sin embudo a tener en cuentaLa mejor solución a las deficiencias del embudo es no tener un embudo. Estas son las razones:Hay que adaptarse al comportamiento del consumidor, no forzarlo. Concéntrate en cómo los consumidores interactúan de forma natural con los contenidos en vez de intentar dictar su recorrido. Facilita el acceso a tus contenidos sin imponer cómo deben consumirse.Un uso más eficiente del marketing de contenidos. El contenido puede funcionar tanto antes como después de la venta. No tiene por qué ser útil en un momento determinado. Puede diseñarse para que siga siendo útil y relevante a lo largo del tiempo.Una forma más útil de crear contenidos. No hay que perder tiempo decidiendo si esa guía que estás a punto de escribir pertenece a la parte superior o media del embudo. Simplemente puedes centrarte en ofrecer valor y satisfacer a tu audiencia.Estos son tres modelos diferentes sin embudo que comparten estas ventajas.1. El framework del potencial empresarialEste enfoque consiste en utilizar los contenidos para impulsar directamente la demanda del producto, ya sea antes o después de la venta.En vez de clasificar los contenidos por etapas de un embudo de ventas, los calificas en función de su relación con tu producto.Así, por ejemplo, para una herramienta de marketing de contenidos, los temas con alto potencial de negocio incluirían métricas de marketing de contenidos, «marketing de contenidos B2B», «ideación de contenidos», «optimización de contenidos» y «distribución de contenidos» (y no una entrevista con marketers de contenidos o «historia del marketing de contenidos», etc.).Este sistema de puntuación facilita enormemente la planificación de tu estrategia de contenidos. Puedes decidir rápidamente cuánto crear de cada tipo de contenido. Además, puedes usarlo con otras métricas importantes (nosotros lo usamos con el potencial de tráfico orgánico) para priorizar aún más el contenido.Ahrefs lleva años utilizando este modelo, especialmente para el contenido SEO, que es la mayor parte de lo que publicamos. Es ideal para entender qué términos de búsqueda son más valiosos.Tomemos como ejemplo estas dos palabras clave. La primera tiene mucho más potencial de tráfico, pero es demasiado amplia para incluir fácilmente nuestro producto: obtendría un «1». Por el contrario, la palabra clave con menos tráfico, pero más centrada en SEO, obtendría un «3» porque es más relevante para nuestros clientes y nuestro producto.El Marco (framework) de potencial empresarial puede ser adecuado para ti si trabajas en un sector establecido, en el que ya existe una demanda considerable de contenidos directamente relacionados con productos como el tuyo. Esto hará que sea más fácil encontrar temas con una puntuación de 2 y 3. Puedes medir esa demanda consultando el volumen de búsquedas en nuestro generador de palabras clave gratuito.2. El patio de recreo de los contenidosEl Content Playground, ideado por Ashley Faus, reimagina el buyer’s journey como un espacio abierto e interactivo, similar a un parque infantil, que se aleja del recorrido lineal del embudo tradicional.Su objetivo es satisfacer los intereses y estilos de aprendizaje de un público variado ofreciendo una mezcla de inmersiones en profundidad, marcos estratégicos y consejos prácticos. Para ello, abarca temas en tres niveles:Conceptual: abarca las ideas principales y su significado.Estratégico: describe marcos y procesos.Táctico: proporciona pasos concretos y aplicables.Siguiendo con el ejemplo de la herramienta de marketing de contenidos, los temas sobre los que crearías contenidos podrían ser los siguientes: «qué es el marketing de contenidos» (conceptual), «desarrollar una estrategia de marketing de contenidos» (estratégico), «cómo promocionar contenidos» (táctico).A modo de ejemplo, este centro de contenidos sobre Agile de Atlassian está diseñado para ser un patio de recreo de contenidos. Hay una mezcla de los tres tipos de contenidos, y el usuario puede empezar en cualquier punto, profundizar todo lo que quiera y saltar a otro tema en cualquier momento.Naturalmente, el contenido debe estar interconectado y sin barreras para que los consumidores puedan utilizarlo como quieran y navegar libremente por el mismo. La ventaja es que se obtiene tráfico orgánico de palabras clave relacionadas. Según Ahrefs, este hub atrae más de 591.000 visitas orgánicas al mes, y parece que va a más.Pero un patio de recreo no tiene por qué limitarse a un solo sitio. Mientras abordes un tema siguiendo estos tres niveles y permitas que la gente acceda a ellos libremente, puedes tenerlo repartido por un número ilimitado de sitios y plataformas: micrositios, artículos de blog, redes sociales, correo electrónico, ebooks, etc.Tuve una conversación breve con Ashley, la persona que concibió este marco de trabajo, para entender dónde encaja mejor este marco. Me enteré de que el marco fue desarrollado y probado con los marketers B2B en mente, y ahí es donde es más relevante. Los marketers B2C simplemente no se enfrentan a un problema tan grande con los clientes «yendo y viniendo» y teniendo que volver a comprometerlos en diferentes canales.Lecturas complementariasCrea un «patio de recreo de contenidos» entretenido para los compradores (y lucrativo para ti) (en inglés)Horas de oficina: Construir un patio de recreo de contenidos (en inglés)3. La red de grupos de canalesExiste una forma de cubrir todas las intenciones de los clientes, los temas, el recorrido y los canales de marketing clave de forma natural, simplemente centrándote en lo que le importa a tu audiencia y en dónde están dispuestos a consumir contenidos. Lo llamo Cluster-Channel Network (CCN, la red de grupos de canales).Dos elementos centrales de este marco son:Grupos: agrupaciones temáticas de contenidos en torno a un tema central, apoyado por una red de subtemas relacionados. Representan cosas que interesan a la gente.Canales: plataformas y medios a través de los cuales tu mensaje llega a tu audiencia. Representan lugares de encuentro que te reúnen con tu audiencia para hablar de cosas que les importan. Piense en la publicidad, el correo electrónico, las redes sociales, Google, etc.CCN garantiza una presencia multicanal con contenidos que atraen a tu audiencia y convierten a tu marca en una autoridad en una selección de temas cuidadosamente escogidos.Además, se trata de un marco eficaz porque permite «exprimir» al máximo cualquier tema. Se trata de una ventaja importante, ya que hay un número limitado de temas que una marca puede abarcar cómodamente sin convertirse en un content farm que genera contenidos irrelevantes solo para conseguir tráfico.El marco consta de cinco pasos.Identificar grupos de interés: elige grupos de interés alineados con la experiencia de tu marca y los intereses de tu audiencia.Definir subtemas: dentro de cada grupo, identificar subtemas para una cobertura exhaustiva.Producir contenido básico: selecciona un canal y un formato principales para el contenido en profundidad, convirtiéndolo en la pieza central para atraer tráfico de otras plataformas.Distribuir entre canales: reutiliza el contenido principal en formatos más pequeños y específicos para cada canal.Interconectar grupos y subtemas: conecta grupos y subtemas relacionados. Lo más probable es que la gente esté interesada en más de un grupo (por ejemplo, SEO y marketing de contenidos).Si visualizáramos este marco formado por cuatro grupos, tendría este aspecto:El patio de recreo de contenidos podría visualizarse como una red totalmente conectada con 3 tamaños de nodo.Si utilizamos el marketing de contenidos como grupo, uno de los subtemas podría ser el contenido sobre IA. Para ese subtema, podrías crear un post de blog sobre la ética en el marketing de contenidos en la era de la IA y distribuirlo como un hilo en X, ofrecer ese tema a los anfitriones de podcasts, etc.Este marco funcionará mejor si tienes los recursos para estar presente en múltiples canales y estás comprometido con objetivos a largo plazo (crear confianza y autoridad lleva tiempo).TIPPuedes encontrar grupos y subtemas muy rápidamente utilizando Keywords Explorer de Ahrefs. Solo tienes que introducir un término amplio relacionado con tu producto (tu grupo) y dejar que la IA se encargue del brainstorming.A partir de un poco más de 10 palabras clave que la IA encontró para mí para la palabra “SEO”, Keywords Explorer encontró más de 32.000 palabras clave que luego organizó en 3466 temas listos para apuntar en cuestión de segundos. Todo con el potencial de tráfico y las métricas de dificultad de palabras clave para ayudar con la priorización.Reflexiones finalesPor último, los temas que elijas tratar son tan importantes como estos marcos. Consulta nuestra guía de ideación de contenidos para no quedarte nunca sin ideas.¿Dudas? ¿Preguntas? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Es hora de sustituir el embudo de marketing de contenidos (3 alternativas)"
    },
    {
      "level": "H2",
      "text": "¿Qué es un embudo de marketing de contenidos?"
    },
    {
      "level": "H2",
      "text": "¿Qué tiene de malo el modelo de embudo?"
    },
    {
      "level": "H3",
      "text": "1. No entiende el comportamiento del consumidor"
    },
    {
      "level": "H3",
      "text": "2. Intenta meter todo con calzador"
    },
    {
      "level": "H3",
      "text": "3. Descuida la retención de clientes"
    },
    {
      "level": "H3",
      "text": "4. Ignora la expansión del cliente"
    },
    {
      "level": "H2",
      "text": "3 alternativas sin embudo a tener en cuenta"
    },
    {
      "level": "H3",
      "text": "1. El framework del potencial empresarial"
    },
    {
      "level": "H3",
      "text": "2. El patio de recreo de los contenidos"
    },
    {
      "level": "H3",
      "text": "3. La red de grupos de canales"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}