{
  "url": "https://ahrefs.com/blog/es/enlaces-internos-seo/",
  "slug": "enlaces-internos-seo",
  "title": "Enlaces internos para SEO: una guía práctica",
  "description": "Los enlaces internos son cruciales para el éxito del SEO, pero reciben muy pocos o ningún crédito. Todos los sitios web los tienen, pero cuando se utilizan estratégicamente, los enlaces internos pueden mejorar significativamente el rendimiento SEO de una web.",
  "content": "Contenido Los enlaces internos son a los backlinks lo que Robin es a Batman: son cruciales para el éxito del SEO, pero reciben muy poco o ningún crédito.Los enlaces internos son aquellos enlaces que van de una página de un mismo dominio a otra.Todos los sitios web los tienen, pero la mayoría de la gente no sabe lo que son. Pero cuando se utilizan estratégicamente, los enlaces internos pueden mejorar significativamente el rendimiento de una web en los motores de búsqueda.En este caso práctico, Ninja Outreach explica cómo utilizaron los enlaces internos para aumentar el tráfico orgánico en un 40%, una estadística respaldada por nuestras estimaciones de tráfico orgánico para ninjaoutreach.com: En este artículo veremos por qué los enlaces internos son fundamentales para el éxito del SEO y cómo crear la estrategia de enlazado interno adecuada para tu web.Pero además, también vamos a mostrar cómo:Arreglar enlaces internos rotosCorregir redireccionamientos de enlaces internosEliminar enlaces internos a páginas poco importantesArreglar páginas importantes con enlaces profundosSolucionar problemas de “páginas huérfanas”Pero primero cubramos los aspectos básicos¿Estás empezando en esto del SEO técnico? Empieza con nuestra:Guía para principiantes sobre SEO técnicoPor qué los enlaces internos son importantes para el SEOGoogle utiliza los enlaces internos para ayudar a descubrir contenidos nuevos.Supongamos que acabas de publicar una página web y te olvidas de enlazarla desde otra parte de tu web. Si suponemos que la página no está en el sitemap y no tiene ningún backlink, Google no sabrá que existe. ¿La razón? Su rastreador web no puede encontrarla.Esto es lo que dice Google:Google tiene que buscar constantemente páginas nuevas y actualizadas, y añadirlas a nuestra lista de páginas conocidas. Algunas páginas las conocemos porque Google ya las ha visitado. Otras, en cambio, las encontramos siguiendo enlaces de páginas conocidas que nos llevan a ellas.Las páginas sin enlaces internos que apunten a ellas se conocen como páginas huérfanas. (Hablaremos de esto más adelante).Los enlaces internos también ayudan al flujo de PageRank alrededor de tu web. Esto es muy importante, ya que cuantos más enlaces internos tenga una página, mayor será su PageRank. Sin embargo, no todo es cuestión de cantidad. La calidad del enlace desempeña un papel fundamental.Aquí tienes una visión simplificada de cómo funciona PageRank:UNA NOTA SOBRE PAGERANKGoogle eliminó las puntuaciones públicas de PageRank en 2016. Sin embargo, PageRank sigue siendo una parte fundamental de su algoritmo de posicionamiento. Lo sabemos porque ellos lo han dicho.Es posible que esta sea una de las razones por las que Google lo afirma:El número de enlaces internos que apuntan a una página es una señal para los motores de búsqueda sobre la importancia relativa de esa página.Google también se fija en el texto ancla de los enlaces internos para comprender mejor el contexto, como confirma este tweet de John Mueller.En otras palabras, digamos que tienes una página sobre widgets azules. Hay varios enlaces internos que apuntan a esa página con anclas como widgets, widgets azules y comprar widgets azules. Eso ayuda a Google a entender que la página:Se trata de widgets azules, y por lo tanto:Podría merecer el ranking en widgets azules y otros términos relevantes.¿Te has fijado en que he puesto en negrita la palabra “podría”?El hecho de que la página trate sobre un tema concreto no significa que merezca el posicionamiento con las palabras clave relacionadas.Nota al margen.Google también señala que la estructura de enlaces internos puede afectar a los enlaces del sitio. No es un problema grave, pero hay que tenerlo en cuenta.Podrías estar pensando “si quiero posicionarme con widgets azules, tan solo tendría que añadir tantos enlaces internos como sea posible a esa página con widgets azules como el texto de anclaje… ¿no?”Más o menos, pero esta forma de pensar puede conducir a enlaces internos de baja calidad y poco naturales.Un ejemplo:Hay que ser un poco más inteligente, y todo empieza por la arquitectura web.Cómo establecer la estructura ideal de enlaces internosPiensa en tu web como si fuese una pirámide con el contenido más importante en la parte superior y el menos importante en la inferior.La mayoría de las webs tienen la misma página en la cima de la pirámide: la página de inicio. Debajo de ella, están las siguientes páginas más importantes: acerca de nosotros, servicios, productos, blog, etc. Debajo de cada una de ellas, tienen páginas algo menos importantes: páginas de productos y servicios individuales, blog posts, etc.Pero no hay que enlazar todas las páginas de un nivel jerárquico con todas las del otro. Hay que tener en cuenta la relevancia.El arte del siloEl siloing (se podría traducir del inglés como aislamiento) es la agrupación de páginas web relacionadas por temas a través de enlaces internos.Por ejemplo, imaginemos que tenemos una web sobre países y ciudades con estas páginas:Se puede ver que cada página pertenece a uno de dos grupos distintos:Páginas sobre paísesPáginas sobre las ciudades de esos paísesAsí es como se pueden “aislar” estas páginas:Cada página de país actúa como un “centro” y enlaza con subpáginas sobre ciudades relacionadas (y viceversa). Así se crea un grupo temático o content hub: un conjunto de páginas interconectadas directamente con el mismo tema.Esto tiene tres ventajas:A los usuarios les resultará más fácil navegar por tu web.A los robots de rastreo les resultará más fácil comprender la arquitectura de tu web.Se transfiere más “autoridad” a las páginas más importantes (porque las subpáginas enlazan con las páginas centrales y viceversa).Pero hay otra ventaja que a menudo se pasa por alto: este tipo de estructura puede ayudar a los motores de búsqueda a entender mejor el contexto de los contenidos.Digamos que tengo la siguiente página: dominio.com/calabaza¿Esta página va sobre calabazas, o quizás sobre cómo preparar calabazas para halloween? A saber.¿Y si esta página forma parte del siguiente silo?:Otra ventaja de la estructura silo que pasa desapercibida es que, como se enlaza desde y hacia páginas relacionadas por temas, se suele tener muchas oportunidades de hacerlo utilizando un texto de anclaje relevante.Por ejemplo, tiene todo el sentido del mundo enlazar desde una página sobre frutas y verduras a otra sobre calabaza con “calabaza” como texto ancla.Como hemos visto antes, no es necesario “meter con calzador” ese enlace en una página no relacionada.¿Quiere más información? Lee la guía de Bruce Clay sobre SEO siloing. (En inglés).Cómo auditar los enlaces internos para detectar problemasTodo lo que acabamos de ver tiene sentido, pero, a no ser que estés empezando una web desde cero, las cosas no siempre van a estar tan organizadas como te gustaría.Por esta razón, conviene auditar los enlaces internos existentes antes de añadir más.No es tan difícil como parece. El primer paso es rastrear tu web con el Site Audit de Ahrefs.Te explicamos cómo hacerlo (vídeo en inglés):https://www.youtube.com/watch?v=LjinWqfGyVENota al margen.Hay varias opciones que permiten hacer algunas de las cosas que se mencionan a continuación sin rastrear el sitio. Las mencionaré a medida que vayamos avanzando. No obstante, si eres usuario de Ahrefs, mi recomendación es que establezcas un rastreo para asegurarte de que tienes los datos más recientes con los que trabajar.Una vez finalizado el rastreo, comprueba estos cinco problemas:1. Enlaces internos rotosSite Audit > Internal pages > Issues tab > 4XX pageEste informe te muestra todas las páginas internas rotas de tu web.Estas son perjudiciales porque desperdician el “link equity” y dan lugar a una mala experiencia de usuario.Recomiendo ordenar por la columna “No. of inlinks” de mayor a menor para dar prioridad a las páginas con muchos enlaces internos apuntando a ellas.Veamos algunas soluciones:Restablece la página rota en la misma URL (si se ha eliminado por accidente).Redirige la página rota a otra URL relevante. Actualiza o elimina todos los enlaces internos que apunten a ella.Si te decantas por la segunda solución, puedes ver todos los enlaces a la página rota pulsando el número correspondiente en la columna “No. of inlinks”.Te informa de la página de referencia y el texto ancla, lo que facilita su localización y eliminación/actualización.Más información en nuestra guía completa para encontrar y corregir enlaces rotos. TIP¿No tienes tiempo? Prueba esto:Site Explorer > Introduce tu dominio > Mejor por enlaces > Añade un filtro 404 > Cambia a “internal backlinks” > Ordena por enlaces internos dofollowNota. También deberías ordenar por enlaces internos nofollow. Todos los enlaces internos rotos deberían estar arreglados.Basta con hacer clic en el número de enlaces internos para ver los enlaces existentes.Usar Site Explorer en vez de Site Audit es útil para cuando quieras ver enlaces internos rotos en un sitio web de terceros sin tener que ejecutar un rastreo completo.2. Enlaces internos a páginas redirigidasSite Audit > Redirects > Issues tab > 3XX redirectEste informe muestra todas las páginas redirigidas (3XX) de una web.Ordena por “No. of inlinks” (de mayor a menor) para priorizar las páginas con más enlaces internos apuntando a ellas.Es importante tener en cuenta que no todas tienen por qué ser problemáticas. Por ejemplo, si tienes enlaces internos que apuntan a páginas redirigidas (por ejemplo, http://dominio.com/blog → https://dominio.com/blog), es posible que no haya nada de qué preocuparse.Aun así, no hay nada malo en actualizar estas redirecciones para eliminar el “link hop” adicional.En cualquier caso, hay que estar atento a las páginas que redirigen a algo no muy relevante.Un ejemplo:Se trata de 20 enlaces internos a una marca específica de calzado, que ahora redirige a una página genérica de calzado de mujer. Peor aún, si hacemos clic en el número de enlaces internos, podemos ver que el texto ancla utilizado para estos enlaces es “Jeffrey Campbell” (el nombre de la marca).Resulta engañoso. Los enlaces deberían eliminarse o actualizarse.TIPTambién puedes usar Site Explorer para encontrar enlaces internos redirigidos.Site Explorer > Introduce tu dominio > Mejor por enlaces > Añade un filtro de Código HTTP 3XX Redirigir > Haz clic en “Internal Backlinks” > Ordena por enlaces internos dofollowNota. Una vez más, también deberías comprobar y arreglar los enlaces internos nofollow.3. Muchos enlaces internos a páginas sin importanciaSite Audit > Internal pages > Success (2XX)Este informe muestra las páginas que funcionan en tu web.Ordena por “No. of inlinks” (de mayor a menor), y empieza a revisar esta lista. Si ves páginas sin importancia con muchos enlaces internos, elimínalas. Puede que incluso tenga más sentido eliminar esas páginas.Este es el tipo de cosas que puedes encontrar a menudo con esta táctica:Este post trata de las novedades de junio. Como ya han pasado unos meses y no estamos en junio lo más probable es que esta página no sea especialmente útil ni reciba mucho tráfico, y aún así tiene 16 enlaces internos.Personalmente me inclinaría por suprimir esta página y eliminar los enlaces internos.TIPTambién puedes personalizar las columnas y ordenarlas por el número de enlaces internos dofollow, lo que puede ser útil para filtrar cosas como páginas de inicio de sesión con muchos enlaces internos nofollow.Puede que tenga sentido buscar páginas no indexables con muchos enlaces internos que apunten a ellas, especialmente si son dofollow. Esto se puede hacer utilizando el Page Explorer en Site Audit con los siguientes filtros:A no ser que estos enlaces sean esenciales para la navegación, lo único que hacen es malgastar “link equity”.Es más, si las páginas se configuran como “noindex, follow”, Google las considerará como “noindex, nofollow” a largo plazo. El resultado es una interrupción efectiva del flujo de “link juice” a través de estas páginas, por lo que es mejor no enlazarlas internamente con enlaces “dofollow”.TIPEsto también se puede hacer (hasta cierto punto) en Site Explorer.Site Explorer > Introduce tu dominio > Mejor por enlaces > Añade un filtro de Código HTTP 2OO OK > Haz clic en “Internal Backlinks” > Ordena por enlaces internos dofollowNota. No hay forma de ver si una página es indexable en Site Explorer, tendrías que utilizar Site Audit.4. Páginas importantes con enlaces profundosSite Audit > Internal pages > 2XXEste informe muestra las páginas que están funcionando en tu web. Ordena por “Depth” (de mayor a menor) para ver las páginas que tienen más clics (saltos de enlace) de distancia de tu página semilla, que posiblemente sea tu página de inicio.Como regla general, si ves alguna página importante (alguna que te genere ingresos, que convierta bien, que apunte a una palabra clave importante, etc.) a más de tres saltos de enlaces de tu página de inicio, es posible que quieras plantearte ajustar la estructura de enlaces internos para acercarlas.Hay un par de razones por las que esto tiene sentido:Google puede considerar que las páginas “profundas” son relativamente poco importantes: por lo que es posible que no las vuelvan a rastrear con demasiada frecuencia. No siempre es un problema, pero hay que tenerlo en cuenta.La página con más autoridad en la mayoría de webs es la página de inicio: cuanto más cerca esté una página de la homepage en términos de saltos de enlaces, mayor será la transferencia de PageRank a esa página.5. Páginas huérfanasSite Audit > Links > Issues tab > Orphan page (has no incoming internal links) Este informe muestra las páginas sin enlaces internos, es decir, las páginas huérfanas.Nota al margen.Para que esto funcione, es fundamental que especifiques la URL del sitemap o que dejes marcada la casilla “Auto-detect sitemaps” cuando configures un rastreo. Si optas por esta última opción, Site Audit solo podrá encontrar tu sitemap si aparece en el archivo robots.txt o se encuentra en tudominio.com/sitemap.xml.Ninguna página importante debería quedarse huérfana por dos razones:Google no podrá encontrarla (a menos que envíes tu sitemap a través de Google Search Console, o que tengan backlinks de páginas rastreadas en otras webs).No se transferirá PageRank a través de enlaces internos, ya que no existen.Examina la lista y asegúrate de que no aparecen páginas importantes.Si tienes muchas páginas en tu web, intenta ordenar la lista por tráfico orgánico de mayor a menor. Las páginas huérfanas que aún reciben tráfico orgánico es posible que obtengan aún más tráfico si se enlazan internamente.Cómo utilizar estratégicamente los enlaces internos para impulsar las páginasLos enlaces internos no son la única forma de aumentar la autoridad (PageRank) de una página. Los backlinks también ayudan.Echa un vistazo a las páginas más potentes del blog de Ahrefs:Las páginas con mayor autoridad, es decir, con una calificación de URL (UR), tienen montones de backlinks.Sí, también forman parte de la estructura general de nuestro sitio y tienen enlaces internos, pero son los enlaces de fuentes externas los que dan a estas páginas su poder.Lo que nos lleva a lo que quiero decir:Enlazar internamente desde páginas relevantes y de alta autoridad a aquellas que necesitan un impulso es una estrategia muy acertada.Hay muchas formas de hacerlo, y los métodos pueden ser bastante elaborados y complicados (hojas de cálculo, VLOOKUPS, etc.).Así que a continuación, me centraré en dos estrategias, sencillas, que todo el mundo puede utilizar.Método #1 - Realiza una búsqueda “site:”.Digamos que has publicado un post nuevo sobre SEO de imágenes. (Lo hemos publicado hace poco, así que seguiremos con este ejemplo).Quieres añadir algunos enlaces internos a la página para darle un empujón.Pero, ¿cómo sabes desde dónde la puedes enlazar?Empieza buscando en Google con el siguiente operador de búsqueda: site:tudominio.com \"palabra clave o frase relacionada con la página\"Aquí tienes un ejemplo para “image SEO”:Esta búsqueda devuelve las páginas de tu web (en el índice de Google) que hacen mención a una palabra o frase específica.En este caso, la frase “image SEO” aparece en 62 posts de nuestro blog, incluida nuestra guía para principiantes al SEO técnico. Por lo que bastaría con revisar el post y ver si esas palabras están enlazadas o no. ¿Si no están enlazadas? No hay tiempo que perder.¿Ves a dónde queremos llegar? Es el lugar perfecto para enlazar a nuestra guía SEO de imágenes con un texto ancla adecuado.Tampoco es el único lugar desde el que podemos enlazar. Hay otras páginas que también mencionan esa frase, sin contar la propia guía. Así que los podemos comprobar rápidamente y añadir enlaces donde sea relevante.TIPTambién puedes buscar en Google otras palabras clave para encontrar ubicaciones más relevantes donde poder añadir enlaces internos. Por ejemplo, para nuestra guía SEO de imágenes, también podemos buscar:site:ahrefs.com/blog “texto alt” site:ahrefs.com/blog “google imágenes”Ahora bien, este proceso está bien siempre y cuando tengas un sitio pequeño. La verdad es que 62 resultados son bastantes, pero puedes revisar las páginas manualmente.Sin embargo, si tienes un sitio más grande y ves muchos resultados con la consulta, tiene sentido priorizar y añadir enlaces de las páginas más potentes.Hay dos formas de hacerlo.La primera es utilizar la Barra de herramientas SEO de Ahrefs para descargar los 100 primeros resultados de búsqueda de Google, junto con las métricas SEO de Ahrefs. A continuación, puedes ordenar por UR para dar prioridad a las páginas más “poderosas”.La segunda es extraer los resultados de Google utilizando la extensión Scraper de Chrome (aquí está el XPath para hacerlo: //div[@class=“srg”]/div/div/div/div/a/@href), y luego pegarlos en la herramienta de análisis por lotes de Ahrefs. Ordena por UR.Ambos métodos consiguen el mismo resultado.Cada vez que publicamos un artículo en nuestro blog, seguimos este proceso.Método #2 - Navega por las páginas “poderosas”Las páginas “poderosas” son las que tienen más backlinks y autoridad. Puedes encontrarlas utilizando el informe Mejor por enlaces del Site Explorer de Ahrefs.Site Explorer > Introduce tu dominio > Mejor por enlacesSi te vas desplazando por esta lista, encontrarás frecuentemente páginas y posts relevantes con los que puedes añadir enlaces.Por ejemplo, nuestra guía de link building es la octava página con más autoridad de nuestro blog. Ese artículo tiene un apartado sobre link building con imágenes, algo de lo que hablo brevemente en nuestra guía de SEO con imágenes.Se trata de otro lugar relevante y útil para añadir un enlace interno a esa guía.También puedes utilizar este método para dirigir algo de autoridad a las páginas de productos y servicios.Por ejemplo, supongamos que vendes proteínas en polvo online. Es posible que quieras que tu página de categoría de ecommerce se posicione en Google para cosas como “comprar proteína en polvo”. Este tipo de páginas pueden ser difíciles de enlazar.Pero, a lo mejor tienes un post con autoridad sobre las proteínas en polvo o la musculación desde el que puedes añadir enlaces internos.Estos enlaces internos aumentarán la “autoridad” de la página de la categoría de ecommerce.Reflexiones finalesLos enlaces internos no son nada del otro mundo. Simplemente necesitas una estructura lógica y jerárquica de la web y que tus enlaces internos sigan esa estructura. Eso es lo básico, por lo menos. A partir de ahí puedes enlazar estratégicamente desde tus “páginas potentes” a aquellas que necesiten un poco de ayuda SEO.Estas son algunas pautas que puedes seguir a la hora de crear enlaces internos:No utilices siempre el mismo texto ancla. Mezcla y diversifica.No enlaces desde páginas irrelevantes solo para aumentar la autoridad. Es mejor no enlazar internamente.No te pases. No es necesario añadir cientos de enlaces internos para que sea efectivo. Uno o dos enlaces internos bien ubicados pueden lograr grandes resultados.Lo dicho, no es nada del otro mundo. Sin embargo, si tienes dudas sobre qué hacer, te aconsejo que pases una o dos horas explorando la Wikipedia. Su sistema de enlaces internos es perfecto, y puedes aprender mucho de ellos, aunque solo tengas una web pequeña. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Enlaces internos para SEO: una guía práctica"
    },
    {
      "level": "H2",
      "text": "Por qué los enlaces internos son importantes para el SEO"
    },
    {
      "level": "H2",
      "text": "Cómo establecer la estructura ideal de enlaces internos"
    },
    {
      "level": "H3",
      "text": "El arte del silo"
    },
    {
      "level": "H2",
      "text": "Cómo auditar los enlaces internos para detectar problemas"
    },
    {
      "level": "H3",
      "text": "1. Enlaces internos rotos"
    },
    {
      "level": "H3",
      "text": "2. Enlaces internos a páginas redirigidas"
    },
    {
      "level": "H3",
      "text": "3. Muchos enlaces internos a páginas sin importancia"
    },
    {
      "level": "H3",
      "text": "4. Páginas importantes con enlaces profundos"
    },
    {
      "level": "H3",
      "text": "5. Páginas huérfanas"
    },
    {
      "level": "H2",
      "text": "Cómo utilizar estratégicamente los enlaces internos para impulsar las páginas"
    },
    {
      "level": "H3",
      "text": "Método #1 - Realiza una búsqueda “site:”."
    },
    {
      "level": "H3",
      "text": "Método #2 - Navega por las páginas “poderosas”"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Chris Haines"
}