{
  "url": "https://ahrefs.com/blog/es/enlaces-de-sitio/",
  "slug": "enlaces-de-sitio",
  "title": "¿Qué son los enlaces de sitio? Cómo influir en ellos",
  "description": "Aprende cuáles son los diferentes tipos de enlaces de sitio, por qué son importantes y cómo puede editarlos.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido Los enlaces de sitio son enlaces a otras páginas (o secciones de una página) que aparecen debajo de algunos resultados de búsqueda de Google. Ayudan a los usuarios a navegar rápidamente hacia la información relevante en un sitio web. Los enlaces de sitio aparecieron por primera vez en 2005 y se anunciaron oficialmente en 2006.Aquí hay un ejemplo:Los enlaces de sitio son una de las funciones de búsqueda más comunes. Aparecen en el 1.8% de los SERP en la base de datos de Ahrefs en los EE. UU. Casi todos los términos de marca tienen enlaces de sitio y también aparecen en muchas otras consultas, como consultas informativas. De hecho, casi el 67% de todas las palabras clave orgánicas para Wikipedia.org contienen enlaces de sitio.Profundicemos en algunas preguntas comunes sobre:Los diferentes tipos de enlaces de sitioPor qué quieres enlaces de sitioCómo influir en los enlaces de sitioLos diferentes tipos de enlaces de sitioLos enlaces de sitio han evolucionado a lo largo de los años y se muestran de muchas maneras diferentes. Google a menudo está cambiando cosas como la cantidad de enlaces de sitio que se muestran y la aparición de enlaces de sitio en los resultados de búsqueda. Es posible que veas algunos enlaces de sitio con contornos, con imágenes, en formato de carrusel o que se expandan. Aquí hay diferentes tipos de enlaces de sitio que Google muestra hoy.Enlaces de sitio pagadosEn este artículo, cubriré principalmente los enlacees a sitios orgánicos, pero quería señalar que las extensiones de vínculos a sitios pueden aparecer en los anuncios. La mayor diferencia entre los enlaces de sitio pagos y otros tipos de enlaces de sitio es que puedes controlar fácilmente el texto y las URL que se muestran con sus anuncios. Otros tipos de enlaces de sitio se generan automáticamente y dependen de algoritmos para determinar el contenido y los enlaces.Enlaces de sitio orgánicosEstos enlaces de sitio aparecen para términos mayormente de marca y contienen hasta seis enlaces de sitio a otras páginas de su sitio web. Solo aparecen en el resultado de búsqueda superior.Enlaces de sitio orgánicos de una líneaLos enlaces de sitio de una línea pueden aparecer en muchos tipos de consultas. Por lo general, contienen hasta cuatro enlaces de sitio, pero hay una variación que muestra más enlaces de sitio en un carrusel. Estos enlaces de sitio pueden ir a otras páginas de un sitio o saltar directamente al contenido dentro de las páginas mediante enlaces de fragmentos (#).Cuadro de búsqueda de enlaces de sitio orgánicosUn cuadro de búsqueda de enlaces de sitio permite a los usuarios buscar y saltar directamente a los resultados de búsqueda de un sitio web o aplicación. Esto solo aparece para los términos de marca y Google lo agrega automáticamente. Puede ayudarlos a comprender mejor su sitio agregando los datos estructurados para un cuadro de búsqueda de enlaces de sitio a su página de inicio, pero no es obligatorio y no hace que sea más probable que aparezca un cuadro de búsqueda de enlaces de sitio en los resultados de búsqueda.Muchas herramientas e informes dentro de Ahrefs contienen filtros para enlaces de sitio como una función SERP. Por ejemplo, puede encontrar palabras clave para las que clasifica en el Explorador de sitios de Ahrefs que también tienen enlaces de sitio.Por qué quieres enlaces de sitioLos enlaces de sitio te brindan más visibilidad en los resultados de búsqueda. Los enlaces adicionales ocupan más espacio y también hacen que tu sitio se destaque de otros resultados de búsqueda.Con los enlaces de sitio, también estás ayudando a los usuarios a acceder a contenido que podrían desear más rápido. Esto podría ser contenido en una página o en una página diferente. Por ejemplo, de acuerdo con los datos de Google Search Console, el 12.9% de los clics en nuestros “ahrefs” de búsqueda de marca van a los enlaces de sitio en lugar de a la página de inicio.Cómo influir en los enlaces de sitioNo puedes editar enlaces de sitio en los resultados de búsqueda orgánicos. Se generan algorítmicamente. Solías poder degradarlos en Google Search Console, pero desafortunadamente Google eliminó esta opción. Sin embargo, hay algunas formas de influir en ellos.Estructura del sitio. La arquitectura de tu sitio web desempeña un papel en el que se muestran los enlaces de sitio. Si tienes una arquitectura plana, es posible que Google deba confiar en otras señales para mostrar enlaces de sitio.Enlace interno. El modo en que tus páginas enlazan con otras páginas y el texto de anclaje utilizado influirán en los enlaces de sitio. Lo mismo ocurre con la ubicación de los enlaces en la página y las migas de pan.Noindex. Las páginas sin indexación eliminarán su visualización en enlaces de sitio. Si bien no es el mejor control y rara vez lo recomendaría, vale la pena llamarlo por los raros casos en los que sería útil.Eliminando el cuadro de búsqueda de enlaces de sitio. Si no deseas que se muestre el cuadro de búsqueda de enlaces de sitio para su sitio web, puede agregar la siguiente etiqueta a su página de inicio: <meta name=\"google\" content=\"nositelinkssearchbox\"/>Utilidad y relevancia. Piense en diferentes cosas que son útiles para los usuarios y proporcione resultados relevantes. Hreflang. Las etiquetas Hreflang pueden ayudar a Google a mostrar enlaces de sitio relevantes según las preferencias de idioma y país.Encabezados, tal vez tabla de contenido. Muchos enlaces de sitio de una línea tienen el mismo contenido que los encabezados de la página. En Ahrefs, además de encabezados útiles, también incluimos una tabla de contenido en nuestras publicaciones que puede agregar contexto adicional.Lo que la gente busca (tal vez). Si bien no creo que esto se haya confirmado, en la mayoría de los casos los términos que las personas buscan se correlacionan mucho con los enlaces de sitio que se muestran. Muchos de los términos más buscados en torno a “ahrefs” también se muestran en los enlaces de sitio.Señales de usuario (tal vez). Una patente de Bing reveló que pueden usar datos de clics para su versión de enlaces de sitio llamados enlaces profundos. Diría que es posible, aunque no está confirmado que Google también pueda usar esta información.En Ahrefs, puedes ver las palabras clave que activan los enlaces de sitio para tu sitio y qué páginas aparecen en ellos. Simplemente diríjete al informe de Palabras clave orgánicas en el Explorador de sitios de Ahrefs, selecciona “Vínculos a sitios” en el menú desplegable de características de SERP, luego active el cuadro “Solo vincular al objetivo”.Si crees que un resultado no es lo que debería mostrar, utiliza la información anterior para realizar cambios que puedan afectar los enlaces de sitio que se muestran.ConclusiónLos enlaces de sitio ofrecen más espacio en los SERP a los sitios web y son útiles para los usuarios. Si bien no hay controles directos para los enlaces de sitio, puedes usar la información anterior para influir en lo que se muestra y obtener nuevos enlaces de sitio.¿Tienes preguntas? Avísame en Twitter Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué son los enlaces de sitio? Cómo influir en ellos"
    },
    {
      "level": "H2",
      "text": "Los diferentes tipos de enlaces de sitio"
    },
    {
      "level": "H3",
      "text": "Enlaces de sitio pagados"
    },
    {
      "level": "H3",
      "text": "Enlaces de sitio orgánicos"
    },
    {
      "level": "H3",
      "text": "Enlaces de sitio orgánicos de una línea"
    },
    {
      "level": "H3",
      "text": "Cuadro de búsqueda de enlaces de sitio orgánicos"
    },
    {
      "level": "H2",
      "text": "Por qué quieres enlaces de sitio"
    },
    {
      "level": "H2",
      "text": "Cómo influir en los enlaces de sitio"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Patrick Stox"
}