{
  "url": "https://ahrefs.com/blog/es/enlaces-nofollow/",
  "slug": "enlaces-nofollow",
  "title": "¿Qué es un Enlace Nofollow? Todo lo Que Necesitas Saber (¡Sin Jerga!)",
  "description": "Enlaces no seguidos vs seguidos. ¿Cuál es la diferencia? ¿Cómo afectan al SEO? Aprende todo lo que necesitas saber en esta guía completa.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La etiqueta rel = “nofollow” es una de las etiquetas HTML más simples, y una que es crucial de entender si estás haciendo SEO. Aprende todo lo que necesita saber y más sobre los enlaces no seguidos en esta guía. Los enlaces Nofollow no son nada nuevo. Han existido por 14 años.Si te importa el rendimiento de tu sitio web en los motores de búsqueda, entonces saber cuándo sí y cuándo no usar enlaces no seguidos no solo es importante, es crucial.En esta guía, explicaré cómo surgieron los enlaces no seguidos, cómo ayudan con el SEO y cómo usarlos correctamente puede proteger tu sitio de una temida penalización de Google.Primero, sin embargo, cubramos lo básico.¿Qué son los enlaces nofollow?Los enlaces o links no seguidos - nofollowed- son hipervínculos que tienen un atributo rel con el valor “nofollow.”Dichos enlaces no influyen en la clasificación de los motores de búsqueda de la URL de destino porque Google no transfiere PageRank o anchor text a través de estos enlaces. De hecho, Google ni siquiera rastrea enlaces no seguidos.Lectura recomendada: Google PageRank NO está muerto: por qué sigue importandoEnlaces Nofollow vs. followLos enlaces seguidos y no seguidos se ven idénticos al usuario web promedio.El texto azul en esta oración es un enlace seguido -followed. El texto azul en esta oración es un enlace no seguido -nofollowed. La diferencia entre los dos es evidente solo cuando profundizas en el código HTML.Seguido: <a href=\"https://ahrefs.com”> Ahrefs </a>No seguido:<a href=\"https://ahrefs.com” rel=\"nofollow\"> Ahrefs </a>El HTML es idéntico, excepto por la adición de la etiqueta rel=“nofollow”.Es posible aplicar un nofollow a todos los enlaces en una página web colocando la etiqueta <meta name = “robots” content = “nofollow” /> en el encabezado de la página. Sin embargo, la etiqueta rel = ”nofollow” se usa más comúnmente ya que le permite a uno no seguir algunos enlaces en la página mientras deja otros como seguidos.¿No estás seguro de por qué quieres hacer eso? Es hora de una rápida lección de historia.La historia de rel =“nofollow”Google originalmente introdujo la etiqueta nofollow en 2005 para combatir el spam de comentarios.Si eres un blogger (o un lector de blogs), estás dolorosamente familiarizado con las personas que intentan elevar el ranking de los motores de búsqueda de sus propios sitios web enviando comentarios de blog vinculados como “Visita mi sitio de descuentos en productos farmacéuticos”. Esto se llama spam de comentarios, tampoco nos gusta, y hemos estado probando una nueva etiqueta que lo bloquea. De ahora en adelante, cuando Google vea el atributo (rel = “nofollow”) en los hipervínculos, esos enlaces no obtendrán ningún crédito cuando clasifiquemos los sitios web en nuestros resultados de búsqueda. Este no es un voto negativo para el sitio donde se publicó el comentario; es solo una forma de asegurarse de que los spammers no obtengan ningún beneficio al abusar de áreas públicas como comentarios de blog, trackbacks y listas de referencias.Poco después, Yahoo, Bing y algunos otros motores de búsqueda también anunciaron su compromiso con la etiqueta nofollow.NOTA IMPORTANTELa interpretación de nofollow varía un poco entre los motores de búsqueda. Aquí hay una tabla que muestra las diferencias. Hoy en día, WordPress agrega la etiqueta nofollow a comentarios con enlaces de forma predeterminada, al igual que muchos otros CMS ‘. Por lo tanto, incluso si nunca antes has oído hablar de un enlace nofollow, ten la seguridad de que cualquier comentarista spam en tu blog probablemente no recibirá ningún beneficio SEO de sus esfuerzos.Sin embargo, si te preocupa que tus comentarios puedan no ser no seguidos, aquí te mostramos cómo verificarlo:Encuentra un comentarioHaz clic derecho en el enlaceHaz clic en “Inspeccionar”Mira el código HTML resaltado.Si ves la etiqueta rel = nofollow, no se sigue. De lo contrario, se sigue.¿No te sientes cómodo metiéndote en el código HTML? Instala la extensión Chrome nofollow que resalta visiblemente todos los enlaces no seguidos mientras navegas por la web.¿Entendido? Bueno. De vuelta a nuestra lección de historia.2009: Google combate el PageRank sculptingEl PageRank fluye alrededor de un sitio web a través de enlaces internos (enlaces de una página en el sitio a otra).Por ejemplo, parte del PageRank de este artículo fluye a las otras páginas de nuestro sitio a través de hipervínculos como este. En general, un PageRank más alto equivale a una clasificación más alta. Gary Illyses confirmó este último año.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理” Illyes (@methode) 9 February 2017¿Sabías que después de 18 años todavía estamos usando Page Rank (y 100´s de otras señales) en el ranking?¿Quieres saber cómo funciona?Sin embargo, PageRank solo se transfiere a través de enlaces seguidos, no a través de enlaces no seguidos.Ese siempre ha sido el caso, pero la forma en que se comparte PageRank entre los enlaces seguidos en una página ha cambiado con los años.Antes de 2009, funcionaba así:Si tenías tres enlaces en una página y uno de ellos era no seguido, el PageRank total se dividía entre los dos enlaces followed.Desafortunadamente, algunas personas comenzaron a aprovechar este aspecto técnico para manipular los rankings al esculpir el flujo de PageRank alrededor de sus sitios.En otras palabras, no seguían los enlaces a sus páginas sin importancia para permitir la máxima transferencia de PageRank a sus páginas de “dinero” o monetizables.Google anunció cambios para cortar esta práctica de raíz en 2009: Entonces, ¿qué sucede cuando tienes una página con “diez puntos de PageRank” y diez links salientes, y cinco de esos links son nofollowed? […] Originalmente, los cinco enlaces sin nofollow habrían fluido dos puntos de PageRank cada uno […] Hace más de un año, Google cambió la forma en que fluye el PageRank para que los cinco enlaces sin nofollow fluyan un punto de PageRank cada uno. Aquí hay una ilustración del antes y el después:NOTA IMPORTANTEPageRank es una bestia compleja. Han pasado diez años desde que Google hizo este cambio. Si bien no han anunciado públicamente ningún cambio adicional en el funcionamiento del PageRank en los últimos años, es probable que al menos algunos cambios hayan tenido lugar detrás de escena.TIP PROAunque que el PageRank Sculpting ya no es una cosa, el “no seguir” algunos enlaces internos puede ayudar a priorizar el rastreo porque Google no rastrea enlaces no seguidos. Los robots de los motores de búsqueda no pueden iniciar sesión o registrarse como miembro en tu foro, por lo que no hay razón para invitar a Googlebot a seguir los enlaces “registrarse aquí” o “iniciar sesión”. El uso de nofollow en estos enlaces permite que Googlebot rastree otras páginas que preferiría ver en el índice de Google. Lectura recomendada: Presupuesto de rastreo para SEO: la guía de referencia definitiva2013 en adelante: Google combate los enlaces pagadosGoogle clasifica la compra o venta de enlaces que pasan PageRank como una violación de sus Directrices para webmasters.Como tal, todos los enlaces pagados deben ser nofollowed. Ese ha sido el caso durante muchos años, incluso mucho antes de 2013.Sin embargo, por lo que puedo ver, Google se comenzó a preocupar cada vez más por el efecto de los enlaces pagados no revelados en su algoritmo en ese momento … y lo ha estado desde entonces.Matt Cutts profundiza en su razonamiento para la divulgación de enlaces pagados en este video de 2013:https://www.youtube.com/watch?v=1SmlsfSqmOwPero para resumir: Google quiere recompensar los enlaces ganados, no los pagados . La gente trata los links como votos editoriales. Enlazan a algo porque inspira pasión en ellos. Es algo que es interesante. Quieren compartirlo con amigos. Hay alguna razón por la que quieren resaltar ese enlace en particular. El problema es que algunos enlaces pagados no se ven diferentes de los enlaces ganados. Piensa en la diferencia entre un enlace en una reseña pagada y un enlace en una reseña no pagada.A primera vista, ambos enlaces se verán idénticos. Es por eso que debe haber una manera de revelar el pago a Google.Piénsalo de esta manera: Hay dos maneras de obtener un Óscar:Opción # 1: vivir para actuar, perfeccionar continuamente tu oficio y trabajar duro durante años.Opcion 2: Comprar 6 de ellos por $ 8.97 en Amazon…La etiqueta nofollow (en enlaces pagados) es para Google lo que el sticker de $8.97 en la parte inferior de tu Óscar falso es para tus amigos: una señal reveladora de que no ganaste esto legítimamente y por lo tanto, no mereces crédito por tus bobadas esfuerzos manipuladores.¿Los enlaces nofollow ayudan con el SEO?Repasemos brevemente lo que Google dice sobre la forma en que manejan los links no seguidos: Google no transfiere PageRank ni anchor text a través de estos enlaces.Todo parece bastante claro hasta que lees la oración que lo precede: En general, no los seguimos. Esto significa que Google no transfiere PageRank ni anchor text a través de estos enlaces. En general, creo que esta afirmación es más ambigua de lo necesario e implica que en algunos casos siguen enlaces no seguidos.Cuáles pueden ser esos casos, nadie lo sabe.Algunos creen que todos los enlaces no seguidos aún transfieren algo de PageRank. Algunos piensan que Google transfiere PageRank a algunos, pero no a todos los enlaces no seguidos. Otros (🙋‍♂️) creen que las personas están leyendo demasiado en una redacción que no ha cambiado durante la mayor parte de los siete años.A principios de este año, estudiamos 44,589 SERPs para ver si había alguna correlación entre los rankings de Google y varios atributos de backlinks, uno de los cuales era el número de backlinks seguidos.Aquí lo que encontramos:Esto es lo que Tim dijo sobre esto: Esto podría ser una indicación de que Google valora algunos enlaces no seguidos de páginas fuertes más que los enlaces seguidos de páginas débiles. #quiénsabe Tim Soulo, CMO AhrefsToma este hallazgo con grandes reservas. El objetivo principal de este estudio no era analizar el impacto de los enlaces nofollowed vs. los followed y, como tal, no hicimos ningún esfuerzo para aislar este factor.Pero incluso si suponemos que los enlaces no seguidos no tienen un impacto directo en el SEO, aún pueden tener un impacto indirecto porque:1. Ayudan a diversificar tu perfil de enlacesLos perfiles de backlinks naturales son diversos.Algunos enlaces se siguen y otros no se siguen. Ese hecho es inevitable porque algunas personas inevitablemente te enlazarán a través de links nofollowed … no importa cuánto desearías que este no fuera el caso.Además, la mayoría de los backlinks que obtienes de los siguientes lugares son no seguidos:Redes sociales (Facebook, Twitter, YouTube, etc.)Foros (Reddit, Quora, etc.)Comunicados de prensaLibros de visitas (¡hola, 1998!)Wikipedia (pista: cualquiera puede editar una página de Wikipedia)PingbacksDirectoriosEn pocas palabras, si un sitio web solo tiene backlinks seguidos o un porcentaje notablemente alto de backlinks no seguidos, entonces eso es una señal reveladora de que algo sospechoso está sucediendo.Para verificar la proporción de enlaces seguidos frente a los no seguidos para cualquier sitio web o página web, usa el reporte de Vista general en Ahrefs Site Explorer.Site Explorer> ingresa cualquier dominio, URL o subcarpeta> Vista GeneralParece que el 85% de los dominios de referencia (sitios web que enlazan) al blog de Ahrefs son followed.¿Esto es bueno o malo? Honestamente, mientras haya algo de diversidad aquí, es una buena señal.Lo que no quieres ver es 100% “dofollow” o algo parecido porque es un signo definitivo de manipulación. Por experiencia, diría que entre 60 y 90% es normal, pero ese rango no es definitivo. Si sospechas de un juego sucio, profundiza.2. Impulsan el tráfico, y el tráfico impulsa los enlaces seguidosLos enlaces no solo son útiles para fines de SEO. También generan tráfico de referencia.Por eso estamos tan activos en Quora.Si no has oído hablar de Quora antes, es un sitio web de preguntas y respuestas donde cualquiera puede responder las preguntas que publican. Dentro de dichas respuestas, Quora permite enlaces a recursos relevantes.Aquí hay una respuesta reciente publicada por nuestra Gerente de Marketing, Rebekah Bek, donde enlaza al blog de Ahrefs:Desafortunadamente, como todos los enlaces salientes en Quora no se siguen, ese enlace no tiene un efecto SEO directo.Pero aquí está la parte interesante:Si revisamos el informe de Perfil de Enlaces en Ahrefs Site Explorer para ahrefs.com y filtramos solo los enlaces “dofollow”, aquí está uno de los muchos backlinks que vemos:Ahora veamos más de cerca la página de referencia (la página de la cual proviene el enlace followed):La única razón por la que obtuvimos este enlace seguido es porque el autor de este artículo se topó con la respuesta de Rebekah en Quora. En otras palabras, el enlace no seguido indirectamente condujo a un enlace seguido.Así que recuerda esto: para que alguien te enlace, tres cosas tienen que pasar en este orden:Alguien ve tu contenidoGozan de tu contenidoLo recomiendan a los demás (a través de enlaces en su sitio)Debido a que los enlaces nofollow pueden ayudar con ese primer paso, a menudo son un catalizador para enlaces seguidos.3. Pueden proteger contra las sanciones de Google.A veces hay razones legítimas para pagar los enlaces.Si un sitio web recibe mucho tráfico, comprar una publicación patrocinada en ese sitio puede tener mucho sentido. Y si estás pagando un buen dinero por una mención, probablemente quieras incluir un backlink para que los lectores puedan encontrar fácilmente tu sitio web.¿El problema? Google afirma que los enlaces seguidos pagados están en contra de sus Directrices para Webmasters.Dicho esto, la comunidad SEO generalmente se divide en dos campos:Aquellos que creen que Google puede identificar con precisión los enlaces pagados algorítmicamente.Aquellos que creen que Google no puede identificar con precisión los enlaces pagados algorítmicamente.Cuál grupo tiene razón es un debate para otro día.Por ahora, supongamos que el grupo #2 tiene razón y que Google tiene dificultades para identificar enlaces pagados. Eso significa que es seguro comprar y vender enlaces al corazón de tu contenido, ¿verdad? No tan rápido.Google tiene una herramienta que permite a cualquier persona reportar a un sitio web por comprar o vender enlaces.Herramienta de Google para informar sobre enlaces pagados.Traducción: puede que no sea a Google a quien debas temer, sino a tus competidores.Piénsalo: si un competidor te ve bien clasificado para su palabra clave objetivo, y utiliza una herramienta como Site Explorer de Ahrefs para profundizar en tus backlinks, solo para descubrir enlaces seguidos como este:Ejemplo de un enlace pagado.Entonces, ¿por qué no lo denunciarían?Si hacerlo provoca que el equipo de spam web de Google eche un vistazo a tu sitio web, descubra los enlaces pagados y emita una penalización manual para tu sitio web, entonces ese es un competidor menos con el que competir en los resultados de búsqueda.Lo que nos lleva a:Cómo auditar tu sitio web en busca de problemas relacionados con los enlaces nofollowEl tener backlinks followed que violan las Directrices para Webmasters de Google es arriesgado.Lo mismo es cierto para los enlaces salientes en tu sitio web que deberían ser no seguidos.Pero esto no se trata solo de la ira de Google (es decir, sanciones). También puede ocurrir que ciertos enlaces internos no seguidos estén obstaculizando tu rendimiento de SEO.Lo que sigue es una auditoría rápida para ayudar a identificar y eliminar tales problemas.1. Busca backlinks seguidos con anchors ricos en palabras claveEs probable que las personas rara vez enlacen a tu sitio utilizando un anchor -texto ancla- de coincidencia exacta, por lo que los enlaces seguidos con textos ancla de coincidencia exacta pueden ser un signo de manipulación de backlinks.Para encontrarlos, usa el informe Anchors en Ahrefs Site Explorer.Site Explorer> ingresa tu dominio> Texto ancla> filtro DofollowAquí, vemos que la mayoría de las anclas o anchors de este sitio web son de marca o genéricas (difuminadas por motivos de privacidad), pero hay diecinueve sitios web (dominios de referencia) que enlazan con la frase “préstamos de día de pago” como el ancla.Si hacemos clic en detalles, luego en los dominios de referencia, podemos ver qué son estos sitios web.Luego, si volvemos a presionar la flecha, podemos ver el contexto de todos los enlaces de cada dominio.Aquí hay algunas pautas aproximadas para tratar con los diferentes tipos de enlaces que encuentres aquí:Enlaces comprados en sitios de baja calidad. Solicita que se elimine el enlace (preferiblemente) o que no se siga. Desautoriza a nivel de página o dominio si no lo hacen.Enlaces biográficos en Guest posts. ¿Has utilizado previamente anclas ricas en palabras clave en tus biografías de guest posts? Pídele a la persona a cargo de ese sitio que cambie el enlace rico en palabras clave por uno de marca. O, si prefieres mantener el enlace anclado, solicite que no se siga.Enlaces de widgets. Cambia el HTML de tu widget para que el enlace no se siga. Pídeles a los que ya han incrustado tu widget que no sigan el enlace.Enlaces en todo el sitio (sitewide links). Solicita que el enlace no se siga o se cambie a un ancla de marca.Ten en cuenta que los enlaces seguidos de coincidencia exacta no siempre son indicativos de enlaces de baja calidad o pagados.Dichos enlaces pueden ocurrir naturalmente y bajo circunstancias legítimas.Es por eso que siempre debes asegurarte de investigar los enlaces a profundidad antes de desautorizarlos o pedir que no se sigan.Si no lo haces, podrías terminar haciendo más daño que bien.TIP PROPara sitios web grandes, puede haber cientos o miles de anclas diferentes en el informe de Texto Ancla. Examinarlas todas puede llevar mucho tiempo.Aquí hay un truco rápido que puedes usar:Primero, exporta la lista completa de anclas followed.Site Explorer> ingresa tu dominio> Texto Ancla> agrega el filtro “dofollow”> Exportar> CSVLuego cópialos y pégalos en Ahrefs Keywords Explorer en lotes de hasta 10,000 a la vez.Presione buscar para generar un informe, luego ordena por la columna CPC de mayor a menor.Debido a que las anclas de alto CPC a menudo son más propensas a ser spam, esto debería resultar en que las anclas de spam se muestren en lo alto de la lista.Busca las anclas con aspecto de spam en el informe de Texto Ancla en Site Explorer e investiga más a fondo.2. Busca backlinks patrocinados seguidosLos backlinks de posts patrocinados - sponsored- siempre deben se no seguidos.Esto se debe a que efectivamente estás pagando por el enlace, por lo que no debería pasar PageRank.Para encontrar dichos enlaces, busca la palabra “patrocinado” (“sponsored”) en el reporte de Enlaces de tu sitio web en Ahrefs Site Explorer.Site Explorer> Enlaces> búsqueda de “patrocinado”> filtro de “dofollow”Comunícate y solicita que dichos enlaces no se sigan.3. Busca enlaces salientes followed y ricos en palabras clave en tu sitio web¿Sabía que Forbes hizo que todos sus enlaces salientes en 2017 fueran no seguidos?Este movimiento se produjo después de que notaron que algunos de sus colaboradores estaban vendiendo enlaces seguidos de sus artículos. Debido a que tienen tantos contribuyentes, decidieron que era imposible examinar todos los enlaces en el sitio y, por lo tanto, tomaron la opción perezosa de no seguir todo.¿Por qué es esto relevante?Porque si alguna vez has aceptado publicaciones de invitados en tu sitio, o tienes algún contenido generado por el usuario, podrías tener el mismo problema.Para saber si ese es el caso, echa un vistazo a tus anclas salientes en Ahrefs Site Explorer.Site Explorer> ingresa tu dominio> Enlaces salientes> Texto Ancla> agrega el filtro “dofollow”Busca palabras y frases sospechosas que no esperarías ver en tu sitio, y elimina o aplica nofollow a cualquiera que parezca manipuladora (por ejemplo, anclas ricas en palabras clave en las biografías de posts invitados, etc.).En cuanto a por qué esto es importante, Google explica esto mejor: Si no puedes o no quieres responder por el contenido de las páginas a las que enlazas desde su sitio- por ejemplo, comentarios de usuarios no confiables o entradas del libro de visitas- no debes seguir esos enlaces. Esto puede disuadir a los spammers de apuntar hacia tu sitio y ayudará a evitar que tu sitio pase involuntariamente PageRank a vecindarios malos en la web. TIP PRO¿Ves muchos anchors? Usa el Tip Pro #1.4. Busca enlaces patrocinados seguidos en tu sitio¿Alguna vez has aceptado una publicación patrocinada en tu sitio web? ¿Te aseguraste de no seguir el enlace?Si no estás seguro, puede valer la pena comprobarlo.site:tusitioweb.com \"publicación patrocinada\"Abre los resultados uno por uno y localiza el enlace patrocinado.Si instalaste la extensión Chrome nofollow, todos los enlaces nofollow en la página se resaltarán, por lo que el enlace patrocinado definitivamente debería resaltarse. Si no lo es, es un enlace seguido.Confirma que este es el caso profundizando en el HTML. Haz clic derecho en el enlace, presiona “Inspeccionar” y busca rel = ”nofollow”.Si está ausente, entonces es un enlace seguido y debes agregar una etiqueta nofollow.5. Busca enlaces internos seguidosNingún enlace interno debería ser no seguido a menos que apunten a páginas sin importancia o páginas que desees excluir de los índices de los motores de búsqueda.Para encontrar enlaces internos no seguidos, usa el informe Mejor por Enlaces en Ahrefs Site Explorer.Site Explorer> ingresa tu dominio> Mejor por enlaces> cambia a Interno> ordena por la columna “nofollow” Si ves alguna página con enlaces internos no seguidos, presiona el número para ver de dónde provienen esos enlaces e investiga más a fondo. Puede darse el caso de que tengan sentido (por ejemplo, enlaces internos no seguidos a una página de inicio de sesión).Sin embargo, si no hay una razón obvia para que los enlaces no se sigan, elimina la etiqueta nofollow.Ese es el caso aquí. Por alguna razón, tenemos un enlace no seguido de una publicación de blog a otra.TIP PROPara obtener un desglose más detallado de los problemas de enlaces internos no seguidos en tu sitio web, ejecuta un nuevo rastreo en Site Audit de Ahrefs.Esto no solo te proporciona datos 100% nuevos, sino que también te alerta sobre un montón de problemas específicos relacionados con los enlaces nofollow internos y externos.Ejemplo de problemas relacionados con los enlaces internos nofollow en Site Audit de AhrefsAprende cómo configurar tu primer rastreo en Site Audit en este video:https://www.youtube.com/watch?v=LjinWqfGyVEReflexiones FinalesLos enlaces Nofollow juegan un papel vital cuando se trata de SEO.Con suerte, esta guía te armó exitosamente con el conocimiento necesario para que los enlaces nofollow funcionen para ti … no en tu contra.Antes de concluir esto, tengo un último punto, probablemente bastante obvio: si estás creando activamente enlaces a tu sitio web, entonces tiene sentido priorizar la construcción de enlaces seguidos. Estos son los que pasan PageRank y tienen un impacto directo en el SEO.En Site Explorer, todos nuestros informes relacionados con backlinks tienen filtros “dofollow” y “nofollow”.Eso hace que sea más fácil priorizar cuando analizas los perfiles de backlinks de la competencia en busca de enlaces replicables, o creas una lista de prospectos “skyscraper”, o en cualquiera que sea el caso.¿Aún tienes preguntas? Contáctame en los comentarios abajo o vía Twitter.Tra­duci­do por Prime Web Méx­i­co. Lle­ga a nuevos clientes todos los días con tu sitio web. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es un Enlace Nofollow? Todo lo Que Necesitas Saber (¡Sin Jerga!)"
    },
    {
      "level": "H2",
      "text": "¿Qué son los enlaces nofollow?"
    },
    {
      "level": "H3",
      "text": "Enlaces Nofollow vs. follow"
    },
    {
      "level": "H2",
      "text": "La historia de rel =“nofollow”"
    },
    {
      "level": "H3",
      "text": "2009: Google combate el PageRank sculpting"
    },
    {
      "level": "H3",
      "text": "2013 en adelante: Google combate los enlaces pagados"
    },
    {
      "level": "H2",
      "text": "¿Los enlaces nofollow ayudan con el SEO?"
    },
    {
      "level": "H3",
      "text": "1. Ayudan a diversificar tu perfil de enlaces"
    },
    {
      "level": "H3",
      "text": "2. Impulsan el tráfico, y el tráfico impulsa los enlaces seguidos"
    },
    {
      "level": "H3",
      "text": "3. Pueden proteger contra las sanciones de Google."
    },
    {
      "level": "H2",
      "text": "Cómo auditar tu sitio web en busca de problemas relacionados con los enlaces nofollow"
    },
    {
      "level": "H3",
      "text": "1. Busca backlinks seguidos con anchors ricos en palabras clave"
    },
    {
      "level": "H3",
      "text": "2. Busca backlinks patrocinados seguidos"
    },
    {
      "level": "H3",
      "text": "3. Busca enlaces salientes followed y ricos en palabras clave en tu sitio web"
    },
    {
      "level": "H3",
      "text": "4. Busca enlaces patrocinados seguidos en tu sitio"
    },
    {
      "level": "H3",
      "text": "5. Busca enlaces internos seguidos"
    },
    {
      "level": "H2",
      "text": "Reflexiones Finales"
    }
  ],
  "author": "Joshua Hardwick"
}