{
  "url": "https://ahrefs.com/blog/es/enviar-web-google/",
  "slug": "enviar-web-google",
  "title": "Cómo Enviar Tu Web a Google en 2021",
  "description": "Si quieres que los usuarios de motores de búsqueda puedan encontrar tu web, necesita estar indexada. Aprende cómo enviar tu web a Google.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Si quieres que los usuarios de motores de búsqueda puedan encontrar tu sitio, necesita estar indexado.Pero, ¿cómo envías tu web a Google en 2021? ¿E, incluso, necesitas hacerlo?En esta guía aprenderás:Cómo enviar tu web a GoogleCómo enviar URLs a GoogleSi necesitas o no enviar tu web a google y por quéCuánto tiempo tarda Google en indexar tu webPor qué puede que Google no esté indexando tu webCómo enviar tu web a GoogleHay dos formas de enviar tu web a Google. Puedes enviar un sitemap (mapa del sitio) actualizado en Google Search Console o enviar la URL del sitemap usando el servicio “ping” de Google. Ambas opciones son gratuitas y llevan un segundo.Encontrar tu sitemapAmbos métodos de envío necesitan la URL de tu sitemap. La forma en que lo encuentras o creas depende de la plataforma de tu web.Si usas WordPress, instala un plugin SEO gratuito como Yoast, Rank Math, o The SEO Framework. Cualquiera de estos tres crearán el sitemap por ti. Estará aquí:tusitioweb.com/sitemap_index.xmlSi usas Wix, Squarespace o Shopify, tu sitemap está aquí:tusitioweb.com/sitemap.xml .Si usas una plataforma o CMS distintos, es posible que cree el sitemap por ti. Las ubicaciones más probables para el mismo son:tusitioweb.com/sitemap.xmltusitioweb.com/sitemap_index.xmltusitioweb.com/sitemap1.xmlSi no está aquí, mira si la ubicación está listada en tusitioweb.com/robots.txt.Si no usas una plataforma CMS, necesitarás crear un sitemap manualmente. Sin embargo, merece la pena comprobar las URLs de arriba en primer lugar, puede que ya tengas uno.Envía tu sitemapAquí tienes dos opciones.Opción 1. Envía tu sitemap en Google Search ConsoleAccede a Google Search ConsoleVe a la propiedad adecuadaHaz clic en “Sitemaps” en el menú de la izquierdaPega la URL de tu sitemapHaz clic en “Enviar”Posiblemente este es el mejor método porque Google Search Console te avisará en el futuro de errores en tu sitemap. También te ofrece información sobre la salud de tu sitio, incluyendo por qué puede que algunas páginas no estén indexadas.Opción 2. Envía tu sitemap haciendo ping a GoogleGoogle cuenta con un servicio de “ping” donde puedes solicitar un rastreo de tu sitemap. Simplemente escribe esto en tu navegador, reemplazando la parte del final con la URL de tus sitemap:http://www.google.com/ping?sitemap=<url_completa-sitemap>Por ejemplo, si tu sitemap está en tusitioweb.com/sitemap.xml, deberías ir a:http://www.google.com/ping?sitemap=https://tusitioweb.com/sitemap.xmlDespués deberías ver la página de “notificación de sitemap recibido”. Google dice que deberías usar este servicio con sitemaps nuevos o actualizados. No envíes repetidamente o hagas ping con sitemaps sin cambios varias veces.Cómo enviar URLs a GoogleEn general, no necesitas enviar cada página nueva a Google. Tan pronto como las nuevas URLs estén en un sitemap que ya has enviado a Google, serán descubiertas con el tiempo. Sin embargo, estos dos métodos pueden potencialmente acelerar este proceso.Opción 1. Haz ping a GoogleAsegúrate de que las nuevas páginas están en tu sitemap, después usa las instrucciones de la sección anterior para hacer ping a Google y darles pie a que comprueben de nuevo tu sitemap. Esto no es totalmente necesario si usas WordPress con Yoast, Rank Math, o The SEO Framework porque todos estos plugins hacen ping a Google de forma automática.Opción 2. Usa la herramienta de Inspección de URLs de GoogleEs posible añadir URLs a Google incluso aunque no estén en tu sitemap (aunque deberían estar) usando la herramienta de Inspección de URL en Google Search Console. Accede a Google Search ConsoleVe a la propiedad adecuadaHaz clic en “Inspección de URLs” en el menú de la izquierdaPega la URL de la nueva páginaDale a introHaz clic en “Solicitar indexación”Si tienes una o dos páginas nuevas, no hay problema en hacerlo así. Algunas personas creen que acelera la indexación. Si tienes muchas páginas nuevas que enviar a Google, no uses este proceso. Es ineficiente y estarás ahí todo el día. En su lugar usa la primera opción.¿Necesito enviar mi web a Google?Más o menos.Google normalmente encontrará e indexará cualquier página de valor con el tiempo, aunque no las envíes. Pero aún existen algunos beneficios al enviar tu web a Google.Antes de que hablemos de estos beneficios, deberíamos discutir cómo Google encuentra e indexa el contenido.Cómo Google encuentra e indexa tu contenidoGoogle encuentra e indexa contenido en cuatro pasos principales.Nota al margen. Esto está muy simplificado, Google es una bestia compleja. Paso 1. DescubrimientoEn el descubrimiento es donde Google aprende que tu web existe. Google encuentra la mayor parte de webs y páginas a partir de los sitemaps o backlinks desde páginas conocidas.Paso 2. RastreoEl rastreo es cuando un programa informático (araña) llamada Googlebot o robot de Google visita y descarga tus páginas.Paso 3. ProcesadoEl procesado es cuando se extrae la información de páginas rastreadas y se prepara la indexación.Paso 4. IndexaciónEn la indexación es donde la información de páginas rastreadas se añaden a una gran base de datos llamada índice de búsqueda o search index. En esencia, se trata de una biblioteca digital de billones de páginas web desde la que Google extrae los resultados de búsqueda. Lectura recomendada: ¿Cómo Funcionan los Motores de Búsqueda y Por Qué Debería Importarte? (en inglés)Por qué enviar tu web a Google es importanteCada uno de los cuatro pasos de arriba va en orden. Es un viaje. Al enviar tu web a Google puedes, en potencia, acelerar la primera parte del proceso: el Descubrimiento.Como en cualquier viaje, cuanto antes empieces, antes llegarás a tu destino. En este caso: la indexación.Pero hay algunas otras razones por las que enviar un sitemap es importante. 1. Le dice a Google qué páginas son importantesLos sitemaps no siempre incluyen todas las páginas de tu sitio. Solo listan las páginas importantes y excluyen las páginas no importantes o duplicadas. Esto ayuda a combatir problemas como la indexación de la versión equivocada de una página debido a problemas de contenido duplicado.2. Avisa a Google de nuevas páginas Muchos CMS añaden nuevas páginas a tu sitemap y algunos avisan a Google automáticamente. Esto ahorra tiempo de tener que enviar cada página manualmente.3. Avisa a Google de páginas huérfanasLas páginas huérfanas son páginas sin enlaces internos de otras páginas en tu web. Google no puede descubrir estas páginas con el rastreo a no ser que tengan backlinks desde páginas conocidas en otros sitios. Enviar un sitemap parcialmente resuelve este problema ya que las páginas huérfanas normalmente están incluídas en los sitemaps—al menos en los que están generados por un CMS.¿Cuánto tiempo tarda Google en indexar contenido?Google dice que el rastreo puede llevar desde unos pocos días a unas pocas semanas. (Recuerda que el rastreo es casi siempre un requisito previo a la indexación).En mi experiencia, a menos que tengas una web grande, rara vez tarda más de una semana o dos.Pero no te preocupes si tarda un poco más; es perfectamente normal.¿Por qué no está Google indexando mi web?Google no siempre indexará todas las URLs que envíes. Aunque hay muchas razones por las que esto puede pasar, aquí van algunas de las más comunes:1. Has bloqueado el rastreoRobots.txt es un archivo de texto que le dice a Google que URLs pueden y no pueden rastrear.Por ejemplo, este archivo robots.txt bloquea a Google de rastrear todas las páginas en la web:User-agent: GooglebotDisallow: /Google a veces indexará URLs incluso aunque no pueda rastrearlas, pero es bastante raro. Evitar el rastreo también evita que Google obtenga mucha información sobre la página en cuestión, así que probablemente no se posicionará aunque esté indexada.Esta es otra razón para registrarse y enviar la web a través de Google Search Console. Te dice si en realidad hay páginas excluidas de la indexación debido a bloqueos de rastreo en el informe de Cobertura.Aquí tienes cómo acceder a él:Accede a Google Search ConsoleElige la propiedad adecuadaHaz clic en “Cobertura” en el menú de la izquierdaDesde aquí, activa solo la pestaña “Excluidas” y comprueba estos tres problemas:Bloqueada por robots.txtURL enviada bloqueada por robots.txtIndexada, pero bloqueada por robots.txt2. Tienes páginas importantes no indexadasSi hay una etiqueta meta robots o encabezado x-robots en tu página con “noindex” en el atributo del contenido, Google no la indexará.Si Google ya ha rastreado tu web, puedes revisar en busca de páginas excluidas por no indexación en el informe de Cobertura. Simplemente activa las pestañas de “Error” y “Excluidas”, después busca estos dos problemas:URL enviada marcada como “noindex”Excluida por una etiqueta “noindex”Si Google todavía no ha rastreado tu web, o simplemente quieres estar atento a etiquetas sueltas “noindex” en el futuro, regístrate en Ahrefs Webmaster Tools (AWT) y ejecuta un rastreo gratuito del sitio usando Site Audit. Esto comprueba tu sitio para +100 problemas SEO habituales, incluyendo páginas no indexadas.3. Tienes páginas de poco valorEs improbable que Google indexe páginas que no tienen mucho valor para los usuarios. En un tuit de 2018, John Mueller de Google sugiere que tu web y contenido deberían ser “asombrosos e inspiradores” para que sean indexados.We never index all known URLs, that’s pretty normal. I’d focus on making the site awesome and inspiring, then things usually work out better.— 🍌 John 🍌 (@JohnMu) January 3, 2018 Nunca indexamos todas las URLs conocidas, es bastante habitual. Me enfocaría en hacer el sitio asombroso e inspirador, entonces las cosas funcionan normalmente mejor.Si has descartado problemas técnicos que podrían evitar la indexación, merece la pena que te preguntes a ti mismo si esa página es de verdad de valor. Si la respuesta es no, es probablemente por eso por lo que no está indexada.Si supones que la página es de poco valor y estás preocupado porque quizá tengas otras páginas parecidas, haz un rastreo gratuito de la web usando Site Audit en Ahrefs Webmaster Tools. Esto avisa de dos problemas a menudo asociados con el contenido de bajo valor:Páginas con un bajo número de palabrasPáginas que son duplicados exactos o casiPuedes ver el número de URLs con un bajo número de palabras en el informe de “All issues” (todos los problemas).Aunque el contenido no necesita ser largo para tener valor, las páginas con muy pocas palabras a menudo no son tan valiosas para los usuarios de motores de búsqueda. Así que merece la pena revisar estas páginas manualmente y hacerlas más útiles si es necesario.Puedes ver páginas que son duplicados exactos o casi en el informe de Duplicate Content (contenido duplicado).Aquí va un buen ejemplo de dos páginas de bajo valor que son casi duplicados exactos:Son páginas de categoría vacías en un sitio de e-commerce. Como ninguna de ellas muestra ningún producto, no son útiles para los usuarios. Deberían ser eliminadas o mejoradas.Lectura recomendada: 10 Maneras de Hacer que Google Indexe tu Sitio (Que sí Funcionan)Reflexiones finales Incluso aunque tu sitio esté indexado en Google, eso no quiere decir que necesariamente vayas a posicionar en la primera página de Google en tus palabras clave objetivo. Indexar quiere decir que estás en la carrera, no que la vayas a ganar.Aquí es donde entra el SEO. El SEO es la práctica de optimizar tu web para incrementar su tráfico desde los resultados orgánicos de un motor de búsqueda. En este caso: Google.Si quieres aprender más sobre SEO, lee nuestra guía para principiantes en SEO.Si quieres enviar tu web a otros motores de búsqueda, lee nuestra guía completa para enviar a otros motores de búsqueda.¿Tienes alguna pregunta? Escríbeme en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Enviar Tu Web a Google en 2021"
    },
    {
      "level": "H2",
      "text": "Cómo enviar tu web a Google"
    },
    {
      "level": "H3",
      "text": "Encontrar tu sitemap"
    },
    {
      "level": "H3",
      "text": "Envía tu sitemap"
    },
    {
      "level": "H4",
      "text": "Opción 1. Envía tu sitemap en Google Search Console"
    },
    {
      "level": "H4",
      "text": "Opción 2. Envía tu sitemap haciendo ping a Google"
    },
    {
      "level": "H2",
      "text": "Cómo enviar URLs a Google"
    },
    {
      "level": "H4",
      "text": "Opción 1. Haz ping a Google"
    },
    {
      "level": "H4",
      "text": "Opción 2. Usa la herramienta de Inspección de URLs de Google"
    },
    {
      "level": "H2",
      "text": "¿Necesito enviar mi web a Google?"
    },
    {
      "level": "H3",
      "text": "Cómo Google encuentra e indexa tu contenido"
    },
    {
      "level": "H4",
      "text": "Paso 1. Descubrimiento"
    },
    {
      "level": "H4",
      "text": "Paso 2. Rastreo"
    },
    {
      "level": "H4",
      "text": "Paso 3. Procesado"
    },
    {
      "level": "H4",
      "text": "Paso 4. Indexación"
    },
    {
      "level": "H3",
      "text": "Por qué enviar tu web a Google es importante"
    },
    {
      "level": "H4",
      "text": "1. Le dice a Google qué páginas son importantes"
    },
    {
      "level": "H4",
      "text": "2. Avisa a Google de nuevas páginas"
    },
    {
      "level": "H4",
      "text": "3. Avisa a Google de páginas huérfanas"
    },
    {
      "level": "H2",
      "text": "¿Cuánto tiempo tarda Google en indexar contenido?"
    },
    {
      "level": "H2",
      "text": "¿Por qué no está Google indexando mi web?"
    },
    {
      "level": "H3",
      "text": "1. Has bloqueado el rastreo"
    },
    {
      "level": "H3",
      "text": "2. Tienes páginas importantes no indexadas"
    },
    {
      "level": "H3",
      "text": "3. Tienes páginas de poco valor"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}