{
  "url": "https://ahrefs.com/blog/es/esquema-blog-post/",
  "slug": "esquema-blog-post",
  "title": "Cómo escribir un esquema de blog post en 7 pasos",
  "description": "Todo escritor conoce muy bien el dolor de estar mirando durante horas una página en blanco y no escribir ni una palabra. Pero no tienes que empezar por ahí, es más fácil empezar con un esquema.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Todo escritor conoce muy bien el dolor de estar mirando durante horas una página en blanco y no escribir ni una palabra. Pero no tienes que empezar con un documento en blanco. Es mucho más fácil empezar con un esquema.Preparar un esquema para un artículo te ayudará a:Superar el temido “bloqueo del escritor”.Organizar tus pensamientos antes de ponerte a escribir.No olvidar ningún punto importante.Ordenar el post con una estructura lógica y que sea fácil de leer.Conseguir que tú y tu editor, cliente o director (si trabajas con uno) os pongáis de acuerdo.En este post vas a aprender cómo escribir un esquema para tu blog post. Empecemos.1. Elige un temaEs imposible crear un esquema de un artículo sin saber sobre qué quieres escribir.Si todavía no has decidido un tema, elige uno ahora.Piensa en un par de temas que te gustaría tratar. Si estás familiarizado con el tema, debería haber algunos subtemas que de verdad quieras tratar. Escribe sobre ellos.De lo contrario, una buena forma de encontrar temas es usar el Explorador de palabras clave de Ahrefs. Introduce un término relevante en la herramienta y dirígete a Términos que concuerdan.Cambia la pestaña a Preguntas y verás muchos temas que podrías cubrir.2. Selecciona el formato del contenido¿Vas a escribir un artículo tipo listicle o una guía práctica? ¿O tal vez un artículo de opinión, una reseña o simplemente una noticia de última hora?Sea lo que sea, tendrás que elegir un formato.A veces el formato está claro a primera vista. Por ejemplo, si escoges el tema “cómo hacer kéfir en casa”, seguramente termines escribiendo una guía práctica. O si tratas el tema “consejos para escribir en un blog”, probablemente será una lista de tips.Pero a veces no es tan sencillo. ¿El tema “la mejor app de productividad” es una lista de apps de productividad, una review de una aplicación en particular o una opinión sobre la “mejor app”?La verdad es que puede ser cualquiera de los anteriores. Puedes elegir el que quieras, no hay una respuesta correcta. Pero si realmente no puedes decidir, una buena forma de “resolver” la indecisión es simplemente mirar cuál es el posicionamiento de ese tema en Google.Por lo tanto, quienes buscan la “mejor app de productividad” en realidad buscan las “mejores apps de productividad”. Google lo sabe y posiciona solo listas para ese tema. Si estás atascado, crear una lista podría ser una buena forma de avanzar.Lectura recomendada: 10 tipos de blog posts y cómo usarlos de forma efectiva3. Decide el ángulo del artículoCuando ya sabes el tema sobre el que vas a escribir y ya tienes claro el formato, el siguiente paso es decidir el “ángulo” o enfoque del artículo. Es decir, te centras en un aspecto, e ignoras el resto. Por ejemplo, si escribes sobre “cómo cocinar ramen en casa”, ¿qué quieres enseñar exactamente?¿Hacer ramen rápido?¿Hacer ramen con calidad de restaurante?¿Hacer tonkotsu ramen?¿Hacer ramen vegano?¿Hacer ramen al estilo Sapporo?¿Hacer ramen al estilo coreano (también conocido como ramyeon)?No se puede cubrir todo. Hay que elegir. De hecho, es el ángulo lo que hace que tu artículo sea único e interesante para los lectores, es lo que te hace destacar.Usa estas preguntas para generar ideas con un enfoque interesante:¿Tienes experiencia o conocimientos personales? Por ejemplo, si has conseguido fusionar exitosamente los sabores de Singapur en el ramen, entonces puedes compartir esta receta única con nosotros.¿Puedes entrevistar a expertos? Por ejemplo, puedes entrevistar a un chef de ramen famoso sobre cómo hacer ramen con calidad de restaurante en casa.¿Puedes recopilar opiniones e ideas? Por ejemplo, puedes investigar en subreddits como /r/ramen para encontrar las mejores recetas caseras de ramen.¿Puedes respaldarte en la ciencia? Por ejemplo, ¿puedes mostrar a los lectores cómo hacer el ramen “perfecto” observando la relación sensorial entre los distintos ácidos y sabores?¿Puedes ir en contra? No vayas en contra porque sí. Pero si tienes una opinión opuesta a la de los demás, por ejemplo, cómo el ramen es realmente muy saludable, y puedes respaldarla con evidencia, puede ser un ángulo que llame la atención.RECOMENDACIÓNTambién puedes consultar las páginas mejor posicionadas en Google para obtener inspiración sobre qué ángulo puedes cubrir. Por ejemplo, si buscamos “ideas para citas” en Google, vemos ángulos como:Específico de la ubicación (“Londres”)ExtravaganteDivertidoGenialCreativoY más.4. Usa una plantilla¿Te has dado cuenta que la mayoría de los blog posts están estructurados de una forma muy similar?De hecho, la mayoría de los posts que lees son variaciones de las mismas plantillas. No tienes que reinventar la rueda. Elige una plantilla que se ajuste a tu formato y arranca.Por ejemplo, usamos esta plantilla para casi todos nuestros posts tipo lista:¿Quieres más plantillas? Echa un vistazo al post de abajo.Lectura recomendada: 4 Plantillas para artículos de blog y cómo utilizarlas5. Averigua lo que tienes que cubrir escribiendo los títulos de cada secciónLa plantilla te proporciona el esqueleto. Ahora, tienes que averiguar cómo lo vas a rellenar, especialmente los “subtítulos” (los H2, H3, H4, etc.).Aquí hay algunas ideas sobre cómo encontrarlos:A. Utiliza tu conocimiento y experienciaEl primer paso es siempre mirar hacia dentro. Si sabes que hay una forma correcta de hacer las cosas, utilízala como base para tu esquema.B. Ejecuta un análisis de content gapTambién podemos usar las páginas mejor posicionadas actualmente para tu tema como inspiración. Después de todo, si la mayoría de estas páginas cubren ciertos subtemas, es probable que sean importantes para tus lectores.Nota al margen.Asegúrate de que solo estás viendo páginas con un enfoque similar al tuyo.A continuación, te mostramos cómo encontrar estos subtemas:Pega algunas de las URLs con buen posicionamiento para tu tema principal en la herramienta Brecha de contenido de AhrefsDeja la sección inferior en blancoHaz clic Mostrar palabras claveEstablece el filtro de Intersección entre 3 y 4 objetivosPodemos ver que estas páginas están posicionadas para los siguientes subtemas:¿Qué es la dieta keto?¿En qué consiste la dieta keto?Reglas de la dieta keto¿Qué comer en una dieta keto?y más.Si estamos cubriendo el mismo tema, “dieta cetogénica o keto” desde un ángulo similar (“guía para principiantes”), entonces probablemente serán buenos subtitulares H2.C. Mira la sección “otra gente también pregunta”Busca cualquier cosa en Google hoy en día y verás esto:Estos se conocen como “Otras preguntas de los usuarios” y responden preguntas relacionadas con la consulta de la búsqueda. Dado que seguramente sean preguntas populares, es posible que también quieras responderlas en el post.Para recopilar todas estas preguntas, puede hacer clic en ellas una y otra vez o usar una herramienta como AlsoAsked.Aunque si simplemente buscas preguntas relacionadas con tu tema principal (y no son necesariamente “otras preguntas de los usuarios”), prueba este método:Dirígete al Explorador de palabras clave de AhrefsIntroduce tu temaAbre el informe de Términos que concuerdanCambia la pestaña a PreguntasHaz clic en el menú de “hamburguesas” que está al lado de [X] palabras claveCambia la pestaña a Temas principalesHaz clic en tu tema principal (por ejemplo, “dieta keto”)Aquí verás todas las preguntas agrupadas bajo el mismo tema principal, en este caso, “dieta keto”.Revisa el informe y mira si hay alguna pregunta que merezca la pena responder en el artículo.6. Añade viñetas debajo de cada subtítuloTienes que desarrollar cada sección para que tú (y tu editor, cliente, etc.) puedas entender lo que intentas decir y cómo has llegado a esas conclusiones.No cometas el error de escribir todo el post de golpe. Es un esquema, no la versión final del artículo. Limítate a escribir brevemente las ideas que apoyen y fundamenten lo que vas a tratar.Aquí tienes algunos ejemplos de bullet points que puedes añadir:Breve explicación del argumentoEjemplos de cómo funciona tu ítem, paso, técnica, etc.Citas potenciales de expertos (si las usas)DatosPor ejemplo, hace poco use este esquema para un post sobre pilares de contenido:Escribí bullet points y simplemente indiqué varias ideas debajo de cada sección. Pero no todos los esquemas son iguales. Igual te resulta más fácil que no sean tan detallados.Haz lo que funcione para ti y para aquellos con los que trabajes.7. Planifica la introducción y conclusiónEl objetivo de la introducción es “enganchar” al lector para que llegue al final del artículo. Suele ser una buena idea planificar (al menos una idea) lo que quieres decir.De nuevo, no caigas en la trampa de escribir todo de golpe. Un par de bullet points son suficientes.Para planificar tu introducción, una fórmula que puedes seguir es la del Problema-Agitar-Solucionar (PAS).Así es como funciona:Plantea el problemaAgita el problema indagando en el “dolor” que siente el lector con este problemaOfrece una posible soluciónVeamos un ejemplo:Para la conclusión, recomiendo resumir todo el artículo en una línea o dos, proporcionar enlaces a recursos adicionales, o compartir una reflexión final para que los lectores piensen en ello.Reflexiones finalesAntes de empezar a redactar el borrador, envía el esquema a otra persona: un compañero de trabajo, un editor o un amigo. Esa persona podrá darte su opinión y señalar fallos o cosas que hayas pasado por alto.Nosotros lo hacemos a menudo. Todos los redactores internos tienen que enviar sus esquemas a Josh, nuestro jefe de contenidos, para que los revise.Una vez que el revisor haya dado su opinión, puedes echarle un vistazo e incorporar sus ideas a tu esquema. Ahí ya puedes empezar a redactar.Si necesitas ayuda para escribir un blog post, consulta esta guía paso a paso sobre cómo escribirlo.¿Tienes alguna pregunta? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo escribir un esquema de blog post en 7 pasos"
    },
    {
      "level": "H2",
      "text": "1. Elige un tema"
    },
    {
      "level": "H2",
      "text": "2. Selecciona el formato del contenido"
    },
    {
      "level": "H2",
      "text": "3. Decide el ángulo del artículo"
    },
    {
      "level": "H2",
      "text": "4. Usa una plantilla"
    },
    {
      "level": "H2",
      "text": "5. Averigua lo que tienes que cubrir escribiendo los títulos de cada sección"
    },
    {
      "level": "H3",
      "text": "A. Utiliza tu conocimiento y experiencia"
    },
    {
      "level": "H3",
      "text": "B. Ejecuta un análisis de content gap"
    },
    {
      "level": "H3",
      "text": "C. Mira la sección “otra gente también pregunta”"
    },
    {
      "level": "H2",
      "text": "6. Añade viñetas debajo de cada subtítulo"
    },
    {
      "level": "H2",
      "text": "7. Planifica la introducción y conclusión"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}