{
  "url": "https://ahrefs.com/blog/es/esquema-contenido/",
  "slug": "esquema-contenido",
  "title": "Esquemas de contenido: Cómo escribir contenidos de calidad en menos tiempo",
  "description": "¿Qué pasaría si te dijera que puedes escribir más rápido, con más calidad y de una forma que aumente tus probabilidades de aparecer en los primeros resultados de búsqueda de Google? El truco está en los esquemas de contenidos.",
  "content": "Bill Widmer Viviendo como nómada digital más de 8 años. Bill tiene una misión de viajar por el mundo y ganarse la vida utilizando el SEO y el marketing de contenidos. Contenido ¿Qué pasaría si te dijera que puedes escribir más rápido, con más calidad y de una forma que aumente tus probabilidades de aparecer en los primeros resultados de búsqueda de Google?La clave está en los esquemas de contenido.Esquematizar el contenido puede mejorar la eficacia de la redacción y la fluidez del contenido, además de garantizar la inclusión de los elementos necesarios para el SEO en cada artículo.Personalmente, he esquematizado miles de artículos en los últimos 10 años, y ha sido la clave para mantener el ritmo siempre cambiante y la necesidad de cada vez más y mejor contenido.En esta guía, aprenderás lo siguiente:Qué es un esquema de contenidosPor qué hay que esquematizar los contenidosNuestro modelo de esquema de contenidosCómo esquematizar tus contenidos en cinco pasos muy sencillos ¿Qué es un esquema de contenidos?Un esquema de contenidos es un resumen detallado de lo que incluirá el artículo.Mis esquemas siempre incluyen los títulos y subtítulos del artículo (H2, H3, etc.). Los esquemas también incluyen un vistazo al contenido de la competencia en Google y a las preguntas importantes que hay que abordar o las palabras clave long-tail que hay que incluir.También incluyen cosas como el objetivo del artículo, el ángulo de enfoque, la propuesta única de venta y más. Veremos esto con detalle más adelante, en la sección en la que hablaremos de cómo esquematizar tu contenido. Pero antes…Por qué siempre hay que esquematizar los contenidosSiempre hago un esquema antes de empezar a escribir un artículo. Esto se debe a varias razones:Un esquema garantiza la inclusión de elementos importantes para la optimización de motores de búsqueda (SEO), como las palabras clave adecuadas y la respuesta a las preguntas más frecuentes de los usuarios.Un esquema te ayuda a mejorar la fluidez del artículo antes de empezar a escribir. Si te lanzas a escribir, tus ideas pueden estar dispersas y puede que tengas que dedicar mucho tiempo a reorganizar la información para que sea más lógica… y este proceso puede ser una pesadilla sin un esquema.Con un buen esquema, incluso un escritor mediocre puede producir un contenido excelente. Si quieres escalar tu producción de contenidos con algún nivel de control de calidad, los esquemas son una necesidad.Entonces… ¿cómo se escribe un buen esquema de contenidos?Descarga nuestra plantilla de esquema de contenidosHaz clic aquí para hacer una copia de nuestra plantilla de esquema de contenidos.Esta plantilla incluye todo lo necesario para esquematizar correctamente los artículos de tu blog, incluyendo:Palabra clave objetivo.Intención de búsqueda de la palabra clave objetivo.Ángulo de enfoque.Objetivo de tu contenido.Propuesta única de venta (USP, Unique Selling Proposition).Título del artículo.Títulos y subtítulos del contenido.No te preocupes si algo de lo anterior te resulta confuso. En la siguiente sección te explicaré qué significa cada una de ellas.Cómo esquematizar tus contenidos en cinco pasosPor suerte, esquematizar el contenido es bastante fácil una vez que se aprende el proceso. A continuación, te describo cada sección del esquema de nuestra plantilla:1. Decide el objetivo del artículoAntes de investigar o ponerte a escribir, el primer paso es decidir por qué se está creando el contenido.El contenido puede tener muchos objetivos, por ejemplo:Aumentar el reconocimiento de la marca.Explicar casos de uso de tu(s) producto(s).Crear backlinks para SEO.Hacer crecer tu lista de email.Posicionamiento de palabras clave en Google para aumentar el tráfico.Etc.A lo largo de esta guía, utilizaré los fideos de ramen como ejemplo.Digamos que quiero escribir un artículo sobre cómo hacer fideos ramen espectaculares. Mi objetivo es promocionar la salsa hoisin de mi falsa empresa y crear reconocimiento de marca. Así que lo pongo en la sección “objetivo”:2. Elige tu palabra claveNunca escribo un artículo sin hacer antes una investigación básica de palabras clave. Incluso si la intención del artículo no es posicionarse en los motores de búsqueda por palabras clave, es una buena práctica incluir el SEO en todos los artículos que escribas.¿Por qué?Porque así se garantiza la creación de buenos hábitos. Puede que hasta te sorprenda la cantidad de tráfico adicional que puedes ganar, incluso a partir de palabras clave que casi no reciben búsquedas.Por ejemplo, escribí un artículo sobre los mejores destinos a los que viajar, y su objetivo era conseguir enlaces de blogs de viajes conocidos.Mientras escribía el esquema, me centré en la palabra clave “mejores lugares del mundo para viajar”, que recibe unas 1500 búsquedas al mes. Ese artículo está ahora posicionado en más de 200 palabras clave y recibe tráfico de Google a pesar de que el SEO no era el objetivo.Puedes realizar fácilmente una investigación de palabras clave como esta, introduciendo palabras clave relacionadas con el tema sobre el que quieres escribir en el Keywords Explorer de Ahrefs y consultando los resultados.Para nuestro artículo sobre cómo preparar el mejor tazón de ramen, empiezo buscando “ramen” en el Keywords Explorer:Puedes ver que recibe 96.000 búsquedas al mes. Es un dato impresionante, pero tenemos que ver si nuestra idea de artículo puede posicionarse realmente para esta palabra clave.Desplázate hacia abajo y verás que los resultados de la búsqueda en la vista general de las SERP consisten principalmente en recetas y algunas de las webs con mucha autoridad:En otras palabras, a no ser que ya tengas una web potente, posicionarte en esta palabra clave con una guía sobre cómo hacer ramen va a ser complicado.A continuación, desplázate hacia arriba y mira el panel de Ideas de palabras clave. Aquí verás otras ideas de palabras clave potenciales, por ejemplo: “cómo hacer ramen en casa”.Si nos fijamos en la página de vista general de “cómo hacer ramen en casa”, podemos ver que puede ser un poco más fácil posicionarse bien en Google con esta palabra clave porque la competencia no es tan fuerte.De hecho, si ignoramos el primer resultado, el resto de páginas web de los fragmentos destacados tienen una puntuación de Domain Rating (DR) de tan solo 28, lo que indica que incluso una página web más reciente con menos backlinks puede posicionarse relativamente bien en esta palabra clave.Así es como se hace una investigación básica de palabras clave. Introduce tu palabra clave objetivo en tu esquema y veamos la intención de búsqueda.3. Investiga la intención de búsqueda de tu palabra clave y el ángulo del artículoLa intención de búsqueda es el porqué de una consulta de búsqueda. ¿Por qué ha buscado el usuario esta palabra clave? ¿Qué busca?La intención de búsqueda es importante porque determina el tipo de contenido que se tiene que crear para una palabra clave determinada. Existen cuatro tipos generales de intención de búsqueda:InformativaNavegacionalTransaccionalInvestigación comercialPara más información sobre cada uno de ellos, revisa nuestra guía sobre la intención de búsqueda. Por ahora, continuemos con el ejemplo que utilizamos anteriormente sobre “cómo hacer ramen en casa”.Se trata de una palabra clave informativa. El usuario busca información sobre cómo hacer algo.La mayoría de los artículos que escribas van a tener intención informativa (qué, cómo, cuándo, etc.) o intención de investigación comercial (como “el mejor X” o “X vs Y”). La intención navegacional y la intención transaccional son para otras páginas de tu web, no para los artículos del blog.Pero la intención de búsqueda va más allá de simplemente escribir “informativo” en una sección y ya está. Ahí es donde entra en juego el enfoque del contenido.¿Cuál es el enfoque que utilizan tus competidores?Un vistazo rápido a los 10 primeros resultados que aparecen en el apartado de las SERP debería ofrecerte una idea del tipo de contenidos que se posicionan. Lo que significa que si utilizas uno de los enfoques utilizados de ese contenido que ya se posiciona bien, aumentarás las probabilidades de aparecer en la primera página de los resultados de búsqueda.Ahí ya habría que investigar las SERP y utilizar la sección “intención de búsqueda y enfoque del contenido” para indicar qué tipos de contenido se están posicionando actualmente y qué enfoque quieres adoptar con este artículo.Así es como quedaría el mío:4. Decide una USP y un títuloTu USP (Unique Selling Proposition, o propuesta única de venta) es lo que diferencia tu contenido del de tus competidores y, por tanto, hace que merezca la pena hacer clic en tu artículo en vez de en el de ellos.Normalmente, el título de un artículo hace que sea evidente la USP, por lo que estos pasos van de la mano. Veamos las USP de nuestros competidores:Muchos de los títulos muestran exactamente lo que obtendrás de ellos por encima de los demás, como estos:Ramen japonés caseroReceta de ramen fácilRecetas de ramen fáciles y rápidasSi usamos el artículo posicionado en el séptimo lugar, vemos que el propio título hace dos promesa: 15 recetas de ramen fáciles de hacer y rápidas para hacerPor un lado, te dice que son recetas fáciles, pero al mismo tiempo son recetas rápidas.Piensa en cómo puedes hacer que tu artículo se destaque entre la competencia. Indaga en las SERP y en los cuadros “Otras preguntas de los usuarios” para intentar determinar qué busca la gente. Lee los foros como Reddit e intenta encontrar formas de resolver los problemas que tiene la gente y de los que no hablan tus competidores.En el caso de mi post sobre “fideos ramen”, mi USP es que nuestro ramen está hecho desde cero y puede mejorarse con ingredientes de calidad (algo que parece interesar a la gente). También puedo probar un enfoque ligeramente distinto y apostar por la autenticidad para destacar entre la multitud.Intenta hacer un brainstorming con varios títulos. Después elige el que creas que es el mejor. Y esto es clave, ya que el título es extremadamente importante para conseguir el mejor ranking posible y más tráfico.Para más información, consulta esta guía para escribir los mejores títulos para blog posts.5. Esquematiza tu artículo con títulos y subtítulosAquí es donde entra en juego la mayor parte del trabajo de esquematización. Elegir los títulos, ordenarlos y explicar qué es lo que tiene que ir en cada sección determinará la calidad del resultado final. También es importante para el SEO on page.Aquí es donde se profundiza en lo que hay que cubrir y en qué orden hacerlo. Para ello, volvamos una vez más a las SERP y observemos cómo redactan sus contenidos los competidores para inspirarnos un poco.Por ejemplo, el resultado superior cubre algunos puntos importantes que probablemente nosotros también deberíamos cubrir:De qué están hechos los fideos de ramenCómo hacer en casa un ramen auténticoUna sección de “ingredientes e instrucciones” para la recetaDespués de mirar otros resultados de búsqueda, descubrí que todos tienen algunas variaciones de estos tres puntos.Además de mirar el contenido de los competidores, también puedes buscar en el cuadro “Otras preguntas de los usuarios” las preguntas que la gente suele hacer cuando busca la palabra clave a la que te diriges.Si abres una pregunta para ampliarla, Google mostrará preguntas adicionales. Sigue haciéndolo para obtener más ideas.Parece que puedo añadir secciones sobre “qué tipo de pasta es el ramen” o “qué no puede faltar en un ramen” para cubrir el tema con más detalle.Por último, puedes consultar las búsquedas relacionadas en la parte inferior de las SERP para obtener más ideas.Basándonos en esto, podemos añadir secciones sobre “cómo hacer ramen en una thermomix”, “cómo hacer ramen coreano”, etc.Pasando a nuestro esquema, puedo crear algo así basándome en mi investigación:Puedes ver que tengo H2 para todos los títulos principales. Más abajo, cada paso es un H3 (puedes verlo cuando hagas una copia de la plantilla del esquema).Debajo de cada epígrafe hay al menos una viñeta que explica qué es lo que debería ir en esa sección para que el redactor tenga más contexto. Cuanto más detalladas sean tus expectativas en estas viñetas, más posibilidades tendrás de conseguir lo que quieres del escritor.Y eso es todo.Reflexiones finalesContar con un esquema de contenidos facilita la redacción de contenidos con calidad, que se produzcan más rápido y a mayor escala. Un esquema de calidad ofrece más posibilidades de posicionarse en los motores de búsqueda y proporciona a los redactores un procedimiento operativo estándar que deben seguir.Si todavía no estás esquematizando tu contenido te estás perdiendo mucho potencial y productividad¿Quieres más información? Consulta estas otras guías útiles:¿Cómo de largas deberían ser las entradas de un blog? La “verdad” sobre la longitud del contenido¿Qué es la redacción SEO? Cómo ser un mejor redactor SEOCómo crear contenidos de calidad para las búsquedas Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Esquemas de contenido: Cómo escribir contenidos de calidad en menos tiempo"
    },
    {
      "level": "H2",
      "text": "¿Qué es un esquema de contenidos?"
    },
    {
      "level": "H2",
      "text": "Por qué siempre hay que esquematizar los contenidos"
    },
    {
      "level": "H2",
      "text": "Descarga nuestra plantilla de esquema de contenidos"
    },
    {
      "level": "H2",
      "text": "Cómo esquematizar tus contenidos en cinco pasos"
    },
    {
      "level": "H3",
      "text": "1. Decide el objetivo del artículo"
    },
    {
      "level": "H3",
      "text": "2. Elige tu palabra clave"
    },
    {
      "level": "H3",
      "text": "3. Investiga la intención de búsqueda de tu palabra clave y el ángulo del artículo"
    },
    {
      "level": "H3",
      "text": "4. Decide una USP y un título"
    },
    {
      "level": "H3",
      "text": "5. Esquematiza tu artículo con títulos y subtítulos"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Bill Widmer"
}