{
  "url": "https://ahrefs.com/blog/es/estrategia-de-contenidos/",
  "slug": "estrategia-de-contenidos",
  "title": "Cómo Crear una Estrategia de Contenidos Ganadora",
  "description": "Una estrategia de contenidos te ayuda a responder preguntas como por qué y cómo crear contenido, para quién es el contenido y cómo utilizarás el contenido para hacer marketing de tu negocio.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Nuestra estrategia de contenido en Ahrefs es sencilla.En resumen:Creamos posts y vídeos sobre temas relevantes que la gente busca en Google y YouTube.Apoyamos y educamos a esas personas con contenido útil en Twitter y nuestra newsletter.Retenemos clientes y construimos fidelidad de marca usando tutoriales enfocados en producto en nuestro centro de ayuda, academia y en nuestra propia herramienta.Esta estrategia ha tenido un gran éxito. Recibimos +500.000 visitas mensuales al mes de Google, tenemos +100.000 personas en nuestra lista de correo y tenemos +200.000 en YouTube.Más importante, ha ayudado a hacer crecer nuestro ARR (ingresos recurrentes anuales) de forma bastante consistente a lo largo de los años.Pero aunque pudieras copiar ciegamente nuestra estrategia de contenidos, no sería necesariamente buena idea, porque que funcione para nosotros no quiere decir que vaya a funcionar para ti.Por eso hemos escrito esta guía—para mostrarte cómo crear una estrategia de contenido que tenga sentido para tu negocio.Aquí está todo lo que vas a aprender:¿Qué es una estrategia de contenidos?¿Por qué es importante tener una estrategia de contenidos?Cómo crear una estrategia de contenidos¿Qué es una estrategia de contenidos?La estrategia de contenidos se enfoca en la visión y plan de tu contenido. Es donde respondes preguntas como por qué y cómo crear contenido, para quién es el contenido y, finalmente, cómo utilizarás el contenido para hacer marketing para tu negocio.¿Cuál es la diferencia entre estrategia de contenidos y marketing de contenidos?El marketing de contenidos es el proceso de crear, editar y promocionar contenido con propósitos de marketing. Puede ser un post para un blog, vídeo, documentación de producto—cualquier cosa que te ayude a atraer, cuidar y retener clientes.En otras palabras, el marketing de contenidos es la ejecución de tácticas que amplían tu estrategia de contenidos.Para poner las cosas incluso más confusas, si creas un diagrama de Venn de estrategia de contenidos y marketing de contenidos, la intersección es tu estrategia de marketing de contenidos.La estrategia de marketing de contenidos se ocupa de planificar y orquestar tus esfuerzos en marketing de contenidos. Involucra definir tu voz de marca y estilo, crear un calendario editorial, establecer y medir objetivos, etc.¿Por qué es importante tener una estrategia de contenidos?Tener una estrategia de contenidos es importante para asegurar que cada pieza de contenido que creas tiene un propósito. Evita que crees contenido por el mero hecho de hacerlo y que tires dinero en contenido aleatorio que no hace nada por tu negocio.También te ayuda a asegurar que estás creando contenido para la audiencia adecuada, en el formato adecuado, para el canal adecuado.Cómo crear una estrategia de contenidosCrear una estrategia de contenidos puede ser un proceso abrumador, así que hemos creado un marco sencillo para poner las cosas más fáciles llamado el content strategy canvas o lienzo de estrategia de contenidos:El propósito del content strategy canvas es ayudarte a crear una estrategia de contenidos básica respondiendo cinco preguntas sencillas:¿Para quién estás creando contenido?¿Por qué estás creando contenido?¿Qué tipo de contenido vas a crear?¿Dónde vas a publicar el contenido?¿Cómo crearás el contenido?Vamos a ver cómo responder cada una de estas preguntas.Pregunta 1: ¿Para quién estás creando contenido? Poner por escrito a quién intentas llegar con tu contenido es el primer paso, y el más importante. Te servirá como guía para todos tus esfuerzos de creación de contenidos y te ayudará a mantenerte en el camino adecuado.Si has hecho tu investigación de mercados y creado customer personas, debería ser fácil. Ya tendrás una idea sólida de a quién intentas intentas llegar.Por ejemplo, si eres un broker hipotecario en Florida, puede ser algo como:Parejas millennial (25-30) en Florida con aspiraciones de poseer su primera casa. Son profesionales trabajadores con poco tiempo, frustrados por la complejidad del proceso de entrar en la escalera de las propiedades.Si no sabes tanto sobre a quién te diriges, siéntete libre de dejarlo más general.Por ejemplo, como proveedores de software SEO, algo como esto tendría sentido para nosotros:Personas que quieren llevar más tráfico a sus webs.Está de alguna manera sobresimplificado, pero es suficiente para evitar que creemos contenido sobre temas sin salida.Por ejemplo, toma un tema como “reverse image search” (búsqueda inversa de imágenes). A primera vista suena como un tema relacionado con SEO y recibe una estimación de 1.6 millones de búsquedas al mes en Estados Unidos…… pero la realidad es que la mayor parte de la gente que busca esto probablemente no tenga ni una web. Probablemente quieren pillar a un impostor.Aquí va nuestro content strategy canvas hasta ahora:Pregunta 2. ¿Por qué creas contenido? Cada pieza de contenido debería tener un propósito.Hablando en general, hay cuatro: Incrementar el conocimiento de marca e introducir tu marca a clientes potenciales. Crear interés y deseo educando más a clientes potenciales sobre sus problemas y cómo tu producto o servicio puede resolverlos. Fomentar el interés e incitar a la compra educando más a clientes potenciales sobre tu producto o servicio y por qué es la mejor solución para ellos. Retener clientes y construir fidelidad de marca educando a los clientes para que saquen el máximo partido de tu producto o servicio y claramente demostrando su valor.Si estás familiarizado con el embudo de marketing, te darás cuenta de que estos cuatro “propósitos” se alinean en general con las fases del viaje de compra.De cualquier forma, verás que estos “porqués” están pre-rellenados en el content strategy canvas porque necesitas crear contenido para todos los propósitos. Después de todo, no tiene sentido tener una marca conocida si nadie te compra nunca nada, y no tiene sentido trabajar en atraer clientes si no puedes retenerlos.Sin embargo, es importante entender una cosa antes de continuar:Cada pieza de contenido puede servir a varios propósitos.Muchos de nuestros posts en el blog son un ejemplo de esta idea en la práctica. Por ejemplo, toma un tema como “cómo encontrar keywords con baja competencia”. Este post posiblemente sirva a todas las fases del embudo de marketing en distintos grados.Dicho esto, algunas piezas de contenido estarán más enfocadas en resolver un solo problema.Por ejemplo, toma nuestra página “Ahrefs vs.”. Esta página explica lo que la industria piensa de Ahrefs en comparación con nuestros competidores y muestra unas pocas de nuestras características únicas.Aquí están los problemas que resuelve y no resuelve según mi opinión:Dependiendo de dónde te encuentres en tu viaje de marketing de contenidos puede que necesites centrarte más en uno de estos “propósitos” más que en el resto. Aquí es dónde la auditoría de contenidos puede venir bien, pero es un tema para otro día.Pregunta 3: ¿Dónde publicarás contenido?Saber por qué estás creando contenido es un buen comienzo, pero también necesitas saber dónde publicar para llegar a clientes y potenciales clientes.Dada la infinidad de opciones de publicación actuales, este proceso puede ser apabullante.Aquí van solo unos pocos sitios donde podrías publicar contenido:Blog/webYouTubeRedes socialesEmailSlidesharePosts como invitado (por ejemplo, las webs de otras personas)PodcastsSitios de preguntas y respuestas (por ejemplo., Quora)Así que, ¿qué elegirías?Primero, no te ahogues intentando crear contenido para cada canal imaginable. Todas son opciones viables de una u otra forma, pero no puedes hacer todo—especialmente cuando empiezas tu viaje de contenidos.Segundo, no elijas al azar.Deberías elegir uno o dos canales que tengan el mayor sentido para tu negocio y deberías hacerlo en base a tus respuestas a dos preguntas:¿Qué canales resuelven tus “por qués”? ¿Cómo y dónde consumen tus clientes información online?Empecemos respondiendo la primera pregunta…Toda buena estrategia de contenidos supone crear contenido para cada fase del viaje—desde el conocimiento de marca a la retención de cliente—pero no todos los canales de marketing son adecuados para resolver todos los problemas.Por ejemplo, publicar una newsletter no tiene utilidad para construir conocimiento de marca, porque los que no conozcan tu marca no se suscriben. De forma análoga, hacer podcasts difícilmente ayudará a retener clientes y construir fidelidad de marca.Necesitas o bien elegir un canal que se ajuste a todas las fases de varios canales complementarios.Aquí tienes una cheat sheet para los canales propios más populares que puede ayudarte:¿Cómo sabes qué dos canales elegir?Aquí es donde la segunda pregunta viene bien:¿Cómo y dónde consumen tus clientes información online?Tu investigación de mercado debería haber descubierto la respuesta a esta pregunta, pero si no estás seguro, considera preguntar o encuestar directamente a tus clientes. De forma alternativa, si consideras tu blog/web o canal de YouTube como uno de tus medios de marketing, usa una herramienta de keyword research como Keywords Explorer de Ahrefs para ver si la gente está buscando temas relacionados con tu negocio.Por ejemplo, vemos miles de personas buscando temas relacionados con SEO cada mes en Google y YouTube:Esto nos dice que publicar contenido en estos canales tiene sentido para nosotros.También sabemos que podemos usar las redes sociales y el email marketing para alimentar y retener clientes, así que también crearemos contenido para estos canales.Pregunta 4. ¿Qué tipo de contenido crearás?Si planeas publicar contenido en YouTube, es bastante obvio que vas a publicar vídeos porque es el único tipo de contenido que puedes publicar. Pero en muchos otros canales de marketing las cosas no son siempre tan obvias.Toma por ejemplo tu web. Hay muchos tipos de contenido que podrías publicar, incluyendo:PostsWhitepapersPáginas landingArtículos de wikiHerramientas interactivasCursos en vídeoNadie tiene recursos ilimitados para crear contenido, así que merece la pena considerar en qué tipos de contenido te quieres centrar.Por ejemplo, en nuestra web, principalmente nos enfocamos en crear tres tipos de contenido:Posts para el blogArtículos de wiki Herramientas interactivasJusto ahora, tenemos 906 posts en el blog, y nuestro blog recibe unas 253.000 visitas de búsqueda estimadas al mes—según el informe de Top subfolders (subdirectorios principales) en Site Explorer de Ahrefs.Nota al margen. Muchos de estos posts son traducciones; tenemos solo ~300 posts en inglés.Tenemos 10 herramientas gratuitas, que nos envían una estimación de 301.000 visitas de búsqueda al mes.Y tenemos 267 artículos Wiki/de ayuda que nos generan un aproximado de 2.300 visitas mensuales de búsqueda.Esas 2.300 visitas a nuestros artículos de Wiki pueden parecer nada en comparación con nuestro blog y herramientas gratuitas, pero el propósito de este contenido no es dirigir mucho tráfico. Su propósito es educar y retener clientes respondiendo preguntas comunes sobre nuestro conjunto de herramientas.En Twitter principalmente nos centramos en crear y comparar actualizaciones de producto…NEW: The “Organic traffic” graph now accounts for seasonal fluctuations of search volume!This data will show in Organic keywords 2.0, Top Pages 2.0, and the Organic search tab and metrics in your Site Explorer Overview. pic.twitter.com/eLmZrzygZB— Ahrefs (@ahrefs) May 6, 2021 ¡El gráfico de “Tráfico Orgánico” ahora tiene en cuenta fluctuaciones estacionales de volumen de búsqueda! Estos datos aparecerán en Organic keywords 2.0, Top Pages 2.0 y la pestaña de búsqueda Orgánica y métricas de tu vista general de Site Explorer.… e hilos informativos con conocimiento destilado de nuestros posts:If you have custom illustrations or infographics on your site, it’s highly likely that others will use them in their content.For example, here’s a graph from our post about long-tail keywords on another blog: pic.twitter.com/6q32eEbB9G— Ahrefs (@ahrefs) December 29, 2020 Si tienes ilustraciones o infografías personalizadas en tu sitio, es altamente probable que otros las usen en su contenido.Por ejemplo, aquí está un gráfico de nuestro post sobre palabras clave long-tail en otro blog:Cuando tengas que rellenar esta sección de tu content strategy canvas no te compliques pensando demasiado. Simplemente anota tipos relevantes de contenido para cada fase en el viaje.También está bien usar el mismo tipo de contenido en varias fases cuando tenga sentido. Por ejemplo, utilizamos posts de blog para todo, desde incrementar el conocimiento de marca a cuidar a los clientes, así que listamos ese tipo de contenido en todas las fases de nuestro canvas. Pero solo listamos artículos de wiki/ayuda en la fase de retención.Pregunta 5. ¿Cómo crearás el contenido?Crear una estrategia de contenidos no es solo planificar qué hacer. También necesitas tener en cuenta cómo ejecutar tu plan.En otras palabras, necesitas preguntarte: “¿qué recursos necesitaré?”Puedes agrupar estos recursos en dos categorías: Personas. ¿A quién necesitas contratar y qué habilidades necesitas? Productos y servicios. ¿Qué herramientas necesitarás?Por ejemplo, pongamos que quisiéramos crear contenido de blog y vídeos de YouTube para una nueva marca, probablemente vamos a necesitar a las siguientes personas como mínimo:Redactores de contenido para el blogGuionista(s)Editor de blogVideógrafoEditor de vídeoDiseñadorAsistente virtual (VA)Necesitaremos unos pocos productos y servicios, incluyendo:Ahrefs para investigar temasWordable para subir posts del blogGrammarly para editar contenidoAdobe Premiere Pro para editar vídeosAdobe Photoshop para diseñar imágenes de los postsCámara, trípodes, lentes, micros y otro equipamiento de grabaciónAquí va nuestro canvas terminado:Reflexiones finalesTener una estrategia de contenido es inestimable para mantener en el camino adecuado tus esfuerzos de creación de contenido y asegurar que el contenido que creas tenga un propósito. Después de todo, es súper fácil caer en la trampa de crear contenido por el mero hecho de crearlo.Si ya has creado tu estrategia de contenido, el siguiente paso es crear una estrategia de marketing de contenidos y empezar a crear contenido.¿Alguna pregunta? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software. En este post te cuenta cómo crear un bot en WhatsApp. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Crear una Estrategia de Contenidos Ganadora"
    },
    {
      "level": "H2",
      "text": "¿Qué es una estrategia de contenidos?"
    },
    {
      "level": "H3",
      "text": "¿Cuál es la diferencia entre estrategia de contenidos y marketing de contenidos?"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante tener una estrategia de contenidos?"
    },
    {
      "level": "H2",
      "text": "Cómo crear una estrategia de contenidos"
    },
    {
      "level": "H3",
      "text": "Pregunta 1: ¿Para quién estás creando contenido?"
    },
    {
      "level": "H3",
      "text": "Pregunta 2. ¿Por qué creas contenido?"
    },
    {
      "level": "H3",
      "text": "Pregunta 3: ¿Dónde publicarás contenido?"
    },
    {
      "level": "H3",
      "text": "Pregunta 4. ¿Qué tipo de contenido crearás?"
    },
    {
      "level": "H3",
      "text": "Pregunta 5. ¿Cómo crearás el contenido?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}