{
  "url": "https://ahrefs.com/blog/es/estrategia-marketing-contenidos/",
  "slug": "estrategia-marketing-contenidos",
  "title": "Cómo construir una estrategia de marketing de contenidos ganadora en 9 pasos",
  "description": "Aprende a crear una estrategia de marketing de contenido que obtenga más tráfico, clientes potenciales y, en última instancia, ventas en 9 sencillos pasos.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Si quieres ganar en marketing de contenidos, necesitas una estrategia de marketing de contenidos.Porque cuandos tenga una, podrás lograr resultados como este:Aumento del tráfico de búsqueda en el blog de Ahrefs, a través del Site Explorer de Ahrefs.Y esto:Vistas mensuales en el canal de YouTube de Ahrefs.En esta publicación, te mostraré cómo crear una estrategia de marketing de contenido ganadora basada en nuestra experiencia en Ahrefs.Pero primero…¿Qué es exactamente una estrategia de marketing de contenidos?Una estrategia de marketing de contenidos es un plan para crear constantemente contenido de alta calidad diseñado para convertir extraños en clientes.La mayoría de la gente piensa que esto tiene que ser algo complicado, pero no es cierto.De hecho, nuestra estrategia en Ahrefs es bastante simple. Creamos publicaciones de blogs educativos y videos de YouTube que enseñan a las personas cómo resolver sus problemas con la ayuda de nuestras herramientas. Nos enfocamos en la optimización de motores de búsqueda (SEO) durante el proceso de creación de contenido, por lo que nuestro contenido aparece para búsquedas relevantes.Estamos en la primera posición en Google para la palabra clave “evergreen content.”A continuación, explicaré cómo puedeS replicar nuestra estrategia en nueve sencillos pasos.Pon una metaConoce a tu audienciaElige un tipo de contenidoEncuentra lo que la gente buscaPrioriza los temas más prometedoresCrea un calendario de contenidoPromociona tu contenidoMonitorea los resultadosActualiza tu contenidoPaso 1. Pon una metaEstablecer objetivos puede ser complicado, pero no tiene por qué serlo. Si estás familiarizado con conceptos como los objetivos SMART y los OKR, no dudes en utilizarlos.Sin embargo, preferimos mantener las cosas simples.Por eso nuestro objetivo de marketing de contenido es simplemente atraer tráfico cualificado desde motores de búsqueda como Google y YouTube.Tu objetivo puede ser diferente y está bien. Algunos otros objetivos comunes incluyen:Obtener más clientes potenciales entrantes para su equipo de ventasAtraer enlaces a su sitioCrear conciencia de marcaConvertirte en un líder de pensamiento en su industriaPara esta publicación, asumimos que, al igual que nosotros, deseas un tráfico más cualificado.Paso 2. Conoce a tu audienciaEl marketing de contenido no trata de atraer a todo el mundo a tu sitio web. Necesitas atraer personas que realmente puedan comprar tu producto o servicio.Eso puede parecer obvio, pero es un error común, especialmente para aquellos que son nuevos en el marketing de contenidos.Por ejemplo, supongamos que diriges una empresa de producción de vídeos. ¿Deberías escribir una publicación de blog sobre “cómo corregir el color en Adobe Premiere Pro?” Probablemente no, porque esto no es lo que buscan sus clientes. Es lo que buscan otros editores de vídeo.Si te diriges a propietarios de pequeñas empresas que buscan ayuda para la producción de videos, debes orientarlos a temas que les interesen.Y la única forma de hacerlo es tener claro a quién estás tratando de dirigirte.Para hacer esto, puedes considerar la posibilidad de crear un perfil del comprador. Se trata de una “persona imaginaria” que representa las características comunes de tu cliente ideal.Esto es lo que podrías parecer para nosotros:¿Es esto algo que tienes que hacer? Realmente no. Si ya crees que tienes una buena idea de quiénes son tus clientes objetivo, no dudes en omitir este paso. Sin embargo, si es algo en lo que nunca has pensado realmente, puede ser un ejercicio útil escribirlo en un papel. Aquí hay una buena guía que explica cómo hacer esto.Paso 3. Elije un tipo de contenidoPublicaciones de blog, videos, podcasts, seminarios web: hay un montón de tipos de contenido entre los que puedes elegir.Sin embargo, si estás comenzando, no intentes correr antes de caminar. Solo elige uno.¿Cómo? Hay dos aspectos que debes considerar.Primero, piensa en qué tipo de contenido consume tu audiencia. Para nosotros, eso es publicaciones de blog, ya que la mayoría de los SEO usan Google para encontrar información. Si tienes una academia de cocina y desea compartir recetas, los videos pueden ser una mejor opción.En segundo lugar, piensa en tus habilidades. Algunos somos naturales ante la cámara, mientras que otros no podemos soportar escuchar nuestra propia voz. Si eres más bien el segundo perfil, el contenido escrito podría funcionar mejor.Si estás atascado, comienza con blogs o marketing de video.Independientemente de la industria en la que te encuentres, es casi seguro que tu audiencia busca información en Google y YouTube. Por lo tanto, cualquier formato será un buen punto de partida.Una vez que lo hayas decidido, sigue con este formato hasta que hayas descubierto un proceso para crearlo de manera consistente. Solo entonces debes diversificarte a un nuevo formato.Eso es lo que hicimos. Casi todos nuestros esfuerzos estuvieron en el blog hasta 2018, cuando contratamos a Sampara que se hiciera cargo de nuestro canal de YouTube. Y Tim, nuestro director de marketing (CMO) no se centró en otros formatos de marketing de contenido (como cursosy herramientas gratuitas) hasta que delegó el blog y YouTube a Joshy Sam.Paso 4. Encuentra lo que la gente buscaNuestro objetivo de marketing de contenidos es atraer tráfico dirigido desde motores de búsqueda como Google y YouTube. Por lo tanto, además de saber quién es nuestro público, también necesitamos saber lo que están buscando. Esa es la única forma en que podemos crear el tipo de contenido que quieren ver y atraer tráfico de los motores de búsqueda mes tras mes.Para ello, necesitarás una herramienta de investigación de palabras clave como el Explorador de palabras clave de Ahrefs.Para empezar, haz una lluvia de ideas sobre algunas palabras clave “semilla” relevantes. Si vendes café en línea, estos pueden ser “café”, “granos de café” y “prensa francesa”.Pega estas palabras clave en el Explorador de palabras clave y selecciona Google o YouTube según el tipo de contenido que estés creando.A continuación, ve al informe “Preguntas”. Deberías ver una lista gigante de palabras clave y sus volúmenes de búsqueda mensuales y otras métricas de SEO.Si no estás seguro de qué palabras clave ‘semilla’ usar, mira lo que tus competidores ya están clasificando en Google para obtener algunas ideas. ¿Cómo? Pegue la URL de su competidor en Site Explorer de Ahrefs y vaya al informe “Páginas principales”.Este informe clasifica las páginas de un sitio web según el tráfico de búsqueda orgánico estimado. En otras palabras, ahora tienes una lista de los artículos con mejor rendimiento de tus competidores y las palabras clave que les envían más tráfico.Lecturas complementariasCómo realizar una investigación de palabras clave para SEO (Guía para principiantes)6 consejos de investigación de palabras clave para encontrar oportunidades sin explotarPalabras clave de cola larga: el ‘secreto’ para obtener TONELADAS de tráfico de búsquedaCómo realizar una investigación de palabras clave de YouTube en 3 sencillos pasosPaso 5. Prioriza los temas más prometedoresDado que tu objetivo es obtener un tráfico más cualificado, debes priorizar los temas más relevantes para tu negocio.Hacemos esto asignando una puntuación de “valor comercial” a cada tema.Aquí está la escala que usamos:“3”: nuestro producto es una solución insustituible para el problema;“2”: nuestro producto ayuda bastante, pero no es esencial para resolver el problema;“1”: nuestro producto ayuda marginalmente;“0”: nuestro producto no ayuda a resolver el problema ni se relaciona con él en absoluto.Lo bueno de esta escala es que se puede aplicar a prácticamente cualquier industria.Por ejemplo, supongamos que vendes equipos de café en línea. Un tema como “cómo hacer café con leche en casa” probablemente será un “3”, ya que los buscadores al menos necesitarán comprar un espumador de leche para hacer esto correctamente.Por otro lado, un tema como “cómo limpiar una cafetera” probablemente recibiría un “2”. Aunque puedes vender productos de limpieza especializados, la mayoría de los buscadores probablemente ya tengan algo que puedan usar para limpiar su máquina, como vinagre blanco. Así que probablemente no vayan a comprar nada en tu tienda hoy.Finalmente, temas como “cómo sacar el café de la alfombra” serían un “0” o un “1”. Si bien sigue siendo relevante para el tema, es poco probable que las personas que lo buscan sean entusiastas del café con una inclinación por los costosos equipos de elaboración. Quizás simplemente derramaron una taza de café instantáneo.Depende de ti qué temas cubre y cuáles no. Nos centramos en temas que obtienen una puntuación de 2 a 3 y rara vez publicamos algo que tenga una puntuación de cero.Paso 6. Crea un calendario de contenidoLa creación de contenido consistente trata de encontrar el equilibrio entre la calidad de tu contenido y la velocidad de producción. Tu objetivo es publicar con la mayor frecuencia posible sin perder tus estándares de calidad. Después de todo, no tiene sentido publicar contenido que no se lee, mira o escucha.Desafortunadamente, no podemos decir con qué frecuencia funciona para ti. Varía de una empresa a otra. Pero lo que podemos decirle es que necesitas un calendario de contenido para mantener el rumbo.Los calendarios de contenido son solo programas que muestran cuándo planeas publicar contenido nuevo y qué contenido deseas publicar.Por ejemplo, así es como se ve nuestro calendario de contenido en Ahrefs:Con este calendario simple, podemos ver fácilmente de un vistazo quién está trabajando en qué, en qué etapa se encuentran y cuándo el contenido está listo para su publicación.Esto mantiene todo organizado y garantiza que publiquemos de forma coherente.Paso 7. Promociona tu contenidoEl contenido no se descubre por sí solo. Tienes que mostrarlo a la gente para que lo lean y, con suerte, lo compartan o lo enlazen.Aquí hay algunas ideas simples de promoción de contenido para comenzar:1. Envía contenido nuevo a tus suscriptores de correo electrónicoEste es el truco más antiguo del libro por una razón: funciona.Cada vez que producimos un nuevo contenido, enviamos un correo electrónico dedicado a nuestros ~ 70.000 suscriptores comprometidos.2. DifusiónEn el marketing de contenidos, hay una audiencia secundaria “oculta” a la que la mayoría de la gente no busca dirigirse.Conocidos como “amplificadores”, estos son los periodistas e influencers que pueden compartir y ampliar tu contenido a tus seguidores.Fuente.Si de alguna manera puedes lograr que estas personas se fijen en tu contenido, potencialmente podrás ganar acciones, enlaces, tráfico de referencia o incluso oportunidades de asociación en el futuro.En marketing digital, esto se conoce como “outreach”.Y la clave para hacerlo bien es tener una razón convincente para que les importe.Aquí hay solo dos razones que puedes utilizar:Los mencionaste (o su trabajo) en tu contenido. A medida que creas contenido, es probable que hayas mencionado recursos de otros creadores de contenido. Por lo tanto, es un paso adicional rápido para hacerles saber que mencionaste su trabajo.Tienes algo innovador que el influencer no conoce, pero que realmente le interesa. Por ejemplo, es posible que hayas realizado un estudio de datos en el que encontraste algunos hallazgos únicos, como nuestro propio estudio sobre cómo el 91% del contenido no obtiene ningún tráfico de búsqueda.Ese segundo nos ha funcionado bien en numerosas ocasiones. De hecho, recientemente creamos una lista de estadísticas de SEO y nos comunicamos con más de 500 blogueros que estaban vinculados a estadísticas desactualizadas. Como resultado, obtuvimos enlaces de 32 sitios web.Aprende cómo lo hicimos aquí:https://www.youtube.com/watch?v=gMcA-8nalL83. Anuncios pagadosLa publicidad pagada es probablemente la forma más rápida de presentar tu contenido a nuevos prospectos. Ya sea en Facebook, Twitter o Pinterest, cuando inviertes algo de dinero en anuncios pagados, estás pagando por resultados rastreables: desde impresiones hasta clics y conversiones.En este momento, promocionamos cada publicación nueva con anuncios de Facebook. Si estos anuncios funcionan bien, invertimos más dinero en el anuncio (esto generalmente significa un CPC bajo de <$ 0,30).También patrocinamos podcasts y publicamos anuncios de YouTube con regularidad: If you create YT tutorials that feature your product, consider spending 💰 on ads. Doesn’t have to be a lot. In July, we spent 154.62 SGD (~112.75 USD) for 174.8 hours of watch time (10,488 minutes).That’s $0.01/min or $0.65/hour. Name a cheaper medium for relevant/focused attn— Sam Oh (@samsgoh) August 16, 2020Lecturas complementariasCómo promocionar su blog: 7 estrategias fundamentales13 tácticas probadas para aumentar el tráfico de su blogLista de verificación de promoción de contenido para principiantesPaso 8. Supervisa los resultadosDado que las cosas cambian todo el tiempo, también debemos asegurarnos de que nuestro contenido siga siendo relevante para posicionarse años en el futuro. Por eso es crucial monitorear el contenido y existen varias formas de hacerlo.Lo primero que piensa la mayoría de la gente es Google Analytics. Este es el estándar de la industria cuando se trata de verificar los números de tráfico reales.Si está creando videos de YouTube, entonces, por supuesto, debería mirar YouTube Analytics. ¡Tienes buena pinta ! Tu canal tiene aproximadamente las mismas vistas de lo usualY, por último, dado que para nosotros es importante tener una clasificación alta en Google, hacemos un seguimiento de nuestro posicionamiento a través del Rank Tracker de Ahrefs. Hacemos esto mediante el seguimiento de la palabra clave objetivo principal para cada publicación.A través de Ahrefs’ Rank Tracker.Si el tráfico y las posiciones de una página específica caen durante algunos meses seguidos, comenzaremos a investigar por qué sucede. Y en la mayoría de los casos, a menudo programamos una reescritura o actualización de la publicación.Paso 9. Actualiza tu contenidoComo acabo de mencionar, debes estar atento a qué tan bien está funcionando tu contenido escrito en un momento dado.Si mantienes su posicionamiento en los resultados de búsqueda, probablemente no necesites actualizarse.Sin embargo, si estás bajando rápidamente de rango y perdiendo visibilidad, probablemente sea hora de darle un cambio de imagen.Eso podría significar simplemente actualizar un poco de información para mantenerla actualizada o reescribir la publicación por completo. En Ahrefs, por lo general, esperamos unos seis meses para darle tiempo a una publicación de blog para clasificar antes de decidir reescribirla (aunque el formato de video no dispone de este lujo).Para obtener una guía más completa sobre cómo actualizar tu contenido, lee esta publicación o ve el video:https://www.youtube.com/watch?v=9HWna4hK47c&feature=emb_titleConclusionesEl marketing de contenidos es como invertir en fondos indexados. A corto plazo, los retornos son pequeños. Pero a largo plazo, puede generar rendimientos significativos, pero solo si se mantiene y sigue invirtiendo.Lo mismo ocurre con el marketing de contenidos. Se necesita esfuerzo para empezar y lleva tiempo trabajar. Pero concéntrese en ello a largo plazo y obtendrá resultados.¿Tiene preguntas? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo construir una estrategia de marketing de contenidos ganadora en 9 pasos"
    },
    {
      "level": "H2",
      "text": "¿Qué es exactamente una estrategia de marketing de contenidos?"
    },
    {
      "level": "H2",
      "text": "Paso 1. Pon una meta"
    },
    {
      "level": "H2",
      "text": "Paso 2. Conoce a tu audiencia"
    },
    {
      "level": "H2",
      "text": "Paso 3. Elije un tipo de contenido"
    },
    {
      "level": "H2",
      "text": "Paso 4. Encuentra lo que la gente busca"
    },
    {
      "level": "H2",
      "text": "Paso 5. Prioriza los temas más prometedores"
    },
    {
      "level": "H2",
      "text": "Paso 6. Crea un calendario de contenido"
    },
    {
      "level": "H2",
      "text": "Paso 7. Promociona tu contenido"
    },
    {
      "level": "H3",
      "text": "1. Envía contenido nuevo a tus suscriptores de correo electrónico"
    },
    {
      "level": "H3",
      "text": "2. Difusión"
    },
    {
      "level": "H3",
      "text": "3. Anuncios pagados"
    },
    {
      "level": "H2",
      "text": "Paso 8. Supervisa los resultados"
    },
    {
      "level": "H2",
      "text": "Paso 9. Actualiza tu contenido"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Si Quan Ong"
}