{
  "url": "https://ahrefs.com/blog/es/experimentos-seo/",
  "slug": "experimentos-seo",
  "title": "6 Experimentos SEO que te ayudan a entender cómo funciona Google",
  "description": "La teoría está genial, pero la práctica es mejor.",
  "content": "Contenido “¡Prueba, haz tests, experimenta!” Lo escuchamos por todas partes, ya sea desde X o LinkedIn. Pero si tu responsabilidad es dirigir una empresa, ¿cuándo vas a sacar el tiempo para poner a prueba los fundamentos del SEO? Probablemente, casi nunca.En este artículo compartiré algunos de los experimentos SEO realizados en Ahrefs que más me han gustado y lo que hemos aprendido gracias a ellos sobre el funcionamiento real de Google.1. ¿Realmente importan los enlaces para el posicionamiento?Recientemente, Google ha restado importancia a los enlaces, pero ¿qué ocurre si haces disavow (desautorizas) a los enlaces de determinadas páginas de tu web?¿En qué consistía el experimento?Patrick y su equipo realizaron un experimento que consistió en hacer disavow (desautorizar) a todos los enlaces externos de tres de las páginas más populares de nuestro blog durante un mes. Quería comprobar el impacto en nuestro tráfico orgánico.NOTA. Para la mayoría de webs, este tipo de experimento podría ser prácticamente un suicidio, ¡así que no te aconsejo que intentes recrear este test!Qué nos dice sobre GoogleLos resultados de nuestro experimento parecen mostrar que los enlaces siguen siendo importantes para Google, y, para sorpresa de nadie, hacer disavow o eliminarlos puede repercutir negativamente en el rendimiento de determinadas páginas.¿Puedes comprobarlo por tu cuenta?No. No te aconsejo que pruebes esto en tu web.Lecturas complementarias¿Siguen siendo importantes los enlaces para el posicionamiento? Un estudio de Ahrefs2. ¿Qué ocurre si eliminas contenido?¿Qué importancia tiene el contenido principal de una página para el posicionamiento?Puedes suponer que es muy importante para Google, pero las recientes pruebas del juicio del Departamento de Justicia de EE. UU. sugieren que Google ha confiado mucho en el pasado en la reacción de las personas ante los documentos, en lugar de tratar de comprender los propios documentos.No entendemos los documentos. Lo fingimos.Hoy, nuestra habilidad para comprender documentos directamente es mínima.Así que observamos las reacciones de las personas a los documentos y memorizamos sus respuestas.¿En qué consistía el experimento?Patrick y el equipo eliminaron el contenido principal de dos páginas para determinar el impacto SEO en nuestro tráfico orgánico. Aquí tienes un ejemplo de cómo quedó una de las entradas de nuestro blog después de eliminar el contenido principal.Al menos es una lectura rápida.Una vez eliminado el contenido, observamos un descenso inmediato.La caída y el repunte en Clics e Impresiones se mostraron claramente en Google Search Console:Aunque la caída de Clics es relativamente pequeña, es una prueba bastante convincente de que eliminar contenido es una mala idea.Qué nos dice sobre GoogleNo sabemos con certeza si Google comprende o no la naturaleza del contenido o la infiere a partir de las señales de la experiencia del usuario. Lo que sí sabemos es que existe una fuerte correlación entre la eliminación de nuestro contenido principal y la caída de clics. Sin contenido en la página sobre el tema, la relevancia de este resultado para los usuarios tocó fondo.¿Puedes comprobarlo por tu cuenta?Te aconsejo encarecidamente que no intentes hacer esta prueba por tu cuenta.Lecturas complementariasEliminé el contenido de dos posts para ver si seguían posicionándose. Esto es lo que ocurrió3. ¿Puedes alcanzar la primera posición de Google en 24 horas?Suena difícil, ¿no?Pero en uno de los vídeos más audaces de Sam Oh, intentó alcanzar el puesto número 1 en Google en 24 horas utilizando solo un puñado de técnicas básicas de SEO.El vídeo de Sam consiguió una participación enorme, muchos “me gusta” y visitas, e incluso Google elogió la calidad de los consejos de Sam.Estos consejos son épicos 💯¿En qué consistía el experimento?Sam encontró un post con consejos de blogging (esta es una versión similar, en español) que quería llevar al primer puesto en Google y se puso a utilizar técnicas básicas de SEO para mejorar su posición en Google.Identificó por qué el artículo no posicionaba bien, creó un plan para superar a la competencia mejorando el contenido y, a continuación, envió el post actualizado a Google Search Console.Sam también utilizó el informe También habla de de Ahrefs en Keywords Explorer, combinado con algunos trucos de ChatGPT para identificar ángulos únicos y novedosos para ampliar el contenido.Aquí tienes el vídeo completo:https://www.youtube.com/watch?v=zlNIHl92b3kQué nos dice sobre GoogleCuando encuestamos a profesionales del SEO y les preguntamos cuánto tarda el SEO, la mayoría comentó que puede llevar tres meses o más:Este experimento SEO le dio la vuelta a esa narrativa y demostró que mejorar tu posicionamiento en Google puede ser mucho más rápido, incluso utilizando solo conocimientos básicos de SEO.¿Puedes probarlo por tu cuenta?Sí. El hecho de que Google haya elogiado este vídeo debería bastar como prueba de que las técnicas utilizadas en él son experimentos “seguros para Google” que podrías probar en tu web.Pero, como en cualquier prueba, ten en cuenta que los resultados que obtengas pueden diferir de los nuestros.Lecturas complementariasIntenté posicionarme nº 1 en Google en 24 horas para demostrar algo4. ¿Qué ocurre si añades un apartado de artículos relacionados?Los posts o artículos relacionados se suelen mostrar en la parte inferior de la página de un blog y enlazan internamente a contenidos similares de la misma web o blog. La mayoría de los sistemas de gestión de contenidos (CMS) ofrecen funciones para añadir contenido relacionado.¿En qué consistía el experimento?En diciembre de 2022, añadimos una sección de entradas relacionadas con la versión en inglés de nuestro blog, titulada “Keep learning” (sigue aprendiendo) con un conocido plugin de WordPress.La teoría era que añadir esta sección ayudaría a mejorar nuestros enlaces internos y sería útil para nuestros lectores, que podrían querer explorar otras partes de nuestro contenido.Los resultados fueron positivos en varias URL:Qué nos dice sobre GoogleAñadir a tu blog una sección de contenido relacionado puede mejorar tu vinculación interna. Dado que Google rastrea Internet mediante enlaces, le resulta más fácil comprender la relación entre las páginas.Como el Blog de Ahrefs ya tenía una estructura de enlaces internos decente, no vimos una subida tremenda, pero podría tener más impacto para los blogs con menos enlaces internos.¿Puedes probarlo por tu cuenta?Sí. Añadir a tu blog una sección de entradas relacionadas suele suponer poco esfuerzo y es fácil de implementar. Tus resultados pueden variar, pero en la mayoría de los casos debería tener un impacto positivo con el tiempo.Lecturas complementarias¿Ayuda a tu blog añadir una sección de entradas relacionadas? Lo hemos probado5. ¿Qué ocurre si bloqueas páginas en robots.txt?Es sorprendentemente común que los sitios web bloqueen accidentalmente partes o incluso todo su sitio web sin darse cuenta. La teoría de Patrick era que, al bloquear las páginas para que no fueran rastreadas, Google tendría que confiar únicamente en las señales de enlace para clasificar el contenido.¿Qué pasó?¿En qué consistía el experimento?Patrick bloqueó a Google el rastreo de dos páginas mediante robots.txt. Ambas páginas perdieron tráfico, pero a pesar de bloquear la página, la magnitud de la pérdida no fue tan grave como podría haber sido.Así pues, la buena noticia es que Google puede ser bastante indulgente si bloqueas accidentalmente una página para que no sea rastreada, siempre que finalmente la desbloquees. Si quieres eliminar la página del índice de Google, el robots.txt no es el camino a seguir.Qué nos dice sobre GoogleGoogle necesita rastrear y comprobar tu sitio web periódicamente. Si bloqueas páginas en robots.txt, le estás diciendo a Google que no rastree determinadas partes de tu sitio web.No es una buena idea hacerlo en páginas que quieres que Google posicione.¿Puedes probarlo tú?No te aconsejo que lo intentes.Lecturas complementariasLa historia del bloqueo de 2 páginas de alto rango con Robots.txt6. ¿Puedes alcanzar la primera posición sin más cambios que conseguir más enlaces para un artículo?¿Puedes mejorar tu posicionamiento exclusivamente consiguiendo enlaces a tu artículo?¿En qué consistía el experimento?Josh y su equipo querían saber si era posible alcanzar el primer puesto centrándose únicamente en hacer link building para un tipo de contenido específico, sin realizar ningún otro cambio en el artículo.El resultado fue este post de estadísticas SEO diseñado específicamente para atraer enlaces. Más de 500 correos electrónicos después, Josh consiguió muchos enlaces decentes, que llevaron la página al puesto número uno en Google.A día de hoy, el post sigue ocupando el primer puesto y es el que tiene más enlaces y dominios de referencia en comparación con la competencia.Qué nos dice sobre GoogleEste experimento demostró dos cosas. En primer lugar, que conseguir enlaces de alta calidad hacia tus páginas puede ayudar a mejorar el posicionamiento. Y, también, que algunos tipos de contenido pueden conseguir enlaces más fácilmente que otros tipos de contenido.El contenido basado en estadísticas es muy proclive a compartirse y también es el tipo de contenido al que harán referencia los periodistas, sobre todo si está actualizado.¿Puedes probarlo por tu cuenta?Sí. Crear un post de estadísticas y respaldarlo con una campaña de difusión es un experimento SEO sencillo. En mi opinión, es una de las mejores formas de ganar enlaces de forma natural.Lecturas complementariasCaso de estudio de Linkbuilding: Cómo conseguimos backlinks con una página de “estadísticas” (y posicionamos #1)Nota al margen.¿Quieres ver más experimentos y casos prácticos de SEO? Consulta nuestros últimos Estudios de datos.Cómo realizar tus propios experimentos SEOYa conoces los experimentos SEO que hemos llevado a cabo en Ahrefs. Ahora es el momento de pasarte el testigo.Para poner en marcha tu propio experimento SEO, tienes que desarrollar una idea que poner a prueba y una forma de medirla.El proceso suele ser más o menos el siguiente:Hipótesis. ¿Qué crees que ocurrirá en tu experimento?Test. Ejecutar el experimentoMedición. Medir los resultados utilizando una herramienta como Carteras de Ahrefs para realizar un seguimiento de tus posicionesRevisión. Revisar los resultados y sacar una conclusión del experimentoNo puedo decirte qué probar, pero puedo mostrarte dos formas de medir tus resultados utilizando Ahrefs.Vista general de las SERPSi quieres comprobar puntualmente una palabra clave para ver si ha subido o bajado durante un periodo de tiempo, puedes utilizar Keywords Explorer de Ahrefs para ver si ha habido algún aumento de posición para tus palabras clave objetivo.Para hacerlo:Introduce tu palabra clave en Keywords ExplorerDesplázate hasta la vista general de las SERPAñade una fecha de comparación: debe ser la fecha en la que empezaste la pruebaLas líneas verde y roja muestran si un sitio web ha mejorado o empeorado su posición a lo largo del tiempo.Keywords Explorer es estupendo para comprobaciones puntuales, pero ¿y si quisieras hacer un seguimiento de varias palabras clave en un experimento SEO más amplio? Puedes utilizar Carteras (Portfolios, en la versión en inglés).CarterasAhora utilizo Carteras todo el rato, y, probablemente, sea una de mis funciones favoritas de Ahrefs. Pero también es genial para hacer un seguimiento de los resultados de tus experimentos SEO a lo largo del tiempo.Para configurar una nueva Cartera, haz clic en + Crear y luego en Cartera desde el panel principal.Una vez que lo hayas hecho, añade a tu Cartera las direcciones URL de las que quieras hacer un seguimiento.Una vez que hayas actualizado la configuración según tus preferencias, haz clic en Crear.Ahrefs rastreará entonces todas las URL de tu cartera de forma colectiva e individual.Las carteras funcionan de forma similar a los Proyectos. Al hacer clic en los distintos elementos del panel de control, accederás a los diversos informes de Ahrefs.Mi informe favorito es el de Comparar páginas.Esto sería especialmente útil si estuvieras realizando un experimento SEO, ya que podrías seguir visualmente el progreso de tus diferentes URL y del tráfico orgánico a lo largo del tiempo.Nota al margen. Puedes configurar varias carteras, de modo que, si lo necesitas, puedes crear una cartera de control con la que comparar, o hacer un seguimiento de las URL equivalentes de la competencia.Reflexiones finalesTomar lo que dice Google como verdad absoluta no es algo que los y las profesionales SEO estén dispuestos a hacer. Pero, al mismo tiempo, crear y ejecutar experimentos SEO requiere tiempo y recursos.Si quieres realizar tus propios experimentos SEO, puedes empezar por recrear los experimentos SEO más exitosos de Ahrefs. No te olvides de utilizar una herramienta como la vista general de SERP de Keywords Explorer y las Carteras para asegurarte de que no estás haciendo cambios que afecten negativamente a tu sitio web a largo plazo.¿Tienes más preguntas? Escríbenos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "6 Experimentos SEO que te ayudan a entender cómo funciona Google"
    },
    {
      "level": "H2",
      "text": "1. ¿Realmente importan los enlaces para el posicionamiento?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes comprobarlo por tu cuenta?"
    },
    {
      "level": "H2",
      "text": "2. ¿Qué ocurre si eliminas contenido?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes comprobarlo por tu cuenta?"
    },
    {
      "level": "H2",
      "text": "3. ¿Puedes alcanzar la primera posición de Google en 24 horas?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes probarlo por tu cuenta?"
    },
    {
      "level": "H2",
      "text": "4. ¿Qué ocurre si añades un apartado de artículos relacionados?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes probarlo por tu cuenta?"
    },
    {
      "level": "H2",
      "text": "5. ¿Qué ocurre si bloqueas páginas en robots.txt?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes probarlo tú?"
    },
    {
      "level": "H2",
      "text": "6. ¿Puedes alcanzar la primera posición sin más cambios que conseguir más enlaces para un artículo?"
    },
    {
      "level": "H3",
      "text": "¿En qué consistía el experimento?"
    },
    {
      "level": "H3",
      "text": "Qué nos dice sobre Google"
    },
    {
      "level": "H3",
      "text": "¿Puedes probarlo por tu cuenta?"
    },
    {
      "level": "H2",
      "text": "Cómo realizar tus propios experimentos SEO"
    },
    {
      "level": "H3",
      "text": "Vista general de las SERP"
    },
    {
      "level": "H3",
      "text": "Carteras"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Chris Haines"
}