{
  "url": "https://ahrefs.com/blog/es/explorador-web/",
  "slug": "explorador-web",
  "title": "Presentamos Explorador web, de Ahrefs",
  "description": "Explorador web de Ahrefs te permite buscar en toda la base de datos de páginas, dominios y enlaces de nuestro motor de búsqueda (Yep)",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido El conjunto de herramientas de Ahrefs acaba de ampliarse con el lanzamiento de una herramienta SEO realmente única: Explorador web (Web explorer en la versión en inglés).Qué hace Explorador web de AhrefsBásicamente, Explorador web te permite buscar en toda la base de datos de páginas, dominios y enlaces de nuestro motor de búsqueda (yep.com) mediante operadores de búsqueda. Pero tiene más funciones.1. Puedes ver la web como la ven (de verdad) los motores de búsqueda Cuando decimos que puedes buscar en la base de datos de 500.000 millones de páginas de yep.com, lo decimos en serio.Ningún motor de búsqueda te permite hacer esto. Ni siquiera Google.El número que aparece en la parte superior de la primera página de resultados de búsqueda de Google (donde puedes leer “aproximadamente xxx resultados”) es solo una estimación, ya que Google solo obtiene una página de su índice cada vez. Esto significa que Google no sabe cuántos resultados hay hasta que llega a la última página. Por lo tanto, la estimación puede estar cerca o muy lejos, como en el ejemplo que mostramos a continuación:Sin embargo, con Explorador web puedes ver todas las consultas de búsqueda relevantes indexadas por yep.com para el tema que te interese, incluidos los resultados similares que Google podría haber omitido a propósito.Y también propiedades específicas que hacen que la página aparezca aquí, como tener enlaces con una determinada palabra de texto ancla, unas palabras concretas en el título, etc.2. Buscar páginas por el texto ancla y las URL de sus enlaces entrantes y salientesExplorador web también facilita la búsqueda y el acceso a información sobre páginas, enlaces entrantes (backlinks) y enlaces salientes (outlinks) en un solo lugar.Puedes utilizarlo para buscar rápidamente los textos ancla de una página y las URL de sus enlaces entrantes (backlinks) y enlaces salientes (outlinks).Por ejemplo, (1) al filtrar por propiedades de enlaces salientes (como páginas con determinadas palabras en el texto ancla de sus enlaces salientes) puedes (2) hacer clic en el desplegable “Páginas enlazadas que coinciden” para verlas.Igualmente, (1) al filtrar con las propiedades de los enlaces entrantes (como las páginas con determinadas palabras en el texto ancla de sus enlaces entrantes) puedes (2) hacer clic en el menú desplegable “Páginas de referencia que coinciden” para verlas.Esto convierte a Explorador web en una herramienta de investigación y análisis versátil para distintos casos de uso, en particular los relacionados con el link building.Hablaremos de eso más adelante. Pero, primero, vamos a repasar la interfaz.Cómo funciona Explorador webEn esencia, Explorador web se basa en la búsqueda y los informes personalizados.Para utilizarlo, escribe una palabra clave y añade los siguientes operadores de búsqueda avanzada en el desplegable “+”.He aquí algunos operadores de búsqueda avanzada de Explorador Web:intitle: Encuentra páginas que contengan palabras concretas en sus títulos.indescription: Encuentra páginas que contengan palabras concretas en sus meta descripciones.incontent: Encuentra páginas que contengan palabras concretas en su contenido.inh1: Encuentra páginas que contengan palabras concretas en sus etiquetas H1.inh2: Encuentra páginas que contengan palabras concretas en sus etiquetas H2.inurl: Busca páginas que contengan palabras concretas en sus URL.url: Limita los resultados a los de una URL específica.site: Limita los resultados a los de un sitio web específico.outlinkanchor: Encuentra páginas que contengan palabras concretas en el texto ancla de sus enlaces salientes.outlinkcontext:Encuentra páginas que contengan palabras concretas en el texto ancla o en el texto que rodea a sus enlaces salientes.outlinkurl:Encuentra páginas que enlazan con una URL específica.outlinkdomain: Encuentra páginas que enlazan con un sitio web específico.backlinkanchor: Encuentra páginas con enlaces desde otros sitios web que tengan determinadas palabras en su texto ancla.backlinkcontext: Encuentra páginas con enlaces desde otros sitios web que tengan ciertas palabras en su texto ancla o en el texto alrededor.backlinkurl: Encuentra páginas que están siendo enlazadas desde una URL específica.backlinkdomain: Encuentra páginas que están siendo enlazadas desde un sitio web específico.Cualquiera de estos operadores puede combinarse. También puedes utilizar operadores booleanos (AND, OR, +, - y paréntesis) para anidarlos, de forma similar a los operadores de búsqueda de Google.Para obtener algunas ideas rápidas sobre cómo utilizar Explorador web, ve a la pestaña “Ejemplos”, que contiene los casos de uso más comunes como un conjunto de filtros predefinidos.Se puede hacer clic en cada caso de uso y se autocompletará al escribir una búsqueda.Una vez que pulses en “búsqueda”, llegarás a la página de resultados que está dividida en cuatro secciones.Filtros. Para profundizar en las páginas que te interesan.Número de resultados. En función de los filtros aplicados.Función de exportación. Para exportar los resultados filtrados.Tabla de informes de página. Contiene métricas como recuento de palabras, DR, UR, dominios de referencia, enlaces salientes externos, etc.Puedes guardar las búsquedas personalizadas, como esta, que te han llevado tiempo, haciendo clic en “Guardar informe”:Todos los informes guardados aparecerán en la pestaña “Mis informes” de la página de inicio de Explorador web.Ahora que ya te has familiarizado con la interfaz, pasemos a algunos casos de uso únicos.Casos prácticosDado que Explorador web permite buscar páginas por texto ancla y URL de sus backlinks y outlinks, vamos a cubrir algunos casos de uso relacionados con link building.1. Busca páginas que contengan determinadas palabras clave en el texto ancla de sus enlaces salientes.Una buena forma de conseguir enlaces es buscar páginas que enlacen con temas que ya has tratado. Una vez localizadas, puedes ponerte en contacto con las personas responsables de las páginas para que incluyan tu web como enlace externo.Por ejemplo, ya hemos escrito un artículo sobre cómo realizar una auditoría de contenidos que incluye una plantilla.Para encontrar oportunidades de enlaces sobre este tema vamos a utilizar el operador de búsqueda outgoinglinkanchor: seguido de las palabras “plantilla de auditoría de contenido”.Lo que hace esto es mostrarnos las páginas cuyo texto ancla del enlace saliente contiene nuestra palabra clave deseada.Si queremos refinar aún más nuestras oportunidades, podemos añadir un filtro de Clasificación de Dominio (DR) para mostrar solo páginas procedentes de sitios web de alta autoridad de, por ejemplo, con un DR superior a 30. Incluso se puede especificar la profundidad de la URL y el idioma.2. Encontrar menciones de marca sin enlaceOtra fruta madura es encontrar menciones de marca que no tengan enlace (es decir, que nombren tu página o producto, pero sin ponerte un enlace).Como el autor ya ha mencionado tu marca y está familiarizado con ella, estás ya cerca de conseguir un enlace.Así que busquemos primero “Ahrefs”. Excluiremos las páginas que ya enlazan con ahrefs.com añadiendo a la búsqueda -outlinkdomain:ahrefs.com, así como los resultados de ahrefs.com mediante el operador de búsqueda -site:ahrefs.com.Y, al instante, tenemos más de 65 millones de páginas que mencionan Ahrefs pero no nos enlazan.Es imposible escribir a todas. Además, algunas páginas pueden pertenecer al mismo dominio.Así que una manera más eficiente de buscar dominios relevantes es hacer clic en el menú desplegable “Ajustes” y seleccionar “Una página por dominio”, junto con el resto de opciones. Esto reducirá nuestra lista a unos 440.000 dominios, más relevantes y manejables.3. Encuentra páginas de recursos en tu nichoAunque podrías utilizar el informe Enlaces de Site Explorer para esta misma tarea, Explorador web te permite buscar la señal de las páginas de recursos en todos los dominios (en lugar de en un único dominio).Supongamos que queremos encontrar páginas de recursos en el nicho del marketing.Para ello, crearemos una búsqueda que encuentre páginas que tengan “marketing” en sus títulos y “recursos” o “enlaces” tanto en sus títulos como en sus URL.Así que empezaremos la búsqueda con intitle: marketing. Y utilizaremos los operadores de búsqueda intitle: e inurl:. Pero, como “recursos” o “enlaces” tienen que aparecer ambos en los resultados de la búsqueda, los agruparemos utilizando paréntesis y el operador “OR”, como puedes ver a continuación: Para reducir la lista, filtraremos las páginas de recursos que procedan de sitios web de autoridad con un DR de al menos 35. También añadiré un filtro sobre el número mínimo de enlaces externos con un valor de “5” para encontrar páginas que enlacen con al menos cinco recursos externos.Estos filtros nos ayudan a reducir las páginas de recursos a una cuarta parte de los resultados originales. Solo nos queda ponernos en contacto con las personas responsables de cada web y pedirles que nos incluyan en esas páginas.Nota al margen.Todos los casos de uso que hemos tratado hasta ahora están disponibles en la pestaña “Ejemplos”.Próximas funcionesExplorador web está disponible para los nuevos planes Advanced y Enterprise.Ten en cuenta que se trata solo de la primera versión, con funcionalidades por añadir en la hoja de ruta, como:Detectar con qué tecnologías están creadas las páginas (CMS, plataformas de blogs, servicios de analítica, publicidad, etc.)Extracción de datosmailto: y tel: asociados a un dominio.Añadir cifras de tráfico de páginas y códigos de estado.Identificar autores de entradas de blog y la posibilidad de filtrar por los mismos.Notificación de enlaces rotos.Así que empieza ya y sumérgete en las infinitas oportunidades que te ofrece Explorador web.Si tienes alguna sugerencia de funcionalidades que pudieran mejorar la herramienta, puedes contárnoslo en nuestra página de Canny, en la comunidad Ahrefs o en nuestro Twitter (X) en español. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Presentamos Explorador web, de Ahrefs"
    },
    {
      "level": "H2",
      "text": "Qué hace Explorador web de Ahrefs"
    },
    {
      "level": "H3",
      "text": "1. Puedes ver la web como la ven (de verdad) los motores de búsqueda"
    },
    {
      "level": "H3",
      "text": "2. Buscar páginas por el texto ancla y las URL de sus enlaces entrantes y salientes"
    },
    {
      "level": "H2",
      "text": "Cómo funciona Explorador web"
    },
    {
      "level": "H2",
      "text": "Casos prácticos"
    },
    {
      "level": "H3",
      "text": "1. Busca páginas que contengan determinadas palabras clave en el texto ancla de sus enlaces salientes."
    },
    {
      "level": "H3",
      "text": "2. Encontrar menciones de marca sin enlace"
    },
    {
      "level": "H3",
      "text": "3. Encuentra páginas de recursos en tu nicho"
    },
    {
      "level": "H2",
      "text": "Próximas funciones"
    }
  ],
  "author": "Joshua Hardwick"
}