{
  "url": "https://ahrefs.com/blog/es/google-analytics-errores-seguimiento/",
  "slug": "google-analytics-errores-seguimiento",
  "title": "13 errores de seguimiento de Google Analytics (y cómo corregirlos)",
  "description": "Tener datos defectuosos en Google Analytics puede conducir a malas decisiones. Soluciona estos 13 errores para minimizar factores de datos sesgados",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Si viste esta caída de tráfico en tu cuenta de Google Analytics……entonces probablemente quieras priorizar mejorar el SEO en esa página.¿Pero y si está información está equivocada?Hay un alto riesgo de tomar malas decisiones si estás confiando a ciegas en los datos que ves en Google Analytics. Como dice el dicho: basura que entra, basura que sale.Esta guía te ayudará a minimizar los factores que sesgan los datos reparando estos errores:Código faltante o duplicado en Google AnalyticsSeteo incorrecto de eventos de interacciónSeguimiento a eventos de otros dominiosSeguimiento a tus propias sesionesNo usar filtros de botsSeguimiento de spam referidoMal uso de parámetros UTMNo excluir los parámetros de consultaNo combinar las mismas fuentes y mediosNo usar la lista de exclusión de referidosSeguimiento de la información de identificación personal (PII)No mostrar páginas vistas para aplicaciones de página única (SPAs)No tener backup o vista de prueba1. Código faltante o duplicado en Google AnalyticsPuede sonar trivial, pero es un problema común - especialmente en sitios que usan más de un CMS (sistema de gestión de contenidos).Lo bueno es que Google Analytics tiene notificaciones de código faltante. Lo malo es que es lento, y puede tomarle semanas alertarte sobre páginas con código faltante. Además, no te avisa cuando existe código duplicado, que es otro problema común.Por eso, lo mejor es no confiar en las notificaciones de Google, y en vez de eso rastrear tu web buscando errores con una herramienta que permita extraerlos de manera personalizada.Así se rastrea con extracción personalizada en Screaming Frog, para rastrear el código de Google Tag Manager y Google Analytics:Lo mejor es exportar el rastreo para inspeccionar los datos. Fácilmente podrás encontrar código faltante o ver los duplicados si hay más columnas en el reporte. Por ejemplo, Encontrar código GTM 1 y Encontrar código GTM 2.Exportado del rastreo de Screaming Frog en Google Sheets.2. Seteo incorrecto de eventos de interacciónTener cosas como compras, entradas de formularios o vistas de video como eventos de interacción tiene sentido. Son importantes para tu negocio, por lo que el hecho de que no cuenten como rebotes -incluso cuando el usuario sólo mira una página- está bien.Pero si estás usando eventos de interacción para dar seguimiento a eventos que se muestran automáticamente en cada página, como el seguimiento en profundidad del scroll, eso va a resultar en un porcentaje de rebote cercano a cero en todo tu sitio web - y eso no es bueno.Puedes encontrar estos problemas rápidamente si buscas porcentajes de rebote en Google Analytics que son demasiado bajos para ser verdad.Si sospechas que los eventos de interacción son los culpables, cambia el seteo de “Evento de no interacción” de falso a verdadero en el Google Tag Manager.Si no estás usando el Tag Manager de Google, solo agrega una línea más de código al snippet del evento de Google Analytics.3. Seguimiento a eventos de otros dominiosEs sorpresivamente fácil para alguien arruinar tus datos si no se toman acciones preventivas. Por qué? Porque tu código de seguimiento de GA o GTM es visible para cualquiera que abra tu código fuente, entonces cualquiera puede enviar eventos a los servidores de GA desde tu código de seguimiento.Por suerte, es fácil prevenir que esto suceda, definiendo un filtro de vista.Esto solo incluirá eventos de tu propio (sub)dominio:Esta es la expresión regular para el filtro de patrón del hostname: (^|.)example.com4. Seguimiento a tus propias sesionesHay muchas acciones irregulares que hacemos en nuestros sitios, y no queremos que estos se refleje en nuestros datos.Entonces, a medida que definimos los filtros, asegurémonos también de excluir los eventos desde direcciones de IP internas. Esto es fácil de hacer para un IP único:Si necesitas excluir más IPs, puedes ver esta guía de Google.5. No usar filtros de botsGoogle puede detectar la mayoría del tráfico spam o proveniente de bots de tu sitio. Todo lo que debes hacer es clickear un botón.Encontrarás esto en Administrador > Configuración de vista:Ten en cuenta que es suficiente con clickear este botón en tu vista principal de analytics. No es necesario hacerlo en la vista de testing.6. Seguimiento de spam referidoLos sitios populares atraen links spam. Así son las cosas.La mayoría de éstos son mínimos y traen cero tráfico de referencia, pero algunos pueden enviar miles de referidos spam cada día.Para revisar si esto está siendo un problema para tu sitio, setea el valor de datos a un mínimo de tres meses, luego ve al Reporte de referidos (Adquisición > Todos el tráfico > URLs de referencia).Busca dominios sospechosos con un alto número de referidos.Reporte de referidos con referidos de un sitio sospechoso.No hagas clic en los dominios sospechosos, ya que podrían contener malware o spyware. En vez de eso, crea una lista y exclúyelos con un filtro (Admin > Filter). Elige el campo de filtro como “Fuente de campaña” (Campaign Source) y luego lista los dominios en el patrón del filtro separados por el símbolo: |.IMPORTANTE. Siempre recuerda verificar tus filtros para ver cómo influye en tus datos. Hay un botón debajo de los filtros para hacer esto.7. Mal uso de parámetros UTMLos parámetros UTM son etiquetas agregadas a las URL para etiquetar diferentes fuentes de tráfico. Más que nada se usan en publicidad paga y links que de otra manera se mezclarían con visitas orgánicas.Supongamos que estamos corriendo ads en Twitter. Por defecto, el tráfico se mostraría bajo “twitter.com/ referral”, haciendo imposible cualquier análisis de performance. Entonces, anexamos parámetros UTM para las URL usadas en publicidades de Twitter:Captura de pantalla de Campaign URL Builder. Recomiendo usar esta herramienta para etiquetar tus URL hasta que sientas que tienes suficiente experiencia para hacerlo manualmente.Estos parámetros UTM luego se envían a los servidores de GA y se usan en sus respectivas dimensiones.¿eres parte de un equipo de marketing?Si hay múltiples personas involucradas en manejar datos de resultados de campañas de marketing, necesitas tener lineamientos de unificación de parámetros UTM. Confía en mí, analizar la performance de canales de marketing cuando el etiquetado no está unificado es una de las cosas que realmente no querés hacer en Google Analytics.Mientras haces esto, ten en cuenta que el proceso de agregar parámetros UTM depende de la plataforma de publicidad. Por ejemplo, Twitter Ads requiere URLs con los parámetros ya integrados, mientras Google Ads puede (y debería) automatizar este proceso.8. No excluir los parámetros de consultaDesordenar las dimensiones de tu página (o landing) con parámetros en las URL puede ser una pesadilla al intentar hacer análisis en mayor profundidad. Divide una misma URL en múltiples filas, lo que lleva a métricas divididas.Ilustración de una URL dividida por los parámetros.Para resolver esto, usa el filtro de reportes para mostrar todas las URL parametrizadas guardadas en tu vista de GA.Luego, para mantener unificadas las dimensiones de la página, excluye los parámetros que no quieres ver en tus reportes.Puedes hacerlo en Configuración de Vista (View Settings):RemarSólo asegúrate de no excluir:Parámetros de consulta de búsqueda (o bloqueará tus datos de búsqueda dentro del sitio)Parámetros UTM (GA ya los resuelve correctamente)Parámetros que quieras buscar por separado (por ejemplo los de diferentes productos en un sitio de ecommerce)Si estás tratando con un gran número de parámetros que quieres excluir, es mejor usar filtros de vista. Su flexibilidad y la posibilidad de usar expresiones regulares hace que sean una mejor solución. Sigue esta guía para configurarlos.9. No combinar las mismas fuentes y mediosTal vez notaste que parte de tus fuentes y medios de tráfico están desordenados, porque son básicamente la misma cosa. El ejemplo más común es el tráfico de referencia de Facebook.Esos subdominios raros se llaman referidos “link shim”. Facebook las usa por motivos de seguridad y privacidad, pero puede hacer que sea difícil analizar la performance de una fuente o medio en particular.Para arreglarlos, usa filtros. Aquí hay un filtro que une el tráfico de referencia desde Facebook:Recuerda verificar el filtro para asegurarte que efectivamente hace lo que intentaste hacer.Además, deberías crear una nota para recordar que uniste el tráfico, para que otras personas no se pregunten por qué hubo cambios. Google Analytics no aplica los filtros retroactivamente, así que tendrás que lidiar con los datos más viejos.10. No usar la lista de exclusión de referidosCuando agregas un dominio a una lista de exclusión de referidos, cualquier tráfico que proviene de ese dominio dejará de etiquetarse como tráfico referido, y ya no mostrará una nueva sesión.Esto es especialmente útil en tres casosPortales de pago. Si usas un procesador de pago externo, probablemente diriges a tus clientes hacia ahí y luego los traes de vuelta a tu sitio al finalizar el pago. Eso debería contar como una sola sesión dentro de una fuente de tráficoSeguimiento de subdominios. Los subdominios son hostnames separados, y el tráfico que proviene de ellos debería naturalmente disparar una nueva sesión de referidos. Por suerte, GA pone tu propio dominio en esta lista cuando crea la propiedad. Déjalo así. Y mantén también el “Cookie Domain: Auto” que viene por defecto, o si lo encuentras en el código de seguimiento o GTM.Seguimiento entre dominios. Si para un mismo negocio tienes micronichos u otros dominios diferentes, puede serte útil unir los datos.Puedes encontrar esta lista en Administrador > Columna “Propiedad” > Información de seguimiento > Lista de Exclusión de Referidos.Introduce los dominios con formato ejemplo.com para cubrir todos los subdominios.Lista de exclusión de referidosExcluye estos dominios de tu tráfico referido[button] Agrega una exclusión de referido11. Seguimiento de la información de identificación personal (PII)Aunque esto no daña la claridad de tus datos, puede causarle serios problemas a tu negocio.Necesitas asegurarte de no estar siguiendo ningún PII como emails, números de teléfono o nombres. O aún mejor - adhiere a las regulaciones de protección de datos y privacidad que aplican a tu negocio.Por desgracia, podrías estar siguiendo PII sin saberlo, generando parámetros URL con información personal en formularios u otros lugares.Ejemplo de una URL con parámetros que contienen PII.Probablemente este no sea el caso si estás usando un CMS de los más populares, pero definitivamente deberías revisar esto si tienes un sitio completamente personalizado.Solo para dejar claro lo obvio, no intentes recolectar PII mediante dimensiones personalizadas. Y si quieres revisar qué datos guardan los sitios web, usa una extensión del navegador comodataslayer o WASP.12. No mostrar páginas vistas para aplicaciones de página única (SPAs)¿Tu sitio es una aplicación de página única (SPA)? En otras palabras, ¿está usando JavaScript para generar contenido de manera dinámica?Si la respuesta es sí, entonces el seguimiento de la información es un poco más difícil para tí.Las SPA cargan todo lo que necesitan junto con la primera visita de página y van actualizando el contenido y las URLs de manera dinámica. Esto significa que GA no dará seguimiento de otras visitas de páginas porque, naturalmente, no hay más pedidos a sus servidores.Para arreglar esto, necesitas usar soluciones que probablemente requieran ayuda de programadores o expertos en GTM. Si quieres aprender más sobre esto, puedes ver la documentación oficial de Google y esta guía detallada.13. No tener backup o vista de pruebaEste último más que un error de seguimiento es una buena práctica para usar información de Google Analytics.Incluso si tienes una única cuenta y propiedad, siempre asegurate de tener al menos tres vistas diferentes:Vista general. Usarás principalmente esta, con todas las configuraciones y filtros aplicados.Vista de backup. Una vista donde toda la configuración queda por defecto. Si tienes algún problema en tu vista principal, siempre tendrás los datos crudos aquí.Vista de testing. Puedes jugar con esta vista para probar primero. Es útil si no estás muy seguro de las implicancias de modificar las vistas de configuraciones más complejas, como usar múltiples filtros.Puedes cambiar los nombres de las vistas en Administrador > Configuración de vista > Nombre de vistaSólo recuerda que los nombres de las vistas tienen que ser lo más explicativos posible, para que cuando otras personas usen la cuenta puedan entenderlas.ConclusiónTestea, verifica, repite.Cuando hagas cambios en tu configuración de GA, GTM o código de seguimiento, deberías tomar el rol de ingeniero en aseguramiento de la calidad por un momento.Esto significa que deberás estar cómodo trabajando con código fuente, cookies y varias otras herramientas de debugging. Te recomiendo usar estas:Asistente de etiquetas de GoogleDebugger de Google AnalyticsdataslayerWASPReportes en tiempo real de GA para ver los efectos de las etiquetas que muestra.Herramientas de debugging de cualquier plataforma que uses, por ejemplo la de Facebook PixelImplementar, auditar y eliminar los bugs depende de la complejidad de seguimiento que necesites, y de la implementación del código. Si aún no estás usando GTM, te recomiendo que hagas ese cambio, excepto que tus necesidades de seguimiento sean simples.Si, te tomará mucho tiempo aprender si recién estás empezando. Pero los beneficios son enormes. No tendrás que ponerte en contacto con los desarrolladores para cambiar el código de seguimiento, y es simplemente genial tener contenedores, etiquetas, disparadores y variables bien organizadas.¿Mencioné ya que hay que testear y verificar todo?Escríbeme en Twitter si tienes alguna pregunta.Tra­duci­do por Agen­cia Eleven. Des­de Argenti­na, hace­mos que te encuentren. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "13 errores de seguimiento de Google Analytics (y cómo corregirlos)"
    },
    {
      "level": "H2",
      "text": "1. Código faltante o duplicado en Google Analytics"
    },
    {
      "level": "H2",
      "text": "2. Seteo incorrecto de eventos de interacción"
    },
    {
      "level": "H2",
      "text": "3. Seguimiento a eventos de otros dominios"
    },
    {
      "level": "H2",
      "text": "4. Seguimiento a tus propias sesiones"
    },
    {
      "level": "H2",
      "text": "5. No usar filtros de bots"
    },
    {
      "level": "H2",
      "text": "6. Seguimiento de spam referido"
    },
    {
      "level": "H2",
      "text": "7. Mal uso de parámetros UTM"
    },
    {
      "level": "H2",
      "text": "8. No excluir los parámetros de consulta"
    },
    {
      "level": "H2",
      "text": "9. No combinar las mismas fuentes y medios"
    },
    {
      "level": "H2",
      "text": "10. No usar la lista de exclusión de referidos"
    },
    {
      "level": "H2",
      "text": "11. Seguimiento de la información de identificación personal (PII)"
    },
    {
      "level": "H2",
      "text": "12. No mostrar páginas vistas para aplicaciones de página única (SPAs)"
    },
    {
      "level": "H2",
      "text": "13. No tener backup o vista de prueba"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Michal Pecánek"
}