{
  "url": "https://ahrefs.com/blog/es/google-my-business/",
  "slug": "google-my-business",
  "title": "Cómo optimizar tu ficha de Google My Business en 30 minutos",
  "description": "Aprende a optimizar el perfil de tu negocio en Google a través de Google My Business de manera rápida y eficiente.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Google My Business es una herramienta gratuita que permite a los propietarios de empresas crear, administrar y optimizar el perfil de empresa de Google. Existe para ayudar a las empresas a atraer nuevos clientes a partir de las búsquedas y los mapas.A continuación, te presentamos algunos beneficios concretos para reclamar y optimizar tu perfil de empresa de Google:Mejor posicionamiento. Google muestra los perfiles de empresa en los resultados de las búsquedas locales, y los perfiles bien optimizados tienen más probabilidades de aparecer más arriba en la lista.Mejor visibilidad. Proporcionar información útil ayuda a Google a mostrar tu perfil de empresa en los resultados de búsqueda para realizar búsquedas locales más relevantes.A continuación te indicamos cómo optimizar tu perfil de empresa a través Google My Business:Crear o reclamar tu perfil de empresaEstablecer la categoría de tu negocioSeleccionar tu tipo de negocioAgregar las horas de trabajoFijar las horas de las vacacionesAñadir tus datos de contactoAñadir fotosAñadir productos y serviciosObtener más reseñasResponder a las preguntasPublicar actualizacionesConfigurar los mensajesRellenar todo lo demásOptimizar tu sitio web1. Crear o reclamar tu perfil de empresaEs importante señalar que Google Business Profile y Google My Business son dos cosas distintas:Google Business Profile: Una ficha local con información sobre un negocio. Los perfiles de empresa aparecen en la búsqueda de Google en el escritorio y en el móvil, y en Google Maps.Google My Business: Una herramienta gratuita para administrar tu perfil de empresa en Google.Antes de poder optimizar cualquier cosa, primero debes crear o reclamar tu perfil de empresa de Google a través Google My Business. Para ello, haz clic aquí, pulsa “Administrar ahora” y accede a tu cuenta de Google.Si ya has reclamado tu perfil de empresa de Google, verás un panel de administración.Sino, verás una opción para encontrar y gestionar tu ficha. Escribe el nombre de tu empresa en el cuadro de búsqueda. Si aparece en el menú desplegable, pulsa el nombre de la empresa y reclama el perfil. De lo contrario, presiona la opción para crear una nueva empresa con ese nombre.Sólo debes saber que el nombre de tu empresa en tu perfil de empresa debería ser el real, no una versión “optimizada” con un rejunte de palabras clave. Ejemplo de un nombre comercial relleno de palabras clave.Google establece en sus pautas que si haces esto, tu perfil podría ser suspendido:Tu nombre debe reflejar el nombre real de tu negocio, tal como se usa de manera habitual en tu tienda, sitio web, folletería, y como lo conocen los clientes. […] Incluir información innecesaria en el nombre de tu negocio no está permitido, y podría resultar en la suspensión de tu anuncio.2. Establecer la categoría de tu negocioLas categorías describen lo que es tu negocio, no lo que hace o vende. Siempre elige la categoría principal que mejor describa tu negocio en su conjunto, no los productos o servicios.Para la mayoría de los negocios, esto es bastante fácil. Si eres plomero, elige “plomero”. Si eres dueño de una pizzería, elige “pizzería”. Pero hay veces en que la mejor opción no es tan clara.Por ejemplo, digamos que eres un contador público que dirige una empresa de contabilidad. Podrías preguntarte cuál de estas categorías elegir:ContadorEmpresa de ContabilidadContador públicoLa respuesta es que no hay una respuesta definitiva. Las tres son opciones válidas. Sin embargo, el consejo de Google es ser lo más específico posible, así que “contador público” es probablemente la mejor opción aquí.Eso puede sonar contrario a la intuición, pero te da la mejor oportunidad de aparecer para la mayoría de las búsquedas. Un contador público es un resultado relevante tanto si la gente busca específicamente un contador público, o más ampliamente un contador. Un contador es sólo un resultado relevante para la gente que busca un contador.Puedes ver esta representación en las SERPs.Tanto los contadores como los contadores públicos se posicionan cuando se busca un contador.Sólo los contadores públicos se clasifican cuando se buscan contadores públicos.En cuanto a las categorías adicionales, sólo debes añadirlas si necesitas dar a conocer a los clientes potenciales productos o servicios que no entran en tu categoría principal. Por ejemplo, si tu categoría principal es contador público, no es necesario agregar “contador” como categoría adicional porque es demasiado similar. Pero si ofrece servicios de contabilidad o nómina, puede que valga la pena añadirlos.3. Seleccionar tu tipo de negocioGoogle divide básicamente los negocios en tres tipos.Las tiendas físicas sirven a los clientes en su dirección comercial solamente. Ejemplos: peluquerías, cafés, bares, almacenes, etc.Las tiendas de servicios visitan o entregan a los clientes, pero no sirven desde su dirección comercial. Ejemplos: plomero, servicio de limpieza, peluquería móvil, etc.Las tiendas híbridas atienden a los clientes desde su dirección comercial y también los visitan o les entregan. Ejemplos: un fotógrafo que hace fotos en el lugar y en el estudio, o un restaurante que también ofrece un servicio de entrega.Si eres un negocio localizado, establece tu dirección y deja el campo de área de servicio vacío. Hazlo en la pestaña de información.Si eres un negocio de servicios, pulsa la opción de establecer tu área de servicio. Puedes sumar hasta veinte de estas, pero es importante ser preciso. No hagas una lista de todos los lugares que te vienen a la mente con la esperanza de aparecer para más búsquedas. Google dice que “los límites de tu área total no deben extenderse más allá de unas dos horas de conducción desde el lugar donde se encuentra tu negocio”, por lo que normalmente uno o dos pueblos o ciudades cercanas son suficientes. Usa los códigos postales si necesitas ser más específico.Finalmente, borra tu dirección de la ficha.Ten en cuenta que esto sólo oculta la ubicación de tu negocio a los buscadores. Los clientes que busquen dentro de tu área de servicio podrán seguir encontrándote.Nota al margen. Si eres una empresa de servicios que presta servicios a todo un estado o país, cabe destacar que los paquetes de mapas, que contienen los perfiles de empresa de Google, sólo aparecen para las búsquedas locales. No es lógico tratar de optimizar el perfil de empresa para que aparezca en todas partes. No son para eso. El posicionamiento a nivel nacional o internacional es más bien un trabajo para tu sitio web actual. Si eres una tienda híbrida, sigue los mismos pasos que las empresas de servicios, pero no borres tu dirección. Los clientes que quieran visitar tu tienda u oficina aún necesitan esto.4. Agregar las horas de trabajoLa gente necesita saber cuándo está abierto y cerrado, así que todos deberían añadir sus horas de apertura. Eso probablemente suena obvio, pero hay toneladas de perfiles de empresas sin esta información esencial.Un restaurante sin horario de apertura.Para añadir tus horas, ve a Panel > Información > Añadir horasMarca los días en que estás abierto, luego añade las horas en que abres y cierras. Si cierras y luego vuelves a abrir más tarde en el día, como suele ser el caso en los restaurantes con servicio de comida y cena, haz clic en la opción “añadir horas” para añadir otra fila. Puedes hacer esto tantas veces como necesites.5. Fijar las horas de las vacacionesNadie quiere pasar tiempo viajando a tu negocio sólo para darse cuenta al llegar de que cerraste temprano porque es un día feriado. Es frustrante y una forma segura de ganar malas críticas que pueden impactar negativamente en el posicionamiento local.Arregla este problema antes de que se convierta en un problema añadiendo “horas especiales”.Sólo tienes que ir a Panel > Información > Añadir horas especialesComo en el caso del horario normal, puedes añadir múltiples horas de apertura y cierre para el mismo día con el botón “añadir horas”. Por ejemplo, tal vez abras por unas horas en la mañana en la víspera de Navidad, y luego vuelvas a abrir por la noche. En ese caso, tus horas especiales se verían así:Ten en cuenta que aunque tus horas de vacaciones sean las mismas que tus horas regulares, debe confirmarlas. Si no lo haces, los clientes potenciales verán la advertencia “[Las vacaciones] pueden afectar estos horarios” en tu ficha.6. Añadir tus datos de contactoLa mayoría de las empresas querrán añadir tanto su sitio web como su número de teléfono, lo que se puede hacer en la pestaña “Info”.Sólo debes dejarlos en blanco si no tienes un sitio web o no quieres que te llamen por teléfono. Como mínimo, debes añadir al menos uno de estos a tu perfil de empresa; de lo contrario, no hay forma de que los clientes se pongan en contacto contigo.7. Añadir fotosGoogle dice que las empresas con fotos reciben un 42% más de solicitudes de direcciones para llegar en coche y un 35% más de clics en el sitio web que las empresas sin fotos.Cualquiera puede añadir fotos a una ficha de Google Business, incluidos los clientes. Sin embargo, si agregas fotos tú mismo, te asegurarás de que tu anuncio tenga el mejor aspecto y que destaque por las razones correctas en los resultados de búsqueda.Google tiene muchas pautas para las fotos de negocios, pero aquí están las básicas:Añade tu logotipo: Cuanto más claro, mejor.Añade una foto de la portada: Escoge algo que muestre la personalidad de tu negocio.Añade más de 3 fotos del exterior. Tómalas desde múltiples ángulos a lo largo del día para ayudar a los clientes a localizar tu negocio en cualquier momento.Añade más de 3 fotos del interior. Captura la decoración y el ambiente de tu negocio para atraer a los clientes.Añade más de 3 fotos de productos. Muestra tus artículos más populares.Añade más de 3 fotos “trabajando”. Muestra a tu equipo ofreciendo servicios a los clientes.Añade más de 3 fotos de tu equipo. Humaniza tu negocio mostrando las personalidades de los miembros de tu equipo y del personal.Cuando se trata de fotos, más es aparentemente mejor. Un estudio de BrightLocal encontró que los negocios con más de 100 fotos reciben un 520% más de llamadas, 2.717% más solicitudes de dirección, y 1.065% más clics en el sitio web que el promedio de los negocios.Title: Promedio mensual de acciones de clientes por número de imágenesWebsite visits: Visitas al sitio webDirection requests: Solicitudes de direcciónCalls: Llamadas X axis: cantidad de imágenes en Google My BusinessPor supuesto, eso no significa que tengas que añadir cientos de fotos de golpe. Empieza con las pautas anteriores y añade más fotos con el tiempo.Sólo asegúrate de nombrarlas todas apropiadamente, por ejemplo, vestido-dama-de-honor.jpg, no IMG_574921.png.Lectura recomendada: SEO de imágenes: 12 consejos prácticos para un mayor tráfico orgánico8. Añadir productos y serviciosSi Google te da la opción de añadir productos y servicios a tu ficha de empresa, normalmente merece la pena hacerlo porque puede ayudar a que tu ficha de empresa aparezca en búsquedas aún más relevantes.Por ejemplo, esta empresa de ropa de novia incluyó en su ficha todos los vestidos de novia que ofrece como productos:Al parecer, como resultado, su lista aparece para consultas locales relacionadas con vestidos y marcas específicas como “Lillian West Wedding Dress Sheffield”:Sólo asegúrate de añadir todos los detalles relevantes a tus productos y servicios, incluyendo el nombre, precio, categoría, descripción y un enlace a la página del producto o servicio relacionado en tu sitio web. No dudes en copiar y pegar las descripciones y detalles de tu sitio web para acelerar este proceso. No hay ningún daño en hacer esto, y no causará problemas de contenido duplicado.9. Obtener más reseñasSegún el estudio de BrightLocal de 2020, las críticas son cada vez más importantes para las clasificaciones de los mapas locales. Y Google mismo afirma que “las críticas positivas y de alta calidad de tus clientes pueden mejorar la visibilidad de tu negocio y aumentar la probabilidad de que un comprador visite tu local”.Curiosamente, Google también destaca en sus resultados reseñas que contienen palabras clave relevantes para la consulta.KW: El mejor restaurante indio de Nottingham¿Pero cómo se consiguen las críticas?Aquí hay algunas maneras:Pregunta a los clientes. Si interactúas cara a cara con los clientes y sientes que tuvieron una experiencia positiva, pídeles que dejen una reseña.Crea y comparte un enlace de revisión. Muchos clientes no saben cómo dejar sus opiniones en Google. Google lo sabe, por lo que ofrece a todas las empresas la opción de crear un enlace de opinión para compartir. Encuéntralo en Mi empresa > Página principal > Obtener más opiniones.Crea tarjetas de “dejar una reseña”. Haz que se impriman tarjetas físicas que agradezcan a los clientes y que les pidan que dejen una reseña. Incluye tu enlace de reseña abreviado o un código QR para facilitar las cosas.Incluye tu enlace de reseña en tu firma de correo electrónico. Si se comunica con los clientes por correo electrónico, es una gran manera pasiva de ganar más reseñas.Sólo debes saber que va en contra de los términos de Google ofrecer a los clientes incentivos a cambio de críticas, así que mantente alejado de tácticas como ofrecer descuentos o cosas gratis a cambio.10. Responder a las preguntasLa gente podría tener preguntas sobre tu negocio que tu ficha no responde. Por este motivo, Google permite a los buscadores hacer preguntas sobre las empresas y obtener respuestas de los propietarios de las mismas y de la comunidad en general. Emily BridalwearEntiendo que pueden guardar los vestidos de novia que le compre hasta el día de la boda. ¿Puede decirme el costo del almacenamiento y si el almacenamiento incluye el planchado del vestido antes de la recogida? Y si es así, ¿hay algún costo adicional por este servicio?Emily Bridalwear (Dueña)Hola Lynn, muchas gracias por tu pregunta. Nosotros efectivamente guardamos nuestros vestidos de novia. Hay una tarifa única de 49 libras sólo por el almacenamiento. El planchado y la preparación del vestido es estándar para todas las novias y no hay costo. El almacenamiento no es un requisito para que nosotros preparemos el vestido. Por favor, hágame saber si hay algo más en lo que podamos ayudar.Muchas empresas no se mantienen al tanto de estas preguntas, dejando a otros la tarea de dar respuestas. Eso raramente es ideal y a menudo resulta en que los clientes terminan viendo información engañosa o inexacta sobre tu negocio.Por ejemplo, aquí hay alguien que pregunta si necesita reservar con antelación en un bar local, sólo para obtener respuestas contradictorias de la comunidad local:The Crafty DogHola, ¿necesitamos reservar una mesa para 5 personas o podemos ir hoy directamente. Seremos entre 5 y 6 personas? Gracias.No es necesario reservar.Probablemente llamaría para estar seguro.Sólo algo negativo puede resultar de esto. Las respuestas contradictorias probablemente desanimarán a esa persona y a otras a visitarnos o harán que clientes decepcionados y enfadados se presenten sin reserva. Son estas personas las que dejarán críticas negativas y destruirán tu SEO local.Por esa razón, recomendamos tomar un enfoque proactivo con preguntas y respuestas, y hay dos maneras de hacerlo:Activa las notificaciones de preguntas y respuestas. Recibe alertas cada vez que alguien haga una pregunta sobre tu negocio, y responde inmediatamente. No te preocupes por recibir muchas notificaciones molestas. A menos que tu negocio sea súper popular, las preguntas son bastante poco frecuentes. Ten en cuenta que estas alertas están habilitadas de forma predeterminada, pero vale la pena comprobarlo en la configuración.Proporciona respuestas a las preguntas frecuentes por adelantado. La mayoría de los sitios web tienen una página de preguntas frecuentes con respuestas a las preguntas más comunes. Puedes preguntar y responder a estas preguntas tú mismo en tu ficha de Google. Sólo tienes que asegurarte de que hayas accedido a la misma cuenta de Google que utilizas para Google My Business para que las respuestas se etiqueten como procedentes del propietario de la empresa.11. Publicar actualizacionesLas publicaciones te permiten compartir actualizaciones, ofertas y eventos relacionados con tu negocio. Piensa en ellas como actualizaciones de estado. Aparecen en una sección cerca de la parte inferior del panel de Google Business.Google también muestra ocasionalmente las publicaciones relevantes en los resultados del “map pack”.Por ejemplo, si buscamos “flores de simpatía de woodburn oregon”, Valley Pacific Floral aparece en el map pack. Y Google muestra un post del negocio que menciona el término “flores de la simpatía” en nuestra búsqueda.No está claro si este negocio posiciona por ese motivo o si se posicionaría de todas formas. De cualquier manera, ayuda a que el negocio se destaque en los SERPs y atraiga más atención de los clientes potenciales.Para crear una publicación, ve a la pestaña Publicaciones y haz clic en el botón para crear tu primera publicación.Aquí hay algunos consejos para tus mensajes:Usa buenas fotos. Asegúrate de que sean claras, bien iluminadas y bien enmarcadas.Inspira la acción con tu titular. Haz un esfuerzo para crear ofertas convincentes. No digas “Rebajas ahora” cuando podrías decir “50% de todo el fin de semana”.Sé preciso. Evita ser vago como la peste. No digas “¡Es la hora feliz!” cuando podrías decir “¡La hora feliz! ¡50% de descuento en todas las bebidas de 5-6 PM todos los sábados!Sé puntual. No esperes hasta el día de San Valentín para postear sobre tu especial de cena a la luz de las velas. La gente ya ha hecho planes para entonces.No publiques sólo por publicar. Muchas guías dicen que las publicaciones “envían señales positivas a Google” y “publican con la mayor frecuencia posible”. No estamos de acuerdo. No publiques a menos que tengas algo significativo que decir.Obtén más información sobre cómo crear excelentes publicaciones para empresas en esta breve guía de Google.12. Configurar los mensajesAl habilitar la mensajería, se añade un botón a tu ficha de Google Business para que los usuarios puedan enviarte mensajes directamente.Google también muestra el botón “Mensaje” en Google Maps.Para habilitar esta función, descarga la aplicación Google My Business para iOS o Android. Desde allí, accede a tu cuenta de Google, ve a la pestaña “Clientes”, luego a la pestaña “Mensajes” y pulsa la opción para “activar la mensajería”.Nota al margen. Google no usa tu número de teléfono para esto. Los mensajes aparecen en la aplicación, por lo que es seguro instalar la aplicación en un teléfono no comercial sin problemas de privacidad.13. Rellenar todo lo demásLa mayoría de las opciones importantes de Google My Business ya están completas, pero vale la pena tomarse un minuto para rellenar lo que quede. Esto variará ligeramente dependiendo de la categoría que hayas elegido para tu negocio.Por ejemplo, los restaurantes pueden incluir en su menú los platos más importantes, las peluquerías pueden utilizar un proveedor externo para que los buscadores puedan reservar citas directamente desde su perfil empresarial, etc.No te preocupes demasiado por “optimizar” los campos restantes. Sólo complétalos con la mayor precisión posible, y estarás listo para empezar.14. Optimizar tu sitio web¿Has notado que Google a veces muestra perfiles de empresas en los resultados de búsqueda cuando el sitio web menciona lo que estás buscando?KW: Rellenos dérmicosEn ninguna parte del perfil de esa empresa se menciona el uso de rellenos dérmicos. Aparece porque la frase está en su sitio web real, que Google recoge.Por esta razón, vale la pena mencionar los productos y servicios que se venden en tu sitio web.Por supuesto, la mayoría de los sitios web ya lo hacen hasta cierto punto. Si vendes vestidos de dama de honor, entonces tu sitio probablemente menciona eso. Sin embargo, es fácil pasar por alto productos y servicios importantes que la gente local podría estar buscando. Para encontrarlos, introduzca los productos y servicios que tu sitio web ya menciona en una herramienta de análisis de palabras clave como el Keywords Explorer, y luego revise el informe de la categoría “Also rank for”. Esto muestra otras palabras clave para las que los sitios web de mayor rango para tus palabras clave también se posicionan.Por ejemplo, en el sitio web comentado anteriormente ya se mencionan productos y servicios como los rellenos dérmicos, rellenos de emervel, rellenos de juvederm, rellenos de radiesse y mejoras de los labios.Peguemos eso en el Keywords Explorer de Ahrefs y revisemos el informe de “Also rank for”.Aquí vemos productos y servicios que el sitio web no menciona, como rellenos para las mejillas, relleno para debajo de los ojos, inyecciones para los labios y relleno para la línea de la mandíbula. Siempre es posible que el sitio web no mencione estos servicios porque no los ofrece, pero dados sus otros servicios, es muy probable que proporcione al menos alguno. Y si ese es el caso, probablemente deberían agregarlo a su sitio web.Por ejemplo, supongamos que este negocio ofrece inyecciones labiales pero se olvidó de hablar de eso en su sitio web.Si buscamos esta palabra clave, vemos un map pack en los resultados de la búsqueda.KW: Relleno de labiosEsto nos dice que la consulta tiene una intención local. En otras palabras, la gente que escribe esto en Google está buscando empresas locales que proporcionen este servicio. Debido a esto, podría valer la pena que el negocio mencione ese servicio en algún lugar de su sitio web.Ahora, es importante notar que esto no se trata de “incluir palabras clave al azar” en tu sitio web. Eso no funcionará. Simplemente hará que tu sitio web se vea poco profesional. Así que asegúrese de agregar productos y servicios a tu sitio web de una manera que tenga sentido, como:Reelaborando tu página web para mencionar más productos y servicios (no te vuelvas loco aquí, mantenlo natural y legible por encima de todo).Añadiendo nuevas páginas para productos o servicios individuales.Mencionando los productos y servicios adicionales que ofreces en una página de preguntas frecuentes.ConclusionesLa implementación de la mayoría de las optimizaciones anteriores no debería llevar más de media hora. Después de eso, tendrás un perfil de empresa bien preparado que no será víctima de los errores de optimización comunes que muchos propietarios de empresas cometen.Sin embargo, debes revisar todo periódicamente para mantener tu perfil exacto. (Una vez cada pocos meses debería funcionar).También es importante darse cuenta de que el propósito de tu perfil de empresa de Google es aparecer en las consultas con intención local. En otras palabras, consultas en las que los usuarios buscan empresas, productos o servicios en tu área local. Esto es algo que muchos propietarios de empresas no entienden. Si deseas que la gente encuentre tu empresa en todo el estado, en todo el país o a nivel internacional, deberás invertir en SEO más allá de Google My Business. Esto significa realizar una análisis de palabras clave para encontrar las palabras clave correctas, optimizar tus páginas con el SEO On-Page y crear enlaces para superar a la competencia.Aprende a hacerlo con nuestra guía completa de SEO local.¿Tienes preguntas sobre las optimizaciones anteriores? Háblame en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo optimizar tu ficha de Google My Business en 30 minutos"
    },
    {
      "level": "H2",
      "text": "1. Crear o reclamar tu perfil de empresa"
    },
    {
      "level": "H2",
      "text": "2. Establecer la categoría de tu negocio"
    },
    {
      "level": "H2",
      "text": "3. Seleccionar tu tipo de negocio"
    },
    {
      "level": "H2",
      "text": "4. Agregar las horas de trabajo"
    },
    {
      "level": "H2",
      "text": "5. Fijar las horas de las vacaciones"
    },
    {
      "level": "H2",
      "text": "6. Añadir tus datos de contacto"
    },
    {
      "level": "H2",
      "text": "7. Añadir fotos"
    },
    {
      "level": "H2",
      "text": "8. Añadir productos y servicios"
    },
    {
      "level": "H2",
      "text": "9. Obtener más reseñas"
    },
    {
      "level": "H2",
      "text": "10. Responder a las preguntas"
    },
    {
      "level": "H2",
      "text": "11. Publicar actualizaciones"
    },
    {
      "level": "H2",
      "text": "12. Configurar los mensajes"
    },
    {
      "level": "H2",
      "text": "13. Rellenar todo lo demás"
    },
    {
      "level": "H2",
      "text": "14. Optimizar tu sitio web"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}