{
  "url": "https://ahrefs.com/blog/es/google-pagerank/",
  "slug": "google-pagerank",
  "title": "El estado actual del PageRank de Google y su evolución",
  "description": "PageRank es un algoritmo que mejora la calidad de los resultados de búsqueda de Google utilizando enlaces para medir la importancia de una página web. Lleva usándose desde hace décadas, pero… ¿Ha cambiado? Te lo contamos.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido PageRank (PR) es un algoritmo de Google que mejora la calidad de los resultados de búsqueda utilizando enlaces para medir la importancia de una página web. Para ello, considera los enlaces como votos, partiendo de la base de que las páginas más importantes tienen más posibilidades de recibir más enlaces.PageRank fue creado por los cofundadores de Google, Sergey Brin y Larry Page en 1997, cuando estudiaban en la Universidad de Stanford, y su nombre es una referencia tanto a Larry Page como al término webpage. En muchos sentidos, es similar a una métrica llamada “factor de impacto” para las revistas, donde lo más citado = lo más importante. La diferencia está en que PageRank considera algunos votos más importantes que otros.Al utilizar los enlaces junto con el contenido para posicionar las páginas, los resultados de Google eran mejores que los de la competencia. Los enlaces se convirtieron en la moneda de cambio de la web.¿Quieres saber más sobre PageRank? Sigue leyendo.ContenidoGoogle todavía utiliza PageRankEn términos de SEO moderno, PageRank es uno de los algoritmos que engloban Experiencia, Pericia, Autoridad y Confiabilidad (E-E-A-T, del inglés Experience Expertise Authoritativeness Trustworthiness).Los algoritmos de Google identifican señales sobre las páginas que se correlacionan con la fiabilidad y la autoridad. La más conocida de estas señales es PageRank, que utiliza enlaces en la web para entender la autoridad.Fuente: Cómo Google combate la desinformaciónTambién hemos tenido la confirmación de representantes de Google como Gary Illyes, quien dijo que Google todavía utiliza PageRank y que los enlaces se utilizan para E-A-T (ahora E-E-A-T).DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) February 9, 2017.@Marie_Haynes asked @methode about EAT. He said it’s largely based on links and mentions on authoritative sites. #SMX— Patrick Stox (@patrickstox) March 15, 2018Cuando realicé un estudio para medir el impacto de los enlaces y los eliminé utilizando la herramienta de desautorización, la caída fue evidente. Los enlaces siguen siendo importantes para el posicionamiento.PageRank también ha sido un factor confirmado en lo que respecta al crawl budget. Obviamente, Google quiere rastrear las páginas importantes con más frecuencia.PageRank también es una señal de canonicalización. Las páginas con un PageRank más alto tienen más posibilidades de ser elegidas como la versión canónica que se indexa y se muestra a los usuarios.Curiosidades matemáticas: por qué la fórmula de PageRank era erróneaDato curioso: la fórmula publicada en el documento original sobre PageRank era errónea. Veamos por qué.El PageRank se describió en el paper original como una distribución de probabilidad. Es decir, la posibilidad de estar en una página determinada de la web. Esto significa que, si se suma el PageRank de todas las páginas de la web, se obtiene un total de 1.Aquí está la fórmula completa del PageRank del artículo original publicado en 1997:PR(A) = (1-d) + d (PR(T1)/C(T1) + … + PR(Tn)/C(Tn))Simplificando la fórmula un poco, y suponiendo que el factor de amortiguamiento (d) es 0,85, como menciona Google en el artículo (en breve explicaré qué es el factor de amortiguamiento):PageRank de una página = 0,15 + 0,85 (una parte del PageRank de cada página que enlaza dividida entre sus enlaces salientes)En el documento, dicen que la suma del PageRank de cada página debe ser igual a 1, pero eso no es posible si se utiliza la fórmula del paper. Cada página tendría un PageRank mínimo de 0,15 (1-d). Unas pocas páginas harían que el total fuera superior a 1. No se puede tener una probabilidad superior al 100%. Algo está mal.En realidad, la fórmula debería dividir ese (1-d) por el número de páginas en internet para que funcione como se describe. Sería:PageRank de una página = (0,15 / número de páginas en internet) + 0,85 (una parte del PageRank de cada página que enlaza dividida entre sus enlaces salientes)Sigue siendo complicado, así que vamos a ver si puedo explicarlo con algunos gráficos.1. Una página recibe una puntuación PageRank inicial basada en los enlaces que apuntan a ella. Supongamos que tengo cinco páginas sin enlaces y cada una obtiene un PageRank de (1/5) o 0,2.2. Esta puntuación se distribuye a otras páginas a través de los enlaces de la página. Si añado enlaces a las cinco páginas anteriores y calculo su PageRank, obtengo lo siguiente:Te darás cuenta de que las puntuaciones favorecen a las páginas con más enlaces hacia ellas.3. Este cálculo se repite a medida que Google rastrea la web. Si vuelvo a calcular el PageRank (lo que se llama una iteración), verás que las puntuaciones cambian. Son las mismas páginas con los mismos enlaces, pero el PageRank base de cada página ha cambiado, por lo que el PageRank final es distinto.La fórmula PageRank también tiene un “factor de amortiguamiento”, la “d” de la fórmula, que simula la probabilidad de que un usuario aleatorio siga haciendo clic en los enlaces mientras navega por la web.Es decir, la probabilidad de que hagas clic en un enlace en la primera página que visitas es razonablemente alta, pero la probabilidad de que hagas clic en un enlace de la página siguiente es ligeramente inferior, y así sucesivamente.Si una página potente enlaza directamente con otra, el valor transmitido va a ser alto. Si el enlace está a cuatro clics de distancia, el valor transferido desde esa página potente será mucho más bajo debido al factor de amortiguamiento.Historia del PageRankLa primera patente de PageRank se presentó el 9 de enero de 1998. Se titulaba Método para el posicionamiento de nodos en una base de datos enlazada. Esta patente expiró el 9 de enero de 2018 y no se renovó.Google hizo público PageRank por primera vez cuando se lanzó el Google Directory el 15 de marzo de 2000. Se trataba de una versión del Open Directory Project, pero ordenada por PageRank. El directorio se cerró el 25 de julio de 2011.Fue el 11 de diciembre de 2000 cuando Google lanzó PageRank en la barra de herramientas de Google, que era la versión de PageRank con la que más se obsesionaron los SEO.Así era el PageRank cuando se incluyó en la barra de herramientas de Google.PageRank se actualizó por última vez en la barra de herramientas el 6 de diciembre de 2013 y, finalmente, se eliminó el 7 de marzo de 2016.El PageRank mostrado en la barra de herramientas era un poco diferente. Utilizaba un sistema de numeración sencillo del 0 al 10 para representar el PageRank, pero el PageRank en sí es una escala logarítmica que, cada vez que se alcanza un número más alto, se complica aún más.PageRank llegó incluso a Google Sitemaps (ahora conocido como Google Search Console) el 17 de noviembre de 2005. Se mostraba en categorías de alto, medio, bajo o nulo. Esta función se eliminó el 15 de octubre de 2009.Link spamA lo largo de los años, los SEO han abusado del sistema de diversas formas para conseguir más PageRank y mejores rankings. Google tiene toda una lista de políticas de spam que incluyen:La compra o venta de enlaces (intercambio de enlaces a cambio de dinero, bienes, productos o servicios).Intercambio excesivo de enlaces.Utilizar software para crear enlaces automáticamente.Exigir enlaces como parte de unas condiciones de servicio, contrato u otro acuerdo.Anuncios de texto que no utilicen atributos nofollow o sponsored.Publirreportajes o publicidad nativa que incluyan enlaces que pasen el crédito del ranking.Artículos, guest posts o blogs con enlaces de texto ancla optimizados.Directorios de baja calidad o enlaces de marcadores sociales.Enlaces ricos en palabras clave, ocultos o de baja calidad incrustados en widgets que se colocan en otros sitios web.Enlaces distribuidos ampliamente en pies de página o plantillas (por ejemplo, la codificación de un enlace a tu web en el tema WordPress que vendes o regalas).Comentarios en foros con enlaces optimizados en el post o en la firma.Los sistemas para combatir el spam de enlaces han evolucionado a lo largo de los años. Veamos algunas de las principales actualizaciones.NofollowEl 18 de enero de 2005, Google anunció que se había asociado con otros motores de búsqueda para introducir el atributo rel=“nofollow”. Se animaba a los usuarios a añadir el atributo nofollow a los comentarios de los blogs, a los trackbacks y a las listas de referencias para ayudar a combatir el spam.Este es un extracto de la declaración oficial de Google sobre la introducción de nofollow:Si eres blogger (o lees blogs), estarás muy familiarizado con la gente que intenta subir el ranking de sus propias webs en los buscadores enviando comentarios enlazados a blogs como “Visita mi web de descuentos farmacéuticos”. Esto se llama spam de comentarios, a nosotros tampoco nos gusta y hemos estado probando una etiqueta nueva que lo bloquea. A partir de ahora, cuando Google vea el atributo (rel=“nofollow”) en los hipervínculos, esos enlaces no obtendrán ningún crédito cuando posicionemos los sitios web en nuestros resultados de búsqueda.Casi todos los sistemas de hoy en día utilizan el atributo nofollow en los enlaces de los comentarios de los blogs.Los SEO incluso empezamos a abusar del nofollow… por supuesto que lo hicimos. Nofollow se utilizó para “esculpir” PageRank, donde la gente indicaría algunos enlaces como nofollow en sus páginas para hacer otros enlaces más fuertes. Con el tiempo, Google cambió el sistema para evitar este abuso.En 2009, Matt Cutts de Google confirmó que esto ya no funciona y que el PageRank se distribuiría a través de los enlaces incluso si un atributo nofollow estaba presente (pero solo pasaba a través del enlace followed).Google agregó un par de atributos de enlace más que son versiones más específicas del atributo nofollow el 10 de septiembre de 2019. Estos incluyen rel=“ugc” destinado a identificar contenido generado por el usuario y rel=“sponsored” destinado a identificar enlaces que fueron pagados o afiliados.Algoritmos contra el spam de enlacesA medida que los SEO encontraban formas nuevas de jugar con los enlaces, Google trabajaba en la creación de algoritmos nuevos para detectar este spam.Cuando el algoritmo Penguin original se lanzó el 24 de abril de 2012, perjudicó a muchas páginas web y a sus propietarios. Google ofreció a los propietarios de webs una forma de recuperarse a finales de ese mismo año con la introducción de la herramienta de desautorización de enlaces el 16 de octubre de 2012.Cuando Penguin 4.0 se lanzó el 23 de septiembre de 2016, supuso un cambio positivo en la forma en que Google gestionaba el spam de enlaces. En vez de perjudicar a las webs, empezó a devaluar los enlaces spam. Esto también significó que la mayoría de los sitios ya no necesitaban usar la herramienta de desautorización.Google lanzó el primer Link Spam Update el 26 de julio de 2021. Esto evolucionó recientemente y una actualización de esta lucha contra el spam el 14 de diciembre de 2022 anunció el uso de un sistema de detección basado en IA llamado SpamBrain para neutralizar el valor de los enlaces no naturales.Cómo ha cambiado el PageRankLa versión original de PageRank no se utiliza desde 2006, según un extrabajador de Google, quien indica que el algoritmo fue sustituido por otro que consume menos recursos.Lo sustituyeron en 2006 por un algoritmo que ofrece resultados más o menos similares, pero cuyo cálculo es mucho más rápido. El algoritmo de sustitución es el número que aparece en la barra de herramientas y que Google denomina como PageRank (incluso tiene un nombre similar, por lo que la afirmación de Google no es técnicamente incorrecta). Ambos algoritmos son O(N log N), pero la sustitución tiene una constante mucho menor en el factor log N porque elimina la necesidad de iterar hasta que el algoritmo converge. Esto es bastante importante, ya que la web creció de ~1-10M páginas a +150MM.¿Recuerdas esas iteraciones y cómo PageRank cambiaba con cada iteración? Parece que Google ha simplificado dicho sistema.¿Qué más ha cambiado?Algunos enlaces valen más que otrosEn vez de repartir el PageRank por igual entre todos los enlaces de una página, algunos enlaces se valoran más que otros. Las patentes especulan con la posibilidad de que Google haya pasado de un modelo de navegación aleatoria (en el que un usuario puede ir a cualquier enlace) a un modelo de navegación razonable (en el que es más probable que se haga clic en algunos enlaces que en otros, por lo que tienen más peso).Algunos enlaces se ignoranSe han puesto en marcha varios sistemas para ignorar el valor de determinados enlaces. Ya hemos hablado de algunos de ellos, entre los que se incluyen:Nofollow, UGC y atributos patrocinados.El algoritmo Penguin de Google.La herramienta de desautorización.Actualizaciones de Link Spam.Google tampoco tendrá en cuenta los enlaces de las páginas bloqueadas por robots.txt. No podrá rastrear estas páginas para ver los enlaces. Es posible que este sistema se estableciera desde el principio.Algunos enlaces están consolidadosGoogle dispone de un sistema de canonicalización que le ayuda a determinar qué versión de una página debe indexarse y a consolidar las señales de las páginas duplicadas en esa versión principal.Los elementos de enlace canónico se introdujeron el 12 de febrero de 2009 y permiten a los usuarios especificar su versión preferida.Originalmente, se decía que los redireccionamientos transmitían la misma cantidad de PageRank que un enlace. Sin embargo, en algún momento, este sistema cambió y actualmente no se pierde PageRank.Todavía hay aspectos que se desconocen un pocoCuando las páginas se marcan como noindex, no sabemos exactamente cómo Google trata los enlaces. Incluso los Googlers tienen declaraciones contradictorias.Según John Mueller, las páginas marcadas como noindex acabarán siendo tratadas como noindex, nofollow. Esto significa que los enlaces dejarán de tener valor.Según Gary, Googlebot descubrirá y seguirá los enlaces mientras una página siga teniendo enlaces hacia ella.Estos argumentos no son necesariamente contradictorios. Pero si nos guiamos por la afirmación de Gary, podría pasar mucho tiempo antes de que Google deje de rastrear y contar los enlaces… Quizás nunca.¿Se puede seguir comprobando el PageRank?Actualmente, no hay forma de ver el PageRank de Google.URL Rating (UR) es una buena métrica de sustitución para PageRank porque tiene mucho en común con la fórmula de PageRank. Muestra la fuerza del perfil de enlaces de una página en una escala de 100 puntos. Cuanto mayor es el número, más fuerte es el perfil de enlaces.Tanto PageRank como UR tienen en cuenta los enlaces internos y externos a la hora de ser calculados. Muchas de las otras métricas de fuerza utilizadas en la industria ignoran por completo los enlaces internos. Diría que los creadores de enlaces deberían fijarse más en el UR que en métricas como el DR, que solo tiene en cuenta los enlaces de otros sitios.Sin embargo, no es exactamente lo mismo. UR ignora el valor de algunos enlaces y no cuenta los enlaces nofollow. No sabemos exactamente qué enlaces ignora Google y no sabemos qué enlaces pueden haber desautorizado los usuarios, lo que repercutirá en el cálculo del PageRank de Google. También es posible que tomemos decisiones diferentes sobre cómo tratar algunas de las señales de canonicalización, como los elementos de enlace canónicos y las redirecciones.Por tanto, nuestro consejo es que lo utilices, pero que sepas que es posible que no sea exactamente igual que el sistema de Google.También tenemos Page Rating (PR) en el Page Explorer de Site Audit. Esto es similar a un cálculo de PageRank interno y puede ser útil para ver cuáles son las páginas más fuertes de tu sitio basándose en tu estructura de enlaces internos.Cómo mejorar tu PageRankComo el PageRank se basa en los enlaces, para aumentar tu PageRank necesitas mejorar los enlaces. Veamos qué opciones tienes.Redirige enlaces rotosRedirigir páginas antiguas de tu web a páginas nuevas relevantes puede ayudar a recuperar y consolidar señales como el PageRank. Las webs cambian con el tiempo y parece que a la gente no le gusta implementar redireccionamientos apropiados. Esta puede ser la forma más fácil de conseguirlo, ya que esos enlaces ya apuntan a ti, pero en realidad no te benefician.Aquí te explicamos cómo encontrar esas oportunidades:Pega tu dominio en el Site Explorer (también accesible en la versión gratuita de Ahrefs Webmaster Tools).Dirígete al informe de Mejor por enlaces.Añade un filtro de respuesta HTTP “404 no encontrado”Suelo ordenarlo por “Dominios de referencia”.Usa estas páginas y redirígelas a las páginas actuales de tu web. Si no sabes exactamente dónde van o no tienes tiempo, tengo un script de redirección automática que puede ayudarte. Busca el contenido antiguo en archive.org y lo compara con el contenido actual más cercano de tu web. Aquí es donde es posible que quieras redirigir las páginas.Enlaces internosLos backlinks no siempre están bajo tu control. La gente puede enlazar a cualquier página de tu web que elijan y pueden utilizar cualquier texto de anclaje que les dé la gana.Los enlaces internos son otra cosa: tienes total control sobre ellos.Enlaza internamente hacia donde tenga sentido. Por ejemplo, es posible que quieras enlazar más a las páginas que son más importantes para ti.Tenemos una herramienta dentro de Site Audit llamada Internal Link Opportunities que te ayuda a localizar rápidamente estas oportunidades.Esta herramienta busca menciones de palabras clave con las que ya está posicionado tu sitio. A continuación, las sugiere como oportunidades de enlaces internos contextuales.Por ejemplo, la herramienta muestra una mención de “navegación facetada” en nuestra guía de contenido duplicado. Como Site Audit sabe que tenemos una página sobre navegación facetada, sugiere que añadamos un enlace interno a esa página.Enlaces externosTambién puedes conseguir más enlaces desde otros sitios hacia el tuyo para aumentar tu PageRank. Ya tenemos muchas guías sobre link building. Algunas de mis favoritas son:La guía para principiantes al link buildingCómo realizar un análisis de los enlaces de la competencia en 3 pasos9 estrategias fáciles de link buildingReflexiones finalesAunque el PageRank ha cambiado, sabemos que Google sigue utilizándolo. Puede que no conozcamos todos los detalles o todo lo que implica, pero sigue siendo fácil ver el impacto de los enlaces.Además, parece que Google no puede dejar de utilizar los enlaces y el PageRank. En una ocasión, experimentó con no utilizar enlaces en su algoritmo y decidió no hacerlo.No tenemos una versión como esa expuesta al público, pero tenemos nuestros propios experimentos como esos internamente y la calidad es mucho, mucho peor. Resulta que los backlinks, a pesar de que hay algo de ruido y ciertamente mucho spam, en su mayor parte siguen siendo muy buenos en términos de calidad de los resultados de búsqueda.Hemos jugado con la idea de desactivar la relevancia de los backlinks y, al menos por ahora, la relevancia de los backlinks sigue siendo de gran ayuda para asegurarnos de que obtenemos los mejores resultados de búsqueda, los más relevantes y los más temáticos.Fuente: YouTube (Google Search Central)Si tienes alguna pregunta estamos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "El estado actual del PageRank de Google y su evolución"
    },
    {
      "level": "H2",
      "text": "Google todavía utiliza PageRank"
    },
    {
      "level": "H2",
      "text": "Curiosidades matemáticas: por qué la fórmula de PageRank era errónea"
    },
    {
      "level": "H2",
      "text": "Historia del PageRank"
    },
    {
      "level": "H3",
      "text": "Link spam"
    },
    {
      "level": "H3",
      "text": "Nofollow"
    },
    {
      "level": "H3",
      "text": "Algoritmos contra el spam de enlaces"
    },
    {
      "level": "H2",
      "text": "Cómo ha cambiado el PageRank"
    },
    {
      "level": "H3",
      "text": "Algunos enlaces valen más que otros"
    },
    {
      "level": "H3",
      "text": "Algunos enlaces se ignoran"
    },
    {
      "level": "H3",
      "text": "Algunos enlaces están consolidados"
    },
    {
      "level": "H3",
      "text": "Todavía hay aspectos que se desconocen un poco"
    },
    {
      "level": "H2",
      "text": "¿Se puede seguir comprobando el PageRank?"
    },
    {
      "level": "H2",
      "text": "Cómo mejorar tu PageRank"
    },
    {
      "level": "H3",
      "text": "Redirige enlaces rotos"
    },
    {
      "level": "H3",
      "text": "Enlaces internos"
    },
    {
      "level": "H3",
      "text": "Enlaces externos"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Patrick Stox"
}