{
  "url": "https://ahrefs.com/blog/es/growth-marketing/",
  "slug": "growth-marketing",
  "title": "¿Qué es el Growth Marketing? Una guía para principiantes",
  "description": "¿Qué es el growth marketing y cómo funciona? ¿Es adecuado para tu negocio? Aprende todo lo que necesitas saber en este post.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido DropBox es famoso por acelerar su crecimiento apoyándose en su producto—regaló espacio de almacenamiento por cada nuevo usuario referido que recibía.Sean Ellis, por aquel entonces el primer profesional del marketing en Dropbox, acuñó el término “growth hacking” para describir su estrategia.Poco tiempo después, muchas empresas tecnológicas de rápido crecimiento, como Uber, Airbnb y Pinterest comenzaron a desarrollar la disciplina conocida como growth marketing, o marketing enfocado al crecimiento.En este post aprenderás todo sobre el growth marketing y cómo sacarle el máximo provecho.¿Qué es el growth marketing?El growth marketing es un conjunto de estrategias colaborativas de marketing que usa la experimentación y la medición constante para descubrir oportunidades de crecimiento para una empresa.Este tipo de marketing utiliza una aproximación holística y guiada por datos. Se enfoca en el embudo completo (en lugar de solo en la parte superior del embudo o funnel) y aplica el método científico—formulando hipótesis, poniendo a prueba estas hipótesis, después refinándolas o eliminándolas.Conocido originalmente como growth hacking, la intención de Sean era que el término significara “generación de ideas de forma creativa y colaborativa y resolución de problemas a retos complejos”.Sin embargo, los profesionales del growth que siguieron se enfocaron demasiado en el aspecto del “hacking”, tratándolo como la “bala de plata” para resolver todos los problemas en marketing. El término “growth marketing” se creó para reenfocar la disciplina.¿Por qué es importante el growth marketing?El marketing tradicional tiene dos problemas principales:La colaboración cruzada entre equipos es (casi) inexistenteLos equipos de marketing no suelen tener ni idea de lo que está funcionandoVamos a ver los dos en más detalle.1. La colaboración cruzada entre equipos es (casi) inexistenteLas empresas a menudo estructuran los equipos por capas del embudo de marketing.Hablando en general:El equipo de marketing es responsable de la parte superior del embudo—descubrimiento e interésEl equipo de ventas es responsable de los ingresos—consideración y conversión a cliente.El equipo de producto es responsable de la retención—fidelización y recomendación.Después, cada equipo recibe una métrica que mide el éxito en cada fase del embudo, Pero el problema es que el equipo pasa a optimizar de acuerdo a esas métricas… a expensas del resto.Por ejemplo, un objetivo típico para los equipos de marketing es el número de leads. Pero estos leads pueden ser de baja calidad, lo que después impacta en otros equipos (por ejemplo, los leads de baja calidad son más difíciles de convertir y retener).Ese es solo un problema. Otro problema es que estos equipos rara vez se comunican y colaboran entre ellos. En estos escenarios, por ejemplo, los equipos de producto pierden la oportunidad de aprovechar la experiencia de otros equipos de marketing sobre cómo llevar al mercado nuevas funcionalidades. Esto de convertir en silos los departamentos es una de las razones por las que el innovador programa de referidos no habría podido nacer en la mayoría de empresas.El growth marketing resuelve esto poniendo el foco en el embudo en su conjunto.2. Los equipos de marketing no suelen tener ni idea de qué está funcionandoEl marketing tradicional es difícil de medir. El famoso mercader estadounidense John Wanamaker hizo una broma: “desperdicio la mitad del dinero que me gasto en publicidad; el problema es que no sé qué mitad”.Sin apenas idea de lo que ha funcionado, los marketeros acaban con campañas y tácticas basadas en su instinto y (con suerte) conjeturas con fundamento. Esto crea el deseo de una metodología rígida—una que podría generar ideas de experimentos, medir si funcionan y redirigir/eliminar recursos de los que no lo están haciendo a los que sí lo hacen.El growth marketing es esa metodología.¿Cómo funciona el growth marketing?Según el libro de Sean, “Hacking Growth” (en español) los elementos centrales del growth marketing son:La creación de un equipo multidisciplinar que combine marketing y producto.El uso de investigación cualitativa y el análisis de datos cuantitativos (para conseguir información sobre los comportamientos del consumidor).La generación y prueba de ideas (y el uso de métricas para evaluar si funcionan).1. La creación de un equipo multidisciplinarYa que el objetivo de un equipo de growth marketing es trabajar en el funnel completo, el equipo necesita personas que tengan algo más que habilidades de marketing. Sean sugiere que el equipo debería estar formado por:Growth lead (responsable de crecimiento) – Elige el área clave en que enfocarse (cualquier parte del embudo), elige las métricas que medir y gestiona al equipo.Product manager (responsable de producto) – Gestiona el producto y sus cambios.Ingeniero de software – Trabaja en el producto y realiza experimentos.Especialista en Marketing – Entiende los distintos canales de marketing y cómo realizar los experimentos.Analista de datos – Diseña experimentos, extrae datos y aporta información y conocimiento.Diseñador de producto – Trabaja en el producto y diseña una mejor experiencia.2. Investigación cualitativa y datos cuantitativosLos datos son clave para el proceso de growth marketing. Deberían ser fáciles de acceder y analizar. Además, deberían ser precisos.Sean escribe: Es esencial que tu equipo tenga datos de cada parte de la experiencia de cliente—mucho más allá de cuán frecuentemente visitan tu web y cuánto permanecen en ella—para que puedan analizarse a un nivel granular para identificar cómo usan realmente tu producto, frente a cómo has planeado que se use. Esto significa que los profesionales de marketing, científicos de datos e ingenieros deben trabajar juntos para añadir la capacidad de seguimiento adecuada a las páginas web, aplicaciones móviles, sistemas de puntos de venta, email marketing y bases de datos de clientes. Una vez puestas en marcha las medidas de seguimiento, hay que unir las distintas fuentes de información del usuario para darte una imagen robusta y detallada del comportamiento del usuario que tu equipo de datos pueda analizar. Lo que quieres es crear lo que se suele llamar un data lake/data warehouse: una ubicación única donde toda la información de cliente se almacena y donde puedas realmente sumergirte y descubrir grupos distintos de usuarios que puede que usen el producto de una forma diferente a la de otros grupos. Sean Ellis, Growth Marketer Seanellis.me3. Generación y testeo de ideasLos equipos de growth marketing pasan por lo que se conoce como el ciclo del growth hacking.Aquí tienes cómo funciona el proceso:Analizar – El growth lead trabaja con el analista de datos para descubrir áreas de oportunidades para crecer. Esto podría ser un área cualquiera del embudo en que enfocarse. Por ejemplo, pueden revisar los eventos o páginas que provocan que el usuario se dé de baja o abandone el producto.Idear – Los integrantes del equipo de growth marketing (incluyendo al product manager, ingeniero de software, etc.) aportan ideas para mejorar el área de foco con un pipeline de ideas.Priorizar – Las ideas se puntúan en función de su Impacto, Confianza y Facilidad de Ejecución (ICE).Probar – Se hace el experimento y los resultados se analizan tras un determinado período de tiempo.Después se repite el ciclo.¿Es el growth marketing adecuado para ti?No hay duda de que el growth marketing funciona. Después de todo, muchas empresas han tenido éxito usándolo. Facebook, Twitter, DropBox y Airbnb son ejemplos más que conocidos.Sin embargo, mira de cerca y te darás cuenta de que la mayoría de empresas que han creado programas de growth marketing generalmente:Están orientadas al consumidor final.Han levantado rondas de inversión de gran cantidad de dinero.Tienen productos que pueden generar viralidad, es decir, hacer que los usuarios atraigan a más usuarios.El growth marketing está probablemente fuera del alcance de la mayoría de empresas pequeñas. Lars Lofgren, que ha construido varios equipos de crecimiento por su cuenta, explica por qué en este post. Aquí va un resumen rápido:La probabilidad es difícil de entender – La mayoría de personas no entienden la probabilidad ni la estadística y terminarán realizando tests erróneos. Los tests mal ejecutados llevan a resultados equivocados, lo que lleva a un programa pobre.La mayoría de empresas no tienen datos suficientes – Se necesitan elevados volúmenes de datos para tests precisos, pero la mayoría de empresas nunca alcanzará ese volumen.Los equipos de growth son demasiado caros – La cantidad de dinero que gastas en formar un equipo de growth podría fácilmente permitirte construir un blog que posicione bien en Google y genere mucho tráfico.Los equipos de growth tienen un potencial de ingresos limitado – Hay un techo en cuánto pueden mejorar las tasas de conversión. ¿Merece la pena gastar tanto dinero en optimizar esas tasas?Si el growth marketing no es adecuado para tu empresa, ¿qué deberías hacer en su lugar?La alternativa: Marketing con una mentalidad de crecimientoLars escribió en su post:“Un canal de marketing adecuadamente escalado puede multiplicar por 10 tu negocio. ¿El mejor de los casos para un equipo que optimice tu funnel? El triple. Invertiría mejor mi tiempo en una estrategia que multiplique por 10 que en una que triplique. Eso es exactamente lo que hicimos en Ahrefs.Nuestro principal canal de adquisición de clientes es el marketing de contenidos. Producimos contenido regularmente en nuestro blog y canal de YouTube. En los últimos años hemos construido este canal y continuamos invirtiendo en el mismo.Aunque nada de lo que hacemos es en realidad único, añadimos un giro a nuestra estrategia de marketing de contenidos. Al igual que el growth marketing, nuestro contenido se enfoca a todo el funnel. En lugar de tener piezas de contenido dedicadas para cada fase del embudo de marketing, cada publicación de nuestro contenido sirve para:Adquirir nuevos clientes.Generar interés en nuestros productos educando a los clientes en lo que hace nuestro producto.Retener a nuestros clientes formándoles en el uso de nuestro producto.Aquí va un ejemplo. Link building es un tema que se busca mucho. Recibe alrededor de 31.000 búsquedas al mes en Google:También es imposible hacer link building bien sin una herramienta de análisis de enlaces—que es algo que ofrecemos. Así que, en nuestra guía de link building, hablamos de forma natural de nuestro producto:Esta única pieza de contenido toca todas las partes del embudo:Adquiere nuevos leads y clientes – Al posicionar por un tema que mucha gente busca en Google, generamos tráfico de forma consistente.Genera interés en nuestro producto – Nuestro contenido enseña a los potenciales clientes cómo hacer link building y cómo hacerlo con nuestro producto.Retener clientes – Nuestro contenido también enseña a los clientes existentes cómo conseguir enlaces con nuestro producto.¿Cómo lo hacemos? Aquí va una explicación rápida de nuestra estrategia.1. Enfócate en temas con potencial de tráfico de búsquedaPara posicionarte en Google, necesitas tratar temas que la gente ya esté buscando. Puedes encontrar estos temas usando herramientas de investigación de palabras clave como Keywords Explorer de Ahrefs.Introduce una keyword relevante y te generará miles de ideas:Después, acota la lista usando el “potencial de negocio”.Esto te permitirá enfocarte en temas que generen crecimiento, no métricas de vanidad como el tráfico.2. Crea contenido de alta calidad que se merezca posicionarPara posicionarte en los mejores puestos de Google, necesitarás crear contenido que se merezca posicionar. Puedes ver este vídeo para aprender cómo.Lecturas complementariasCreación de Contenido: La Guía Completa para Principiantes¿Qué es el contenido SEO? Cómo escribir contenido que se posicionaCómo Escribir un Post para Blog en 9 Pasos (que la Gente Quiere Realmente Leer) - en inglés3. Promociona el contenidoSimplemente publicar contenido no implica que te descubran de forma automática. Tienes que darle un empujón y mostrárselo a la gente que le importa. Promociona tu contenido siguiendo esta checklist.Reflexiones finalesEl proceso de growth marketing puede ser difícil de implementar. Pero incluso si no lo estás haciendo, los elementos siguen siendo de ayuda. Experimentar, abordar el embudo al completo—todas son ideas que puedes aplicar en tu propia empresa.Si te interesa aprender cómo poner en marcha el growth marketing te recomiendo estos recursos:Hacking Growth (libro, aquí en español)ReforgeGrowthHackersGrowth Marketing Handbook (el Manual del Growth Marketing)¿Me he dejado algo sobre growth marketing? Dímelo por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software. En esta guía te cuenta cómo hacer marketing en WhatsApp. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es el Growth Marketing? Una guía para principiantes"
    },
    {
      "level": "H2",
      "text": "¿Qué es el growth marketing?"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante el growth marketing?"
    },
    {
      "level": "H3",
      "text": "1. La colaboración cruzada entre equipos es (casi) inexistente"
    },
    {
      "level": "H3",
      "text": "2. Los equipos de marketing no suelen tener ni idea de qué está funcionando"
    },
    {
      "level": "H2",
      "text": "¿Cómo funciona el growth marketing?"
    },
    {
      "level": "H3",
      "text": "1. La creación de un equipo multidisciplinar"
    },
    {
      "level": "H3",
      "text": "2. Investigación cualitativa y datos cuantitativos"
    },
    {
      "level": "H3",
      "text": "3. Generación y testeo de ideas"
    },
    {
      "level": "H2",
      "text": "¿Es el growth marketing adecuado para ti?"
    },
    {
      "level": "H2",
      "text": "La alternativa: Marketing con una mentalidad de crecimiento"
    },
    {
      "level": "H3",
      "text": "1. Enfócate en temas con potencial de tráfico de búsqueda"
    },
    {
      "level": "H3",
      "text": "2. Crea contenido de alta calidad que se merezca posicionar"
    },
    {
      "level": "H3",
      "text": "3. Promociona el contenido"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}