{
  "url": "https://ahrefs.com/blog/es/gsc-gkp-estudio-volumen-busquedas/",
  "slug": "gsc-gkp-estudio-volumen-busquedas",
  "title": "GSC vs. GKP: Comparando los Volúmenes de Búsqueda de 72.000 Keywords [Un Estudio de Ahrefs]",
  "description": "¿Cuánto se parecen las cifras de volumen de Google Search Console y Keyword Planner? Realizamos un estudio de 72.635 keywords para averiguarlo.",
  "content": "Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía. Contenido Hay dos fuentes de datos de volumen de búsqueda de keywords que vienen directamente de Google: Google Search Console (GSC) y Google Keyword Planner (GKP). Hemos decidido comparar los números entre los dos y ver cuánto se parecen.GSC se considera generalmente la “fuente única de la verdad” en lo que respecta a datos precisos de palabras clave, porque muestra el número exacto de veces que tu página apareció en los resultados de Google en una palabra clave específica.Así que si tu página se posiciona consistentemente en la primera página de Google para una consulta dada, el número de impresiones de esa consulta en GSC debería reflejar de forma precisa el volumen de búsqueda (en la mayoría de los casos).En lo que respecta a GKP, sus datos de volumen de búsqueda se sabe que son mucho menos precisos. Sobre todo porque:Agrupa palabras clave con un significado parecido.Redondea los volúmenes de búsqueda en grupos.Y, a pesar de eso, muchos profesionales del SEO están perfectamente felices con los volúmenes de búsqueda que consiguen de GKP y los consideran bastante precisos.Así que hemos decidido realizar un pequeño experimento y estudiar cómo quedan los volúmenes de Google Keyword Planner frente a la “fuente única de la verdad”, también conocida como GSC.Comparando los volúmenes de búsqueda entre GSC y GKPEn este experimento tomamos 72.635 palabras clave aleatorias en el rango de volumen de 1.000 a 10.000 búsquedas. Después comparamos el número de “impresiones” en GSC con los datos de volúmenes de GKP (para el mismo mes).Lo primero que descubrimos es que GKP casi siempre sobrevalora el volumen de búsqueda “real”:Pero la pregunta de verdad es, ¿cuánto? Después de todo, si solo sobrevalora los volúmenes de búsqueda un poco, ¿dónde está el problema?Aquí va la respuesta:La mayoría de los volúmenes de búsqueda en GKP (54,28%) son sobrevaloraciones, mientras que solo algo menos de la mitad (45,22%) son más o menos precisos (es decir, desviándose de las “impresiones” de GSC no más del 50%).Para los cebrirtos del SEO entre vosotros, aquí va una vista más granular de cómo los datos de GSC quedan en comparación con los de GKP:Bastante discrepancia, ¿no?Así que, ¿por qué no profundizamos un poco más e investigamos las causas reales de una diferencia tan marcada en los volúmenes de búsqueda entre GKP y GSC?GKP agrupa keywords con un significado parecido (y comete errores)Según nuestros datos de GSC, la palabra clave “ahrefs” recibió 25.436 impresiones en junio (en Estados Unidos):Pero si miramos los datos de GKP del mismo mes, muestra un volumen de búsqueda de 33.100:Esto quiere decir que el ratio “GKP/GSC” de esta palabra clave es 1.3x. No muy mal, pero tampoco muy preciso.¿Así que, qué está causando esta discrepancia?Parece ser que los datos de volumen de GKP para la palabra clave “ahrefs” incluyen los volúmenes de búsqueda de todos los errores ortográficos que podemos ver en nuestro GSC:ahref (2.826 impresiones)hrefs (906 impresiones)aherfs (435 impresiones)arefs (267 impresiones)a hrefs (224 impresiones)aherf (185 impresiones)ahrfs (100 impresiones)etc.Lo sabemos porque GKP las agrupa (y muestra el mismo volumen de búsqueda que muestra para “ahrefs”):Pero que el volumen de búsquedas de una palabra clave tenga en cuenta sus errores ortográficos no es un gran problema, ¿no? De hecho, puede ser bastante útil.Bueno, hay algunos casos en los que GKP agrupa las cosas que no deberían agruparse. Y esto puede confundirnos a nosotros, los SEOs.Por ejemplo, la keyword “chusky” tiene un volumen de búsqueda de 550.000 en GKP en Estados Unidos. GKP piensa que es un error de escritura de “husky”, porque estas dos palabras clave están agrupadas juntas:Pero si miras los resultados de búsqueda de la palabra clave “chusky” te darás cuenta al momento de que no es un error ortográfico. En su lugar, es una raza de perros única, lo que quiere decir que tendría que tener su propio volumen.Lo mismo pasa con estas cuatro palabras clave: “red room” (habitación roja), “red rose” (rosa roja), “red rock” (roca roja) y “red robin” (petirrojo):GKP las trata como una, pero ni siquiera tienes que mirar los resultados de búsqueda para darte cuenta de que no son lo mismo.Algunos ejemplos más:american banks (bancos americanos) & bank of america (uno de los bancos más importantes en Estados Unidos)mosquito bites (picaduras de mosquito) & mosquito bits (un veneno para mosquitos)book a driver (reservar un conductor) & drive book (“Drive”, un libro de Daniel H. Pink)Siendo completamente honesto, este tipo de “grupos falsos” no son comunes, pero pueden darte muchos dolores de cabeza si te topas con ellos.Lo que es mucho más común (e irritante) es que GKP no muestre diferencias entre volúmenes de búsqueda distintos para variaciones muy cercanas de la consulta de búsqueda.Por ejemplo, las siguientes consultas de búsqueda se agrupan conjuntamente en GKP sin forma de ver los volúmenes de búsqueda individuales:pc games free download (juegos pc descarga gratis)free pc games download (juegos gratis pc descargar)free games download for pc (juegos gratis para descargar pc)download free games for pc (descargar juegos gratis para pc)free pc game downloads (juegos pc gratis descargas)download pc games free (descargar juegos pc gratis)free games to download for pc (juegos gratuitos para descargar pc)Este problema de “agrupación” después se replica en todas las herramientas SEO que recogen sus datos de GKP (y eso son casi todas).Pero aquí en Ahrefs mezclamos los datos de palabras clave de varias fuentes (incluyendo muchos años de datos históricos de clickstream), lo que nos permite “desagrupar” las consultas de búsqueda y mostrar distintos volúmenes para cada variante:Conocer un volumen de búsqueda distinto por búsqueda individual evita que de forma accidental sobrevalores el potencial de tráfico total de un tema cuando sumes los volúmenes de búsqueda de todas las palabras clave en un grupo.Más aún, saber las formas más conocidas de cómo la gente formula sus búsquedas puede ayudarte a ajustar el vocabulario de tu página y puede que llegues a un título de página más atractivo.Como te puedes imaginar, esta funcionalidad de “agrupar” en GKP puede ser frustrante para nosotros los SEOs. Pero no es que podamos culpar a GKP por ocultarnos datos precisos de volúmenes de búsqueda. GKP es una herramienta para publicitarios, no SEOs. Y esta agrupación de palabras clave similares es en realidad útil para ellos.GSC muestra impresiones locales para consultas de búsqueda con intención localSegún GKP la palabra “golf courses” (campos de golf) tiene una media impresionante de búsquedas mensuales de 1 millón en Estados Unidos:Pero aquí está el tema. Dependiendo de la ubicación desde dónde busques, verás distintas páginas posicionando para esta palabra clave:Si buscas desde Rochester, verás una página de visitrochester.com en #2.Si buscas desde Bakersfield, verás una página de visitbakersfield.com en #1.Por lo que los propietarios de estos dos sitios web verán un número distinto de impresiones mensuales para la palabra clave “golf courses” en su GSC. Eso es porque cada web se posiciona bien para esta palabra clave en una ubicación específica.Y solo el propietario de una web enorme como golflink.com (que parece tener páginas posicionadas en “golf courses” en cada ubicación que puedas imaginar) probablemente vea el número de impresiones que se acerque a ese 1 millón que nos muestra GKP.Estas keywords “regionales” han causado la mayor discrepancia (4x) entre las cifras de GKP y GSC, como se puede ver en el gráfico anterior.Las “impresiones” en GSC a veces están infladas por el tráfico de botsVamos a hablar de esos casos raros donde GSC muestra un volumen de búsqueda mayor que GKP.Creemos que probablemente ocurre por el tráfico bot. Según John Mueller, no todas las impresiones de los bots se filtran en GSC:https://twitter.com/JohnMu/status/1423671435168464899Pero, ¿qué es el “tráfico bot”?Bueno, es cualquier tipo de script o programa de software que realiza búsquedas automatizadas en Google.Los “bots” con los que estoy seguro de que estás familiarizado son rank trackers que realizan búsquedas automatizadas en Google para informar de dónde se posiciona tu sitio web.Un ejemplo mucho más desagradable son los bots que generan clics falsos en Google para poner más presión en sus competidores.De cualquier forma, según nuestro estudio, los datos de GSC aparecían artificialmente hinchados en solo el 0.5% de los casos. Así que no es probable que vayas a sufrir de bots contaminando tus informes de GSC.¿Cómo quedan los datos de volumen de búsqueda de Ahrefs en la comparativa?Estoy seguro de que algunos os estáis preguntando cómo se comparan los datos de volumen de Ahrefs.Bien, vamos a poner los ratios de “Ahrefs/GSC” justo al lado de “GKP/GSC” del gráfico anterior:Parece que Ahrefs muestra valores “Más o menos Precisos” en el 60% de los casos frente al 45% de los casos en GKP. Eso se debe sobre todo a nuestra capacidad de “desagrupar” clusters de palabras clave parecidas y reportar distintos volúmenes de búsqueda para cada uno de ellos.Así que si te preguntabas por qué los volúmenes de búsqueda en Ahrefs no son los mismos que en GKP, ahora sabes que es por diseño.Reflexiones finalesEspero que hayáis disfrutado este estudio de investigación, que te haya dado un mejor entendimiento de cómo difieren los números en GSC y GKP y, más importante, por qué lo hacen.¿Preguntas? ¿Dudas? ¿Sugerencias? Escríbenos por Twitter.Y, ya de paso, muchas gracias a nuestro maravilloso equipo de científicos de datos por sacar tiempo de sus apretadas agendas para ayudarme con esta investigación.Tra­duci­do por Iván Fanego, que analiza herramientas y tendencias en marketing y software y acaba de lanzar la guía de WhatsApp Multiagente más completa. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía.",
  "headers": [
    {
      "level": "H1",
      "text": "GSC vs. GKP: Comparando los Volúmenes de Búsqueda de 72.000 Keywords [Un Estudio de Ahrefs]"
    },
    {
      "level": "H2",
      "text": "Comparando los volúmenes de búsqueda entre GSC y GKP"
    },
    {
      "level": "H2",
      "text": "GKP agrupa keywords con un significado parecido (y comete errores)"
    },
    {
      "level": "H2",
      "text": "GSC muestra impresiones locales para consultas de búsqueda con intención local"
    },
    {
      "level": "H2",
      "text": "Las “impresiones” en GSC a veces están infladas por el tráfico de bots"
    },
    {
      "level": "H2",
      "text": "¿Cómo quedan los datos de volumen de búsqueda de Ahrefs en la comparativa?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Tim Soulo"
}