{
  "url": "https://ahrefs.com/blog/es/guia-martech-stack/",
  "slug": "guia-martech-stack",
  "title": "La guía fácil para crear tu MarTech Stack",
  "description": "Ninguna plataforma de marketing puede servir para todo. Por eso, necesitamos crear nuestras MarTech Stacks con varias herramientas. Aquí te contamos cómo.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido No existe una herramienta única de marketing que pueda gestionar todos los procesos y permitir la colaboración entre equipos a la vez. De hecho, aunque la hubiera, no sería la mejor en todo.Solo por esto, los profesionales del marketing tienen que buscar varias herramientas para construir su MarTech Stack.No es raro que no exista ninguna herramienta “milagrosa”; los procesos de marketing pueden ser bastante complejos. Por ejemplo, este es el proceso de creación de contenido de nuestro blog:Como puedes ver, hay varias fases en este proceso. El tema es que, para estas fases, necesitas herramientas distintas: una para hacer keyword research, otra para escribir, otras para comunicarte, otras tantas para publicar, etc.En general, cuantas más tácticas lances y más procesos definas, más herramientas necesitarás en tu stack de marketing. Sin embargo, este proceso de montar soluciones ad hoc puede descontrolarse rápidamente y perjudicar tu rendimiento. Por lo tanto vamos a tratar de evitar ese problema empezando por el principio:¿Qué es una MarTech Stack?¿Para qué se usa MarTech?Cómo construir tu MarTech StackNuestras herramientas favoritas de marketing (muestra de nuestra MarTech stack)¿Qué es una MarTech Stack?“MarTech” es la abreviatura en inglés de “marketing technology”, algo así como “tecnología de marketing”. Cuando hablamos de “MarTech Stack”, nos referimos a las agrupaciones de varias tecnologías de marketing (“stack” en inglés es “pila”, en el sentido de apilamiento).Hace referencia a un conjunto de software que usan los equipos de marketing para dirigir, gestionar, medir y mejorar sus actividades de marketing.A menudo, las MarTech Stack se usan para trabajar junto a otras (a través de integraciones nativas o API) para complementar los procesos de marketing.¿Para qué se usa MarTech?Respuesta corta: prácticamente para todo. Personalmente, me sorprendí mucho al descubrir que existe una herramienta dedicada para pasar el contenido desde Google Docs a WordPress (algo que había hecho a mano durante años). Nunca pensé que necesitaría una herramienta como Wordable, pero ahora no hay vuelta atrás.Por lo tanto, es realmente interesante saber qué hay por ahí en términos de tecnología para marketing. Aquí van algunas de las áreas en las que puedes usar MarTech:Investigación y análisisAlgunos tipos de investigación no son posibles sin el software adecuado. Por ejemplo, no puedes hacer keyword research sin una herramienta SEO.Con solo tres palabras clave, hemos conseguido casi 54.000 ideas para keywords. Datos de Keywords Explorer de Ahrefs.En otros casos, MarTech te ayudará a agilizar tus procesos de investigación. Por ejemplo, cuando analizas el alcance social de medios o influencers, no tienes por qué comprobar a mano cada plataforma. Una herramienta como Sparktoro te lo da todo en el mismo sitio.CreaciónAquí, MarTech ofrece herramientas para la colaboración en equipo, recopilación de feedback, creación de páginas sin programación (no-code) y creación de contenido visual.Por ejemplo, cuando busques una herramienta de diseño, no podrás evitar cruzarte con Creative Suite de Adobe. Aunque cuenta con unas herramientas muy buenas, pueden ser demasiado complejas para los equipos de marketing. Estarías mejor con algo más ágil como Figma o UXPin.Nuestro equipo usó Figma para crear la web de Ahrefs. También lo usamos para guardar nuestro sistema de diseño.Distribución de contenidosSean cuales sean los canales de marketing que usas, existe una herramienta para ellos. Por ejemplo, puedes programar tus publicaciones en redes sociales para que se envíen en varias plataformas dentro de la misma herramienta. No tienes que andar saltando entre perfiles de redes sociales, tratando de encontrar el momento perfecto para publicar.Puedes usar herramientas como MeetEdgar para aligerar el trabajo de publicación en redes sociales.Personalización de la experiencia de usuarioCon la tecnología adecuada, puedes configurar sistemas que personalicen los textos de tu web, las imágenes, los productos que se muestran y más. Así, en lugar de mostrar mensajes genéricos que sean “café para todos”, puedes mostrar contenido que se sienta como algo preparado específicamente para quien lo ve.Barilliance permite a las tiendas online personalizar de forma automática la experiencia de cada visita usando inteligencia artificial. Por ejemplo, puede mostrar productos competidores que los usuarios visitaron con anterioridad al considerar un producto o mostrar oportunidades de venta cruzada en base a modelos dinámicos.Marketing automation (automatización del marketing)Con las herramientas de marketing automation, puedes planificar la relación de tu marca con las personas a lo largo del customer journey, desde la configuración de los formularios de registro sin programar hasta la creación de flujos de emails automatizados en base a la interacción de tus suscriptores.Y, siguiendo la última moda de marketing conversacional, puedes hacer que un chatbot responda las preguntas de tus clientes durante las 24 horas del día, como hace IKEA en España.AnalíticaSi es digital, se puede medir y, si se puede medir, se puede mejorar. Por ejemplo, en Ahrefs monitorizamos constantemente el rendimiento de nuestro contenido en términos de posicionamiento de palabras clave y tráfico orgánico. Si vemos que entran en tendencia negativa, podemos mejorar el contenido o promocionarlo más.En la captura de pantalla que tienes a continuación, puedes ver el gráfico de búsqueda orgánica de uno de nuestros artículos. Las flechas marcan los momentos en los que actualizamos el artículo con nuevo contenido. Como puedes ver, retocar el artículo llevó a un incremento del tráfico orgánico en varias ocasiones.Datos de Site Explorer de Ahrefs.Optimización¿No sabes qué diseño de página convertirá mejor? No juegues a las adivinanzas; usa herramientas de test A/B como Optimizely o Google Optimize. Estas herramientas te permitirán desplegar tus tests (incluso sin saber programar), recopilarán datos automáticamente durante todo el tiempo que necesites y te ofrecerán informes de los resultados.Por ejemplo, en la captura de pantalla que tienes a continuación, puedes ver cómo usamos Tubebuddy para probar dos versiones de miniatura de vídeo.Gestión de relación con el clienteMás conocido como CRM (del inglés, customer relationship management), se trata de herramientas que los equipos de marketing y ventas usan para reunir información sobre sus clientes y potenciales clientes.Usar hojas de cálculo para esto es algo del pasado. Los CRM modernos tienen la ventaja de ser bases de datos dinámicas y centralizadas que envían y reciben información desde otras herramientas y de forma automática.Algo que ilustra muy bien el papel que tienen los CRM en el marketing digital es la promesa que uno de los mayores proveedores de marketing automation, HubSpot, trata de cumplir: en primer lugar y, por encima de todo, ser un gran CRM.Cómo construir tu MarTech StackAntes de que pienses en crear tu MarTech Stack, asegúrate de haber identificado tus objetivos de marketing y elegido tus tácticas de marketing. Es imposible construir algo útil sin antes decidir este tipo de cuestiones porque el propósito de tu stack es ayudar a mejorar tus actividades de marketing. Si necesitas ayuda con estas dos cosas, lee nuestras guías sobre cómo elegir tus objetivos de marketing y tus tácticas de marketing.Dicho esto, vamos a ver los próximos pasos a la hora de crear tu propia MarTech Sack.1. Identifica tus necesidades y comprueba cómo encajan con tu stack actualTus necesidades en lo relativo a tu Marketing Stack probablemente salgan de dos sitios: tus objetivos de marketing y las necesidades de tu equipo para llevar a cabo el trabajo del día a día.Si te dedicas al marketing digital, tus objetivos se traducirán de forma casi automática en necesidades de software. Por ejemplo, mejorar el tráfico orgánico sin una herramienta SEO es ir a ciegas. Tratar de incrementar tu share of voice (o cuota de conversación o voz) en redes sociales sin herramientas de análisis y publicación es una locura. Y no vas a poder configurar ni un solo flujo automatizado de email sin una herramienta de automatización de email… Bueno, creo que se entiende la idea.Esto es lo que puedes hacer. Simplemente escribe tus objetivos de marketing y revisa si tienes las herramientas adecuadas para trabajar. De no ser así, haz una nota al lado del objetivo. De este modo, comprarás lo que es realmente necesario, ahorrarás algo de dinero y evitarás la confusión de tener demasiados espacios de trabajo.En función del tamaño de tu empresa, revisar tu stack actual puede llevar unos cuantos minutos o varias horas. Algunas herramientas en tu stack puede que ni siquiera se usen por algún motivo. Si es así, puede que merezca la pena volver a herramientas que ya han probado su valor.En Ahrefs mantenemos una lista de nuestra tecnología de marketing que también menciona a las personas que tienen acceso a la misma. Así, sabemos lo siguiente:Las herramientas que usamos o no.Si deberíamos seguir pagándolas o no.Aquí va otra cosa que sumar a la lista: las necesidades de tu equipo. Este es un componente importante de tus requisitos de software, pero es tan obvio que se le escapa a los equipos directivos. El resultado final es que acaban comprando el software en función de sus opiniones personales.A veces, la dirección elige la tecnología de marketing por su cuenta. Piensan, con buenas intenciones, que así no distraerán al equipo. Es un error; están haciendo un flaco favor a las personas del equipo. Es importante preguntar lo que necesitan. Lo más habitual será que tus compañeros y compañeras de marketing conozcan el panorama MarTech.2. Establece un presupuestoHazlo porque necesitas saber lo que te puedes permitir y es bueno saberlo antes de salir a comprar software.Al igual que en la vida normal, puede que estés en uno de estos dos escenarios: tienes un presupuesto ajustado o tienes algo de margen. Así mismo, lo que consigas depende de lo bien que puedas justificar tus necesidades.Si tu presupuesto ya está decidido, puede que necesites priorizar algunas herramientas sobre otras, recortar costes con suscripciones para una sola persona o elegir las opciones más baratas (o incluso las gratuitas).No obstante, si tu presupuesto no es una cifra arbitraria en la que no puedes influir, aquí va un consejo:Trata de argumentar la petición de nuevas herramientas en función de tus objetivos de marketing. No siempre queda claro para la dirección financiera o la dirección general por qué necesitas un software concreto, sobre todo cuando es caro. Merece la pena mencionar que, si no puedes cumplir tus objetivos de marketing porque no tienes el software adecuado, la empresa entera sufrirá las consecuencias.3. Investiga posibles opciones de softwareLlegados a este punto, deberías ser capaz de determinar qué tipos de software buscas (e incluso, puede que tengas algunas plataformas específicas en mente) y cuánto te puedes gastar. Es el momento de elegir.Aquí van algunas ideas para encontrar las herramientas adecuadas:Consigue recomendaciones. Pregunta a tu red en LinkedIn o Twitter (o X), publica una pregunta en una comunidad de marketing o en Quora.Analiza a tus competidores y empresas que admires. Para hacer esto, puedes usar webs como StackShare, BuiltWith, o Slintel. En ocasiones, puedes encontrar esa información directamente en la fuente, por ejemplo, revisando el blog de la empresa (a muchas empresas les gusta compartir esta información, como estamos haciendo nosotros en este artículo).Revisa plataformas de reviews. En primer lugar, webs como G2 y Capterra tienen listas revisadas de software en prácticamente todas las categorías (en muchos casos, incluso, cuentan con guías de compra). En segundo lugar, la gente comparte ahí sus experiencias de uso. Es mejor mantener cierto escepticismo al leer estas reseñas, pero puedes detectar patrones y opiniones, o algunos detalles que te interese comprobar.Comprueba las relaciones entre tus herramientas. Revisa si existen solapes y comprueba que las herramientas que supuestamente tienen que trabajar juntas tengan las integraciones necesarias. Recuerda: tener más herramientas no siempre es mejor.4. Despliega las herramientas y comienza la transiciónUna vez que tengas acceso a tus nuevas herramientas, no está de más que recuerdes lo siguiente:Crea una lista de toda tu MarTech Stack y compártela con quien tenga interés (el equipo de marketing, posiblemente CEO y CFO). Puedes crear una lista similar (como la que mostramos en el punto 1) que muestre las URL de las herramientas, las personas responsables, cómo acceder a las herramientas, los precios y todo lo que consideres que sea útil.Si tienes algunas herramientas antiguas todavía en funcionamiento, no las canceles tan rápido porque puede que tengan datos de valor que se perderán si dejas de pagar. Siempre que sea posible, exporta datos de las herramientas antiguas e impórtalas en tus nuevas herramientas. Puedes continuar usando tus herramientas antiguas hasta que tengas una seguridad del 100 % de que todo lo que necesitas está en la nueva stack.Considera contactar al creador del software para obtener algo de orientación y asegurarte de que todo funciona como debería. Algunas herramientas son bastante complicadas de implantar (especialmente, cuando migras datos o las integras con otro software).5. Asegúrate de que tus herramientas se usan adecuadamenteLas herramientas nuevas probablemente confundan a tu equipo durante el primer par de semanas. Incluso los cambios de interfaz entre tu software antiguo y nuevo podrían causar una disminución temporal de la productividad. Asegúrate de apartar algo de tiempo para aprender a usar las nuevas herramientas.Muchas empresas de software ofrecen materiales educativos muy completos de forma gratuita (o sin cargo adicional). Por ejemplo, cuando te registras en Ahrefs, puede que no sepas nada sobre SEO, excepto que te hace falta. Y no pasa nada porque, con nuestra Academia, te enseñamos cómo hacer SEO, a la vez que a usar nuestro software.Yendo más allá, si necesitas desarrollar procedimientos operativos personalizados (como hacer informes o procesos de creación de contenido), es una buena idea contar con una persona responsable de documentarlos con las nuevas herramientas.Consejo final: considera evaluar con cierta regularidad tu MarTech stack. Puedes pedir opiniones a tus compañeros y compañeras en reuniones o enviarles una encuesta interna cada dos meses. De ese modo puedes conseguir algo más de información adicional, como qué herramientas necesitan una ampliación (o bajar a un plan más barato) o en qué áreas tu equipo necesita más formación.Ahora, vamos a ver, con un ejemplo, el aspecto que puede tener una MarTech stack.Nuestras herramientas favoritas de marketing (una muestra de nuestra MarTech stack)Aquí tienes una parte de la MarTech Stack que usamos para gestionar una empresa con 8 cifras de facturación recurrente anual.1. AhrefsAhrefs es una herramienta SEO todo en uno líder en su sector. Creamos esta herramienta para ayudar a profesionales del marketing a posicionar mejor en motores de búsqueda y conseguir más tráfico. Así que, naturalmente, la usamos cada día para trabajar en nuestra propia estrategia de marketing. Sobre todo la usamos para:Encontrar temas sobre los que escribir.Estudiar la estructura de nuestros posts.Elegir qué artículos actualizar.Encontrar oportunidades con las que ponernos en contacto.Analizar la competencia.Monitorizar nuestro rendimiento en motores de búsqueda.Encontrar problemas de SEO técnico.Dónde la puedes conseguir: ahrefs.com Precio: Cuenta con herramientas gratuitas; los planes de pago empiezan en los 89 € al mes (recibes dos meses gratis si pagas anualmente). Algunas alternativas: SEMrush, Moz2. Google Search ConsoleGoogle Search Console es un servicio gratuito de Google que te ayuda a monitorizar y resolver problemas relacionados con la forma en la que tu web se muestra en los resultados de búsqueda.Ofrece los datos más precisos en lo que se refiere a la búsqueda de Google, como, por ejemplo, los datos de tráfico orgánico, los CTR (click-through rates, tasas de clic sobre impresiones) orgánicos, cobertura del índice, etc.Dónde conseguirlo: search.google.com/search-console Precio: Gratis Alternativa: Ahrefs Webmaster Tools. Advertencia: No es exactamente una alternativa (solo Google Search Console muestra datos de tráfico orgánico exactos de Google Search); se trata más bien de una herramienta complementaria que cubre los huecos de la herramienta de Google.3. Google WorkspaceSe trata de la primera herramienta de nuestra lista que no es de marketing y que necesitan los profesionales del marketing. Es productividad y colaboración en un único lugar. En cualquier caso este producto probablemente no necesite presentación. Google Workspace une herramientas como Gmail, Docs, Sheets (hojas de cálculo), Drive y más. Incluso ahora estoy usando Workspace para escribir este artículo.Estas herramientas son gratuitas, pero es muy probable que cualquier empresa tenga que pasarse por la página de precios para elegir un plan que se ajuste a sus necesidades de almacenamiento de datos y echar un vistazo a qué otras funcionalidades prémium ofrece Workspace.Dónde conseguirlo: workspace.google.com Precio: Gratis para uso personal; los planes premium empiezan en unos 5.75 € al mes. Algunas alternativas: Microsoft Office 365, Zoho Workplace, ONLYOFFICE Workspace4. NotionOtra herramienta que no es de marketing sin la que no podemos vivir. Notion es nuestro espacio de trabajo de equipo, algo en lo que Google Workspace se queda corto. La usamos para documentación interna y colaboración.¿Recuerdas el proceso de creación del blog que vimos en la introducción de este artículo? Hacemos seguimiento de todo el proceso en Notion.Dónde conseguirlo: notion.so Precio: Gratis para uso personal; los planes prémium empiezan en unos 8$ al mes. Algunas alternativas: ClickUp, Confluence5. GrammarlyIncluso los mejores redactores cometen errores. Grammarly es una herramienta que revisa automáticamente textos en inglés en busca de errores gramaticales y ortográficos, y que incluso puede hacer sugerencias de estilo. Si escribes contenido en inglés, aunque se trate de emails o presentaciones, no estrictamente de contenido para hacer marketing, puede ser de gran ayuda.Dónde conseguirlo: grammarly.com Precio: Gratis para uso personal; los planes prémium empiezan en unos 12€ al mes. Algunas alternativas: ProWritingAid, Sapling. Stilus puede ser una alternativa para usar en español6. WordableUsamos Wordable para exportar desde Google Docs a WordPress. La herramienta exporta textos e imágenes y pasa del formato original a HTML. Publicar a mano en WordPress implica más trabajo repetitivo y mecánico, que puede acabar con más errores.Dónde conseguirlo: wordable.io Precio: Gratis para uso personal; los planes prémium empiezan en unos 50$al mes. Algunas alternativas: El add-on oficial de WordPress para Google Docs.7. WordPressOtra herramienta que probablemente no necesite presentación. Usamos este inmensamente popular CMS como nuestra infraestructura para el blog. Y, puesto que estás leyendo este artículo justo ahora, eso significa que tú también usas WordPress.Dónde conseguirlo: wordpress.org Precio: Gratis para uso personal; los planes prémium empiezan en 4 € al mes. Algunas alternativas (en lo que respecta a flexibilidad): Drupal, Joomla8. vidIQvidIQ es una de las pocas herramientas de videomarketing que usamos (la otra es Tubebuddy, que ya mencionamos antes en este artículo). Usamos esta herramienta para analizar y obtener información sobre vídeos y canales en YouTube.Dónde conseguirlo: vidiq.com Precio: Cuentan con planes gratuitos; los planes premium empiezan en unos 7.50$ al mes. Algunas alternativas: Tubebuddy, Ahrefs (para SEO en YouTube)9. MeetEdgarMeetEdgar es la herramienta que usamos para automatizar las publicaciones en Twitter, LinkedIn y Facebook. No es otra herramienta más para programar en redes sociales. Es una auténtica herramienta de automatización de redes sociales. Incluso puede generar publicaciones en redes sociales de forma automática en base al contenido de un artículo.Dónde conseguirlo: meetedgar.com Precio: Comienza en los 24,91$ al mes. Algunas alternativas: Buffer, SproutSocial, Hootsuite10. SparktoroSparktoro nos ayuda a encontrar creadores e influencers en base a temas, a quién siguen y otras señales. Es especialmente útil para encontrar alianzas potenciales en nichos que no conocemos.Dónde conseguirlo: sparktoro.com Precio: Tiene versión gratuita; los planes prémium empiezan en los 38 $ al mes. Algunas alternativas: No existe nada igual que yo conozca (aunque Klear y Social Blade se acercan).11. HunterHunter es una herramienta para encontrar la dirección de email de cualquier persona solo con su nombre y el sitio en el que trabaja. Es una de las herramientas que usamos para hacer outreach para link building. Básicamente, una vez que encontramos y validamos una oportunidad potencial, necesitamos encontrar su dirección de email para contactarlos; algo que rara vez es información pública. Aquí es donde entra Hunter.Dónde conseguirlo: hunter.io Precio: Cuentan con planes gratuitos; los planes prémium empiezan en unos 49 € al mes. Algunas alternativas: FindEmails, NinjaOutreach12. PitchboxPitchbox es una herramienta de contacto con influencers y de marketing de contenidos. Sin embargo, no usamos todas sus funcionalidades, solo las que nos permiten enviar emails a nuestros potenciales oportunidades de conseguir enlaces a escala (por ejemplo, flujos de trabajo personalizados y automatizados).Dónde conseguirlo: pitchbox.com Precio: Los planes prémium empiezan en unos 500 € al mes. Algunas alternativas: BuzzStream, NinjaOutreach13. FigmaFigma es una herramienta colaborativa de diseño de interfaces. Además de ser una gran plataforma de diseño y prototipado, Figma hace más fácil nuestras vidas al permitirnos compartir los diseños entre nuestros diseñadores y desarrolladores, así como a mantener un sistema de diseño consistente.Dónde conseguirlo: figma.com Precio: Cuentan con planes gratuitos; los planes prémium empiezan en unos 12 € al mes. Alternativa: UXPinReflexiones finalesYa lo tienes. Construir una MarTech stack es bastante parecido a ir de compras, pero no es necesariamente ni divertido ni fácil. Es una buena idea olvidarse de preferencias personales por un momento y pensar en cómo una elección concreta encaja en tus procesos, cómo te ayuda a alcanzar tus objetivos y si les gusta a tus compañeros y compañeras.En Ahrefs, llevamos años construyendo nuestra stack a base de prueba y error; es un proceso que nunca termina. Pero eso es bueno. De vez en cuando encontramos una nueva herramienta que hace que nos preguntemos cómo hemos podido vivir sin ella, así que mantén tus ojos abiertos para encontrar nuevas tecnologías más inteligentes y fáciles de usar.Finalmente, si quieres ver qué otras herramientas usamos para hacer marketing, revisa esta lista.¿Alguna pregunta? Te esperamos en nuestro Twitter (X) en español. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "La guía fácil para crear tu MarTech Stack"
    },
    {
      "level": "H2",
      "text": "¿Qué es una MarTech Stack?"
    },
    {
      "level": "H2",
      "text": "¿Para qué se usa MarTech?"
    },
    {
      "level": "H3",
      "text": "Investigación y análisis"
    },
    {
      "level": "H3",
      "text": "Creación"
    },
    {
      "level": "H3",
      "text": "Distribución de contenidos"
    },
    {
      "level": "H3",
      "text": "Personalización de la experiencia de usuario"
    },
    {
      "level": "H3",
      "text": "Marketing automation (automatización del marketing)"
    },
    {
      "level": "H3",
      "text": "Analítica"
    },
    {
      "level": "H3",
      "text": "Optimización"
    },
    {
      "level": "H3",
      "text": "Gestión de relación con el cliente"
    },
    {
      "level": "H2",
      "text": "Cómo construir tu MarTech Stack"
    },
    {
      "level": "H3",
      "text": "1. Identifica tus necesidades y comprueba cómo encajan con tu stack actual"
    },
    {
      "level": "H3",
      "text": "2. Establece un presupuesto"
    },
    {
      "level": "H3",
      "text": "3. Investiga posibles opciones de software"
    },
    {
      "level": "H3",
      "text": "4. Despliega las herramientas y comienza la transición"
    },
    {
      "level": "H3",
      "text": "5. Asegúrate de que tus herramientas se usan adecuadamente"
    },
    {
      "level": "H2",
      "text": "Nuestras herramientas favoritas de marketing (una muestra de nuestra MarTech stack)"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs"
    },
    {
      "level": "H3",
      "text": "2. Google Search Console"
    },
    {
      "level": "H3",
      "text": "3. Google Workspace"
    },
    {
      "level": "H3",
      "text": "4. Notion"
    },
    {
      "level": "H3",
      "text": "5. Grammarly"
    },
    {
      "level": "H3",
      "text": "6. Wordable"
    },
    {
      "level": "H3",
      "text": "7. WordPress"
    },
    {
      "level": "H3",
      "text": "8. vidIQ"
    },
    {
      "level": "H3",
      "text": "9. MeetEdgar"
    },
    {
      "level": "H3",
      "text": "10. Sparktoro"
    },
    {
      "level": "H3",
      "text": "11. Hunter"
    },
    {
      "level": "H3",
      "text": "12. Pitchbox"
    },
    {
      "level": "H3",
      "text": "13. Figma"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}