{
  "url": "https://ahrefs.com/blog/es/herramientas-informes-seo/",
  "slug": "herramientas-informes-seo",
  "title": "8 herramientas gratuitas de informes SEO",
  "description": "No hay escasez de herramientas de informes SEO, pero ¿cuáles son las herramientas básicas que se necesitan para elaborar un informe SEO?",
  "content": "Contenido No hay escasez de herramientas de informes SEO, pero ¿cuáles son las herramientas básicas que se necesitan para elaborar un informe SEO?En este artículo, voy a compartir ocho de mis herramientas de informes SEO favoritas para ayudarte a crear un informe SEO completo de forma gratuita.1. Google Search ConsolePrecio: GratuitoGoogle Search Console, también conocido como GSC, es una de las herramientas más utilizadas para realizar un seguimiento de las métricas SEO importantes de la Búsqueda de Google.Casos de uso más frecuentesGSC tiene un montón de datos en los que sumergirse, pero el principal indicador de rendimiento que cualquier persona experta en SEO verá primero en GSC serán los Clics en el panel principal de Visión general.Dado que los datos proceden de Google, los profesionales del SEO los consideran un buen barómetro para realizar un seguimiento del rendimiento de la búsqueda orgánica. Además de los datos de clics, en el informe de Rendimiento también se puede realizar un seguimiento de lo siguiente:Impresiones totalesCTR medioPosición mediaTIPSi te has registrado en AWT utilizando Google Search Console, puedes ver tus datos de rendimiento de GSC en Ahrefs haciendo clic en «Rendimiento de GSC» desde el panel principal.Pero para la mayoría de los informes SEO, los datos de clics de GSC se exportan a una hoja de cálculo y se convierten en un gráfico para visualizar el rendimiento interanual.Lecturas complementariasGuía de informes SEO para principiantesFunción favoritaUno de mis informes favoritos de GSC es el de indexación. Es útil para los informes SEO porque puedes compartir la proporción de páginas indexadas y no indexadas en tu informe SEO.Si el sitio web tiene muchas páginas no indexadas, merece la pena revisarlas para entender por qué no se han indexado.2. Google Looker Studio (anteriormente conocido como Google Data Studio)Precio: GratuitoGoogle Looker Studio (GLS), antes conocido como Google Data Studio (GDS), es una herramienta gratuita que ayuda a visualizar datos en cuadros de mando que pueden compartirse.Casos de uso más frecuentesLos cuadros de mando son una parte importante de los informes SEO, y GLS te permite obtener una visión total del rendimiento de las búsquedas desde múltiples fuentes gracias a sus integraciones.GLS facilita la conexión a muchas fuentes de datos diferentes.Por ejemplo:Productos de marketing. Google Ads, Google Analytics, Display & Video 360, Search Ads 360.Productos de consumidores. Google Sheets, YouTube, y Google Search Console.Bases de datos. BigQuery, MySQL, y PostgreSQL.Plataformas de redes sociales. Facebook, Reddit, y Twitter.Archivos. Carga de archivos CSV y Google Cloud Storage.Nota al margen.Si no tienes tiempo para crear tu propio informe manualmente, Ahrefs tiene tres conectores de Google Looker Studio que pueden ayudarte a crear informes SEO automatizados para cualquier sitio web en unos pocos clics.Este es el aspecto del dashboard en GLS:Conectores de Ahrefs para Looker StudioCon este tipo de cuadro de mando, puedes compartir informes fáciles de entender con clientes u otras partes interesadas.Función favoritaLa posibilidad de combinar y filtrar datos de distintas fuentes, como GA y GSC, permite obtener una visión general personalizada del rendimiento total de las búsquedas, adaptada a tu web.3. Screaming FrogPrecio: Gratuito hasta 500 URLScreaming Frog es un rastreador de sitios web que te ayuda a auditar tu sitio web.La versión gratuita del rastreador de Screaming Frog es perfecta si quieres realizar una auditoría rápida de un grupo de URL. La versión gratuita está limitada a 500 URL, por lo que es ideal para rastrear sitios web más pequeños.Casos de uso más frecuentesCuando se trata de informes, el menú Reports de Screaming Frog SEO Spider tiene una gran cantidad de información que puedes consultar y que cubre todos los aspectos técnicos de tu sitio web, como análisis, redirecciones, canónicos, paginación, hreflang, datos estructurados y más.Una vez que hayas rastreado tu sitio, es solo cuestión de descargar los informes que necesites y elaborar los temas principales para resumirlos en tu informe SEO.Función favoritaScreaming Frog puede extraer datos de otras herramientas, incluyendo Ahrefs, utilizando API.Si ya tienes acceso a las API de algunas herramientas SEO, puedes extraer datos de todas ellas directamente en Screaming Frog. Esto es útil si lo que buscas es combinar datos de rastreo con datos de rendimiento u otras herramientas de terceros.Aunque nunca hayas configurado una API, conectar otras herramientas a Screaming Frog es sencillo.TIPSi te gusta la interfaz de Screaming Frog y quieres realizar un análisis de archivos de registro de tu web, puedes probar Screaming Frog Log Analyser, que también es gratuito para 1000 líneas.4. Herramientas gratuitas SEO de AhrefsPrecio: GratuitoAhrefs tiene una gran selección de herramientas SEO gratuitas para ayudarte en cada etapa de tu campaña SEO, y muchas de ellas se pueden utilizar para proporcionar información para tus informes SEO.Por ejemplo, puedes utilizar nuestro:Comprobador de ranking de palabras clave gratuito: para conocer la posición de su sitio en el ranking de cualquier país.Comprobador gratuito de tráfico web: para informar sobre el tráfico de sitios web de tus competidores.Comprobador gratuito de enlaces rotos: para informar sobre enlaces rotos.Comprobador gratuito de autoridad de sitios web: para informar sobre el Domain Rating (DR) de cualquier sitio web.Comprobador gratuito de dificultad de palabras clave: para informar sobre nuevas oportunidades de palabras clave para tu contenido.Casos de uso más frecuentesUna de nuestras herramientas SEO gratuitas más populares es Ahrefs Webmaster Tools (AWT), que puedes utilizar para tus informes SEO.Con AWT, puedes:Controlar la salud de tu SEO a lo largo del tiempo mediante auditorías SEO programadas.Ver el rendimiento de tu webComprobar todos los backlinks conocidos de tu sitio webFunción favoritaDe todas las herramientas gratuitas de Ahrefs, mi favorita es AWT. Dentro de ella, la auditoría del sitio es mi característica preferida, una vez que la hayas configurado, es una manera completamente manos libres de realizar un seguimiento del rendimiento técnico de tu web y supervisar su salud.Si ya tienes acceso a Google Search Console, no tienes más que configurar una cuenta gratuita de AWT y programar un rastreo técnico de tus sitios web.5. Barra de herramientas SEO de AhrefsPrecio: GratuitoLa Barra de herramientas SEO de Ahrefs es una extensión gratuita de Chrome y Firefox útil para diagnosticar problemas técnicos en la página y realizar comprobaciones rápidas en las páginas de tu web.Casos de uso más frecuentesPara los informes SEO, es útil realizar una comprobación on-page de las páginas principales de tu sitio web para asegurarte de que no hay ningún problema grave on-page.Con la versión gratuita, obtendrás las siguientes funciones:Informe SEO on-pageRastreador de redirecciones con encabezados HTTPInforme de enlaces salientes con resaltador de enlaces y comprobador de enlaces rotosPosiciones SERPCambiador de país para SERPLa Barra de herramientas SEO es excelente para detectar problemas en las páginas de tu sitio web. Si no tienes confianza para inspeccionar el código, también puede darte indicaciones valiosas sobre los elementos que deberías incluir en tus páginas para que sean fáciles de buscar.Si algo va mal en la página, la barra de herramientas lo resaltará, y el color rojo indicará un problema crítico.Función favoritaLa sección que utilizo con más frecuencia en la Barra de herramientas SEO es la pestaña Indexabilidad. En esta sección, puedes ver si la página puede ser rastreada e indexada por Google.Aunque se puede hacer inspeccionando el código manualmente, el uso de la barra de herramientas resulta mucho más rápido.6. Google AnalyticsPrecio: GratuitoAl igual que GSC, Google Analytics es otra herramienta que puedes utilizar para realizar un seguimiento del rendimiento de tu sitio web, realizar un seguimiento de las sesiones y conversiones y mucho más en tu sitio web.Lecturas complementariasCómo utilizar Google Analytics 4 para principiantesCasos de uso más frecuentesGA te ofrece una visión total del tráfico del sitio web procedente de varias fuentes diferentes, como tráfico directo, social, orgánico, de pago, etc.Función favoritaCon GA4 puedes crear y realizar un seguimiento de hasta 300 eventos y 30 conversiones. Anteriormente, con Universal Analytics, solo se podía realizar el seguimiento de 20 conversiones. Esto facilita el seguimiento de conversiones y eventos en GA4.7. Google SlidesPrecio: GratuitoGoogle Slides es la versión de Google de Microsoft PowerPoint. Si no tienes un panel de control configurado para informar sobre tu rendimiento SEO, lo mejor que puedes hacer es montar una presentación de diapositivas.Muchas agencias SEO presentan sus informes a través de cuadros de mando y presentaciones de PowerPoint. Sin embargo, si no tienes acceso a PowerPoint, Google Slides es una excelente alternativa (gratuita).Casos de uso más frecuentesEl uso más común de Google Slides es crear un informe SEO mensual. Si no sabes qué incluir en un informe mensual, utiliza nuestra plantilla de informe SEO.Función favoritaUna de mis funciones favoritas es la posibilidad de compartir tu presentación en un chat de vídeo directamente desde Google Slides. Puedes hacerlo haciendo clic en el icono de la cámara en la parte superior derecha.Te resultará útil si trabajas con clientes remotos y facilita compartir tus informes.8. Google TrendsPrecio: GratuitoGoogle Trends permite ver la popularidad de una palabra clave a lo largo del tiempo en cualquier país. Los datos que muestra son el ratio de popularidad relativa escalado de 0-100, no el volumen directo de consultas de búsqueda.Casos de uso más frecuentesGoogle Trends es útil para mostrar cómo la popularidad de ciertas búsquedas puede aumentar o disminuir con el tiempo. Si trabajas con un sitio web que a menudo tiene productos, servicios o noticias de tendencia, puede ser útil ilustrar esto visualmente en tu informe SEO.Google Trends facilita la detección de tendencias estacionales para categorías de productos. Por ejemplo, la gente quiere comprar barbacoas cuando hace sol.Utilizando Google Trends, podemos ver que el pico de demanda de barbacoas suele producirse en junio-julio de cada año.Con estos datos de los últimos cinco años, podríamos estar bastante seguros de cuándo empezaría y terminaría la temporada de barbacoas.Función favoritaComparar dos o más términos de búsqueda entre sí a lo largo del tiempo es uno de mis usos favoritos de Google Trends, ya que puede utilizarse para contar su propia historia.Los datos sobre tendencias pueden añadirse al informe para conocer mejor las tendencias del mercado.Incluso puedes profundizar en las tendencias a nivel regional si lo necesitas.Reflexiones finalesEstas herramientas gratuitas te ayudarán a sentar las bases de un informe SEO completo.Las herramientas que utilizas para los informes SEO no siempre tienen que ser caras, incluso las grandes empresas utilizan muchas de las herramientas gratuitas mencionadas para crear perspectivas para los informes SEO de sus clientes.¿Tienes alguna pregunta? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "8 herramientas gratuitas de informes SEO"
    },
    {
      "level": "H2",
      "text": "1. Google Search Console"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "2. Google Looker Studio (anteriormente conocido como Google Data Studio)"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "3. Screaming Frog"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "4. Herramientas gratuitas SEO de Ahrefs"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "5. Barra de herramientas SEO de Ahrefs"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "6. Google Analytics"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "7. Google Slides"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "8. Google Trends"
    },
    {
      "level": "H3",
      "text": "Casos de uso más frecuentes"
    },
    {
      "level": "H3",
      "text": "Función favorita"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Chris Haines"
}