{
  "url": "https://ahrefs.com/blog/es/informes-marketing-contenidos/",
  "slug": "informes-marketing-contenidos",
  "title": "Guía para medir el Marketing de Contenidos",
  "description": "Guía paso a paso para crear los mejores informes de marketing de contenidos. Impresiona a tus responsables y clientes",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido ¿Tienes dudas de cómo preparar el informe de resultados de tu estrategia de contenido? Lo entiendo: hay demasiadas métricas para incluir, y ¿cómo debería ser el informe? ¿Qué partes incluir? Te prometo que al final de este artículo tendrás las cosas claras.En esta guía, aprenderá las tres prácticas recomendadas para la creación de informes y los ocho tipos de información que componen un informe de contenido sólido, incluidos los KPI reales utilizados por los especialistas en marketing de contenidos.Prácticas recomendadas para informes de marketing de contenidosPor mi experiencia, he aprendido que hay tres características clave en un informe de contenido que marcan la diferencia: que esté basado en datos, que invite a la acción (es decir, que esté orientado a proponer acciones concretas) y resulte funcional. Estas características mantienen a las personas en sintonía y garantizan que nuestro trabajo se tenga en cuenta.Vamos a analizar cada característica.1. Basado en datosEn lugar de confiar en intuiciones o suposiciones, un informe basado en datos usa datos cuantitativos (números) y cualitativos (observaciones) para proporcionar una visión clara y objetiva del rendimiento del contenido.De ese modo, cada recomendación o conocimiento se basa en hechos verificables, lo que la convierte en una herramienta fiable para la toma de decisiones.2. AccionableDel mismo modo, un buen informe de marketing de contenidos no se limita a inundar al lector de números y gráficos; interpreta los datos para proporcionar información clara y procesable.Esto significa que las cifras acompañan a recomendaciones específicas sobre lo que se puede hacer para mejorar el rendimiento. Ya sea modificando la estrategia de contenido, poniendo el foco en diferentes temas, ajustando los canales de distribución o eligiendo diferentes tácticas de SEO, los informes transforman los datos en una hoja de ruta para obtener mejores resultados.3. FuncionalEn los informes, la forma debe seguir a la función: el contenido y la estructura del informe deben adaptarse a las necesidades específicas de la persona con la que vas a compartirlo. También puedes verlo así: los informes deberían ser lo suficientemente buenos para cumplir su propósito, pero pasado un punto, pueden resultar excesivos.No pienses en exceso, ni compliques o diseñes demasiado tus informes. Elige los KPI (key performance indicators, indicadores clave de rendimiento) en los que realmente puedas influir, agrega algunos comentarios realmente útiles y hazlo de tal forma que no le dé a tu jefe o cliente la impresión de que dedicas demasiado tiempo al “papeleo”.A modo de ejemplo, un informe típico de una agencia o un autónomo trata sobre el retorno de la inversión (ROI) o la generación de valor para el cliente. Suelen adoptar la forma de un documento completo, muy bien diseñado con una gran cantidad de datos e ideas (similar a este Informe SEO). Incluso podría ir acompañado de un dashboard en vivo como este que creamos en Google Looker Studio:Por otro lado, los informes internos suelen tratar de documentar el desempeño y el progreso. Son mucho más estilizados. Por ejemplo, el informe mensual del blog de Ahrefs es un mensaje público breve en Slack con tres tipos de información: la cantidad de artículos publicados, movimientos notables de palabras clave y algo que merezca la pena comentar. Eso es todo.Qué incluir en un informe de marketing de contenidosEn esta parte de la guía, analizamos los KPI de marketing de contenidos y los comentarios cualitativos que te ayudarán a crear un informe relevante. Estos se basan en nuestra encuesta sobre métricas que realmente usan especialistas en marketing y algunas de nuestras sugerencias probadas.Ten en cuenta que tus métricas finales pueden diferir según tu estrategia. Te recomendamos que personalices tus informes.1. ResumenLos resúmenes están diseñados para las personas que reciben el informe que solo quieren conocer los puntos más importantes. Es posible que no tengan el tiempo o el interés para profundizar en los datos y elaborar una imagen general del desempeño. Estas personas esperan algo como esto:Producción de contenido: aumentó un 20%, con 20 nuevas piezas publicadas.Tráfico: aumentó un 35%, alcanzando 135.000 visitantes mensuales.Palabras clave posicionadas: El 50% de las palabras clave específicas ahora se encuentran en las 3 primeras posiciones SERP.Crecimiento de audiencia: se expandió un 25%, alcanzando un total de 75.000.Interacción / engagement: mejorado en un 15% en todas las plataformas.Conversiones: creció al 5%, lo que resultó en 50 ventas adicionales.Recomendaciones: estamos en el camino correcto y estamos listos para invertir más para escalar la producción de contenido.Es una buena práctica agregar resúmenes en todo momento, pero te serán especialmente útiles en equipos grandes y cuando trabajes con clientes.Los resúmenes se colocan al principio del informe, pero se escriben al final. No los escribas antes de recopilar y analizar los datos.2. Producción de contenidoEsta sección detalla la cantidad y el tipo de contenido publicado, en un período de tiempo específico. Esto le dice a tu jefe o cliente cuán eficientes sois tú o tu equipo.Puede incluir publicaciones de blogs, videos, podcasts, infografías y publicaciones en redes sociales.Simplemente, puedes medir el volumen de contenido producido y categorizarlo por tipo para evaluar la productividad y la diversidad de tu estrategia de contenidos.3. TráficoEl tráfico muestra lo bueno que es el contenido para atraer visitas a la web.Normalmente, las partes interesadas quieren conocer la evolución en el crecimiento del tráfico en lugar de solo la cantidad de clics o visitas en un período determinado. Mil clics más en un mes pueden ser excepcionales para un sitio web pero un mal resultado para otro.También es una buena idea desglosar el crecimiento del tráfico de la siguiente manera:Fuente: en el caso del contenido, será principalmente orgánico, correo electrónico, referencias (pero solo de las fuentes en las que influyó) y redes sociales. Incluye tráfico directo solo si realmente se correlaciona con el contenido. El tráfico de pago suele estar dentro del dominio del marketing de performance, pero si publicas algún anuncio de contenido, agrégalo también.Objetivo: esto depende de si tu objetivo es dirigir el tráfico a todo el sitio o a partes concretas, como las landing pages de los productos, la página de precios, la de contacto, etc.El tráfico es fácil de medir. Herramientas gratuitas como Google Analytics o Matomo deberían ser suficientes. Para tráfico orgánico de Google, asegúrate de usar Google Search Console.ConsejoGoogle Search Console te dará los datos de clics orgánicos más precisos, pero herramientas de SEO como Ahrefs te darán los medios para mejorarlo. Por ejemplo, puedes ver cómo queda tu sitio comparado con el de tus competidores (y desglosar su estrategia) o ver qué páginas ganaron y perdieron más tráfico en un período determinado.Los competidores orgánicos informan en Ahrefs que se muestra un cambio de rendimiento mes a mes.Para informes de tráfico, también puede que Ahrefs Carteras (Portfolio) te resulte una característica útil. Puedes realizar un seguimiento del tráfico orgánico y otras métricas de SEO para cualquier grupo de páginas. Por ejemplo, un conjunto de sitios web de su cliente, competidores o todos los directorios de contenido.4. Métricas de SEOLas métricas SEO (optimización para motores de búsqueda) te ayudan a comprender la visibilidad y el posicionamiento de tu contenido en motores de búsqueda.Hay una variedad de métricas que puedes incluir aquí, pero por lo que sabemos, las personas especialistas en marketing suelen incluir estas:Impresiones: con qué frecuencia aparece un sitio en los resultados de búsqueda.Posiciones: qué páginas se posicionan para una palabra clave determinada. Cuanto más altas sean las posiciones, más tráfico orgánico obtendrás.Cuota de conversación / cuota de voz (share of voice): porcentaje de todos los clics orgánicos posibles (de SERP) para las palabras clave rastreadas que llegan a tu web.Crecimiento de enlaces (backlinks): se refiere al aumento en la cantidad de enlaces entrantes que apuntan a una web durante un período específico. Vale la pena hacer seguimiento si estás haciendo contenido link bait (cebo para enlaces) o haciendo link building.Tráfico orgánico: ya tratado en el párrafo anterior. Se superpone con la categoría de métricas de SEO porque, en términos generales, el crecimiento del tráfico orgánico es el resultado de un SEO eficaz.Necesitarás dos tipos de herramientas para acceder a estas métricas: Google Search Console para tráfico orgánico (es decir, clics) e impresiones y una herramienta de SEO como Ahrefs para el resto.Si crees que quien reciba el informe solo tendrá interés en las métricas de nivel superior, puedes considerar incluir solo la cuota de voz y el tráfico orgánico.Puedes encontrar la métrica de cuota de voz en Rank Tracker de Ahrefs.Los beneficios de ser visible en Google son obvios, incluso para alguien que no sea especialista en marketing, por lo que enviarás un mensaje claro y contundente si demuestras con estas métricas que tu contenido hace que la marca se destaque en Google y, por eso, eres capaz de atraer más visitantes.Por otro lado, si tu audiencia es experta en SEO y ese canal es una parte importante de su estrategia, puedes hacer que tu informe brille con métricas adicionales que se explican en esta guía para informes SEO.Lecturas complementariasUna guía para principiantes sobre informes SEORoba nuestra plantilla de informe SEO (inspirada por expertos en SEO)5. Crecimiento de la audienciaMide el aumento de la audiencia de tu contenido a lo largo del tiempo, incluidos los nuevos suscriptores a newsletters (boletines), canales de vídeo/podcast y seguidores de redes sociales.El seguimiento de estas métricas ayuda a evaluar la eficacia de tu contenido para atraer y retener una audiencia en crecimiento. En otras palabras, el crecimiento de la audiencia muestra la demanda de más contenido como el que ya estás creando.Por ejemplo, en Ahrefs, hacemos un seguimiento del crecimiento de suscriptores en nuestro canal de Youtube, tanto en el principal AhrefsTV, como en español y otros idiomas, y simplemente utilizamos las métricas nativas de YouTube para eso.Una captura de pantalla real del crecimiento de la audiencia de nuestro canal de YouTube.6. EngagementLas métricas de engagement o interacción miden cuán activamente interactúa tu audiencia con tu contenido.A continuación mostramos algunas métricas de participación habituales seguidas por personas que se dedican al marketing de contenidos:Me gusta y comentarios en las redes sociales: puedes rastrearlos fácilmente con análisis nativos de plataformas de redes sociales o usando una herramienta como Buffer para recopilar todos los datos en un solo lugar.Participación en la lista de correo electrónico: estos generalmente incluyen cuántas personas abren tus correos electrónicos (tasa de apertura), cuántas hacen clic en los enlaces (tasa de clics) y picos en la tasa de cancelación de suscripción. Cualquier herramienta de email marketing cuenta con estas métricas.Tiempo en página: cuánto tiempo pasan las personas leyendo o interactuando con una página específica de tu web. Viene por defecto en GA4, necesita configuración en Matomo.Profundidad de scroll: cuán abajo se desplaza un visitante en una página. En muchos casos, un desplazamiento más profundo debería indicar que el contenido es lo suficientemente atractivo como para mantener el interés de los lectores. GA4 y Matomo se pueden configurar para mostrar un evento cuando se alcanza un umbral de desplazamiento predefinido (por ejemplo, 10, 25, 50%). Pero si quieres más datos sin necesidad de entrar en aspectos técnicos, puedes utilizar Hotjar o Microsoft Clarity.Informe de profundidad de desplazamiento en Microsoft Clarity.Casi nunca es malo obtener cifras altas en esas métricas. En un mundo ideal, indican que la gente realmente disfruta de tu contenido, pero, en realidad, estas métricas tienen bastantes matices. Por ejemplo, es menos probable que algunos tipos de contenido obtengan “me gusta” en redes sociales, y un corto tiempo en la página puede significar que las personas encontraron lo que buscaban y se fueron inmediatamente.Por lo tanto, puede ser mejor utilizar métricas de participación en el contexto adecuado.Utiliza “me gusta” y comentarios para comparar contenido. También puedes usarlo para medir el interés en nuevos tipos de contenido o temas.Utiliza la tasa de engagement en Twitter en lugar de la total: (Me gusta + retweets + respuestas) / (número total de seguidores)Utilice la velocidad de desplazamiento y el tiempo en la página solo para contenido largo, es decir, páginas destinadas a mantener al usuario un poco más de tiempo.7. ConversionesLas métricas de conversión miden la eficacia con la que tu contenido incita a las personas que lo ven a realizar una acción deseada, como registrarse para una prueba gratuita.Ejemplos:Correlación de ingresos/suscripciones con el tráfico: cuantas más personas visiten tu web, más oportunidades tendrás de convertir visitantes en suscriptores o clientes de pago.Crecimiento de la conversión desde la parte inferior del embudo de contenido: seguimiento de conversión solo para visitantes que puedan estar considerando comprar (comparaciones, informes técnicos, historias de éxito de clientes, etc.).Primera página que un cliente de pago ha visto: si tu contenido es la primera página que visita una persona y luego se convierte en cliente, significa que el contenido funciona.Descargas de contenido: las altas tasas de descarga pueden indicar que tu audiencia encuentra valioso el contenido de tu web.Leads (registros): personas que dejan información de contacto a cambio de acceso al contenido. Los especialistas en marketing suelen realizar un seguimiento de los MQL (marketing qualified leads, clientes potenciales cualificados para marketing) y SQL (sales qualified leads, clientes potenciales cualificados para ventas): personas que han mostrado interés y pueden estar listas para comprar en el futuro y contactos que probablemente estén listos para ser ya contactados por el equipo de ventas.Los clientes potenciales, las descargas e incluso las correlaciones entre ingresos y tráfico son bastante fáciles de rastrear (y probar). La mayoría de las herramientas que te permiten crear un formulario de recogida de datos para clientes potenciales tendrán análisis integrados, mientras que ChatGPT puede ayudarte a conseguir fácilmente otros elementos de análisis de datos más “esotéricos”, como la correlación.Análisis de correlación realizado íntegramente por ChatGPT.Pero si quieres demostrar que un contenido específico generó una cantidad X de ventas o una cantidad Y de ingresos recurrentes mensuales, será complicado. Básicamente, intentarás demostrar el retorno de la inversión del marketing de contenidos, algo que todo el mundo quiere saber, pero que nadie puede demostrar sin utilizar la palabra “probablemente”.Es muy probable que a las personas que lean tu informe, o incluso a ti, les guste conocer el “retorno de la inversión”, así que vamos a pararnos aquí por un momento.El problema con el ROI en el marketing de contenidos radica en los modelos de atribución imperfectos y los recorridos de los clientes no lineales. Ryan Law lo explica en su guía para calcular el ROI del contenido:¿Alguien se convirtió por un artículo o a pesar de él? Cuando leyeron varios artículos, ¿cuál tuvo el mayor impacto? Si alguien compra gracias a un anuncio, ¿deberíamos igualmente atribuírselo a la publicación del blog que leyó con anterioridad?Ryan Law, Director de marketing de contenidos en AhrefsLos customer journey o recorridos de los clientes rara vez son tan sencillos como esperaríamos. Una persona puede leer 50 artículos y nunca comprar nada; otra, podría leer un solo artículo, desaparecer durante un año e inmediatamente volver y comprar algo. ¿Qué papel jugó el contenido en estos casos?Dicho esto, el retorno de la inversión del contenido no es un tema que debas evitar. Básicamente, tienes dos opciones aquí:Intenta calcular el ROI utilizando métodos imperfectos pero razonables. Ryan explica tres de ellos en su guía.Asumir un retorno de la inversión del contenido positivo en base a su función estratégica. Básicamente, el ROI es un excelente argumento para dedicarse al marketing de contenidos, pero no es el único. El marketing de contenidos juega un papel estratégico porque tiene múltiples beneficios a los que es realmente difícil decir “no”. Piénsalo. Si todos los competidores crean contenido, ¿puedes permitirte el lujo de ser la excepción? ¿De qué otra manera demostrarás a la audiencia cómo el producto/servicio resuelve sus problemas? Si tu jefe o cliente duda sobre la idea misma del contenido, es una buena idea discutirlo y gestionar las expectativas antes de hacer todo lo posible.Lecturas complementariasROI del marketing de contenidos: cómo otorgar un valor en dólares a tu contenido8. Comentarios cualitativosFinalmente, termina tu informe con cualquier cosa que valga la pena mencionar y que vaya más allá de los datos sin procesar o de lo común.Podrían ser:Menciones en newsletters y otros sitios de contenido.Elogios y reconocimiento en redes sociales.Comentarios sobre la calidad del contenido por parte de la audiencia.Contenido mencionado por los prospectos en las conversaciones.Por ejemplo, uso Ahrefs todos los meses para buscar sitios que mencionen mis artículos. Este ejemplo muestra dos personas influyentes de la industria que enlazan con mi reciente estudio de SEO.Esta también es una buena oportunidad para mencionar comentarios operativos:Bloqueos o impedimentos, como baja disponibilidad del equipo de diseño.Proyecciones, por ejemplo, con el objetivo de recuperar el tráfico orgánico perdido, centrándose en la actualización de contenido antiguo.Oportunidades de mejora, como alinear el contenido más estrechamente con los objetivos de ventas.Reflexiones finalesNingún informe puede ser eficaz sin el apoyo de las partes interesadas. En lugar de insistir en un formato de informe específico, haz una muestra del informe, explica su valor y solicita comentarios. Eres el experto, pero él es el cliente, así que debes buscar un término medio.En cuanto a la frecuencia de presentación de informes, la norma es mensual, trimestral y anual. Además, se pueden preparar informes para campañas específicas, que pueden variar en duración. Nuevamente, esto es algo que vale la pena discutir con el destinatario del informe.¿Tienes preguntas o comentarios? Te esperamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Guía para medir el Marketing de Contenidos"
    },
    {
      "level": "H2",
      "text": "Prácticas recomendadas para informes de marketing de contenidos"
    },
    {
      "level": "H3",
      "text": "1. Basado en datos"
    },
    {
      "level": "H3",
      "text": "2. Accionable"
    },
    {
      "level": "H3",
      "text": "3. Funcional"
    },
    {
      "level": "H2",
      "text": "Qué incluir en un informe de marketing de contenidos"
    },
    {
      "level": "H3",
      "text": "1. Resumen"
    },
    {
      "level": "H3",
      "text": "2. Producción de contenido"
    },
    {
      "level": "H3",
      "text": "3. Tráfico"
    },
    {
      "level": "H3",
      "text": "4. Métricas de SEO"
    },
    {
      "level": "H3",
      "text": "5. Crecimiento de la audiencia"
    },
    {
      "level": "H3",
      "text": "6. Engagement"
    },
    {
      "level": "H3",
      "text": "7. Conversiones"
    },
    {
      "level": "H3",
      "text": "8. Comentarios cualitativos"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}