{
  "url": "https://ahrefs.com/blog/es/intencion-de-busqueda/",
  "slug": "intencion-de-busqueda",
  "title": "¿Qué es la intención de búsqueda? Una guía completa para principiantes",
  "description": "La intención de búsqueda es el motivo detrás de una búsqueda. Si quieres posicionar en Google, crear contenido que se alinee con la intención de búsqueda es crítico.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido ¿Quieres posicionar en Google en 2019? Necesitas crear contenido que alineado con la intención de búsqueda.Es difícil exagerar cuán importante es el concepto de intención de búsqueda para el SEO. No estoy exagerando cuando digo que si quieres posicionar en 2019 entender y crear contenido con la intención de búsqueda en mente es crítico.¿No me crees? Echa un vistazo a esto:¡Es un incremento del 677% en tráfico orgánico en una de nuestras landings más importantes en solo seis meses!¿Cómo lo conseguimos? Hicimos un pequeño cambio en la página para alinearla con la intención de búsqueda.En esta guía vas a aprender:Qué es la intención de búsquedaPor qué la intención de búsqueda importa en SEOLos cuatro tipos de intención de búsquedaCómo deducir la intención de la keywordCómo optimizar para la intención de búsquedaCómo incrementamos el tráfico en un 677% optimizando para la intención de búsqueda¿Qué es la intención de búsqueda?La intención de búsqueda es el ¿por qué? detrás de una consulta. En otras palabras, ¿por qué la persona ha realizado esta búsqueda? ¿Están tratando de hacer una compra? ¿O están buscando una web en concreto?Para ayudar a demostrar este concepto en más detalle he recorrido mi historial de búsqueda y he seleccionado unas cuantas búsquedas recientes.Lo que tienes que hacer es decirme cuál era mi “intención” cuando realicé cada una de esas búsquedas.(No te preocupes, ¡es juego limpio!)Esa última era un poco más difícil, ¿no? Volveremos a ella más tarde.Por qué es importante la intención de búsquedaEl objetivo de Google es ofrecer a los usuarios los resultados más relevantes para sus consultas.¿Cómo lo sabemos? Para empezar, el éxito de Google como negocio depende de que hagan eso bien. No tienes más que mirar a Bing para entender qué ocurre cuándo los resultados de un motor de búsqueda son de baja calidad e irrelevantes. Casi nadie lo usa, lo que implica menos ingresos por publicidad.Google también afirma que su misión es “organizar la información del mundo y hacer que sea útil y accesible para todos”. Y sí, ese es un gran regalo.Pero nosotros nos dedicamos al SEO. ¿Por qué nos importa algo de esto?Si quieres posicionar en Google en 2019 necesitas ser el resultado más relevante para esa búsqueda. Lo primero y más importante, y eso supone crear contenido que se alinee con la intención de búsqueda.Así que si estás tratando de posicionar en “mejor tarjeta de crédito” no intentes meter con calzador tu página landing en los resultados de búsqueda (SERPs). No vas a conseguirlo. Google sabe lo que los usuarios quieren ver cuándo realizan esta búsqueda y no es eso. Es información. Artículos de un blog, comparativas, etc.La relevancia es la base del éxito en SEO.Los cuatro tipos de intención de búsquedaAquí están los cuatro “tipos” principales de intención de búsqueda.InformativaEl usuario busca información. Puede ser una respuesta a una pregunta fácil tipo “¿quién es el presidente de Estados Unidos?”. O algo que requiera una respuesta algo más larga y compleja como “¿cómo funciona blockchain?”. Sin embargo, no todas las búsquedas informativas se realizan como si fueran preguntas.Ejemplos de búsquedas informativas:“¿Quién es Julian Assange?”“Dirección del aeropuerto de Manchester”“Donald Trump”“resultados del partido”“HTML 5”De navegaciónEl usuario busca por una web en concreto. Ya seben dónde quieren ir. Es probable que sea más rápido y fácil para ellos ir a Google que escribir la URL completa en la barra de navegación. También puede que no se sepan del todo la URL exacta.Ejemplos de búsquedas de navegación:“Facebook”“ahrefs content explorer”“guía SEO para principiantes moz”“Twitter login”TransaccionalEl usuario busca comprar algo. Están en modo compra. Lo más probable es que ya sepan lo que quieren comprar. Buscan un sitio donde hacerlo.Ejemplos de búsquedas transaccionales:“comprar macbook pro”“cupón nordvpn”“samsung galaxy s10 barato”“lastpass premium precio”Investigación comercialEl usuario está en el mercado en busca de un producto o servicio en concreto, pero todavía tiene que tomar la decisión final sobre qué solución es la mejor. Lo más probable es que busquen análisis, reviews y comparativas. Todavía están valorando sus opciones.Ejemplos de búsquedas de investigación comercial:“la mejor proteína en polvo”“mailchimp vs convertkit”“ahrefs review”“los mejores restaurantes en Londres”Este último ejemplo es destacable. Demuestra el hecho de que muchas búsquedas locales tienen una intención de investigación comercial detrás. Otros ejemplos incluyen: “fontaneros cerca de mí”, “hoteles baratos en Singapur”, etc.Cómo deducir la intención de búsquedaA menudo la intención de búsqueda es obvia por cómo está formulada la propia búsqueda.Por ejemplo, la keyword “comprar bitcoin”. Está claro que el que busca está en el mercado de compra de criptomoneda (transaccional). Por otro lado, alguien que busca “cómo hacer un nudi de corbata” está buscando una respuesta (de información).For example, take the keyword “buy bitcoin.” It’s clear that the searcher is in the market to buy some cryptocurrency (transactional). On the other hand, someone searching for “how to tie a tie” is looking for an answer (informational).Aquí van algunos “modificadores” de palabras clave que en general indican un tipo concreto de intención de búsqueda:Si estás usando una herramienta de keyword research como el Explorador de Keywords de Ahrefs, puedes usar esos modificadores para filtrar por palabras clave con intenciones de búsqueda específicas cuando hagas tu keyword research.Así que supongamos que estás buscando algunas keywords relevantes para posts de un blog. Primero, introduce unas pocas palabras clave semilla en el explorador de Keywords de Ahrefs, dale a buscar y elige uno de los informes del menú de la izquiera para ver algunas ideas de keywords. Te recomiendo el informe “Having same terms” (“tiene los mismos términos”) como punto de partida.Después, copia y pega los modificadores en la caja de “Include” (incluir) y activa “Any word” (cualquier palabra).Verás sólo palabras clave que contengan uno o más de esos modificadores.Puedes hacer lo mismo cuando estés buscando palabras clave transaccionales, de investigación comercial o de navegación. Simplemente copia y pega la lista de modificadores en la caja de “incluir” (include).TIP¿Buscas una forma rápida de encontrar keywords informativas? Prueba con el informe de Questions (preguntas) en el informe de Keywords Explorer. Así filtras por palabras clave tipo pregunta, que casi siempre tienen una intención informativa.Desde ahí puedes añadir más filtros para centrarte en las keywords que te interesan. Por ejemplo, si estás buscando temas poco competidos y de alto volumen, puedes añadir un filtro de Keyword Difficulty (KD, Dificultad de Keywords) y volumen (Volume).Pero hay un problema:Los modificadores no son infalibles porque no todas las keywords los tienen.Por este motivo, no deberías confiar exclusivamente con los modificadores para dedudir la intención de búsqueda. Si lo haces acabarás perdiéndote un montón de buenas ideas para keywords.Por suerte…La respuesta está en las SERPs(SERPs: Search Engine Results Page, las páginas de resultados del buscador).¿Alguna vez has buscado en Google y visto algo como esto en los resultados?Es lo que se conoce como un fragmento destacado (o featured snippet). Es una de las muchas funcionalidades que aparece en la página de resultados que ofrece Google a veces. Otras incluyen:Resultados de compra.Knowledge card.Anuncios de AdWords.Preguntas relacionadas.Resultados de vídeo.Aquí explicamos por qué es importante:Google tiende a mostrar ciertas funcionalidades en las SERP con mayor o menor frecuencia, dependiendo de la intención de búsqueda. Esto quiere decir que podemos utilizar la presencia (o no presencia) de estas funcionalidades en la página de resultados para ayudarnos a deducir la intención de búsqueda de una consulta.Por ejemplo, los fragmentos destacados tienden a aparecer sobre todo en búsquedas informativas, mientras que los resultados de compra y los carruseles solo aparecen en búsquedas con una intención transaccional.Aquí va una guía (muy) aproximada:Para encontrar palabras clave con una funcionalidad SERP en concreto simplemente incluye o excluye palabras clave con dicha funcionalidad SERP dentro del informe que hayas elegido en el Keywords Explorer de Ahrefs.Por ejemplo, si estuviera buscando palabras clave con intención transaccional o comercial, puedo llegar a elegir solo keywords con funcionalidades SERP de compra (shopping):Si estuviera buscando palabras clave con intención informativa, podría enfocarme en SERPs con fragmentos destacados, knowledge panels (paneles de conocimiento), cajas de “búsquedas de otros usuarios” y similares:Tiene sentido, ¿no?Sin embargo, ten en cuenta que buscar la presencia de funcionalidades SERP no es algo 100% infalible. Hay muchas palabras clave informativas sin fragmentos destacados o paneles de conocimiento. Y hay muchas búsquedas transaccionales sin carruseles de compra o anuncios de AdWords.Por ejemplo, fíjate en las funcionalidades SERP presentes en “bose headphones” (“auriculares bose”):Es claramente una búsqueda transaccional, pero no hay anuncios de compra ni ninguna otra funcionalidad SERP que nos lo indique.Aquí hay otro punto importante:La intención de compra no es siempre binaria. Muchas SERPs presentan resultados mixtos de intención de búsqueda.Para ilustrar esto, echa un vistazo a los primeros resultados de “grainfather”:El Grainfather es una pieza de equipamiento para la elaboración de cerveza. Así que la mayoría de la gente que realiza esta búsqueda está en modo compra. Por eso la mayor parte de resultados son páginas de producto.Pero el resultado en la posición #4 es una review de producto, lo que indica que esta búsqueda tiene una intención mixta.En otras palabras, aunque la mayoría de las personas que realizan esta búsqueda están en modo compra, algunos están intentando aprender más sobre el producto antes de comprarlo.Cómo optimizar por intención de búsqueda (en 3 pasos)La intención de búsqueda debería dictar el tipo de contenido que creas.Si la palabra clave tiene intención informativa, escribe un post para el blog. Si tiene intención transaccional, crea una página de producto. Ya tienes la clave.Pero ¿son las cosas realmente tan fáciles? Bueno, sí y no.Aunque es evidente que tiene sentido alinear tu contenido con la intención de búsqueda hay un problema:Los cuatro grupos de intención de búsqueda son demasiado amplios para ser accionables.Por ejemplo, sabemos que “HTML 5” es una búsqueda informativa. Pero saber esto no nos dice qué tipo de contenido quiere en realidad ver la persona que está buscando. O lo que quieren saber. O qué formato deberíamos usar para presentar la información.Para optimizar de verdad por intención de búsqueda, necesitamos profundizar y analizar las SERPs en más detalle.Aquí está cómo hacerlo, paso por paso:Paso 1. Comprobar la “fiabilidad de la SERP”Los resultados de Google no son estáticos. Fluctúan y cambian a lo largo del tiempo.Al basarte en la naturaleza de los primeros resultados actuales para deducir la intención de búsqueda, puede ser un problema. Lo que estás haciendo es juzgar la intención de búsqueda basándote en una sola instantánea en el tiempo.Si fueras a analizar los principales resultados el próximo mes, o el siguiente, tu comprensión de la intención de búsqueda podría cambiar.Por esta razón, ayuda también comprobar el historial de resultados de tu palabra clave objetivo.Para hacer esto, pega tu keyword en el Keywords Explorer de Ahrefs y haz scroll hasta que llegues al gráfico de histórico de posicionamiento.Nota al margen. Recomiendo cambiar el gráfico para mostrar datos de seis meses. En general es más comprensible. Vamos a ver cómo interpretar este gráfico.Poca o ninguna fluctuación en los resultados a lo largo del tiempo.Esto indica que las páginas de resultados actuales son una buena aproximación de la intención de búsqueda.Por ejemplo, echa un vistazo al gráfico de “how to write a resume” (“cómo escribir un CV”):Casi no ha habido ningún cambio en los primeros resultados a lo largo de los últimos seis meses.Veredicto: Son buenas keywords en las que intentar posicionarse porque la intención de búsqueda es clara.Fluctuación de algunas páginas pero no de otras.Esto indica que algunas de las páginas que mejor posicionan son una buena aproximación para la intención de búsqueda.Echemos un vistazo a la búsqueda “notre dame”.Si nos enfocamos en los primeros 3 resultados, vemos que las posiciones de dos de los mismos (las líneas verde y morada) han permanecido consistentes a lo largo del tiempo. Ambas páginas son sitios oficiales. Una es la univeridad y la otra es Notre Dame Athletics.Esto nos indica que hay un interés consistente en estas dos cosas y que la mayor parte de usuarios están buscando uno de estos dos sitios… O al menos información relacionada.Pero en la posición #3 tenemos una página de la Wikipedia (línea azul) que fluctúa a lo loco.Este es un artículo relativamente básico de la catedral de Notre Dame.Google parece que no está seguro de si es un buen encaje para la intención de búsqueda, algo no muy sorprendente. Ninguna de las otras páginas en los resultados principales tratan sobre la catedral de Notre Dame, si no sobre la universidad. Así que parece claro que los usuarios no están buscando una página como esta.Veredicto: pueden ser buenas palabras clave para posicionar. Simplemente asegúrate de que tu contenido se alinee con la intención de búsqueda dominante.Las cosas cambiaron en abril de 2019…Escribí este post antes del desafortunado incidente de abril de 2019, cuando un incendio arrasó la catedral de Notre Dame. Si miras ahora el gráfico histórico de la SERP para esta palabra clave verás que algunos resultados nuevos han entrado en la misma, todos relacionados con los sucesos recientes.El algoritmo de Google favorece estos resultados ahora porque saben que es la información que buscan los usuarios.Mucha fluctuación en los resultadosEsto indica una de estas dos cosas:La intención de búsqueda cambia constamente.A Google le está costando entender la auténtica intención detrás de esa búsqueda.Incluso pueden ser las dos.Por ejemplo, echemos un vistazo a la búsqueda “mercury” (“mercurio”).Google no parece tener claro si la gente está buscando información sobre el planeta Mercurio o el elemento mercurio.Veredicto: Estas keywords no son muy buenas para intentar posicionarse porque la intención de búsqueda no está clara.Un punto de vista alternativoComo mencioné en nuestro puesto sobre la Keyword Difficulty (dificultad de las palabras clave) algunos SEO ven en las SERPs caóticas una oportunidad para posicionarse: Esta SERP tiene escrito oportunidad por todas partes pic.twitter.com/dZ5nj5rQ06— nick eubanks (@nick_eubanks) 20 de abril de 2019Esto es porque Google claramente no está feliz con los resultados actuales, y elige no posicionar a ninguno de ellos en las primeras posiciones más de unos pocos días seguidos. Así que si puedes entender la intención de búsqueda el posicionamiento será tuyo.Pero aunque cierto, también nos indica que es algo difícil de conseguir.Si Google no tiene ni idea de lo que los usuarios están buscando es probable que tú tampoco. También puede ser el caso de que la intención de búsqueda esté cambiando continuamente, en cuyo caso posicionar en el largo plazo será casi imposible.Paso 2. Asegúrate que tu contenido se alinea con las “3 C’s de la intención de búsqueda”.Ahora que sabes que la keyword elegida es sólida (es decir, que tiene una clara intención de búsqueda) la siguiente tarea es analizar los resultados de búsqueda en función de lo que nos gusta llamar “las 3 C’s de la intención de búsqueda”.Tipo de ContenidoFormato de ContenidoÁngulo del ContenidoVamos a ver este proceso en más detalle.1. Tipo de ContenidoEsto se refiere al “tipo” general de contenido en los resultados de búsqueda y generalmente es uno de los siguientes:Post del blogPágina de productoPágina de categoríaPágina landingPor ejemplo, echa un ojo a los primeros resultados de “how to make pancakes” (“cómo hacer pancakes” ):Puedes deducir por los propios títulos que son todo posts de blogs.Ahora echa un vistazo a los resultados de búsqueda de “buy pink dress” (“comprar vestido rosa”):Puedes deducir de los títulos y URLs que todos los resultados son páginas de categoría de ecommerce, como esta:Si miramos a los resultados de búsqueda de “buy roomba 980” (“comprar roomba 980”) lo que vemos son páginas de producto:Eso es porque estamos buscando comprar un producto concreto y no solo un tipo de producto.Tu tarea es buscar el tipo de contenido dominante en los resultados de búsqueda y después asegurarte de que tu contenido se alinea con él.2. Formato de ContenidoNos referimos al “formato” de las páginas que mejor posicionan. Algunos formatos comunes incluyen:Guías “cómo hacer” (“how-to”)Tutoriales paso a pasoPosts de listados o listasArtículos de opinioónAnálisios y ReviewsComparativasHay muchos formatos distitnos, pero esto debería darte una idea de en qué fijarte.Por ejemplo, si miramos los resultados de “how to make pancakes” (“cómo hacer pancakes”) vemos que la mayoría son guías que explican cómo hacerlos:Por otro lado, la mayor parte de los resultados de “best places to travel in italy” (“los mejores lugares para viajar en italia”) son posts tipo lista:Para búsquedas como “how to write a resume” (“cómo escribir un CV”) lo que vemos es que la mayoría son guías paso a paso como esta:Cuando creas contenido tiene sentido seguir a las masas.Si la mayoría de los primeros resultados son guías explicativas tipo “how-to”, crea una guía explicativa. Si son posts tipo lista, crea un post con un listado. Seguro que captas la idea.nota importanteEl “formato” de contenido aplica principalmente a las búsquedas informativas y de investigación comercial. Esto es porque se trata del tipo de búsquedas donde los posts de blogs tienden a posicionarse.Cuando se trata de búsquedas transaccionales no hay mucho que decir sobre el formato del contenido. Nueve de cada diez veces será una página de producto o de categoría. Así que el formato de contenido en general se alinea con el “tipo” de contenido.3.Ángulo del contenidoEsto se refiere al valor diferencial de los posts y páginas que están en las primeras posiciones y nos da una idea de lo que los usuarios valoran cuando realizan esta búsqueda en concreto.Por ejemplo, si miramos a los resultados de búsqueda de “how to make pancakes” (“cómo hacer pancakes”) podemos ver algunos ángulos diferentes, pero parecidos, en los resultados.Por señalar algunos:“Perfect pancakes” (“Pancakes perfectos”)“Good old-fashioned pancakes” (“Buenos pancakes de toda la vida”)“Fluffy pancakes” (“Pancakes esponjosos”).Si realizamos una búsqueda transaccional como “buy glasses online” (“comprar gafas online”) vemos que muchos de los vendedores están destacando sus bajos precios y descuentos directamente en los resultados.Esto es una señal de que el precio es un impedimento para los que buscan comprar gafas online.Muchos retailers también mencionan la palabra “prescription” (prescripción, receta), lo que indica que los usuarios buscan “prescription glasses” (gafas graduadas), en lugar de gafas de sol, para eclipses o de cualquier otro tipo.El truco para optimizar el ángulo del contenido es, una vez más, seguir a las masas.Eso no quiere decir que los tengas que copiar, pero si todos están destacando el precio en su contenido, en la etiqueta de título y en las meta-descripciones y tú destacas la calidad, es posible que no reme en tu favor.Paso 3. Toma nota de los resultados de búsqueda y de las páginas en primeras posicionesTodo lo que hemos discutido hasta ahora funciona genial para hacerse una idea general de la intención de búsqueda y decidir qué tipo de contenido necesitas crear. Pero si vas en serio a la hora de apuntar a una keyword necesitas analizar en más detalle tanto las SERPs como las páginas mejor posicionadas.Es la única forma de entender de verdad lo que la gente quiere ver y de qué debería hablar tu contenido.Debajo hay tres formas de hacerlo:1) Mira la caja “People also ask” (“otras preguntas de los usuarios”) en las SERPsLa caja “otras preguntas de los usuarios” te dice qué preguntas suelen realizar los usuarios.Por ejemplo, echa un vistazo a los resultados de “best protein powder” (“mejor proteína en polvo”):Estas son las preguntas a las que quieres responder en tu contenido.TIPPara ver más preguntas en la caja de “otras preguntas de los usuarios” haz click en la marca (^) de una de las preguntas relacionadas. En cuanto lo hagas, Google mostrará más.Nota al margen. No todas las SERPs tienen una caja de “otras preguntas de los usuarios”. Esto es más útil para búsquedas informativas.2. Realiza un análisis de brecha de contenidos (content gap) a nivel de páginaUn análisis de brecha de contenidos (content gap analysis) se usa normalmente para encontrar huecos a nivel de dominio.Pero también puedes hacer un análisis de brecha de contenidos a nivel de página. Y esto te puede dar alguna idea de qué subtemas esperan los usuarios que cubras en tu página.A modo de ilustración, vamos a pegar algunas de las páginas que mejor posicionan para “best protein powder” (“mejor proteína en polvo”) en la herramienta Content Gap de Ahrefs. Dejamos la caja de abajo en blanco y le damos a buscar.Ahora, hay algunas cosas obvias como “best whey protein” (“mejor proteína de whey”) y “best protein shakes” (“mejores batidos de proteína”). Pero son más que nada sinónimos y otras formas de buscar lo mismo.Sin embargo, también vemos búsquedas como:best protein for building muscle (la mejor proteína para ganar músculo)best post workout protein (la mejor proteína post entreno)best lean protein powder (la mejor proteína en polvo ligera)types of protein powders (tipos de proteína en polvo)A partir de estos ejemplos podemos decir que los usuarios en general intentan ganar músculo y quieren un batido de proteína post-entreno ligero. También tienen interés en los tipos diferentes de proteína en polvo, que asumo que es lo que quieren decir whey, casein (caseína), hemp (cáñamo),…3. Visita las primeras páginasNada te da una idea más clara de la intención de búsqueda que visitar las páginas que ya están en los primeros resultados.De hecho, no hay otra forma de entender de verdad lo que los usuarios quieren ver.A modo de ejemplo, si hacemos esto para los primeros resultados de “best protein powder” (“mejor proteína en polvo”) nos damos cuenta de que algunas de las páginas hablan de los mejores tipos de proteína en polvo (whey, caseína, proteína de huevo, cáñamo, etc.)…… y otras hablan sobre los mejores productos de proteína en polvo para comprar:Así que parece que hay dos interpretaciones distintas de “best protein powder” (“mejor proteína en polvo”).(Nada en las SERPs nos indica esto).Si fueras a crear un contenido sobre este tema, tendrías que tomar una decisión sobre qué ángulo es el mejor para tu contenido. También existe la posibilidad de cubrir ambos ángulos hasta cierto punto.Aquí van algunas cosas de las que me doy cuenta en la intención de búsqueda tras mirar a las páginas que mejor posicionan:Las imágenes y recursos visuales son importantes: los usuarios quieren ver realmente qué proteínas en polvo son los mejores.Los enlaces para comprar ayudan: la mayor parte de las páginas en el ranking tienen enlaces rápidos para comprar proteína en polvo de Amazon u otros sitios. Tiene sentido y realmente es importante, ya que esta keyword es de investigación comercial.La segmentación por dieta es importante: la gente no quiere una lista genérica de las mejores proteínas en polvo. Quieren saber cuáles la mejor para una dieta en concreto. Así que incluir algo de información sobre productos vegetarianos, veganos o sin gluten es imprescindible.En resumen: revisa siempre las primeras páginas en los resultados antes de crear el contenido. Caso práctico #1: un crecimiento del +677% en tráfico por optimizar la intención de búsquedaEn 2017 creamos una landing para posicionar en la keyword “backlink checker” (“verificador de backlinks”), con 14.000 búsquedas mensuales.Aquí está:Puedes ver la página completa gracias a la Wayback Machine aquíDurante un par de años esta página se comportó razonablemente bien y nos trajo unos cuantos miles de visitantes orgánicos, pero nunca llegó a estar en el top 5 de nuestra palabra clave objetivo.Parecía que se quedaba atascada entre las posiciones 6-10.Pero entonces, el 13 de septiembre de 2018, hicimos un pequeño cambio en esa página… ¡y el tráfico se disparó!¡La página ahora recibe más de 53.000 visitas mensuales de búsquedas orgánicas!Eso es un crecimiento del 677%… ¡en menos de seis meses!También saltó al número uno de nuestra palabra clave objetivo…Y ahí ha seguido desde entonces.Nota al margen.Esta página incluso ha sobrevivido a un enorme ataque SEO negativo. Alguien apuntó miles de enlaces de baja calidad y spameros a la página, pero sigue creciendo con fuerza. Y ni siquiera hemos desautorizado ningún enlace.Así pues, ¿qué cambió?Básicamente miramos a los resultados que estaban en los primeros puestos y nos dimos cuenta de algo importante sobre la intención de búsqueda:Los usuarios estaban buscando una herramienta gratuita de comprobación de backlinks, no una página landing aburrida.Así que les dimos lo que querían:Nuestra página ahora puede alardear de lo que creemos que es el mejor comprobador de backlinks gratuito de Internet.Tampoco es la única vez que hemos visto pasar esto.Caso práctico #2: un crecimiento del +3.100% en tráfico por optimizar la intención de búsquedaEn 2016 estudiamos los factores de posicionamiento SEO on-page a lo largo de 2 millones de keywords.Aquí se puede ver el aspecto del post original, cortesía de la Wayback Machine:Nota al margen. Aquí puedes ver el post completo en la Wayback Machine. El post en sí mismo era bueno, pero nunca posicionó en nada ni recibió mucho tráfico.Así que miramos a las páginas que estaban en los primeros puestos para tratar de entender el porqué y pronto nos dimos cuenta de que la intención de búsqueda era el problema.Básicamente, los usuarios no querían ver un estudio; querían ver una guía accionable.Así que eso es lo que creamos.Ahora el post posiciona en el top 5…… ¡y el tráfico ha crecido en un 3.100%!Pensamientos finalesLa intención de búsqueda es quizá el “factor de posicionamiento” más importante en 2019.Falla en ofrecer a los usuarios lo que quieren y tus posibilidades de posicionar son prácticamente nulas. Hemos visto esto una y otra vez con el contenido que publicamos en el blog de Ahrefs.Incluso si consigues “engañar” a Google por un corto período de tiempo y posicionas con una página de baja calidad o que no encaje, puedes apostar todo lo que tengas a que al final se darán cuenta. Puede ser mañana, el mes que viene o el próximo año, pero cuando lo hagan tu posicionamiento caerá como una piedra.Si quieres posicionar en el largo plazo, haz que tu misión sea ofrecer a los usuarios lo que quieren. Casi seguro que Google siempre te recompensará por ello.Tra­duci­do por Iván Fanego, que en sus ratos libres anal­iza y com­para soft­ware para empre­sas en App­Crit­ic. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Intención de búsqueda: el “factor de posicionamiento” que se pasa por alto y por el que deberías estar optimizando en 2019"
    },
    {
      "level": "H2",
      "text": "¿Qué es la intención de búsqueda?"
    },
    {
      "level": "H2",
      "text": "Por qué es importante la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "Los cuatro tipos de intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "Informativa"
    },
    {
      "level": "H3",
      "text": "De navegación"
    },
    {
      "level": "H3",
      "text": "Transaccional"
    },
    {
      "level": "H3",
      "text": "Investigación comercial"
    },
    {
      "level": "H2",
      "text": "Cómo deducir la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "La respuesta está en las SERPs"
    },
    {
      "level": "H2",
      "text": "Cómo optimizar por intención de búsqueda (en 3 pasos)"
    },
    {
      "level": "H3",
      "text": "Paso 1. Comprobar la “fiabilidad de la SERP”"
    },
    {
      "level": "H4",
      "text": "Fluctuación de algunas páginas pero no de otras."
    },
    {
      "level": "H4",
      "text": "Mucha fluctuación en los resultados"
    },
    {
      "level": "H3",
      "text": "Paso 2. Asegúrate que tu contenido se alinea con las “3 C’s de la intención de búsqueda”."
    },
    {
      "level": "H4",
      "text": "1. Tipo de Contenido"
    },
    {
      "level": "H4",
      "text": "2. Formato de Contenido"
    },
    {
      "level": "H4",
      "text": "3.Ángulo del contenido"
    },
    {
      "level": "H3",
      "text": "Paso 3. Toma nota de los resultados de búsqueda y de las páginas en primeras posiciones"
    },
    {
      "level": "H4",
      "text": "1) Mira la caja “People also ask” (“otras preguntas de los usuarios”) en las SERPs"
    },
    {
      "level": "H4",
      "text": "2. Realiza un análisis de brecha de contenidos (content gap) a nivel de página"
    },
    {
      "level": "H4",
      "text": "3. Visita las primeras páginas"
    },
    {
      "level": "H2",
      "text": "Caso práctico #1: un crecimiento del +677% en tráfico por optimizar la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "Caso práctico #2: un crecimiento del +3.100% en tráfico por optimizar la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "Pensamientos finales"
    }
  ],
  "author": "Joshua Hardwick"
}