{
  "url": "https://ahrefs.com/blog/es/investigacion-de-mercados/",
  "slug": "investigacion-de-mercados",
  "title": "Investigación de Mercados: Qué Es y Cómo Hacerla",
  "description": "La investigación de mercados es un proceso de recogida, análisis e interpretación de la información sobre un mercado dado.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido La investigación de mercados es un proceso de recogida, análisis e interpretación de la información sobre un mercado dado. Tiene en cuenta datos geográficos, demográficos y psicológicos sobre clientes pasados, actuales y potenciales, así como el análisis competitivo para evaluar una propuesta de producto.En otras palabras, es el proceso de entender a quién se dirige tu negocio para que puedas posicionar mejor tu estrategia de marketing.En esta guía aprenderás:El papel de la investigación de mercados en una estrategia de marketingCuándo realizar investigación de mercadosTipos de investigación de mercadosMétodos de investigación de mercados y sus beneficiosCómo realizar investigación de mercados (ejemplo incluído)Herramientas de investigación de mercados y recursos¿Cuál es el papel de la investigación de mercados en una estrategia de marketing?Una estrategia de marketing es el plan de juego general de una empresa para llegar a los consumidores y convertirlos en clientes.La palabra clave en la definición de arriba es “plan de juego”. Entrar en un mercado con un producto es como empezar una nueva partida. Como eres nuevo en el juego, no conoces las reglas, y no sabes contra qué te vas a enfrentar.Aquí es exactamente dónde entra la investigación de mercados. La investigación de mercados te permite descubrir las reglas del juego de marketing entendiendo a tu audiencia objetivo. Más aún, te permite entender quién es tu oponente entendiendo las fortalezas y debilidades de tu competencia.La investigación es lo que los profesionales del marketing hacen para planificar sus movimientos y superar a su competencia. También es lo que los profesionales del marketing usan para identificar las fortalezas y debilidades de su propia estrategia de marketing.Pero, ¿es la investigación de mercados el oráculo de empresa definitivo? Por desgracia, no. Incluso las empresas que se especializan en investigación de mercados lo admiten - aquí va una cita de una de ellas:(…) no puede asumirse que la investigación de mercados es una ciencia exacta, ya que sería poco realista e irracional esperar que los investigadores de mercados predigan la demanda exacta de un nuevo concepto, dado que existen numerosas variables que pueden impactar la demanda fuera de la jurisdicción de los especialistas en investigación de mercados.Eso es por lo que la investigación de mercados, con toda su importancia, es “solo” una parte del marketing y es “solo” un experimento. Depende de ti si llevas a cabo tu experimento y cuándo lo vas a terminar.Por ejemplo, Crystal Pepsi parecía muy prometedora en la fase de investigación de mercados y aún así fracasó cuando se lanzó al mercado (algo parecido pasó con New Coke). La idea de Xerox de una fotocopiadora comercial era un fracaso a los ojos de los analistas investigadores. Xerox la lanzó de todas formas y el resto es historia.¿Cuándo deberías realizar investigación de mercados?Paul N. Hauge y Peter Jackson apuntan a tres situaciones concretas en su libro “Do Your Own Market Research” (Haz tu Propia Investigación de Mercados) donde la investigación de mercados es realmente útil: Establecer objetivos. Saber cosas como el tamaño del mercado o definir tus clientes potenciales pueden ayudarte a establecer tus objetivos de ventas. Resolución de problemas. ¿Ventas bajas? ¿Pocos beneficios? La investigación de mercados te ayudará a entender si tus problemas son internos, algo como un producto de baja calidad, o externos, como mucha competencia. Apoyar el crecimiento de la empresa. Entender cómo y por qué los clientes deciden respecto a los productos te ayudará a decidir qué productos introducir en el mercado.Otra respuesta al “cuándo” es la importancia de la decisión que tienes que tomar. Cuanto más importante es el tema de marketing más importante al que te enfrentas, más útil resulta la investigación de mercados.Por ejemplo, el lanzamiento de un nuevo coche al mercado es algo bastante grande, ¿verdad? Así que quizá Ford podría haber evitado perder 350 millones de dólares con el Ford Edsel si hubieran hecho su investigación adecuadamente. Quiero decir, con los métodos adecuados, no debería ser tan difícil predecir lo que los clientes van a juzgar el coche como excesivamente caro y feo.Dicho esto, la investigación de mercados no siempre tiene que ser un proyecto largo y complejo. La tendencia relativamente nueva de investigación de mercados ágil o agilete permite investigar el mercado de forma regular de una forma efectiva en costes. Aquí es donde empleas métodos de tamaño reducido, iterativos y evolutivos para reaccionar con rapidez a las circunstancias cambiantes y adaptarte a territorios desconocidos de mercado.Además, si trabajas en condiciones de startup, especialmente si estás desarrollando un producto innovador, puede que te interese el desarrollo de clientes. En esta metodología la investigación de mercados se encuentra en su estado “más ágil” y está íntimamente relacionada con el proceso de desarrollo de producto.Tomemos Ahrefs, por ejemplo. Nos ceñimos a trucos de investigación de mercados ágil que cualquiera pueda usar. Como verás después en este artículo, podemos usar cosas fáciles (¡pero efectivas!) como encuestas en redes sociales, crowdsourcing, análisis competitivo in-house o simplemente siguiendo el precio de nuestros competidores.A modo de ejemplo, hace poco le preguntamos a nuestros compañeros marketeros en Twitter cómo van investigando el mercado. Parece que la investigación de mercados existe de todas formas y colores:Have you ever performed “market research?”What was it for?— Tim Soulo (@timsoulo) May 3, 2021 ¿Alguna vez hashecho investigación de mercados?¿Para qué fue?Tipos de investigación de mercadosSolo porque alguien haga investigación de mercados de cierta forma no quiere decir que tengas que copiarlo. Deberías conocer tus opciones y eso empieza con los distintos tipos de investigación de mercados.Investigación primariaCuando la investigación la haces tú o se hace en representación tuya y necesitas crear los datos para resolver un problema dado, se llama investigación de datos primaria.Ejemplos: Focus groups, entrevistas, encuestas (más sobre esto más adelante en el artículo). Beneficios clave: Es específica para tu marca y productos o servicios y controlas la calidad de los datos.Investigación secundariaCuando usas datos ya existentes, como los que reúnen otras empresas y organizaciones, estás haciendo investigación de mercados secundaria.Ejemplos: fuentes de segunda y tercera parte, como artículos, whitepapers, informes, estadísticas sectoriales, datos internos ya recogidos.Beneficios clave: Consigue una perspectiva macro de tu mercado, pues la investigación secundaria incluye otros actores en el marco, y más probablemente usa un conjunto de datos más grande que tus fuentes primarias.Investigación primaria vs. secundariaLa investigación primaria y secundaria de mercados son distintas, pero no opuestas. Normalmente se recomienda hacer las dos.Mientras que las fuentes primarias te darán acceso a una perspectiva micro y enfocada de tu negocio, la investigación secundaria te dirá cómo van otros negocios y cómo se pueden comparar los hallazgos de tu investigación con muestras más grandes de investigación.Subtipos de investigación de mercadosUn poco más de teoría para todos los geeks del marketing que hay por aquí. Los profesionales de la investigación de mercados distinguen entre los siguientes subtipos de investigación de mercados primaria y secundaria: Investigación cualitativa. Piensa en entrevistas, preguntas abiertas, resultados expresados en palabras más que en números y gráficos. Este tipo de investigación se usa para entender las razones subyacentes, opiniones y motivaciones. Investigación cuantitativa. Piensa en encuestas, sondeos, resultados expresados en números y estadísticas. Este tipo de investigación se usa para probar o confirmar hipótesis o supuestos al cuantificar variables definidas (como opiniones o comportamientos) y generalizar resultados de muestras de datos más grandes.Perspectiva general de métodos de investigación de mercados y sus beneficiosVamos a ver algunos métodos conocidos de investigación de mercados que puedes usar por ti mismo y/o subcontratar.Datos internos de análisisLos datos que ya has recogido en tu empresa son una fuente de datos de investigación secundaria de gran valor. Cuanto más tiempo lleves en el negocio, más datos tienes en tus manos.Lo mejor sobre los datos internos es que se han puesto en práctica en condiciones de mercado reales, así que solo necesitas encontrar los patrones y extraer condiciones.Aquí hay algunas fuentes de datos internos en las que te puedes apoyar:Datos del sitio web (como Google Analytics)Datos del CRMDatos de rendimiento de campañas pasadas Entrevistas internas con empleadosEntrevistasLas entrevistas te permiten discusiones cara a cara y son geniales para la investigación exploratoria cualitativa.En entrevistas no estructuradas, tienes un conjunto dado de temas informal, una conversación que fluye libremente.En las entrevistas estructuradas preparas un protocolo de entrevistas riguroso y detallado donde listas cada pregunta que quieres hacer y no puedes desviarte de las mismas.También puedes elegir el “camino de en medio” con entrevistas semi-estructuradas que giran alrededor de temas predefinidos o preguntas, pero que permiten discusiones abiertas.Un consejo aquí sería siempre permanecer neutral o sin sesgos, incluso durante las encuestas no estructuradas. También, ayuda realizar una prueba piloto de la entrevista para detectar rápidamente algunos defectos en el protocolo.Grabar la entrevista puede influir en las preguntas, así que hazlo cuando merezca la pena.Focus groupsLos focus groups es donde grupos de 5 a 10 personas con características comunes toman parte en una discusión interactiva con un moderador. Se usan para aprender cómo un grupo particular piensa sobre un asunto dado o para dar feedback de un producto.Puede que sepas que Steve Jobs odiaba abiertamente los focus group. Está registrado que ha dicho:Es realmente difícil diseñar productos con focus groups. Muchas veces la gente no sabe lo que quiere hasta que se lo muestras.Si estás intentando crear un producto que suponga un salto de nivel como el iPhone, probablemente hay alguna validez en esta afirmación. Pero la mayoría de nosotros no estamos peleando a ese nivel de ambición. Solo queremos saber si a los clientes les gustará una nueva característica propuesta o no. Para esto, los focus groups son súper útiles.EncuestasLas encuestas suponen sondear a tu audiencia. Normalmente se realizan online para investigar la satisfacción del cliente y fidelidad y son una de las formas de investigación más populares y efectivas en costes.Algunos de los casos de uso probados de encuestas online son:Deseabilidad de características de productosSatisfacción de usuarioAnálisis cuantitativo de ciertos problemasIdentificar puntos de fricción en tu customer journeyDescubrir las razones para contratar o cancelar tu servicioDurante el proceso de onboarding de producto para crear un perfil de cliente (y para marketing automation)Opinión sobre un cambio realizado recientementeUn ejemplo interesante de encuestar al mercado es el crowdsourcing. Eso es lo que hace Ahrefs para entender qué funcionalidades crear, cómo de importantes son y qué esperan los clientes de las mismas.Lo que hace único al crowdsourcing es que permite a los usuarios añadir sus propias ideas y votar o comentar sobre ideas existentes más que responder preguntas determinadas, así que este método deja menos espacio para la miopía de marketing. Mejoras tu negocio y los usuarios reciben un producto mejor—todo el mundo gana.Cómo hacemos crowdsourcing de ideas en AhrefsLas redes sociales son otro gran lugar para encuestar al mercado.How many of you have disavowed links in GSC this year?— Tim Soulo (@timsoulo) October 8, 2020¿Cuántos de vosotros habéis desautorizado enlaces en GSC este año?Segmentación de mercadoLa segmentación de mercado es la práctica de categorizar un mercado en grupos homogéneos en base a criterios específicos, también conocidos como variables de segmentación (como edad, sexo, tamaño de la empresa, país, etc.)Si crees que estás construyendo un producto para todo el mundo, piensa de nuevo. No todo el mundo querrá comprarte a ti.Las empresas inteligentes eligen su audiencia objetiva con cuidado. Ubican grupos de gente u organizaciones que podrían ser clientes valiosos para el negocio. De esa forma también descubren sus clientes no ideales y desarrollan un plan para atraer segmentos de clientes de forma gradual.¿Alguna vez te has preguntado por qué Procter and Gamble crea tantas marcas, a menudo competencia entre ellas? Lo has adivinado: segmentación de mercados. P&G simplemente divide y conquista. Personas distintas tienen necesidades distintas, así que necesitan productos distintos (y posiblemente marcas).Análisis competitivoOtro método de investigación de mercados poderoso, que muchas veces se pasa por alto, es el proceso de entender el entorno de mercado. En serio, si hay una sola cosa que puedas hacer para entender qué funciona y qué no en tu mercado, deberías hacer un análisis competitivo.“Cada vez que debatimos sobre crear cierta funcionalidad, definitivamente investigamos a nuestros competidores y vemos cómo lo hacen ellos.”Tim Soulo, CMOTe sorprenderías con cuánto puedes aprender a partir de y sobre tus competidores y cuánto se puede hacer online. Hay ciertas técnicas probadas, trucos y herramientas para este tipo de investigación y los puedes encontrar en esta guía.Analiza datos comercialesLos datos de investigación de mercados secundarios son relativamente asequibles, rápidos de conseguir y fáciles de usar. Piensa en informes de mercado, perspectivas sectoriales y montones de datos de investigación que alguien ya ha reunido y analizado, por lo que ya no tienes que hacer esa parte.Las fuentes más reputadas son Gartner, Forrester y Pew. Además de estas, asegúrate de comprobar que hay datos comerciales de confianza específicos para tu nicho.Sitios como G2, Capterra y Trust Pilot también cuentan. No solo te dan una perspectiva general de tu sector, si no que también puedes encontrar auténticas perlas en las reviews de usuario de tu producto y las de tu competencia. Ahrefs usa esos datos de forma habitual, interna y externamente, como en esta sección de nuestra página landing Ahrefs vs Semrush vs Moz:Beneficios de la investigación de mercados - una comparativaVamos a resumir rápidamente los 7 métodos de investigación de mercados que hemos visto arriba por sus beneficios clave. Proceso de cómo realizar investigación de mercados en 5 pasos clave Así que sabemos lo que es la investigación de mercados, por qué y cuándo hacerla y hemos aprendido sobre todos los tipos y métodos importantes.Vamos a ver cómo podemos usar ese conocimiento para realizar cualquier tipo de investigación de mercados en 5 pasos. Como ejemplo de investigación de mercados, te hablaré sobre algunas de mis experiencias pasadas con una empresa de impresión 3D.Identifica el problema de investigación de mercadosElige la muestra y método de investigaciónRecoge los datosAnaliza los datosInterpreta y presenta conclusiones1. Identifica el problema de investigación de mercadosAquí es donde todo proyecto de investigación comienza. También te darás cuenta que la investigación de mercados, en general, sigue el patrón del método científico. Primero, necesitas establecer qué es exactamente lo que estás investigando.¿Tienes una pregunta sobre tu negocio que quieres responder? Quizá ves una oportunidad en el mercado. O, ¿quizá has observado algo curioso sobre el uso de tu producto y tienes una hipótesis que quieres validar? Enuncia eso en el primer paso del proceso de investigación de mercados.Voy a poner un ejemplo.En el pasado, llevé marketing para algunas empresas y una de ellas era un fabricante de impresoras 3D. Bastante pronto me topé con dos problemas con esa empresa.Primero: uno de nuestros segmentos de mercado estaba saturado con productos similares de calidad parecida a un precio significativamente más bajo (clásico, ¿verdad?). Segundo: más y más fabricantes de impresoras 3D estaban alejándose del segmento de aficionados para dirigirse a segmentos profesionales, con productos más caros, pero nosotros seguíamos en el nicho de los aficionados / DIY (do it yourself, hazlo tú mismo). Así que éramos demasiado caros para los aficionados, pero demasiado aficionados para los clientes que podían pagarnos.La hipótesis que quería verificar era que si el mercado mostraba una tendencia hacia casos de uso más profesionales de impresión 3D, nuestra empresa debería seguir esa tendencia. En otras palabras, quería comprobar la viabilidad de virar el posicionamiento de marca al sector profesional/premium.2. Elige la muestra y método de investigación Ya hemos cubierto los tipos principales y métodos de la investigación de mercados. Ya deberías tener una buena idea de las diferencias entre la investigación primaria y secundaria, o de si los métodos cualitativos o cuantitativos se ajustarán mejor a tus intereses.Respecto a la muestra de tu investigación, se refiere a la porción de la fuente completa de datos en cuestión que usarás. Por ejemplo, si quieres realizar una encuesta entre tus clientes, la muestra se referirá a la selección de clientes que incluirás en tu encuesta. Hay unas pocas opciones para elegir una muestra. Usa la fuente de datos en su totalidad.Obviamente, no es una muestra como tal. Aun así, si enviar una encuesta a todos tus clientes es factible (y razonable), es una elección perfectamente buena. Elige una muestra aleatoria. El muestreo sistemático es la forma más fácil de elegir una muestra aleatoria. Es donde eliges un individuo por cada x/n para la muestra, siendo x la población y n la muestra. Por ejemplo, si quieres un tamaño de muestra de 100 de una población de 1000, elige cada 1000/100 = 10º miembro de la población. Usa una muestra no aleatoria (lo más sesgado). Muestreo por conveniencia: elige participantes disponibles y dispuestos a tomar parte en la encuesta. Muestreo intencional: elige participantes que a tu juicio serán representativos o tendrán otra característica que es importante para la investigación. Muestreo por cuota: elige alguna cuota arbitraria de participantes, por ejemplo, 10 clientes que no pagan, 10 pequeñas empresas que pagan y 10 empresas grandes que pagan.Volvamos a nuestro ejemplo. Como método para verificar mi hipótesis, elijo una mezcla de:Datos primarios: Encuestas enviadas a todos nuestros distribuidores. Queríamos ver si también ellos habían percibido un cambio de paradigma en el mercado y con qué segmento de clientes se habían encontrado más. También queríamos saber su perspectiva sobre la duración de esa tendencia y si potencialmente estarían interesados en una versión más premium de nuestro producto. Entrevistas en profundidad por teléfono con nuestros distribuidores dirigidas por nuestros equipos de ventas. Aquí usamos el muestreo intencional. Nuestra muestra estaba compuesta por distribuidores con los que teníamos las mejores relaciones (sabíamos que estarían más dispuestos a compartir). Análisis competitivo. Estábamos sobre todo interesados en actores del mercado que intentaban penetrar en el segmento profesional/industrial, así que esa era nuestra muestra (muestreo intencional). Estábamos interesados en cosas como: qué características estaban incluyendo en sus impresoras 3D, cuál era su posicionamiento de marca, cuáles eran sus precios, qué lenguaje usaban para comunicarse con su audiencia objetivo, etc. Datos secundarios: El informe sectorial de Wohler, cualquier informe de impresión 3D de Gartner y similares, informes de proveedores de servicios de impresión 3D y, básicamente, cualquier conjunto de datos serio que pudiéramos encontrar (muestreo de conveniencia). Datos internos: problemas de satisfacción de cliente y simplemente perfiles de clientes generales basados en datos de Google Analytics y Facebook.3. Recoge los datosUna vez que tienes el problema, método y muestra resueltos, todo lo que necesitas hacer es recoger los datos. Este es el paso donde envías tus encuestas, realizas tus entrevistas o contactas para conseguir información del sector.Un consejo, elige tu herramienta de investigación de mercados con cuidado; tendrá una gran influencia en la cantidad de trabajo que tendrás que hacer para analizar los datos. Por ejemplo, Google Forms hace gráficos automáticamente de datos cuantificables (además de ser gratuita).Aquí están los datos que recogimos para la empresa de impresión 3D: Datos primarios:Datos de encuestas al distribuidor (tanto datos cuantitativos como cualitativos).Datos de entrevistas a distribuidores (datos cualitativos).Problemas de satisfacción de clientes (datos cualitativos recogidos en todos los canales de atención al cliente, analizamos unos 200 problemas y peticiones).Datos de análisis competitivo (de unos 10 competidores).Datos secundarios:Conseguimos reunir 3 informes sectoriales independientes completos, unos pocos informes más pequeños de otras empresas de impresión 3D y decenas de grupos de datos, como estadísticas y reflexiones considerables. Recogimos datos como: cuota de mercado de fabricantes de impresoras 3D, crecimiento del mercado en el tiempo, segmentación de mercado, aplicaciones clave de la impresión 3D, adopción de la impresión 3D por región, cifras de ventas de los actores clave.Cualquier dato demográfico, sociográfico y psicográfico sobre clientes y visitantes a la web que pudimos encontrar en nuestros datos internos.4. Analiza los datos Ahora que tienes tus datos recogidos, el próximo paso es buscar patrones, tendencias, conceptos o palabras que se repiten a menudo—todo en función de si tu método era cualitativo o cuantitativo (o ambos).Investigación sencilla sobre una muestra sencilla será relativamente fácil de analizar o incluso analizada automáticamente, como con el ya mencionado Google Forms. A veces tendrás que usar software caro y más difícil de dominar como Tableau, NVivo, PowerBI, o SPSS. O puedes usar Python o R para el análisis de datos (si tienes un analista o científico de datos en el equipo, estás de suerte).Siguiendo con el ejemplo: Google Forms nos lo puso fácil para detectar patrones ya que los datos cuantitativos se calculaban automáticamente. La parte que llevaba más tiempo era leer todas las respuestas y buscar manualmente los patrones (por aquel entonces no conocía ninguna herramienta que pudiera realizar esa tarea). Tanto los equipos de marketing como los de ventas trabajaron en analizar algunos de los datos cualitativos para tener más de un punto de referencia. En lo referente a analizar a la competencia, contar con algún tipo de estructura de datos hace el trabajo más completo (y más cuerdo). Pusimos los datos de nuestros competidores en categorías específicas, como productos & servicios (precios incluidos), mercado objetivo, beneficios, valores y mensaje de marca. También usamos algo conocido como mapa de posicionamiento de marca, que se parecía a esto:Analizar los datos secundarios fue probablemente la parte más fácil, ya que los datos que necesitábamos ya estaban preparados en gráficos listos-para-usar, estadísticas y extractos. Solo tuvimos que cribar a través del contenido para buscar respuestas a nuestras preguntas.5. Interpreta y presenta conclusiones Analizar los datos no es suficiente. Necesitas recopilar los datos de forma comunicativa y accesible para las personas que toman la decisión. Una buena práctica es incluir en tu informe: toda tu información, una descripción de tu proceso de investigación, los resultados, conclusiones y acciones recomendadas.Resumiendo mi ejemplo de impresión 3D, tenía la hipótesis de que nuestro mercado estaba experimentando una gran transición y que la empresa debería seguir esa tendencia. La investigación que hicimos verificaba esa hipótesis positivamente:Nuestros distribuidores estaban recibiendo cada vez más peticiones sobre casos de uso y máquinas profesionales/industriales. Como puedes imaginar, el presupuesto de este tipo de cliente era significativamente más alto que el de los aficionados, pero también lo eran sus expectativas.Nuestros distribuidores indicaban que este fenómeno estaba aquí para quedarse. Más aún, declararon interés en una nueva impresora 3D personalizada para las necesidades de su clientela más exigente.Nuestros clientes estaban dejando atrás sus hábitos de early-adopter y querían algo fácil de usar, algo que enchufaran y funcionara de forma fiable. Experimentar con la impresora era algo que solo interesaba a los makers hardcore.Las compañías en las que estábamos interesados ya habían empezado a adaptarse al mercado premium/profesional, tanto con su oferta como con sus comunicaciones de marketing inteligente.También encontramos un montón de otros datos interesantes que usamos más adelante. Por ejemplo, descubrimos que además de ingenieros y diseñadores, un segmento igualmente interesante era el de instituciones educativas.Nuestra investigación de mercados inicial duró unos dos meses. También volvíamos a ella siempre que teníamos la oportunidad (o la necesidad) e iterábamos para ver si íbamos por el camino adecuado. ¿Mereció la pena? Permíteme que te diga esto: salvó a la empresa. Nuestra investigación nos mostró que era la última oportunidad para reposicionar la marca y el producto. Nuestro segmento de mercado original estaba siendo dominado gradualmente por empresas con las que no podíamos competir.Nos llevó algo de tiempo conseguir la compra interna de los grupos de interés clave e implementar las conclusiones en toda la empresa (con el tiempo, lo conseguimos). Como resultado, incrementamos las ventas, incrementamos la satisfacción de cliente y nos pusimos en un camino de crecimiento con beneficios—un win-win para todo el mundo. Incluso nos fusionamos con otros fabricantes para acortar el tiempo para llegar al punto dulce de mercado.Mirando atrás, ninguno de nuestros competidores cercanos sobrevivió. No se adaptaron como nosotros y le debemos todo a la investigación de mercados.PRO TIPHagas lo que hagas, evita estos errores comunes en la investigación de mercado:Muestreo pobre.Preguntas ambiguas.Preguntas dirigidas (preguntas que muestran un sesgo o contienen supuestos controvertidos)Objetivos poco claros o demasiados objetivos.Mezclar correlación con causalidad.Ignorar el análisis competitivo.Permitir que los sesgos influyan en tu investigación (siendo el sesgo de confirmación quizá el más habitual y peligroso).No realizar seguimiento de los datos con periodicidad.Herramientas online de investigación de mercados y recursosLa investigación de mercados data de los años 1930 y probablemente tiene raíces “más profundas” que el siglo XX. Todo lo que podías hacer entonces lo puedes hacer mejor ahora, más rápido y más barato gracias a estas herramientas online y recursos.Herramientas SEO - investiga el mercado con AhrefsHe reunido 3 quick wins que pueden ayudarte con tu investigación de mercados—y es solo una parte de lo que puedes hacer con Ahrefs.1. Conocimiento de marcaA principios del siglo XX teníamos que contratar a investigadores de mercado para que pasaran días o incluso semanas preguntando a la gente “¿has oído hablar de la marca X?”. Hoy, simplemente puedes mirar el volumen de búsquedas de esa marca.Así que pongamos que diriges una marca de fabricación de drones y quieres comprobar el reconocimiento de tu marca en Francia. Ve al Keywords Explorer de Ahrefs, introduce los nombres de las marcas, elige “Francia” como tu mercado y en un momento recibes:El volumen de keyword de marca indica el reconocimiento de esa marca en un mercado concreto. Puedes realizar esa búsqueda con frecuencia para ver si hay cambios significativos a lo largo del tiempo (por ejemplo, impactados por una campaña reciente).2. Demanda de una funcionalidadLa próxima funcionalidad que cambie el mercado de los coches eléctricos tendrá que ver con la batería, el tiempo y coste de carga (y no el piloto automático). ¿Cómo lo sé?Bueno, abrí Keywords Explorer de Ahrefs, escribí “electric cars” (coches eléctricos) y fui al informe de Questions (preguntas) para descubrir lo que busca la gente. Esto me dio la idea de los problemas que los dueños de coches eléctricos tienen (y sobre lo que los potenciales propietarios se preocupan). Puedes realizar una investigación similar en tu nicho.3. Entiende el lenguaje de tu mercadoGerald Zaltman en su popular libro “How Customers Think” (cómo piensan los clientes) propone la idea de que uno de los supuestos más erróneos del marketing es que los clientes piensan en palabras.Por otro lado, cuando los consumidores buscan algo en Google tienen que pensar en palabras. Y cuando hacemos marketing para esos consumidores, tenemos que pensar también en palabras. La pregunta es: ¿qué palabras?Digamos que quieres entrar en un mercado nuevo e innovador en Estados Unidos, por ejemplo, en la industria láctea de derivados de fermentación sintética, también conocida como lácteos libres de animales.Para ti, este conjunto de palabras “lácteos libres de animales” pueden ser el centro de tus esfuerzos en marketing y negocio. Pero vamos a ver qué piensan otras personas. Usemos Keywords Explorer para ver cuánta gente busca en Google en Estados Unidos esa frase:¡Ups! Parece que tu categoría de producto tiene un reconocimiento decepcionante. ¿Quiere esto decir que estás condenado? No necesariamente.Vamos a probar otras palabras. Palabras que signifiquen algo distinto, pero aún así muy relacionadas con nuestro nuevo producto.Ahora tenemos algo. La gente busca “vegan dairy” (lácteos veganos) y “lactose free dairy” (lácteos sin lactosa) más a menudo. No es lo mismo, pero están muy relacionados. Mira la diferencia en volumen de búsquedas.Las palabras tienen una gran diferencia. Y Google sabe eso.La única razón por la que has podido poner esas tres frases en la misma categoría era que conocías la conexión entre ellas. El problema es que tu audiencia objetivo puede que no sepa esa conexión; puede que ni siquiera sepan que este tipo de productos existe.Este análisis rápido del volumen de búsqueda muestra que puede que quieras hacer esa conexión, por ejemplo con marketing de contenidos.Si creas contenido alrededor de temas relacionados con volúmenes de palabras clave más altos, potencialmente puedes conseguir más tráfico orgánico que enfocándote en la keyword que designa tu categoría de producto. Mira, incluso aunque puede que creas que el beneficio principal de tu producto libre-de-animales sea algo no relacionado con la lactosa, por ejemplo, producción sin crueldad, puede que quieras dirigirte al problema de la intolerancia a la lactosa para resultar atractivo para la gente con esta condición.Pero eso no es todo. Puede que te hayas fijado en “low lactose cheese” en la esquina inferior derecha. Se refiere a la excelente funcionalidad del Keyword Explorer de Ahrefs llamada “Parent topic” (tema padre). El tema padre indica que Google ve una palabra clave dada como parte de un tema más amplio.Si hacemos clic en este tema padre, descubrimos incluso más demanda de búsqueda:Podemos ver que las búsquedas del tema “low lactose cheese” (queso bajo en lactosa) excede las del tema “vegan dairy” (lácteos veganos) por casi un 300% en Estados Unidos. Además, descubrir ese tema padre nos dio 879 ideas de palabras clave potenciales (algunas de las cuales tienen incluso un volumen de búsqueda más alto, como “lactose free cheese” (queso sin lactosa).¿Quieres descubrir incluso más asociaciones de temas? Sin problema. Puedes profundizar más en esta investigación usando otras características del Keyword explorer de Ahrefs. Por ejemplo, el informe Also rank for (también posicionan para) te permite ver en qué otras palabras clave (y temas) se posicionan el top 100 de páginas mejor posicionadas para tu palabra clave objetivo.Este quick-win de investigación de mercados está ligado al tema más amplio de la investigación de palabras clave o keyword research. Si quieres descubrir incluso más ideas de palabras clave y aprender a analizarlas, lee nuestra nuestra guía de keyword research.CRMsFuente: https://hubspot.comEl software de gestión de relación con el cliente, o CRM (Customer Relationship Management) se usa para gestionar y hacer seguimiento de las interacciones entre una empresa y sus clientes y prospectos. Normalmente, funciona en conjunto con un software de marketing automation (automatización de marketing) o ventas (o tiene integraciones con ellos). Si se usa adecuadamente, es un auténtico cuerno de la abundancia de información de mercado.Como apunté anteriormente, es una de las fuentes de datos primarios que puedes aprovechar para descubrir patrones en el comportamiento o características de tus clientes. Algunas soluciones populares son Hubspot, Salesforce, Intercom, pero hay un montón de software CRM por ahí, así que revisa una comparativa de software como la de G2 para ver qué encaja mejor en tus necesidades.Herramientas de feedback de usuarioEste tipo de herramienta te permite llevar a cabo los métodos ya mencionados de investigación online.Crea encuestas segmentadas, específicas para el usuario y analiza preguntas con herramientas como Google Forms, SurveyMonkey, Typeform, o Qualaroo.Enviar el típico email con una encuesta no es la única opción, por ejemplo, con Qualaroo puedes mostrar encuestas:En tu producto digital En tu producto SaaS (Software as a Service, software como servicio)Dentro de tu aplicación webEn tu webEn tu sitio móvilEn tus prototiposEn la mayoría de URLs públicas. Incluso en sitios de competidores¿Necesitas más? Sin problema, echa un vistazo a la solución de SurveyMonkey de investigación de mercados (conocida ahora como Momentive). Se apoya en los modelos de investigación de mercados que hemos discutido. Tienen 14 soluciones online para ayudarte a permanecer al máximo, incluyendo segmentación de clientes, monitoreo de dinámicas de mercado, marca, análisis creativo, importancia de funcionalidades, encontrar el precio adecuado para tus productos y más.Así que, ¿piensas que tienes un reto empresarial complicado? Este atrevido caballero está tratando de revolucionar… los huevos. Extremadamente difícil, pero factible con la investigación de mercados de su lado.https://www.youtube.com/watch?v=FMYfwZ_CP1sAnalítica Web/appHacer seguimiento del tráfico de tu web o app es absolutamente básico en marketing. Simplemente mira algunos de los datos de dimensiones que ofrece Google:DemográficosUbicaciónComportamientoDispositivosCanales¿Te resulta familiar? Síp, suena como la buena segmentación tradicional. Aquí va lo mejor: es gratis, rápido de conseguir y está basado en tus datos primarios.Si nunca has profundizado en Google Analytics o software similar de analítica (por ejemplo Matomo, Woopra) aquí van algunas preguntas que esta tecnología puede responder por ti:¿Qué busca la gente una vez que están en mi sitio?¿Qué diferencia a los clientes que han hecho una compra de aquellos que no?¿Cuáles son los principales países por ingresos?¿Cuáles son mis productos más vendidos?Si ya estás usando Google Analytics, mira si no estás cometiendo estos errores de seguimiento de Google AnalyticsHerramientas de investigación de User ExperienceHabitualmente usadas por diseñadores UX, pero simplemente escucha las propuestas de valor de estas herramientas:“Mira y escucha a personas reales usando tu web, tienda online o aplicación”. (https://userpeek.com/)“Feedback en tiempo real. De clientes reales. En cualquier sitio en que trabajes. Para que puedas crear experiencias que generen resultados.” (https://www.usertesting.com/)“Investigación de Usuario Escalable & Personalizable”. (https://www.userlytics.com/)“Graba vídeo y audio de tus usuarios, para que veas y escuches su experiencia exacta con tu producto”. (https://www.loop11.com/)Una vez más, suena muy parecido a nuestros métodos de investigación de mercados, ¿verdad? Y, no es una broma, miles de empresas usan estas herramientas.Las herramientas de experiencia de usuario te permiten conseguir feedback de usuario y conocimiento sobre tus productos, prototipos, webs y aplicaciones.Las pruebas están basadas en tareas que las personas que toman el test realizan. Puedes usar tu propia base de usuarios o definir una base personalizada usando sus servicios. Recibirás informes escritos e incluso vídeos grabados que puedes incorporar en tu investigación de mercados y asegurarte de que te aprovechas adecuadamente de esa oportunidad de mercado.Herramientas de planificación de publicidadAsí es—la herramienta de planificación de publicidad que ya estás usando en Facebook, LinkedIn y Twitter para gestionar anuncios puede darte alguna información de los números detrás de los segmentos de mercado en que estás interesado.¿Hombres de más de 30 años con educación superior interesados en gadgets tecnológicos? Sin problema. Mujeres con capacidad de decisión en niveles de liderazgo de Europa. Todo está ahí.Census dataLa disponibilidad de este tipo de datos puede variar en base a tu mercado objetivo. Por ejemplo, el Departamento del Censo de Estados Unidos te ofrece suficientes recursos gratuitos para buscar en los datos del censo del país. Puedes filtrar los datos por temas, años, geografía, encuestas o códigos de industria. También puedes acceder a tablas interactivas prefabricadas (que también te puedes descargar) o simplemente explorar ciertas regiones del país usando sus mapas.Herramientas de business intelligenceCon herramientas de business intelligence como Tableau, Looker o Sisense, puedes conectarte a cualquier fuente de datos para realizar limpieza de datos, operaciones estadísticas y visualización de datos. Están diseñadas para permitirte averiguar información de tus datos y comunicarte de forma efectiva con decisores clave. Es como SQL combinado con R, pero no necesitas saber programar y tienes un interfaz amigable.Como estas herramientas tienen muchas funcionalidades y normalmente son caras, son excesivas para empresas pequeñas con necesidades básicas de investigación de mercados. Normalmente descubrirás que la herramienta que ya usas para tu método de investigación viene con alguna función de análisis de datos y visualización. Y, si no, siempre puedes importar tus datos a Excel o Google Docs y usar Google Data Studio para una presentación interactiva que puedas compartir.Otras herramientas y servicios destacablesStatistaNielsen IQThink with GoogleLiving FactsDisplayrReflexiones finalesLa investigación de mercados no es fácil. Si te sientes intimidado por ella, no estás solo. Pero no huyas. Incluso la investigación de mercados esporádica puede tener beneficios para tu negocio que simplemente no puedes ignorar. No te convertirás en un profesional de la investigación de mercados de la noche a la mañana, pero la buenas noticia es que no tienes que hacerlo. Puedes ir por el camino ágil (como Ahrefs), usar herramientas y recursos online de autoservicio, o puedes incluso subcontratar tu investigación. Mientras tu plan de juego de marketing se base en datos válidos, mejorarás dramáticamente tus oportunidades de éxito.¿Alguna pregunta? Escríbeme en Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software en AppCritic. Aquí puedes leer su guía sobre WhatsApp CRM. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Investigación de Mercados: Qué Es y Cómo Hacerla"
    },
    {
      "level": "H2",
      "text": "¿Cuál es el papel de la investigación de mercados en una estrategia de marketing?"
    },
    {
      "level": "H2",
      "text": "¿Cuándo deberías realizar investigación de mercados?"
    },
    {
      "level": "H2",
      "text": "Tipos de investigación de mercados"
    },
    {
      "level": "H3",
      "text": "Investigación primaria"
    },
    {
      "level": "H3",
      "text": "Investigación secundaria"
    },
    {
      "level": "H3",
      "text": "Investigación primaria vs. secundaria"
    },
    {
      "level": "H3",
      "text": "Subtipos de investigación de mercados"
    },
    {
      "level": "H2",
      "text": "Perspectiva general de métodos de investigación de mercados y sus beneficios"
    },
    {
      "level": "H3",
      "text": "Datos internos de análisis"
    },
    {
      "level": "H3",
      "text": "Entrevistas"
    },
    {
      "level": "H3",
      "text": "Focus groups"
    },
    {
      "level": "H3",
      "text": "Encuestas"
    },
    {
      "level": "H3",
      "text": "Segmentación de mercado"
    },
    {
      "level": "H3",
      "text": "Análisis competitivo"
    },
    {
      "level": "H3",
      "text": "Analiza datos comerciales"
    },
    {
      "level": "H2",
      "text": "Beneficios de la investigación de mercados - una comparativa"
    },
    {
      "level": "H2",
      "text": "Proceso de cómo realizar investigación de mercados en 5 pasos clave"
    },
    {
      "level": "H3",
      "text": "1. Identifica el problema de investigación de mercados"
    },
    {
      "level": "H3",
      "text": "2. Elige la muestra y método de investigación"
    },
    {
      "level": "H3",
      "text": "3. Recoge los datos"
    },
    {
      "level": "H3",
      "text": "4. Analiza los datos"
    },
    {
      "level": "H3",
      "text": "5. Interpreta y presenta conclusiones"
    },
    {
      "level": "H2",
      "text": "Herramientas online de investigación de mercados y recursos"
    },
    {
      "level": "H3",
      "text": "Herramientas SEO - investiga el mercado con Ahrefs"
    },
    {
      "level": "H4",
      "text": "1. Conocimiento de marca"
    },
    {
      "level": "H4",
      "text": "2. Demanda de una funcionalidad"
    },
    {
      "level": "H4",
      "text": "3. Entiende el lenguaje de tu mercado"
    },
    {
      "level": "H3",
      "text": "CRMs"
    },
    {
      "level": "H3",
      "text": "Herramientas de feedback de usuario"
    },
    {
      "level": "H3",
      "text": "Analítica Web/app"
    },
    {
      "level": "H3",
      "text": "Herramientas de investigación de User Experience"
    },
    {
      "level": "H3",
      "text": "Herramientas de planificación de publicidad"
    },
    {
      "level": "H3",
      "text": "Census data"
    },
    {
      "level": "H3",
      "text": "Herramientas de business intelligence"
    },
    {
      "level": "H3",
      "text": "Otras herramientas y servicios destacables"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}