{
  "url": "https://ahrefs.com/blog/es/keyword-research-local/",
  "slug": "keyword-research-local",
  "title": "Cómo Hacer Keyword Research Local en 2021",
  "description": "Keyword research local es el proceso de encontrar palabras clave que la gente usa cuando buscan productos y servicios locales.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Keyword research local es el proceso de encontrar palabras clave que la gente usa cuando está buscando productos y servicios locales. Posicionar en estas keywords lleva tráfico local segmentado a tu sitio y te manda más clientes.Pero, ¿cómo haces exactamente tu investigación de palabras clave local?En esta guía, aprenderás:Por qué hacer keyword research local es importanteCómo hacer keyword research localCómo gestionar múltiples ubicacionesQué hacer con los posts de blogsCómo monitorear el posicionamiento de keywords locales¿Por qué hacer keyword research local es importante?La investigación de palabras clave locales es importante porque necesitas entender lo que la gente escribe en los motores de búsqueda como Google cuando busca los productos o servicios de tu negocio.Puede sonar obvio, pero más o menos ese es el problema.La mayor parte de la gente se limita a adivinar esas keywords y asume que saben cómo la gente busca su negocio. Esto a menudo les lleva a apuntar a las keywords equivocadas o a obviar por completo palabras clave que podrían impactar positivamente su negocio.Por ejemplo, si eres un fontanero en Londres, probablemente ya has descubierto que quieres posicionarte por keywords como “fontanero en Londres”. Pero, ¿qué pasa con los otros servicios que ofreces? ¿Tienes una página dedicada para el desatasco de tuberías? ¿Sabes cómo la gente busca estos servicios?Estas son las cosas que la keyword research local busca responder.Cómo hacer keyword research localSigue estos cinco sencillos pasos.Lista los servicios que ofrecesComprueba la intención localComprueba volúmenes de búsquedaAgrupa y mapea keywordsBusca “cosas que mencionar”Paso 1. Lista los servicios que ofrecesAntes de que empieces a buscar keywords, primero necesitas entender los servicios ofrecidos por el negocio. Deberías hacerlo, tanto si haces keyword research local para un cliente como para tu propio negocio.Aquí va el proceso que recomendaría:a) Pregunta o haz brainstormingSi haces esto para tu propio negocio, probablemente ya tengas una buena idea de los servicios que ofreces. Anótalos en un documento de texto y pasa al siguiente paso.Si haces esto para un cliente, pídeles que listen los servicios que ofrecen.Este ejercicio es súper-importante porque mucha gente nunca piensa de forma consciente en todos los servicios que ofrecen.Por ejemplo, un fontanero puede ofrecer todos estos servicios…Desatasco de tuberías Reparación de calentadoresInstalación de calentadoresReparación de calentadoresInstalación de calentadoresMantenimiento de calentadoresInstalación de radiadoresReparación de tuberías rotas… pero en su cabeza, probablemente piensan en su título laboral: fontanero.De hecho, la gente está buscando “fontanero”, pero muchos buscan también servicios más específicos. Por eso es crucial entender todo lo ofrecido como punto de arranque.b) Desarrolla las ideasHacer un brainstorming rara vez dejará al descubierto todos los servicios que la gente busca. Así que merece la pena dedicar un minuto para comprobar servicios que se te puedan haber pasado.Aquí va la forma más fácil de hacerlo:Introduce tus ideas del brainstorming en Keywords ExplorerElige tu país en el menú desplegableVe al informe “Having same terms” (que tengan los mismos términos)Esto te mostrará todas las consultas de nuestra base de datos que contienen todas las palabras de tus keywords (en cualquier orden). A partir de aquí no hay más que leer por encima en busca de servicios que se te puedan haber pasado.Por ejemplo, si hacemos esto con servicios relacionados con fontanería, vemos cosas que hemos pasado por alto como “combi boiler installation” (instalación de calentador combi), “gas boiler installation” (instalación de calentador de gas) y “radiator installation” (instalación de radiador).ImportanteRecuerda que buscas servicios que hayas pasado por alto, no palabras clave que te hayas pasado por alto. En otras palabras, no estás buscando todas las formas posibles en las que alguien busque lo mismo, como:FontaneroEmpresa de fontaneríaServicio de fontaneríaBásicamente estás buscando keywords que apunten a servicios.Otra forma de encontrar servicios “omitidos” es introducir un sitio de la competencia en el Site Explorer de Ahrefs, y después buscar URLs que mapeen servicios en el informe de Mejores Páginas.De forma alternativa, comprueba la navegación de su sitio, ya que los servicios normalmente se listarán ahí.c) Pule tu listaSi estás trabajando con un cliente, envíale las ideas que has encontrado y pregunta si ofrecen esos servicios. Añade los servicios confirmados a tu lista inicial.Paso 2. Comprueba la intención localEl SEO local consiste en posicionar en palabras clave con intención local, lo que quiere decir que la gente que está buscándolas están explícitamente buscando servicios locales.Así que el próximo paso es comprobar que la gente que busca estos servicios realmente quiere comprar algo local.Si vives en la misma zona que el negocio para el que haces keyword research, lo más fácil es buscar en Google tus servicios. Google normalmente usará tu ubicación para personalizar los resultados, así que puedes saber hay intención local comprobando dos cosas en la SERP:Un “pack de mapas”Negocios locales posicionando en los resultados orgánicos.Por ejemplo, si buscamos “boiler installation” (instalación de calentador), vemos un pack de mapas y unos pocos negocios locales en los resultados de búsqueda porque esta palabra clave tiene intención local.Si buscamos “worcester boiler” (calentador worcester, ya de paso, hablamos de la marca Worcester, no la ubicación Worcester, una ciudad inglesa cercana a Birmingham), no hay pack de mapas y ninguno de los resultados es de negocios locales. Parece que esta keyword no tiene intención local y que los usuarios están solo buscando comprar un calentador Worcester para instalarlo por su cuenta.Deja las keywords sin intención local para el próximo paso.Si no vives la misma zona que el negocio que buscas, aquí hay va una solución alternativa para comprobar la intención local:Ve a la herramienta de previsualización de anuncios de GoogleIntroduce un término de búsqueda (por ejemplo, “boiler installation”, instalación de calentador)Establece una ubicación local (por ejemplo, Nottingham)Pulsa en buscarDeberías ver una SERP local donde puedes revisar si hay negocios locales en el ranking y la presencia de pack de mapas:Paso 3. Comprueba volúmenes de búsquedaConseguir volúmenes precisos de búsqueda para keywords locales es difícil porque prácticamente todas las principales herramientas SEO solo muestran volúmenes globales a nivel país. Pero aquí está el tema: la gente se preocupa demasiado de los volúmenes de búsqueda en el SEO local.Nueve de cada diez veces, aunque el volumen de búsqueda de tus servicios sea súper bajo, todavía te interesará crear una página sobre los mismos para tus visitantes.Por ejemplo, tomemos un servicio como la instalación de calentadores.Lo más posible es que muy poca gente esté buscando esto en una ciudad pequeña. Pero si es el servicio que ofreces, probablemente deberías crear una página sobre esto porque es útil para los usuarios—incluyendo a aquellos que te encuentren buscando en Google algo amplio como “fontanero”.Dado esto, puedes preguntarte: ¿por qué preocuparme de revisar los volúmenes de búsqueda?La respuesta es fácil: para que sepas qué páginas priorizar en tus esfuerzos de SEO local.¿Cómo encuentras los volúmenes de búsquedas locales?Depende de si quieres comprobar volúmenes de palabras clave implícitas o explícitas—un concepto de Distilled, que Will Critchlow y Tom Anthony explican en este vídeo de 2013:https://youtu.be/uBgJ6E6hSY0?t=301Encontrar volúmenes de búsqueda para palabras clave implícitasLas palabras clave implícitas son aquellas donde el usuario busca un resultado local a pesar de no mencionar su ubicación en su consulta de búsqueda.Ejemplos:fontanerocambio de calentadorinstalación de radiadorAsí es como, sin duda, la mayoría de la gente busca negocios locales. Después de todo, ¿por qué te vas a molestar en buscar “fontanero en la ciudad de nueva york” cuando puedes obtener los mismos resultados al escribir “fontanero”?Pero aquí está el problema:Si compruebas los volúmenes de búsqueda de palabras clave implícitas en Keywords Explorer (o en cualquier herramienta de keyword research de terceros), las estimaciones son para todo el país.No tiene mucho uso para el SEO local porque necesitamos saber cuánta gente busca estas palabras clave implícitas en el área en el que damos servicio.¿Cómo podemos encontrar esta información?Google Keyword Planner es posiblemente la mejor herramienta para hacer esto.Aquí está el proceso: Ve a Google Keyword PlannerElige la opción de “Consulta el volumen de búsquedas y las previsiones”Pega tus palabras clave/servicios implícitas/osCambia la ubicación a tu área de servicioAhora mira los rangos de volumen de búsquedas medias mensuales para las keywords implícitas locales en tu área.Encuentra volúmenes de búsqueda de keywords explícitasLas palabras clave locales explícitas son keywords donde el usuario se refiere a su ubicación de forma explícita.Ejemplos:fontanero en nottinghamrecambio de calentador en nottinghaminstalación de radiador en nottingham radiatorSi encontraste que las búsquedas implícitas para alguno de tus servicios no tenían intención local, aquí es donde puedes añadir un modificador de ubicación para convertirlas en búsquedas explícitas.Por ejemplo, la búsqueda implícita “calentador worcester” no tenía una intención local—pero la búsqueda explícita (“worcester boiler nottingham”, calentador worcester nottingham) lo tiene:Con las palabras clave explícitas no necesitas usar Google Keyword Planner porque la propia consulta te dice la ubicación del usuario. Así que puedes usar una herramienta de keyword research como Keywords Explorer para conseguir volúmenes de búsqueda más precisos para estas keywords.Paso 4. Agrupa y mapea keywords hacia URLsLa investigación de palabras clave local no consiste solo en averiguar lo que la gente busca. También se trata de entender cómo apuntarás a esas palabras clave.La mayor parte del tiempo, tu página principal no va a posicionarse en todos los servicios que ofreces.Es por esto por lo que la mayoría de negocios locales crean páginas dedicadas a cada servicio.Aquí es donde las cosas se pueden volver algo confusas, porque no siempre es obvio qué servicios necesitan o no páginas dedicadas.Por ejemplo, toma estos servicios: boiler installation (instalación calentador) combi boiler installation (instalación calentador combi) oil boiler installation (instalación calentador aceite)No está claro si necesitamos páginas dedicadas para “combi boiler installation” y “oil boiler installation” o necesitamos posicionar para estos términos y otros con una página sobre “boiler installation”.La mejor forma de comprobarlo es analizar los resultados mejor posicionados para las palabras clave.Por ejemplo, mirando los resultados de búsqueda de “oil boiler installation” la página del negocio local en la posición #4 es específicamente sobre instalación de calentador de aceite (oil boiler)—no sobre instalación de calentadores en general.Así que, en mi opinión, nuestro sitio debería tener una página dedicada para este servicio.Si hacemos lo mismo para “gas boiler installation” (instalación de calentador gas), vemos esta página en el top 10:Como esto no es específicamente sobre la instalación de un calentador de gas, probablemente no necesitemos una página dedicada para este servicio. Podemos intentar posicionar para este y otros términos relacionados con una página más amplia sobre instalación/reemplazo.Dicho esto, merece la pena hacer notar que hay algunos matices en este proceso y que no es una ciencia exacta. Si no estás seguro en alguna fase, simplemente piensa si los visitantes del sitio encontrarían útil una página dedicada al servicio. Si parece que podrías contarles todo lo que necesiten saber sobre un servicio particular en una página más amplia, probablemente no merezca la pena crear una página dedicada.Paso 5. Busca “cosas que mencionar”Pongamos que uno de los servicios que ofreces es la reparación de calentadores. ¿Cómo creas una página que posicione localmente en “reparación calentadores” y términos relacionados?Por desgracia, el camino que mucha gente elige aquí es el keyword stuffing (rellenar con palabras clave). Es cuando encuentran la mayoría de formas en las que alguien puede buscar un servicio y repiten esas frases exactas en su texto.Aquí va un ejemplo:Este es el camino equivocado. Todo lo que hace es volver la página ilegible.Pero aunque no deberías rellenar con palabras clave, merece la pena buscar “cosas que mencionar” relevantes, por algunas razones: Puede mejorar la “relevancia temática”. Si una página sobre la instalación de calentador habla sobre los tipos de calentadores que ofreces, precios y ubicaciones en las que da servicio, probablemente ayudará a Google a entender el tema general de tu página y contar con confianza para posicionarla más alto. Puede ayudarte a posicionar en palabras clave de larga cola o long-tail. No todo el mundo busca de la misma forma. Por cada 100 personas que buscan reparación de calentador en Londres, hay probablemente algunas que buscan reparación de calentador en Londres Norte. Ayuda a los usuarios. La gente que busca servicios de instalación de calentadores probablemente quiera saber qué ofreces y cuánto costará.Vamos a ver unas pocas formas de hacer esto.Revisa los rankings de palabras clave en busca de páginas parecidasVe a Google, busca uno de tus servicios y busca una página de entre las mejor posicionadas que sea de un negocio local.Introduce esa URL en Site Explorer, ve al informe de Palabras Clave Orgánicas y filtra por el top 10.Echar un vistazo a estas palabras clave a menudo te revelerá cosas que puede interesarte mencionar en tu página.Por ejemplo, una de las páginas mejor posicionadas con el servicio de reparación de calentadores en Londres también posiciona en: boiler repair north london (reparación calentador londres norte) boiler repair east london(reparación calentador londres este)Aunque no queremos meter con calzador esas frases exactas en el contenido de nuestra página, probablemente tenga sentido listar las áreas donde damos servicios en la página. Esto puede potencialmente ayudarnos a posicionar en palabras clave de larga cola y también da a los clientes potenciales confianza de que podemos darles servicio en su área.Otras cosas que incluye la página que posiciona incluyen: fixed price boiler repair (reparación calentador precio fijo) gas boiler repair (reparación calentador gas) emergency boiler repair london (reparación calentador emergencia londres) combi boiler repairs (reparación calentador combi)Así que parece que probablemente merezca la pena mencionar los tipos de calentadores que reparamos (gas, combi), si ofrecemos precio fijo y si estamos disponibles para llamadas de emergencia.Merece la pena repetir este proceso para cualquier página relevante de las mejor posicionadas para construir una visión completa de lo que los clientes buscan.Revisa las páginas mejor posicionadas manualmenteIncluso aunque las herramientas de keyword research como Keywords Explorer funcionen sobre bases de datos enormes (la nuestra tiene más de 11.000 millones de keywords), algunas palabras clave locales se buscan demasiado poco para ser descubiertas por las herramientas.Por esa razón, merece la pena revisar las páginas mejor posicionadas de negocios locales en busca de cosas que mencionar.Por ejemplo, aquí van unas pocas cosas mencionadas en una página de las mejor posicionadas sobre servicios de reparación de calentadores: gas safe registered (registro gas seguro) city & guilds accredited (acreditada por el ayuntamiento)vaillant, worcester bosch, baxi (es decir, marcas conocidas de calentadores que pueden reparar)Incluso aunque solo unas pocas personas buscan específicamente servicios de reparación de calentadores de gas seguros registrados en Londres cada mes, mencionar estos términos en nuestra página ayudará a informar a potenciales clientes, construirán confianza y probablemente lleven a más negocio—que es el punto del SEO local.Si prefieres no andar adivinando, también podrías usar el informe Also talk about (también hablan de) en Keywords Explorer de Ahrefs. Esto muestra qué otras palabras clave y frases mencionan habitualmente las páginas mejor posicionadas en tu palabra clave objetivo. Revisa preguntas comunesLa gente que busca tus servicios probablemente quiera unas cuantas preguntas respondidas antes de contratarte. Así que merece la pena buscar estas preguntas y responderlas en tu página.Hay un par de formas de hacer esto.El primer método es buscar tu servicio y buscar una caja de “Otras preguntas de los usuarios” en los resultados de búsqueda. Esto muestra preguntas relacionadas que los usuarios también preguntan en Google.El segundo método es introducir el servicio en Keywords Explorer de Ahrefs y comprobar el informe de Questions (preguntas). Muestra preguntas que contienen el nombre del servicio.Si alguna de estas preguntas parecen cosas que los clientes potenciales quieren saber antes de hacer negocios contigo, considera responderlas en tu página.Cómo gestionar múltiples ubicacionesSi tienes oficinas o tiendas en distintas ubicaciones, normalmente no necesitas repetir el proceso anterior para cada ubicación. Solo necesitas destacar las localizaciones en tu web.Si solo tienes unas pocas ubicaciones, la forma más fácil es listarlas todas en tu página de contacto.Esto es lo que esta sandwichería hace:Google posiciona su página principal para búsquedas locales explícitas.Si lo prefieres, puedes crear páginas landing (páginas de aterrizaje) para cada ubicación física.Eso es lo que hace este contable:Si introducimos su sitio en Site Explorer de Ahrefs, vemos que Google posiciona sus páginas landing locales en búsquedas locales explícitas relevantes:¿Qué pasa con los posts de blogs?Dado que los negocios locales solo cubren su área local, normalmente no vas a poder escribir y posicionar posts en Google que realmente te generen mucho negocio.Por ejemplo, pongamos que eres un fontanero…Si buscas “fontanero” en Keywords Explorer y revisas el informe Questions (preguntas), ves muchas cosas que los clientes pueden estar buscando, como: how much does a plumber cost to fit a bathroom (cuánto cuesta un fontanero para arreglar un baño) how to find a plumber you can trust (cómo encontrar un fontanero en el que puedas confiar) how much does an emergency plumber cost (cuánto cuesta un fontanero de emergencia)El problema es que estas búsquedas rara vez tienen intención local. Así que aunque consigas posicionarte en ellas, el 99% de los visitantes que atraigas no estarán en tu área local—y nunca se convertirán en clientes.¿Significa esto que no deberías escribir contenido enfocado a keywords en tu blog de negocio local?No necesariamente. Las palabras clave son en realidad una aproximación de lo que la gente está buscando. Si montones de personas están buscando “cuánto cuesta un fontanero para arreglar un baño”, está claro que es algo que los potenciales clientes pueden querer saber. Así que puede que te interese escribir un post sobre ese tema para los visitantes a la web que lleguen por otros medios.Cómo monitorear el posicionamiento de keywords localesCon la investigación de palabras clave locales en la bolsa y tus páginas creadas, necesitarás una forma de realizar seguimiento del posicionamiento de tus palabras clave locales. Aquí tienes cómo hacerlo usando Rank Tracker de Ahrefs:Ve a tu proyectoHaz click en “+ Add keywords” (añadir keywords)Elige tu país del desplegableEmpieza a escribir tu localización (ciudad/estado/código postal) en el campo de textoElige una localización del desplegableAñade tus palabras claveReflexiones finalesLa keyword research local es bastante directa. Pero, recuerda, este es solo un aspecto del SEO local. Deberías crear y optimizar tu ficha de Google My Business, conseguir menciones locales, optimizar tus páginas, conseguir reviews y mucho más.Aprende más en nuestra guía completa de SEO local.¿Tienes preguntas? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el primer directorio de herramientas de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Hacer Keyword Research Local en 2021"
    },
    {
      "level": "H2",
      "text": "¿Por qué hacer keyword research local es importante?"
    },
    {
      "level": "H2",
      "text": "Cómo hacer keyword research local"
    },
    {
      "level": "H3",
      "text": "Paso 1. Lista los servicios que ofreces"
    },
    {
      "level": "H4",
      "text": "a) Pregunta o haz brainstorming"
    },
    {
      "level": "H4",
      "text": "b) Desarrolla las ideas"
    },
    {
      "level": "H4",
      "text": "c) Pule tu lista"
    },
    {
      "level": "H3",
      "text": "Paso 2. Comprueba la intención local"
    },
    {
      "level": "H3",
      "text": "Paso 3. Comprueba volúmenes de búsqueda"
    },
    {
      "level": "H4",
      "text": "Encontrar volúmenes de búsqueda para palabras clave implícitas"
    },
    {
      "level": "H4",
      "text": "Encuentra volúmenes de búsqueda de keywords explícitas"
    },
    {
      "level": "H3",
      "text": "Paso 4. Agrupa y mapea keywords hacia URLs"
    },
    {
      "level": "H3",
      "text": "Paso 5. Busca “cosas que mencionar”"
    },
    {
      "level": "H4",
      "text": "Revisa los rankings de palabras clave en busca de páginas parecidas"
    },
    {
      "level": "H4",
      "text": "Revisa las páginas mejor posicionadas manualmente"
    },
    {
      "level": "H4",
      "text": "Revisa preguntas comunes"
    },
    {
      "level": "H2",
      "text": "Cómo gestionar múltiples ubicaciones"
    },
    {
      "level": "H2",
      "text": "¿Qué pasa con los posts de blogs?"
    },
    {
      "level": "H2",
      "text": "Cómo monitorear el posicionamiento de keywords locales"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}