{
  "url": "https://ahrefs.com/blog/es/keywords-baja-competencia/",
  "slug": "keywords-baja-competencia",
  "title": "Cómo Encontrar Keywords con Baja Competencia para SEO",
  "description": "Aprende cómo encontrar oportunidades de keywords al alcance de la mano en unos pocos pasos y cómo asegurarte de que estas keywords son de verdad de baja competencia y fáciles para posicionarse.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Todo el mundo quiere posicionarse en keywords competidas, pero raramente es posible en el corto plazo. Si tu web es nueva o relativamente desconocida, la realidad es que es improbable que posiciones en palabras clave competidas pronto.¿Quiere eso decir que no deberías apuntar a keywords competidas? No. Pero quiere decir que deberías perseguir palabras clave con baja competencia en el corto plazo.En este post aprenderás cómo encontrar oportunidades de keywords que están al alcance de la mano en unos pocos pasos sencillos y cómo asegurarte de que esas palabras clave son de verdad de baja competencia y fáciles para posicionarse.Cómo encontrar keywords con “poca competencia” Sigue estos tres pasos para encontrar rápidamente miles de keywords de alto volumen y “baja competencia”.1. Haz un brainstorming de temasPiensa sobre lo que tu audiencia objetivo podría buscar en Google y apunta tus ideas. No necesitas intentar adivinar las frases exactas aquí; simplemente anota temas generales.Por ejemplo, si vendes computadoras u ordenadores y periféricos, pueden sercomputadorordenadorportátilmacbookimacdisco duroNo te lo pienses demasiado. Solo escribe lo que te venga a la cabeza.Pasa al paso dos una vez que tengas 5-10 ideas.2. Amplía las ideas con una herramienta de keyword research (investigación de palabras clave)Introduce tus ideas de temas en una herramienta de keyword research como Keywords Explorer, después ve al informe de Phrase match (concordancia de frase). Verás ideas de keywords que incluyen una o más de las palabras y frases que has introducido, junto a los volúmenes de búsqueda mensuales y otras métricas SEO.3. Filtra por keywords de baja “dificultad”Muchas herramientas de keyword research tienen una puntuación de dificultad. La nuestra se llama Keyword Difficulty (KD, dificultad de palabras clave), y es una representación numérica de lo difícil que será posicionarse entre los 10 primeros resultados de Google para una búsqueda.En el informe de Phrase match, filtra por palabras clave con una puntuación de KD entre 0-10 para encontrar palabras clave con “baja competencia”.Puedes ver arriba que hemos conseguido encontrar más de 167.000 keywords a partir de tan solo cinco temas “semilla”. Si quieres acotar la lista, simplemente añade un filtro de volumen de búsquedas mensuales mínimo.¿De verdad es así de fácil encontrar keywords con baja competencia?Sí y no.Google usa cientos de señales de posicionamiento, así que simplemente no es posible para ninguna herramienta SEO de terceros descifrarlas todas y calcular una métrica de dificultad de keyword “precisa”. No es realista y roza lo imposible, especialmente cuando consideras que muchos de estos “factores de posicionamiento” son mera especulación y nunca han sido confirmados por Google. También es importante entender que cada herramienta SEO usa una fórmula propia para su puntuación de dificultad de keyword, eso es por lo que las puntuaciones de herramienta a herramienta presentan diferencias tan grandes.En Ahrefs, el cálculo de nuestra puntuación de dificultad de palabra clave (Keyword Difficulty) es fácil: tomamos una media ponderada del número de dominios de referencia (sitios webs que enlazan) apuntando a las páginas del top 10. Eso significa que las páginas mejor posicionadas para palabras clave con puntuaciones altas de KD tienen muchos backlinks (enlaces entrantes) y las páginas mejor posicionadas para palabras clave con puntuaciones bajas de KD tienen pocos backlinks.Nota al margen. Si usas una herramienta de keyword research distinta a Ahrefs, contacta a su soporte y pregunta cómo calculan su puntuación de dificultad de keyword. No puedes usarla con efectividad si no sabes cómo funciona. Dado que se puede decir que los backlinks son el factor más importante de posicionamiento, nuestra puntuación de dificultad de keyword es normalmente una aproximación decente para la dificultad de posicionarse. Si una palabra clave tiene una puntuación baja de KD en Ahrefs, es de “baja competencia” en el sentido de que probablemente no tendrás que conseguir o ganar muchos backlinks para competir.Pero no deberías evaluar la competencia solo en base a esta métrica. Hay otros factores que necesitas considerar antes de apuntar a una keyword.Vamos a recorrer tres de las más importantes.Intención de búsquedaAutoridad de la webBacklinks de alta calidadIntención de búsquedaIncluso si una palabra clave es de muy baja dificultad, te costará posicionarte en ella sin crear el tipo de contenido que los usuarios están buscando. Así que cuando hagas keyword research, merece la pena buscar palabras clave que de verdad tengan sentido para el tipo de contenido que quieres crear.Los cuatro tipos de keywords generales son: Informativas. El usuario busca información sobre un tema. De navegación. El usuario busca una web específica. Investigación comercial. El usuario quiere comprar un producto o servicio en concreto, pero todavía no tiene del todo claro cuál comprar. Transaccional. El usuario busca comprar algo.A menudo puedes ver en qué categoría encaja tu keyword buscando modificadores de keyword en la consulta. Si contiene palabras como “comprar” o “barato”, es más probable que sea una consulta transaccional. Si contiene palabras como “cómo”, “qué” o “dónde”, es probablemente informativa.Aquí va una cheat sheet rápida de modificadores de keywords:En el Keywords Explorer de Ahrefs, puedes encontrar ideas que encajen en cualquiera de estas categorías usando el filtro “Include” (incluye).Por ejemplo, si estás buscando palabras clave transaccionales de baja competencia, aquí tienes cómo podrías hacerlo:Introduce tus palabras clave semillaElige el informe de ideas de keywords “Phrase match”Filtra palabras clave de baja competencia con el filtro de KD (KD < 10)Añade palabras como “comprar” y “barato” al filtro “Include”Activa el botón de “Any word” (cualquier palabra).Si buscas palabras clave informativas de baja competencia para un blog, puedes hacer lo mismo con modificadores informativos. Pero un método incluso más rápido es usar el informe Questions (preguntas), que muestra ideas de keywords formuladas como preguntas.Simplemente ten en cuenta que aunque filtrar con modificadores de keyword funciona, está lejos de ser infalible porque las palabras clave con modificadores no siempre se alinearán con el tipo esperado de búsqueda.Piensa en una keyword como “best buy coffee makers”.A pesar de contener el modificador transaccional “buy” (comprar), no es una palabra clave transaccional. Es de navegación, porque la gente está buscando resultados de Best Buy—una tienda de electrónica de consumo de Estados Unidos, el usuario está buscando cafeteras en Best Buy, no las mejores cafeteras para comprar.Esto señala más aún la importancia de cómo la intención de búsqueda puede afectar a la competencia en la palabra clave. Aunque esta búsqueda tiene una puntuación de dificultad de keyword de 1, no es de baja competencia porque es una palabra clave de navegación. Nunca más a desbancar a Best Buy, no importa lo que hagas—porque se posicionan en las 10 posiciones de la primera página de Google.Autoridad de la webEl Domain Rating (rating de dominio o DR) mide la autoridad de una web en una escala de uno a 100 en base a su perfil de enlaces.Muchos profesionales SEO creen que Google usa algún tipo de métrica de autoridad de web en su algoritmo de posicionamiento, pero John Mueller de Google ha afirmado públicamente que esto no es cierto en numerosas ocasiones.We don’t use domain authority at all in our algorithms.— 🍌 John 🍌 (@JohnMu) February 24, 2020 En ningún caso usamos autoridad de dominio en nuestros algoritmos. En cualquier caso, te darás cuenta de que para algunas para algunas palabras clave aparentemente de baja competencia, con puntuaciones de KD bajas, todas las páginas mejor posicionadas vienen de sitios con DR muy elevado.Un buen ejemplo, “black sandals” (sandalias negras):A pesar de tener una puntuación de dificultad de keyword de solo 1, el rating de dominio medio de la primera página de resultados es 86 y el DR más bajo que llegamos a ver es de 76.¿Prueba esto que la autoridad del sitio web es un factor de posicionamiento?No necesariamente. Se puede decir que esto tiene que ver más con el valor de la marca que con la autoridad del sitio web. Es más probable que las grandes marcas dominen la SERP porque es donde la mayor parte de la gente quiere comprar.Por desgracia, no puedes hacer mucho con esto si tienes una web y marca “más débiles”. Probablemente te costará posicionar en palabras clave donde el valor de la marca tenga un papel.Lo que nos lleva a un punto importante:La dificultad de posicionamiento es relativa.Si eres Zara, “black sandals” es una keyword de baja competencia porque tienes la autoridad y el valor de marca para posicionarte. Si eres una tienda pequeña de zapatos, “black sandals” es una palabra clave de alta competencia porque no estás en el mismo nivel que las grandes marcas que dominan la SERP.¿Significa esto que es imposible para marcas con menos autoridad y menos conocidas desbancar a los grandes? No. Solo será más difícil, así que es algo a tener en cuenta cuando busques palabras clave de baja competencia.Backlinks de alta calidadLa dificultad de keyword tiene en cuenta la cantidad de enlaces entrantes que apuntan a las páginas mejor posicionadas, pero no su calidad. Necesitarías considerar muchas cosas para evaluar la calidad del enlace, incluyendo: Relevancia de la web que enlaza y la página Autoridad de la web que enlaza y la página Ubicación del enlace en la página Texto ancla del enlaceQue el enlace sea follow o nofollow Es casi imposible tener en cuenta todas estas cosas y más al crear una puntuación de dificultad de keyword, así que mantenemos las cosas sencillas y consistentes mirando solo a la media de dominios de referencia (webs que enlazan) apuntando a las páginas del top 10.Por esa razón, siempre merece la pena comprobar manualmente los perfiles de enlaces de las páginas mejor posicionadas, porque la cantidad no lo es todo.Para ilustrarlo, miremos al número de dominios de referencia (Referring Domains o RDs) a las páginas de las primeras posiciones para dos palabras clave con una puntuación de KD igual de baja:A primera vista, parece más fácil posicionarse en la segunda palabra clave porque la página con la que compites tiene menos enlaces. Pero lo que realmente importa es la calidad de los enlaces.Para la página con 14 RDs, el 94% de los backlinks son follow, la mayoría provienen de páginas y webs relevantes y con autoridad. También tienen en su mayoría anchors (textos ancla) relevantes.Para la página con 92 RDs, el 96% de los backlinks son nofollow, la mayoría provienen de páginas en sitios de códigos de cupones con baja autoridad. En su mayoría también tienen URLs sin anchor.Nota al margen. Nofollow señala a Google que los enlaces no deberían influir en los rankings, pero pueden elegir ignorar esa señal. Aprende más aquí.De hecho, se puede decir que solo hay dos backlinks “buenos” apuntando a la página con 92 RDs. Mientras que la mayoría de los enlaces que apuntan a la página con solo 14 RDs son relevantes y de alta calidad.Como conclusión, manteniendo el resto de factores igual, probablemente sería más fácil desbancar la página con 92 RDs que la página con 14 RDs. Así que a pesar de tener la misma puntuación de KD, es discutible que “best coffee for cold brew” (mejor café para café en frío) sea una palabra clave con menos competencia que “best fly fishing combo for beginners” (el mejor combo de caña y carrete para principiantes).¿Deberías evitar las keywords con alta competencia?Muchas personas se quedan con las palabras clave con baja competencia porque no creen que puedan posicionarse por nada más. Incluso si esto es cierto en el corto plazo, las palabras clave con alta competencia pueden ser oportunidades por varias razones.Recuerda, la puntuación de dificultad de keyword de Ahrefs está basada en backlinks. Esto quiere decir que, en promedio, las páginas mejor posicionadas con KD altas tienen muchos backlinks.En otras palabras, las palabras clave con alta competencia son a menudo grandes temas para el link bait—contenido que está específicamente creado para atraer enlaces.Para encontrar estos temas, haz lo contrario de lo que hiciste antes. En lugar de filtrar por palabras clave con puntuaciones de KD bajas, filtra por palabras clave con puntuaciones de KD altas.Por ejemplo, si tienes un sitio sobre resumes (currículums), deberías:Ir a Keywords ExplorerIntroducir una palabra clave “semilla” relevante (por ejemplo, “resume”)Ir al informe de Questions (preguntas)Filtrar por palabras clave con puntuaciones de KD elevadas (por ejemplo, +50)Si compruebas la vista general de la SERP para cualquiera de estas palabras clave, deberías encontrar que muchas de las páginas mejor posicionadas tienen muchos backlinks.En este caso, si crearas la mejor guía para escribir un currículum (resume en inglés) en la web, la gente que está enlazando estas páginas existentes serían grandes oportunidades para conseguir enlaces. Solo necesitas contactarles con una razón convincente para que te enlacen.Consigue suficientes backlinks de alta calidad hacia tu página y es posible que puedas posicionarte—incluso si te falta autoridad y valor de marca.En cualquier caso, hay otros dos beneficios de apuntar a palabras clave con alta competencia (incluso aunque no te posiciones): Puedes incrementar la autoridad de la web. El valor de marca y la autoridad no aparecen de la nada. Principalmente son un producto derivado de los enlaces. Puedes pasar esa “autoridad” a páginas importantes. Usa enlaces internos de “linkbait” con alta autoridad para dar un empujón a páginas que están apuntando a palabras clave de baja competencia.Este segundo beneficio es el que nos gusta llamar La Técnica del Intermediario.Es una forma inteligente de aumentar la “autoridad” de páginas aburridas para las que es difícil conseguir enlaces.Lectura recomendada: Una simple estrategia SEO (El método del ‘intermediario’)Reflexiones finalesLa competencia por las keywords es relativa. Como ninguna puntuación de dificultad de keyword tiene en cuenta todo lo que afecta a la competencia, siempre deberías revisar manualmente las páginas mejor posicionadas antes de crear contenido. Si fallas en esto puedes acabar persiguiendo palabras clave que en realidad no son de baja competencia. Aunque no hay nada malo en esto, esas keywords deberían ser objetivos a medio o largo plazo, no objetivos a corto plazo.¿Tienes preguntas? Escríbeme por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Encontrar Keywords con Baja Competencia para SEO"
    },
    {
      "level": "H2",
      "text": "Cómo encontrar keywords con “poca competencia”"
    },
    {
      "level": "H3",
      "text": "1. Haz un brainstorming de temas"
    },
    {
      "level": "H3",
      "text": "2. Amplía las ideas con una herramienta de keyword research (investigación de palabras clave)"
    },
    {
      "level": "H3",
      "text": "3. Filtra por keywords de baja “dificultad”"
    },
    {
      "level": "H2",
      "text": "¿De verdad es así de fácil encontrar keywords con baja competencia?"
    },
    {
      "level": "H3",
      "text": "Intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "Autoridad de la web"
    },
    {
      "level": "H3",
      "text": "Backlinks de alta calidad"
    },
    {
      "level": "H2",
      "text": "¿Deberías evitar las keywords con alta competencia?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}