{
  "url": "https://ahrefs.com/blog/es/link-building-rapido/",
  "slug": "link-building-rapido",
  "title": "Cómo empezar una campaña de Link Building rápido (y sistematizar todo)",
  "description": "Esta guía te explica cómo encontrar de forma rápida prospectos para link building y su información de contacto. También aprenderás cómo sistematizar, automatizar y escalar el proceso.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido ¿Conoces los conceptos básicos de link building, pero te cuesta levantar una campaña desde cero? Esta guía avanzada te mostrará cómo hacerlo - y rápido.Buscar sitios para hacer link building puede dividirse en tres tareas:Encontrar sitiosConseguir su información de contactoEnviar emailsLa mayor parte de la información que existe online se enfoca en la última parte: el envío de mails. Si alguna vez intentaste contactar a bloggers, sabes que el cuello de botella está en encontrar posibles sitios e información de contacto.Si consigues esto correctamente, enviar emails es fácil.En este tutorial accionable, nos enfocaremos en cómo hacer las primeras dos partes del proceso de manera más eficiente. También hablaremos sobre cómo sistematizar, automatizar y escalar tu outreach (concepto que en español refiere a “acercarse”, o contactar por primera vez a muchos sitios).Comencemos.El procesoAntes de hacer cualquier cosa, primero necesitamos elegir un tipo de campaña para hacer.Para mantener las cosas simples, vamos a elegir una campaña de guest posting.Antes de que te vayas de este artículo, déjame decirte que sé que los guest posts no son emocionantes. Es aburrido, y no es novedoso. La razón por la que uso este ejemplo para mostrar el proceso es porque es un ejemplo directo. Explicaré cómo puedes aplicarlo a otras estrategias de link building más adelante.¿Listos? VamosPaso 1. Encontrar sitiosLa primera pieza del rompecabezas es abandonar la típica estrategia de usar Google para encontrar sitios donde publicar.No me malinterpretes, Google es excelente para encontrar posibles sitios para cualquier tipo de campaña, pero es un enorme cuello de botella cuando quieres más velocidad. Tienes que extraer resultados, revisar las métricas SEO en masa con otra herramienta, y, bueno, toma mucho tiempo.Por eso, en cambio, usaremos el Content Explorer de Ahrefs.Content Explorer es una base de datos donde puedes filtrar y buscar dentro de mil millones de páginas web.Ahora, lo que no vamos a hacer aquí es usar operadores de búsqueda para encontrar páginas “escribe para nosotros”, aunque sea posible hacerlo con Content Explorer.Usando operadores de búsqueda para encontrar páginas “escribe para nosotros” en Content Explorer.En cambio, lo vamos a usar para encontrar sitios que están escribiendo sobre temas relevantes.Hay tres razones para hacer esto:La mayor parte de las personas están dispuestas a publicar artículos de otros - incluso aunque no tengan una página “escribe para nosotros”.Si los sitios ya publicaron contenido sobre temáticas relevantes, entonces sabemos que son sitios adecuados donde publicar.Nos da dos datos clave (URL del post y autor) para hacer que sea más fácil encontrar la información de contacto.Para empezar, iremos a Content Explorer a hacer una búsqueda “in title” para encontrar posts de blog sobre temas relevantes:(How OR why) AND ([keyword 1] OR [keyword 2])Por ejemplo, si tenemos un sitio que vende suplementos de salud, podemos buscar algo como esto:(cómo O por qué) Y (músculos O gimnasio)Sólo para explicar cómo funciona esta búsqueda:Los paréntesis agrupan las palabrasEl operador OR (o) pide que se devuelvan resultados que contengan algunas de las palabras entre paréntesis (por ejemplo cómo o por qué)El operador AND pide que se devuelvan resultados con al menos una de las palabras del primer grupo (cómo o por qué) y del segundo grupo (músculos o gimnasio)Si pones todo esto junto, lo que efectivamente estamos buscando son páginas con las palabras “cómo” o “por qué” y “músculos” o “gimnasio” en sus etiquetas title.La mayoría de estos serán posts de blog relacionados a generar músculos o ir al gimnasio.Por ejemplo, aquí hay algunos de los resultados de nuestra búsqueda:Desde aquí, necesitamos filtrar resultados solo para palabras que sean:En inglés. Content Explorer guarda páginas en muchos idiomas, pero solo queremos páginas en inglés porque estamos haciendo outreach en es idioma. Las personas que escribieron contenido en otro idioma podrían no entender nuestro email de outreach.Activos - Content Explorer también guarda páginas caídas. No tendría sentido escribirle a autores de páginas caídas porque se preguntarán cómo encontramos esa página y por qué están recibiendo un email desde nosotros.DR entre 20 y 95. Domain Rating (DR) es una métrica SEO de Ahrefs que mide la “autoridad de enlaces” de un sitio. Probablemente no tiene sentido invertir tiempo y esfuerzo en escribir artículos para los sitios de DR más bajos, y los dominios con puntajes de DR demasiado altos son casi siempre sitios como Facebook, Google, etc. Queremos filtrar ambos de estos tipos de sitios para evitar perder tiempo.Así se aplican estos filtros en Content Explorer:También necesitamos filtrar múltiples páginas del mismo dominio, ya que solo queremos contactar a cada sitio una sola vez.Para hacer eso, podemos usar el botón de “una página por dominio” (“one page per domain” en inglés).2.685 posibles sitios. No está mal para dos minutos de trabajo.Todo lo que queda por hacer es exportar los resultados a un CSV, e importar todo a un Google Sheet. No uses Excel para esto. La razón será clara en el próximo paso.Nota al margen. Puedes exportar hasta 2.000 resultados desde Content Explorer usando el botón de “una página por dominio”. Si hay más de 2.000 resultados en tu búsqueda, ajusta el filtro de DR, y exporta los resultados en distintos grupos. Por ejemplo, si tienes 3.500 resultados cuando filtras páginas entre 20 y 95 de DR, podrías filtrar páginas entre 20 y 50 de DR, exportar los resultados, y luego repetir el proceso para páginas de DR entre 51 y 95. Todo lo que necesitas hacer después es unirlos en Google Sheets.Paso 2. Conseguir la información de contactoAntes de contactar a cualquiera de estos sitios, necesitamos encontrar su información de contacto - el nombre, apellido y dirección de email de cada persona.Esto suele ser un enorme cuello de botella por dos razones:Es un proceso manual. Tienes que revisar los sitios, encontrar el nombre de la persona a contactar, y buscar su dirección de email.Es más fácil encontrar la información de contacto en algunos sitios que en otros. A veces puedes perder más de 15 minutos solo buscando una dirección de email.Por esto, aquí está la solución:En vez de encontrar los emails manualmente, vamos a dejar que Hunter - una herramienta de búsqueda de emails - haga el trabajo difícil por nosotros. Solo necesitamos darle un nombre, apellido, y nombre de dominio.Por ejemplo, si ponemos mi nombre completo y “ahrefs.com” en Hunter, encuentra mi dirección de email:¿Pero cómo conseguimos los nombres y dominios de nuestros posibles contactos?Bueno, si miramos lo que exportamos de Content Explorer, veremos que ya tenemos nombres de autores de algunos contactos.Nota al margen. Cambié todos los nombres del contenido exportado por nombres falsos por cuestiones de privacidad. Si le damos esta información a Hunter, junto con “Content URL”, extraerá el dominio e intentará encontrar la dirección de email de esa persona. Si la encuentra, sabremos que están de alguna manera relacionados con el sitio. Si no, podemos asumir que son escritores invitados e ignorarlos por ahora.Entonces este es el proceso:Primero, filtramos las páginas que no tienen nombre de autor.Segundo, nos deshacemos de todas las columnas excepto Title, URL y Autor (Author).Tercero, agregamos dos columnas más (D y E):En la celda D1, ingresamos esta fórmula:=IFERROR(ARRAYFORMULA(IF(C1:C=\"Author\",\"First name\",IFERROR(IF(search(\" \",C1:C),LEFT(C1:C,FIND(\" \",C1:C)-1),C1:C),C1:C))),\"\")En la celda E1, ingresamos esta fórmula:=IFERROR(ARRAYFORMULA(IF(C1:C=\"Author\",\"Last name\",IF(LEN(D1:D)<1,\"\",IFERROR(IF(search(\" \",C1:C),TRIM(RIGHT(SUBSTITUTE(C1:C,\" \",REPT(\" \",100)),100)),\"\"),\"unknown\")))),\"\")Esto divide el nombre y apellido.Esto es importante porque no solo usaremos la herramienta Hunter para encontrar direcciones de email, vamos a usar su complemento de Google Sheets para buscarlos en lotes (bulk en inglés).Si estás siguiendo estos pasos, entonces necesitas crear tu cuenta y conseguir una API key para esto, que te da 50 búsquedas gratuitas por mes. Una vez que estás listo para seguir, cárgalo en Sheets y usa la opción de búsqueda de emails (email finder en inglés).Dile dónde encontrar el nombre, apellido y URL. Deja el nombre de la compañía en blanco.Presiona “find email addresses” (encontrar direcciones de email), y comenzará a hacer su magia.Nota que esto no encontrará las direcciones de email de todas las personas. El nombre tiene que ser de alguien asociado al sitio web (tienen que tener un email personal @dominio), y tiene que estar en la base de datos de Hunter.El paso final es verificar los emails que Hunter encuentra usando una herramienta como Neverbounce.Para hacer esto, iremos a la herramienta en lotes de Neverbounces, cargarlo a la lista, y luego limpiar la lista.Nota al margen. Tienes 1.000 créditos gratis cuando te creas una cuenta en Neverbounce. Si necesitas más después de eso, es bastante barato - entre $3 y $8 cada 1000 emails. Por último, exportamos los emails válidos y usaremos una fórmula VLOOKUP (BUSCARV en español) para traerlos a nuestra planilla.Ahora tenemos un montón de contactos y estamos listos para escribirles.Exportamos estos a un CSV para estar listos para la parte final del proceso.Paso 3. Enviar emailsBuenas noticias: la mayoría del trabajo difícil está hecho. Todo lo que queda por hacer es cargar los contactos a una herramienta de outreach como Mailshake, Buzzstream o Pitchbox.Es sólo cuestión de escribir un template de email de outreach con campos autocompletables.Nota al margen.Por favor escribe un mejor email de outreach que este ejemplo. Lo mantuve simple para que sirva a la demostración. No es un buen discurso inicial.Ahora, en este punto, podrías comenzar a enviar emails sin ningún tipo de personalización - pero realmente no recomendamos eso. Personalizar tus emails es probablemente el único factor diferencial entre una estrategia muy “spam” y una no tanto. Solo porque estamos automatizando cosas no significa que ya no aplican las reglas de un buen outreach.Esta es mi manera de verlo: estamos automatizando las partes aburridas para invertir más tiempo en las cosas que importan, como personalizar email y revisar que nuestros posibles contactos sean sólidos.¿Esto enlentece el proceso? Por supuesto, pero incluso si te toma cinco minutos personalizar cada email, sigue siendo 12 emails por hora.Si asumimos una tasa de conversión de un 8%, sigue siendo un enlace por hora de trabajo.Pero si eso sigue pareciendo mucho trabajo por un solo enlace, la próxima sección podría interesarte.Cómo sistematizar, automatizar y escalar este procesoEncontrar a alguien que envíe emails de outreach por ti es bastante simple: solo anuncia una búsqueda laboral en un sitio para freelancers como Upwork.¿Pero por qué parar ahí? Es completamente posible:Sistematizar y delegar casi todas las partes del proceso.Automatizar cosas para reducir las partes manuales.Escalar y alcanzar a más posibles contactos.Así se hace cada una de estas cosas:SistematizarLo que tenemos más arriba es un proceso para hacer link building, pero los procesos no son lo mismo que sistemas. Un proceso es una serie de pasos para cumplir un objetivo, mientras que un sistema junta todos esos pasos en uno solo.Básicamente, con sistemas, una vez que empiezas a mover la rueda, todo el resto sigue por su cuenta.Aquí hay una manera simple de convertir el proceso a un sistema:Primero, define un tablero de Trello con listas para cada parte del proceso.Encontrar sitios, conseguir información de contacto, enviar emailsSegundo, crea documentación para cada paso.Considero que Google Docs es lo mejor para hacer esto porque puedes compartirlo fácilmente con el resto de los miembros de tu equipo. Por eso, para el proceso de arriba, crearías tres documentos: uno para encontrar los sitios, otro para encontrar su información de contacto, y otro para enviar emails.Estructura general de la documentación de “cómo encontrar direcciones de emails”.Tercero, creamos una nueva lista en el tablero de Trello y agregamos la documentación.Ahora, cada vez que comiences una campaña, solo necesitas crear una nueva tarjeta, etiquetar a la persona responsable de ejecutar la primera tarea, y ofrecerles la documentación.Sin embargo, podrías estarte preguntando qué sucede cuando la persona completa esta tarea, ¿tienes que mantener tu mirada en todo y seguir asignando tareas a la siguiente persona?No, solo haz que asignar el próximo paso sea parte de tu documentación.Text on image:Abre HunterMapea las columnas a datosCorre HunterEspera que termineDescarga todos los emails a CSVCárgalos a NeverbounceDescarga emails verificadosVuelve a importar a SheetFiltra los contactos verificadosMueve la tarjeta de Trello al paso 3Etiqueta a [nombre] en TrelloAutomatizarTener un sistema donde todo se mantiene funcionando es fantástico, ¿pero no sería mejor si pudieses reducir el número de dientes en la rueda que es necesario mover?Aquí es donde entra la automatización.Mira este video para aprender cómo automatizar la mayoría de los procesos de arriba con Zapier:https://www.youtube.com/watch?v=HyIXvIaUlLkEscalarLeyendo esta guía, tal vez notaste que aunque este proceso es rápido, sistematizado, e incluso puede ser semi-automatizado, deja muchos posibles contactos sobre la mesa.Después de todo, Content Explorer solo encuentra nombres de algunas páginas, Hunter solo encuentra las direcciones de algunos sitios y Neverbounce solo verifica algunos emails.Si comienzas con 1.000 posibles sitios, podrías tener solo 100 al final de este proceso.Considerando que solo hay una cierta cantidad de sitios para cada campaña, no tiene sentido dejar el 90% sobre la mesa.Pero esto es lo importante: no te estoy diciendo que lo hagas.El punto de este proceso es comenzar una campaña de link building desde cero lo más rápido posible- no ejecutarla a la perfección.Hacer las cosas de esta manera te permite tener una idea de si una campaña va a caminar o no.Si no camina, deshazte de ella.Si camina, es hora de escalar.Ya tienes el sistema funcionando, por lo que escalar es tan fácil como crear otra documentación para encontrar nombres y direcciones de email manualmente.Sin embargo, esta no es la única manera de escalar. También puedes:Correr más campañas.Aplicar estos principios a más prácticas de link building.Hablemos de la opción B.Usando este proceso para otras tácticas de Link BuildingTodo lo que hablamos más arriba puede aplicarse prácticamente a cualquier táctica de Link Building - siempre y cuando tu proceso de búsqueda de sitios te de nombres y apellidos de contactos.Pero este es el tema: la mayoría de los procesos de búsqueda de sitios no te dan nombres ni apellidosPor ejemplo, digamos que encuentras una oportunidad de link building de enlaces rotos en Site Explorer.Oportunidad de enlaces rotos para hacer link building sobre “qué es el marketing de contenidos” en el reporte de Best by links (mejores por enlace) en el Site Explorer de Ahrefs.Backlinks hacia la página inexistente sobre “qué es el marketing de contenidos” en el Site Explorer de Ahrefs. Cada uno de estos 117 sitios que enlazan a esa página es un potencial prospecto para una campaña de link building de enlaces rotos.Si exportas el reporte de backlinks para esta oportunidad, no verás nombres de autores.Este no es un gran problema, siempre y cuando tu lista de prospectos sea una lista de páginas web (no de sitios), solo necesitas un paso extra para el proceso: usa URL Profiler para extraer nombres.¿Cómo? Solo pega la lista de prospectos en URL Profiler y selecciona el checkbox de “Readability” (legibilidad en español).Esto extraerá el nombre de los autores de las páginas donde sea posible.Nota al margen. URL Profiler no es gratuito, pero tiene 14 días de prueba gratis. ¿Encuentra tantos como Content Explorer? En mi experiencia, no tantos - pero no está demasiado lejos.Une esto a tu base de datos existente usando fórmulas VLOOKUP en Google Sheets.Using Google to find prospects?También puedes extraer métricas de SEO de Ahrefs como DR, UR y tráfico orgánico con URL Profiler. Sólo selecciona las variables que quieras extraer.Desde ahí, prácticamente seguimos los mismos procesos que antes: encontrar emails, verificarlos, hacer outreach.ConclusionesEmpezar una campaña de link building desde cero no tiene que tomar muchos días -ni siquiera muchas horas.Usando el proceso definido en esta guía, debería ser posible al menos ofrecer algunos guest post en 30 minutos -incluso si no tienes mucha experiencia en link building.¿Tienes preguntas? ¿No entendiste algo? Escríbeme en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo empezar una campaña de Link Building rápido (y sistematizar todo)"
    },
    {
      "level": "H2",
      "text": "El proceso"
    },
    {
      "level": "H3",
      "text": "Paso 1. Encontrar sitios"
    },
    {
      "level": "H3",
      "text": "Paso 2. Conseguir la información de contacto"
    },
    {
      "level": "H3",
      "text": "Paso 3. Enviar emails"
    },
    {
      "level": "H2",
      "text": "Cómo sistematizar, automatizar y escalar este proceso"
    },
    {
      "level": "H3",
      "text": "Sistematizar"
    },
    {
      "level": "H3",
      "text": "Automatizar"
    },
    {
      "level": "H3",
      "text": "Escalar"
    },
    {
      "level": "H2",
      "text": "Usando este proceso para otras tácticas de Link Building"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}