{
  "url": "https://ahrefs.com/blog/es/link-building/",
  "slug": "link-building",
  "title": "Link Building para SEO: guía para principiantes",
  "description": "Todo lo que debes saber sobre link building para SEO. Qué es, cómo funciona, cuáles son los enlaces buenos, cómo conseguirlos y más.",
  "content": "Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía. Estás aquí porque necesitas enlaces.Seguramente ya hayas escuchado que los enlaces (o backlinks) ayudan a tu web a posicionarse mejor en Google. Y quieres aprender a conseguir enlaces a tu web. Pues resulta que nosotros (Ahrefs) llevamos más de 10 años creando herramientas para que los profesionales puedan hacer link building (entre otras cosas). Así que podemos decir que sabemos unas cuantas cosas sobre cómo conseguir enlaces.En esta guía, hemos recopilado nuestros conocimientos y hemos intentado explicar todos los entresijos del link building de forma fácil para que puedas ponerlos en práctica. Pero antes de empezar, aquí tienes unas pinceladas para ir abriendo boca: Si tienes una web nueva, lo mejor es empezar consiguiendo algunas decenas de enlaces de base.Ayuda mucho tener una relación previa con la persona responsable de una web antes de pedirle un enlace.La gente enlaza a páginas que son interesantes y útiles. Así que si tu página no lo es, te costará mucho conseguir enlaces.Los enlaces de páginas relevantes en webs con autoridad son los que más influyen en tu posicionamiento en Google.Contents Empieza aquí 1¿Qué son los motores de búsqueda? 2Fundamentos de SEO 3Keyword research 4Contenido SEO 5SEO On-Page 6Link Building 7SEO técnico Part 1Los fundamentos del link buildingPuedes imaginar los enlaces como si fueran votos. Cuando otras webs enlazan a tu página, es un indicio para Google de que tu página es importante. En esencia, de eso trata el algoritmo PageRank de Google. Por tanto, cuantos más enlaces de alta calidad tenga una página, más alto tenderá a posicionar en Google. Y si quieres superarla con tu propia página, probablemente tendrás que conseguir más enlaces de los que tiene la página mejor posicionada. Los enlaces ayudan a las páginas a posicionarse mejor en los resultados de búsqueda de Google.Obviamente, he simplificado mucho. Obtener el puesto número 1 en Google tiene muchos más matices que simplemente conseguir más enlaces, porque los enlaces no son la única señal de posicionamiento que utiliza Google. Pero es una señal muy potente y tiene una influencia muy directa en tu posicionamiento. Así que… ¿Qué es el link building y cómo se hace? Link building es el proceso de conseguir que otras webs enlacen a páginas de tu web. Su finalidad es aumentar la “autoridad” de tus páginas a los ojos de Google, con el objeto de que esas páginas se posicionen mejor y atraigan más tráfico de búsqueda. Vamos a profundizar un poco más.Part 2Cómo conseguir enlacesConceptualmente, la mayoría de las estrategias de link building se encuadran dentro de uno de estos cuatro grupos: Añadir enlaces. Cuando vas a una web y añades manualmente tu enlace. Pedir enlaces. Cuando envías correos electrónicos a las personas responsables de webs que son relevantes en tu caso y les pides que te enlacen. Comprar enlaces. Lo mismo de antes, pero ofreciendo dinero (o alguna otra forma de compensación). Ganar enlaces. Se refiere a crear y promocionar algo de tanto valor que la gente lo enlace de forma natural. Cómo conseguir enlaces.También puedes contratar a un profesional con experiencia en link building (o a una agencia especializada en link building) para que lo haga en tu lugar. Y eso es lo que muchos profesionales de marketing digital y empresas acaban haciendo porque, independientemente de la táctica que elijas, conseguir enlaces da mucho trabajo. Pero incluso si decides subcontratar el link building, te resultará muy útil contar con algunos conocimientos básicos sobre cómo se hace. De este modo, podrás ver si la persona que has contratado está haciendo bien su trabajo o no. Echemos un vistazo más de cerca a cada uno de los cuatro grupos. 1. Añadir enlacesEs cuando vas a un sitio web que no es de tu propiedad y pones manualmente tu enlace allí. Las tácticas más comunes que encajan en esta categoría son: Creación de perfiles sociales.Darse de alta en directorios de empresas.Registrarse en páginas de reviews.Publicar en foros, comunidades y sitios de preguntas y respuestas.Conseguir enlaces mediante estas tácticas es muy fácil. Y por eso mismo, estos enlaces suelen tener poco o ningún valor a los ojos de Google. Este tipo de enlaces apenas te dan ninguna ventaja competitiva. Si puedes ir a un sitio web y colocar allí manualmente tu enlace, también pueden hacerlo tus competidores. A pesar de lo dicho, este grupo de tácticas de link building no debe ignorarse por completo. De hecho, algunos profesionales del link building prefieren empezar con este tipo de enlaces cuando trabajan con una web nueva. Esta actividad se conoce como conseguir “enlaces de base”. Piénsalo. La mayoría de las empresas tienen cuentas de su marca en las principales redes sociales, así como ficha en los principales directorios de empresas y sitios de opiniones (Yelp, Tripadvisor, Sortlist, Trustpilot, ProductHunt, Glassdoor, etc.). Y todas estas páginas contienen un enlace a su web. Google presta claramente atención a estas páginas de perfil. Si echas un vistazo al panel “Conocimiento” de Ahrefs (a continuación tienes una captura de pantalla), te darás cuenta de que se muestran enlaces a nuestros perfiles sociales. Y no fuimos nosotros quienes los añadimos. Google identificó nuestros perfiles sociales por su cuenta y los vinculó a la marca Ahrefs como parte de su gráfico de conocimiento (también conocido como knowledge graph, en inglés).Sí, este tipo de enlaces son nofollow (no influyen en el posicionamiento) o muy, muy débiles. Lo que significa que apenas sirven de nada a la hora de posicionarse en Google. Pero dado que el atributo “nofollow” se trata ahora como una sugerencia, existe la posibilidad de que con el tiempo tus páginas de perfil acumulen algunos enlaces de calidad propios y puedan empezar a aportar un poco de valor SEO a tu web. Por ejemplo, la página del perfil de Ahrefs en Twitter puede presumir de tener más de 9.500 enlaces, procedentes de más de 900 webs. Así que estoy bastante seguro de que tiene cierto “peso” a los ojos de Google. Dicho esto, no es necesario correr para dar de alta tu web en todas las redes sociales y directorios de empresas que encuentres. Estamos hablando simplemente de unas pocas docenas de ellas en las que es natural que tu empresa aparezca. Cualquier otra cosa sería una auténtica pérdida de tiempo. Y la mejor forma de encontrar sitios web de calidad a los que añadir tu enlace es estudiar los enlaces de tus competidores. De lo que hablaremos con más detalle en apartados posteriores de esta guía.2. Pedir enlacesEs cuando te pones en contacto con otras webs y les pides un enlace. En SEO esto se suele denominar “link outreach” (difusión de enlaces, pero, normalmente, se emplea el término en inglés).Sin embargo, no es posible que te dirijas a la gente de revistacientificaimportante.com y les pidas que enlacen tu página con recetas de galletas. Sería raro, ¿no? Tienes que elegir webs que estén relacionadas de algún modo con tu página, ya que eso incrementará las posibilidades de que te tengan realmente en cuenta. El proceso de recopilar una lista de sitios web relevantes a los que contactar se denomina “prospección de enlaces” (de nuevo, es habitual referirse a esta actividad en inglés, como link prospecting). Y cuanto más esfuerzo inviertas en encontrar enlaces adecuados para tu objetivo, mayor será tu tasa de éxito. Pero, en cualquier caso, ¿por qué otras webs (incluso aquellas que sean de tu sector) se molestarían en enlazarte? Bueno, lo ideal es que les impresione tanto tu contenido o recurso que quieran compartirlo por iniciativa propia con quienes visitan su web (es decir, enlazarlo). Pero no todas las páginas de tu web son obras maestras únicas dignas de mil enlaces. Así que los profesionales del SEO han ideado una serie de tácticas para persuadir a las personas responsables de otras webs para que añadan enlaces a sus páginas. Incluimos aquí una breve lista de estas tácticas, junto con la lógica que las resume: Guest posting (autor invitado). Escribe un artículo impresionante para otra web, desde el que podrás enlazar a tu página.Técnica del rascacielos. Encuentra una página obsoleta (o peor) a la que muchas webs estén enlazando. Crea una mucho mejor en tu propia web. Luego compártela con todos los “enlazadores” (las personas que tenían enlaces a la página obsoleta, o peor).Consigue enlaces en páginas de recursos. Busca páginas que enumeren recursos (contenidos, infografías, guías…) similares a los tuyos y pide que te añadan.Link building a partir de enlaces rotos. Encuentra una página rota (que no funcione) que tenga muchos enlaces de otras webs. Crea una alternativa a ese contenido en tu propia web y avisa a las personas que enlazaban a la página rota.Link building con imágenes. Busca webs que hayan utilizado tus imágenes sin la debida atribución y pídeles un enlace.HARO (en inglés) o Reportaro (en español, para España) y solicitudes de periodistas. Contribuye con una “cita de experto” para el artículo que están escribiendo.Menciones sin enlace. Pide que añadan a la mención de tu marca un enlace.RR.PP. (relaciones públicas, o PR) Ofrece a los medios una noticia de interés para que la cubran.Pero, antes de seguir, una pequeña advertencia. El razonamiento que hay detrás de cada una de estas tácticas puede parecer bastante justo y lógico, pero te sorprenderá lo bajo que es el porcentaje de éxito. Es decir, si consigues cinco enlaces a partir del envío cien correos electrónicos, puedes alegrarte. Pero hay algo muy sencillo que puedes hacer para inclinar la balanza a tu favor. Se trata de entablar relaciones con personas de tu sector mucho antes de que necesites su ayuda. Piénsalo. Si hoy recibieras un correo en frío (cold email) de una persona cualquiera pidiéndote un enlace, ¿te molestarías en contestar? Lo dudo. Pero, ¿y si ese correo procede de alguien con quien has hablado previamente en Twitter o a quien incluso has conocido en algún evento en persona? Es mucho más probable que prestes atención, ¿no? Por lo tanto, si empiezas a conectar con gente de tu sector con antelación (e incluso si puedes hacerles pequeños favores), será más fácil cuando les pidas un enlace en el futuro. He aquí un buen ejemplo de mi propia experiencia. Gael Breton de Authority Hacker se puso en contacto conmigo por primera vez en 2014. Eso fue antes incluso de que me uniera a Ahrefs: Ey, Tim, No estoy seguro de que me conozcas, nunca hemos hablado, pero llevo un tiempo leyendo tu blog. También escribo sobre marketing online en Authority Hacker.Me gustó el trabajo de Gael, y desde entonces hemos mantenido el contacto. Esta es una de las razones por las que su sitio web tiene 137 enlaces desde ahrefs.com a fecha de hoy: Pero no me malinterpretes. Gael no me pedía enlaces de vez en cuando. Simplemente, seguíamos respectivamente nuestro trabajo. Y cuando publicaban algo digno de mención en Authority Hacker, yo me enteraba y lo compartía con nuestro equipo. Y al final terminábamos por incluir enlaces a sus contenidos. Así es como las relaciones te ayudan a adquirir enlaces de forma natural. 3. Comprar enlacesEsta es la forma más fácil de conseguir enlaces. Gran parte de las personas que gestionan una web estarán encantados de que les pagues por poner un enlace a tu web. Pero intercambiar dinero (o cualquier otra cosa, en realidad) por enlaces es bastante arriesgado. Google lo considera una manipulación de su algoritmo. Y podría castigarte expulsando tu sitio web de los resultados de búsqueda. Otro riesgo de la compra de enlaces viene simplemente de malgastar tu dinero en enlaces malos que no servirán de nada. Dicho esto, no queremos enseñarte ninguna táctica que pueda poner en peligro tu negocio (o tu cartera). Así que en esta guía no habrá consejos sobre “cómo comprar enlaces de forma correcta”. Sin embargo, debes saber que muchas personas del sector SEO compran enlaces para alcanzar sus objetivos de posicionamiento. Cuando empieces a investigar los vínculos de tus competidores y a ponerte en contacto con estas webs, tardarás poco en descubrir si han pagado por algunos enlaces. 4. Ganar enlaces“Ganas” enlaces cuando otras personas enlazan a las páginas de tu web sin que tengas que pedírselo. Esto no ocurrirá a menos que tengas algo realmente digno de mención, algo que otros responsables de web quieran mencionar de forma voluntaria. Aquí tienes algunas cosas que pueden hacer que las páginas de tu web merezcan un enlace: Datos propios de tu empresa.Resultados de experimentos (que requieran esfuerzos importantes).Ideas únicas y opiniones firmes (es decir, liderazgo intelectual).Encuestas sectoriales.Noticias de última hora.Por ejemplo, en 2017, utilizamos nuestros datos propios para llevar a cabo un estudio de investigación único, que respondía a una de las preguntas más frecuentes del SEO: “¿Cuánto tiempo se tarda en posicionar en Google?”A fecha de hoy, esta entrada de blog tiene más de 3.100 enlaces de unas 1.800 webs diferentes. Incluso seis años después esta investigación sigue atrayendo nuevos enlaces. He aquí algunas menciones enlazadas de finales de este año: Pero no tienes que crear necesariamente ningún contenido. Tu negocio en sí mismo puede merecer enlaces. O los productos y servicios que ofreces. Una buena parte de los enlaces al sitio web ahrefs.com proceden de personas que mencionan nuestros productos y nuestra empresa en lugar del contenido que publicamos. Aquí tienes unas cuantas menciones de enlaces que recibimos ayer mismo: Pero la gente no puede enlazar a cosas que no sabe que existen. Así que por muy impresionante que sea tu página (o tu producto), tendrás que hacer algo para promocionarlo. Y cuantas más personas vean tu recurso, mayor será la probabilidad de que algunas de ellas decidan enlazarlo. Hablaremos de esto en profundidad más adelante. Part 3¿Qué enlaces marcan la diferencia?Tipos distintos de enlaces tienen efectos diferentes en el posicionamiento de tu página en Google. Y nadie sabe con certeza cómo mide exactamente Google el valor de cada enlace individual. Pero hay seis conceptos generales de evaluación de enlaces que la comunidad SEO considera ciertos. Las características de un buen enlace.1. AutoridadParece intuitivo que Google no trate igual un enlace del New York Times o El País que el del pequeño blog de viajes de tu amigo. Tanto NYT como El País son una autoridad mundialmente reconocida, y el blog de tu amigo no lo conocéis ni en vuestro grupo. A lo largo de muchos años de hacer link building, los profesionales SEO han reunido muchas pruebas empíricas de que los enlaces de sitios web más conocidos y con más autoridad tienen una mayor influencia en el posicionamiento de tu página en Google. Pero, ¿cómo se mide la “autoridad” de una web? Pues bien, según una encuesta del sector realizada por Aira, las métricas de autoridad de webs más populares son la Clasificación del Dominio o Domain Rating (DR) de Ahrefs y la Autoridad de Dominio o Domain Authority (DA) de Moz. Las métricas desarrolladas internamente (que a menudo incluyen DR o DA) ocupan el tercer lugar. Informe sobre el estado del link building en 2022. ¿Usas alguna métrica para medir la autoridad o calidad de un enlace?De hecho, disponemos de una herramienta gratuita llamada “Comprobador” de autoridad de sitios web, que puedes utilizar para acceder a la métrica de Domain Rating de cualquier web: Pero además de la autoridad de una web entera, también está la autoridad de la propia página que te enlaza. Que Google calcula con la ayuda del famoso algoritmo PageRank.En otras palabras, el algoritmo PageRank se basa en la premisa de que las páginas con más (y mejores) enlaces emiten un “voto” más fuerte.Las páginas que tienen más backlinks emiten un “voto” más fuerte que las que no tienen.Aquí, en Ahrefs, tenemos nuestra propia métrica para medir la autoridad de la página. Se llama Clasificación de URL o URL Rating (UR), y se calcula de forma bastante parecida al PageRank original. La UR de esta misma página que estás leyendo es 11 (30 en la versión en inglés), y tiene enlaces de más de mil sitios web diferentes (es decir, de dominios) en inglés: Y hay algo más que debes saber sobre la autoridad. Si un backlink o enlace tiene asociado el atributo rel=“nofollow”, lo más probable es que no emita un “voto” hacia el sitio web al que enlaza. 2. RelevanciaSi tienes un blog sobre salud y forma física, los enlaces de otras webs (y páginas) sobre el mismo tema tendrán más peso a los ojos de Google que los enlaces webs sobre coches o finanzas. He aquí un extracto de la guía “Cómo funciona la búsqueda” de Google que corrobora esta teoría (las negritas son mías): Si otros sitios web destacados sobre el tema enlazan a la página, es una buena señal de que la información es de alta calidad. Pero esto no significa que debas evitar conseguir enlaces de sitios web que no sean del mismo tema que el tuyo. No me imagino a ningún profesional SEO con experiencia diciendo: “No, por favor, no pongas un enlace a mi sitio web de recetas desde dreamhost.com, una web de alojamiento con DR 93”. La cuestión es que, sea cual sea el tema de tu web, habrá docenas de temas que resulten perfectamente relevantes aunque no sean exactamente del mismo nicho o sector. Por ejemplo, la nutrición es muy importante para la salud y la forma física. Así que sería perfectamente natural que las webs de fitness enlazaran artículos sobre alimentación. Y, si quieres hacer ejercicio con regularidad, tienes que encontrar tiempo en tu agenda, así que enlazar artículos sobre la gestión del tiempo no sería raro. En otras palabras, la relevancia es un concepto bastante maleable. A menos, claro está, que intentes meter con calzador enlaces en lugares donde, claramente, no deben estar. 3. Texto ancla (anchor text)Si aún no te has familiarizado con el término, “texto ancla”, se trata de un fragmento de texto en el que se puede hacer clic y que enlaza con otra página. En muchos casos, describe brevemente de qué trata la página enlazada. No es de extrañar, por tanto, que Google utilice las palabras del texto ancla (o anchor text, en inglés) para comprender mejor de qué trata la página referenciada y para qué palabras clave merece posicionarse. De hecho, la patente original del PageRank de Google habla de esto de forma bastante explícita (las negritas son mías):Google emplea una serie de técnicas para mejorar la calidad de la búsqueda, como el rango de página, el texto ancla y la información que lo rodea. Entonces, ¿cómo aprovechar el texto ancla al hacer link building? Pues es mejor que no lo hagas. Cuanto más intentes controlar cómo te enlazan las distintas páginas y metas con calzador todas las “palabras adecuadas” en el texto ancla de tus backlinks, mayor será la probabilidad de que Google sospeche de manipulación y te penalice por ello. Así que es mejor dejar que el autor de la página que enlaza decida cómo quiere referenciar tu página. 4. UbicaciónYa en 2010, Bill Slawski llamó la atención sobre una patente de Google que describía un “Modelo del Internauta Razonable”. Este modelo explica cómo la probabilidad de que se haga clic en un enlace puede afectar a cuánta autoridad transfiere. Y esta probabilidad viene determinada principalmente por la ubicación del enlace en la página. Supongamos una página web que consta de tres bloques: contenido, barra lateral y pie de página. Por regla general, los enlaces en el contenido reciben más clics porque el bloque de contenido es el que más atención recibe de los visitantes. Los enlaces situados en un lugar destacado pueden transferir más “autoridad”.Otra cosa que puede afectar al CTR de un enlace es cuán arriba aparezca en la página. Es más probable que los lectores hagan clic en los enlaces situados al principio del artículo que en los situados al final. 5. DestinoCuando haces link building a tu sitio web, hay tres destinos generales a los que puedes dirigirlos: Tu página principal o de inicio.Tus activos enlazables.Las páginas reales que necesitas para posicionarte bien en Google (normalmente llamadas “páginas monetizables” o money pages). Y, muy habitualmente, las páginas que necesitas posicionar son las mismas en las que es más difícil conseguir enlaces. Esto se debe a que los responsables de los sitios web suelen preferir enlazar a páginas informativas o de contenido, en las que su público puede obtener valor de forma gratuita, en lugar de a páginas comerciales en las que es probable que se les ofrezca algún producto. Por eso, una de las preguntas más habituales en SEO es: “¿Cómo conseguir enlaces a páginas aburridas?”. Y la estrategia que suelen sugerir profesionales SEO con experiencia es conseguir muchos enlaces de calidad a tus “activos enlazables”, y luego transferir parte de esa “autoridad de enlace” a las “páginas monetizables” que quieres que tengan un buen posicionamiento en Google. Part 4Las mejores estrategias de link buildingExisten muchas tácticas y estrategias diferentes para conseguir enlaces. Algunas pueden ser muy eficaces, mientras que otras ya no funcionan hoy en día y lo más probable es que solo te hagan perder tiempo. Esto es lo que funciona realmente bien hoy, según nuestra experiencia: 1. Replicar los enlaces de tu competenciaSi alguien enlaza a tu competidor, es muy probable que también esté dispuesto a enlazarte a ti. Una buena forma de poner en marcha esta estrategia es estudiar quién enlaza a las páginas de inicio reales de las webs de tu competencia. Estas personas mencionan a la empresa en su conjunto y no a una página web concreta, que quizá no tengas en tu web. Por ejemplo, aquí tienes un par de páginas (con un tráfico de búsqueda decente) que enlazan con nuestra página principal: Una captura de pantalla de Site Explorer.Como puedes ver, en ambos casos, Ahrefs se menciona justo al lado de otras herramientas de marketing, lo que no hace sino demostrar que pedir que te mencionen junto a tus competidores es algo razonable. Una vez que hayas terminado con los enlaces de la página principal, el siguiente paso es estudiar qué páginas de los sitios web de tus competidores tienen más enlaces. Tenemos un informe en Site Explorer que hace eso, se llama “Mejor por enlaces”. Observando el informe Mejor por enlaces de ahrefs.com (arriba), es fácil darse cuenta de qué tipo de páginas nos han traído más enlaces: Nuestra página de inicio. Porque mucha gente menciona Ahrefs como un software o como una empresa.Nuestras herramientas gratuitas. Generador de palabras clave y Comprobador de autoridad del sitio web son dos de las muchas herramientas gratuitas que hemos desarrollado. Y cada una de estas herramientas está atrayendo una tonelada de backlinks de forma orgánica.Nuestro blog. Gracias a una producción constante de contenidos útiles, ahora mucha gente recomienda nuestro blog y lo enlaza.Nuestros estudios de investigación. A la gente le encantan los datos reveladores. Por eso, los estudios de investigación que publicamos suelen recibir muchos enlaces.Prueba a consultar el informe “Mejor por enlaces” de tus propios competidores y comprueba qué tipo de páginas les aportan enlaces. Una vez que identifiques lo que les ha funcionado, puedes crear recursos similares (o mejores) en tu propia web. Cuando hayas terminado con las tácticas anteriores, te sugiero que configures una alerta de enlaces, recibirás una notificación cada vez que tus competidores consigan nuevos enlaces. De este modo, podrás ponerte en contacto inmediatamente con quien les haya enlazado e intentar que te incluyan en la misma página. En definitiva, tus competidores son una mina de oro de grandes oportunidades de enlaces. Y a medida que profundices en sus backlinks, verás algunos patrones en su link building, que puedes aprovechar en tu propia web. De hecho, hemos escrito un artículo bastante detallado sobre este tema. No dejes de leerlo. 2. Haz outreach segmentado (difusión segmentada) Digamos que tienes una página muy concreta que necesitas posicionar bien en Google para una determinada palabra clave. Y necesitas conseguir enlaces hacia esa página tan específica. El mejor lugar para empezar es consultar las páginas mejor posicionadas para la palabra clave que deseas e investigar dónde han obtenido sus enlaces. Solo tienes que introducir tu palabra clave en Keywords Explorer de Ahrefs y desplazarte hasta el widget “Resumen de la SERP” (página de resultados, o “SERP overview”). Verás las páginas mejor posicionadas junto con el número de enlaces (y dominios de referencia) que tienen. Digamos que quieres posicionarte en “mejores apps productividad”. Este es el aspecto de la SERP para esta palabra clave: Una vez que hagas clic en cualquiera de los números de enlaces, se te redirigirá a una lista de backlinks de una página determinada en Site Explorer de Ahrefs.Esto es lo que tienes que hacer a continuación: Aplica algunos filtros para centrarte solo en los “backlinks significativos”.Recorre manualmente la lista de páginas restantes, ábrelas una a una y comprueba si su contexto permite añadir un enlace a tu página. Ponte en contacto con los propietarios de estos sitios web e intenta que añadan un enlace a tu recurso en su página.El siguiente lugar al que debes dirigirte para encontrar posibles webs para que te enlacen es a las personas que hayan mencionado tu tema en sus webs. Por ejemplo, si necesitas crear enlaces a una aplicación de productividad, debes ponerte en contacto con todos los sitios web que hayan mencionado la palabra “productividad” en alguna parte de sus páginas. Puedes intentar buscarlos en Google, pero solo te ofrece un número limitado de resultados de búsqueda. Solo un par de cientos por término medio. Una forma mucho más rápida de encontrar miles de páginas que mencionan tu tema es a través del Content Explorer de Ahrefs.Por ejemplo, si buscas la palabra clave “aplicación de productividad”, obtendrás más de 34.000 páginas que mencionan esta palabra clave. A partir de ahí, puedes aplicar los siguientes filtros para reducir la lista de resultados a los más significativos: Idioma: español (o el idioma que te interese)Tráfico del sitio web: a partir de 1.000Valoración del dominio: desde 30Filtrar resultados explícitosFiltros: una página por dominio, excluir páginas de inicio, excluir subdominiosDe esta forma, acabarás con poco más de 1.800 páginas. Lo que supone un número mucho más manejable de posibles enlaces con los que trabajar. Y tu plan de acción aquí sería muy similar al anterior. Revisa estas páginas una por una y ponte en contacto con los respectivos propietarios de las webs si crees que existe la posibilidad de que acepten enlazar a tu página desde la suya. Para ser justos, es probable que tu tasa de éxito con estos dos grupos de posibles enlaces sea bastante baja. Lo sé porque no hace mucho llevé a cabo este tipo de link building. Y por mis conversaciones con profesionales del link building, es lo habitual. La mayoría de la gente no se molestará en responder a tus correos electrónicos.Muchos responderán solo para rechazar educadamente tu solicitud.Algunos te pedirán dinero o un intercambio de enlaces.Y solo unos pocos te enlazarán.Por eso he mencionado antes que deberías empezar a entablar relaciones con todas estas personas antes de pedirles un favor. Una buena forma de hacerlo es ponerte en contacto con ellas mientras estás creando tu página. Puedes pedirles su opinión, una cita, o incluso sugerirles que presenten alguno de sus proyectos. Y siempre es de gran ayuda que algo en lo que estés trabajando les interese de verdad. Por ejemplo, cuando gestionaba mi blog personal, me puse en contacto con más de 500 bloggers para pedirles que compartieran algunos de sus datos de Google Analytics para una pequeña investigación. Esa petición despertó su interés y muchos me ayudaron. Cuando terminé mi investigación y la publiqué, me aseguré de avisar por correo electrónico a los más de 500 bloggers con los que me había puesto en contacto. Y así fue como este artículo se convirtió en la página más enlazada de mi blog: Pero, lo más importante, todo el trabajo duro que invertí en esta investigación me permitió ganarme el respeto de muchas de estas personas. Y cuando, más tarde, me puse en contacto con alguna otra petición, ya no era un “don nadie” y se mostraron más abiertos a hablar conmigo. En otras palabras, tu outreach será mucho más eficaz si lo que propones merece realmente la atención de la gente. 3. Crear activos enlazablesEn SEO, utilizamos los términos “activo enlazable” o “linkbait” (cebo de enlaces) para referirnos al contenido que se elabora estratégicamente para atraer enlaces. Estos activos enlazables pueden tener muchas formas: Encuestas sectorialesEstudios e investigaciónHerramientas y calculadoras onlinePremios y clasificacionesGuías prácticas y tutorialesDefiniciones y términos Infografías, infografías en GIF o mapas interactivosAntes ya he mencionado dos ejemplos de activos enlazables: una encuesta a bloggers que hice para mi blog personal y un estudio de investigación que hicimos aquí en Ahrefs. Ahora vamos a ver un gran ejemplo de otra persona. La gente de Aira, una agencia de marketing digital, elabora anualmente un “Informe sobre el estado del link building” encuestando a cientos de profesionales líderes del sector. Este informe les ha aportado enlaces de más de 600 webs: Y uno de estos backlinks procede de la propia página de inicio de ahrefs.com (que tiene una Clasificación de URL de 54): Su informe contiene algunos datos muy favorables para nuestra empresa, así que no pudimos resistirnos a presentarlo en nuestra propia página de inicio. Muchos profesionales del marketing se refieren a este tipo de cebo para enlaces como “cebo para el ego”. Pero en el caso de Aira, no creo que fuera deliberado, porque no podían saber de antemano los resultados de su encuesta sectorial. Entonces, ¿cómo poner en práctica esta estrategia de link building? En primer lugar, tienes que tener una idea de lo que supone realmente que una página merezca un enlace. Puedes partir de una simple lluvia de ideas o brainstorming que se base en la mencionada lista de tipos de activos enlazables: ¿Puedes encuestar a tu sector sobre algo?¿Puedes calcular algunas estadísticas relevantes a partir de los datos a los que tiene acceso tu empresa?¿Hay algún experimento interesante que puedas llevar a cabo?¿Necesita tu sector algún tipo de herramienta online gratuita? Etc.La gente de Authority Hacker ha publicado recientemente un vídeo bastante detallado en YouTube, en el que explican cómo utilizan las encuestas para crear contenido enlazable para sus webs. Échale un vistazo, es muy práctico (está en inglés, pero puedes activar la traducción automática al castellano): https://youtu.be/CLVxdA6L8vQY si no se te ocurre ninguna idea interesante, siempre puedes volver a estudiar los sitios web de tus competidores y averiguar qué tipos de activos enlazables les funcionaron. Pero no olvides que incluso los mejores activos enlazables tienen que promocionarse para atraer enlaces. Porque la gente no puede enlazar cosas que no sabe que existen. Hablemos rápidamente de la promoción de contenidos. 4. Promoción de contenidosDe hecho, tenemos un artículo completo en el que enumeramos 21 tácticas de promoción de contenidos. Pero por ahora, quiero centrarme en tres: Publicidad. Una forma muy fácil de promocionar tu recurso entre miles de personas relevantes, pero que puede requerir un presupuesto importante. Contactar con influencers. Puedes buscar a todos los líderes de opinión activos en tu espacio y contactarles cada vez que publiques algo que merezca su atención. Si tienes suerte, puede que lo compartan con sus seguidores. Construir una base de seguidores. Definitivamente deberías empezar a construir una lista de correo electrónico (si aún no lo has hecho), así como ser activo en plataformas como X-Twitter y LinkedIn. Y si publicas constantemente contenido de calidad, más gente empezará a seguirte y muchos de ellos podrían acabar enlazando a tu contenido. Y no te olvides de promocionar tu contenido más antiguo mencionándolo en tu contenido recién publicado. Como dice Ryan Holiday en su libro “Vendedor Perenne” (Perennial Seller): “Crear más contenido y trabajo es una de las técnicas de marketing más eficaces”. 5. Autor invitado o guest postingEn realidad, esta táctica de link building está mal vista por algunos profesionales SEO. Principalmente porque algunas personas tienden a llevarlo al extremo hasta el punto de convertirse en spam. Y, sin embargo, el guest blogging es una de las formas más populares que tienen los SEO de conseguir enlaces hoy en día: Incluso aquí, en el blog de Ahrefs, realizamos colaboraciones de invitados de vez en cuando. Y nuestros autores y autoras invitadas pueden enlazar a algunos de sus propios recursos, siempre que sean relevantes para el tema de su artículo. Esto quiere decir que puedes conseguir enlaces con artículos invitados de forma perfectamente legítima. Pero, ¿cómo consigues que publiquen tu contenido en los mejores blogs de tu sector? Bueno, solo tienes que presentarles una idea de artículo realmente convincente. Y aquí tienes un consejo sencillo para conseguir ideas de contenido a las que sea difícil decir que no. Basta con encontrar a algunos competidores del blog para el que quieres escribir y utilizar la herramienta Content Gap (brecha de contenido) para averiguar qué temas aportan mucho tráfico a sus competidores, pero no se incluyen en el blog al que estás proponiendo una colaboración. Por ejemplo, un rápido análisis de Content Gap de nuestro propio blog comparado con los blogs de nuestros competidores revela un montón de temas estupendos de los que ellos obtienen tráfico de búsqueda, mientras que nosotros no.Si alguien nos propusiera de forma convincente que podría escribir un post decente sobre cualquiera de estos temas, nos resultaría muy difícil rechazarlo. Una táctica de publicación invitada algo menos conocida es encontrar un artículo de bajo rendimiento en el blog para el que quieres escribir y ofrecerles reescribirlo desde cero. Si puedes convencerles de que puedes mejorar mucho ese artículo y de que acabará posicionándose mejor en Google y aportándoles más tráfico de búsqueda, seguro que les costará resistirse a tu propuesta. ¿Cómo puedes encontrar estas páginas de bajo rendimiento? Solo tienes que abrir el informe Páginas principales en Site Explorer y utilizar el filtro “Tráfico”: Part 5Herramientas de Link buildingAunque técnicamente es posible hacer link building y conseguir enlaces con tu energía mental y una cuenta de Gmail, hay una serie de herramientas de link building que te ayudarán a que el proceso de adquisición de enlaces sea mucho más rápido y sencillo. Aquí tienes algunas herramientas gratuitas de link building: Comprobador gratuito de backlinks de Ahrefs. Muestra los 100 enlaces principales que apuntan a cualquier sitio web o URL.Alertas de Google. Te notifica cada vez que se menciona una palabra o frase específica en una página recién publicada. Es una forma estupenda de conseguir oportunidades de enlaces relevantes.Y aquí tienes algunas herramientas de link building de primera calidad: Site Explorer de Ahrefs. Te muestra todos los enlaces de cualquier sitio web o URL con una opción para ordenarlos y filtrarlos por muchas métricas SEO importantes.Content Explorer de Ahrefs. Una herramienta única de prospección de enlaces, que te ayuda a encontrar miles de webs relevantes para solicitar enlaces y publicar como autor invitado. También ayuda a descubrir activos enlazables sobre cualquier tema en toda la web.Alertas de Ahrefs. Similar a las Alertas de Google pero con más flexibilidad respecto a filtros SEO.Pitchbox/BuzzStream/GMass. Herramientas de outreach por correo electrónico. Hay muchas otras herramientas que te permiten enviar correos electrónicos personalizados a escala, pero estas son de las más populares entre profesionales SEO.Hunter.io/Voila Norbert. Conocidos como “servicios de búsqueda de correo electrónico”, que te ayudan a encontrar datos de contacto de sitios web a escala.Reflexiones finalesSiempre que explico link building a alguien sin experiencia, utilizo la misma metáfora. Es muy difícil hacer amigos si no eres una persona interesante (y generosa). Lo mismo se aplica a tu web: si no hay nada interesante o útil en ella, ¿por qué iba a interesarle a nadie enlazarla? Por eso muchos SEO afirman que nunca hacen link building de forma proactiva. Simplemente se centran en hacer cosas notables “dignas de enlaces” en sus webs y en promocionar ese trabajo entre audiencias relevantes. Y los enlaces llegan de forma natural. Eso es todo por mi parte. Espero que sientas que sabes más de link building. Y si te ha gustado la lectura y has llegado hasta aquí, por favor, menciónanos en nuestro X-Twitter en español @ahrefses. ¡Nos hará mucha ilusión! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía.",
  "headers": [
    {
      "level": "H1",
      "text": "Link Building para SEO: guía para principiantes"
    },
    {
      "level": "H2",
      "text": "Los fundamentos del link building"
    },
    {
      "level": "H2",
      "text": "Cómo conseguir enlaces"
    },
    {
      "level": "H3",
      "text": "1. Añadir enlaces"
    },
    {
      "level": "H3",
      "text": "2. Pedir enlaces"
    },
    {
      "level": "H3",
      "text": "3. Comprar enlaces"
    },
    {
      "level": "H3",
      "text": "4. Ganar enlaces"
    },
    {
      "level": "H2",
      "text": "¿Qué enlaces marcan la diferencia?"
    },
    {
      "level": "H3",
      "text": "1. Autoridad"
    },
    {
      "level": "H3",
      "text": "2. Relevancia"
    },
    {
      "level": "H3",
      "text": "3. Texto ancla (anchor text)"
    },
    {
      "level": "H3",
      "text": "4. Ubicación"
    },
    {
      "level": "H3",
      "text": "5. Destino"
    },
    {
      "level": "H2",
      "text": "Las mejores estrategias de link building"
    },
    {
      "level": "H3",
      "text": "1. Replicar los enlaces de tu competencia"
    },
    {
      "level": "H3",
      "text": "2. Haz outreach segmentado (difusión segmentada)"
    },
    {
      "level": "H3",
      "text": "3. Crear activos enlazables"
    },
    {
      "level": "H3",
      "text": "4. Promoción de contenidos"
    },
    {
      "level": "H3",
      "text": "5. Autor invitado o guest posting"
    },
    {
      "level": "H2",
      "text": "Herramientas de Link building"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Tim Soulo Tim Soulo Tim Soulo"
}