{
  "url": "https://ahrefs.com/blog/es/longitud-de-la-publicacion-del-blog/",
  "slug": "longitud-de-la-publicacion-del-blog",
  "title": "¿Cuán largas deben ser las publicaciones de tu blog? La \"verdad\" sobre la longitud del contenido",
  "description": "La mayoría de las publicaciones de blogs deben tener al menos 300 palabras. Para cualquier texto más corto, y probablemente debería preguntarse si tienes algo importante que decir.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La mayoría de las publicaciones de blogs deben tener al menos 300 palabras. Más corto que eso, y probablemente debería preguntarse si tienes algo importante que decir..A partir de ahí, alcanzar cierto número de palabras no debería ser tu objetivo. Tu objetivo debe ser escribir una publicación completa, atractiva y bien investigada que sea tan larga como debe ser: ni menos ni más.Sin embargo, el hecho de que estés leyendo esto significa que probablemente hayas escuchado que Google clasifica las publicaciones largas por encima de las cortas.En esta publicación, exploraremos por qué es casi seguro que esto sea incorrecto y qué deberías hacer para optimizar las publicaciones de tu blog para los motores de búsqueda.¿Por qué la gente piensa que las publicaciones largas en blogs son mejores para el SEO?Muchos estudios muestran una correlación entre la longitud del contenido y las cosas que asociamos con un buen rendimiento de SEO.Sin embargo, la correlación no prueba la causalidad.Así que analicemos un poco más un par de argumentos comunes.1. El contenido más extenso obtiene más enlaces externosLos backlinks son uno de los factores de clasificación de Google más importantes.Lo sabemos porque son la base del algoritmo PageRank. Google también habla de backlinks en el contexto de clasificar páginas útiles aquí.Si observas la relación entre el recuento de palabras y los enlaces externos, de hecho existe una fuerte correlación positiva.En este caso, los datos provienen del análisis de una muestra de alrededor de 900 millones de páginas de los más de 3 mil millones de páginas Content Explorer. Esa es nuestra herramienta de investigación de contenido para analizar el contenido de mejor rendimiento sobre un tema. Sin embargo, no somos los primeros en ver esta correlación. Muchas personas han analizado otras fuentes de datos y han encontrado lo mismo: el contenido más extenso obtiene más enlaces externos que el contenido más corto.¿Por qué podrías ver esta correlación?Comencemos con la posibilidad más obvia: las publicaciones de blog más largas parecen más impresionantes, y es por eso que más personas se vinculan a ellas.Aunque eso pueda parecer una afirmación razonable, nuestros datos realmente no lo respaldan.Echa otro vistazo al gráfico de arriba y verás que se corta en 1,000 palabras. Para las publicaciones más largas, encontramos una fuerte correlación negativa entre el recuento de palabras y los enlaces externos. En otras palabras, el número promedio de backlinks de sitios web únicos (dominios de referencia) comienza a disminuir después de 1,000 palabras.En términos generales, el contenido más extenso tiende a incluir puntos de conversación más “dignos de enlace”. Pero también oculta esos puntos importantes “necesarios de saber” entre una gran cantidad de información menos importante que “es buena saber”. El resultado es una pieza de contenido que menos personas leen de principio a fin, lo que significa que menos personas se encuentran con los puntos incluidos ‘dignos de enlace’. Y si menos personas se encuentran con ellos, menos personas enlazarán contigo.También es cierto que la mayoría de las personas no van a vincular a una publicación de blog que no hayan leído. Y habrá menos de esas personas si tu publicación tarda tres horas en leerse.Que deberias hacer al respecto?Manten las publicaciones de tu blog concisas y sin complicaciones mientras te aseguras de incluir puntos importantes ‘dignos de enlace’.Tiene sentido. Pero, ¿cómo sabes qué constituye un punto “digno de enlace”?Una forma es pegar la URL de una publicación de alto rango para su palabra clave objetivo en Site Explorer de Ahrefs. Luego, diríjete al informe de enlaces externos y observa los anclajes de los enlaces y el texto circundante para ver las tendencias.Por ejemplo, si hacemos esto para una de las publicaciones de mayor rango en “redacción SEO”, vemos que una cantidad desproporcionada de enlaces proviene de una mención del método de introducción APP.Como sabemos que esa sección es responsable de tantos enlaces, podemos asegurarnos de incluir algo similar cuando escribimos sobre el mismo tema.Eso es lo que hicimos en nuestra guía de redacción SEO. No queríamos copiar la otra publicación y mencionar el método APP, por lo que mencionamos otra fórmula de introducción útil en su lugar.key takeawayNo te concentres en la longitud. Concéntrate en incluir todos los puntos dignos de enlace de la forma más sucinta posible. Si no hay otra forma y necesitas medir la longitud, puedes contar las palabras usando varias herramientas.2. El contenido más extenso genera más tráfico orgánicoSegún nuestro análisis de las páginas en Content Explorer, existe una correlación positiva moderada entre la longitud del contenido y el tráfico orgánico.Pero nuevamente, no es prudente asumir la causalidad.¿Por qué podrías ver esta correlación?Primero consideremos la idea de que Google está predispuesto a un contenido más extenso. Como resultado, el contenido más largo ocupa un lugar más alto y obtiene más tráfico orgánico.Una vez más, nuestros datos realmente no respaldan esto.Si echas otro vistazo al gráfico anterior, notarás que se corta en 2000 palabras. Esto se debe a que encontramos una correlación negativa moderada entre el recuento de palabras y el tráfico orgánico para publicaciones de más de 2000 palabras. En otras palabras, la publicación promedio de 10,000 palabras recibe menos tráfico de búsqueda que la publicación promedio de 2,000 palabras.Por supuesto, podría darse el caso de que Google favorezca el contenido más extenso de hasta 2000 palabras, pero no vemos mucho mérito en ese argumento. Simplemente no tiene ningún sentido penalizar las publicaciones por ser “demasiado largas”.John Mueller de Google está de acuerdo. En 2019, afirmó que el recuento de palabras no es un factor de clasificación.Así que echemos un vistazo a algunas razones más convincentes por las que podría existir la correlación.Primero, hay una correlación positiva (hasta 1,000 palabras) entre el recuento de palabras y los enlaces externos. Ya lo sabemos y sabemos que los backlinks son importantes para la clasificación.En segundo lugar, el contenido más extenso tiende a ser más completo y, naturalmente, cubre más subtemas. Por esa razón, el contenido más largo a menudo se clasifica como más palabras clave de cola larga.Simplemente toma nuestra lista de operadores de búsqueda de Google. Según Site Explorer de Ahrefs, se clasifica para alrededor de 7.200 palabras clave.Muchas de estas palabras clave son solo otras formas de buscar lo mismo, como “comandos de búsqueda de Google” y “modificadores de búsqueda de Google”. Pero la página también se clasifica para términos relacionados como “google inurl” y “operador de tipo de archivo de google”.Esto sucede porque nuestra publicación es completa y menciona a ambos operadores.Si nuestra publicación de blog fuera menos exhaustiva y no hablara de estas cosas, no se clasificaría para esas palabras clave. Vemos que eso sucede con una publicación de la competencia sobre el mismo tema. Solo menciona doce operadores de búsqueda, por lo que no se clasifica para tantas palabras clave relacionadas.¿Qué debes hacer al respecto?En lugar de escribir incansablemente hasta que no haya posibilidad de que se haya perdido algo importante, comienza por investigar lo que es importante. De esa manera, puedes mantener tus publicaciones concisas al incluir lo importante y negar lo que no lo es.Una manera fácil de hacer esto es mirar las páginas de alto rango en busca de puntos en común.Por ejemplo, las dos páginas de alto rango para “dieta ceto” hablan sobre lo que es la dieta ceto …… y que comida debo comer:El hecho de que varias páginas de alto rango hablen de estas cosas te indica que probablemente sean puntos importantes.También puedes ejecutar un análisis de la brecha de contenido para encontrar las palabras clave que clasifican varias páginas de alto rango, luego observa el informe en busca de subtemas y puntos importantes. Para hacer esto, pega las URL de algunas páginas de alto rango para su palabra clave principal en la herramienta Content Gap de Ahrefs y deja el campo inferior vacío.Ejecute el informe y busque subtemas.Aquí, vemos palabras y frases como “qué es la dieta ceto”, “comidas ceto” y “desayuno ceto”.Solo esas pocas palabras clave por sí solas son suficientes para darnos un esquema general para una publicación de blog.conclusión claveNo te concentres en la longitud. Concéntrate en cubrir todos los subtemas relevantes de la manera más sucinta posible.Por qué las publicaciones de blog deben ser lo más concisas posibleAdemás de los datos correlacionales que muestran que la publicación de blog promedio obtiene menos enlaces externos y menos tráfico después de una cierta longitud, ¿hay alguna otra razón por la que deberías mantener las cosas lo más concisas posible?La respuesta simple es sí, porque nadie quiere leer más de lo necesario.En palabras de Tim Soulo, nuestro CMO:A nadie le gusta leer. Solo quieren la información. Si pudieran descargarlo en su cerebro, lo harían.Tim Soulo, CMOPero, ¿hay realmente alguna evidencia de esto además de la anecdótica?Absolutamente. Cuando Medium estudió la correlación entre la duración de las publicaciones y el tiempo de lectura promedio, notaron que la participación comienza a disminuir para las publicaciones con un tiempo de lectura superior a siete minutos.Según la Universidad de Chicago, la mayoría de las personas leen aproximadamente 250 palabras por minuto. Eso coloca una publicación de blog de 7 minutos en alrededor de 1.750 palabras.¿Eso significa que las publicaciones de tu blog nunca deberían ser más largas o más cortas que eso?Por supuesto no. Se necesitarán más de 1.750 palabras para abordar algunos temas a fondo y menos para otros. Es por eso que nuestra guía de SEO de YouTube tiene más de 7,000 palabras, y nuestra lista de extensiones de Chrome para SEO tiene solo 1,275. Hay más terreno que cubrir sobre el SEO de YouTube.Dicho esto, incluso si hay mucho terreno por recorrer, aún debes hacer un esfuerzo para eliminar las pelusas innecesarias de tus publicaciones.Una de las herramientas que puede ayudar con eso es Hemingway. Ayuda a mejorar tu escritura al informarlt sobre palabras y pelusas innecesarias. En mi experiencia, es fácil reducir la cuenta atrás de palabras en al menos un 10% con esta herramienta. Pero, de nuevo, podría ser que mi estilo de escritura sea inusualmente complicado.También vale la pena pedirle a un amigo o colega que lea la publicación de tu blog. ¿Por qué? Porque otras personas suelen ser mejores para detectar cuando un punto es innecesario y solo sirve para complicar la publicación. Esto es algo que hacemos para todas las publicaciones que publicamos.ConclusiónEs hora de acabar con la obsesión por el recuento de palabras. En cambio, concéntrate en crear publicaciones de blog concisas pero completas que atraigan a los lectores y sigan las mejores prácticas de SEO.¿ Te cuesta involucrar a la gente? Eche un vistazo a estos consejos de redacción publicitaria de SEO.¿Tienes preguntas? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "¿Cuán largas deben ser las publicaciones de tu blog? La “verdad” sobre la longitud del contenido"
    },
    {
      "level": "H2",
      "text": "¿Por qué la gente piensa que las publicaciones largas en blogs son mejores para el SEO?"
    },
    {
      "level": "H3",
      "text": "1. El contenido más extenso obtiene más enlaces externos"
    },
    {
      "level": "H4",
      "text": "¿Por qué podrías ver esta correlación?"
    },
    {
      "level": "H4",
      "text": "Que deberias hacer al respecto?"
    },
    {
      "level": "H3",
      "text": "2. El contenido más extenso genera más tráfico orgánico"
    },
    {
      "level": "H4",
      "text": "¿Por qué podrías ver esta correlación?"
    },
    {
      "level": "H4",
      "text": "¿Qué debes hacer al respecto?"
    },
    {
      "level": "H2",
      "text": "Por qué las publicaciones de blog deben ser lo más concisas posible"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Joshua Hardwick"
}