{
  "url": "https://ahrefs.com/blog/es/marketing-indirecto/",
  "slug": "marketing-indirecto",
  "title": "Marketing indirecto: qué es, tipos y ejemplos",
  "description": "Qué es el marketing indirecto, en qué se diferencia del marketing directo, pros y contras y ejemplos.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido El marketing indirecto o mercadotecnia indirecta es un tipo de marketing en el que no intentas vender un producto o servicio de forma explícita.En lugar de eso, se centra en actividades que generan reconocimiento de marca, construir relaciones con clientes potenciales y cuidarlas para que, con el tiempo, te compren.El supuesto de partida del marketing indirecto es que los clientes potenciales no van a comprar inmediatamente, sino a lo largo del tiempo.Y, si pensamos en nuestro propio comportamiento de compra, probablemente sea cierto. Por ejemplo, si necesitamos unos auriculares nuevos, lo más probable es que primero investiguemos por Internet, leamos foros, preguntemos a nuestros amigos y nos familiaricemos con las marcas y modelos disponibles; todo esto, antes de comprar.Por el contrario, en el marketing directo intentas, de forma explícita, que tus clientes potenciales te compren. Los canales incluyen email en frío, correo postal directo y publicidad.Contenido Tipos de marketing indirectoEstos son algunos tipos de marketing indirecto:1. Relaciones públicas (RR. PP. o PR, del inglés public relations)Las relaciones públicas o PR son la práctica de influir positivamente en la percepción de la marca mediante la gestión de la comunicación con medios y público en general.Algunas tácticas habituales incluyen ser «noticiable» (es decir, atraer el interés de los medios), responder a peticiones de medios (por ejemplo, con plataformas como Reportaro en España o HARO en el mundo anglosajón) creando notas de prensa, construyendo relaciones con periodistas y con acciones de relaciones públicas.Por ejemplo, Ahrefs fue mencionada en TechCrunch en 2022 y en Xataka en 2019:Esto fue posible porque teníamos:Un evento digno de mencionar en las noticias («estamos trabajando en un motor de búsqueda»).Relaciones con las personas adecuadas (todo gracias al trabajo duro de mi compañera, Daria Samokish).Lecturas complementarias9 Tácticas de relaciones públicas geniales con ejemplos de campañasDigital PR: La guía para principiantes para hacer que tu marca no pase desapercibida2. SEO (optimización para motores de búsqueda, del inglés search engine optimization)El posicionamiento SEO es la práctica de optimizar tu web y sus páginas para posicionar mejor en motores de búsqueda como Google. Lo que quieres es que tus páginas importantes aparezcan en Google cuando alguien busca palabras clave relevantes para ti o tu empresa. Por ejemplo, si alguien busca tu marca, tu web debería aparecer:Pero nadie buscará tu marca si no sabe que existe. Por ello, más allá de optimizar tu página principal, deberías tener como objetivo las palabras clave que tus clientes busquen.En Ahrefs creamos contenido que resuelve los problemas que tienen nuestros clientes potenciales. Por ejemplo, en España, cada mes se realizan 1.400 búsquedas de “link building”.Este es un problema que nuestra herramienta resuelve, por lo que creamos un contenido dirigido a ese tema.Cuando alguien busque esa palabra clave en Google, descubrirá nuestro contenido y, en el proceso, nuestra marca y nuestro producto.Si repites esto hasta el infinito y más allá, llegarás a cientos, o miles, de personas con tu marca (en nuestro caso, a unos 1.6 millones).Lectura recomendada: Guía SEO para principiantes3. Redes socialesCrear contenido de valor que convenza a las personas para que te sigan en plataformas de redes sociales como Twitter o TikTok es una gran forma de generar reconocimiento de marca y construir relaciones con tu audiencia.Por ejemplo, nuestra cuenta de Twitter tiene más de 137.000 seguidores y en nuestra cuenta en español somos más de 2.000 personas. En ambas compartimos de forma habitual consejos e ideas de SEO y marketing con nuestra audiencia:¿Tu canal de YouTube no crece? ❌Entonces es probable que no estés aplicando estrategias SEO de la forma correcta, o que no conozcas todas las posibilidades que existen.🧵 En este hilo te resumo los factores de posicionamiento más importantes:— Ahrefs en Español (@AhrefsES) April 19, 2023Marketing indirecto: pros y contras¿Deberías invertir en marketing indirecto? Vamos a ver los pros y contras de hacer mercadotecnia indirecta.ProsEstas son las ventajas del marketing indirecto (o mercadotecnia indirecta).1. El marketing indirecto construye demanda y reconocimiento de marca¿Por qué es importante construir reconocimiento de marca y demanda?Fácil: existe una cantidad limitada de personas que están listas para comprar justo en este momento. La mayoría de tus clientes potenciales todavía no saben que tienen un problema, no conocen las posibles soluciones o no conocen tu producto o servicio.Con el marketing directo solo te centras en un pequeño grupo de personas. No solo eso, puede que en realidad solo llegues a personas que ya estaban inclinadas a convertirse en tus clientes.Con el tiempo, necesitarás una forma de ampliar los clientes potenciales y puedes hacerlo con tácticas de marketing indirecto.2. El marketing indirecto es menos intrusivo y no invasivoLos clientes potenciales o prospectos están buscando contenido que les ayude a resolver problemas. Asimismo, las tácticas de marketing indirecto rara vez suponen el contacto directo con gente.ContrasAquí van algunos puntos negativos del marketing indirecto.1. El marketing indirecto lleva tiempoNo puedes construir una marca de la noche a la mañana, ni puedes conseguir 100.000 seguidores en un día. Establecer relaciones con periodistas lleva tiempo. Y posicionarse en Google, también.Darse cuenta de que los clientes necesitan tiempo para comprar, también implica darse cuenta de que establecer y cuidar relaciones lleva tiempo igualmente.2. El marketing indirecto es menos medibleLa vida está llena de imprevistos. Seguro que alguna vez te ha pasado que, después de analizar algo que ibas a comprar, lo has dejado de lado durante años para luego volver y comprarlo de repente. Tus clientes son iguales.Por eso, puede ser difícil determinar con exactitud qué táctica de marketing indirecto contribuyó al éxito. Esto no quiere decir que las técnicas de mercadotecnia indirecta no funcionen, pero puede que, en muchas ocasiones, no sea fácil atribuirlo de forma adecuada.Marketing directo: pros y contras¿Deberías invertir en marketing directo? Aquí van los pros y contras.Pros¿Cuáles son algunas ventajas del marketing directo?1. El marketing directo es medibleLas tácticas de marketing directo suelen ser trazables (cuántas aperturas, clics, conversiones y demás). Puedes ver estas métricas en plataformas publicitarias y software de envío de emails.2. El marketing directo es rápidoAl estar dirigidas a generar una respuesta o una compra, las tácticas de marketing directo pueden tener un impacto inmediato en los resultados de una empresa.ContrasNo todo son pájaros y flores en el marketing directo, también tiene sus puntos negativos.1. El marketing directo es intrusivoLas tácticas de marketing directo, como el email en frío y los anuncios, generalmente se consideran como algo intrusivo. Esto pasa porque el cliente potencial no solicitó recibir estos mensajes y, a pesar de eso, le llegan.2. El marketing directo tiene menos alcanceComo mencionamos anteriormente, el número de personas que están listas para comprar en un momento concreto es limitado. El marketing directo simplemente convierte a esas personas, pero no puede generar compras entre quienes ni siquiera saben que existes.3. El marketing directo se puede bloquearEl GDPR (o RGPD, Reglamento General de Protección de Datos), la CAN-SPAM (regulación de Estados Unidos para el envío de correos electrónicos) y los bloqueadores de anuncios (conocidos también como ad-blockers) existen para evitar que los mensajes de venta no solicitados lleguen a los consumidores.Ejemplos de marketing indirecto de éxito¿Buscas ejemplos de éxito de marketing indirecto? Aquí tienes cuatro para inspirarte.1. Ahrefs – BlogEl principal tipo de marketing que usamos en Ahrefs es el marketing de contenidos orientado a SEO. Puede resumirse en una frase:Creamos y mantenemos contenido de alta calidad, enfocado a la búsqueda, sobre temas con potencial de negocio, potencial de tráfico de búsqueda y potencial de posicionamiento.Explicado paso a paso:Investigamos temas que nuestros clientes están buscando en Google.Los filtramos revisando su potencial de negocio; es decir, por lo fácil que resulta presentar nuestro producto mientras creamos contenido sobre esas palabras clave.Priorizamos temas analizando su potencial de posicionamiento; es decir, por lo viable que nos resultará posicionarnos entre los tres primeros resultados con los recursos disponibles.Creamos contenido dirigido a esos temas.Actualizamos o reescribimos esos contenidos en caso de que no posicionen o queden desactualizados.Esta estrategia implica que los clientes siempre nos descubren cuando están buscando soluciones a sus problemas en Google.Nuestra estrategia es sencilla: no se trata de tácticas de moda o de las últimas tendencias. No obstante, esta simplicidad intencionada nos permite hacer un seguimiento fácil de nuestra estrategia y es la fuerza detrás de nuestros ingresos recurrentes anuales (ARR, del inglés Annual Recurring Revenue) de 8 cifras.Puedes aprender a replicar esta estrategia en el enlace de abajo.Lectura recomendada: Cómo crear una estrategia de contenido SEO (sigue el marco de Ahrefs) - en inglés2. KFC España – TwitterKFC es una cadena de comida rápida de origen estadounidense, pero no lo parece por los tuits que publica:a por el lunes 💪 pic.twitter.com/C0IBufP1hS— KFC (@KFC_ES) May 22, 2023Si no te suena, KFC lleva años creando contenido de forma completamente distinta a la de la mayoría de marcas en redes sociales. En lugar de crear contenido aburrido y corporativo, comparte memes, se mete en conversaciones absurdas con la competencia y escribe de forma irónica y divertida.Sin embargo no se queda en meras publicaciones. En marzo de 2022, España sufrió una ola de calima (básicamente, mucho polvo suspendido en el aire) y, desde KFC, lanzaron una oferta muy curiosa: todas las personas que acudieron a cualquier KFC Auto con el coche «rebozado» y las letras de KFC dibujadas recibieron dos tiras de pollo rebozado:Vamos a hacer una cosa: si os pasáis por cualquier KFC Auto con un coche rebozado y las letras KFC pintadas con el dedo, os regalamos dos tiras de pollo con el rebozado de verdad. No es broma. Los restaurantes ya están avisados. pic.twitter.com/Me5T8yk84n— KFC (@KFC_ES) March 15, 2022La campaña de relaciones públicas fue mencionada por algunos de los principales medios de marketing y noticias en España y tuvo un gran impacto en redes sociales, con más de 14.000 me gusta y más de 1.000 RT en Twitter.No es la única cuenta que hace uso del humor y la ironía para destacar entre el ruido. Otros ejemplos interesantes pueden ser Lidl España o la cadena de hamburguesas estadounidense Wendy’s.3. Aprendemos Juntos – YouTubeBBVA es uno de los mayores bancos de España y del mundo. En enero de 2018, lanzó una de sus iniciativas de marketing más exitosas: «Aprendemos Juntos», que sigue en activo y que ahora se centra más en temas de sostenibilidad.Aprendemos Juntos no vive únicamente en YouTube (es un proyecto que cuenta con web propia y presencia en las principales redes sociales, desde TikTok a Instagram), pero es en su canal de YouTube donde podemos encontrar los contenidos más completos.Por su plató han pasado más de 300 personalidades de altísimo nivel, desde Jane Goodall (la conocida primatóloga), el educador Ken Robinson, el Mago More o Steven Pinker.A pesar de tratarse de la iniciativa de un banco, no tratan de venderte hipotecas ni tarjetas de crédito o cuentas corrientes: es un proyecto de contenidos sobre educación y que cuenta con unos valores de producción muy elevados.Ya en 2020 superaba los 1.000 millones de horas de reproducción y rivalizaba con marcas de la entidad de TED.4. Librerías Gandhi - Twitter, web, espectacularesLibrerías Gandhi es una historia de éxito de más de 50 años y nacida en un contexto poco favorable. Triunfar con la venta de libros, en un país cuyos ciudadanos leen menos de dos al año (México), es un caso digno de estudio.Sin duda la adaptación a las nuevas tendencias ha sido clave: lanzó su tienda digital hace casi dos décadas, a la par que decidió apostar por una comunicación más casual y divertida.La empresa decidió arriesgar y establecer una estrategia enfocada a generaciones más jóvenes. Para ello centraron sus esfuerzos en campañas permanentes mediante anuncios espectaculares en las principales ciudades de México. ¿Dónde está lo especial? Que realmente no anuncian sus libros. Sus «anuncios» son divertidos juegos de palabras que mezclan temas de lectura con sucesos sociales, políticos y hasta deportivos.Y este mismo ingenio lo han sabido trasladar a sus canales digitales. Por ejemplo, en enero de 2023, se unieron al tema Shakira-Piqué con un tweet polémico que les generó 230.000 impresiones y fue compartido casi 700 veces.Lo bueno de una antología es que siempre hay más de una historia 🤷🏻‍♀️. pic.twitter.com/tTmsAOeOwQ— Librerías Gandhi (@LibreriasGandhi) January 12, 2023Rápidamente este tipo de mensajes, posts y tweets se han convertido en tema de conversación entre jóvenes y no tan jóvenes en todo el país. Incluso durante las campañas presidenciales de 2018, muchos usuarios de redes sociales retomaron los colores y el tono ingenioso de las campañas de Gandhi para hacer memes en contra de los candidatos.Reflexiones finalesLas mejores empresas usan marketing tanto directo como indirecto. No discriminan entre estrategias. Si quieres mejorar tu empresa, necesitas usar las dos.¿Alguna pregunta? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing indirecto: qué es, tipos y ejemplos"
    },
    {
      "level": "H2",
      "text": "Tipos de marketing indirecto"
    },
    {
      "level": "H3",
      "text": "1. Relaciones públicas (RR. PP. o PR, del inglés public relations)"
    },
    {
      "level": "H3",
      "text": "2. SEO (optimización para motores de búsqueda, del inglés search engine optimization)"
    },
    {
      "level": "H3",
      "text": "3. Redes sociales"
    },
    {
      "level": "H2",
      "text": "Marketing indirecto: pros y contras"
    },
    {
      "level": "H3",
      "text": "Pros"
    },
    {
      "level": "H4",
      "text": "1. El marketing indirecto construye demanda y reconocimiento de marca"
    },
    {
      "level": "H4",
      "text": "2. El marketing indirecto es menos intrusivo y no invasivo"
    },
    {
      "level": "H3",
      "text": "Contras"
    },
    {
      "level": "H4",
      "text": "1. El marketing indirecto lleva tiempo"
    },
    {
      "level": "H4",
      "text": "2. El marketing indirecto es menos medible"
    },
    {
      "level": "H2",
      "text": "Marketing directo: pros y contras"
    },
    {
      "level": "H3",
      "text": "Pros"
    },
    {
      "level": "H4",
      "text": "1. El marketing directo es medible"
    },
    {
      "level": "H4",
      "text": "2. El marketing directo es rápido"
    },
    {
      "level": "H3",
      "text": "Contras"
    },
    {
      "level": "H4",
      "text": "1. El marketing directo es intrusivo"
    },
    {
      "level": "H4",
      "text": "2. El marketing directo tiene menos alcance"
    },
    {
      "level": "H4",
      "text": "3. El marketing directo se puede bloquear"
    },
    {
      "level": "H2",
      "text": "Ejemplos de marketing indirecto de éxito"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs – Blog"
    },
    {
      "level": "H3",
      "text": "2. KFC España – Twitter"
    },
    {
      "level": "H3",
      "text": "3. Aprendemos Juntos – YouTube"
    },
    {
      "level": "H3",
      "text": "4. Librerías Gandhi - Twitter, web, espectaculares"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}