{
  "url": "https://ahrefs.com/blog/es/marketing-contenidos-empresa/",
  "slug": "marketing-contenidos-empresa",
  "title": "¿Qué es el marketing de contenidos empresarial? Estrategias necesarias para el éxito",
  "description": "El marketing de contenidos empresarial consiste en crear y compartir contenidos relevantes para atraer, comprometer y retener al público objetivo de una organización.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido El marketing de contenidos empresarial consiste en crear y compartir contenidos relevantes para atraer, comprometer y retener al público objetivo de una organización.Cuando el marketing de contenidos empresarial se hace bien, puede generar muchos clientes potenciales, conversiones y, por tanto, ingresos. Además, puede ayudar en aspectos como la percepción y el conocimiento de la marca.Existe la idea errónea de que los sitios web de grandes empresas se posicionan en todo. Sin duda tienen una ventaja, pero aún así tienen que averiguar qué contenido crear y esforzarse para posicionarse.Incluso con todas las ventajas que tienen esas empresas que cuentan con un dominio potente, el personal y los recursos luchan por utilizar el SEO de forma eficaz para conseguir más tráfico.La escala, la complejidad, la política, la falta de estrategia, la falta de procesos y la burocracia hacen que el marketing de contenidos empresarial sea más difícil que el de las empresas más pequeñas.Veamos cómo enfocar el marketing de contenidos empresarial.Construye tu equipo y fortaléceloAl empezar, es posible que no dispongas de recursos adicionales, financiación, o quizá ni siquiera del personal que necesitas. Puede que tengas que poner en marcha un programa e incluso escribir el contenido sin ayuda de nadie.No pasa nada. Lo importante es progresar. No dejes que lo perfecto sea enemigo de lo bueno.Personal y recursosSi al menos puedes reunir a un equipo base formado por una persona experta en SEO, un redactor/a y un editor/a, el proceso será más fluido. Además, intenta contar con algunas personas con conocimientos en el tema a las que puedas entrevistar antes de escribir el contenido o pídeles que lo revisen para contar con la opinión de personas expertas.A medida que avances, conseguirás más recursos y llenarás más lagunas. Con el tiempo, es probable que puedas ampliar el equipo de redacción, SEO, edición, gestión de proyectos, diseño, estrategia de contenidos y recursos de desarrollo. Según mi experiencia, a menudo es más fácil y barato incorporar recursos externos a medida que vas escalando que incorporar a alguien para un puesto a tiempo completo.También tendrás que asegurarte de que tu equipo tiene acceso a cualquier herramienta SEO empresarial que necesite para tener éxito, como Ahrefs.Ten un lugar donde publicar tus contenidosLo principal es progresar, y eso significa que el contenido tiene que estar en un sitio fácil de publicar para ti y tu equipo. La mayoría de la gente empieza por un blog. Si se requiere un montón de trabajo de diseño personalizado o desarrolladores para crear cada página, va a ser difícil progresar.Tácticas de marketing de contenidos para empresasEl éxito del marketing de contenidos requiere mucho trabajo. Aquí tienes algunas cosas que puedes hacer.Crea contenido nuevoHay muchos tipos diferentes de contenido que puedes crear, pero con recursos limitados, por lo general es mejor empezar con contenido informativo y vídeos, ya que proporcionan un retorno de la inversión alto. Cuando dispongas de más recursos, podrás crear eventos virtuales, cursos, libros electrónicos, casos prácticos, white papers, podcasts o incluso revistas o libros.El proceso de ventas de las empresas suele ser más largo. Muchas empresas prefieren prescindir de los contenidos informativos de la parte superior del embudo y centrarse más en el tráfico de la parte final del embudo que convierte. Al hacerlo, reducen su canal de ventas y dan a sus competidores la oportunidad de ser vistos como expertos en vez de ellos.Empezar con el contenido de la parte inferior del embudo tiene sentido, pero con el tiempo, te interesará crear ese contenido de la parte superior del embudo y ampliar tu canal.A la hora de crear contenidos, hay que encontrar un proceso que funcione mejor para la empresa y los creadores de contenidos. Esto cambiará en función de quién cree los contenidos.¿Qué contenidos deberías crear?Me gusta empezar con las páginas más importantes de mi competencia en vez de empezar la investigación con una lista de palabras clave. Si exportas y combinas estos datos, terminas con una lista de los contenidos más exitosos de tu competencia, y puedes empezar con el contenido que sabes que ya funciona y que probablemente está aportando valor a un competidor. Hablo del proceso que yo sigo para esto en nuestro artículo sobre cómo crear un contenido de calidad.A todos los equipos con los que he trabajado, ya se centraran en el producto o en el marketing, les encantaba ver estos datos. Es posible que prefieras hacer un seguimiento de tu creación de contenidos en Google Sheets o Airtable.De forma alternativa, puedes utilizar la herramienta Content Gap para encontrar estas oportunidades, pero es posible que veas algunas oportunidades repetidas debido a palabras clave similares. Actualizaremos esto para añadir agrupación y ayudar a reducir este ruido adicional.Por el momento, puedes exportar las palabras clave de la herramienta Content Gap, pegarlas en Keywords Explorer e ir a la pestaña “Grupos por tema principal”. Esto debería proporcionar oportunidades de contenido que estés pasando por alto.SEO creando contenidoPara aquellas personas SEO que escriben el contenido, les recomiendo que hablen con los expertos o los entrevisten para conocer sus puntos de vista. Es posible que cuenten con artículos, presentaciones, podcasts o seminarios web que puedas reutilizar. El equipo de ventas es otra gran fuente de información. También me fijaré en lo que la gente busca sobre un tema y lo que cubren otras páginas.Muchas organizaciones crean contenido de imitación, pero eso no es más que más contenido igual al que ya existe. De esta forma no te preparas para el futuro. Te animo a que lo hagas mejor. Si puedes trabajar un poco más y ampliar la información que ya existe, tu contenido tendrá más éxito.Escritores creando contenidoEs probable que cuentes con un equipo de personas que crean los contenidos y que puedas capacitarlas para que realicen este proceso por sí mismas.Una de las cosas que me gustaba hacer con los equipos de contenidos era un ejercicio de clasificación por tarjetas. Se toman los datos sobre lo que la gente busca y sobre lo que hablan las páginas más visitadas y se colocan en fichas.Haz que tus redactores de contenidos los organicen de forma que tengan sentido para ellos. Agruparán los datos en temas y subtemas y propondrán las secciones o páginas de contenido que tengan que escribir.Esto ayuda a formar a las personas para que realicen esta tarea por sí mismas, y no hay una respuesta correcta o incorrecta sobre cómo organizarse. También se puede mostrar cómo las páginas principales cubren esta información como confirmación de que funciona. Mientras escriba sobre lo que la gente busca, es probable que tenga éxito.Como alternativa, los SEO pueden proporcionar a sus redactores un esquema o resumen de contenido fácil de digerir que incluya lo que debería tratarse en el artículo.Para ver cómo lo está haciendo cada autor o equipo, se pueden crear carteras. Las carteras te ayudarán a identificar a los creadores más destacados o a los redactores o equipos que necesiten más ayuda.Expertos que crean contenidosSi tus empleados quieren escribir contenidos, tienes que encontrar la manera de que puedan hacerlo. Ellos son los expertos, y aunque el contenido que crean puede requerir alguna edición, las ideas de estos empleados son valiosas y puede que no estén en ningún otro sitio.Si tus expertos no tienen tiempo para escribir contenidos, otra opción es entrevistarlos o pedirles que revisen los contenidos que creas. La mayoría de la gente suele estar dispuesta a dar ideas rápidas verbalmente, que luego puedes utilizar en tu contenido.Mejora los contenidos existentesMejorar los contenidos existentes puede reportar beneficios rápidos. Veamos qué puedes tener en cuenta para encontrar dichos contenidos.Contenidos con tráfico decrecienteAplica un filtro para “Tráfico: Empeorado” en el informe Páginas principales en Site Explorer y establece el periodo de tiempo para los últimos 6 meses o un año. Echa un vistazo a las páginas que perdieron tráfico para ver cuáles son importantes para ti y que crees que puedes mejorar.Opciones fácilesUna forma común de priorizar las mejoras de contenido es buscar oportunidades al alcance de la mano, como son las páginas que ocupan las posiciones 4-15 para las palabras clave principales. Es posible que puedas mejorar rápidamente el contenido de estas páginas para que se posicionen mejor y obtengan más tráfico. Utiliza Google Search Console o el informe de palabras clave orgánicas de Site Explorer para encontrar páginas que se ajusten a este perfil.Optimiza para los fragmentos destacadosEn el caso de los contenidos informativos, los fragmentos destacados pueden catapultarte a lo más alto de las SERP.Así es cómo encontrar las oportunidades más fáciles:Dirígete a Site Explorer de Ahrefs.Introduce tu dominio.Entra en el informe de palabras clave orgánicas.Filtra las palabras clave en las posiciones #1-5.Filtra las palabras clave que activan los fragmentos destacados “donde el objetivo no se posiciona”.Busca palabras clave en las que tu página no tenga la respuesta y añádela.Esta es posiblemente la sección más importante que se puede escribir si lo que se quiere es posicionarse para consultas informativas. Puedes ver el contenido que ya podría formar parte de un fragmento y el tipo de cosas que estos fragmentos mencionan, junto con por qué uno puede ser mejor que otro. Ahora solo tienes que hacer algo que sea mejor.Un ejemplo: Para “cómo crear contenidos”, el fragmento principal es de inc.com:Si añades “-inc.com” a tu búsqueda, estarás eliminando este sitio de los resultados y podrás ver el segundo fragmento destacado elegible de hubspot.com:Puedes repetir este proceso, eliminando más sitios de los resultados para ver más fragmentos destacados que podrían resultar idóneos. Además, puedes obtener información sobre lo que se necesita para obtener fragmentos destacados y averiguar por qué uno puede ser considerado mejor que otro.En el caso de algunos términos de cabecera de naturaleza más informativa, puede que tengas que refinar la consulta como “qué es [término de cabecera]” para que esto funcione.Traduce contenidos que funcionenLa mayoría de las empresas operan en muchos países y en muchos idiomas distintos, y sus equipos de SEO empresarial tendrán que trabajar en SEO internacional. Si tienes un contenido que funciona bien en un idioma, es probable que también funcione bien en otro. Hay que traducir el contenido de éxito a esos otros idiomas.Esto nos ha funcionado bien en Ahrefs a pesar de asignar recursos mínimos a este proceso. Es una de las áreas en las que espero un crecimiento masivo a medida que empecemos a centrarnos más en ella.Crea branded content… de vez en cuandoEs probable que te encuentres con contenidos demasiado centrados en la marca, demasiado centrados en el producto o incluso demasiado centrados en las palabras clave. Tus compañeros te pedirán que te posiciones para términos con páginas que ellos controlan y que no se alinean con la intención de búsqueda. Un buen ejemplo es alguien que quiere “añadir algunas palabras clave” en su página de producto para posicionarse para un término informativo.Puedes utilizar la función “Identificar intenciones” de Keywords Explorer para mostrar la intención principal de cada término y el porcentaje de tráfico de cada resultado. Una página de producto para “gestión de contenidos empresariales” no es probable que se posicione para esta consulta, ya que las principales páginas que se posicionan son de intención informativa.En algunas ocasiones, puede haber una página de producto que se posicione para términos como este en la que tengas una oportunidad de posicionarte, pero normalmente se trata del producto más popular en esa posición.Hay ocasiones en las que quizás te interese optimizar e incluso crear contenido para términos de marca, pero esta no debería ser tu estrategia habitual. Tampoco deberías “añadir algunas palabras clave” en páginas centradas en marcas o productos para intentar posicionarte en términos informativos. Estas páginas pueden estar llenas de jerga de marketing o ventas y no tener el contenido que realmente necesita para posicionarse.Muchos sitios web de empresas obtienen gran parte de su tráfico general de búsquedas de marca, y es posible que no se posicionen bien para términos sin marca. El tráfico de marca es bueno. Es de alta calidad y se convierte bien, pero deberías obtenerlo incluso sin ayuda de SEO.Las excepciones pueden ser los términos relacionados con empresas que han sido adquiridas o productos que han cambiado de nombre. Es posible que aún se necesite contenido o documentación para ayudar a mantener el tráfico para esos términos y dirigir a la gente a las nuevas versiones del producto.Lecturas complementariasBranded content: guía completa con ejemplosSindicación de contenidosLa sindicación de contenidos se produce cuando uno o varios sitios de terceros vuelven a publicar una copia de un contenido que apareció originalmente en otro sitio. Suele ocurrir con los contenidos de noticias, aunque, siendo honestos, cualquier sitio popular va a tener scrapers y los sitios empresariales pueden tener una estrategia de sindicación de pago.La sindicación tiene muchas ventajas, como un mayor alcance. Echa un vistazo a nuestro artículo sobre sindicación de contenidos para saber más sobre ella y cómo seguir las prácticas recomendadas.Redirigir contenidos antiguos relevantesEn muchos casos, las URL antiguas tienen enlaces de otros sitios web. Si no se redirigen a las páginas actuales, esos enlaces se pierden y dejan de contar para tus páginas. No es tarde para hacer estas redirecciones, y se puede recuperar rápidamente cualquier valor perdido y ayudar a que el contenido se posicione mejor.Así es como puedes encontrar estas oportunidades:Pega tu dominio en Site Explorer (también accesible en Ahrefs Webmaster Tools)Dirígete al informe de Mejor por enlacesAñade un filtro de respuesta HTTP “404 no se encuentra”Suelo ordenarlo por “Dominios de referencia”.Construir y mejorar los enlaces internosSiempre he considerado que los enlaces internos son una forma poderosa de ayudar a las páginas a posicionarse mejor. Incluso estos enlaces pueden ser difíciles de conseguir en un entorno empresarial.A veces, distintas personas son responsables de diferentes secciones del sitio web o incluso de diferentes páginas, lo que puede hacer que el enlazado interno lleve mucho tiempo.Además de los obstáculos políticos, el proceso de enlazado interno puede ser un poco complicado. O bien hay que conocer bien el sitio y leer varias páginas en busca de oportunidades de enlaces, o bien seguir un proceso que implica mucho scraping y crawling para encontrar oportunidades.En Ahrefs, hemos hecho esto más simple, escalable y accesible para que cualquiera pueda encontrar estas oportunidades con nuestra herramienta en Site Audit. Miramos para qué están posicionadas tus páginas y sugerimos enlaces desde otras páginas de tu sitio que hablen de esas cosas.También recomendaría no quitarle el ojo a las oportunidades de mejorar el texto de anclaje de los enlaces. Es común que los creadores de páginas utilicen demasiado texto de anclaje de enlaces genéricos como “Más información”, “Leer más” o “Haz clic aquí”. Puedes buscar el uso de este tipo de texto genérico en el informe Texto ancla de Site Explorer.Crea páginas “vs”La creación de contenidos que te comparen con la competencia puede ser difícil en un entorno empresarial debido a todos los obstáculos legales. Sigo pensando que es útil impulsar este tipo de páginas para poder controlar la narrativa.Hay formas de hacerlo sin tener tablas gigantes que comparen cada característica. De todos modos, siempre están sesgadas. Por ejemplo, en nuestra página vs. mostramos lo que los usuarios piensan de nosotros y hablamos de la calidad de nuestros datos y características únicas.Esta página nos ha dado buenos resultados y creo que crearemos más páginas como esta en el futuro.Crea herramientas gratuitasSi puedes crear herramientas gratuitas en torno a tu producto o datos, puedes utilizarlo como táctica de lead-gen para tus productos principales.En Ahrefs utilizamos esta estrategia, y algunas de nuestras páginas con más tráfico provienen de herramientas gratuitas. Incluso hemos creado un montón de herramientas de escritura gratuitas, que estamos empezando a monetizar.Crea contenidos programáticosSi tienes la capacidad de crear páginas de calidad mediante programación utilizando tus datos, puede ser una forma ideal de escalar rápidamente.Hemos tenido cierto éxito con un mínimo esfuerzo reutilizando componentes para crear páginas “SEO para x”, donde x son diferentes tipos de negocio. La mayoría de ellas ya tienen un buen posicionamiento, pero en algún momento creo que nos esforzaremos más y sacaremos más datos para mejorar aún más estas páginas.Estamos trabajando en otras iniciativas programáticas que mostrarán aún más nuestros datos y que espero que generen muchos clientes potenciales.Crea contenido en vídeoEl contenido en vídeo puede funcionar muy bien para las empresas. Sam Oh dirige toneladas de clientes potenciales hacia Ahrefs.El canal de YouTube de Ahrefs tiene más de 500.000 suscriptores con menos de 300 videos publicados. Muchos de estos vídeos tienen más de 1 millón de visitas.En otros trabajos, siempre he tratado los vídeos del mismo modo que el contenido de un blog y he estructurado los temas de conversación en torno a las cosas que la gente busca y quiere saber. Esto ha funcionado muy bien, incluso en sectores en los que la gente estaba convencida de que no veían vídeos.Consigue el buy-in y escalaEn las organizaciones empresariales puede ser difícil orientarse, navegar por el panorama político y competir por los recursos. No esperes milagros inmediatos. Puede llevar un tiempo conseguir tracción. Así es como se progresa:Muestra tus éxitosCuando tengas un éxito inicial, muéstralo repetidamente. Con el tiempo, conseguirás defensores de tu trabajo y equipos que querrán trabajar contigo para repetir ese éxito. Repite tu éxito con otros equipos o unidades de negocio y muéstralo también. Gana impulso de uno en uno y, con el tiempo, la mayor parte de la organización se lo creerá.Además, intenta participar en las iniciativas de formación de la empresa. De este modo, puedes mostrar el éxito que has tenido y, al mismo tiempo, enseñar a los demás lo que tienen que hacer.Cuando elabores informes y muestres tus éxitos, intenta mostrar los ingresos generados o lo más parecido posible a ingresos. Ingresos, SQL, MQLS, etc. Es lo que interesa a los ejecutivos, y es más probable que te presten atención.Consigue un ascensoA medida que se asciende en el organigrama, resulta más fácil progresar. Habrá más dinero disponible y será más fácil conseguir la aprobación de los ejecutivos. Llega un momento en que las cosas empiezan a centralizarse y aparecen los Centros de Excelencia (CoE). A medida que se redactan las normas y los procesos, es más fácil que todo el mundo siga las “prácticas recomendadas”. Esto debería conducir a un mayor éxito y a una mayor aceptación. Todas las empresas parecen pasar por transiciones similares en su madurez SEO.Crea cuadros de mando SEO empresarialesOtra táctica que puedes utilizar para poner las cosas en marcha es crear cuadros de mando para los distintos equipos de producto o las distintas unidades de negocio con el fin de mostrar cómo está mejorando cada uno de ellos en función de las distintas métricas. Esto puede ayudarte a identificar las áreas que necesitan ayuda adicional o pueden necesitar algo de persuasión para poner las cosas en marcha. Describo cómo hacerlo con más detalle en el artículo sobre métricas e informes de SEO empresarial (en inglés).Intégrate con otros equiposUna forma de conseguir más aceptación es mostrar a la gente el panorama general. Comunícate con otros equipos para integrarte con ellos y, a continuación, muestra a todo el mundo cómo eso conduce a un mayor éxito empresarial.Por ejemplo, al equipo de Pagos le encantaría volver a dirigirse a las personas que aterrizaron en sus páginas orgánicas. El equipo de Redes sociales puede ayudarte a promocionar tus contenidos. Si puedes mostrar a los ejecutivos la imagen completa de cómo los equipos pueden ayudarse mutuamente para hacer crecer el negocio, conseguirás más fácilmente la aceptación y los recursos. También puedes pedirles que te ayuden a promocionar tus contenidos en sus canales.Alinéate con los objetivos empresarialesTambién puede ser útil alinearse con los objetivos de la empresa. Difundir contenidos sobre productos o servicios que la empresa quiere desarrollar es una buena forma de llamar la atención. Muchas empresas tienen algún tipo de proyecto top 20 / top 50 en el que tienen cosas específicas que quieren impulsar y hacer crecer. Empieza por ahí, llama la atención de la gente de arriba y te resultará más fácil hacer crecer tu programa de marketing de contenidos empresarial.Reflexiones finalesHay mucho en juego en el SEO empresarial y muchas oportunidades. No dejes de empujar y de crear impulso, victoria a victoria. Cuando una empresa y su equipo finalmente se ponen detrás del SEO, pueden terminar dominando una industria.Si tienes algún consejo, experiencia en SEO empresarial que quieras compartir o alguna pregunta, estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es el marketing de contenidos empresarial? Estrategias necesarias para el éxito"
    },
    {
      "level": "H2",
      "text": "Construye tu equipo y fortalécelo"
    },
    {
      "level": "H3",
      "text": "Personal y recursos"
    },
    {
      "level": "H3",
      "text": "Ten un lugar donde publicar tus contenidos"
    },
    {
      "level": "H2",
      "text": "Tácticas de marketing de contenidos para empresas"
    },
    {
      "level": "H3",
      "text": "Crea contenido nuevo"
    },
    {
      "level": "H4",
      "text": "¿Qué contenidos deberías crear?"
    },
    {
      "level": "H4",
      "text": "SEO creando contenido"
    },
    {
      "level": "H4",
      "text": "Escritores creando contenido"
    },
    {
      "level": "H4",
      "text": "Expertos que crean contenidos"
    },
    {
      "level": "H3",
      "text": "Mejora los contenidos existentes"
    },
    {
      "level": "H4",
      "text": "Contenidos con tráfico decreciente"
    },
    {
      "level": "H4",
      "text": "Opciones fáciles"
    },
    {
      "level": "H4",
      "text": "Optimiza para los fragmentos destacados"
    },
    {
      "level": "H3",
      "text": "Traduce contenidos que funcionen"
    },
    {
      "level": "H3",
      "text": "Crea branded content… de vez en cuando"
    },
    {
      "level": "H3",
      "text": "Sindicación de contenidos"
    },
    {
      "level": "H3",
      "text": "Redirigir contenidos antiguos relevantes"
    },
    {
      "level": "H3",
      "text": "Construir y mejorar los enlaces internos"
    },
    {
      "level": "H3",
      "text": "Crea páginas “vs”"
    },
    {
      "level": "H3",
      "text": "Crea herramientas gratuitas"
    },
    {
      "level": "H3",
      "text": "Crea contenidos programáticos"
    },
    {
      "level": "H3",
      "text": "Crea contenido en vídeo"
    },
    {
      "level": "H2",
      "text": "Consigue el buy-in y escala"
    },
    {
      "level": "H3",
      "text": "Muestra tus éxitos"
    },
    {
      "level": "H3",
      "text": "Consigue un ascenso"
    },
    {
      "level": "H3",
      "text": "Crea cuadros de mando SEO empresariales"
    },
    {
      "level": "H3",
      "text": "Intégrate con otros equipos"
    },
    {
      "level": "H3",
      "text": "Alinéate con los objetivos empresariales"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Patrick Stox"
}