{
  "url": "https://ahrefs.com/blog/es/mejores-practicas-seo/",
  "slug": "mejores-practicas-seo",
  "title": "12 buenas prácticas de posicionamiento que todo el mundo debería seguir",
  "description": "Mejore su posicionamiento conectas buenas prácticas para blogs, tiendas online, tiendas físicas y todo tipo de negocios.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La mayoría de listas de buenas prácticas de SEO están hasta arriba de consejos malos obsoletos. Y cuando no es así solamente se sentaran en cosas que solo se aplican a un pequeño porcentaje de lectores. En otras palabras, son consejos de posicionamiento, y no buenas prácticas.Las buenas prácticas las deberían de poder seguir todos, independientemente de que sea para un blog, una tienda online, o un negocio físico.En el artículo de hoy, vamos a visitar las buenas prácticas más esenciales que seguir para todas las páginas de su sitio web1. Usar HTTPsAl encriptar la información enviada entre el usuario y el servidor, hace que las páginas de su web sean más seguras. Y, desde 2014 es un factor de posicionamiento de Google.Puede saber si su página web ya está usando HTTPS comprobando la barra de direcciones en su navegador.Sí sé un candado a la izquierda de la dirección, está todo correcto.De otro modo, necesita instalar un certificado SSL.La mayoría de los hostings los ofrecen en sus ofertas. Si no es el caso de su alojamiento, puede elegir uno gratuitamente desde LetsEncrypt.La buena noticia es que cambiar a HTTPS se hace todo de una vez. Cuando lo tenga instalado, las páginas de su sitio serán seguras, incluyendo las que publicará en el futuro.2. Asegúrese de que sus páginas carguen rápidamente.A nadie le gusta visitar una página que tarda la vida en cargar. Por eso la velocidad de carga es un factor de posicionamiento desde 2010 para ordenadores, y para móviles desde 2018.Muchos factores afectan la velocidad de la página, incluyendo el código de la misma, la ubicación del servidor, o las imágenes.Puede conseguir una estimación del rendimiento de su página usando Google’s Pagespeed Insights tool. Simplemente pegue su URL, y obtendrá una puntuación de 0 a 100, seguida de unas recomendaciones para mejorar.El problema con Pagespeed Insights es que solamente se puede comprobar una página a la vez.Puede solucionar esto registrándose en la Google Search Console, y comprobar el informe de velocidad. Ah y puede ver qué páginas cargan lentamente en ordenadores o móviles,y por qué.Algunos de estos problemas son complicados, y es mejor preguntar a un desarrollador (o un experto en SEO técnico) para solucionarlos.Estos son algunos consejos para acelerar sus páginas :Usar un CDN. La mayoría de las webs viven en un servidor en una localización. De modo que para ciertos visitantes los datos tienen que viajar largas distancias antes de aparecer en su navegador. Eso es lento. Los CDNs solucionan esto copiando recursos críticos como las imágenes en una red de servidores en todo el mundo. Así estos datos siempre se cargan localmente.Comprimir imágenes. Las imágenes pesan, lo que las hace lentas de cargar. La compresión reduce su tamaño, y permite una carga más rápida. La cuestión simplemente es encontrar el equilibrio entre tamaño y calidad.Usar lazy-loading. Lazy-loading difiere la carga de recursos fuera de la pantalla hasta que se necesiten. Eso significa que no se cargan las imágenes hasta que no se vean.Usar una plantilla bien optimizada. Escoger una plantilla bien optimizada con un código eficiente y y comprobar la con la herramienta de velocidad de Google.3. Apunte a un tema con oportunidad de tráfico de búsqueda’La búsqueda de palabras claves es esencial en posicionamiento. No hay ningún interés en invertir tiempo, esfuerzo, y dinero en posicionarse en cosas que nadie está buscando (a menos de que solamente quiera atraer enlaces).Por ejemplo, suponiendo que venda tutoriales de softwares. No tendría ningún sentido apostar por una palabra clave como : ” cómo hago la tipografía más grande en el editor HTML coffee cup”, porque no tiene ningún volumen de búsqueda…… Y la página mejor posicionada no consigue ningún tráfico.Pero aunque el volumen de búsqueda es un indicador razonable del potencial de tráfico de una palabra clave, puede ser engañoso.Echemos por ejemplo un vistazo a estas dos palabras claves :La primera tiene un mayor volumen de búsquedas mensuales, pero el resultado mejor posicionado solamente recibe unas 65 visitas orgánicas estimadas mensualmente en Estados Unidos……en comparación con las 191 visitas recibidas por la página mejor posicionada para la palabra clave de menor volumen.Eso ocurre por qué la página posicionada para esta segunda palabra clave es parte de una temática más grande, y consigue tráfico de otras palabras clavesEn otras palabras, más personas buscan tutoriales de coffeecup que reviews del mismo.So, while search volume is a good way to filter for keyword ideas, always make sure to check estimated traffic to the pages that rank to get a better idea of true search traffic potential.4. Encajar con la intención de búsquedaNadie quiere ver páginas de producto en los resultados de ” cómo hacer un batido de proteínas”.Está audiencia está en el modo aprendizaje, no en modo compra.Google lo entiende, y por eso todos los mejores resultados son artículos de blogs y no páginas vendiendo batidos de proteína.Todo lo contrario ocurre para consultas como ” comprar batidos de proteína”.Aquí la gente no está buscando recetas. Están buscando por proteínas en polvo. Y por eso la mayoría de los 3 mejores resultados son páginas de categorías de tiendas online, y no artículos de blogs.Observemos una palabra clave menos obvia como mejor “best eye cream,” (mejor crema de ojos). Consigue unas 21.000 búsquedas estimadas en los Estados UnidosUn vendedor de crema, parecerá perfectamente lógico intentar posicionar una página de producto para esta palabra clave. Nonostante, los resultados de búsqueda nos cuentan una historia diferente :Casi todos son artículos de blog de tipo lista. Y no páginas de producto.Para tener una oportunidad de posicionarse en esta palabra clave, deberá seguir la norma.Satisfacer una intención de búsqueda va mucho más allá de crear cierto tipo de contenido. También debe considerar el contenido del formato y su ángulo.Puede leer más acerca de esto en nuestra guía de optimización para intención de búsqueda.5. Aposté por temáticas a su alcanceLas palabras claves competitivas están muchas veces dominadas por empresas grandes con perfiles de enlaces dementes y bolsillos hondos.Solamente eche un vistazo al nombre número de dominios referentes a las paginas posicionadas para ” mejores tarjetas de crédito”.Los resultados están dominados por pesos pesados como NerdWallet, Credit Karma, and CreditCards.com. Y la media de número de dominios referentes (enlaces externos desde una web única), de los 5 primeros es de más de 300.Posicionarse para esta palabra clave en un plazo corto o medio es imposible para el 99% de la gente.Por eso es mejor ir a por palabras claves a nuestro alcance.En este caso, podría ser algo como ” mejores tarjetas de crédito con acceso a lounges” :Aunque los volúmenes de búsqueda, así como el tráfico orgánico potencial, sean mucho menores que para una palabra clave más competitiva como ” mejores tarjetas de crédito”, hay menos empresas grandes con las que competir, y no se necesitan tantos enlaces externos para posicionarse.Y como encontramos esas temáticas ?Puede ir al Ahrefs’ Keywords Explorer, buscar por un tema amplio, y después chequear el informe de “phrase match”. De ahí, filtrar las que tienen una dificultad de palabra clave inferior a 20 es un buen inicio.Si las sugerencias no son tan relevantes, usar el “include filter” para filtrar las cosas. En este caso por ejemplo, podemos filtrar nuestra lista para incluir solamente palabras claves incluyendo la palabra “best”.Podrá entonces comprobar los resultados de búsqueda para evaluar la dificultad y competitividad un poco más.https://www.youtube.com/watch?v=jSOq3ysvBk86. Usar las palabras claves apuntadas en tres lugaresTodos los temas tienen una palabra clave principal, la cuál es la manera más común que tiene la gente de buscar lo que sea que esté en su página.Para un artículo sobre cómo perder peso naturalmente, sería “natural weight loss” :Existen tres lugares donde debería incluir esta palabra clave :a) Etiqueta de títuloGoogle recomienda escribir etiquetas de título que describen precisamente el contenido de la página. Si está apuntando por una palabra o frase en concreto, entonces eso es lo que debe de hacer.También demuestra a los internautas que su página ofrece lo que buscan, alinearse con su consulta.Es este un factor de posicionamiento sumamente importante ? Probablemente no, pero sigue valiendo la pena incluirlo.Por eso lo hacemos con casi todos nuestros artículos del blog :Ojo ! No se trata de colocar la palabra clave si no procede. La legibilidad siempre viene primero.Por ejemplo, si su palabra clave es “kitchen cabinets cheap” (baratos muebles de cocina), entonces no tiene ningún sentido cómo etiqueta de título. No tenga miedo a mejorar la sintaxis cosas para que cobre más sentido. Google es bastante inteligente para entender lo que quiere decir.b) Encabezados (H1)Cada página necesita un título H1 visible en la página, incluyendo de forma natural la palabra clave enfocada.c) URLGoogle recomienda usar palabras en las URLs que sean relevantes en el contenido de la página.Usar la consulta de búsqueda la que está apostando generalmente es la mejor manera de hacerlo :7. Usar una URL corta y descriptivaGoogle recomienda evitar usar URLs largas porque pueden intimidar a los internautas.Por ese motivo, usar la consulta de búsqueda exacta en la URL no es siempre la mejor práctica.Imagine un momento que su palabra clave sea : “how to get rid of a tooth abscess without going to the dentist” (cómo deshacerse de un absceso de dientes sin tener que ir al dentista). No es por que cueste pronunciarlo (sin juegos de palabras), sino que también será truncado en los resultados de búsqueda :Quitando acordes y detalles innecesarios obtendrá algo corto y más cómodo a la vez que conserva las palabras claves importantes.Dicho eso, no tenga miedo en describir su página te formamos detallado cuándo es necesario.Si su cms ya tiene predefinidas estructuras de URL feas, tampoco es un gran problema. No es necesario hacer todo los malabarismos para solucionarlo. Google cada vez enseña menos la URL completa en los resultados de todos modos.8. Escriba un título y una descripción convincentesOptimizar para motores de búsqueda no es solamente mejorar el posicionamiento, sino también generar clics.Por eso necesita escribir etiquetas de título y meta descripciones convincentes, ya que ambas aparecen en los resultados de búsqueda :Nota al margen. Google no siempre muestra los títulos y descripciones definidos en los resultados de búsqueda. A veces los de reescribe, eligiendo algo más apropiado en la misma página. Su etiqueta de título y descripción efectivamente su reclamo de venta.Si ninguno de los dos destaca, el internauta erigirá otro resultado. Pero más allá de incluir su palabra clave, cómo puede mejorar su CTR ?Primero, intenté mantener su etiqueta de título por debajo de los 60 caracteres, y su descripción por debajo de 150. Eso le ayudará a evitar truncamiento.Segundo, use palabras que empiecen con capitales para los títulos, y frases para las descripciones.Tercero, aliñar el título y la descripción con la intención de búsqueda.Por ejemplo, prácticamente todos los resultados para “best headphones” (mejores auriculares), especifican el año en su título y descripción.Esto es porque la gente quiere lista de recomendaciones actualizadas, ya que se sacan auriculares nuevos constantemente.Cuarto, use palabras fuertes para generar clicks - sin ser demasiado clickbait.Puede leer más sobre cómo confeccionar el título perfecto aquí, o viendo este vídeohttps://www.youtube.com/watch?v=jqEoZsIOrYw9. Optimizar imágenesComprimir imágenes es vital para asegurarse de que carguen rápidamente. Lo que pasa es que no hay solamente una manera de optimizar las imágenes para el SEO.También debería agregar etiquetas alt, usar nombres de archivos descriptivos.Ambas cosas ayudan Google a entender su imagen. Eso le puede ayudar a que sus páginas se posicionan para palabras claves de cola larga los resultados de búsqueda y en Google Images.El texto al es extremadamente útil para Google Imáges -- si quieres que sus imágenes se vean ahí. Incluso usando Lazy-loading, sabes qué imagen se va a cargar. Así que vale la pena incluir esta información tan pronto como es posible, chequear cómo se ve. .— 🍌 John 🍌 (@JohnMu) September 4, 2018No pase por alto la importancia de Google Images. A nosotros nos mandó acerca de 5500 clicks en los pasados 3 meses.Optimizar nombres de archivos es sencillo. Solamente describa sus imágenes con palabras separándolas con guiones.Veamos un ejemploFilename: el-chico-más-guapo.jpgPara las etiquetas de atributos, haga lo mismo, pero usando espacio en lugar de guiones.<img src=\".../number-one-handsome-man.jpg\" alt=\"the world's most handsome man\">El Alt Text no solamente es importante para Google, también lo es para los internautas.En caso de que una imagen no cargue, el navegador muestra ese texto para explicar lo que iba donde la imagen :Además, cerca de 8,1 millones de americanos tienen problemas de vista y pueden estar usando un lector de pantalla. Estos dispositivos leen las etiquetas alt en voz alta.Lectura recomendada : SEO para imágenes : 12 consejos prácticos (para más tráfico orgánico).10. Escriba contenido exhaustivoPreviamente, ya mencionamos que el volumen de búsqueda no siempre es un buen predictor del tráfico orgánico potencial porque muchas páginas también reciben tráfico de consultas de cola larga.Por ejemplo, esta página es primera para “best laptop brands” (mejores marcas de portátiles)…… Pero también está en el top 10 de más de 300 palabras claves como “best computer brands” (mejores marcas de ordenadores) y “Lenovo is a good brand” (lenovo es una buena marca) :No es ninguna anomalía.Nuestro estudio de tres millones de consultas de búsqueda que la media de las páginas mejor posicionadas, están en las 10 primeras posiciones para casi 1000 otras palabras.Y como nos posicionamos para más consultas ? Haciendo el contenido más exhaustivo.Ojo. Aquí no se trata de lo largo que es el artículo. Sino descubrir temas relevantes que la gente también puede estar buscando. Principalmente ocurre con contenido de SEO informacional como los artículos de blog. Pero también ayuda con otros tipos de contenidos.He aquí tres maneras de encontrar subtemas :a) buscar por palabras claves relevantes en las páginas mejores posicionadas.Si miramos una de las páginas mejores posicionadas para “best laptop brands”, veremos palabras claves relevantes como “Dell”, “HP”, “quality”, “reliability”, y “hardware”.b) Mire a los resultados de “otras preguntas de los usuarios”Para “Best laptop brands”, vemos un par de preguntas relacionadas con legibilidad.c) Ejecutar un análisis de Content GapPegue la URL de 3 páginas bien posicionadas en la herramienta Content Gap Tool de Arhrefs. Dejé el campo de abajo en blanco y haga clic en “mostrar palabra clave”Eso le muestra consultas para las que más de una de las mejores páginas está posicionada.Apaga las intersecciones uno y dos para refinar aún más los resultados.11. Agregué una sección de enlaces internosLos enlaces internos son los que enlazan los de su propia página.Por norma general, en cuanto mayor es la cantidad de enlaces tanto internos como externos, mejores el PageRank. Es el fundamento del algoritmo de posicionamiento de Google y sigue siendo importante incluso hoy en día.Sabías que después de 18 años, seguimos usando PageRank (y otras 100 señales) ?¿ desea saber cómo funciona ?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理／경리” Illyes (@methode) February 9, 2017Desgraciadamente, Google interrumpió la puntuación pública de PageRank en 2016. Así que no se pueden comprobar hoy en día. Pero el URL Rating de Ahrefs es una métrica muy similar, y se correlaciona con el ranking.Los enlaces internos también ayudan Google a entender de qué trata la página.La mayoría de los enlaces proveen más contexto mediante su ancla. O por lo menos deberían, ¿ vale ?— 🍌 John 🍌 (@JohnMu) November 23, 2017Afortunadamente, la mayoría de los gestores de contenidos agregan enlaces a las páginas nuevas desde por lo menos una otra página por defecto. Bien puede ser en el menú de navegación, en la página del blog, en cualquier otro sitio.Además, es muy recomendable agregar enlaces internos desde otras páginas relevantes siempre que vaya publicando algo nuevo.Para llegar a eso, ejecute una consulta de búsqueda en Google con site:yourdomain.com [ temática de la página]Eso le brindará los resultados más relevantes de su web para este tema :Busque lugares coherentes para agregar enlaces internos que encajen.También puede encontrar oportunidades de enlaces internos en el Site Explorer de Ahrefs. Pegué un nombre de dominio, y vaya a la sección de “mejores por enlace”.Busque páginas relevantes y agregué enlaces donde sea apropiado.Lectura recomendada : Enlaces internos para eso : Guía práctica.12. Consiga más enlaces externosLos enlaces externos fueron al fundamento del algoritmo de Google y siguen siendo uno de sus criterios de posicionamiento más importantes.Google lo confirma en su página “Cómo funciona la Búsqueda de Google”, dónde declaran :Si otras webs destacadas en esta temática enlazan a esta página, es una señal muy buena de que la información presente es de calidad..Pero ojo con lo que dice Google…Nuestro estudio de más de mil millones de webs muestra una clara correlación entre el tráfico orgánico y el número de sitios enlazando a una página :Simplemente recuerde que esto se trata de calidad, no solamente de cantidad.Debería apostar por conseguir enlaces externos de páginas y webs con autoridad y relevancia.Puede leer más sobre los buenos enlaces externos aquí, ver este vídeo :https://www.youtube.com/watch?v=E3mDlVutW_oEn conclusiónLas buenas prácticas son un buen inicio. Pero no siempre vas tan para posicionarse bien. Hay muchos más criterios de posicionamiento que guardara en mente, así como maneras de mejorar el SEO.Puede leer este artículo si todavía le cuesta posicionarse mejor, o ver este vídeo:https://www.youtube.com/watch?v=Rm1MbJneLSI Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "12 buenas prácticas de posicionamiento que todo el mundo debería seguir"
    },
    {
      "level": "H2",
      "text": "1. Usar HTTPs"
    },
    {
      "level": "H2",
      "text": "2. Asegúrese de que sus páginas carguen rápidamente."
    },
    {
      "level": "H2",
      "text": "3. Apunte a un tema con oportunidad de tráfico de búsqueda’"
    },
    {
      "level": "H2",
      "text": "4. Encajar con la intención de búsqueda"
    },
    {
      "level": "H2",
      "text": "5. Aposté por temáticas a su alcance"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "6. Usar las palabras claves apuntadas en tres lugares"
    },
    {
      "level": "H3",
      "text": "a) Etiqueta de título"
    },
    {
      "level": "H3",
      "text": "b) Encabezados (H1)"
    },
    {
      "level": "H3",
      "text": "c) URL"
    },
    {
      "level": "H2",
      "text": "7. Usar una URL corta y descriptiva"
    },
    {
      "level": "H2",
      "text": "8. Escriba un título y una descripción convincentes"
    },
    {
      "level": "H2",
      "text": "9. Optimizar imágenes"
    },
    {
      "level": "H2",
      "text": "10. Escriba contenido exhaustivo"
    },
    {
      "level": "H3",
      "text": "b) Mire a los resultados de “otras preguntas de los usuarios”"
    },
    {
      "level": "H3",
      "text": "c) Ejecutar un análisis de Content Gap"
    },
    {
      "level": "H2",
      "text": "11. Agregué una sección de enlaces internos"
    },
    {
      "level": "H2",
      "text": "12. Consiga más enlaces externos"
    },
    {
      "level": "H2",
      "text": "En conclusión"
    }
  ],
  "author": "Joshua Hardwick"
}