{
  "url": "https://ahrefs.com/blog/es/mejores-podcasts-marketing/",
  "slug": "mejores-podcasts-marketing",
  "title": "Los 6 mejores Podcasts de Marketing (Los más votados)",
  "description": "Aquí tienes 6 podcasts de marketing cuidadosamente seleccionados y llenos de valor para que te conviertas en un gran marketer. Nunca dejes de aprender de los mejores.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Hay miles de podcasts relacionados con el marketing, pero ¿cuáles valen la pena escuchar?Para averiguarlo, pedimos a los 13.400 miembros de Ahrefs Insider, nuestro grupo de Facebook sólo para clientes, que votaran sus favoritos.Tim Soulo creó una encuesta¿Qué PODCASTS le recomendarías a alguien que quiera aprender “Marketing Digital” (y no sólo SEO)También recibimos sugerencias de otros grupos de Facebook relacionados con el marketing, Twitter y LinkedIn.En total, recibimos cerca de 90 sugerencias y cientos de votos, la mayoría de ellos en sólo seis podcasts.Authority HackerEveryone Hates MarketersMarketing SchoolPerpetual TrafficNiche PursuitsAkimbo1. Podcast Authority Hacker¡Bienvenido al Podcast Authority Hacker!El programa de entrevistas más práctico de IM en Youtube y PodcastTemas: SEO, link building, marketing de afiliadosAnfitrión(es): Gael Breton, Mark WebsterLo escuchas en:Página webNúmero de votos: 108Con 108 votos, el podcast Authority Hacker es, por lejos, el más popular de nuestra lista. Le gana al segundo podcast por más de 80 votos.En parte, esto es casi seguro porque realizamos la encuesta en un grupo lleno de profesionales de SEO. Pero también es porque los anfitriones -Gael y Mark- no se detienen cuando se trata de compartir consejos sobre link building, marketing de afiliados y SEO.Estos tampoco son consejos rebuscados de libros y entradas de blog. Son cosas que han probado de forma directa en sus sitios. El podcast es esencialmente una mirada entre las escenas de sus éxitos y fracasos.Como dice nuestro Director de Marketing, Tim Soulo:Demasiados “expertos” en marketing dan consejos sin intentarlo ellos mismos. Por eso me encanta Gael & Mark de Authority Hacker. Nunca hablan de las cosas que PIENSAN que funcionarán. Sólo hablan de cosas que han probado, así que SABEN que funciona.Tim Soulo, CMO2. Everyone Hates MarketersEl único podcast para gente cansada de las porquerías del marketing Cada semana, Louis Grenier (a quien le gusta hablar en tercera persona) entrevista a los invitados que comparten sus ideas de marketing y pueden ser implementadas hoy en día, sin ser de mala calidad.Escucha los episodios en Apple podcasts, Spotify, aquí mismo en este sitio, o donde sea que escuches tus podcasts en estos días. Si no estás seguro de que vale la pena, lee las reseñas de cinco estrellas.Temas: Marketing, branding, marketing de productos, psicología del marketing, marketing de contenidos, CROAnfitrión(es): Louis GrenierLo escuchas en:Página webNúmero de votos: 25Gary Vaynerchuk dijo una vez, “los marketers lo arruinan todo”. Es cierto. Hemos arruinado la televisión, el correo electrónico, los medios sociales y el contenido. Enviamos spam a casi todo. Y por eso la gente odia a los marketers.¿Pero es el marketing realmente tan malo?No lo es. Puedes hacer marketing de una manera no invasiva, no obscena. Puedes tratar a la gente como quieres ser tratado y aún así generar grandes resultados de marketing. Esto es exactamente lo que Louis cree, y lo que el podcast Everyone Hates Marketers (EHM) representa.Cada semana, Louis entrevista a un nuevo invitado y trata de extraer las ideas más útiles para sus oyentes. Se centra principalmente en temas evergreen como la investigación de los clientes, la estrategia de marketing, el posicionamiento de la marca, etc.También recientemente dejó su trabajo en HotJar para poder concentrarse en el podcast a tiempo completo. Creo que podemos esperar grandes cosas en un futuro próximo.¿Interesado en aprender más? Echa un vistazo a este episodio con nuestro CMO, Tim:3. Marketing SchoolTemas: De todoAnfitrión(es): Neil Patel, Eric SiuLo escuchas en:WebsiteNúmero de votos: 25Todo el mundo ha oído hablar de Neil Patel. Su podcast es una colaboración con Eric Siu, CEO de Single Grain. Como el blog de Neil y el canal de YouTube, este podcast cubre todos los temas imaginables relacionados con el marketing. Nada queda sin tocar.Y como gran parte de la estrategia de contenido de Neil, es implacable. En sólo cinco años, el dúo ha publicado más de 1.500 episodios. Hay un nuevo episodio casi todos los días.La mayoría de los episodios sólo duran unos minutos, así que también son fáciles de escuchar.4. Perpetual TrafficTemas: Marketing pago, redes sociales, marketing de contenidos, SEOAnfitrión(es): Ralph Burns, Amanda PowellLo escuchas en:WebsiteNúmero de votos: 10Cualquiera que esté involucrado en el marketing digital probablemente se haya encontrado con DigitalMarketer.com en algún momento. Yo también empecé en el marketing digital leyendo mucho de su contenido.Perpetual Traffic (Tráfico perpetuo), como su nombre lo indica, se enfoca en cómo puedes dirigir más tráfico a tu negocio. Cubren todo tipo de temas relacionados con el marketing digital, incluyendo anuncios de Facebook, marketing de redes sociales, SEO, cómo vender productos de alto valor, y más.Si quieres una rápida introducción a su podcast, echa un vistazo a este episodio con mi colega, Michal Pecanek, donde habla de nuestro trabajo en la creación de una página de Wikipedia. 5. Niche PursuitsCómo Nathan Barry convirtió Convertkit en 2,1 millones de dólares al mes y compró una ciudad fantasma.En este episodio del podcasts de Niche Pursuits, descubrimos los temas clave que hicieron de Convertkit un éxito. Convertkit es una plataforma de marketing de correo electrónico iniciada por Nathan Barry, un diseñador y…Por Spencer HawsTemas: Marketing de afiliados, SEOAnfitrión(es): Spencer HawsLo escuchas en: Página WebNúmero de votos: 6Conducido por Spencer Haws, Niche Pursuits es un podcast enfocado en hacer dinero con nichos de sitios web de afiliados.Es similar al podcast de Authority Hacker con una diferencia distintiva: es un podcast de entrevistas. En cada episodio, Spencer entrevista al dueño de un sitio web de nicho sobre sus éxitos, fracasos y tácticas.Si te interesa conocer los éxitos de otros y quieres inspirarte en los tipos de sitios especializados que puedes crear, este podcast es para ti.6. AkimboTemas: Creatividad, culturaAnfitrión(es): Seth GodinLo escuchas en:Página WebNúmero de votos: 6Es una elección interesante porque no es un típico podcast de marketing. Sí, Seth Godin es un famoso autor y vendedor que ha escrito toneladas de libros populares de marketing como “This is Marketing”, “Purple Cow” y “Permission Marketing”.Pero a diferencia del resto de la lista, el podcast de Seth no comparte ninguna táctica, estrategia o consejo. No hay “7 métodos de linkbuilding” o “Cómo mejorar tu CTR de anuncios de Facebook”. Se trata más bien de inspirar a los oyentes.En cada episodio, Seth cuenta una historia interesante -por ejemplo, ésta sobre la teoría de las filas- que desafía sus creencias y lo anima a pensar de manera diferente. Seth luego responde algunas preguntas de los lectores enviadas a través del sitio web de Akimbo.El podcast de Akimbo es perfecto para aprender a ser diferente y a pensar diferente, una importante habilidad de marketing.Cinco podcasts más para marketersSi los cientos de episodios de los podcasts anteriores no son suficientes para satisfacer tu inmenso deseo de aprender, aquí tienes cinco podcasts más que recibieron al menos cuatro votos.My Wife Quit Her Job. Conducido por Steve Chou, un empresario en serie, este podcast se centra en descubrir las estrategias utilizadas por los propietarios de negocios exitosos. Echa un vistazo a este episodio, donde Steve entrevista a Sam Oh, nuestro chico de YouTube en YouTube SEO.Doug Show. Doug Cunnington es un director de proyectos convertido en marketer de afiliados, y su podcast comparte historias de éxito, tácticas y consejos para construir sitios de nicho exitosos.Tropical MBA. Un podcast de larga trayectoria (>10 años) que se centra en cómo construir un negocio independientemente de la ubicación. Echa un vistazo a este episodio con nuestro CMO, Tim Soulo.My First Million. Producido por The Hustle, el boletín diario de negocios y tecnología, este podcast muestra las discusiones entre los anfitriones, Shaan Puri y Sam Parr, y los empresarios exitosos.Growth Marketing Today.El presentador Ramli John habla con exitosos comerciantes y empresarios para descubrir los métodos y procesos de marketing exitosos paso a paso. Echa un vistazo a este episodio con Sam Oh. ConclusionesAquí hay una estrategia alternativa de podcast: encontrar personas respetadas en tu industria y luego descargar los podcasts en los que aparecen. De esa manera, en lugar de buscar en los episodios para encontrar joyas, puedes aprender de alguien en quien confíes.¿La mejor parte? Si el invitado está promocionando un libro, probablemente aprendas la mayoría de los puntos cubiertos en su libro a través de sus podcasts. En mi opinión, eso es un gran ahorro de tiempo. I had to stop reading business books. It’s aggravating to read only 20 pages of insight spread across 400 pages of blatant filler. The workaround? Listen to the author’s podcast appearances. They accurately summarize the key parts for you. Then Patreon them to give back :)— Julian Shapiro (@Julian) December 10, 2020¿Me he perdido algún buen podcast de marketing? Házmelo saber en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Los 6 mejores Podcasts de Marketing (Los más votados)"
    },
    {
      "level": "H2",
      "text": "1. Podcast Authority Hacker"
    },
    {
      "level": "H2",
      "text": "2. Everyone Hates Marketers"
    },
    {
      "level": "H2",
      "text": "3. Marketing School"
    },
    {
      "level": "H2",
      "text": "4. Perpetual Traffic"
    },
    {
      "level": "H2",
      "text": "5. Niche Pursuits"
    },
    {
      "level": "H2",
      "text": "6. Akimbo"
    },
    {
      "level": "H2",
      "text": "Cinco podcasts más para marketers"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Si Quan Ong"
}