{
  "url": "https://ahrefs.com/blog/es/mejores-newsletter-marketing/",
  "slug": "mejores-newsletter-marketing",
  "title": "Las 7 Mejores Newsletter de Marketing (las Más Votadas)",
  "description": "Hemos pedido a unos 20.000 marketeros que voten por sus newsletters favoritas de marketing. Estas son las que han recibido más votos.",
  "content": "Erik Sarissky Head de Marketing Internacional en Ahrefs. Haciendo visible la herramienta en múltiples mercados. Contenido Las newsletters están de moda de nuevo.Los medios lo han apodado la “revolución Substack”. Periodistas, inversores de capital riesgo (VCs), marketeros—parece que todo el mundo está empezando una newsletter hoy en día.Pero con más newsletters vienen más elecciones, lo que hace más complicado que nunca eliminar el ruido y detectar newsletters dignas de tu bandeja de entrada.Para ayudar, hemos pedido a los 13.900 miembros de Ahrefs Insider, nuestro grupo de Facebook solo para clientes, que voten por su newsletters de marketing preferidas. También hemos sondeado nuestras audiencias en LinkedIn y Twitter, además de otros grupos de marketing en Facebook.Aquí están los resultados: Harry’s Marketing Examples (los ejemplos de Marketing de Harry) SEO Notebook (Cuaderno SEO) #SEOFOMO (SEO Fear of Missing Out, miedo a perderse algo en SEO) The Weekly SEO (El semanal del SEO) Search News You Can Use (Noticias de Búsqueda que Puedes Usar) tl;dr Marketing (“too long, did not read” o ““demasiado largo; no lo he leído”) Growth Memo (Notas de crecimiento)1. Marketing ExamplesTemas: Marketing, copywritingPropietario: Harry DrySuscríbete en: WebsiteFrecuencia: QuincenalEn poco más de un año, Harry Dry se hizo con ~50.000 suscriptores para su newsletter de marketing.No había trucos. Todo lo que hizo fue ofrecer valor una y otra vez. Destaca todo tipo de casos de estudio de marketing de los que puedes aprender. Grandes marcas, líderes políticos, managers de fútbol, músicos—si pueden enseñar algo sobre Marketing, copywriting o comunicación, los incluye.Desde posicionamiento a copywriting, rellena cada email con consejos que puedes aplicar en el momento. Y no se trata de un mail plano y anticuado. Sus emails son bonitos.Harry ha encontrado el equilibrio perfecto entre textos concisos, un diseño atractivo y contenido valioso.2. SEO NotebookTopics: SEO, marketing de afiliadosPropietario: Steve TothSuscríbete en: WebsiteFrecuencia: Semanal¿Cansado de leer refritos de consejos SEO? Esta newsletter es para ti.Todas las semanas, Steve manda un email con una nota de su colección de Evernote. Está llena de ideas SEO únicas que probablemente no has visto en ninguna parte. Son ideas duramente ganadas con su trabajo en las trincheras SEO o susurradas por SEOs undergroundque prefieren que no se sepan sus nombres.Encuentra Nichos con Beneficios en 3 MinutosLa nota de hoy proviene de una fuente secreta. Este consejo fue publicado en Facebook, pero el informante ha pedido mantenerse en el anonimato. Así que nos referiremos a él simplemente como “J”.3. #SEOFOMOTemas: Noticias de motores de búsqueda, SEO, marketing digital, trabajos en marketingPropietaria: Aleyda SolisSuscríbete en: WebsiteFrecuencia: SemanalLa newsletter de Aleyda es uno de los emails más extensos que recibo en mi bandeja de entrada, de verdad que hace justicia a su nombre. Si alguna vez has sentido miedo por perderte noticias o contenido importante, ella te cubre las espaldas.Toma un café (o quizá dos), haz scroll y sabrás todo lo que hay que saber sobre SEO y marketing en esa semana. Incluso recibirás una lista de trabajos a los que puedes aplicar y una lista de marketeros que deberías seguir en Twitter.4. The Weekly SEOTemas: SEOPropietario: Andrew Charlton Suscríbete en: WebsiteFrecuencia: SemanalWeekly SEO es una newsletter clásica curada. Es corta y contiene enlaces a artículos (y productos) que Andrew encuentra interesantes.Post de la semanaDesata tu navegación por facetas: Cómo Incrementé el tráfico orgánico de una empresa por 230% en 2 meses.Siempre que su email aterriza en mi bandeja de entrada, le doy un vistazo rápido y hago clic en cualquier cosa que llame mi atención.5. Search News You Can UseTemas: SEOPropietaria: Marie HaynesSuscríbete en: WebsiteFrecuencia: SemanalLa newsletter de Marie es una de las favoritas de muchos SEOs. Empezó como una forma que tenía Marie de informar a sus suscriptores sobre lo que está pasando en el mundo de la búsqueda, además de algunos consejos SEO. Ahora ha evolucionado en una newsletter con más categorías, como trabajos, consejos y lecturas recomendadas.Tiene dos niveles, una versión gratuita ligera y una versión de pago que incluye las reflexiones de Marie y otros expertos sobre lo que pasa en el mundo del SEO.6. tl;dr MarketingTemas: Noticias de marketing digitalPropietario: Saijo GeorgeSuscríbete en: WebsiteFrecuencia: DiariaCada día, Saijo selecciona y envía a sus suscriptores las noticias importantes en marketing digital del día anterior. Es una gran forma de ver qué está pasando en el mundo sin tener que pasar de un sitio de noticias a otro.Saijo también etiqueta cada noticia en su página web, donde puedes filtrar con facilidad aquello que te interese.7. Growth MemoTemas: SEO, growth marketingPropietario: Kevin IndigSuscríbete en: WebsiteFrecuencia: SemanalAnteriormente conocida como Tech Bound, Growth Memo es una newsletter semanal escrita por Kevin Indig, el director de SEO de Shopify. Empezó como una newsletter clásica de curaci en sus primeras iteraciones. Más tarde, Kevin añadió su propio análisis sobre distintas tendencias en tecnología y marketing.Rápidamente se dio cuenta de que el análisis era la parte más valiosa de su newsletter y el resto, como se suele decir, es historia.Cuando te suscribas a Growth Memo recibirás un email con un análisis en profundidad de un aspecto de growth marketing. Kevin después te ofrece algunos enlaces para que explores más, en caso de que estés interesado en lo que ha compartido.Cinco newsletters más para marketerosSalvo que disfrutes de ver tu bandeja de entrada llena de newsletters de marketing, las sugerencias de arriba son probablemente suficientes para mantenerte al día. Pero las personas que participaron en nuestra encuesta votaron algunas más, así que aquí están las cuatro que recibieron unos pocos votos. Marketing Brew. Marketing Brew es la versión de noticias de marketing de Morning Brew, la conocida newsletter de noticias empresariales. #SEOForLunch. Otra newsletter clásica de curación. Como su nombre sugiere, #SEOForLunch (SEO para el almuerzo) está diseñada para que los SEOs echen un vistazo a artículos interesantes durante su descanso para comer. OkDork. Esta es la newsletter personal del famoso emprendedor Noah Kagan. Cada semana recibirás enlaces a contenido producido por él, además de unas pocas recomendaciones de productos, libros, etc. Growth Tactics de Demand Curve. Como newsletter quincenal, Growth Tactics comparte consejos avanzados de marketing de fundadores y marketeros de éxito de YCombinator. Zero to Marketing. Cada dos semanas, Andrea elige una web y comparte sus ideas sobre cómo la mejoraría y la haría crecer.Reflexiones finalesPuede que te hayas dado cuenta de que hay muchas newsletters relacionadas con el SEO en nuestra lista. Es probable que sea por la audiencia a la que hemos encuestado.De todas formas, no tienes que suscribirte a todas estas newsletters. Al final, la ejecución es lo que cuenta. Lee demasiadas newsletters y acabarás con parálisis por análisis. Es mejor suscribirse a las pocas que encuentres interesantes para mantenerte al día en lo que está pasando y conseguir nuevas ideas de marketing para probar.Finalmente, también tenemos una newsletter. Cada semana, enviamos enlaces a nuestros posts en el blog y vídeos, y artículos que encontramos interesantes. Puedes suscribirte a la derecha (desktop) o debajo (móvil).¿Me he olvidado de alguna newsletter interesante de marketing? Dímela por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el primer directorio de herramientas de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Erik Sarissky Head de Marketing Internacional en Ahrefs. Haciendo visible la herramienta en múltiples mercados.",
  "headers": [
    {
      "level": "H1",
      "text": "Las 7 Mejores Newsletter de Marketing (las Más Votadas)"
    },
    {
      "level": "H2",
      "text": "1. Marketing Examples"
    },
    {
      "level": "H2",
      "text": "2. SEO Notebook"
    },
    {
      "level": "H2",
      "text": "3. #SEOFOMO"
    },
    {
      "level": "H2",
      "text": "4. The Weekly SEO"
    },
    {
      "level": "H2",
      "text": "5. Search News You Can Use"
    },
    {
      "level": "H2",
      "text": "6. tl;dr Marketing"
    },
    {
      "level": "H2",
      "text": "7. Growth Memo"
    },
    {
      "level": "H2",
      "text": "Cinco newsletters más para marketeros"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Erik Sarissky"
}