{
  "url": "https://ahrefs.com/blog/es/meta-descripcion/",
  "slug": "meta-descripcion",
  "title": "Meta descripción: qué es y cómo escribirla",
  "description": "La meta descripción es un atributo HTML que describe el tema de una página. Puede aparecer en los resultados de búsqueda como un fragmento bajo el título.",
  "content": "Erik Sarissky Head de Marketing Internacional en Ahrefs. Haciendo visible la herramienta en múltiples mercados. Contenido La meta descripción es un atributo HTML usado para describir de qué trata una página. Puede aparecer en los resultados de búsqueda como un fragmento o snippet bajo la etiqueta de título para ofrecer más contexto.Aquí puedes ver el aspecto del código del fragmento:<meta name= \"description\" content= \"Realiza nuestro curso de marketing de afiliados gratuito y descubre cómo empezar y hacer crecer tu propio sitio de afiliados que genera ingresos.\">Incluso aunque el atributo de meta descripción no es un factor de posicionamiento y Google lo muestre en los resultados de búsqueda solo el 37% de las veces, es parte del SEO on-page al que los creadores de contenidos se enfrentan.Por qué las meta descripciones todavía importanTener una meta descripción convincente incita a más gente a hacer click en tu web en los resultados de búsqueda. Es importante, incluso aunque Google solo muestre meta descripciones el 37% de las veces.Por ejemplo, si tu página recibe 50.000 impresiones al mes, Google muestra de media la meta descripción en 18.500 impresiones. Incrementar tu CTR del 4% al 4,5% en este caso supondría casi 100 clicks más.Así que aunque no deberías obsesionarte con las meta descripciones, merece la pena dedicar un minuto de tu tiempo en páginas donde respondas “sí” a al menos una de estas preguntas:¿Se supone que la página debe recibir tráfico orgánico?¿Es probable que se comparta en redes sociales?Esta segunda pregunta probablemente necesite una explicación.Mira, cuando una página se comparte en redes sociales, coge la descripción de las etiquetas meta de Open Graph.Pero si no has establecido una descripción en OG o Twitter, recoge la meta descripción. Así que si solo estás dispuesto a hacer un esfuerzo para establecer una de estas etiquetas, debería ser la meta descripción.Cómo escribir una meta descripción1. Desarrolla tu etiqueta de títuloPiensa siempre en la descripción como en algo que complementa la etiqueta de título. Los títulos deberían resumir una página usando unas pocas palabras clave que describan el tema. La descripción meta ofrece una oportunidad de expandir esto más allá.En el caso de arriba, la descripción corta motiva al usuario a hacer click en nuestro comprobador de enlaces rotos porque:Comprueba páginas y webs.Tiene en cuenta enlaces internos y externos.La herramienta es rápida.No es una trampa para generar leads; puedes usarlo en el momento en la misma página.No te preocupes por encajar con calzador palabras clave. Es más importante que escribas algo que conecte con el lector e incite al click. Usa tus propuestas únicas de venta (USPs, Unique Selling Proposition) donde encajen.2. Cumple con la intención de búsquedaLa intención búsqueda es el “por qué” detrás de una consulta. En otras palabras, ¿qué es lo que la mayor parte de la gente quiere cuando busca tu palabra clave principal?¿Quieren información?¿Quieren comprar algo?¿Buscan una web concreta?¿Quieren una respuesta rápida a una pregunta?Puedes usar los resultados de búsqueda como una aproximación a esto. Google se esfuerza por proveer los resultados más relevantes para las personas que buscan, así que busca lugares comunes entre los fragmentos de los primeros resultados. Por ejemplo, casi todos los resultados de “meta descripción” muestran una definición en el fragmento:… Así que también lo haremos.Otras SERPs (search engine results page, o páginas de resultados) pueden no ser tan directas, pero siempre podrás sacar alguna pista. Vamos a ver “how to tie a tie” (cómo hacer el nudo de la corbata):Todos los fragmentos hablan sobre distintos tipos de nudo y la mayoría mencionan cómo el artículo incluye instrucciones paso a paso. Eso nos dice que estas cosas son probablemente importantes y merece la pena que las incluyamos en la meta descripción.Simplemente ten cuidado con páginas de resultados con intenciones mixtas como “standing desk” (escritorios de pie).Puedes ver que aquí tenemos una mezcla de resultados. Algunos son posts haciendo reviews de los mejores escritorios de pie y otros son páginas de categoría de producto de tiendas online.En casos como este, deberías inspirarte en los fragmentos de página que se parezcan más al tipo de contenido que sueles publicar. Si has escrito posts sobre escritorios de pie, fíjate en los posts de análisis y comparativas. Si has creado una página de categoría de ecommerce, fíjate en esos resultados.3. Usa la inteligencia artificialLa inteligencia artificial (IA) puede ser una herramienta poderosa para generar meta descripciones efectivas para tus páginas web. A continuación, te explico cómo puedes utilizar la IA para esta tarea y cómo darle las instrucciones adecuadas.Primero, elige una herramienta de IA que sea capaz de generar texto. Por ejemplo Ahrefs tiene un generador gratuito meta descripciones.Luego para obtener una meta descripción relevante y precisa, es importante proporcionar a la IA un contexto claro sobre el contenido de la página. Aquí hay algunos elementos que debes incluir en tus instrucciones:1. Título de la página: Incluye el título principal de la página. 2. Resumen del contenido: Proporciona un breve resumen de lo que trata la página. 3. Palabras clave: Especifica las palabras clave principales para las que deseas que la página se posicione. 4. Límite de caracteres: Indica que la meta descripción debe tener entre 150 y 160 caracteres para cumplir con las mejores prácticas de SEO.Aquí tienes un ejemplo de cómo podrías estructurar tus instrucciones para una herramienta de IA: 4. Sé breveLas meta descripciones no son lugar para la narrativa. Cada palabra importa porque los usuarios rápidamente deciden en qué hacer click echando un vistazo a los resultados y porque las descripciones se cortan pasada cierta longitud.Ahora mismo, esa longitud son 920 píxeles (unos 160 caracteres) en escritorio y 680 píxeles (unos 120 caracteres) en móvil. Lo mejor que puedes hacer para mantenerte en esos límites es usar una herramienta como esta o un plugin de SEO de WordPress como Yoast con la funcionalidad incluida.Si es mejor que optimices para móvil o escritorio depende de tu audiencia. Si generalmente usas descripciones más largas para usuarios de escritorio, asegúrate de ir a lo importante en los ¾ de la descripción, para que incluso los usuarios de móvil puedan verlo.¿Cuál es la moraleja? Sé breve para los usuarios, no para los motores de búsqueda. El límite de longitud puede ser una señal de que usas palabras innecesarias.5. Asegúrate de que cada página de tu sitio tenga una descripciónDebido a que la meta descripción ayuda a proporcionar contexto sobre tu página web a los motores de búsqueda y a los usuarios, es una buena práctica tener una para cada página. Puedes usar Ahrefs Site Audit (o las herramientas gratuitas para webmasters de Ahrefs) para verificar y monitorear que cada una de tus páginas tenga una meta descripción.Cómo implementar las meta descripcionesSi usas un CMS, es muy fácil. En Wix, Squarespace, Shopify y la mayoría encontrarás un lugar para escribir o pegar tu meta descripción en la edición.En WordPress, plugins como Yoast y RankMath añaden esta misma funcionalidad.Si no usas un CMS, simplemente pega la etiqueta de la meta descripción en <head> la cabecera de tu código HTML.RecomendaciónSi añades la meta descripción directamente en el código, no uses las comillas en la propia descripción porque romperá algo. En su lugar, usa la entidad HTML &quot; para que parezca algo así:<meta name=\"description\" content=\"Solo para enseñar cómo usar &quot;comillas&quot; en la meta descripción.\">Si usas comillas al añadir una meta descripción en un CMS o plugins, normalmente se encargarán de codificar el HTML por ti.Ejemplos de meta descripciones genialesVamos a resumir las cosas con unos pocos ejemplos de buenas meta descripciones de distintos sectores y con distintas intenciones de búsqueda.1. HealthlineTraducción: Glycine es un aminoácido que tu cuerpo usa para crear proteínas, que son vitales para la salud. Aquí tienes beneficios y usos de glycine.La mayor parte de las personas que buscan esto quieren una definición, así que esto es lo que la meta descripción les muestra. Después le propone al lector aprender más sobre los beneficios de glycine haciendo click. Fácil y eficiente.2. TimeOutTraducción: ¿No sabes dónde quedarte en Praga? Tenemos lo que necesitas. Echa un vistazo a nuestra guía de los cinco mejores barrios de la capital checa.Pensé que vería resultados mixtos de barrios y hoteles, pero los resultados de búsqueda se centran sobre todo en áreas de Praga. Y la descripción encaja con esa intención perfectamente. Ofrece una solución de forma concisa, ligera y práctica. Mencionar los “cinco mejores barrios” también le dice al usuario que no tendrá que pasar una eternidad leyéndolo.3. PatagoniaTraducción: Hoy aquí, mañana ha volado. Encuentra ofertas en ropa y complementos de la temporada pasada en nuestros especiales web Patagonia.com. 1% para el Planeta.Aquí, la persona que busca quiere ofertas. Me gusta la urgencia que señalan al principio; parece más original y menos agresivo de lo que estas páginas suelen ser. Después ves una afirmación de aquello por lo que viniste, acabando con un activo diferenciado de Patagonia: apoyar la sostenibilidad y la conservación.Reflexiones finalesLas meta descripciones son una de los principales temas a los que la mayoría se enfrenta al empezar en el SEO. Afortunadamente, es uno de los más fáciles de entender y dominar, así que nunca tendrás que dedicarle mucho tiempo.Para más cosas que puedan inclinar la balanza en SEO, comprueba nuestra lista de consejos prácticos SEO.¿Alguna pregunta? Siéntete libre de escribirme en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Erik Sarissky Colaboradores Head de Marketing Internacional en Ahrefs. Haciendo visible la herramienta en múltiples mercados. Colaboradores",
  "headers": [
    {
      "level": "H1",
      "text": "Meta descripción: qué es y cómo escribirla"
    },
    {
      "level": "H2",
      "text": "Por qué las meta descripciones todavía importan"
    },
    {
      "level": "H2",
      "text": "Cómo escribir una meta descripción"
    },
    {
      "level": "H3",
      "text": "1. Desarrolla tu etiqueta de título"
    },
    {
      "level": "H3",
      "text": "2. Cumple con la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "3. Usa la inteligencia artificial"
    },
    {
      "level": "H3",
      "text": "4. Sé breve"
    },
    {
      "level": "H3",
      "text": "5. Asegúrate de que cada página de tu sitio tenga una descripción"
    },
    {
      "level": "H2",
      "text": "Cómo implementar las meta descripciones"
    },
    {
      "level": "H2",
      "text": "Ejemplos de meta descripciones geniales"
    },
    {
      "level": "H3",
      "text": "1. Healthline"
    },
    {
      "level": "H3",
      "text": "2. TimeOut"
    },
    {
      "level": "H3",
      "text": "3. Patagonia"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Erik Sarissky, Michal Pecánek"
}