{
  "url": "https://ahrefs.com/blog/es/meta-keywords/",
  "slug": "meta-keywords",
  "title": "Meta Keywords: ¿Qué Son? ¿Deberías Usarlas?",
  "description": "Las meta keywords son meta etiquetas que puedes usar para darle a los motores de búsqueda más información sobre el contenido de tu página. ¿Pero deberías usarlas?",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Las meta keywords son meta etiquetas que puedes utilizar para darle más información sobre el contenido de una página a los motores de búsqueda. Se encuentran en el código fuente HTML de una página web, y no son visibles para los visitantes.Aquí hay un ejemplo de etiqueta de meta keywords:<meta name=\"keywords\" content=\"seo, search engine optimization\"/>Resulta sencillo añadir meta keywords en la mayoría de los CMS, pero ¿deberías hacerlo?[…] no utilizamos la meta etiqueta keywords en nuestro ranking de búsquedaDo you still use meta keywords tags on pages you optimize? — Bill Slawski ⚓ (@bill_slawski) May 29, 2020If you find it essential & important to optimize pages for Yandex, and that guides your optimization efforts, and you believe that they still use the meta keywords tag, then good for you. — Bill Slawski ⚓ (@bill_slawski) May 29, 2020A Bing article a few years ago eluded that they could potentially be seen as a spam signal by Bing -- was this an accurate interpretation then/now? — Dan Taylor (@TaylorDanRW) May 29, 2020El título, la descripción y las keywords son importantes para Baidu para evaluar el valor de una página. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Meta Keywords: ¿Qué Son? ¿Deberías Usarlas?"
    }
  ],
  "author": "Joshua Hardwick"
}