{
  "url": "https://ahrefs.com/blog/es/metricas-seo-para-seguir/",
  "slug": "metricas-seo-para-seguir",
  "title": "10 Métricas SEO que de verdad importan (y 4 que no)",
  "description": "Las métricas SEO son indicadores que te ayudan a entender si tu SEO está funcionando. Estas son las 10 que merece la pena que sigas.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Las métricas SEO son indicadores que te ayudan a entender si tu SEO está funcionando. Algunas son esenciales, muchas son útiles y otras son solo métricas de vanidad que no te ayudarán a tomar mejores decisiones.Pero, ¿cómo sabes cuál es cuál? Aquí encontrarás las respuestas.Vamos a recorrer las 10 métricas SEO de las que merece la pena que hagas seguimiento:Tráfico orgánicoRankings de palabras claveVisibilidad de búsquedaValor del tráficoConversiones de tráfico orgánicoDominios de referenciaPáginas indexadasErrores de cobertura en el índiceCore Web VitalsWebsite healthSeguidas por estas cuatro métricas que son conocidas, pero en realidad no importan:Tasa de reboteTasa de salidaPáginas por visita o sesiónDuración media de la sesiónAl final, entenderás lo que realmente se refleja en tus esfuerzos SEO y cómo.10 métricas SEO que merece la pena seguirSi les preguntas a los SEOs qué datos son los que más miran, es probable que uno sea el tráfico orgánico. Bah, está claro. Sin embargo, en la mayoría de los casos y sin más contexto, no es un indicador de éxito en SEO.De hecho, nunca deberías confiar en un solo número sin saber qué hay detrás. Así que vamos a recorrer los intrincados caminos del tráfico orgánico SEO en primer lugar.1. Tráfico orgánicoEl tráfico orgánico representa todos los clics no pagados que vienen desde los motores de búsqueda.Por qué es útilSi tu tráfico orgánico va hacia arriba podría ser señal de que tus esfuerzos en SEO están siendo recompensados. Sin embargo, ten en cuenta que más tráfico orgánico no implica necesariamente más ventas, salvo que monetices tu tráfico web con publicidad display.Cómo hacer seguimientoLa pestaña de Rendimiento en Google Search Console va a ofrecerte la visión más precisa de tu tráfico orgánico a lo largo del tiempo:pro tipSi eres una marca establecida, merece la pena que apliques un filtro de consultas que excluya el tráfico de marca para así obtener una visión más precisa de tu rendimiento SEO:Si no usas Search Console (¡deberías!) puedes conseguir una estimación aproximada gratis usando Site Explorer en Ahrefs Webmaster Tools (AWT):2. Ranking de palabras claveLos rankings de palabras clave se refieren a las posiciones orgánicas en el ranking en los resultados de búsqueda para keywords concretas.Por qué es útilTe preocupas por posicionar bien algunas palabras más que por otras. En general, cuanto más relevante sea una palabra clave para tu producto y negocio, más valioso será para ti posicionar bien en ella.Hacer seguimiento del posicionamiento de tus palabras clave te permite monitorizar tu rendimiento SEO para la mayoría de las palabras clave a lo largo del tiempo.Cómo hacer seguimientoPara conseguir los resultados más exactos, hazte con una herramienta de seguimiento de terceros como Rank Tracker de Ahrefs. Configura un proyecto para tu web, pega un grupo de palabras clave de las que quieras hacer seguimiento y estás listo.Puedes recibir alertas periódicas por email del progreso de tus palabras clave en seguimiento o simplemente revisar los informes de Rank Tracker de vez en cuanto:3. Visibilidad de búsquedaLa visibilidad de búsqueda es el porcentaje de todos los clics en las palabras clave de las que haces seguimiento que terminan en tu página web. Esencialmente es la versión del Share of Voice (SOV, cuota de voz o cuota de conversación), uno de los KPIs de marketing más importantes que mide la visibilidad de tu marca en el mercado.Por qué es útilExiste una relación fuerte entre el SOV y la cuota de mercado. En general, cuanto más alto sea tu SOV, mayor será el trozo de la tarta. Y el hecho de que sea una métrica relativa la convierte en un KPI más adecuado que el crecimiento del tráfico orgánico.Cómo hacer seguimientoPega una muestra representativa de palabras clave que te importen en Rank Tracker de Ahrefs. Deberías tener estas palabras clave preparadas si ya has hecho tu keyword research.Ten en cuenta que estas deberían ser las palabras clave que abarquen lo que tu audiencia objetivo está buscando (no te molestes con palabras clave long-tail). Esto pone el seguimiento de palabras clave del punto anterior a otro nivel.Desde aquí, dirígete a la pestaña de vista general de competidores y revisa la columna de Visibilidad:Ya está. La visibilidad de la SERP es un gran KPI para cualquiera, porque siempre tienes competidores directos sea cual sea tu modelo de negocio.Aprende más: ¿Qué es Share of Voice? Cómo medirlo en todos los canales4. Valor del tráficoEl valor del tráfico es cuánto pagarías por todos los clics orgánicos si vinieran desde anuncios de búsqueda PPC.Por qué es útilEn general, cuanto mayor sea el valor del tráfico orgánico, más valioso se vuelve tu negocio.Aunque deberías usar el SEO para llevar tráfico a lo largo de todo el customer journey, los clics de los usuarios que es más probable que vayan a realizar una conversión pronto son los más valiosos. Por eso es por lo que ves muchos anuncios de búsqueda para “palabras clave monetarias” como “la mejor agencia SEO de España” y ninguno para “qué es SEO”.El crecimiento del valor del tráfico también es una gran señal del crecimiento del rendimiento SEO. Posicionar bien en “palabras clave monetarias” y recibir más tráfico de las mismas es generalmente mucho más difícil que posicionar en palabras clave que la gente suele mirar sin intención de comprar nada.Cómo hacer seguimientoPuedes comprobar el valor del tráfico general de cualquier dominio en Site Explorer de Ahrefs:Pero puedes también profundizar en el valor del tráfico de páginas. Para hacerlo, abre el informe Top Pages (Mejores páginas) en Site Explorer y ordena tus páginas por su valor de tráfico para ver tus páginas con mayor valor:5. Conversiones de tráfico orgánicoLas conversiones son acciones importantes que los usuarios realizan en tu sitio, como comprar, registrarse o suscribirse a un servicio. Hacer seguimiento de todas estas acciones para todas tus fuentes de tráfico, incluyendo la orgánica, es algo que la mayoría de empresas ya hacen.Por qué es útilEl seguimiento de conversiones es la forma más directa de relacionar tus esfuerzos en marketing con tus ingresos. En términos de KPIs SEO este es con el que todo el mundo se pone de acuerdo en su extrema importancia.Cómo hacer seguimientoConfigurar el seguimiento de conversiones es normalmente fácil incluso aunque no sepas programar. Lo más importante aquí es asegurarse de que haces seguimiento de las conversaciones adecuadas.Si gestionas un ecommerce, el número de conversiones, su valor y tu pedido medio son lo que tiene más sentido en tu caso. Pero, claro, tendrás que configurar el seguimiento de Comercio Electrónico Mejorado en tu Google Analytics para hacerlo.Si ofreces un software basado en suscripciones, como nosotros, tiene sentido hacer seguimiento de leads, registros en la prueba, suscripciones de pago y con el tiempo, incluso de cada plan de las nuevas suscripciones.Sin embargo, independientemente de las conversiones de las que hagas seguimiento, merece la pena que tengas algunas cosas en cuenta:Los datos de Google Analytics están sesgados, ya sea de una u otra forma.Google Analytics atribuye por defecto las conversiones a la última fuente de tráfico. Eso no refleja cómo el SEO o la mayoría de otros canales de marketing contribuyen a esas conversiones.Siempre deberías comparar períodos que tenga sentido comparar (esto es especialmente importante para negocios con ventas estacionales).Recoger adecuadamente datos de GA, interpretarlos y usarlos para mejorar tu rendimiento SEO son temas complejos que van más allá de este artículo. Te recomiendo encarecidamente que revises mis otros dos artículos para aprender más:Lecturas complementariasCómo usar Google Analytics para mejorar el rendimiento de SEO13 errores de seguimiento de Google Analytics (y cómo corregirlos)6. Dominios de referenciaLos dominios de referencia son webs que enlazan a tu sitio web.Por qué es útilLos enlaces son uno de los factores de posicionamiento más importantes para Google, y existe una clara correlación positiva entre los dominios de referencia y el tráfico orgánico:En otras palabras, quieres asegurarte de que consigues más dominios de referencia a lo largo del tiempo, ya que probablemente lleve más tráfico orgánico de búsqueda. Así que una tendencia ascendente en dominios de referencia es un indicador de que tu link building, PR (relaciones públicas) y esfuerzos de marca van por el buen camino.Cómo hacer seguimientoIntroduce tu dominio en Site Explorer de Ahrefs y busca el gráfico de dominios de referencia:De nuevo, a pesar de la clara correlación, un gráfico sencillo no refleja necesariamente tu éxito en SEO. Tienes que asegurarte de que las webs que te enlazan son realmente buenas. Puedes hacer eso con el informe Referring domains (dominios de referencia):7. Número de páginas indexadasEsto te dice cuántas páginas (más en concreto, URLs) tiene un motor de búsqueda en su índice.Por qué es útilTus páginas tienen primero que indexar para aparecer en las SERPs y llevar tráfico orgánico, pero también querrás mantener algunas páginas fuera del índice.En general, quieres ver cómo el número de páginas indexadas crece con firmeza a medida que publicas nuevo contenido. Cualquier cambio brusco en el número es probablemente un problema de SEO técnico.Cuanto más grande y complejo es tu sitio, más importante se convierte para ti esta métrica.Cómo hacer seguimientoPuedes comprobar de forma aproximada cuántas páginas de un dominio dado tiene Google en su índice usando el operador de búsqueda site (sitio) así:Pero la mejor forma de hacer seguimiento de este número con más detalle es consultar el informe de Cobertura en tu cuenta de GSC:8.Errores de cobertura en el índiceRelacionado con la métrica anterior, el número de páginas que tienen errores en el índice de cobertura es igual de importante. Estos errores son cualquier cosa que evite que tus páginas se indexen cuando no se hace de forma intencionada usando meta etiqueta robots no index.Por qué es útilExisten muchas razones por las que Google puede desindexar tus páginas o rehusar indexarlas. Ya que los errores del índice de cobertura se muestran cuando la razón es probablemente algo que no hiciste a propósito, es importante saber reconocerlos y arreglarlos cuando sea necesario.Cómo hacer seguimientoUna vez más, estos errores también aparecen en el informe de Cobertura de GSC:Cuando haces clic en un error, te mostrará una lista de URLs afectadas por el mismo con un enlace para aprender más sobre él. Normalmente hay una indicación para arreglarlo.Si quieres profundizar y conseguir más explicaciones sobre cómo arreglar tus problemas de indexación, regístrate con una cuenta gratuita de Ahrefs Webmaster Tools y rastrea tu web usando Site Audit:Una vez que la herramienta finalice el rastreo de tu sitio web, dirígete al informe de Indexability (indexabilidad) y revisa los problemas ahí:De esta forma, puedes posiblemente arreglar tus páginas incluso antes de que Google las rastree, lo que siempre será mejor.Aprende más: 10 Maneras de Hacer que Google Indexe tu Sitio (Que sí Funcionan)9. Core Web VitalsLas Core Web Vitals (CWV) o métricas web principales, son un conjunto de métricas relacionadas con la velocidad y experiencia de usuario de tu sitio. Aquí tienes cuáles son: Renderizado del mayor elemento con contenido (Largest Contentful Paint, LCP) – el elemento visible más grande que se carga en la ventana de visualización. Latencia de la primera interacción (First Input Delay, FID) – el tiempo desde que un usuario interactúa con tu página hasta que la página puede responder. Cambios de diseño acumulados (Cumulative Layout Shift, CLS) – cómo se mueven los elementos o cuán estable es el diseño de la página. Por qué es útilGoogle usa CWV como un factor de posicionamiento menor desde junio de 2021. Si alguna o las tres métricas son muy malas, es probable que sea una buena idea arreglarlas.Esto refleja el esfuerzo de Google para posicionar páginas que ofrezcan una gran experiencia de usuario, lo que supone una velocidad de carga adecuada y una interacción fluida.Cómo hacer seguimientoHay muchas formas de hacer seguimiento de CWV, pero la apuesta más segura es revisarla en tu cuenta de GSC en el informe de Core Web Vitals (Métricas Web Principales):De forma alternativa, puedes usar Site Audit de Ahrefs, revisa el informe de Performance (rendimiento) y mira las métricas de CWV junto a otras relacionadas:Aprende más: Core Web Vitals: la Velocidad de Página es Ahora Más Importante para el SEO10. Website Health ScoreSite Audit de Ahrefs tiene una métrica llamada Health Score (puntuación de salud) que refleja la proporción de URLs internas en tu sitio web que no tienen errores de SEO técnico:Por qué es útilHealth Score te ofrece una aproximación de confianza respecto al estado de tu SEO técnico. Lo mejor es que verás cambios en tu Health Score comparada con rastreos anteriores, incluyendo errores específicos que contribuyeron a esos cambios.Cómo hacer seguimientoDe nuevo, con un proyecto en Site Audit ya tienes ahí lo que necesitas.Cada vez que Ahrefsbot termine de rastrear tu web, actualizará tu Health Score y la reportará como proceda. Para ver los cambios en los errores de tu web entre rastreos, dirígete al informe de All issues (todos los problemas) y elige “Solo errores”:Aprende más: La Guía Para Principiantes al SEO Técnico4 métricas SEO conocidas que no importanLlegamos a la parte más controvertida de este artículo.Muchas métricas son malinterpretadas, no son tan útiles o simplemente se usan de forma equivocada. Por desgracia, no demasiada gente habla de esto. Como resultado, es bastante común ver recursos compitiendo entre ellos por el número de métricas listadas.Estoy seguro de que has oído la frase “menos es más” en muchas ocasiones. Lo mismo aplica al análisis de datos. Así que aquí tienes por qué no deberías perder tiempo prestando mucha atención a 4 métricas ampliamente recomendadas.1. Tasa de reboteLa tasa de rebote es el porcentaje de usuarios que no realizan más acciones después de aterrizar en una web, como hacer clic a otra página, dejar un comentario o añadir un elemento al carrito.Es una de las métricas SEO a las que más se recomienda prestar atención (algunos incluso la llaman KPI). Aunque la tasa de rebote puede ser útil en algunos casos, en ningún caso deberías obsesionarte con ella. Aquí van las tres razones más importantes que hacen que la tasa de rebote sea complicada de usar:Está sesgada por malas configuraciones en Google Analytics, usuarios que se van demasiado pronto, usuarios de ad-block y sesiones expiradas. Es una métrica promediada que necesita mucha segmentación y filtrado para ofrecer información de valor.No hay una comparativa de una “buena” tasa de rebote. Todo depende de tu nicho, tipo de página, fuente de tráfico e intención del usuario.Aprende más: ¿Qué es la Tasa de Rebote? Cómo Interpretarla y Trabajarla2. Tasa de salidaLa tasa de salidas o porcentaje de salidas es el porcentaje de sesiones que terminaron en una página concreta. A algunas personas en SEO les gusta hacer seguimiento de las principales páginas de salida del tráfico orgánico en un informe como este:Pero las altas tasas de salida no significan que haya algo malo con la página. En realidad puede ser justo lo contrario—el usuario consiguió lo que estaba buscando y dejó la página satisfecho con una buena impresión de tu marca y/o producto. Podrían haber visto muchas otras páginas o incluso realizar alguna conversión.Necesitarías profundizar en otras métricas relacionadas o revisar grabaciones de usuarios para conseguir información de valor de esto. Generalmente prefiero ignorarlo y enfocarme en temas más importantes.3. Páginas por sesiónDe forma parecida a la tasa de salida, puedes encontrar consejos para optimizar tu experiencia de usuario en base a cifras de pocas páginas por sesión. En términos de SEO, eso sería a partir de tu segmento con fuente de tráfico orgánico:Así que, una vez más, ¿cuál es un buen número de páginas por sesión? ¿Significa el 4.30 de la captura de pantalla de arriba que tus usuarios de tráfico orgánico están menos vinculados que aquellos que vienen de tráfico pagado con 6.10? En cualquier caso, ¿cuál sería una acción específica para mejorarlo? Los datos de GA no te dirán eso.Hay simplemente demasiadas variables en juego que hacen que esta métrica no sea fiable para trabajar con ella.4. Duración media de la sesión / tiempo en páginaEstas métricas también deberían indicar cómo de involucrados están tus usuarios ofreciendo métricas de tiempo.El mayor problema es cómo se calculan estas métricas de tiempo.Google Analytics recoge marcas temporales (timestamps) cuando un usuario hace clic en páginas o hace que se disparen eventos. Después calcula la duración de la sesión tomando otra marca temporal de tu primera visita a la web y la última durante la sesión. El tiempo en página es la diferencia entre cargar una página y después hacer clic en otra.Esto quiere decir que cualquier sesión con rebote tiene 0 segundos, tanto en página como en duración de sesión, porque el servidor de GA solo tiene la primera marca temporal, de cuando cargaste la página web.Daría más razones para no usar esta métrica aplicando la lógica de antes. Pero como las sesiones con rebote ocurren de forma tan frecuente, eso ya convierte a las métricas basadas en tiempo en algo inútil.Reflexiones finalesSaber qué datos mirar y cómo interpretarlos es a menudo una parte que se pasa por encima en SEO (o en cualquier canal de marketing). Reportar y probar el valor de nuestros esfuerzos SEO es una parte importante de nuestros trabajos.Sabes qué métricas SEO deberías seguir y analizar. Pero, más importante, también deberías saber el “por qué” detrás de cada uno de esos números.¿Preguntas? ¿Dudas? ¿Sugerencias? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "10 Métricas SEO que de verdad importan (y 4 que no)"
    },
    {
      "level": "H2",
      "text": "10 métricas SEO que merece la pena seguir"
    },
    {
      "level": "H3",
      "text": "1. Tráfico orgánico"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "2. Ranking de palabras clave"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "3. Visibilidad de búsqueda"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "4. Valor del tráfico"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "5. Conversiones de tráfico orgánico"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "6. Dominios de referencia"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "7. Número de páginas indexadas"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "8.Errores de cobertura en el índice"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "9. Core Web Vitals"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "10. Website Health Score"
    },
    {
      "level": "H4",
      "text": "Por qué es útil"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "4 métricas SEO conocidas que no importan"
    },
    {
      "level": "H3",
      "text": "1. Tasa de rebote"
    },
    {
      "level": "H3",
      "text": "2. Tasa de salida"
    },
    {
      "level": "H3",
      "text": "3. Páginas por sesión"
    },
    {
      "level": "H3",
      "text": "4. Duración media de la sesión / tiempo en página"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek"
}