{
  "url": "https://ahrefs.com/blog/es/metricas-marketing/",
  "slug": "metricas-marketing",
  "title": "25 Métricas de Marketing que Deberías Seguir",
  "description": "Elige las métricas de marketing adecuadas, gestiónalas a lo largo del tiempo y enfócate en incrementar los beneficios de tu negocio. Aquí van 25 métricas de que deberías considerar seguir.",
  "content": "Marc Thomas Head of Growth en Powered by Search, Agencia de Marketing especializada en B2B SaaS. Escribo sobre marketing y growth en mi blog. Contenido Muchas métricas de marketing son buenas solo para tu aspecto—eso es por lo que se las llama métricas de vanidad.Las métricas de vanidad no te dan mucho conocimiento para tomar buenas decisiones de marketing, llevándote a destinar recursos en cosas que no importan para tu negocio.Es mejor elegir un conjunto pequeño de números significativos para cualquier canal en el que trabajes y atarlos a tus objetivos generales de ingresos.Pero, ¿qué métricas son las correctas para cada canal de marketing y cómo deberías usarlas?Aquí van 25 métricas de marketing que deberías considerar seguir:Métricas generalesMétricas de retenciónMétricas SEOMétricas de publicidadMétricas de emailMétricas de redes socialesMétricas generalesAlgunas cifras – como métricas de facturación – no pertenecen a un canal específico, sino que abarcan todo el trabajo que haces. Querrás hacer seguimiento de estas cifras sin tener en cuenta el área de marketing para la que trabajas.1. Crecimiento de ingresos El crecimiento de los ingresos es la diferencia entre dos cifras de ingresos. Por ejemplo: antes y después de iniciar una campaña de marketing.Cómo calcularloCrecimiento de ingresos (%) = ((Ingresos al final - Ingresos al principio) / Ingresos al principio) × 1002. Costo de Adquisición de Clientes (CAC, Customer Acquisition Cost)CAC es la cantidad de dinero que le supone a tu negocio adquirir un nuevo cliente. Cuanto menor sea el número, mejor.Se usa principalmente en relación a otras métricas como el valor de la vida del cliente (más sobre esto después) para entender cuánto puedes permitirte gastar para adquirir más clientes en el futuro.Cómo calcularloCAC = Cantidad total gastada en marketing / Número de nuevos clientes adquiridos3. ConversionesUna conversión ocurre cuando un visitante a tu web completa una acción que estás registrando. Algunos ejemplos pueden ser altas, reservas de una demo y compras.El seguimiento de conversiones te permite ver dónde los clientes están completando acciones clave en su customer journey.Cómo calcularloEn Google Analytics, puedes establecer Objetivos y después registrar la tasa de conversión (el porcentaje de personas que completan una acción) a lo largo de tu sitio.En la imagen de abajo, podemos ver a qué páginas llegan los usuarios antes de comprar un producto. Podemos ver también la tasa de conversión y el beneficio que se atribuye a las conversiones:4. Cuota de voz (SOV, Share of Voice)La cuota de voz te dice qué tan visible eres en comparación con tus competidores. La cuota de mercado y la cuota de voz están íntimamente relacionadas. Si tienes un 20% de cuota de voz, probablemente tendrás una cuota parecida de mercado.Si tu cuota de voz está por encima de tu cuota de mercado en relación a tus competidores, tienes un exceso de cuota de voz (eSOV). En el largo plazo, tu cuota de mercado probablemente se igualará con tu cuota de voz.Eso quiere decir que SOV puede ser un indicador de crecimiento futuro.Cómo calcularloCuota de voz = Visibilidad de la marca / Visibilidad potencial totalNo es práctico medir SOV en varios canales a la vez, así que necesitarás calcularlo canal por canal.Aquí tienes cómo hacerlo para la búsqueda orgánica:Crea una lista de keywords importantesAñádeles a Rank TrackerVe al informe de Competitors (competidores)Comprueba la columna de Visibility (visibilidad)Aquí puedes ver el porcentaje de clics que estás ganando para las palabras clave que sigues en comparación con tus competidores.Lectura recomendada: ¿Qué es Share of Voice? Cómo medirlo en todos los canales5. Retorno de la Inversión (ROI, Return on Investment)El ROI es una medida del impacto que una campaña o canal ha tenido en los ingresos del negocio.Cómo calcularloROI = (Ingresos atribuidos al gasto de marketing - Gasto en marketing) / Gasto en marketingCuanto más alto es el número, mejor es el ROI. El ROI es más fácil de calcular en canales como la publicidad de pago, donde los píxeles de seguimiento de la publicidad pueden medir con efectividad el camino de lead al cliente. Métricas de retenciónEl marketing no trata solo de atraer nuevos clientes, sino también de retener a clientes existentes. Cuanto más mantengas a un cliente, más beneficio harás con él.6. Churn rate (tasa de cancelación)El churn es el porcentaje de tus clientes que dejan de pagarte. Es muy habitual en negocios de software as a service (software como servicio o SaaS), que se apoyan en los ingresos recurrentes para crecer.Cómo calcularloChurn rate = (Ingresos perdidos en el período / Ingresos al comienzo del período) x 100Un churn elevado puede ser un indicador de productos mal posicionados. Si tus clientes cancelan sus cuentas porque tu producto no hace lo que pensaron que hacía, deberías revisitar tus páginas de venta e intentar aclarar tu propuesta de valor.7. Valor de la Vida del Cliente (LTV, Lifetime Value)El LTV muestra cuánto paga de media un cliente a lo largo de toda su relación con tu negocio.Nota al margen. A veces verás los acrónimos CLV o CLTV . Quieren decir lo mismo, la “C” es de “cliente” (customer en inglés).Cómo calcularloPara un negocio de ecommerce:LTV = Valor de Pedido Medio x Frecuencia Media de Compras Anuales x Tiempo de vida Medio del ClientePara calcular el LTV para un negocio de SaaS:LTV = Ingresos Medios Mensuales por Cliente / Tasa Media Mensual de ChurnSi tu negocio es nuevo, tardarás algún tiempo en tener cifras de LTV porque no sabes durante cuánto tiempo te pagará el cliente promedio.8. LTV:CACEl ratio de LTV a CAC te dice cuánto puedes gastar razonablemente para adquirir un nuevo cliente.Por ejemplo, si tu cliente medio te paga 30$, gastar hasta 29.99$ para conseguir un cliente sería un éxito. Sin embargo, acabarías solo con 1 céntimo de beneficio, lo que te deja sin espacio para el margen.Cómo calcularloNo hay un ratio único que funcione para cada negocio, porque no hay una cantidad específica que deberías pagar por un cliente. Varía en función del momento, negocio e industria.9. Net Promoter Score (NPS)El NPS es una métrica ampliamente usada para medir los niveles de satisfacción del cliente. Los clientes insatisfechos a menudo darán puntuaciones bajas, indicando que probablemente se den de baja en el futuro.Cómo calcularloNPS = Porcentaje de Promotores - Porcentaje de DetractoresUsando una única pregunta de encuesta, estrictamente definida, el NPS te pregunta: “¿Cuál es la probabilidad de que recomiendes {Nombre de la Empresa} a un amigo?”La puntuación varía entre 0 y 10. Cualquiera con puntuaciones entre 0-6 es un detractor, las puntuaciones entre 7-8 son neutrales o pasivos y las de 9-10 son promotores.Las puntuaciones de NPS varían entre -100 y 100, y una puntuación superior a 70 está considerada de “talla mundial”.10. Tasa de Repetición de Compra (Repeat Purchase Rate)La Tasa de Repetición de Compra es el porcentaje de clientes que te compran más de una vez.Se usa mucho en ecommerce para predecir cómo de efectivo es un cliente en la retención de clientes.Cómo calcularloTasa de Repetición de Compra = Número de clientes que compran más de una vez / número total de clientesUna tasa alta de repetición de compra muestra una retención saludable y que puedes gastar más dinero para atraer nuevos clientes.Métricas SEOLa búsqueda es un canal fantástico para hacer crecer tu negocio. Pero es importante asegurarse de que estás en el camino correcto y que la estrategia que sigues funciona.Usa estas métricas SEO para controlar el crecimiento de tráfico provenientes de búsquedas.11. Tráfico Orgánico de Marca vs. no-Marca A menudo es de ayuda saber cuánta gente encuentra tu web en base a búsquedas del nombre de tu empresa y términos relacionados (de marca, o branded en inglés) vs. el resto (no-marca).Si la mayor parte de la gente te encuentra buscando por el nombre de tu marca en Google, es probable que te estés perdiendo a un montón de clientes que están buscando soluciones para sus problemas.Cómo calcularloPuedes estimar el ratio de tráfico de marca frente a no-marca en Google Search Console.Dirígete a la pestaña de Rendimiento. Desde aquí, necesitarás filtrar por búsquedas de marca desde tu informe. Después añade el nombre de tu marca y cualquier variante/erratas en el campo de la consulta, eligiendo “consultas que contengan” como el operador. Haz clic en Aplicar:Cuando hayas terminado de añadir estos filtros, anota el número de “Clics totales”. Esta es tu cifra de tráfico de marca.Después cambia todos tus operadores de filtros de términos de marca a “Consultas que No Contengan” y toma nota del número de “Clics totales” de nuevo.Esto te dará la cantidad de tráfico del tráfico de marca vs. no-marca.12. Menciones de marcaLas menciones de marca te muestran la frecuencia en la que apareces en las conversaciones de tu industriaCuando una página web menciona a tu empresa o términos muy relacionados, como empleados conocidos (en relación a su trabajo), has recibido una mención de marca.Cómo hacer seguimientoSi quieres recibir una alerta cuando alguien mencione tu marca en el futuro, usa Ahrefs Alerts.Ve a Ahrefs AlertsHaz clic en la pestaña de MencionesHaz clic en “Nueva alerta”Introduce el nombre de tu marcaElige los idiomasExcluye dominios de los que no quieras hacer seguimientoEstablece tu intervalo de alertasHaz clic en “Agregar”.13. Crecimiento de Backlinks Los backlinks (enlaces entrantes) son enlaces a tu página web desde otras páginas en Internet.Un buen perfil de backlinks te ayudará a posicionar mejor en búsqueda y llevará tráfico relevante de referencia. Posicionar para palabras clave que tus clientes objetivo están buscando te ayudará a adquirir usuarios a un costo decreciente a lo largo del tiempo.Cómo calcularloPuedes comprobar el crecimiento de dominios de referencia a cualquier sitio en Site Explorer.Al usar el informe de Mejor por crecimiento de enlaces, podemos ver qué páginas han ganado o perdido backlinks en los períodos previos de 1, 7 y 30 días:Métricas de publicidadEl gasto ineficiente en publicidad pagada quemará tu dinero a un ritmo alarmante.En lugar de dejarlo al azar, haz seguimiento de estas métricas para asegurar que el gasto de publicidad se justifica.14. Quality Score (nivel de calidad)Google Ads usa el Quality Score (o nivel de calidad) para estimar cómo de relevante es un anuncio para un usuario potencial.Cómo calcularloGoogle lo calcula por ti.El Quality Score consiste en tres factores principales:Porcentaje de clics (CTR) esperadoRelevancia del anuncio para la palabra claveExperiencia en la página de destinoLos anuncios con altas puntuaciones (en una escala de 1 a 10, donde 10 es lo más alto) ganan mejores posiciones y un menor costo en general.Saber esto te dará muchas opciones para mejorar tu Quality Score haciendo cambios en tu página de destino (landing page), mejorando tu segmentación o cambiado el texto del anuncio para hacerlo más atractivo.15. Costo Por Clic (CPC, Cost Per Click)El Costo Por Clic es el número que te muestra el precio que pagas cada vez que alguien hace clic en tu anuncio.Cómo calcularloCPC = Costo total de los clics / número total de clicsEl Costo Por Clic varía entre palabras clave, pero puedes conseguir un CPC medio en Keywords Explorer mientras haces keyword research:Es un número útil que saber para que puedas pensar en tu estrategia de pujas en campañas existentes y futuras.16. Costo Por ConversiónEl Costo Por Conversión te dice cuánto cuesta cada conversión en tus anuncios.Cómo calcularloCosto por Conversión = Cantidad Total Gastada / Número Total de ConversionesEso te permite decidir si es un uso efectivo de tu presupuesto de marketing.17. Retorno del Gasto en Publicidad (ROAS, Return on Ad Spend)ROAS es el retorno económico sobre tu gasto en publicidad.Cómo calcularloROAS = Valor Total de las Conversiones / Gasto Total ROAS es parecido al Coste Por Conversión. Sin embargo, el ROAS solo tiene en cuenta las conversiones unidas a una inversión, mientras que el Coste Por Conversión incluye conversiones como “descargar un PDF” que no tienen un valor monetario inmediato.18. Conversiones post-impresión Las conversiones post-impresión se dan cuando los clientes ven, pero no interactúan, con tu anuncio y después completan una conversión en tu sitio.Cómo calcularloLas redes de anunciantes saben cómo atribuir las conversiones a clics y visualizaciones porque requieren que instales un píxel en tu sitio antes de lanzar tus campañas.El píxel recoge datos sobre la gente que te visita, incluyendo de dónde vinieron.Por ejemplo, si un usuario ve tu anuncio, lo pasa haciendo scroll y después visita tu web 30 días después para realizar una compra, una conversión post-impresión se añadirá a tus estadísticas de campaña.Si tu ciclo de ventas es superior a 30 días, querrás establecer la ventana histórica en las campañas a una longitud que sea apropiada para tu negocio.Métricas de emailAl contrario que la búsqueda y el tráfico de pago, los canales propios como el email siempre están activos. Tus suscriptores te han dado el consentimiento para contactarlos directamente en su bandeja de entrada.Estas métricas te muestran dónde mantienes su confianza y cuándo necesitas mejorar.19. Tasa de crecimiento de suscriptoresLa tasa de crecimiento de suscriptores es la diferencia en porcentaje entre suscriptores al comienzo y al fin de un período (mensual/anual/todo el tiempo).Cómo calcularloTasa de crecimiento de suscriptores (%) = ((Suscriptores al fin del período - Suscriptores al comienzo del período) / Suscriptores al comienzo del período) x 100Las listas de email que crecen crean nuevas oportunidades para encantar a tus clientes.Medir la tasa de crecimiento de tu lista a lo largo del tiempo es una métrica mucho mejor que una cifra estática de suscriptores.La tasa de crecimiento de suscriptores te da conocimientos sobre cómo de rápidamente estás creciendo con tus listas.20. Tasa de aperturaLa tasa de apertura es el porcentaje de suscriptores que han abierto tu email.Cómo calcularloTasa de apertura = (Emails abiertos / (Emails enviados - rebotes)) * 100No deberías usar una alta tasa de apertura como una señal de buena vinculación. Mucha gente abrirá los emails y no los leerá ni interactuará con ellos. A veces solo los abren para pulsar el botón de borrar. La tasa de apertura no distingue entre malas y buenas aperturas.A pesar de eso, la tasa de apertura podría darte algún conocimiento general sobre si tu asunto y extractos están funcionando bien con tu audiencia.21. Tasa de clic La tasa de clic es el porcentaje de receptores que hacen clic en un enlace en tu email.Cómo calcularloTasa de clic = (Emails con clics / (Emails enviados - rebotes)) * 100Los clics en enlaces de emails son casi siempre un indicativo de que tu contenido ha atraído el interés de un lector. Hasta cierto punto, la tasa de clic es una medida fiable de la vinculación, con la que puedes realizar seguimiento como un KPI para el email.La mayor parte de proveedores de servicios de email (ESPs o email service providers) te darán datos de una tasa de clics tanto a nivel de campaña como de cuenta.22. Tasa de bajaLa tasa de baja es el porcentaje de receptores que se dan de baja tras recibir tu email.Cómo calcularloTasa de baja = (Bajas / (Emails enviados - rebotes)) * 100Seguir la tasa de baja desde tus campañas es útil cuando los números de tus últimas campañas son altos. Si alguien se da de baja, no puedes seguir mandándole mensajes, lo que probablemente impactará en tu capacidad de venderles productos/servicios adicionales.Si ves que mucha gente se da de baja, es posible que haya un problema con tus mensajes o que tu marketing no está cumpliendo las expectativas de tus suscriptores.23. Tasa de reboteLa tasa de rebote es el porcentaje de emails que no fueron enviados porque una dirección de email es incorrecta, no existe o el servidor de correo bloqueó el envío por alguna otra razón.Cómo calcularloTasa de rebote = (Número de rebotes / Emails enviados) * 100La tasa de rebote puede tener un efecto colateral en tu negocio porque los mensajes de marketing no están llegando a clientes potenciales. En cuyo caso, puede que sea menos probable que te compren en el futuro.La tasa de rebote puede también indicar la salud de tu lista de email. Si tienes una tasa de rebote elevada, puede que estés atrayendo muchos emails falsos.Nota al margen. Ocasionalmente verás que se mencionan los rebotes suaves (soft bounces). Hay docenas de razones por las que los rebotes suaves ocurren, incluyendo que un mensaje sea marcado como spam por un servidor de email o que el buzón de correo del receptor esté lleno. Al contrario que los rebotes duros (hard bounces), la mayor parte de ESPs tratarán de enviar los rebotes suaves de nuevo en un momento distinto antes de eliminarlos. Métricas de redes socialesLas métricas en medios sociales son complicadas porque las redes sociales funcionan con algoritmos secretos y cambiantes.Además de eso, cada red social define las métricas de forma diferente. Por ejemplo, aquí va lo que constituye una visualización de vídeo en diferentes redes sociales:Facebook/Instagram – 3 segundos YouTube – 30 segundosTwitter – 2 segundos cuando el 50% del frame del vídeo es visibleLinkedIn – 2 segundos cuando el 50% del frame del vídeo es visibleLa conclusión es que seguir métricas en redes sociales es difícil y propenso al cambio. Tienes que hacerte la pregunta: ¿merece la pena hacer que estas métricas formen parte de tus informes?24. Vinculación (engagement)La vinculación es una categoría amplia que incluye las acciones específicas en las publicaciones de cada red social.Cómo hacer seguimientoPuedes usar las herramientas de analítica propias de cada red social para conseguir cifras de engagement. Como alternativa, puedes usar una herramienta de analítica de medios sociales como Buffer Analyze.Sin embargo, no hay un conjunto estandarizado de acciones en los medios sociales.Por ejemplo:Twitter – likes (me gusta), retweets, quote tweets (citas de tuits), replies (respuestas), profile clicks (clics en el perfil)Facebook – shares (compartidos), views (visualizaciones), likes/reactions (me gusta / reacciones), comments (compartidos), clicks (clics)LinkedIn – impressions (impresiones), comments (comentarios), shares (compartidos), reactions(reacciones)Esto quiere decir que puede ser difícil comparar el valor de la vinculación entre redes sociales.25. Menciones de marcaLas menciones de marca se refieren al número de veces que el nombre de tu marca se menciona en medios sociales en un período dado.Cómo hacer seguimientoPuedes usar una herramienta como Hootsuite para hacer seguimiento de esto, donde incluso puedes segmentar por sentimiento para ayudarte a entender cómo de positiva se siente tu audiencia hacia tu marca.Hacer seguimiento de las menciones de tu marca en medios sociales te da conocimiento sobre cómo los clientes perciben el mercado.Por ejemplo, supón que el nombre de tu marca recibe menciones de forma consistente en medios sociales. Puede ser una buena señal de que deberías seguir invirtiendo en medios sociales como un canal de marketing.Reflexiones finales La famosa cita de Peter Drucker es: “lo que se mide, se puede gestionar”.Pero solo porque te quedes mirando Google Analytics durante horas no quiere decir que estés siguiendo métricas de marketing de forma efectiva. Si no estás realizando seguimiento del impacto de marketing en el resultado neto, ¿cómo sabrás dónde invertir en el futuro?En lugar de eso, elige las métricas adecuadas para tus canales de marketing, gestiónalos a lo largo del tiempo y enfócate en hacer crecer los beneficios del negocio.¿Alguna pregunta? Escríbeme en Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el primer directorio de herramientas de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "25 Métricas de Marketing que Deberías Seguir"
    },
    {
      "level": "H2",
      "text": "Métricas generales"
    },
    {
      "level": "H3",
      "text": "1. Crecimiento de ingresos"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "2. Costo de Adquisición de Clientes (CAC, Customer Acquisition Cost)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "3. Conversiones"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "4. Cuota de voz (SOV, Share of Voice)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "5. Retorno de la Inversión (ROI, Return on Investment)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H2",
      "text": "Métricas de retención"
    },
    {
      "level": "H3",
      "text": "6. Churn rate (tasa de cancelación)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "7. Valor de la Vida del Cliente (LTV, Lifetime Value)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "8. LTV:CAC"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "9. Net Promoter Score (NPS)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "10. Tasa de Repetición de Compra (Repeat Purchase Rate)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H2",
      "text": "Métricas SEO"
    },
    {
      "level": "H3",
      "text": "11. Tráfico Orgánico de Marca vs. no-Marca"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "12. Menciones de marca"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "13. Crecimiento de Backlinks"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H2",
      "text": "Métricas de publicidad"
    },
    {
      "level": "H3",
      "text": "14. Quality Score (nivel de calidad)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "15. Costo Por Clic (CPC, Cost Per Click)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "16. Costo Por Conversión"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "17. Retorno del Gasto en Publicidad (ROAS, Return on Ad Spend)"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "18. Conversiones post-impresión"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H2",
      "text": "Métricas de email"
    },
    {
      "level": "H3",
      "text": "19. Tasa de crecimiento de suscriptores"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "20. Tasa de apertura"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "21. Tasa de clic"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "22. Tasa de baja"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H3",
      "text": "23. Tasa de rebote"
    },
    {
      "level": "H4",
      "text": "Cómo calcularlo"
    },
    {
      "level": "H2",
      "text": "Métricas de redes sociales"
    },
    {
      "level": "H3",
      "text": "24. Vinculación (engagement)"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H3",
      "text": "25. Menciones de marca"
    },
    {
      "level": "H4",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Marc Thomas"
}