{
  "url": "https://ahrefs.com/blog/es/mitos-seo/",
  "slug": "mitos-seo",
  "title": "10 Mitos del SEO que Deberías Ignorar",
  "description": "Los mitos del SEO te pueden llevar a perder tu valioso tiempo y dinero en cosas que nunca mejorarán tu SEO. Este post rompe algunos mitos comunes del SEO.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La mayoría de los mitos son inofensivos. La goma de mascar tarda siete años en digerirse. Los tiburones no contraen cáncer. Los rayos nunca caen dos veces en el mismo lugar.Desafortunadamente, no se puede decir lo mismo de la mayoría de los mitos del SEO. En el mejor de los casos, son un poco engañosos. En el peor de los casos, te llevan a perder tu valioso tiempo, dinero y recursos en cosas que nunca mejorarán el SEO.Así que rompamos algunos mitos comunes del SEO de una vez por todas.El SEO ha muerto El SEO es algo que se hace una sola vezGoogle sólo posiciona el contenido ‘fresco’Las palabras clave long-tail son más fáciles de posicionarEl contenido duplicado te traerá penalizacionesLas señales sociales ayudan con el posicionamientoEl PPC no puede ayudarte a posicionarte más altoEl PageRank ya no es relevanteEl SEO sólo se trata de rankingsEl Keyword research no es importante1. El SEO ha muertoQuizás esto sea un sinsentido más que un mito, pero vale la pena acabar con él.Al periodismo perezoso le gusta proclamar muchas cosas muertas con regularidad, y el SEO no es diferente. Según Content Explorer de Ahrefs, esta frase se ha emitido 3,367 veces desde junio de 2016.En promedio, eso es 66 veces al mes.Así que dejemos las cosas claras de una vez por todas:El. SEO. No. Ha. Muerto.¿Cómo lo sabemos? Bueno, aquí está el tráfico de búsqueda orgánica a nuestro blog durante los últimos tres meses:2,1 millones de visitas … todas por “SEO”.Entonces, ¿por qué la gente sigue diciendo que el SEO está muerto?Hay todo tipo de razones, pero el argumento más destacado en estos días se relaciona con la creciente prevalencia de respuestas como esta en los resultados de búsqueda:¿Esto impacta negativamente en la cantidad de clics en los resultados de búsqueda? Por supuesto. Si observamos esta consulta en el Keywords Explorer de Ahrefs, vemos tan sólo 1,200 clics de un volumen de búsqueda mensual estimado de 14,000. Eso significa que la gente hace clic solo el 8% de las veces.Pero esto no significa que el SEO esté muerto. Aún puedes obtener clics de esta palabra clave y, de todos modos, Google sólo muestra respuestas en los resultados de búsqueda para algunas palabras clave.La verdad es que mientras los motores de búsqueda sigan existiendo, se utilicen y muestren resultados orgánicos en los que puedas influir de alguna manera, el SEO no ha muerto.2. El SEO es algo que se hace una sola vezEl SEO es un poco como ir al gimnasio. Está bien perderse un entrenamiento de vez en cuando, pero las cosas pronto comienzan a desmoronarse si te quedas en casa comiendo papas fritas con mucha frecuencia. (Créeme, lo sé.)Así es como se ve cuando comienzas a descuidar tu SEO:Antes de este período, estaba optimizando activamente el sitio. Luego, lo descuidé y puse mi atención en otras cosas. Puedes ver que el tráfico disminuyó lentamente durante los meses siguientes.Hay varias razones por las que esto puede suceder:Tus competidores te superan (trabajando constantemente en su SEO).Empiezas a perder backlinks debido a ‘enlaces podridos’.Tu contenido pierde “frescura” (más sobre esto en breve).Es por eso que la mayoría de los profesionales de SEO (74,71%) cobran un anticipo mensual por sus servicios, en lugar de una tarifa por hora o una tarifa única. Saben que el SEO es un proceso continuo y que sus clientes necesitan invertir a largo plazo para ver resultados.¿Es esto cierto para absolutamente todos los sitios? No. Hay casos raros en los que un sitio puede ser descuidado durante años y continuar atrayendo tráfico constante mes tras mes.Aquí hay un ejemplo:Se actualizó por última vez en 2011, pero aún genera un estimado de ~500 visitas orgánicas mensuales.3. Google sólo posiciona el contenido ‘fresco’Republicar contenido es algo que hacemos mucho. Si filtramos los posts republicados del blog en Content Explorer de Ahrefs, vemos que hay 136 posts republicados desde 2016.Entonces, ¿por qué estamos invirtiendo tanto esfuerzo en mantener nuestro contenido actualizado si la frescura es un mito?La ‘frescura’ es un factor de posicionamiento dependiente de la consulta. Eso significa que es más importante para algunas consultas que para otras. Todo depende de si la frescura del contenido tiene algún impacto en la calidad del contenido.El SEO evoluciona continuamente, por lo que la frescura es importante para muchas consultas relacionadas con el SEO.Por ejemplo, esto es lo que sucedió cuando no actualizamos nuestra lista de las principales búsquedas de Google durante meses:Puedes ver que el tráfico estuvo disminuyendo durante meses, pero luego se recuperó casi de la noche a la mañana cuando la actualizamos y la volvimos a publicar. Esto se debe a que las principales búsquedas de Google cambian todo el tiempo, por lo que la gente espera resultados “nuevos”.Por otro lado, la frescura no importa particularmente para una consulta como “cómo atar una corbata” - how to tie a tie- porque el proceso nunca cambia. Es por eso que Google está muy contento de posicionar en el top 3 páginas que se actualizaron por última vez en 2013.4. Las palabras clave long tail son más fáciles de posicionarLa mayoría de la gente piensa que las palabras clave long tail constan de muchas palabras, pero esto no es del todo exacto. Las palabras clave long tail, o de cola larga, son consultas con volúmenes de búsqueda individuales bajos. No importa la cantidad de palabras.Por ejemplo, ambas consultas debajo son palabras clave long tail:Pero aquí está la cuestión: aunque las long tail obtienen pocas búsquedas mensuales, generalmente no son más fáciles de posicionar que sus contrapartes más populares.Por ejemplo, observa las puntuaciones de Keyword Difficulty para estas palabras clave:A pesar de la considerable diferencia en los volúmenes de búsqueda mensuales, las puntuaciones son aproximadamente las mismas. Esto se debe a que la consulta de bajo volumen es lo que nos gusta llamar una “palabra clave long tail de soporte”. En otras palabras, es una forma menos popular de buscar un tema popular.Por lo general, no es más fácil posicionarse para estas long tails porque Google clasifica principalmente el mismo conjunto de resultados que para la palabra clave ‘principal’.Ahora, para ser justos, hay otro tipo de palabras clave long tail que tiende a ser más fácil de posicionar. Nos gusta llamar a estas “long tails temáticas”. Puedes aprender sobre ellas en nuestra guía completa de palabras clave long tail.5. El contenido duplicado te traerá penalizacionesEl contenido duplicado es aquel donde contenido exacto o casi duplicado aparece en más de un lugar. Puede estar en el mismo sitio web o en varios sitios.Por ejemplo, estas dos URLs te llevan al mismo post de blog:https://buffer.com/library/social-media-manager-checklist/https://buffer.com/resources/social-media-manager-checklist/Google ha dicho en numerosas ocasiones que no hay penalización por contenido duplicado, pero este mito todavía se vende al olvido con regularidad.Sin embargo, si bien el contenido duplicado no te penalizará, puede causar problemas de SEO como:URLs no deseadas o no amigables en los resultados de búsqueda;Dilución de backlinks;Crawl budget desperdiciado;Contenido sindicado o “scrapeado” que se posiciona mejor que tú.Si te preocupa que puedas tener contenido duplicado en tu sitio, ejecuta un rastreo con Site Audit de Ahrefs y verifica el reporte de Contenido duplicado. Si ves grupos de duplicados cercanos o exactos, puede valer la pena solucionar los problemas.Aprende a hacer eso en nuestra guía sobre contenido duplicado para principiantes.6. Las señales sociales ayudan con el posicionamientoNo es descabellado suponer que cuanto más se comparte tu contenido en sitios como Facebook, Twitter y Pinterest, mejor se posicionará. Después de todo, si montones de personas comparten algo, debe ser interesante y valioso y digno de ser posicionado, ¿verdad?Quizás, pero según John Mueller de Google, las señales en redes sociales no impactan directamente en los rankings.https://www.youtube.com/watch?v=WszvyRune14#t=1192Probablemente se deba a que las señales sociales son tremendamente fáciles de manipular. En serio, echa un vistazo a Fiverr. Puedes obtener miles de ellos por unos pocos dólares.Pero si esto es cierto, ¿por qué muchos estudios muestran una correlación entre los shares sociales y las posiciones?Eje X: Posición del SitioEje Y: Número promedio de shares, comentarios y likes en Sitios de Redes SocialesNo hay una razón definitiva para esto, pero creemos que estos son los dos factores contribuyentes más importantes:Más shares conducen a una mayor exposición, y eso a menudo conduce a más backlinks (que son un factor de posicionamiento).Las páginas que se clasifican bien en Google obtienen más tráfico, y algunas de esas personas compartirán el contenido en las redes sociales.7. El PPC no puede ayudarte a posicionarte más altoSeamos claros: pagar a Google por los anuncios no influirá directamente en los rankings. Me encantan las teorías de la conspiración tanto como a cualquier otra persona, pero Google no te va a posicionar más alto porque estés llenando sus bolsillos.Sin embargo, eso no significa que el PPC no pueda indirectamente ayudarte a posicionarte más alto.Y eso se debe a que los anuncios PPC pueden ayudar a atraer backlinks.¿No nos crees? Recientemente gastamos $1,246 dólares en anuncios de Google con la intención de crear enlaces a uno de nuestros posts. ¿El resultado? Backlinks de once nuevos sitios web.Ahora bien, esto no significa que puedas ejecutar cualquier campaña de PPC y ver cómo se acumulan los backlinks. Debe ser algo estratégico.Aprende cómo lo hicimos en este video:https://www.youtube.com/watch?v=Uz2bGhdnJN08. El PageRank ya no es relevanteEl PageRank es la base de Google. Analiza la cantidad y calidad de los backlinks para juzgar el valor de una página.Google confirmó en 2018 que el PageRank sigue siendo un factor de posicionamiento:DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (@methode) February 9, 2017Pero desde que Google suspendió las puntuaciones públicas de PageRank en 2016, algunas personas piensan que nosotros, los SEOs, no deberíamos hablar de esta métrica:Indudablemente hay algo de mérito en este argumento. Después de todo, no tiene mucho sentido hablar de una métrica que ya no podemos ver. Pero la cuestión es que el PageRank sigue siendo una señal de clasificación, lo que significa que obtener enlaces de alta calidad hacia tus páginas web sigue siendo importante.Esto está respaldado por el hecho de que el Rating de URL (UR) de Ahrefs se correlaciona muy bien con el tráfico de búsqueda:Si no estás familiarizado con UR, es nuestra métrica de autoridad a nivel de página que funciona con principios similares, aunque no idénticos, a los de la fórmula original de PageRank de Google.9. El SEO sólo se trata de rankingsTodo el mundo quiere ocupar el primer lugar, pero eso suele ser porque suponen que el resultado número uno obtiene la mayor cantidad de tráfico. Sin embargo, esto no siempre es cierto. Nuestro estudio de 100,000 consultas de búsqueda muestra que la página que ocupa el primer lugar sólo recibe la mayor cantidad de tráfico de búsqueda el 49% de las veces.¿Por qué? Porque la mayoría de las páginas obtienen tráfico de muchas palabras clave, no sólo de una.Por ejemplo, consulta las páginas mejor posicionadas para “high protein diet”. La página en la posición dos obtiene más tráfico estimado que la página en la posición uno porque se posiciona para más palabras clave con demanda de búsqueda.La lección aquí es que es hora de dejar de atormentarse por los rankings de primer lugar y comenzar a concentrarse en el tráfico.Puedes leer más sobre cómo hacer eso aquí, pero los conceptos básicos son:Cubre tu tema con más profundidad.Construye más backlinks para aumentar la “autoridad” a nivel de página.Perfecciona la intención de búsqueda.10. El Keyword research no es importanteDado que la mayoría de las páginas se posicionan para cientos o miles de palabras clave, no es de extrañar que algunas personas piensen que el keyword research esté muerto. ¿Cuál es el punto de optimizar para una palabra clave cuando probablemente obtendrás tráfico de cientos de ellas?Esa es una lógica incorrecta porque la popularidad de una palabra clave usualmente se alinea con el potencial de tráfico de búsqueda general del tema.Por ejemplo, toma estas dos palabras clave:La segunda palabra clave tiene la mitad del volumen de búsqueda que la primera. Y si miramos el tráfico estimado a cada una de las páginas mejor posicionadas, vemos que la página posicionada para la keyword con mayor volumen obtiene mucho más tráfico orgánico.Nota al margen. El volumen de búsquedas suele ser un buen indicador del potencial de tráfico, pero no siempre. Tim explica más aquí.El Keyword research también ayuda a garantizar que estés optimizando para la forma más popular de buscar un tema. Eso es importante si deseas atraer el mayor tráfico orgánico posible a tu página.Lee nuestra guía completa de keyword research para obtener más información sobre la investigación de palabras clave adecuada.Reflexiones finales¿Es esta una lista extensa de mitos del SEO? Para nada. Estos son simplemente algunos de los más comunes con los que me encuentro una y otra vez, por lo que es útil acabar con ellos.¿Olvidé otros mitos frustrantes? Avísame en Twitter.Tra­duci­do por Prime Web Méx­i­co. Lle­ga a nuevos clientes todos los días con tu sitio web. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "10 Mitos del SEO que Deberías Ignorar"
    },
    {
      "level": "H2",
      "text": "1. El SEO ha muerto"
    },
    {
      "level": "H2",
      "text": "2. El SEO es algo que se hace una sola vez"
    },
    {
      "level": "H2",
      "text": "3. Google sólo posiciona el contenido ‘fresco’"
    },
    {
      "level": "H2",
      "text": "4.  Las palabras clave long tail son más fáciles de posicionar"
    },
    {
      "level": "H2",
      "text": "5. El contenido duplicado te traerá penalizaciones"
    },
    {
      "level": "H2",
      "text": "6. Las señales sociales ayudan con el posicionamiento"
    },
    {
      "level": "H2",
      "text": "7. El PPC no puede ayudarte a posicionarte más alto"
    },
    {
      "level": "H2",
      "text": "8. El PageRank ya no es relevante"
    },
    {
      "level": "H2",
      "text": "9. El SEO sólo se trata de rankings"
    },
    {
      "level": "H2",
      "text": "10. El Keyword research no es importante"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}