{
  "url": "https://ahrefs.com/blog/es/motores-de-busqueda-alternativos/",
  "slug": "motores-de-busqueda-alternativos",
  "title": "13 buscadores alternativos a Google centrados en la privacidad",
  "description": "Hay demasiadas alternativas a Google, pero ¿merecen la pena? Hemos investigado algunos buscadores alternativos populares que protegen la privacidad de sus usuarios. Te mostramos los buscadores que pasaron la nota de corte.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Hay demasiadas alternativas a Google, pero ¿qué buscadores merecen la pena?Para responder a esta pregunta hemos investigado algunos buscadores alternativos populares. Nuestro principal criterio de valoración es el compromiso de cada buscador con la protección de los datos y la privacidad de los usuarios.Estos son los buscadores que pasaron la nota de corte:Contenido1. StartpageStartpage es exactamente igual que Google pero sin el tracking. Según este buscador, con sede en los Países Bajos, las consultas de búsqueda se anonimizan antes de extraer los resultados de búsqueda de Google. Esto significa que se elimina toda la información de identificación, incluida la dirección IP. Tampoco se utilizan cookies de seguimiento.Startpage también cumple con la normativa de protección de datos de la Unión Europea, RGPD. Sin embargo, es importante saber que los Países Bajos forman parte de la alianza de inteligencia Nine Eyes, que comparte datos de vigilancia masiva con ocho países.DestacadoLa función “Vista anónima” te permite visitar sitios web de tus resultados de búsqueda de forma anónima tanto para escritorio como para móvil. En esencia, se comporta como una VPN (gratuita).2. DuckDuckGoDuckDuckGo es sin duda el buscador privado más conocido y la antítesis de Google en lo que respecta a la privacidad del usuario.Tu historial de búsqueda se guarda de forma no identificable. Esto significa que las cookies de seguimiento y los identificadores personales, como las direcciones IP, no se almacenan.A pesar de que los resultados de DuckDuckGo proceden de más de 400 fuentes (incluido Bing, de Microsoft), DuckDuckGo asegura a sus usuarios que no comparte con ellos ninguna información personal.Lo mismo puede decirse de DuckAssist, un nuevo tipo de InstantAnswers en las SERP de DuckDuckGo, que funciona con grandes modelos lingüísticos de OpenAI y Anthropic. DuckDuckGo afirma que no comparte ningún dato con los dos socios de contenidos.Un posible inconveniente para DuckDuckGo es que tiene su sede en Estados Unidos, donde se llevan a cabo programas de vigilancia masiva como PRISM. (Estados Unidos también forma parte de los Cinco Ojos).DestacadoLa función “Bangs” de DuckDuckGo te lleva directamente a resultados de búsqueda en otros sitios. Por ejemplo, si escribes “!w” y una palabra clave como “españa” (es decir, “!w españa”) te lleva directamente a la página de Wikipedia sobre España.3. Brave SearchBrave Search es un buscador que forma parte de Brave Software, que desarrolla Brave, un navegador centrado en la privacidad. Entre sus fundadores se encuentran Brendan Eich (creador de JavaScript y cofundador del navegador Mozilla Firefox) y Brian Bondy (antiguo ingeniero senior de plataformas en Mozilla).Aunque antes dependía de Google y Bing para sus SERP, ahora ha pasado a ser completamente independiente de las búsquedas. Cada resultado web es servido por su propio índice.Para mayor privacidad, puedes optar por desactivar esta opción y realizar búsquedas manuales, por ejemplo, “cosas que hacer en [ubicación]”.Un dato a tener en cuenta: En 2020 pillaron a Brave añadiendo automáticamente enlaces de afiliados a URL de criptodivisas. Te dejo a ti decidir si realmente cometió un error y si ha rehabilitado su reputación.DestacadoAl igual que Bing y Google Bard, Brave cuenta con una nueva función de IA (“Resumidor”) que proporciona respuestas concisas y directas.4. SwisscowsSwisscows es un buscador con sede en Suiza que tiene su propio índice para consultas en alemán. Para el resto de idiomas, los resultados se obtienen de Bing. Esto no supone ningún problema, dado que todas las consultas de búsqueda están desprovistas de identificadores personales.El buscador también omite el uso de cookies de rastreo y de geofocalización (geo-targeting).La propuesta única de venta (USP) de Swisscows es su carácter familiar: Filtra automáticamente los resultados de búsquedas violentas y pornográficas.En cuanto a la privacidad, Suiza no forma parte de una alianza de inteligencia, pero sí cuenta con un Tratado de Asistencia Legal Mutua con Estados Unidos.DestacadoSwisscows dispone de un buscador de música basado en Soundcloud.5. MetaGerMetaGer es un metabuscador de código abierto con sede en Alemania. Sus servidores funcionan con energía renovable.Los resultados proceden de Scopia, Bing, OneNewspage y OneNewspage (Vídeo), por lo que son bastante puntuales. También puedes anular la selección de los motores de búsqueda utilizados o crear una lista negra de sitios web en la configuración.Nos gusta lo transparente que es MetaGer en el manejo de la información del usuario, desde las consultas hasta los mapas. Aun así, no está exento de advertencias: El buscador almacena tu dirección IP completa durante 96 horas, y tu nombre y dirección de correo electrónico se guardan si rellenas su formulario de contacto.Sin embargo, utiliza un proxy de anonimato que te garantiza el control total de tus datos.DestacadoEl recuadro ” ¿Sabías que…?” (a la derecha de los resultados de búsqueda) ofrece curiosidades sobre MetaGer y sobre cómo precisar las búsquedas. También puedes hacer clic en el texto para ver la lista completa de consejos.6. MojeekMojeek es un buscador basado en rastreadores con un índice de búsqueda propio de más de 6.000 millones de páginas. Esto lo convierte en un buscador ideal para obtener información imparcial. Pero también implica que los resultados pueden ser limitados, ya que no extrae resultados de otros buscadores.Fue el primer motor de búsqueda en tener una política de no rastreo. Tus datos personales nunca se venderán ni se distribuirán, lo cual es una gran ventaja para nosotros. Si has rellenado su formulario de contacto, también puedes solicitar que se elimine la información, de acuerdo con la RGPD.Dicho esto, Mojeek tiene su sede en el Reino Unido, que forma parte de la alianza de inteligencia Five Eyes.DestacadoLa función de clasificación de búsqueda basada en emociones permite introducir una palabra clave y buscar por emoción.7. QwantQwant es un buscador con sede en París cuyos resultados se basan en Bing y en su propio rastreador web. Es totalmente accesible en más de 30 países, pero no en Singapur.Qwant afirma ser privado, y dice que no rastrea tu geolocalización, no recopila datos ni utiliza cookies de seguimiento. Sin embargo, guarda tu dirección IP con fines de detección de fraudes. Además, desde 2016, Qwant comenzó a enviar datos a Microsoft Bing Ads sin el consentimiento informado de sus usuarios, algo que salió a la luz a mediados de 2021.Aunque Qwant ofrece la protección del RGPD, Francia forma parte de la alianza de inteligencia de los Cinco Ojos.DestacadoQwant ofrece una función de “mapas” sin seguimiento.8. Ecosia¿Sabías que cada acción que realizas en tu dispositivo digital emite dióxido de carbono? De hecho, Google desempeña un papel importante en ello: Es responsable de cerca del 40% de la huella de carbono de internet.Para contrarrestarlo, el buscador privado Ecosia dona el 80% de sus beneficios a proyectos de plantación de árboles. Es decir, aproximadamente un árbol por cada 45 búsquedas realizadas. También ha construido una planta solar para que sus servidores funcionen con energía limpia.Ecosia no es totalmente privado. Recoge datos de búsqueda e información personal identificable, que solo se anonimiza al cabo de siete días. Pero creemos que utilizar este motor de búsqueda merece la pena, ya que pretende luchar contra el cambio climático.DestacadoTu número de búsquedas se muestra en un marcador (a menos que elijas borrar las cookies de tu navegador), lo que te permite hacer un seguimiento de tu impacto en el medio ambiente.9. Kagi¿Por qué los buscadores tienen que rastrearte? La respuesta es sencilla: porque así ganan dinero.Las búsquedas son gratuitas, así que los buscadores tienen que ganar dinero con la publicidad. Para ofrecer mejores anuncios y ayudar a los anunciantes a llegar a los clientes de forma eficiente, los buscadores necesitan datos.Pero, ¿y si no tuviese que ser así? Kagi cree que hay una forma diferente. En lugar del modelo estándar de anuncios, Kagi ha decidido optar por un modelo de suscripción.Kagi es realmente privado: su política de privacidad es amplia y transparente. Pero, ¿se preocupa la gente lo suficiente por la privacidad y el dominio de Google como para pagar por utilizar un buscador? Kagi cree que sí. Algunas personas también lo piensan: en la última actualización, contaba con unos 2.600 suscriptores de pago.DestacadoComo la mayoría de los buscadores actuales, Kagi ofrece un resumidor basado en inteligencia artificial.10. SearXSearX es un metabuscador gratuito y de código abierto. Su principal objetivo es la privacidad, lo que significa que no comparte las direcciones IP de los usuarios, no utiliza cookies de seguimiento e incluso evita que las palabras clave de las consultas de los usuarios aparezcan en los registros del servidor.Si el usuario hace clic en un resultado de búsqueda, se le envía directamente al sitio, en lugar de un enlace de redireccionamiento rastreado como hace Google.DestacadoLa razón por la que SearX es privado es que está diseñado para que los usuarios ejecuten instancias privadas en sus propios ordenadores. Aquí está la documentación de SearX. Pero si no tienes conocimientos técnicos pero quieres proteger tu privacidad, puedes utilizar instancias públicas. Aquí tienes una lista.11. Whoogle¿Quieres utilizar Google sin todo el tracking? Prueba Whoogle.Whoogle es similar a SearX: es una instancia privada alojada en tu propio ordenador. Solo que esta vez, obtendrás los resultados de búsqueda de Google. Y los obtendrás sin anuncios, JavaScript, enlaces AMP, cookies ni seguimiento de la dirección IP.El único inconveniente al utilizar Whoogle es que necesitarás tener ciertos conocimientos técnicos. Aquí tienes la documentación de GitHub y cómo implementarlo.Teniendo esto en cuenta, está claro que no es para todo el mundo. Pero si sabes programar (y te tomas en serio la privacidad) entonces definitivamente deberías considerar Whoogle o SearX.DestacadoWhoogle ha incorporado los “Bangs” de DuckDuckGo a su búsqueda.12. YepYep es un buscador orientado a la privacidad con un modelo de reparto de ingresos 90/10: el 90% de los ingresos por publicidad se abonará directamente a los creadores. Está creado por nosotros, Ahrefs.Cuando realizas una búsqueda en Google, las SERP muestran respuestas instantáneas, instrucciones y otros tipos de contenido:El problema es que Google no crea contenidos por sí mismo. Los toma todos de páginas web y creadores de contenidos. Como resultado, Google roba clics de estos sitios web y genera ingresos por sí mismo a través de anuncios.De hecho, en un caso famoso, Google empezó a utilizar el contenido de CelebrityNetWorth para sus fragmentos destacados. El tráfico de CelebrityNetWorth disminuyó un 65% en un año y Brian Warner, su fundador, tuvo que despedir a la mitad de su plantilla.Queremos cambiar eso. No queremos un modelo de búsqueda en el que los buscadores generen más ingresos por los contenidos que los propios creadores. Por eso creamos Yep.Piénsalo como YouTube. El modelo de YouTube de pagar a los creadores ha generado todo un ecosistema de YouTubers. Así es como estamos consiguiendo contenidos de vídeo de tan alta calidad. Irónicamente, YouTube pertenece a Google, pero Google no está aplicando ese modelo a su motor de búsqueda.DestacadoYep te resume los principales resultados de búsqueda.13. PresearchSi crees en el futuro de la tecnología basada en blockchain y te interesa un buscador orientado a la privacidad, es posible que Presearch llame tu atención.Presearch es un motor de búsqueda descentralizado. En vez de utilizar un servidor central para almacenar y servir datos, el trabajo del buscador, como el rastreo, la indexación y el procesamiento de consultas, se distribuye entre los nodos. Los nodos son recompensados con el token de Presearch (PRE) por procesar los resultados de la búsqueda.Este acto de descentralización, según sus defensores, elimina la capacidad de Google de “jugar a ser Dios” y censurar o restringir los resultados de las búsquedas. Se trata de un modelo similar al de Brave, que también ofrece recompensas en forma de tokens (BAT).DestacadoSi sus resultados no te satisfacen, Presearch ofrece accesos directos a otros buscadores.Reflexiones finalesA pesar de que Google domina el mercado mundial de buscadores, ha recibido su buena ración de críticas: problemas antimonopolio, creación de filtros burbuja, infracción de la privacidad de los usuarios, etc.Para los usuarios, los buscadores alternativos pueden ser una solución. Pero no te fíes de nuestra opinión, pruébalos y decide cuál te gusta más.¿Tienes preguntas o comentarios? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "13 buscadores alternativos a Google centrados en la privacidad"
    },
    {
      "level": "H2",
      "text": "1. Startpage"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "2. DuckDuckGo"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "3. Brave Search"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "4. Swisscows"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "5. MetaGer"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "6. Mojeek"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "7. Qwant"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "8. Ecosia"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "9. Kagi"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "10. SearX"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "11. Whoogle"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "12. Yep"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "13. Presearch"
    },
    {
      "level": "H3",
      "text": "Destacado"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}