{
  "url": "https://ahrefs.com/blog/es/nofollow-ugc-sponsored/",
  "slug": "nofollow-ugc-sponsored",
  "title": "El estado de Nofollow, UGC y atributos de enlaces patrocinados en 2020 [Nueva investigación]",
  "description": "Google introdujo dos nuevos atributos de enlace en 2019: rel = ugc y rel = sponsored. ¿Las personas los usan? Para averiguarlo, estudiamos los mejores sitios de 110k de Ahrefs.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido En 2019, después de 15 años, Google cambió la forma en que funciona nofollow. Ahora es una pista tanto para gatear como para posicionar. También agregaron dos nuevos atributos, rel = “ugc” y rel = “sponsored”.Según el anuncio, nofollow está destinado a enlaces en los que no desea implicar ningún tipo de respaldo o pasar crédito de clasificación a otra página. Patrocinado funciona de la misma manera, pero también muestra que el enlace es un anuncio, una ubicación pagada, un patrocinio o un enlace afiliado. UGC (Contenido generado por el usuario) también funciona igual que nofollow, pero muestra que el enlace fue agregado por otra persona. UGC debe usarse para comentarios, publicaciones en foros o cualquier otra sección de contenido donde los usuarios puedan agregar contenido.Los nuevos atributos son opcionales. Google quiere que las personas los usen para que puedan comprender mejor los patrones de vinculación y cómo las personas se vinculan a través de la web. Pero en este momento, no tienes que hacer ningún cambio si no lo deseas.Para aquellos de vosotros que usan Ahrefs, sabreis que agregamos soporte para UGC y atributos patrocinados desde el principio. De hecho, comenzamos a recopilar datos y agregamos filtros a la herramienta dentro de los dos días posteriores al anuncio oficial. Y parece que somos los primeros en hacerlo. 💪cc: @jroakes 😉 pic.twitter.com/m4ji3X1JkN— Ahrefs (@ahrefs) September 12, 2019Dado esto y el hecho de que patrocinado y UGC son opcionales, pensamos que investigaríamos nuestros datos para ver con qué frecuencia las personas los usan. Para hacer eso, estudiamos los mejores sitios de 110k por Ahrefs Rank.¿Qué tan común es nofollow?El 10,6% de todos los vínculos de retroceso a los principales sitios de 110k no se siguen.Si bien existen razones legítimas para usar nofollow, como tenerlo en los comentarios del blog, este porcentaje es bastante alto. Esa es probablemente una de las razones por las cuales Google cambió nofollow a una pista. Vemos muchos sitios web importantes que utilizan principalmente nofollow en enlaces externos como Wikipedia, Forbes, Entrepreneur, CNN, NFL y muchos otros. Supongo que la gente estaba usando esto para evitar sanciones por vincular o tratar de conservar PageRank para su propio sitio, lo que no funciona.En el anuncio de Google, mencionaron que el texto de ancla de enlace era valioso porque describe el contenido vinculado. Con el modelo de pistas, ahora pueden usar esta información para comprender mejor los patrones de vinculación no naturales.Eso es backlinks. ¿Qué pasa con los enlaces internos?Encontramos nofollow interno en el 35,3% de los sitios que estudiamos. Constituyeron el 3.6% de todos los enlaces internos. Mientras que 3.6% no parece alto, ese número debería estar cerca de cero. Soy un SEO técnico, y no puedo pensar en un solo caso en el que usaría nofollow en mis enlaces internos. Sé que algunas personas lo hacen para esculpir el PageRank o para tratar de bloquear la indexación de páginas, que solía funcionar con páginas no vinculadas desde ningún otro lado, pero nunca fue una excelente manera de evitar la indexación. Si estaba usando nofollow para bloquear el indexado de páginas, tiene algunas opciones mejores.¿Las personas usan UGC y atributos patrocinados?Apenas. Solo el 0.44% de los dominios de referencia a los principales sitios de 110k usan rel = “ugc”, y es aún más bajo con rel = “sponsored” visto en solo el 0.01% de los dominios de referencia. En cuanto al número total de vínculos de retroceso que contienen los atributos, solo el 0.016% contiene rel = “ugc” y solo el 0.008% contiene rel = “sponsored”.Esto no fue inesperado ya que los nuevos atributos son opcionales. La mayoría de los sitios solo usan nofollow.¿Las personas usan los atributos en los enlaces internos?También queríamos ver cómo las personas usaban estos atributos de enlace en los enlaces internos de sus sitios. Cuando ejecutamos esto, esperaba algún uso de nofollow, pero no esperaba ver UGC o sponsored en los datos.El 3,1% de los sitios estudiados usaban rel = “ugc” en enlaces internos, y eso cae al 0,14% para rel = “sponsored”. Para el total de enlaces internos que contienen los atributos, 0.0002% contenía rel = “ugc” y 0.0016% contenía rel = “sponsored”.Tiene sentido que UGC aparezca en enlaces internos. Al agregar esto a escala, muchos desarrolladores o complementos probablemente lo agreguen automáticamente a las secciones de comentarios o secciones de contenido generadas por los usuarios donde las personas aún pueden vincular a otras páginas en el sitio.Ejemplo de un enlace interno conrel=“ugc”.Sin embargo, el patrocinio que apareció en los datos me sorprendió. ¿Por qué alguien pagaría por tener un enlace interno en su propio sitio web? Creo que la mayoría de los casos de patrocinio en enlaces internos son errores del usuario, pero es posible que algunos sitios lo agreguen automáticamente para publicaciones de invitados o publicitarios.¿Adoptarán las personas estos nuevos atributos?Cuando se lanzó nofollow, había muchos socios de otros motores de búsqueda, plataformas de blogs y sistemas CMS que ayudaron a impulsar la adopción del nuevo atributo. Todos querían deshacerse de los comentarios de spam, y las plataformas estaban felices de usar nofollow. Con UGC y sponsored sin tener ningún beneficio real o consecuencias, no espero que veamos una adopción generalizada.Queríamos ver si podíamos encontrar algún patrón en los sitios usando los nuevos atributos. Pensamos que los sitios web individuales no adoptarían los atributos, pero tal vez algunos sistemas CMS o complementos agregarían soporte.Observamos el CMS utilizado en 7.130 de los sitios. Estos son los totales de los sitios identificados:WordPress es el obviamente destaca aquií. WordPress agregó soporte para UGC en la versión 5.3, y descubrimos que algunos de los complementos han agregado soporte para patrocinado. Eso representa la mayoría de la adopción hasta ahora. También verifiqué la base de código de Tiki Wiki, pero no encontré ninguna mención de los atributos, por lo que es probable que esos pocos sitios sean únicos como muchos otros porque no hay indicios de una adopción generalizada en las plataformas.ConclusionesNofollow se usa mucho más de lo que esperaba, potencialmente demasiado. Con el cambio de Google a un modelo de pista, espero que los resultados de búsqueda sean aún más relevantes, ya que pueden usar más señales del texto de anclaje de enlaces nofollow. Sin ningún tipo de adopción forzada, UGC y los atributos patrocinados probablemente requerirán diferentes sistemas para adoptarlos antes de verlos volverse comunes.¿Tiene preguntas sobre nofollow, UGC, patrocinado o su uso? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "El estado de Nofollow, UGC y atributos de enlaces patrocinados en 2020 [Nueva investigación]"
    },
    {
      "level": "H2",
      "text": "¿Qué tan común es nofollow?"
    },
    {
      "level": "H2",
      "text": "¿Las personas usan UGC y atributos patrocinados?"
    },
    {
      "level": "H2",
      "text": "¿Las personas usan los atributos en los enlaces internos?"
    },
    {
      "level": "H2",
      "text": "¿Adoptarán las personas estos nuevos atributos?"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Patrick Stox"
}