{
  "url": "https://ahrefs.com/blog/es/objetivos-seo/",
  "slug": "objetivos-seo",
  "title": "Cómo Establecer los Objetivos SEO Correctos con 3 Ejemplos",
  "description": "Los objetivos SEO son metas específicas y medibles que intentas conseguir en un período de tiempo.",
  "content": "Kayle Larkin Estratega SEM data driven. Dedicada a hacer la analítica fácil de entender y accesible a propietarios/as de empresas. Contenido Como SEOs, tendemos a generalizar los objetivos porque hay mucho fuera de nuestro control. “No podemos prometer resultados”.El problema es que sin una visión clara de qué es una victoria, es improbable que consigamos algún resultado.Lo mismo pasa si establecemos objetivos vagos y arbitrarios.En esta guía aprenderás cómo establecer los objetivos SEO adecuados usando la pirámide de objetivos SEO.Qué son los objetivos SEOPor qué los objetivos SEO son importantesCómo establecer objetivos SEO3 ejemplos de objetivos SEO¿Qué son los objetivos SEO?Los objetivos SEO son metas específicas y medibles que intentas conseguir en un período de tiempo. Cada objetivo debería contribuir al propósito del SEO: llegar a más usuarios a través de la búsqueda orgánica y convertirlos en clientes.¿Por qué son importantes los objetivos SEO?Los objetivos SEO son importantes porque aportan foco y claridad a tu estrategia al ofrecer una meta clara. Si no tienes objetivos SEO, disparas en la oscuridad. Eso nunca es una buena idea porque es improbable que consigas algo a no ser que apuntes en esa dirección.Cómo establecer objetivos SEOLos marketeros cometen a menudo el error de establecer objetivos SEO arbitrarios como “conseguir más tráfico”. El principal problema con este tipo de meta es que desestima por completo el qué y el cómo. ¿Qué vas a hacer para que suceda? ¿Cómo vas a llegar ahí?Para ayudarte a resolver este problema, hemos creado la pirámide de objetivos SEO:Aquí tienes cómo usarla: Crea un resultado objetivo. Esto es lo que quieres conseguir y el marco temporal en el que quieres hacerlo. Piensa en esto como si fuera un torneo que intentas ganar. Divide el resultado objetivo en objetivos de rendimiento. Son objetivos más pequeños que contribuyen al objetivo. Piensa en ellos como si fueran los goles en un partido de fútbol. Cada uno te ayuda a ganar el partido. Divide los objetivos de rendimiento en objetivos de proceso. Son objetivos incluso más pequeños que están 100% dentro de tu control. Siguiendo con la analogía de fútbol, esto es con quién vas a jugar y dónde.La idea es dividir las cosas en peldaños para hacer que tu objetivo general sea más alcanzable. A medida que completas los objetivos de proceso, te posicionas bien para alcanzar los objetivos de rendimiento. A medida que completas tus objetivos de rendimiento, es más probable que alcances tu resultado objetivo.Echemos un vistazo más de cerca a lo que supone cada paso y creemos nuestro primer marco.1. Crea un resultado objetivoTu resultado objetivo debería alinear directamente tus esfuerzos SEO con los objetivos de tu empresa, así que pregúntate:¿Qué resultado SEO contribuye a los objetivos más generales de la empresa?Mirar la misión corporativa, las preguntas que se hacen de forma frecuente en reuniones, etc. puede ayudar a responder esto. Si te atascas, pregunta a tu jefe o cliente.Sea lo que sea que hagas, no caigas en la trampa de decir “conseguir más tráfico”. Aunque conseguir más tráfico puede ayudar a la empresa a conseguir sus objetivos, es demasiado general. Tu resultado objetivo tiene que ser SMART: específico, medible, alcanzable, relevante y con un plazo en el tiempo.Así que un objetivo mejor que “conseguir más tráfico” sería “posicionar en el top 3 para [palabra clave de alto valor] en 6 meses”.Este objetivo es específico y relevante porque posicionar en [palabra clave de alto valor] incrementará los ingresos. Es medible porque puedes realizar seguimiento del posicionamiento con cualquier herramienta buena de rank tracking (seguimiento de posicionamiento), como el Rank Tracker de Ahrefs. Es alcanzable porque ya has evaluado la dificultad de la keyword. Y tiene un tiempo determinado porque has especificado el marco temporalAquí tienes una visualización de nuestra pirámide de objetivos SEO hasta ahora:2. Establece objetivo(s) de rendimientoLos objetivos de rendimiento son los postes que te pones, así que empieza por responder la pregunta:¿Qué victorias en el corto plazo nos llevarán más probablemente a nuestro resultado objetivo?Puedes tener uno o varios objetivos de rendimiento. Lo que son dependerá de tu objetivo de rendimiento y capacidad de ejecución. Simplemente ten cuidado de no caer en la misma trampa de poner objetivos arbitrarios como “conseguir backlinks”. Esto te puede ayudar a conseguir tu resultado, pero no es SMART. No hay forma de saber cuando o si has alcanzado el objetivo.Siguiendo con nuestro ejemplo de resultado objetivo de “posicionar en el top 3 para [palabra clave de alto valor] en 6 meses”, un objetivo SMART de rendimiento puede ser “conseguir 40 backlinks de alta calidad a la página en el plazo de seis meses”.Es específico porque estamos apuntando a cierto número de backlinks.Es medible usando el gráfico de dominios de referencia en Site Explorer de Ahrefs:Es alcanzable porque es realista. Hay tareas dentro de nuestro control que nos acercarán un paso más a conseguir este objetivo. Es relevante porque sabemos que los backlinks son un factor de posicionamiento y hay evidencia de que nuestra página objetivo está dando resultados por debajo de lo que debería en lo que se refiere a backlinks.Tiene base temporal porque está establecido un punto final de seis meses para alinearnos con nuestro resultado objetivo.Más importante, alcanzar este objetivo de rendimiento ayudará a que tengamos una buena posición para conseguir nuestro resultado objetivo.Aquí va una visualización de la pirámide de objetivos SEO hasta ahora:Nota al margen. Si tienes que establecer +4 objetivos de rendimiento para tu resultado deseado es una señal de que tu resultado objetivo es demasiado general y poco realista. Vuelve al paso uno y establece un objetivo más realista. 3. Establece objetivo(s) de procesoLos objetivos de proceso son acciones medibles que están 100% bajo tu control. Es donde respondes a la pregunta:¿Qué necesitaré hacer para conseguir nuestro(s) resultado(s) objetivo? Siguiendo con nuestro ejemplo, tenemos un resultado objetivo de posicionarnos en el top 3 para la palabra clave “x” dentro de seis meses. Y tenemos un resultado objetivo de conseguir 40 backlinks de alta calidad a la página.¿Qué tendremos que hacer para conseguir 40 backlinks de alta calidad a la página en seis meses?Pongamos que planificamos hacer una campaña “rascacielos” (skyscraper en inglés). Si conseguimos una tasa de conversión del 5% de media con nuestros emails de contacto, podemos trabajar hacia atrás para crear un objetivo de proceso que nos pondrá en una posición excelente para conseguir nuestro objetivo de rendimiento.Vamos a hacer las cuentas:40 backlinks / 5% tasa de conversión media = 800 emails800 emails / 6 meses = ~133 emails/mesAsí que nuestro objetivo de proceso es enviar 133 emails de contacto “rascacielos” al mes durante seis meses.Aquí va una visualización de nuestra pirámide de objetivos SEO hasta ahora:Nota al margen. Al igual que con los objetivos de rendimiento, puedes crear varios objetivos de proceso. Por ejemplo, puede que te cueste encontrar suficientes prospectos de rascacielos para enviar 1.200 emails. En ese caso podrías añadir otra táctica de link building a la mezcla, como link building de página de recursos y establecer eso como otro objetivo de proceso.3 ejemplos de objetivos SEOYa que tus objetivos SEO deberían alinearse con los objetivos de la empresa, no puedo precisar qué objetivos SEO establecer. Tu industria, cómo de establecida esté tu marca y la competitividad de tu nicho son factores que entran en la ecuación—entre otras cosas.Pero lo que puedo hacer es recorrer unos pocos ejemplos más para que te sientas cómodo usando el marco de objetivos SEO.Incrementar la cuota de voz orgánica un 20% en 12 mesesIncrementar tasa de vinculación orgánica un 10% en 6 mesesAlcanzar 10.000$ en ventas a partir del tráfico orgánico en el mes 6Ejemplo de objetivo SEO #1: Incrementar la cuota de voz orgánica un 20% en 12 mesesLa optimización para motores de búsqueda es una forma de marketing altamente competitiva. En esencia, todos rivalizamos por un punto (y atención) dentro de un campo de espacio limitado.Puede que escuches a tus jefes o clientes diciendo, “simplemente aplasta a la competencia”.¿Qué quiere decir esto? ¿Cómo se consigue? ¿Qué determina si tenemos o no éxito?“Aplasta a la competencia” es demasiado genérico.Usando el marco de objetivos SEO puedes convertir “machaca a la competencia” en un objetivo específico, medible.El primer paso es alinear los esfuerzos SEO con los objetivos de la empresa. ¿Qué resultado contribuye al objetivo más general de la empresa de “aplastar a la competencia”? En este caso, algo como “incrementar la cuota de voz orgánica en un 20% en 12 meses” sería un objetivo de resultado SMART.Es específico porque especificamos un porcentaje en un marco temporal—no un objetivo abierto.Es medible usando el informe de Competitors Overview (vista general de competidores) en Ahrefs’ Rank Tracker.Es alcanzable porque un 20% en 12 meses está lejos de una propuesta de “castillos en el aire”.Es relevante para los objetivos de la empresa porque es esencialmente la visibilidad en búsqueda orgánica de nuestro sitio comparada con la de nuestros competidores.Y tiene base temporal porque hemos especificado un marco temporal.Ahora, el segundo paso: establecer objetivos de rendimiento.Recuerda, este debería ser también un objetivo SMART. Para mantener las cosas sencillas, estableceremos solo uno: “ganar 50 fragmentos destacados para palabras clave de alto volumen en seguimiento en 12 meses”.Los fragmentos destacados son piezas de información que generalmente se muestran en la parte superior de los resultados de búsqueda. Conseguir más fragmentos destacados es una forma sencilla de recibir más visibilidad y clicks en las SERP.Aquí va cómo encontrar las mejores oportunidades de fragmentos destacados:Ve al Rank Tracker de AhrefsElige tu proyectoElige el informe de Overview (vista general)Filtra por palabras clave con fragmentos destacados en las que no posicionasFiltra por palabras clave donde posiciones en los puestos 2-5Ordena las palabras clave por volumen de tráfico de más alto a más bajoEstás ya en la recta final. El tercer y último paso es dividir el/los objetivo(s) de rendimiento en objetivos de proceso esquematizando el cómo.Ya que a menudo es posible ganar fragmentos destacados con un simple cambio on-page (en la página), un objetivo de proceso sería “hacer cambios on-page en 50 páginas para incrementar nuestras posibilidades de ganar el fragmento”. Podemos medir el progreso realizando seguimiento del número de fragmentos destacados que tenemos en Rank Tracker de Ahrefs:Aquí va nuestra pirámide de objetivos SEO completa:Lecturas complementariasCómo optimizar para los fragmentos destacados de Google¿Qué es Share of Voice? Cómo medirlo en todos los canalesEjemplo de objetivo SEO #2: Incrementar tasa de vinculación orgánica un 10% en 6 mesesPuede que estés pensando que la vinculación del usuario es una métrica CRO. Pero, recuerda, la Guía de SEO para principiantes del propio Google dice “cualquier optimización debería estar dirigida a mejorar la experiencia del usuario”.Históricamente, los SEO han medido la vinculación usando la tasa de rebote y el tiempo en página. Estas son métricas pobres porque a menudo no se alinean con el comportamiento del usuario.Por ejemplo, digamos que te sientas a leer un post de ~2.000 palabras. Esta web dice que incluso un lector lento lo completaría en 20 minutos. Si cierras el navegador tan pronto como terminas, esa sesión contaría técnicamente como rebote.Por suerte, Google Analytics 4 tiene una métrica más robusta que podemos usar para medir la UX (User Experience oexperiencia de usuario): el porcentaje de interacciones.El porcentaje de interacciones (engagement rate) mide de forma más precisa si un usuario interactuó con tu web o se fue, así que un buen objetivo de resultado sería “incrementar el porcentaje de interacciones orgánicas un 10% en 6 meses”.Es específica porque especifica un porcentaje y marco temporalEs medible usando el informe de Adquisición de Usuarios en GA4:Es alcanzable porque hay cosas dentro de nuestro control que podemos cambiar para impactar esta métrica.Es relevante porque queremos mejorar la UX, y el porcentaje de interacciones mide esto de forma más precisa que la tasa de rebote o el tiempo en página.Tiene base temporal porque especificamos un marco temporal (6 meses).Ahora a por el/los objetivo(s) de rendimiento.Vamos a mantener las cosas sencillas una vez más y establecer solo uno, “incrementar el número de scrolls de usuarios únicos en un 30% en las páginas que tengan poco scroll y un alto valor para nuestra empresa”.Para encontrar las páginas donde necesitamos mejorar la UX, podemos comprobar el informe de páginas y pantallas con interacción en GA4, filtrar por usuarios orgánicos y ver la tabla por scroll de usuarios únicos.Dado nuestro objetivo de rendimiento, nuestro objetivo de proceso puede ser reescribir párrafos introductorios en las páginas de bajo scroll para que más gente se interese por el artículo y se quede para leerlo. Una vez más, esto se puede medir de forma manual.Ejemplo de objetivo SEO #3: Alcanzar 10.000$ en ventas a partir del tráfico orgánico en el mes 6Ganar más dinero es el objetivo final del SEO. Para tener las mejores probabilidades de que esto pase, necesitamos convertir el objetivo vago de “ganar más dinero” en un resultado SMART como “alcanzar 10.000$ en ventas a partir de tráfico orgánico en el mes 6”.Este objetivo es específico porque hemos especificado la cantidad y el marco temporal.Es fácilmente medible con Google Analytics.Es alcanzable porque nuestro sitio hipotético no es particularmente estacional y ya está generando ~9.000$/mes en ventas desde orgánico—así que es solo un incremento del ~11%.Nota al margen. Un buen resultado objetivo tiene que ser tanto motivante como realista. Al establecer un objetivo basado en ventas ten en cuenta el histórico anterior de ventas del canal orgánico y tendencias estacionales que estén por venir.Es relevante porque, una vez más, ganar más dinero es el objetivo final del SEO.Tiene base temporal porque hemos especificado un marco temporal.Ahora para el plan de juego, objetivo(s) de rendimiento:Manteniendo las cosas sencillas y estableciendo solo un objetivo de resultado de nuevo, iremos a por “incrementar el tráfico orgánico en páginas de alto valor en un 20% en 6 meses”.Nota al margen. Estableciendo un marco temporal y porcentaje aquí puede volverse un poco complicado. Esencialmente necesitas trabajar hacia atrás desde los “top ventas” que elijas y averiguar cuánto más tendrías que vender para alcanzar tu objetivo de ventas, cuál es tu relación de ​​compra-detalle (o buy-to-detail en inglés) y el incremento de tráfico propuesto para alcanzar el objetivo de ventas. La forma más fácil de encontrar “páginas de alto valor” es preguntar qué productos son los más beneficiosos para la empresa. Considera el coste de producción, coste de envío, tasa de devoluciones, etc.Medir si cumplimos nuestro objetivo de rendimiento es bastante fácil en Google Analytics. Simplemente dirígete a Comportamiento > Todas las Páginas, compara períodos, segmenta por tráfico orgánico y mira a la métricas de Entradas:Finalmente, objetivo(s) de proceso…No puedo resumir exactamente cuáles serán los objetivos de proceso ya que variarán en función del tipo de producto o servicio, intención de búsqueda, recursos de negocio, etc.Aquí van unos pocos ejemplos de objetivos de proceso accionables que pueden ayudar a incrementar el tráfico orgánico:Escribe schema de productos para páginas objetivoOptimiza productos en un feed de productos orgánicoOptimiza todas las imágenes en las páginas objetivoYa que los objetivos de proceso son tareas que tú o tu equipo realiza, completar el objetivo se mide de forma manual mediante tu gestión de proyectos con tu estilo personal.Por ejemplo, si el objetivo de proceso es optimizar todas las imágenes en cada página de alto valor, comprobaríamos manualmente que cada imagen tiene un nombre de archivo optimizado, texto alt descriptivo y cumple los requisitos de tamaño de archivo. Aquí va nuestro marco de trabajo de objetivos SEO completo para este ejemplo:Reflexiones finalesEstablecer objetivos SEO puede parecer una tarea imposible, pero un marco de trabajo sólido es todo lo que necesitas para empezar.Si te mantienes en el camino adecuado y completas tus tareas de proceso, tienes una buena oportunidad de alcanzar tus objetivos de rendimiento. Cuando alcances tus objetivos de rendimiento, estás en muy buena posición para alcanzar tu resultado objetivo.El éxito está en los detalles.¿Alguna pregunta? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que analiza herramientas y tendencias en marketing y software y acaba de lanzar la una newsletter que no te puedes perder con software e ideas para hacer crecer tu negocio. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Establecer los Objetivos SEO Correctos con 3 Ejemplos"
    },
    {
      "level": "H2",
      "text": "¿Qué son los objetivos SEO?"
    },
    {
      "level": "H2",
      "text": "¿Por qué son importantes los objetivos SEO?"
    },
    {
      "level": "H2",
      "text": "Cómo establecer objetivos SEO"
    },
    {
      "level": "H3",
      "text": "1. Crea un resultado objetivo"
    },
    {
      "level": "H3",
      "text": "2. Establece objetivo(s) de rendimiento"
    },
    {
      "level": "H3",
      "text": "3. Establece objetivo(s) de proceso"
    },
    {
      "level": "H2",
      "text": "3 ejemplos de objetivos SEO"
    },
    {
      "level": "H3",
      "text": "Ejemplo de objetivo SEO #1: Incrementar la cuota de voz orgánica un 20% en 12 meses"
    },
    {
      "level": "H3",
      "text": "Ejemplo de objetivo SEO #2: Incrementar tasa de vinculación orgánica un 10% en 6 meses"
    },
    {
      "level": "H3",
      "text": "Ejemplo de objetivo SEO #3: Alcanzar 10.000$ en ventas a partir del tráfico orgánico en el mes 6"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Kayle Larkin"
}