{
  "url": "https://ahrefs.com/blog/es/planificador-palabras-clave-google/",
  "slug": "planificador-palabras-clave-google",
  "title": "Cómo utilizar Google Keyword Planner en 2023",
  "description": "Google Keyword Planner es una herramienta de búsqueda de palabras clave para anunciantes. Pero también se puede utilizar para encontrar palabras clave para SEO. Incluso puede mostrarte las palabras clave que persiguen tus competidores.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Google Keyword Planner es una herramienta de búsqueda de palabras clave para anunciantes. Pero también se puede utilizar para encontrar palabras clave para SEO. Incluso puede mostrarte las palabras clave que persiguen tus competidores.En esta guía vas a aprender a sacarle el jugo SEO al Google Keyword Planner.Paso 1. Consigue acceso a Google Keyword PlannerGoogle Keyword Planner es gratuito. Lo único que necesitas para usarlo es una cuenta de Google Ads.Para crear una cuenta, entra en ads.google.com, haz clic en “Empezar ahora” y accede a tu cuenta de Google.A continuación, haz clic en el enlace azul “Cambiar al modo experto”.A continuación, haz clic en el enlace que sale en pequeño “Crear una cuenta sin una campaña”.En la siguiente pantalla, introduce el país de facturación, la zona horaria y la moneda, y haz clic en “Enviar”.En la pantalla de confirmación que aparece a continuación, haz clic en “Explorar cuenta”.En la barra de menús de arriba, haz clic en Herramientas y configuración > Planificación > Planificador de palabras clave.Paso 2. Descubre nuevas palabras claveSi quieres ver los volúmenes de búsqueda y las métricas de una lista existente de palabras clave, haz clic en “Consulta el volumen de búsquedas y las previsiones”. Si no, haz clic en “Descubre nuevas palabras clave” para encontrar nuevas ideas de palabras clave.Hay dos formas de descubrir nuevas palabras clave:Comenzar con ideas: Introduce hasta 10 palabras o frases relacionadas con tu negocio.Empezar con una web o una página web: Introduce una URL y elige si quieres sugerencias de palabras clave basadas en todo el sitio o solo en esa página.Por ejemplo, si introducimos palabras clave relacionadas con el SEO, obtenemos 849 ideas de palabras clave.Una cantidad bastante baja si la comparamos con el número de ideas de palabras clave que obtendríamos con una herramienta de investigación de palabras clave de terceros como Keywords Explorer de Ahrefs.Pero lo bueno de Google Keyword Planner es que genera ideas relacionadas que no contienen los términos introducidos.Por ejemplo, estas son algunas ideas que obtenemos si introducimos “SEO” como idea inicial:Por lo general, en las herramientas convencionales de búsqueda de palabras clave habría que introducir más ideas para encontrar palabras clave de este tipo.Paso 3. Busca las mejores ideas de palabras claveNo tiene sentido intentar posicionarse con palabras clave irrelevantes. El mejor punto de partida es filtrar aquellas palabras clave que no tengan sentido.Por ejemplo, supongamos que buscas ideas de palabras clave relacionadas con camisetas para un ecommerce de ropa.Si introduces “camiseta” como idea inicial, verás un montón de palabras clave relacionadas con la marca:Esto está bien si vendes camisetas de estas marcas. Si no, no tiene sentido.Por suerte, Google Keyword Planner hace que refinar las ideas sea muy fácil. Basta con hacer clic en “Afinar palabras clave” en la parte superior derecha para incluir o excluir rápidamente palabras clave por atributos como marca, color y estilo.Por ejemplo, puedes filtrar fácilmente las palabras clave que mencionan marcas que no vendes.Nota al margen.Esta función no funciona si iniciaste la búsqueda de palabras clave con una web o URL.Si todavía sigues viendo muchas palabras clave irrelevantes, utiliza el filtro de palabras clave “no contiene” para excluirlas.A partir de aquí, solo hay que buscar entre las ideas las palabras clave que puedan tener sentido.Estas son algunas ideas y formas de hacerlo:Encuentra long-tails de baja competenciaLas palabras clave long-tail son palabras clave que reciben pocas búsquedas mensuales. Por ello, suelen ser más fáciles de posicionar que las populares.El Keyword Planner no muestra el número exacto de búsquedas mensuales de las palabras clave, pero sí muestra el rango medio mensual. Por lo tanto, puedes encontrar fácilmente palabras clave long-tail ordenando las ideas por búsquedas mensuales medias de menor a mayor.Por ejemplo, si hacemos esto para la palabra clave semilla “bicicleta electrica”, vemos muchas ideas con 100 – 1.000 búsquedas mensuales, incluyendo “trek electrica” y “scott electrica”.Sin embargo, no todas ellas son necesariamente fáciles de posicionar.Por desgracia, Google Keyword Planner no puede ayudar a averiguarlo porque su métrica de “competencia” no tiene nada que ver con la competencia en la búsqueda orgánica. Es el nivel de competencia en los anuncios de Google, por lo que no conviene prestarle atención.Por el contrario, te recomendamos que introduzcas tus ideas de palabras clave en una herramienta de terceros, como nuestro comprobador gratuito de dificultad de palabras clave (KD). Esta herramienta calcula la dificultad de aparecer en la primera página de Google en una escala de 0 a 100.Si hacemos esto con “trek electrica”, veremos que tiene una puntuación KD de 0.Al igual que “scott electrica”.Otro factor a tener en cuenta a la hora de elegir palabras clave es su potencial de tráfico. El método más sencillo es introducir la página mejor posicionada con la palabra clave en el Site Explorer o en nuestro comprobador de tráfico gratuito.Si utilizamos este método para la página mejor posicionada con “scott electrica”, veremos que recibe unas 4.000 búsquedas mensuales. Por tanto, está claro que tiene potencial de tráfico.Busca las palabras clave de modaGoogle Keyword Planner tiene una métrica de cambio interanual. Muestra el cambio en las tendencias de búsqueda entre el último mes y el mismo mes del año anterior.Puedes encontrar temas desglosados si ordenas las ideas de palabras clave por esta columna de mayor a menor.Por ejemplo, si introducimos “bicicleta electrica” como palabra clave semilla, veremos que “orbea electrica doble suspension” tiene un incremento interanual del 900%.Si gestionas una web de afiliados, es una forma muy buena de encontrar productos que merezcan la pena recomendar.Encuentra palabras clave estacionalesGoogle Keyword Planner también tiene una métrica de “cambio en tres meses”. Muestra el cambio en las tendencias de búsqueda entre el último mes y los dos meses anteriores.Puedes encontrar temas estacionales si ordenas las ideas de palabras clave de mayor a menor.Por ejemplo, si una vez más utilizamos “bicicleta electrica” como semilla, vemos que “bicicleta eléctrica worten” tiene un incremento de +900% en tres meses.Introduzcamos “abrigo” como semilla. Vemos que muchos términos relacionados con los abrigos han experimentado un aumento reciente en las búsquedas. Tiene sentido dado que en España estamos en invierno en este momento que estoy escribiendo estas palabras.Encuentra palabras clave lucrativasGoogle Keyword Planner tiene una columna para “Puja por la parte superior de la página (intervalo alto)”. Como señala Google, esta columna “muestra el intervalo de precios más alto que los anunciantes han invertido previamente en la puja por la parte superior de la página de una palabra clave en función de tu ubicación y de los ajustes de la Red de Búsqueda”.Ahora bien, los anunciantes no tienen nada que ver con el SEO. Pero es lógico suponer que si están dispuestos a pagar mucho por los clics de una palabra clave, ésta debe tener valor comercial. En ese caso, merece la pena intentar posicionarse orgánicamente.Por ejemplo, si ordenamos nuestras ideas de palabras clave de bicicleta eléctrica por “Puja por la parte superior de la página” de mayor a menor, nos podemos hacer una idea de las palabras clave que quizá merezcan nuestra atención.Extra: trucos y consejos del Google Keyword PlannerAhora que ya conoces los aspectos básicos del uso del Google Keyword Planner, veamos algunos trucos y consejos que la mayoría de los SEO no conocen.1. Desbloquear volúmenes de búsqueda exactosUno de los aspectos más frustrantes del Keyword Planner es la aversión de Google a mostrar los volúmenes de búsqueda exactos. Es la razón por la que muchos SEOs ya no utilizan la herramienta.Por ejemplo, estas dos palabras clave tienen un volumen de búsqueda de entre 1.000 y 10.000, y 100 – 1.000:Pero si comprobamos estas dos palabras clave en el Keywords Explorer de Ahrefs, vemos que “agencia seo” recibe 5.900 búsquedas, algo muy distinto a 1.000 o 10.000.Por suerte, existe un truco para desbloquear volúmenes de búsqueda más precisos (aunque no es perfecto) en Google Keyword Planner.El proceso es el siguiente:Dirígete a la pestaña PrevisiónHaz clic para añadir palabras claveIntroduce tus palabras clave entre corchetes (esto especifica la concordancia exacta)Haz clic en GuardarElige el CPC máximo en el gráficoPresta atención a la columna “Impresiones”. En ella se indica el número estimado de impresiones que obtendría tu anuncio durante el mes siguiente si lo pusieras en marcha con las palabras clave seleccionadas.Dado que el valor de la puja es tan alto, estas impresiones deberían aproximarse al volumen de búsqueda mensual de esa palabra clave.Utilicemos el Keywords Explorer de Ahrefs para comprobar la exactitud de estas cifras.Parece que en este caso no ha acertado del todo, pero se ha acercado bastante.IMPORTANTEDespués de haber experimentado con este truco durante un tiempo, parece ser más preciso cuando se investigan palabras clave con intención comercial. Es posible que esto se deba a que es menos probable que Google muestre anuncios para consultas informativas, por lo que los datos de impresión no son exactos. Ten en cuenta que las herramientas de terceros, como el Keywords Explorer, suelen ser más fiables.2. Consulta el volumen de búsquedas localesLa mayoría de las herramientas de búsqueda de palabras clave no indican cuántas personas buscan un término en comunidades autónomas o ciudades concretas. Solamente muestran los volúmenes de búsqueda de todo el país, lo que podría ser mejor para el SEO local.Sin embargo, en Google Keyword Planner basta con cambiar la ubicación a otro país, comunidad o ciudad para ver los rangos de volumen locales.Por ejemplo, se estima que hay entre 10.000 y 100.000 búsquedas mensuales de “fontanero” en España:Pero si cambiamos la ubicación a Galicia el rango cambia a solo 1.000 - 10.000:También podemos combinarlo con el truco anterior del volumen exacto para obtener estimaciones más precisas en áreas locales.Por ejemplo, supongamos que aumentamos al máximo nuestra oferta para “fontanero” en Galicia. En ese caso, obtendríamos una estimación de 3.764 impresiones mensuales de nuestro anuncio.3. Ver los lugares de búsqueda más popularesGoogle Keyword Planner también puede mostrar las ubicaciones de búsqueda más populares para cualquier término. Simplemente baja hasta el final de la pestaña Previsiones de tus palabras clave.Por ejemplo, el 52% de las impresiones de “Real Madrid” proceden de Brasil.Pero se puede profundizar aún más. Sabiendo que la mayoría de las búsquedas proceden de Brasil, se puede establecer Brasil como ubicación en el filtro de ubicación. Ahora el cuadro Ubicaciones mostrará los principales estados.Si se profundiza aún más y se fija la ubicación en un estado, se verán las ciudades/poblaciones más importantes.De hecho, si estableces tu ubicación en una ciudad, te dirá incluso los códigos postales más populares.IMPORTANTEEsto se basa en las previsiones de impresiones de anuncios, por lo que hay que ser prudente con los resultados. Si lo que buscas es un desglose por países de los volúmenes de búsqueda, el Keywords Explorer te ofrece datos más precisos.4. Descubre qué dispositivos utilizan los usuariosSiempre es una buena práctica asegurarse de que el contenido está optimizado para móviles, ya que la facilidad de su uso ha sido un factor de posicionamiento durante años. Pero sigue siendo más importante para algunos temas que para otros.Después de todo, si hay poca gente que busca tu tema en el móvil, no tienes que estresarte demasiado por optimizar perfectamente el contenido para mobile.Supongamos, por ejemplo, que añadimos la palabra clave “palabras clave seo” a nuestro plan de palabras clave y comprobamos la pestaña “Previsiones”. Vemos que el 96,1% de las impresiones se producen en ordenadores, no en móviles ni tablets.Con esta información, probablemente no merezca la pena preocuparse demasiado por facilitar la lectura de las capturas de pantalla del post en el móvil, sobre todo si ello va a perjudicar la experiencia en un equipo de sobremesa (desktop).Ejemplo de un artículo en su versión mobile, la imagen funciona mejor en su versión desktop.Sin embargo, con algunas palabras clave ocurre lo contrario.Por ejemplo, el 82,5% de las impresiones de “mejor restaurante barcelona” se producen en móviles.Lo cual tiene sentido. Lo más probable es que la gente que busque esta palabra en Google esté buscando un buen restaurante para comer cuando están por ahí. Así que, si tienes un restaurante local y quieres posicionarte con esta palabra clave y otras relacionadas, optimizar tu contenido para móviles es una prioridad.Reflexiones finalesGoogle Keyword Planner es una herramienta poderosa que merece la pena incorporar al flujo de trabajo de investigación de palabras clave. Ofrece información valiosa que no puedes obtener con otras herramientas.Pero tiene sus limitaciones: la falta de volúmenes de búsqueda fiables es una de las principales.Ahora bien, si esto es lo que buscas, lo mejor es invertir en una herramienta profesional de búsqueda de palabras clave como el Keywords Explorer de Ahrefs. Esta herramienta muestra los volúmenes de búsqueda precisos para todas las palabras claves y otras métricas útiles como la Dificultad de palabras clave (KD) y el Tráfico potencial (TP).¿Tienes preguntas? Contáctanos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo utilizar Google Keyword Planner en 2023"
    },
    {
      "level": "H2",
      "text": "Paso 1. Consigue acceso a Google Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Paso 2. Descubre nuevas palabras clave"
    },
    {
      "level": "H2",
      "text": "Paso 3. Busca las mejores ideas de palabras clave"
    },
    {
      "level": "H3",
      "text": "Encuentra long-tails de baja competencia"
    },
    {
      "level": "H3",
      "text": "Busca las palabras clave de moda"
    },
    {
      "level": "H3",
      "text": "Encuentra palabras clave estacionales"
    },
    {
      "level": "H3",
      "text": "Encuentra palabras clave lucrativas"
    },
    {
      "level": "H2",
      "text": "Extra: trucos y consejos del Google Keyword Planner"
    },
    {
      "level": "H3",
      "text": "1. Desbloquear volúmenes de búsqueda exactos"
    },
    {
      "level": "H3",
      "text": "2. Consulta el volumen de búsquedas locales"
    },
    {
      "level": "H3",
      "text": "3. Ver los lugares de búsqueda más populares"
    },
    {
      "level": "H3",
      "text": "4. Descubre qué dispositivos utilizan los usuarios"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}