{
  "url": "https://ahrefs.com/blog/es/plan-de-marketing/",
  "slug": "plan-de-marketing",
  "title": "El plan de marketing de una página increíblemente sencillo",
  "description": "El plan de marketing anual sencillo para ejecutar tu estrategia de marketing que incluye una plantilla gratuita.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Toda empresa necesita un plan de marketing. Ayuda a guiar tus esfuerzos de marketing y te mantiene en el camino para alcanzar tus objetivos de marketing El problema es que crear uno puede ser complicado, realmente complicado.No es tan grave si estás familiarizado con la jerga del marketing y los acrónimos como DAFO y KPI. Pero si nunca has creado uno antes y quieres ponerte en marcha, puede parecer que necesitas un MBA en Marketing sólo para empezar.Por eso hemos creado el plan de marketing de una sola página.En breve aprenderás a rellenarlo, pero antes vamos a asegurarnos de que entendemos lo básico…¿Qué es un plan de marketing?Plan de marketing vs. estrategia vs. táctica vs. objetivosCómo crear un plan de marketing¿Qué es un plan de marketing?Un plan de marketing es una hoja de ruta para ejecutar tu estrategia de marketing durante un periodo de tiempo determinado, normalmente un año.¿Cual es la diferencia entre un plan de marketing, estrategia, tácticas y objetivo?A pesar de que mucha gente utiliza estos términos como sinónimos, son cosas muy diferentes.He aquí la forma más sencilla de explicarlos:Objetivo: lo que se quiere conseguir.Estrategia: cómo lo harás.Táctica: los métodos que utilizarás.Plan: todo lo que se ha planeado para que puedas actuar.Por ejemplo, imagina que quieres ir de Londres a París con un presupuesto. El objetivo, la estrategia, la táctica y el plan podrían ser algo así:Objetivo: Ir de Londres a París por menos de 100 dólares.Estrategia: Utilizar el transporte público.Tácticas: Autobús, metro y Eurostar.Plan: Coger el autobús hasta la estación de metro, coger el metro hasta St Pancras, coger el Eurostar hasta París.Puedes ver que sería difícil ejecutar tu estrategia sin el plan porque no sabrías si coger primero el tren, el tranvía o el metro. El plan explica cómo encaja todo para que puedas actuar.Lo mismo ocurre con el marketing. Tu plan de marketing explica cómo encajan tus tácticas de marketing para ejecutar tu estrategia de marketing y alcanzar tus objetivos de marketing.Cómo crear un plan de marketing de una páginaEmpieza por hacer una copia de la plantilla del plan de marketing. Verás que todo gira en torno a la respuesta a cuatro sencillas preguntas. Vamos a ver cómo responderlas.Pregunta 1: ¿A quién te diriges?Si estás creando un plan de marketing, ya debería haber realizado tu investigación de mercado y desarrollado la estrategia de marketing. Y eso significa que ya deberías tener una idea bastante clara de a quién te diriges. Sin embargo, es útil reiterar esto en su plan de marketing para mantenerse centrado y en el camino.Por ejemplo, si estuviéramos elaborando un plan de marketing para Ahrefs, podríamos poner:Profesionales de SEO y propietarios de sitios web que quieren conseguir más tráfico para su página.Esta es una versión muy simplificada de a quién nos dirigimos, pero es suficiente para ponernos en la dirección correcta.Pregunta 2: ¿Cuáles son tus objetivos?No estás creando un plan de marketing por gusto. Lo creas para planificar cómo vas a lograr (con suerte) algunos objetivos de marketing. Por lo tanto, tienes que definir cuáles son esos objetivos.Pueden ser prácticamente cualquier cosa, pero lo ideal es que sean SMART.Desgraciadamente, esta es una pieza de la jerga de marketing que tenemos que abordar, pero es bastante sencilla y sólo significa que sus objetivos deben ser:Específicos: deben indicar claramente el resultado deseado.Medibles: deben ser algo de lo que se pueda hacer un seguimiento del éxito.Alcanzables: deben ser realistas.Relevantes: deben estar alineados con los objetivos generales de la empresa.Temporales: deben tener un marco temporal o plazo de entregaPor ejemplo, este es un mal objetivo de marketing:Aumentar el tráfico orgánicoEste es uno bueno:Aumentar la visibilidad de la búsqueda orgánica en España, México y Colombia, del 3 al 6% en los próximos 12 meses.Sólo este último es SMART. El primero es demasiado vago, no tiene un marco temporal y no es medible. La segunda, en cambio, es específica, tiene un plazo de 12 meses y es fácilmente medible en el Rastreador de posicionamiento de Ahrefs:En general, es mejor tener algunos objetivos, pero no demasiados. Si son pocos, no conseguirás mucho y si son muchos corres el riesgo de abarcar demasiado y perder el foco.Si te cuesta definir los objetivos de marketing relevantes para tu empresa, puedes inspirarte en los ejemplos de nuestra guía para establecer objetivos de marketing.Pregunta 3. ¿Cómo vas a conseguir tus objetivos?Colocar los pilares es fácil, pero levantar el puente es difícil. Por eso, ahora tienes que ser más específico y pensar en las tácticas que utilizarás para alcanzar tus objetivos de marketing dentro del tiempo y coste estimados.Recuerda que tus tácticas deben estar siempre alineadas con tus objetivos y estrategia de marketing. No las saques de la nada ni optes por tácticas nuevas y brillantes. Considera las tácticas que se ajusten mejor a tu estrategia de marketing y parte de ahí.Por ejemplo, nuestra estrategia de marketing es bastante simple en su esencia:Ayudar a nuestro público objetivo a resolver sus problemas de SEO y marketing con la ayuda de nuestras herramientas, creando contenido informativo y útil sobre los temas que buscan.Dado que la estrategia siempre debe dictar las tácticas que se utilizan, está claro porque cualquier táctica que utilicemos estará relacionada con el contenido. Esto también queda claro en el objetivo que nos marcamos en el apartado anterior:Aumentar la visibilidad de la búsqueda orgánica en Estados Unidos del 3% al 6% en los próximos 12 meses.Entonces, ¿qué tácticas debemos utilizar para lograr este objetivo?Teniendo en cuenta el objetivo en sí, en realidad sólo podemos hacer una cosa: SEO. Sin embargo, si realmente queremos crear un plan de marketing accionable para nosotros, tenemos que ser más específicos.Aquí es donde se necesita un poco de investigación…Si nos desplazamos hasta nuestras palabras clave rastreadas en Rastreador de posicionamiento y las ordenamos por tráfico estimado, podemos ver las palabras clave en las que nuestra visibilidad de búsqueda es baja o inexistente:Para mejorar nuestra visibilidad en la búsqueda orgánica para estas palabras clave, hay algunas tácticas que podríamos utilizar. Sin embargo, para simplificar las cosas, digamos que reescribir las publicaciones que se dirigen a ellas parece la táctica más viable.Supongamos también que no tenemos la mano de obra para reescribir todos estos posts, así que nos centraremos en las oportunidades más fáciles. Probablemente se trate de las entradas que se dirigen a palabras clave de gran volumen y que actualmente posicionan bien, pero no en primera página de Google.Así es como puedes filtrar estas palabras clave en el Rastreador de Posicionamiento:Ahora, parece que algunas de esas palabras clave (“etiquetas de youtube”, “qué es https”, etc.) no se ajustan especialmente bien a nuestro público objetivo de propietarios de sitios web, así que las excluiremos.Esto nos deja con alrededor de 80 palabras clave, lo que equivale a 80 entradas para reescribir.A continuación, tenemos que calcular cuánto nos va a costar todo esto.Este es un paso crucial que no debes descuidar, ya que no tiene sentido crear un plan de marketing que sea un brindis al sol. Tiene que ser realista, factible, y las cifras deben estar basadas en algo (no sacadas de la nada).Dado que realizamos la reescritura de contenidos en nuestra empresa, lo más lógico es basar las estimaciones de costes en el tiempo que creemos que le llevará a nuestro equipo (y en lo que les pagamos).Para simplificar las cosas, digamos que los números son los siguientesTiempo de reescritura: 20 horas.Coste por hora: 20 dólaresNúmero de reescrituras: 80Basándonos en estas cifras, parece que nos costará unos 32.000 dólares y 1.600 horas de trabajo ejecutar esta táctica. Puede parecer mucho, pero es menos que las horas de trabajo anuales de un empleado a tiempo completo.Repite este proceso tantas veces como sea necesario para crear una lista de tácticas que utilizarás para alcanzar tus objetivos de marketing.Más información: 16 tácticas de marketing que funcionan en 2021IMPORTANTESi trabajas con un presupuesto de marketing específico, no caigas en la tentación de “hacer que todo encaje” asignando y reasignando al azar el presupuesto entre las tácticas. El presupuesto de cada táctica debe tener sentido. Si las tácticas propuestas acaban costando más que el presupuesto asignado, significa que simplemente no tienes suficiente dinero para alcanzar todos tus objetivos. En ese caso, deberás recortar los objetivos menos importantes hasta que las tácticas propuestas y el presupuesto se ajusten.Pregunta 4. ¿Cuándo lo harás todo?Los planes de marketing cubren un periodo de tiempo específico, por lo que podría parecer que la respuesta a esta pregunta es obvia. Si estás creando un plan de marketing de 12 meses, entonces las tácticas que has considerado en el paso anterior deben llevarse a cabo en ese plazo.Aunque esto es cierto, tener simplemente una lista de cosas que hacer en el transcurso de un año no es muy factible. Es mejor dividir las tareas en partes manejables para poder seguir el progreso a lo largo del año.El desglose depende de ti, pero un plan trimestral es un buen punto de partida.Esto es lo que podría parecer para nuestra táctica de reescribir las 80 entradas del blog con bajo rendimiento:1er trimestre2º Trimestre3er trimestre4º trimestreReescribir 20 entradas en el blog de bajo rendimientoReescribir 20 entradas en el blog de bajo rendimientoReescribir 20 entradas en el blog de bajo rendimientoReescribir 20 entradas en el blog de bajo rendimientoAunque dividir el horizonte temporal por trimestre puede parecer un cambio pequeño e insignificante, en realidad esto supone que podemos revisar nuestro progreso cada tres meses para mantener las cosas en orden. Por ejemplo, si descubrimos que solo se han reescrito 10 posts después del primer trimestre, entonces es probable que tengamos que intervenir y optimizar los flujos de trabajo para asegurar que cumplimos nuestros objetivos a final de año.Planificar las tácticas de forma trimestral también ayuda a asignar los recursos de forma más eficiente.Por ejemplo, digamos que una de nuestras tácticas de marketing era actualizar un montón de entradas del blog en el cuarto trimestre para maximizar el tráfico de las búsquedas en 2022. Nuestro equipo de contenidos se vería bastante abrumado si también tuviera que reescribir 20 posts de bajo rendimiento en el mismo trimestre, por lo que este sería con probabilidad un mejor plan:1er trimestre2º Trimestre3er trimestre4º trimestreReescribir 25 entradas en el blog de bajo rendimientoReescribir 25 entradas en el blog de bajo rendimientoReescribir 25 entradas en el blog de bajo rendimientoReescribir 5 entradas en el blog de bajo rendimientoActualiar 10 entradas del blog en 2022Incluso puedes considerar la posibilidad de codificar por colores tu plan trimestral para mostrar qué equipo es responsable de cada tarea. Así será más fácil detectar cuándo los equipos están sobrecargados y planificar en consecuencia.Reflexiones finalesDado que la mayoría de los planes de marketing constan de docenas o incluso cientos de páginas, nuestro plan de una página está muy simplificado. Pero de eso se trata. te ayudará a plasmar lo básico en el papel lo más rápido posible sin tener que lidiar con la interminable jerga de marketing y sus acrónimos. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "El plan de marketing de una página increíblemente sencillo"
    },
    {
      "level": "H2",
      "text": "¿Qué es un plan de marketing?"
    },
    {
      "level": "H2",
      "text": "¿Cual es la diferencia entre un plan de marketing, estrategia, tácticas y objetivo?"
    },
    {
      "level": "H2",
      "text": "Cómo crear un plan de marketing de una página"
    },
    {
      "level": "H3",
      "text": "Pregunta 1: ¿A quién te diriges?"
    },
    {
      "level": "H3",
      "text": "Pregunta 2: ¿Cuáles son tus objetivos?"
    },
    {
      "level": "H3",
      "text": "Pregunta 3. ¿Cómo vas a conseguir tus objetivos?"
    },
    {
      "level": "H3",
      "text": "Pregunta 4. ¿Cuándo lo harás todo?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}