{
  "url": "https://ahrefs.com/blog/es/plantilla-informe-seo/",
  "slug": "plantilla-informe-seo",
  "title": "Roba nuestra plantilla de informe SEO (inspirada por expertos en SEO)",
  "description": "¿No estás seguro de cómo crear el informe SEO perfecto? Roba nuestra plantilla de informe SEO y mejórala a medida que la revisamos diapositiva a diapositiva.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido ¿Cómo puedes detectar al momento la diferencia entre un SEO bueno y uno malo?Miras sus informes de SEO.Los malos informes SEO – Los clientes se pierden en datos inútiles, no saben qué trabajo se ha hecho y no reciben ningún comentario que arroje luz sobre lo que está pasando.Los buenos informes SEO – Los clientes ven resúmenes con los datos principales e información fácil de entender, así como una visión general del trabajo realizado.He visto muchos informes SEO de consultores, equipos internos y agencias. Los he debatido con expertos de nuestra comunidad Ahrefs Insider. ¿La conclusión? No puedes crear una plantilla de informe SEO que cubra todo lo necesario sin conocer al cliente, su negocio y tus responsabilidades en el proyecto.Pero lo que tengo aquí para ti es lo más cerca que se puede estar de un informe SEO perfecto. Esa es la razón principal por la que empecé debatiendo sobre informes SEO con expertos en primer lugar.Antes de que robes nuestra plantilla de informe SEO gratuita, vamos a aprender lo siguiente:Qué es un informe SEOQué debería contener un informe SEOCuánto se tarda en crear unoVamos allá.¿Qué es un informe SEO?Un informe SEO es una vista general de métricas SEO importantes que reflejan el crecimiento del negocio, el rendimiento en los motores de búsqueda, la fortaleza del portfolio de enlaces y la salud del sitio.Es el recurso principal para tus clientes, responsables o jefes que hace un seguimiento del progreso de tu trabajo y su impacto. Después de todo, estos grupos de interés quieren ver que el dinero que gastan en ti está bien gastado.Y aunque no puedes ganar con el SEO cada mes, un informe efectivo SEO debería dejar claro que tu trabajo probablemente va a tener un ROI positivo a largo plazo.Esto nos lleva a…¿Qué debería incluir un informe SEO?Sobre qué y cómo informes de tus esfuerzos SEO depende de cómo establezcas las expectativas con tu cliente. Aunque los informes SEO dependen del tipo de negocio del cliente, esto es en general lo que todo el mundo quiere ver:KPI SEO – Evaluar métricas SEO que están fuertemente vinculadas al crecimiento de ingresos.Progreso en los rankings – Ver cómo el posicionamiento de las principales palabras clave ha evolucionado.Progreso del tráfico orgánico – Comprobar cómo los aspectos anteriores se traducen en cifras absolutas de tráfico.Crecimiento en enlaces – Ver nuevas páginas de valor de referencia que lleven tráfico o pasen valor de enlace.Salud SEO – Saber que el sitio web está bien desde el punto de vista del SEO técnico.Pero tu trabajo no termina simplemente soltando unas cuantas métricas en un documento. Necesitas interpretarlas. Tus informes SEO deberían transmitir el impacto de tu trabajo de la forma más sucinta y coherente posible. Así es como también hemos hecho la plantilla.Ahora, volvamos a las expectativas creadas entre tú y tu cliente. El informe debería sobre todo contener lo que previamente se haya acordado. Si envías un informe SEO sin educar de antemano al cliente recibirás muchas preguntas y peticiones de más datos. Incluso aunque el informe esté perfecto. Eso pasa porque el experto SEO eres tú, no el cliente.Explicaré todas las métricas usadas y los datos a medida que pasemos por las diapositivas. Pero te recomiendo encarecidamente que eches un vistazo a nuestros artículos sobre KPI SEO y métricas SEO que de verdad importan. Ayudarán a que tú y tus clientes estéis en la misma página.¿Cuánto se tarda en crear el informe?Según lo que he oído, una persona experta en SEO puede dedicar desde 30 minutos a varias horas al mes en cada informe SEO. Esto depende de varios factores:Tus responsabilidades en el proyectoLa complejidad del proyectoTu experiencia y conocimiento sobre SEOTu experiencia y conocimientos en análisis de datosEl formato del informe que tus clientes y tú prefiráisPermite que desarrolle el último punto. Parece que la mayoría de los SEO prefieren usar los tradicionales PDF y presentaciones para los informes:SEO Reporting Polls for upcoming article/presentation (Please RT) 👇 1) What format do you use for your recurrent SEO reports to non-technical clients/boss/decision makers?…— Aleyda Solis 🕊️ (@aleyda) November 12, 2021Nuestra plantilla de informe SEO también está en formato presentación porque es el más fácil de usar y leer para todo el mundo. La parte negativa es que tienes que revisar los nuevos datos todos los meses y actualizarlos a mano.Algunos marketeros especializados prefieren usar paneles de datos automatizados como Google Data Studio, Tableau o Power BI. Puede que lleven mucho tiempo de configuración inicial, pero se pueden actualizar todos los datos automáticamente, lo que permite ahorrar tiempo a largo plazo. Si te estás preguntando por esta opción, vamos a sacar un conector de Ahrefs para GDS pronto para ayudarte con eso.Pero volviendo a la plantilla…Roba nuestra plantilla de informe SEO (y mejórala)Como expliqué antes, nuestra plantilla de informe SEO (o cualquier otra) no es una solución para todo el mundo. Solo es un gran punto de partida para crear el informe SEO que tus clientes apreciarán.Para hacer esto desde el principio al final, necesitarás las siguientes herramientas:Google SlidesAhrefsGoogle Search ConsoleGoogle Analytics (o una alternativa)Skitch (o una aplicación similar para tomar y editar capturas de pantalla)¿Listo?Haz clic aquí para hacer una copia de la plantilla de informe SEO.Puedes cambiar los códigos de color por los de la marca de tu cliente, añadir tu propia marca, hacerlo más bonito o cualquier cosa que te apetezca.Antes de empezar a explicar el razonamiento que hay detrás de cada diapositiva, permite que destaque algunas cosas.En primer lugar, no dudes en ajustar las diapositivas para que se adecúen a las necesidades de tu cliente, así como a tu oferta de servicio. Hemos creado este informe SEO para cubrir todas las áreas del SEO en un informe mensual.En segundo lugar, el tipo de negocio para el que estás haciendo SEO debería quedar reflejado en los ajustes que hagas al informe.Si haces SEO local probablemente incluyas una vista general de los ranking locales y los fragmentos en páginas de resultados locales. ¿Cliente de e-commerce? Puede que te interese incluir el valor del pedido medio del tráfico orgánico y profundizar en el lado técnico de las cosas.Y, finalmente, ten en cuenta que la plantilla contiene en su mayor parte datos, información y escenarios inventados. No intentes analizar su contenido. En lugar de eso, usa su estructura como guía.Vamos a empezar.1. TítuloLa primera diapositiva es la parte más fácil de crear. Añade la fecha/mes del informe, tu logo, así como la URL del sitio web del cliente. Una vez que estén completos, ya puedes empezar.Es hora de empezar con el informe SEO de verdad.2. DestacadosUna página de destacados que resuma la información más importante del mes es una buena introducción.Básicamente, esta puede ser la primera y última diapositiva que un CMO (director de Marketing) o CEO mire. Treinta segundos después, dirán “Bien, buen trabajo” y no se preocuparán por el resto.¿Qué tipo de cosas puedes incluir aquí?Un breve resumen de tus KPI para SEO.Cosas de las que alardear.Las tareas más importantes completadas durante el período del informe.Tareas que requieren más atención.3. Vista general de los KPI SEODespués, deberías profundizar más en estos KPI SEO. Aunque la diapositiva anterior no será suficiente para la mayoría de clientes, algunos ya estarán bastante satisfechos. Se debe a que ya hemos cubierto lo más importante en las dos primeras diapositivas:Como dijimos antes, puede que quieras incluir más KPI u otros distintos, dependiendo del cliente y su tipo de negocio. La regla general es elegir métricas que estén lo más relacionadas posible con los ingresos de la empresa.Puedes ver los KPI más universales arriba: la visibilidad de búsqueda y las conversiones desde tráfico orgánico.La visibilidad en la búsqueda es la versión SEO de uno de los KPI de marketing más importantes: la cuota de voz o cuota de conversación (SOV, share of voice en inglés). Es básicamente el posicionamiento de palabras clave con esteroides.Para obtener la métrica de visibilidad de búsqueda, crea un proyecto en Rank Tracker de Ahrefs. Ahí, pega las palabras clave principales que engloban lo que tu audiencia está buscando (necesitas terminar antes tu keyword research), etiquétalas para activar el filtrado posterior y ya estará todo listo:Necesitarás encontrar la métrica de visibilidad de búsqueda en la pestaña de vista general de los competidores (competitors overview):Respecto a las conversiones orgánicas, la captura de pantalla del informe se ha tomado de un informe personalizado de Google Analytics (GA) que solo muestra la dimensión fuente/medio y conversiones elegidas para evitar toda la suciedad de los informes predeterminados. Después las conversiones se comparan mes a mes (month over month, MoM).Si los clientes de tu cliente pasan por un proceso de compra complejo, también querrás informar de las conversiones asistidas de tráfico orgánico. Puedes encontrar esto en GA en Conversiones > Embudos Multicanal > Conversiones Asistidas. De esta forma se puede completar la imagen del impacto general del SEO en el negocio.4. Progreso en los rankingsEl KPI de visibilidad general no es la única métrica de visibilidad en que los clientes están interesados. Tienen ciertas categorías de producto o temas en el blog que normalmente difieren en relevancia y valor respecto al negocio. Aquí es donde medir la visibilidad de búsqueda para los segmentos de palabras clave entra en juego.Puedes conseguir estos datos creando más etiquetas en tu proyecto de Rank Tracker de Ahrefs. Desplázate hasta tus palabras clave en la vista general, elige las que quieras etiquetar y asigna las etiquetas o crea una nueva:5. Vista general del posicionamiento de palabras clave monetizablesAunque las métricas de visibilidad de búsqueda son las mejores aproximaciones a tu crecimiento orgánico, la mayoría de clientes también quieren ver los cambios de posición de las palabras clave más importantes.Sería bastante complejo presentar los cambios de posicionamiento de posiblemente cientos de palabras clave en un informe. Deberíamos, por tanto, satisfacer al cliente solo informando de las palabras clave más importantes para el negocio, conocidas también como “money keywords” o palabras clave monetizables. Puedes incluir el resto enlazando a la hoja de cálculo exportada si el cliente quiere verlas.Una vez más, etiqueta estas palabras clave en el Rank Tracker. Puedes decidir si una palabra clave debería etiquetarse así en base a su relevancia para el negocio y CPC. O simplemente puedes revisar la lista de palabras clave con el cliente.6. Progreso de tráfico orgánico sin marcaNos ha llevado unas pocas diapositivas llegar a las métricas en las que muchos SEO y clientes ponen primero el foco: el tráfico orgánico. El motivo para mostrar esto más tarde es sencillo: que el tráfico orgánico crezca no se traduce necesariamente en crecimiento para el negocio. La web puede comenzar a posicionarse en palabras clave que lleven tráfico, pero no ingresos.La cifra general de tráfico no es en realidad una gran medida de SEO para nada. Para hacer que sea más relevante, vamos a segmentarla solo por tráfico orgánico sin marca:El motivo para mostrar aquí el tráfico sin marca es evitar atribuir cambios de tráfico orgánico a actividades de marketing no relacionadas con el SEO. Por ejemplo, si el equipo de marketing lanzó una gran campaña de PR o comenzó a emitir campañas de marketing masivas, tu tráfico orgánico subiría naturalmente solo por la gente que busca más tu marca.Para mostrar una perspectiva general más precisa del progreso del tráfico orgánico, simplemente aplica un filtro a las búsquedas en Google Search Console (GSC):Una vez más, quieres comparar el rendimiento del mes anterior con el del mes anterior e, idealmente, incluso con el anual (YoY, year-over-year). La mayoría de empresas suelen tener cambios estacionales, así que algunas comparaciones mensuales pueden parecer malas simplemente porque la temporada alta ya ha terminado.Aquí ten cuidado, GSC solo ofrece vistas y comparativas de 28 días de forma predeterminada. Así que necesitas elegir fechas personalizadas para comparar meses enteros. Recuerda comparar el mismo número de días. Veamos el escenario donde un mes tiene 31 días (por ejemplo, en un caso así, comienza la comparativa en el último día de agosto para contabilizar solo 30 días en septiembre).Tu cliente puede también recibir una cantidad de tráfico significativa desde Google Discover o Google News. Si es el caso, es probable que merezca la pena dedicarle una diapositiva específica.7. Nuevos dominios de referencia destacadosLo siguiente es el perfil de enlaces, es decir, mostrar al cliente qué cobertura nueva e interesante recibieron el mes pasado.Sin embargo, solo deberías informar de los cambios en el perfil de enlaces si tus actividades en el proyecto influyen en la adquisición de nuevos enlaces. Puede ir desde crear contenido link bait a planificar y ejecutar campañas de outreach. Menciono esto porque el link building es muchas veces una actividad separada de muchos proyectos SEO.Si eres responsable del crecimiento del perfil de enlaces, ve a Site Explorer de Ahrefs, comprueba el informe de dominios de referencia y filtra por nuevos dominios de referencia en los últimos 30 días (como puedes ver en la diapositiva).Mostramos los destacados de los nuevos dominios de referencia adquiridos, ordenados por su puntuación de Domain Rating (DR o rating de dominio) porque es una aproximación sólida y fácil de entender para mejorar el crecimiento del perfil de enlaces.Si realizas actividades de outreach o contacto y ves que se han ganado nuevos dominios de referencia gracias a eso, puedes destacarlo en la captura de pantalla para que el cliente pueda diferenciar los enlaces ganados y adquiridos.8. Progreso de link buildingEsta diapositiva está diseñada para que puedas entrar en más detalle sobre el trabajo de link building que has realizado a lo largo del mes.Puede incluir:Las páginas hacia las que has conseguido enlaces.Cualquier página nueva de referencia que destaque.El número de enlaces que esas páginas recibieron.Tus estadísticas de link building, por ejemplo, potenciales clientes que contactaron y tasa de éxito.Cualquier información que consideres relevante, es decir, excepcionalmente buena o mal contenido de link bait.El informe de crecimiento de Mejor por enlaces en Site Explorer de Ahrefs es un buen aporte para incluir aquí, porque muestra cuáles de tus páginas recibieron el mayor número de enlaces en los últimos 30 días.La verdad sea dicha, hay muchas más cosas para evaluar el link building que el número de enlaces y los DR de los dominios de referencia, aunque eso es relevante para la búsqueda de enlaces antes de lanzar las campañas de outreach, no para los informes SEO. Tus clientes no necesitan bucear en todos los matices.9. Vista general de la salud SEOAquí es donde ofrecerás una instantánea de la salud del sitio web que tenga en cuenta todos los errores y problemas SEO.Para conseguir estos datos:Ve a Site Audit de Ahrefs, configura un proyecto para la web del cliente si todavía no lo has hecho, y deja que la herramienta rastree el sitio web. Dependiendo de tus ajustes de rastreo, Site Audit, puede rastrear de nuevo el sitio web periódicamente, ofreciéndote todos los datos actuales e históricos SEO.Recibes la puntuación de salud en la vista general de la página una vez que el rastreo ha terminado:Si es tu primera vez rastreando la web, usa esta puntuación de salud como punto de partida. Solo podrás empezar a hacer referencia a las comparativas mensuales en tu segundo informe.Ahora, puede que estés pensando que una métrica no es suficiente para reflejar el estado completo del SEO técnico. Y tienes razón. Pero normalmente no vas a enviar informes SEO a desarrolladores u otros profesionales del SEO que puedan entender información más en profundidad. Por eso, la puntuación de salud es la mejor aproximación a una métrica de SEO técnico que el cliente pueda entender sin problemas.Una vez más, esto no quiere decir que no deberías informar de más métricas SEO, etc. Algunos proyectos implican sitios webs enormes y tareas de SEO técnico complejas. En casos así, es probable que el cliente se alegre de tener estadísticas de rastreo e indexación, detalles sobre los problemas más importantes, etc.10. El próximo mesDespués de mostrar a tu cliente todos los datos e informes, deberías darles un plan de las tareas SEO más importantes con las que estarás trabajando el mes siguiente.Una lista rápida de tareas para hacer que resuman tu foco principal para el mes que viene será suficiente. También servirá como anclaje para tu próximo informe SEO.Reflexiones finalesAsí que ahí lo tienes. Una plantilla de informe SEO completamente personalizable para ofrecer a tus clientes. En caso de que hayas pasado rápido por el artículo, aquí va de nuevo el enlace:Haz clic aquí para hacer una copia de la plantilla de informe SEO.Hacer informes probablemente no sea la actividad favorita de nadie. Pero es clave que hagas esto bien para tener clientes satisfechos y que paguen bien.Para resumir, quiero agradecer a todas las personas que compartieron conmigo su conocimiento sobre informes a lo largo de los años. También estoy agradecido a los miembros de Ahrefs Insider, que proactivamente pusieron todos sus conocimientos y sus informes propios a mi disposición antes de que incluso empezara a crear la plantilla. Y un agradecimiento especial a Gyorgy Bolla, el líder de search performance en Westpac, que me introdujo a los informes SEO empresariales—la única área con la que no estaba familiarizado.¿Crees que esta plantilla de informe SEO debería tener más métricas o diapositivas? ¿Tienes alguna pregunta? Escríbeme por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Colaboradores Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Colaboradores",
  "headers": [
    {
      "level": "H1",
      "text": "Roba nuestra plantilla de informe SEO (inspirada por expertos en SEO)"
    },
    {
      "level": "H2",
      "text": "¿Qué es un informe SEO?"
    },
    {
      "level": "H2",
      "text": "¿Qué debería incluir un informe SEO?"
    },
    {
      "level": "H2",
      "text": "¿Cuánto se tarda en crear el informe?"
    },
    {
      "level": "H2",
      "text": "Roba nuestra plantilla de informe SEO (y mejórala)"
    },
    {
      "level": "H3",
      "text": "1. Título"
    },
    {
      "level": "H3",
      "text": "2. Destacados"
    },
    {
      "level": "H3",
      "text": "3. Vista general de los KPI SEO"
    },
    {
      "level": "H3",
      "text": "4. Progreso en los rankings"
    },
    {
      "level": "H3",
      "text": "5. Vista general del posicionamiento de palabras clave monetizables"
    },
    {
      "level": "H3",
      "text": "6. Progreso de tráfico orgánico sin marca"
    },
    {
      "level": "H3",
      "text": "7. Nuevos dominios de referencia destacados"
    },
    {
      "level": "H3",
      "text": "8. Progreso de link building"
    },
    {
      "level": "H3",
      "text": "9. Vista general de la salud SEO"
    },
    {
      "level": "H3",
      "text": "10. El próximo mes"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek, Mateusz Makosiewicz"
}