{
  "url": "https://ahrefs.com/blog/es/precision-estimaciones-trafico-ahrefs/",
  "slug": "precision-estimaciones-trafico-ahrefs",
  "title": "¿Cómo de precisas son las estimaciones de tráfico en Ahrefs? (Nueva investigación)",
  "description": "Para responder esta pregunta realizamos un pequeño estudio para calcular la precisión de nuestras cifras de tráfico de búsqueda.",
  "content": "Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía. Contenido Uno de los casos de uso más comunes de Ahrefs es comprobar cuánto tráfico orgánico de búsqueda recibe un sitio web (o una página concreta).Casi todo el mundo sabe que las cifras de tráfico de búsqueda en Ahrefs son meras estimaciones. Pero, ¿cuánto se desvían de las cifras de tráfico reales?Decidimos realizar un pequeño estudio para averiguarlo.Qué esperar de las estimaciones de tráfico de AhrefsAntes de compartir contigo los resultados de nuestro estudio, creo que es importante que entiendas cómo se calculan las estimaciones de tráfico de Ahrefs.Aquí puedes ver en pocas palabras cómo funciona:Recopilamos todas las palabras clave por las que un sitio web se posicionaExtraemos el volumen de búsqueda mensual de cada palabra claveBuscamos la posición que ocupa esa web en el ranking de cada palabra clavePredecimos el CTR (ratio de clics sobre impresiones) para cada fragmento de búsquedaSumamos los clics de cada palabra clave y calcula la estimación de tráfico de búsqueda total¿Adivinas en qué paso comienzan las discrepancias? (Pista: en todos y cada uno de ellos). Palabras clave: Es casi imposible conocer todas las keywords por las que se posiciona un sitio web concreto. Volúmenes de búsqueda mensuales: Tampoco son especialmente precisos (aquí puedes ver nuestro estudio más reciente sobre el tema). Posición en el ranking: Las SERPs (páginas de resultados, search engine results page) son muy volátiles. Hoy, puede que tu página esté en el puesto 3; mañana, en el 4. CTR: Es increíblemente difícil predecir el CTR de una página dentro de una SERP. Hay demasiados factores a tener en cuenta: intención de búsqueda, anuncios, funcionalidades de la SERP, afinidad de la marca, etc.Como puedes imaginar, los datos que nosotros (o cualquier otra herramienta SEO) usa para calcular las estimaciones de tráfico de búsqueda tienen muchos problemas que son casi imposible de arreglar. Y estos problemas afectan de forma inevitable a la calidad de las estimaciones de tráfico que se obtienen.Aún así, incluso aunque nuestras estimaciones de tráfico puede que se desvíen de los datos reales un poco, son lo bastante buenos para ser de un valor inmenso para profesionales de marketing digital de todo tipo.Especialmente cuando entiendes cómo se calculan estos valores (algo que ya sabes) y, por tanto, puedes tener en cuenta la existencia de cierto nivel de discrepancia al usar estos datos (más sobre esto después).Dicho esto, vamos a ver por fin los resultados de nuestra investigación.¿Cómo de precisas son las estimaciones de tráfico de búsqueda de Ahrefs?Este mismo estudio está inspirado por la buena gente de AuthorityHacker. Hace poco realizaron un análisis comparando la calidad de las estimaciones de tráfico de seis herramientas SEO.En su estudio, Ahrefs resultó la herramienta ganadora (con una discrepancia media del 22.5% y una correlación del 0.99 con los datos de GSC - Google Search Console).Pero ese estudio se hizo sobre una muestra pequeña de tan solo 50 sitios web. Así que decidimos replicarlo a mayor escala para ver cómo afecta a las cifras.En nuestro estudio, tomamos 1.635 sitios web al azar y comparamos su tráfico mensual de GSC en Estados Unidos con sus estimaciones de tráfico orgánico en Ahrefs.Estudiamos los mismos dos factores:Cuánto se desvían las estimaciones de tráfico de Ahrefs de GSCCómo de consistente son nuestras estimaciones de tráfico cuándo se comparan con las de GSCDesviaciónEn nuestra muestra analiza de 1.635 sitios web, la desviación media resultó ser el 49.52%.En otras palabras, la mayor parte de las veces puedes esperar que Ahrefs te informe con cierta inexactitud del tráfico de un sitio web de Estados Unidos, hasta la mitad de su valor real. Puede parecer mucho. Pero, en realidad, el margen de nuestro error depende en gran medida del tipo de sitio web y el sector al que pertenece. Con algunos sitios web nos equivocamos por menos del 5%. Con otros, puede que nos equivoquemos en más del 1.000%.Pero, en general, nuestras estimaciones son bastante buenas: Para poner nuestra desviación mediana del 49.52% en perspectiva, también calculamos la de SEMRush y resultó ser del 68.36%.ConsistenciaEsto es a lo que se refiere la “consistencia” de las estimaciones de tráfico:Si un sitio web recibe más tráfico que otro sitio web (según los datos de GSC), esto debería seguir siendo cierto al mirar los datos de Ahrefs (independientemente de la precisión de las estimaciones).Como muchos habéis adivinado, esto se puede estudiar calculando la clásica correlación entre dos conjuntos de valores. En nuestra muestra de 1.635 sitios webs, el tráfico mensual en GSC en Estados Unidos se correlacionaba con el de Ahrefs al 0.76 (coeficiente de correlación de Pearson). Esto quiere decir que la afirmación de arriba será cierta en la gran mayoría de los casos.Nota al margen. En caso de que no estés familiarizado con las correlaciones, “1” significa que los dos conjuntos de valores están en perfecta sincronía. Y 0.76 está bastante cerca de 1.Por su parte, SEMRush tenía un 0.74 en el mismo conjunto de sitios web.Un truco para solucionar a mano la discrepanciaComo acabas de aprender, Ahrefs puede equivocarse por un margen considerable al estimar el tráfico de una web. Pero, a la vez, es muy consistente en sus estimaciones de tráfico. Más aún cuando las webs que comparas pertenecen al mismo sector.Esto quiere decir que puedes estimar mejor el tráfico de búsqueda real de tus competidores usando esta fórmula sencilla:La relación entre el tráfico de GSC y el tráfico de Ahrefs para tu propio sitio web debería ser más o menos similar a la de tus competidores (dado que estáis en el mismo nicho). Así que en general, con esta fórmula deberías llegar a un resultado bastante preciso.Para terminarEspero que esto os haya ayudado a entender lo que podéis esperar de las estimaciones de tráfico de Ahrefs y cómo solucionar el problema de la discrepancia para conseguir datos mucho más precisos.Pero, lo más importante, es que los resultados de esta investigación servirán a partir de ahora como punto de referencia a nuestro equipo de producto en nuestra búsqueda para mejorar aún más la precisión de nuestras estimaciones. Aunque sea técnicamente imposible llegar a la perfección todavía hay espacio de mejora; algo que vamos a tratar de abordar. Como siempre, si tienes cualquier comentario o duda, nos puedes escribir en nuestra cuenta de Twitter en español.P.S. Muchas gracias a Alex, de nuestro equipo de Data Science, por ayudarme con esto. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Cómo de precisas son las estimaciones de tráfico en Ahrefs? (Nueva investigación)"
    },
    {
      "level": "H2",
      "text": "Qué esperar de las estimaciones de tráfico de Ahrefs"
    },
    {
      "level": "H2",
      "text": "¿Cómo de precisas son las estimaciones de tráfico de búsqueda de Ahrefs?"
    },
    {
      "level": "H3",
      "text": "Desviación"
    },
    {
      "level": "H3",
      "text": "Consistencia"
    },
    {
      "level": "H2",
      "text": "Un truco para solucionar a mano la discrepancia"
    },
    {
      "level": "H2",
      "text": "Para terminar"
    }
  ],
  "author": "Tim Soulo"
}