{
  "url": "https://ahrefs.com/blog/es/preguntas-frecuentes-paginas-seo/",
  "slug": "preguntas-frecuentes-paginas-seo",
  "title": "SEO para páginas de preguntas frecuentes con ejemplos y prácticas recomendadas",
  "description": "Las páginas de preguntas frecuentes proporcionan contenido valioso que los usuarios quieren ver y, al mismo tiempo, contenido que Google quiere posicionar. No obstante, si se hacen mal, terminan siendo contenido inútil con preguntas poco enlazadas y respuestas a medias.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Las páginas de preguntas frecuentes (cuando se hacen bien) pueden aportar una doble ventaja: (1) Proporcionan contenido valioso que los usuarios quieren ver y (2) Contenido que Google quiere posicionar.Sin embargo, cuando las cosas se hacen con prisas, las preguntas frecuentes pueden convertirse en contenido inútil con preguntas poco enlazadas y respuestas a medias.No hagas eso. Crea páginas de preguntas frecuentes útiles para la gente y los motores de búsqueda.En esta guía aprenderás lo siguiente:Qué es una página de preguntas frecuentesCinco ejemplos (reales) de páginas de preguntas frecuentesTres formas para encontrar preguntas para tu página de preguntas frecuentesMejores prácticas para páginas de preguntas frecuentes “amigables” con el SEOCómo agregar un esquema de preguntas frecuentes en tres pasosPreguntas frecuentes sobre las preguntas frecuentes¿Qué es una página de preguntas frecuentes y por qué es útil para SEO?Una página de preguntas frecuentes es un lugar en una web donde se suele responder a las preguntas comunes relacionadas con tu nicho.Suelen ser algo así:Pero a veces algo así:Una página de preguntas frecuentes bien hecha puede ayudar a la gente en las diferentes etapas del buyer’s journey, pudiendo actuar como primer punto de contacto para los clientes potenciales.Pero, ¿qué pasa con el SEO? ¿Son beneficiosas las páginas de preguntas frecuentes?¿Son las páginas de preguntas frecuentes buenas para el SEO?Como con el 90% de las preguntas sobre SEO, la respuesta es… depende.Una página de preguntas frecuentes mal hecha con preguntas sacadas de una herramienta de palabras claves no es la mejor forma de aprovechar su potencial de SEO. Sin embargo, cuando están optimizadas para palabras clave relevantes y bien diseñadas en términos de UX, las páginas de preguntas frecuentes pueden ser muy buenas para el SEO.De hecho, el objetivo de una página de preguntas frecuentes es el mismo que el del SEO: ofrecer la mejor respuesta a una pregunta.Cinco ejemplos de páginas de preguntas frecuentesEn realidad, hay bastantes formas de mostrar las páginas de preguntas frecuentes, aunque todas tienen el mismo objetivo: responder a preguntas comunes que pueda tener un usuario y presentarlas de forma clara.En cuanto a las páginas de preguntas frecuentes para SEO, voy a dividirlas en cinco tipos diferentes:HomepagePágina de producto/servicioPágina dedicada de preguntas frecuentesPosts del blogDentro de un post del blogEchemos un vistazo a cada uno de ellos:1. Preguntas frecuentes sobre la página de inicioEsta es una de las más obvias: una sección de preguntas frecuentes en la página de inicio, normalmente justo encima del pie de página:Fuente: Cinesa.Esto no solo añade información contextual a la página de inicio, sino que también crea un espacio útil para añadir enlaces internos:Al hacer clic en el acordeón de preguntas, se abre la respuesta junto con enlaces internos a respuestas más detalladas.2. Preguntas frecuentes sobre la página de productos/serviciosEsta vez, la sección de preguntas frecuentes se añade a una página de producto o servicio:Fuente: Coches.comEstas preguntas suelen estar relacionadas con la oferta y están pensadas para reducir las solicitudes de atención al cliente.3. Página dedicada de preguntas frecuentesSi tienes muchas preguntas que responder, o simplemente quieres mantener las preguntas frecuentes separadas, puede que te interese tener una página dedicada a ellas:Fuente: Zara.Si tienes conocimientos de diseño, diseñar una página con buen gusto puede ser una buena táctica de link building, ya que la página puede recibir alguna mención en blogs de diseño:Sacado del informe de Enlaces del Site Explorer de Ahrefs.4. Entradas de blog con preguntas frecuentesPuedes hacerlo de forma sencilla y mostrar tus preguntas frecuentes en formato de entrada de blog, utilizando subtítulos para cada pregunta.Haz una investigación de palabras clave para encontrar una lista de preguntas sobre un tema (más adelante hablaremos de ello) y publica las preguntas como su propia entrada de blog “preguntas frecuentes”.Fuente: Birds&Blooms.Si buscas esta página en el Site Explorer de Ahrefs, se puede ver que no le va nada mal:Este método funciona mejor cuando tienes pocas preguntas. Si tienes mucho contenido que cubrir, quizá no tiene mucho sentido tener un blog post super largo que responda a todo.5. Sección dedicada de preguntas frecuentes al final de una postSi quieres seguir el camino de los artículos de blog (blog posts), no tienes que crear uno nuevo. Puedes añadir la sección de preguntas frecuentes a un artículo existente (si tiene sentido hacerlo, por supuesto):Fuente: Ahrefs.Hablando de agrupaciones temáticas… esta también puede ser una forma natural de añadir más enlaces internos a contenidos relacionados.Incluye una sección de preguntas frecuentes en tu artículo, responde a las preguntas brevemente y, a continuación, enlaza con artículos de apoyo en los que profundices más.Así creas una página de preguntas frecuentes que sea útil y un grupo temático al mismo tiempo.Tres formas de encontrar preguntas para tu página de preguntas frecuentesAntes de empezar a crear la página, hay que saber a qué preguntas responder. El objetivo de una página de preguntas frecuentes es ofrecer las mejores respuestas a dichass preguntas.Estos son algunos métodos para encontrar preguntas frecuentes a las que responder:1. Investiga qué preguntas hacen los usuariosAlgunas de las mejores fuentes de preguntas NO son las herramientas de palabras clave, sino las personas.Lo ideal es que sean personas de tu audiencia.Una de las formas más efectivas de investigar qué preguntas incluir es simplemente preguntando a tus clientes/usuarios/audiencia.Aquí tienes algunas cosas que puedes probar:Servicio de atención al cliente: Consulta a tus equipos de atención al cliente/ventas y pregúntales las dudas más frecuentes que plantean los clientes.Búsqueda en la web: Comprueba si tu web tiene una función de búsqueda interna. Si es así, comprueba qué tipo de cosas busca la gente.Google Search Console: Consulta las búsquedas en el GSC para ver qué frases basadas en preguntas obtienen clics.Otras preguntas de los usuarios: Compruebe las casillas “Otras preguntas de los usuarios” en las SERP.Quora y Reddit: Comprueba qué preguntas comunes se debaten en las comunidades online de tu nicho.2. Encuentra preguntas con el Keyword Explorer de AhrefsSi estás construyendo una página de preguntas frecuentes para SEO, es inevitable no hacer una investigación de palabras clave.Dirígete al Keywords Explorer de Ahrefs e introduce una palabra clave que sirva como semilla. Obviamente, tienes que elegir una que esté relacionada con el tema sobre el que quieres que responda a las preguntas.A continuación, accede al informe de Términos que concuerdan y activa el filtro de Preguntas:Aquí obtendrás una lista de preguntas relacionadas con el término “semilla”.Si utilizas un término amplio como pizza, generarás muchas más preguntas potenciales:Si quieres generar preguntas más específicas, utiliza una palabra clave más concreta. Por ejemplo, si sigues el mismo método para “Apple AirPods”, obtendrás menos resultados pero más preguntas relevantes:3. Deconstruye a tus competidores con el Site Explorer de AhrefsEsta vez, vamos a utilizar las webs de la competencia como fuente de preguntas.Dirígete al Site Explorer de Ahrefs, introduce una URL de un competidor y, a continuación, accede al informe de Palabras clave orgánicas:A partir de aquí, es necesario filtrar las palabras clave que no sean preguntas. Es bastante fácil utilizar los filtros integrados de Ahrefs.Dentro del informe de Palabras clave orgánicas, haz clic en el filtro de Palabras clave y añade algunos modificadores.Modificadores de pregunta: qué, dónde, cuándo, por qué, cuál, quién, cómo, etc.Asegúrate de que el filtro está configurado como Contiene y Cualquier valor. A continuación, haz clic en “Aplicar”.Ten en cuenta que es posible que tengas que escribir los modificadores sin tilde.Esto te va a generar una lista de palabras clave que contienen los modificadores de pregunta anteriores:Prácticas recomendadas para páginas de preguntas frecuentes optimizadas para SEOLa creación de una página de preguntas frecuentes que facilite el SEO no difiere de la creación de cualquier otra página con mucho contenido.Tiene que ser fácil de navegar, con carga rápida, con SEO on-page, etc.Dicho esto, incluimos aquí algunos puntos que tienes que tener en cuenta a la hora de crear tu propia página de preguntas frecuentes:Agrupa las preguntas: si organizas las preguntas por categorías, la experiencia del usuario será mejor.Evita la jerga: utiliza un lenguaje comprensible para tu público.Utiliza tu personalidad de marca/tono de voz/guía de estilo: una página de preguntas frecuentes no debería ser distinta a cualquier otro contenido de tu web. Mantén la coherencia.Responde a las preguntas de forma clara y concisa: tu página de preguntas frecuentes tiene que responder a las preguntas con rapidez. Si quieres profundizar más, genera blog posts.Actualiza la página: las preguntas frecuentes no son páginas estáticas. Asegúrate de añadir preguntas nuevas y actualizar las antiguas con regularidad.Enlaces internos: es importante añadir enlaces internos a cualquier contenido o recurso relacionado que pueda conducir al usuario por el embudo de conversión.Formato UX: Una buena experiencia de usuario (UX) facilita que los usuarios encuentren las respuestas que buscan.Optimiza las title tags: Puedes hacer que los buscadores reconozcan las preguntas frecuentes.Utiliza el schema markup de preguntas frecuentes: Añadir el marcado schema a tu página puede ayudarte a ganar más espacio en las SERP.Hablando del schema de preguntas frecuentes… Profundicemos en ello:Cómo agregar un schema de preguntas frecuentes en tres pasosEl marcado schema de preguntas frecuentes es un tipo de datos estructurados que hace que tus páginas sean elegibles para tener fragmentos enriquecidos en las SERP.Estos fragmentos enriquecidos de preguntas frecuentes pueden ayudar a aumentar la tasa de clics, ayudando a Google a rastrear tu web y reclamando más espacio en las SERP.Añadir el marcado schema de preguntas frecuentes a tu web es muy fácil.Paso 1: Crea tus preguntas frecuentesEn primer lugar, necesitas preguntas reales para “marcar”.Crea una página dedicada a las preguntas frecuentes o una sección de preguntas frecuentes en una de tus páginas. A continuación, rellénela con preguntas y contéstalas.Al marcar, asegúrate de seguir las pautas de Google:Fuente: Google.Paso 2: Escribe y valida tu schema de preguntas frecuentesPuede usar JSON-LD o Microdata para crear un marcado de preguntas frecuentes, pero Google recomienda JSON-LD.Si quieres hacerte la vida fácil, utiliza un generador de esquemas de preguntas frecuentes gratuito:Tan solo copia y pega tus preguntas y respuestas en el generador, y el código del esquema de preguntas frecuentes se generará automáticamente para ti.Aprende de mis (muchos) errores con el esquema: presta mucha atención al código.El código de tu página y el código de tu script tienen que ser iguales. Si son diferentes (incluso por una pequeña coma mal colocada), el marcado no funcionará.Para comprobar tu esquema de preguntas frecuentes, simplemente copia y pega el código y ejecútalo en la herramienta de prueba de resultados enriquecidos de Google.Paso 3: Implementa y valida (de nuevo)Ahora tienes que implementar tu marcado en tu página. Estas son algunas de las opciones:Añade manualmente el script en la sección <head> de la páginaAñádelo a través de un plugin de WordPress (como Insert Headers and Footers o RankMath)Agrégalo al Google Tag ManagerAñádelo al archivo function.php de tu tema de WordPressNota al margen.Si no sabes lo que estás haciendo, ahórrate posibles dolores de cabeza y opta por las opciones 1 o 2.El último paso, una vez añadido el schema de preguntas frecuentes, es comprobar si funciona. Copia y pega la URL de tu página y ejecútala en la herramienta de prueba de resultados enriquecidos de Google. Asimismo, comprueba tu página en el GSC para verificar si hay errores o advertencias.PRO TIPDos consejos de schema de preguntas frecuentes prácticosEn primer lugar, debo dar las gracias a David Ojeda por revisar el proceso de schema anterior y comprobar si había errores.Por si eso no fuera suficiente, Dave “Schema Wizard” Ojeda también me dio no uno, sino dos consejos prácticos sobre el schema de preguntas frecuentes:Las respuestas de las preguntas frecuentes aceptan HTML: Esto significa que puedes añadir enlaces internos a tus respuestas y enviar a la gente a páginas enfocadas a la conversión o a páginas de contenido clave.Seguimiento UTM: Cuando enlazas una respuesta con HTML, también puedes añadir seguimiento UTM para ver quién hace clic desde las SERP.Preguntas frecuentes sobre las preguntas frecuentesAhora es el momento de ponerse a ello. Aquí tienes algunas preguntas frecuentes sobre las preguntas frecuentes:¿Cuántas preguntas debería tener una sección de preguntas frecuentes?Las suficiente para que sean útiles.Personalmente, creo que las preguntas frecuentes tienen que intentar responder a todas las preguntas que sean relevantes.Esto dependerá de muchos factores, como el nicho en el que te encuentres. Pero, por muchas preguntas útiles que haya, deberías intentar responderlas todas en tu sección de preguntas frecuentes.¿Qué debería incluirse en una página de preguntas frecuentes?Las preguntas que se hagan con frecuencia… y su respuesta.La definición (desde el comienzo de este artículo) es:<blockquote>Una página de preguntas frecuentes es una zona de una web en la que se puede responder a preguntas habituales relacionadas con tu nicho.</blockquote>Eso es lo que deberías incluir en una página de preguntas frecuentes.¿Cuáles son los beneficios de las páginas de preguntas frecuentes?¿No te convence? Aquí tiene más ventajas. Una página de preguntas frecuentes:Proporciona respuestas rápidas y concisas (para los usuarios y Google).Puede ayudar a empujar a los clientes potenciales hacia la compra/conversión.Ayuda a generar confianza.Disminuye la carga del servicio de atención al cliente (con suerte).¿Cuál es la diferencia entre una pregunta frecuente y una base de conocimientos?Las páginas de preguntas frecuentes suelen cubrir las preguntas más comunes. Por otro lado, una base de conocimientos abarca todo lo que se tiene que saber.Una base de conocimientos o centro de ayuda ofrece recursos para todas las preguntas posibles sobre tu producto, servicio o web. Por ejemplo, facturación, resolución de problemas, tutoriales, etc.Reflexiones finalesCuando dedicas tiempo a investigar las preguntas que se hace la gente, las relacionas con palabras clave relevantes y las muestras en una página de preguntas frecuentes centrada en la experiencia del usuario, tienes la receta del éxito en SEO.Puede parecer mucho, pero se puede resumir de la siguiente forma:Para crear una página de preguntas frecuentes útil, responda a las preguntas relevantes que la gente y los motores de búsqueda puedan entender.¿Tienes alguna pregunta sobre cómo crear páginas de preguntas frecuentes para SEO? Contáctanos por X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO para páginas de preguntas frecuentes con ejemplos y prácticas recomendadas"
    },
    {
      "level": "H2",
      "text": "¿Qué es una página de preguntas frecuentes y por qué es útil para SEO?"
    },
    {
      "level": "H3",
      "text": "¿Son las páginas de preguntas frecuentes buenas para el SEO?"
    },
    {
      "level": "H2",
      "text": "Cinco ejemplos de páginas de preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "1. Preguntas frecuentes sobre la página de inicio"
    },
    {
      "level": "H3",
      "text": "2. Preguntas frecuentes sobre la página de productos/servicios"
    },
    {
      "level": "H3",
      "text": "3. Página dedicada de preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "4. Entradas de blog con preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "5. Sección dedicada de preguntas frecuentes al final de una post"
    },
    {
      "level": "H2",
      "text": "Tres formas de encontrar preguntas para tu página de preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "1. Investiga qué preguntas hacen los usuarios"
    },
    {
      "level": "H3",
      "text": "2. Encuentra preguntas con el Keyword Explorer de Ahrefs"
    },
    {
      "level": "H3",
      "text": "3. Deconstruye a tus competidores con el Site Explorer de Ahrefs"
    },
    {
      "level": "H2",
      "text": "Prácticas recomendadas para páginas de preguntas frecuentes optimizadas para SEO"
    },
    {
      "level": "H2",
      "text": "Cómo agregar un schema de preguntas frecuentes en tres pasos"
    },
    {
      "level": "H3",
      "text": "Paso 1: Crea tus preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "Paso 2: Escribe y valida tu schema de preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "Paso 3: Implementa y valida (de nuevo)"
    },
    {
      "level": "H3",
      "text": "Dos consejos de schema de preguntas frecuentes prácticos"
    },
    {
      "level": "H2",
      "text": "Preguntas frecuentes sobre las preguntas frecuentes"
    },
    {
      "level": "H3",
      "text": "¿Cuántas preguntas debería tener una sección de preguntas frecuentes?"
    },
    {
      "level": "H3",
      "text": "¿Qué debería incluirse en una página de preguntas frecuentes?"
    },
    {
      "level": "H3",
      "text": "¿Cuáles son los beneficios de las páginas de preguntas frecuentes?"
    },
    {
      "level": "H3",
      "text": "¿Cuál es la diferencia entre una pregunta frecuente y una base de conocimientos?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek"
}