{
  "url": "https://ahrefs.com/blog/es/procedimientos-normalizados-seo/",
  "slug": "procedimientos-normalizados-seo",
  "title": "Cómo crear procedimientos normalizados de SEO para aumentar el tráfico orgánico",
  "description": "Los procedimientos normalizados de trabajo hacen que las tareas sean más rápidas, sencillas y escalables. Esto es especialmente cierto en el caso del SEO, donde muchas de las tareas son sencillas y repetibles.",
  "content": "Bill Widmer Viviendo como nómada digital más de 8 años. Bill tiene una misión de viajar por el mundo y ganarse la vida utilizando el SEO y el marketing de contenidos. Contenido Los procedimientos normalizados de trabajo hacen que las tareas sean más rápidas, sencillas y escalables. Esto es especialmente cierto en el caso del SEO, donde muchas de las tareas son sencillas y repetibles.Cosas como añadir metaetiquetas, mantener una estructura de URL adecuada, añadir enlaces internos y optimizar las imágenes son fáciles de hacer… pero también fáciles de olvidar.Registrar las tareas SEO en documentos estandarizados significa que nunca se olvidarán y, una vez documentadas, podrás delegar fácilmente estas sencillas tareas a otros miembros de tu equipo.Si quieres hacer crecer tu tráfico orgánico mientras trabajas menos, necesitas procedimientos normalizados de trabajo SEO.¿Qué es un procedimiento normalizado de trabajo?Un procedimiento normalizado de trabajo (PNT), también conocido en inglés como Standard Operating Procedure, es un documento que describe paso a paso cómo se realiza una tarea. Suele incluir capturas de pantalla para mostrar visualmente lo que se está explicando, pero los mejores PNT también incluyen vídeos.Por lo general, hago mis PNT en un Google Doc con capturas de pantalla. Luego utilizo Loom para grabar mi pantalla y crear explicaciones en vídeo.¿Por qué utilizar PNT para SEO?Los PNT de SEO permiten:Nunca olvidar los pasos importantes de SEO al publicar contenido.Contratar a un asistente asequible para que se encargue de tareas sencillas.Escalar tu negocio de formas que no son posibles sin estandarización.McDonald’s fue una de las primeras empresas en dominar la estandarización, y eso que su línea de hamburguesas era mucho más compleja que la creación de un simple documento. Tú también puedes aprovechar el poder de un proceso estandarizado para aumentar la producción y la eficiencia.Cinco procedimientos normalizados de SEO que son claveHay muchos procesos empresariales que pueden beneficiarse de los PNT. Sin embargo, las cinco tareas SEO fundamentales que deberían tener PNT son las siguientes:Creación de contenidos y SEO on-page.Procedimientos de enlaces internos.Optimización de imágenes.Envío de correos electrónicos para link building.Seguimiento de los rankings y actualizaciones.A continuación, desgloso cada una de ellas y te ofrezco plantillas de ejemplo que puedes copiar y moldear para adaptarlas a tu negocio.1. Creación de contenidos y SEO on-pageEl contenido es la base de toda buena estrategia de SEO. Sin embargo, crear contenidos de calidad requiere tiempo y mucho esfuerzo. Si quieres reducir el tiempo que lleva, un PNT lo conseguirá.En Ahrefs, nuestro PNT para el contenido incluye estos ocho pasos:Crear una carpeta principal del contenido en DriveRellenar/actualizar la ficha en NotionAsignar la ilustración de cabeceraEscribir el esquema del contenidoEscribir el borradorEditar el borradorAsignar imágenes personalizadas y anotaciones de capturas de pantallaPreparar la edición + cargarPor supuesto, estos pasos son específicos de nuestros sistemas y estilos. Utilizamos Google Drive y Notion para hacer un seguimiento de todo, tenemos una ilustración de cabecera para cada artículo y un proceso de edición riguroso para garantizar que el contenido sea de calidad.Este es el aspecto del documento:Como puedes ver, se trata de un proceso bien documentado y fácil de seguir, con ejemplos y enlaces.Dentro de este documento, también enlazamos con nuestras directrices de redacción PNT con información aún más detallada sobre nuestro proceso de redacción real.Esto incluye nuestras directrices de estilo y redacción con ejemplos reales…… así como capturas de pantalla para mostrar, no solo “contar”.Por último, contamos con procedimientos normalizados para el SEO on-page, que incluyen cómo nombrar correctamente las imágenes, añadir texto alternativo a las imágenes y configurar los metadatos de cada página.La creación de estos documentos tan sencillos facilita y agiliza enormemente la creación de contenidos.2. Procedimientos de enlazado internoLos enlaces internos son cruciales para obtener una buena posición en Google. Todas y cada una de las páginas de tu web, aparte quizás de las landing pages, deberían tener enlaces internos. Esto es especialmente cierto para el contenido del blog.El PNT podría ser algo así:Es importante incluir un enlace interno relevante siempre que se pueda beneficiar al lector.El texto ancla del enlace interno tiene que ser relevante para el contenido sobre el que estás escribiendo y el contenido al que estás enlazando. Por ejemplo, enlaza a “Accesorios para autocaravanas” desde “Guía del comprador de bombas de agua para autocaravanas”. NO enlaces a “van life builds” desde “cómo mantener tu autocaravana fresquita en verano”. Mantén la relación.Utiliza la herramienta de Oportunidades de enlaces internos del Site Audit de Ahrefs para hacer el trabajo. Alternativamente, puedes encontrar enlaces internos realizando una búsqueda en Google de site:[tuweb.es] \"palabra clave relacionada\" para ver todo el contenido que contiene esa palabra clave o frase relacionada.3. Optimización de imágenesLa optimización de las imágenes para Google (y para los usuarios) es algo que suele pasarse por alto. Pero es algo fácil de hacer y también importante, si quieres llegar a esa primera página tan deseada.Hay tres pasos para garantizar una buena optimización de las imágenes:Tener un título adecuado que describa la imagen (sin palabras clave).Añadir un texto alternativo que describa la imagen con más detalle para quienes no puedan descargarla y verla.Utilizar el formato de archivo adecuado y reducir el tamaño total de los datos de la imagen para acelerar la velocidad de carga.Para más información, lee nuestra guía sobre SEO de imágenes.4. Difusión por email para el link buildingEl link building es clave para una estrategia SEO, ya que los enlaces son uno de los factores de posicionamiento en Google más importantes.Aunque la construcción de backlinks no es exactamente fácil, implica muchos pasos repetitivos. Esto lo convierte en una tarea PNT ideal. De hecho, es probable que quieras varios PNT, uno para cada estrategia de link building:Guest post o difusión de blogs.Link building de páginas rotas.Reparación de menciones no enlazadas.El saqueo de enlaces de páginas inferiores.Etc.Cada uno de estos procedimientos es distinto. Por lo tanto, puedes transcribir tu proceso actual en un documento o seguir una de las guías enlazadas anteriormente y crear un documento para ello.5. Seguimiento del ranking y updatesPor último, tenemos algo que les encanta a casi todos los SEO: ver cómo suben tus rankings (con suerte).Aunque es bastante fácil comprobar si el ranking está subiendo o no con una cuenta Ahrefs o de Google, hay una forma mejor.Es una forma que sigue requiriendo comprobar tu cuenta Ahrefs, pero en vez de hacerlo de forma esporádica, se utiliza un enfoque metódico que rastrea los cambios y los resultados. Después de todo, gran parte del SEO es prueba y error.Antes que nada, regístrate para conseguir acceso al Rank Tracker de Ahrefs. Nuestros informes te mostrarán los cambios en el ranking a lo largo del tiempo con datos visualizados a través de gráficos e informes de la competencia.También puedes rastrear palabras clave y páginas específicas a lo largo del tiempo:Una vez que tengas tu cuenta, puedes hacer un PNT para comprobar las páginas diaria, semanal o mensualmente. Haz un seguimiento de cualquier cambio que hagas en tus páginas, como metadatos, añadir o cambiar contenido, mejorar tus enlaces internos, etc. A continuación, documenta el impacto de estos cambios en tus posiciones a lo largo del tiempo.Si te acostumbras a realizar este tipo de pruebas de SEO y a hacer un seguimiento de sus efectos, podrás ver qué funciona y qué no, y así aumentar lo que funciona y dejar de perder el tiempo con lo que no.Reflexiones finalesAl documentar los procesos de SEO en forma de procedimientos normalizados de trabajo, podrás ampliar más fácilmente tu negocio y contratar a otras personas para realizar las tareas más sencillas.Si quieres que tu negocio (y tu tráfico orgánico) crezcan, tener PNT es una de las formas más seguras de hacerlo. Aprende lo que funciona, documenta el proceso y amplíalo. Estas cinco tareas de SEO son solo el comienzo, puedes tener un PNT para cada tarea repetitiva en tu negocio. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo crear procedimientos normalizados de SEO para aumentar el tráfico orgánico"
    },
    {
      "level": "H2",
      "text": "¿Qué es un procedimiento normalizado de trabajo?"
    },
    {
      "level": "H2",
      "text": "¿Por qué utilizar PNT para SEO?"
    },
    {
      "level": "H2",
      "text": "Cinco procedimientos normalizados de SEO que son clave"
    },
    {
      "level": "H3",
      "text": "1. Creación de contenidos y SEO on-page"
    },
    {
      "level": "H3",
      "text": "2. Procedimientos de enlazado interno"
    },
    {
      "level": "H3",
      "text": "3. Optimización de imágenes"
    },
    {
      "level": "H3",
      "text": "4. Difusión por email para el link building"
    },
    {
      "level": "H3",
      "text": "5. Seguimiento del ranking y updates"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Bill Widmer"
}