{
  "url": "https://ahrefs.com/blog/es/product-market-fit/",
  "slug": "product-market-fit",
  "title": "Cómo alcanzar product-market fit en 5 pasos",
  "description": "El product-market fit (PMF) es cuando una empresa ha confirmado señales de que su producto puede satisfacer una demanda existente en un mercado con alto potencial.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido Las startups experimentan un flujo inagotable de problemas y retos. La supervivencia en un escenario así es el arte de elegir entre en qué enfocarse, qué poner en espera o qué ignorar.Pero eso nunca es fácil: las diferencias de opinión, el tiempo y el dinero que se acaban y la falsa noción de que una idea de negocio realmente buena debería despegar inmediatamente son problemas comunes que las startups afrontan.El concepto de product-market fit, o encaje producto-mercado, busca resolver varios problemas de las startups tratando de ser “lo único que importa”. Enfocarse en este concepto debería poner a cualquier startup en el camino adecuado, sin importar las circunstancias.En este artículo, vamos a echar un vistazo más de cerca a este concepto tan discutido. Aquí tienes lo que vamos a abordar:¿Qué es el product-market fit?¿Por qué es importante el product-market fit?Ejemplos de product-market fitCinco pasos para alcanzar el product-market fit¿Qué es el product-market fit?El product-market fit (PMF) es cuando una empresa ha confirmado señales de que su producto puede satisfacer una demanda existente en un mercado con un alto potencial.La señal habitual de que se ha alcanzado el PMF es que la gente está dispuesta a comprar el producto (aunque todavía no sea perfecto), usarlo activamente y recomendarlo a otras personas.¿Por qué es importante el product-market fit?Construir un producto de éxito es cuestión de hacer las cosas bien en el orden adecuado y enfocándose en lo que de verdad importa.Al igual que las casas se tienen que construir desde la base, las empresas deberían construir sobre bases sólidas antes de seguir adelante.Antes de contratar a más gente o escalar la adquisición de clientes, las startups deberían confirmar dos cosas: primero, que hay suficiente gente que quiere pagar por el producto; segundo, que el propio mercado tiene potencial para crecer.Simplemente, sin PMF no hay crecimiento sostenible.Ejemplos de product-market fitHay algunos escenarios posibles para alcanzar PMF. Algunas empresas encuentran una idea inicial buena sobre la que construir. Otros tienen que cambiar su negocio por completo (pivotar) para dar beneficios. Así que vamos a ver algunos ejemplos de empresas que encuentran su PMF.AhrefsAhrefs es un conjunto de herramientas de SEO todo en uno diseñadas para hacer crecer el tráfico orgánico de búsqueda, analizar a la competencia y abordar problemas técnicos de SEO.Las cinco herramientas centrales de Ahrefs.Pero al principio, Ahrefs solo era una herramienta creada para el análisis de enlaces (que es uno de los aspectos del SEO).Lectura recomendada: SEO: La guía completa para principiantesLa propuesta de valor de Ahrefs en 2011.Tenemos la mayor base de datos de enlaces & SERPs actualizadasEl equipo fundador de Ahrefs se enfocó exclusivamente en la satisfacción del cliente del primer producto. Al principio no había equipo de marketing ni de ventas.Esa estrategia permitió a la empresa conseguir señales claras de PMF. En consecuencia, gracias al crecimiento orgánico de su base de clientes, Ahrefs fue capaz de crear herramientas SEO de mayor éxito y escalar su equipo. Es importante destacar que Ahrefs no se paró en el PMF inicial. Para seguir siendo competitivo por delante de lo que el mercado demandaba, expandió la funcionalidad desde una herramienta SEO de un único propósito a un conjunto de herramientas SEO todo en uno.SlackTe presento a Glitch, el progenitor de Slack que ni siquiera era una herramienta de mensajería. Glitch era un juego multijugador que funcionaba en el navegador lanzado en 2012, y tenía este aspecto:La ventana de chat de la derecha es lo que más tarde se convertiría en el Slack que todos conocemos hoy. El resto fue abandonado por la empresa y liberado bajo una licencia open-source (de código abierto) para que cualquiera pudiera continuar con el proyecto.Slack encontró su PMF convirtiéndose en un producto completamente diferente. En el idioma startup, a eso se le llama “pivotar”.Glitch, el juego, no tuvo el éxito esperado. Pero a la vista del éxito de su spin-off (proyecto derivado), no es algo que importe nada. La parte importante es entender la lección rápidamente y enfocarte en las cosas que realmente funcionan.Play-DohPlay-Doh es un juego clásico que no ha faltado en ninguna juguetería durante unos 50 años. La marca tiene mucho éxito, pero su camino en busca de PMF fue mucho menos tranquilo.En primer lugar, Play-Doh originalmente tenía una aplicación completamente diferente para audiencia totalmente distinta a la actual. Con el nombre de Kutol, este producto era un limpiador fabricado especialmente para lavar los residuos negros de las estufas de carbón—un problema habitual en los años 30 del siglo pasado.El negocio iba genial hasta que las estufas de carbón fueron reemplazadas por alternativas “más limpias” de aceite y gas. Así es como la empresa perdió su PMF original.Pero no se rindieron. La leyenda dice que uno de los parientes de los fundadores había usado Kutol con niños en clases de arte y manualidades. El pariente sugirió algo parecido para una nueva aplicación oficial del producto. Así que los productores de Kutol dieron un gran salto de fe e hicieron un rebranding del producto como Play-Doh, una plastilina para niños.Con eso, la empresa descubrió su nuevo PMF y se ha mantenido ahí desde entonces.Antes y después. En los años 1950, el limpiador “Kutol” intentó recuperar su PMF. Al hacerlo, se convirtió en un juguete de éxito.Cinco pasos para alcanzar el product-market fitLa idea subyacente en el proceso de encontrar el PMF se parece al método científico. Para hacer un descubrimiento (es decir, qué producto crear) necesitas investigar el problema lo bastante bien para proponer una hipótesis y después diseñar un experimento que la probará o la descartará.Si quieres aprender sobre cómo medir el PMF para un producto existente, ve al paso cuatro.Paso 1. Formula la hipótesis de valor Una hipótesis de valor es un supuesto que explica por qué es probable que un cliente compre tu producto. En otras palabras, necesitas especificar qué valor introduciría tu producto en la vida del usuario.Una hipótesis de valor puede parecerse a esto:Comprar libros online ofrece una mejor experiencia que comprarlos en tiendas físicas.Los profesionales SEO necesitan una herramienta automatizada para el diagnóstico del SEO técnico.La comunicación por email es menos productiva que el chat online en tiempo real.Tu hipótesis de valor se pondrá después a prueba frente a usuarios reales que interactuarán con tu producto mínimo viable (minimum viable product o MVP).Los grandes productos resuelven problemas reales, significativos. Para identificar estos problemas y los clientes potenciales que necesitan una solución, necesitas hacer investigación de mercados.La investigación de mercados puede ser un proceso que consume mucho tiempo. Pero la buena noticia es que una buena parte de la investigación de mercados puede hacerse online sin gastar una fortuna.Por ejemplo, usando una herramienta SEO como Ahrefs, puedes calibrar la demanda de mercado buscando señales de demanda de búsqueda en motores de búsqueda, ya que suelen estar relacionados.Pongamos que tu startup quiere ofrecer una solución online para las compensaciones de vuelos con retraso y cancelados. Ya que será un producto online, querrás ver con qué frecuencia la gente realiza búsquedas relacionadas con ese problema. Con Keywords Explorer de Ahrefs esa información está solo a unos pocos clics de distancia.”Reclamar vuelo cancelado” recibe unas 400 búsquedas globales al mes y parece un problema habitual.Paso 2. Especifica las funcionalidades de tu producto mínimo viableUna vez que has definido claramente el problema que quieres resolver, el próximo paso es identificar el conjunto de funcionalidades que resolverán el problema del cliente.Quedarse corto al añadir funcionalidades resultará en una solución incompleta. Pero tener demasiadas tampoco es bueno, ya que puede diluir el core del valor del producto e incrementar el riesgo de gastar demasiado en tu prototipo. Aquí es donde entra el MVP. Crear un MVP consiste en encontrar el equilibrio adecuado y el número de funcionalidades necesarias para verificar la hipótesis.Probablemente es una buena idea usar varias fuentes y tipos de investigación para descubrir qué es necesario construir. Puedes combinar conclusiones a partir de tu análisis competitivo, encuestas, observaciones e informes sectoriales.También aquí las herramientas SEO pueden ser útiles. Por ejemplo, puedes hacerte una buena idea de qué características generan más valor para tus competidores identificando páginas web a las que dirigen tráfico de pago y las páginas principales por tráfico de búsqueda orgánico.Imagina que quieres crear una herramienta de gestión de proyectos. Vamos a usar Site Explorer y revisar el informe de Páginas de pago para asana.comY vamos a ver las páginas landing de funcionalidades de producto que reciben la mayor parte del tráfico orgánico en el informe de Mejores páginas:Puedes deducir que crear formularios y funcionalidades de timeline en tu aplicación de gestión de proyectos es algo a considerar seriamente. Si es bueno para tu competidor, también podría ser bueno para tu producto (además de tu propuesta única de valor).Paso 3. Crea tu producto mínimo viableSi echas un vistazo a algunos de los MVPs de mayor éxito, verás que hay muchas formas de construirlos. Ni siquiera tienen que ser productos completamente funcionales. A modo de ejemplo, Buffer comenzó como una página landing que recogía registros para un producto que todavía no existía.Dropbox validó su idea de negocio creando dos vídeos sobre el producto. El primer vídeo ni siquiera mostraba el producto.https://www.youtube.com/watch?v=w4eTR7tci6AAhora, vamos a ver unas pocas ideas sobre cómo puedes crear un MVP (además de desarrollar un producto completamente funcional): Campañas publicitarias – Puedes crear varios tipos de contenido creativo para audiencias específicas para ver qué aspectos de tu producto les resultan más atractivos. Prototipos – Puedes usar herramientas como UXPin, Figma, o Marvel para crear un prototipo de alta fidelidad e interactivo de tu solución y mostrárselo a la gente. Páginas landing – Parecido a como empezó Buffer, puedes crear una página landing para presentar tu idea y recoger direcciones de email con un formulario de lista de espera. Después, puedes usar esos emails para recoger feedback. Además, puedes realizar tests A/B en el sitio para probar varias hipótesis. Entrevistas de cliente – Este método te permite profundizar en cómo tus clientes potenciales reaccionarían a tu producto con el mínimo esfuerzo. MVP “El Mago de Oz” – Los clientes piensan que están experimentando un producto real, pero entregas el servicio con trabajo manual que haces “detrás de las cámaras”. MVP Conserje – Un MPV manual parecido al “Mago de Oz”, pero sin fingir en el producto. Páginas de Kickstarter/pre-compra – Puedes testar la demanda de mercado recibiendo reservas por adelantado de las personas más interesadas.Como quiera que elijas crear tu MVP, recuerda que necesita ser de ayuda para verificar tu hipótesis de valor.Paso 4. Prueba tu producto mínimo viable con usuarios realesEn esta fase en la que quieres encontrar el PMF necesitas recoger tanto feedback sobre tu producto como puedas. No te pares en el feedback positivo o negativo. Intenta profundizar y entender qué les gusta o disgusta a tus usuarios y qué quieren cambiar.Plataformas como SurveyMonkey, UserTesting, o Remesh te pueden ayudar a llegar al grupo demográfico adecuado para realizar pruebas y/o entrevistas.También puedes publicar tu MVP en comunidades online relevantes para la audiencia objetivo de tu producto o compartirlo en plataformas como Product Hunt. Para productos existentes en el mercado, dependiendo de durante cuánto tiempo haya existido tu producto, las señales de PMF (o su falta) se pueden ver en la satisfacción e involucración de los clientes. Ten en cuenta estos indicadores: Puntuación NPS – Haz una encuesta de Net Promoter Score entre tus usuarios. Si tus usuarios no están satisfechos con el producto, es improbable que lo recomienden a sus amigos. De ahí que tengas pocas probabilidades de crecer orgánicamente a través del boca a boca. La regla del 40% – Al igual que la encuesta NPS, este sistema tiene una sola pregunta: “¿Cómo te sentirías si no pudieras seguir usando [producto]?” Las respuestas posibles son a) muy decepcionado, b) algo decepcionado, c) nada decepcionado (realmente no es tan útil) y d) N/A—Ya no uso [producto]. Si al menos un 40% de tus usuarios eligen la primera opción, existe una alta probabilidad de que hayas alcanzado PMF. Tasas de retención de usuarios por cohorte – Esto está reservado solo a productos diseñados para ser usados durante períodos de tiempo largos. La idea es la siguiente: si tus clientes de pago permanecen con tu producto, es una señal de PMF. La tasa de retención ideal puede variar, dependiendo del tipo de producto y sector. Lee más sobre comparativas de tasa de retención aquí.Paso 5. Aprende de tus usuarios e iteraEn esta fase final del proceso, deberías ser capaz de responder dos preguntas: ¿probaste o descartaste la hipótesis de valor? ¿Y qué puedes hacer para mejorar tu producto en el futuro?Un resultado negativo del experimento de tu hipótesis de valor no es el fin del mundo. Dependiendo del feedback, puedes hacer algunos ajustes y reafirmar tu hipótesis. Después, comienza el proceso de nuevo.Un ejemplo famoso de esto es el papel de burbujas. No funcionó como un nuevo tipo de papel de pared o de aislamiento para el hogar.Además, algunas ideas pueden estar adelantadas a su tiempo (por ejemplo, por razones técnicas o legislación actual). Puede que necesites intentarlo de nuevo en otro momento.Sin embargo, algunas ideas de negocio son simplemente malas y no hay realmente nada que puedas hacer. Por el lado bueno, si descubres esto pronto, te ahorrarás mucho tiempo y dinero.Pero si has tenido razón durante todo este tiempo y tu MVP sobrevive al contacto con usuarios, tendrás una buena oportunidad de triunfar. En otras palabras, es probable que hayas encontrado el PMF. Antes de convertir tu MVP en un producto completamente funcional y sacarlo al mercado, es una buena idea hacer un par más de iteraciones para abordar todo el feedback que hayas recibido. Lo que quieres escuchar de tus usuarios es que tu MVP es fácil de usar y ofrece una solución de valor.Finalmente, como hemos visto con nuestros ejemplos de PMF, el PMF puede ser algo temporal. Puedes perderlo en algún momento, como Kutol (Play-Doh), o puede que necesites expandir tu idea inicial como Ahrefs. Reflexiones finalesEl mercado siempre gana. Un producto genial fracasará en un mercado desfavorecedor y uno malo se verá marginado más pronto o más tarde en un mercado en expansión.Por eso, elegir un mercado donde los usuarios tengan un problema real, significativo, lanzar el producto rápidamente e iterar en base a su feedback importa tanto. Tener éxito en esa fase es una señal de que puedes empezar a trabajar en los próximos pasos: contratar a más gente y conseguir más clientes.Como nota final, es bueno tener en mente que no todo el feedback de los usuarios es igual. No tienes que cumplir todos los deseos de tus usuarios. Enfócate en mejoras factibles y cosas que encajen en tu visión de producto.¿Preguntas? ¿Dudas? ¿Sugerencias? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo alcanzar product-market fit en 5 pasos"
    },
    {
      "level": "H2",
      "text": "¿Qué es el product-market fit?"
    },
    {
      "level": "H2",
      "text": "¿Por qué es importante el product-market fit?"
    },
    {
      "level": "H2",
      "text": "Ejemplos de product-market fit"
    },
    {
      "level": "H3",
      "text": "Ahrefs"
    },
    {
      "level": "H3",
      "text": "Slack"
    },
    {
      "level": "H3",
      "text": "Play-Doh"
    },
    {
      "level": "H2",
      "text": "Cinco pasos para alcanzar el product-market fit"
    },
    {
      "level": "H3",
      "text": "Paso 1. Formula la hipótesis de valor"
    },
    {
      "level": "H3",
      "text": "Paso 2. Especifica las funcionalidades de tu producto mínimo viable"
    },
    {
      "level": "H3",
      "text": "Paso 3. Crea tu producto mínimo viable"
    },
    {
      "level": "H3",
      "text": "Paso 4. Prueba tu producto mínimo viable con usuarios reales"
    },
    {
      "level": "H3",
      "text": "Paso 5. Aprende de tus usuarios e itera"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}