{
  "url": "https://ahrefs.com/blog/es/que-son-keywords/",
  "slug": "que-son-keywords",
  "title": "¿Qué son las Keywords? Cómo usarlas para SEO",
  "description": "Las keywords son las palabras y frases que la gente ingresa en los motores de búsqueda para encontrar lo que están buscando.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Las Keywords son las palabras o frases que las personas escriben en los buscadores para encontrar lo que están buscando.Por ejemplo, si estabas buscando comprar una nueva campera, puede que escribas en Google algo como “campera de cuero masculina”. A pesar de que esa frase incluya más de una palabra, sigue siendo una Keyword.Por supuesto, nadie fuera del ambiente de la industria del SEO tiende a usar esta terminología. La mayoría de las personas simplemente las llamaría búsquedas de Google o consultas. Solo ten en mente que las keywords son sinónimos de ambas cosas.En esta guía, aprenderás:¿Por qué las keywords son importantes?¿Cómo aparecer en Google para las keywords?¿Cómo encontrar las keywords?¿Cómo elegir las keywords?¿Cómo optimizar para las keywords?¿Qué son las keywords long-tail?¿Por qué las keywords son importantes?Las Keywords son importantes porque tu sitio web puede aparecer cuando las personas las escriben en los buscadores.Por ejemplo, si escribes en Google “how to do SEO” (cómo hacer SEO), aparecemos primeros:Debido a que esta keyword obtiene alrededor de 1.700 búsquedas mensuales en Estados Unidos, aparecer primero en Google nos envía muchas visitas hacia nuestro sitio web. De hecho, hemos tenido más de 900 visitas por esta keyword el último mes.Volumen de búsqueda mensual en Estados Unidos para “how to do SEO” según el Explorador de Keywords de Ahrefs.¿Cómo aparecer en Google para las keywords?Aparecer en los primeros resultados de Google para una keyword relevante puede enviar mucho tráfico hacia tu sitio pero, ¿cómo hacer esto?Existen 2 formas..Publicidad PPC (Pago Por Clic)SEO (Optimización de Motores de Búsqueda)Pago por Clic (PPC)PPC es cuando le pagas a Google para mostrar tu página web en los resultados para keywords específicas. Por ejemplo, si vendes un software the e-mail marketing, puedes apostar por este término y aparecer en los primeros resultados de búsqueda de Google cuando la gente busca eso.Esto es lo que hace Campaign Monitor.KW: Software de email marketingEsto es conocido como publicidad PPC (Pago Por Clic). Google tiene una plataforma donde puedes elegir keywords para posicionarte. Google luego muestra tu anuncio en los resultados de búsqueda. Cada vez que alguien hace clic en tu anuncio y visita tu sitio web, Google te cobra dinero.Puedes diferenciar los resultados pagos de los orgánicos (no pagos) porque los primeros están marcados como anuncios.Optimización de Motores de Búsqueda (SEO)SEO es el proceso de optimizar tus páginas web para posicionarlas entre los resultados orgánicos que muestra Google. Y la tarea de Google es posicionar los resultados más relevantes para cada búsqueda.Si Google considera que tu página es el “mejor” resultado por los términos correctos, entonces obtendrás un flujo constante de visitas “gratis” hacia tu sitio web.Por ejemplo, el blog de Ahrefs obtiene alrededor de 383.000 visitas orgánicas de Google todos los meses.Nos posicionamos #1 para keywords como “SEO audit” (auditoría SEO) :“Keyword research tools” (herramientas de búsqueda de palabras clave) :Y “local SEO”:Dado que vendemos herramientas de SEO, todas esas keywords nos envían consumidores potenciales y contribuyen al resultado final.¿Cómo encontrar keywords?La mayoría de las personas tienen alguna idea de las keywords para las que quieren posicionarse en Google. Pero es imposible saber todo lo que la gente busca. Por este motivo vale la pena hacer una pequeña investigación para encontrar más ideas de keywords.Existen muchas formas de hacer esto, pero la más sencilla es utilizar una herramienta de búsqueda de keywords.La mayoría de estas herramientas funcionan de la misma manera. Escribes algunas palabras claves generales relacionadas a tu industria, llamadas keywords semilla, y luego la herramienta te devuelve algunas ideas de keywords relacionadas.Por ejemplo, digamos que vendes auriculares por internet. Tus keywords semilla podrían ser “headphones,” “earbuds”, “earphones,” y “beats.” (variaciones de la keyword “auriculares”)Vamos a ingresarlas en el Keywords Explorer de Ahrefs, y luego observar uno de los informes de ideas de keywords.De inmediato, vemos más de 2 millones de ideas de keywords relacionadas, junto con sus volúmenes de búsqueda mensuales, el costo promedio por clic (CPC) para los anuncios pagos, y muchas otras métricas de SEO más.¿Cómo elegir las keywords?Nadie puede posicionar para todas las keywords, y nadie puede pagar para posicionar para todas las keywords. Por este motivo, es importante escoger tus batallas sabiamente. Veamos algunas métricas y atributos de las keywords para ayudarte a elegir las mejores.Volumen de búsquedaIntención de búsqueda‘Valor’Dificultad de KeywordVolumen de búsquedaLas keywords varían en popularidad. Por ejemplo, hay aproximadamente 35.000 búsquedas mensuales de “how to post on instagram” (cómo publicar en instagram), pero solo 1.200 de “how to get backlinks” (cómo conseguir backlinks).¿Esto significa que es mejor posicionar para “how to post on instagram” que para “how to get backlinks”? No siempre. No tiene sentido posicionar para esa primera keyword si vendes software de SEO como nosotros. Es posible que atraiga muchas visitas, pero probablemente ninguna comprará lo que vendemos.Debes encontrar keywords que sean relevantes para lo que hace tu negocio, y luego juzgarlas relativamente.Por ejemplo, hay 2.200 búsquedas mensuales para “SEO tips” (consejos SEO) vs. 350 para “image seo” (imagen SEO).Tendría sentido para nosotros posicionarnos para cualquiera de estas dos keywords, pero probablemente debamos priorizar la primera. ¿Por qué? Tiene más búsquedas. Es probable que obtengamos más tráfico si posicionamos #1 para esa keyword.Puedes revisar el volumen de búsqueda para casi todas las keywords en el Keywords Explorer de Ahrefs. Simplemente escribe tu keyword, elige un país, y verás el volumen de búsquedas global y el específico para cada país:IMPORTANTEA pesar de que el volumen de búsqueda es, en general, un buen predictor del tráfico potencial, no es perfecto.Simplemente observa estas dos keywords:KW 1: Consejos de seoKW 2: Suscribir sitio web a motores de búsquedaJuzgando por sus volúmenes de búsqueda, podríamos suponer que las páginas mejor posicionadas para “SEO tips” obtendrían mayor tráfico orgánico. Pero si revisamos las páginas mejor posicionadas para cada término en el Site Explorer, vemos que sucede lo contrario.Volumen de búsqueda mensual estimado de la página mejor posicionada para “seo tips”Volumen de búsqueda mensual estimado de la página mejor posicionada para “submit website to search engines.”Aprende más sobre por qué el volumen de búsqueda no siempre es un buen predictor del tráfico potencial en estas dos publicaciones.Intención de búsquedaImagina que vendes aspiradoras robot en internet. Observando el volumen de búsqueda para “robot vacuum” (aspiradora robot), parece ser una keyword relevante para tratar de posicionar tu página.En definitiva, las personas que buscan “robot vacuum” están probablemente queriendo comprar una aspiradora robot, y tú las vendes. Entonces, ¿cuál es el problema?El problema es que la mayoría de las personas que están buscando esta keyword no tienen intenciones de compra. Solamente están buscando críticas y sugerencias sobre los mejores modelos disponibles.¿Cómo lo sabemos? Observa los resultados de búsqueda en Google.La mejor aspiradora robot de 2020La mejor aspiradora robot de 2020Mejores aspiradoras robot de 2020 - Reportes de consumidorMejores aspiradoras robot de 2020: Críticas y consejos de compraMejores aspiradoras robot de 2020: Roborock, Eufy, Romba, y…Aspiradoras RobóticasPuedes apreciar que la mayoría son listas de las mejores aspiradoras robot que están en sitios web de reviews de clientes. Esto es importante porque la tarea de Google es mostrar los resultados de búsqueda más relevantes para los usuarios. Si la mayoría de esos son listas de las mejores aspiradoras robot, entonces podemos asumir que eso es lo que las personas quieren encontrar.En SEO, esto se conoce como intención de búsqueda.Si quieres tener la mejor oportunidad de posicionarte para tus keywords en Google, debes crear contenido que se alinee con esa intención. En otras palabras, no trates de posicionar tu página principal para una keyword donde las personas están buscando publicaciones de blog, y vice versa.‘Valor’Usualmente las personas se entusiasman con el volumen y la intención de búsqueda sin detenerse a pensar en el valor de las keywords. Ese es un error.Digamos que vendes hornos para pizza en internet. Podrías ver una keyword como “pizza dough” (masa para pizza) que tiene 43.000 búsquedas mensuales y pensar que tratar de posicionar para ella será muy sencillo.Sin embargo, debes preguntarte ¿cuántas de esas personas realmente tienen intención de comprar un horno para pizza? La respuesta realista es “probablemente ninguna”. La mayoría están seguramente solo buscando una receta rápida. Es muy poco probable que quieran gastar varios cientos de dólares en un horno para pizza en un futuro cercano.Entonces, ¿cómo juzgar el valor de una keyword?Si estás analizando keywords en masa en una herramienta de búsqueda de keywords como el Keywords Explorer, puedes observar el CPC para obtener un sentido aproximado de su “valor”. Esto muestra cuánto están dispuestos a pagar en promedio los anunciantes por un clic en la keyword.La idea aquí es que si las personas están dispuestas a pagar mucho dinero por los clics, entonces el tráfico proveniente de esa keyword debe ser valioso.Sin embargo, no todo es tan sencillo. El hecho de que una keyword tenga valor para una persona no significa que tenga valor para ti.Toma de ejemplo “link building service” (servicio de link building):Tiene un CPC elevado, y es fácil entender por qué. Se puede hacer mucho dinero vendiendo servicios de link building, y las compañías que lo hacen están dispuestas a pagar mucho por el tráfico proveniente de esta keyword.Sin embargo, como no vendemos servicios de link building, no tiene mucho valor para nosotros.Dificultad de KeywordDigamos que has encontrado la keyword perfecta. Hay muchas personas buscándola, tu página coincide con la intención de búsqueda y parece valiosa. ¿Deberías ir a por esa keyword, cierto?No necesariamente. Depende de cuán difícil sea posicionarla.Por ejemplo, observa “mortgage payment calculator” (calculadora de pago de hipoteca):Estimamos que necesitarás enlaces de aproximadamente 455 sitios web para posicionarte en el top 10 para esta keyword.Tiene una Dificultad de Keyword de 84. Dado que nuestra escala va del 0 al 100, es un puntaje muy elevado. Significa que muchas de las páginas mejor posicionadas para esta keyword tienen muchos enlaces desde otros sitios web. Dado que los backlinks son un factor de posicionamiento importante, será difícil desplazar a las otras páginas a menos que obtengas muchos enlaces de alta calidad.Dicho esto, existen muchas maneras de posicionar en Google aparte de obtener backlinks. Entonces, mientras es útil tener en cuenta la Dificultad de Keyword para tener una idea superficial de la dificultad de posicionamiento, también existen otras cosas que debes tener en mente.Aprende cuáles son en nuestra guía completa para evaluar la dificultad de keyword.¿Cómo optimizar para las keywords?La mayoría de las guías dicen que debes hacer este tipo de cosas para optimizar para keywords:Incluir las keywords en el etiqueta TitleIncluir las keywords en la URLMencionar tus keywords en toda la páginaIncluir keywords long-tailA pesar de que tiene sentido hacer muchas de estas cosas, no son la forma principal de optimizar para una keyword.La manera principal de optimizar para una keyword es coincidir con la intención de búsqueda.Hemos hablado sobre esto anteriormente, pero resulta importante hacer énfasis en cuán importante es. Si estás intentando posicionar para “cast iron skillet” (sartén de hierro) con una publicación de blog, probablemente no sucederá. Google sabe que los usuarios no tienen intención de aprender, sino de comprar. Es por este motivo que los primeros cinco resultados son todas páginas de producto y categoría de sitios de ecommerce.1-Sartén de hierro fundido marca Lodge2-Las personas también buscan3-Sartén de hierro fundido pre-tratado marca Lodge..4-Sartén clásica de hierro fundido - Hierro fundido Lodge5-Lodge 12 Sartén de hierro fundido: Objetivo6-Sartén de hierro fundido pre-tratado de 12 pulgadas marca LodgeSin embargo, coincidir con la intención de búsqueda no solo implica crear la clase correcta de contenido. También necesitas hablar sobre las cosas que los usuarios están esperando encontrar.Por ejemplo, digamos que quieres posicionarte para “backlinks.”Puedes observar que, por las páginas mejor posicionadas, los usuarios quieren una publicación de blog, así que ya sabes cual es la clase de contenido que debes crear. ¿Pero sobre qué debes escribir específicamente? ¿Cúal debe ser el enfoque de tu publicación?Puedes obtener una idea de esto observando las páginas mejor posicionadas.En este caso, casi todas las publicaciones tienen el mismo enfoque: “¿Qué son los backlink?”1- ¿Qué son los backlinks? Y cómo construirlos en 20202- Las personas también buscan3- Backlinks - Mejores prácticas SEO (2020)4- ¿Qué es un backlink? Cómo obtener más backlinks - Ahrefs5- ¿Qué es un backlink? Y cómo comienzas a obtener backlinksPara tener una mayor oportunidad de posicionar para esta búsqueda, querrás hacer lo mismo.Pero no te detengas ahí. También debes revisar sobre qué otras cosas tratan las páginas mejor posicionadas. Por ejemplo, prácticamente todas las páginas que posicionan para “backlinks” incluyen estos tres subtemas:¿Qué son los backlinks?¿Por qué los backlinks son importantes?¿Qué tipos de backlinks existen?Esto implica que la mayoría de los usuarios desean saber las respuestas a estas preguntas, así que debes incluirlas en tu publicación.Lectura recomendada: SEO On-Page: Una Guía Práctica¿Qué son las keywords long-tail?Si anteriormente has leído algo sobre búsqueda de keywords, es posible que te hayas cruzado con el término keywords long-tail. La mayoría de las guías las describen como keywords conformadas por muchas palabras, pero esta descripción no es lo suficientemente precisa.Las keywords long-tail son consultas con poco volumen individual de búsqueda. Si bien es cierto que las keywords más extensas y específicas tienden a tener volúmenes de búsqueda más bajos, las frases de una o dos palabras también pueden ser keywords long-tail.De hecho, tenemos más de 350 millones de frases de una o dos palabras en nuestra base de datos con menos de 10 búsquedas mensuales.Búsquedas principales en los Estados UnidosVolumen: Mínimo 9Cantidad de palabras: Mínimo 2También se dice que las keywords long-tail son más fáciles de posicionar. Esto puede ser cierto, pero no siempre. Esta observación es más acertada para lo que nos gusta llamar “keywords long-tail temáticas” que para las “keywords long-tail de apoyo”.¿Te encuentras confundido? Analicemos brevemente estos dos grupos.¿Qué son las keywords long-tail de apoyo?Las keywords long-tail de apoyo son formas poco populares de buscar una temática popular.Por ejemplo, observa estas keywords:Ayuda para perder pesoCómo bajar de peso constantementeFormas de bajar de pesoAprende cómo bajar de pesoLo que necesito hacer para bajar de pesoCada una de ellas tiene menos de 50 búsquedas mensuales, pero son simplemente formas menos populares de buscar “how to lose weight” (Cómo perder peso) -- una keyword que tiene 89.000 búsquedas por mes en los Estados Unidos.Google sabe esto, y este es el motivo por el que la misma página posiciona #1 para todas esas consultas.Esto es común. Nuestra investigación muestra que el promedio de las páginas más populares también se encuentran posicionadas para otras mil keywords.Podemos aprender dos lecciones de esto:La primera es que posicionar para keywords long-tail de apoyo normalmente no suele ser más fácil que posicionar para la forma más popular de buscar la temática (por ejemplo: “cómo perder peso”). Puedes ver evidencia de ello si comparas la Dificultad de Keyword para “how to lose weight” respecto de todas las otras variaciones long-tail. Son todas elevadas.La segunda lección es que no debes optimizar tu página para posicionarte para un keyword long-tail de apoyo. Debes optimizarla para la forma más popular de buscar esa temática.¿Qué son las keywords long-tail temáticas?Las keywords long-tail temáticas son aquellas que tienen volúmenes individuales de búsqueda bajos y representan la forma más popular de buscar un determinado tema.Un buen ejemplo de una keyword long-tail temática es la consulta, “keyword cannibalization” (canibalización de palabras clave):Solamente obtiene 250 búsquedas mensuales al mes, pero el motivo de esto no es la existencia de una forma más fácil de buscar esa temática. Por el contrario, esto sucede porque a muy pocas personas les importa esta temática en particular.Hay dos lecciones que podemos aprender de esto:La primera es que suele ser más sencillo posicionarse para las keywords long-tail temáticas porque son menos competitivas. Las personas no están dispuestas a invertir demasiado tiempo y esfuerzo en posicionarse para temáticas con poco tráfico potencial.La segunda es que las keywords long-tail pueden enviar toneladas de tráfico hacia tu sitio. Solamente debes posicionarte para muchas de ellas.Puedes encontrar keywords long-tail temáticas buscando un tema en el Keywords Explorer y filtrando por volumen de búsqueda bajo y baja dificultad de keywords. Si el tema principal coincide con la keyword, normalmente será una keyword long-tail temática.Por ejemplo, el tema principal para “keto and migraines” (keto y migraña) es el mismo que la keyword.Si observamos los resultados de búsqueda para esta keyword, vemos muchas páginas que solo tienen pocos backlinks, atrayendo cientos de visitas por mes.Probablemente resultaría sencillo posicionarse para esta keyword incluso con un sitio web relativamente nuevo, siempre y cuando el mismo esté bien optimizado.ConclusionesLas keywords son la base del SEO. No podrás crear u optimizar contenido para motores de búsqueda a menos que sepas qué es lo que las personas están buscando y qué resultados quieren ver.¿Quieres aprender más sobre el estudio de keywords? Lee nuestra Guía completa de estudio de keyword.¿Estás buscando algunos tips sencillos para hacer el estudio de keywords? Aquí tenemos 6 de ellos.¿Tienes preguntas? Háblame en Twitter.Traducido por Agencia Eleven. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué son las Keywords? Cómo usarlas para SEO"
    },
    {
      "level": "H2",
      "text": "¿Por qué las keywords son importantes?"
    },
    {
      "level": "H2",
      "text": "¿Cómo aparecer en Google para las keywords?"
    },
    {
      "level": "H3",
      "text": "Pago por Clic (PPC)"
    },
    {
      "level": "H3",
      "text": "Optimización de Motores de Búsqueda (SEO)"
    },
    {
      "level": "H2",
      "text": "¿Cómo encontrar keywords?"
    },
    {
      "level": "H2",
      "text": "¿Cómo elegir las keywords?"
    },
    {
      "level": "H3",
      "text": "Volumen de búsqueda"
    },
    {
      "level": "H3",
      "text": "Intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "‘Valor’"
    },
    {
      "level": "H3",
      "text": "Dificultad de Keyword"
    },
    {
      "level": "H2",
      "text": "¿Cómo optimizar para las keywords?"
    },
    {
      "level": "H2",
      "text": "¿Qué son las keywords long-tail?"
    },
    {
      "level": "H3",
      "text": "¿Qué son las keywords long-tail de apoyo?"
    },
    {
      "level": "H3",
      "text": "¿Qué son las keywords long-tail temáticas?"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}