{
  "url": "https://ahrefs.com/blog/es/que-hay-nuevo-en-ahrefs-jun-2024/",
  "slug": "que-hay-nuevo-en-ahrefs-jun-2024",
  "title": "¿Qué novedades nos trae Ahrefs? (Junio 2024)",
  "description": "Descubre las novedades que trae Ahrefs para ti en junio de 2024.",
  "content": "Rebekah Encargada del Marketing en Ahrefs. Cuando Rebekah no está desafiando a las reglas de la escritura, probablemente la encontrarás jugando videojuegos o comiendo. Tal vez incluso las dos cosas juntas. Contenido Este mes presentamos traducciones con IA, IndexNow en Site Audit, Índice de presencia, valor del tráfico, y mucho más Empecemos de inmediato.Site ExplorerMétrica de impresionesHemos añadido una nueva métrica llamada Impresiones bajo las vistas de búsqueda General y Orgánica en Resumen. Impresiones te muestra el número de búsquedas que tu objetivo recibe por las palabras clave para las que se posiciona en el top 10.Gráficos del Índice de presencia y Valor del tráficoTambién hemos añadido dos gráficos increíblemente útiles en Resumen: los verás cuando uses el modo Competidores.El primero, Índice de presencia, muestra la cuota de mercado de búsqueda orgánica de tu objetivo a lo largo del tiempo en comparación con los competidores que has especificado.El segundo, Índice del valor del tráfico, muestra lo mismo, pero en lugar del tráfico, se centra en el coste total pagado de ese tráfico.Puedes utilizar estos gráficos como un excelente punto de partida para el análisis y la elaboración de informes.Por ejemplo, podemos ver que bestbees.com se ha venido centrando en la búsqueda orgánica desde hace un tiempo y ha ido haciéndose una importante cuota de mercado orgánico a lo largo del tiempo.Keywords ExplorerTraducciones con IAAhora puedes usar IA para traducir una lista de palabras clave guardadas a varios idiomas y dialectos.Solo tienes que abrir cualquier lista de palabras clave guardada y hacer clic en ESTE botón Traducir. Desde aquí, selecciona un idioma y una ubicación, y pulsa traducir.Verás algunas variaciones de traducciones para cada palabra clave, junto con estadísticas clave como la Dificultad de las palabras clave (KD), el volumen de búsqueda y mucho más. Esto te ayudará a simplificar y agilizar tus procesos de localización de contenido.Disponible para: Nuevos planes exclusivamente.Site AuditIndexNow en Site AuditIndexNow es una herramienta para que los sitios web le digan a los motores de búsqueda cuándo han añadido contenido nuevo, actualizado páginas existentes o eliminado las antiguas.Así que ya no tendrás que esperar a que los rastreadores descubran cambios en tus páginas: ahora puedes usar la configuración de IndexNow en Site Audit para notificar instantáneamente a los motores de búsqueda sobre cambios importantes en el contenido de tu sitio web.Ve a los ajustes de Rastreo y especifica tu clave API de IndexNow Ve a Page Explorer y filtra las URL que quieres enviarHaz clic en el botón IndexNowTambién hemos añadido una nueva cuestión: “Páginas para enviar a IndexNow”.Al hacer clic aquí, se seleccionan automáticamente las páginas que Site Audit recomienda para su envío, a saber:Páginas con cambios de contenidoURL redirigidas recientementeURL eliminadas recientementeLee nuestra publicación en el blog sobre IndexNow para obtener más información.Rank TrackerInformes mejorados de Resumen y EtiquetasHemos renovado dos informes de Competidores: Resumen y Etiquetas. Ahora:Cargan más rápidoIncluyen más métricasTienen columnas personalizablesGráfico del historial de funcionalidades SERPEncuentra el gráfico del historial de funcionalidades SERP en los informes Resumen, Historial de clasificación y Resumen de competidores.Coloca el cursor sobre el gráfico para ver los detalles y realizar un seguimiento de las actualizaciones de Ahrefs y Google. Como siempre, utiliza el botón de la parte superior derecha para exportar tus datos.GeneralAnálisis por lotes Batch Analysis 2.0En primer lugar, Batch Analysis 2.0 ya está activo.En la primera versión de BA, solo se podían analizar hasta 200 objetivos. Pero ahora puedes ejecutar una búsqueda de hasta 1000 objetivos a la vez: Batch Analysis generará un informe con métricas importantes de SEO como la clasificación del dominio, las palabras clave orgánicas y el tráfico, las estimaciones del valor del tráfico y mucho más.Usa el selector de países en la parte superior para ver los datos de una ubicación específica o exporta tus datos a un archivo CSV.Curso API para principiantesHemos publicado un curso de formación gratuito sobre la API de Ahrefs diseñado para personas que parte de cero en conocimientos técnicos. No importa si no sabes nada sobre API, tras estos siete vídeos cortos podrás ejecutar solicitudes por tu cuenta y sacarle el máximo potencial a los datos de Ahrefs.Hacer el curso–Eso es todo por este mes. Echa un vistazo al registro de cambios de Ahrefs para obtener más actualizaciones y deja cualquier solicitud de nuevas funcionalidades en nuestro Canny. ¡Disfruta! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué novedades nos trae Ahrefs? (Junio 2024)"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Site Audit"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah"
}