{
  "url": "https://ahrefs.com/blog/es/redaccion-contenido/",
  "slug": "redaccion-contenido",
  "title": "¿Qué es la redacción de contenidos? 13 Consejos para crear contenido maravilloso",
  "description": "Con cientos de piezas de contenido a nuestras espaldas, sabemos cómo crear contenido de gran calidad. Aquí van 13 mejores prácticas que hemos aprendido con los años.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido En Ahrefs, escribimos mucho contenido. Tenemos más de 320 posts en el blog y más de 200 vídeos publicados en nuestro canal de YouTube—la mayoría de ellos guionizados.No hace falta decir que sabemos un par de cosas sobre crear contenido increíble que tu audiencia quiera consumir.En este post vamos a cubrir las 13 mejores prácticas que puedes usar en tu propia redacción de contenido. Pero antes, algunos puntos básicos:¿Qué es la redacción de contenido?¿Por qué la redacción de contenido es importante?Las mejores prácticas para la redacción de contenido¿Qué es la redacción de contenido?La redacción de contenido es el proceso de investigar, planificar, escribir, editar y publicar contenido para la web. Puede ser un post de blog, un guión para un vídeo, una página de ventas—cualquier cosa que se publique online.¿Por qué la redacción de contenido es importante?La redacción de contenido es importante porque el contenido tiene el poder de ayudar a atraer y retener clientes.Se llama marketing de contenidos, y es por lo que estás leyendo sobre redacción de contenidos en el blog de Ahrefs. Al formarte sobre su importancia y las mejores prácticas para redactar contenido, esperamos incrementar el conocimiento, interés y demanda de nuestro producto.Las mejores prácticas para la redacción de contenidoTodo el mundo tiene su propia opinión sobre cómo escribir el mejor contenido. Las mejores prácticas que comparto debajo son solamente las que he descubierto que son ciertas a lo largo de los años y que nos han ayudado a prosperar en nuestros esfuerzos de creación de contenido.1. Usa una plantillaNo tienes por qué empezar a redactar contenido de la nada. La mayoría cae en unos pocos tipos—listicles, tutoriales, reviews y demás. Gracias a eso, existen plantillas. Puedes usarlas como base y rellenar con lo que investigues.De hecho, estamos usando una plantilla para este mismo post.¿Cómo sabes qué plantilla usar?Depende de tu objetivo. Pero si quieres que tu contenido escrito tenga las máximas oportunidades de posicionarse alto en Google y atraer tráfico orgánico, elige una que se alinee con lo que los usuarios buscan.Por ejemplo, si buscas en Google “redacción de contenido” (lo que probablemente ya hiciste) verás que hay unos pocos posts tipo lista posicionando.Por eso elegimos este ángulo—porque los resultados mejor posicionados son una buena aproximación para lo que los usuarios quieren ver y, como resultado, lo que es más probable que Google posicione.2. Crea un esquema probadoAunque una plantilla es suficiente para despegar, puede que no sepas con precisión sobre lo que vas a escribir.Por ejemplo, nos encontraríamos bastante rápido con el bloqueo del escritor si intentamos escribir este post de principio a fin sin crear un esquema.Aquí tienes el aspecto que tenía en el caso de este artículo:¿Cómo averiguamos qué puntos incluir? Algunos de los puntos fueron nuestras propias ideas, pero también nos inspiramos en las páginas mejor posicionadas.Más concretamente, buscamos temas y puntos en común entre los mismos para entender mejor el tipo de preguntas para las que la gente quería respuestas y el tipo de consejos que estaban buscando.Por ejemplo, usando el informe on-page gratuito de la barra de herramientas SEO de Ahrefs, podemos ver un par de temas comunes en los subtítulos de las páginas mejor posicionadas.Te darás cuenta a medida que leas este post que hemos incluido puntos parecidos.3. Haz que merezca la pena compartirloLa gente comparte contenido por todo tipo de razones. Jonah Berger destaca unas pocas en su bestseller “Contagioso”. La gente comparte cosas porque:Les hace quedar bien o les ayuda a argumentar su propio punto de vista o narrativa.Les hace sentir algún tipo de emoción, por ejemplo, ira, sorpresa, felicidad, etc.Está relacionado con los acontecimientos actuales.Ofrece un valor práctico o utilidad.Ya ha sido compartido por muchas otras personas.Vamos a enfocar nuestra atención en la #5.Conseguir algunos compartidos al principio es la clave para poner esta rueda en marcha, y una forma de hacerlo es construir “activadores de compartir” (share triggers) en tu contenido.Puedes encontrar “activadores de compartir” buscando razones comunes para enlazar en el perfil de enlaces de una página—ya que los enlaces son una forma de compartir.Aquí tienes cómo:Ve a Keywords Explorer de AhrefsBusca un tema sobre el que estés escribiendoMira el resumen de la página de resultadosEncuentra un artículo similar con muchos dominios de referenciaHaz clic en el número en la columna de enlacesEcha un vistazo a la columna Ancla y enlace entrante Por ejemplo, si hacemos esto con el post de marketing de afiliados de Antevenio, podemos ver que la mayor parte de la gente lo enlaza por su explicación del término, algo que debes cuidar si vas a tratar el mismo tema.Sin embargo, si analizamos esto en inglés, vemos que el post de marketing de afiliados (affiliate marketing) de BigCommerce, está siendo enlazado sobre todo por las estadísticas que menciona. Si vas a escribir sobre este tema, además de poner énfasis en la explicación, puede que te ayude mencionar esas estadísticas u otras parecidas.4. Dale a tu post un ángulo únicoCada día se publican casi 6 millones de posts en blogs. Si quieres competir, tienes que destacar. Diferénciate atacando el tema que elijas desde un ángulo único.Aquí va un ejemplo. La procrastinación no es un tema nuevo. A pesar de eso, el post de Tim Urban sobre la procrastinación es uno de los más populares de su web (o quizá incluso de Internet). ¿Por qué? Porque lo abordó desde un ángulo que nadie había visto antes.En lugar de despotricar en plan autoayuda sobre los peligros de la procrastinación, decidió explicar por qué sucede usando ilustraciones bonitas: el Mono de Gratificación Instantánea, El Monstruo del Pánico, etc.Aunque no existen formas seguras de encontrar “ángulos”, aquí van unos pocos modelos mentales que puedes considerar: Experiencia personal – ¿Has probado algo antes? Cuéntales tu experiencia y certificaciones SEO. Autoridad – ¿Eres un experto en el campo que puede ofrecer información única? Entonces, no seas tímido. Como alternativa, si no eres un experto, ¿puedes entrevistar a uno? Hicimos eso con nuestro post sobre penalizaciones de Google. Haz crowdsourcing – Recibe las opiniones de unos pocos expertos, como hicimos en nuestro post de descripción de empleo SEO. Datos – Ofrece pruebas y cifras que respalden afirmaciones conocidas en tu nicho. Mira nuestros estudios sobre link building recíproco y longitud de posts. Llevar la contraria – ¿Qué pasa si haces lo contrario que otros hicieron?5. Establece credibilidadNo esperes que la gente te crea desde el principio. Diles por qué deberían creerte. ¿Por qué a ti de entre todas las personas?¿Eres un experto en el sector? ¿Tienes las credenciales que lo prueban? ¿Puede la gente responder por ti?¿Tienes datos o pruebas que respalden tus afirmaciones?¿Has hecho lo que dices antes? ¿Lo has experimentado o probado?Como puedes ver, la mayoría de las preguntas tienen que ver con tu ángulo. El ángulo que elijas para tu tema te ayudará a establecer la credibilidad que necesitas. Pero no pares ahí. Díselos.Haz scroll hasta la introducción de este post. Te dije que tenemos montones de experiencia creando y publicando contenido—cientos de ellos, de hecho.¿Ves lo que hice ahí? 😉6. Enseña, no digasDar consejos no es fácil. Pero no dejes a tu audiencia en la estacada. Muéstrales exactamente qué quieres decir y cómo se puede hacer. Incluye siempre ejemplos de lo que estás hablando.Por ejemplo, (¿te das cuenta de lo que he hecho aquí?), cuando hablamos sobre crear objetivos SEO, no solo te ofrecemos el marco. Te damos tres ejemplos de objetivos distintos y su aspecto al natural.7. Elabora un título que sea cautivadorLa gente no hará clic en tu post si el titular es triste y poco inspirador.Necesitarás elaborar titulares irresistibles que capten la atención de las personas y hagan que quieran aprender más.¿Cómo? Usa nuestra fórmula en tres pasos: Elige un formato – El formato de contenido que elijas (listicle, guía, review, etc.) determinará el aspecto de tu titular. Añade un ángulo ganador – Si has elegido tu ángulo (a partir del punto #3), asegúrate de decírselo al lector potencial. Humanízalo – Usa adjetivos o metáforas parecidas a cómo explicarías el artículo de forma casual a tu mejor amigo.Lectura recomendada: Cómo escribir un título irresistible en 3 pasos fáciles8. Arranca tu introducción con la fórmula PASLos titulares convencen a las personas de hacer clic. Las introducciones, de leer.Usa la fórmula Problema-Agitar-Solucionar (PAS) para crear una introducción atractiva. Usamos esto bastante a menudo en nuestro blog.¿Cómo funciona? Comienza describiendo el problema:Después, agitas el problema profundizando en el dolor:Finalmente, les muestras el camino ofreciéndoles una solución:9. Asegúrate de tu post es fácil de leer con la fórmula ASMRNo hay nada más desalentador que un ladrillo de texto.Extracto de “Escribiendo en pocas palabras” (traducción del original de Paul Graham, Write, Briefly).Si tu artículo se parece a esto, echarás a la gente. Divídelo.El buen contenido crea lectura sin esfuerzo. Usa la fórmula ASMR para diseñar tu contenido para una lectura fácil: Anota – Incluye notas al pie, citas, cajas de destacados, y otros elementos. Sintetiza frases y párrafos – Usa el editor Hemingway (o Lorca si escribes en español) para encontrar frases largas y complejas y acortarlas. Multimedia – Usa vídeos, imágenes, GIFs y tuits para ilustrar tus afirmaciones. Recita tu contenido en alto – Descubre áreas donde tu redacción no fluya adecuadamente. 10. Escribe como hablasLa redacción de contenidos web es amistosa y personal. Es como hablar a un amigo. No hay necesidad de colocar palabras complicadas o escribir como si estuvieras publicando en Nature. Tu objetivo es comunicar, no impresionar a la gente con tu amplio vocabulario. Así que mantenlo casual y escribe como hablas.11. Recibe feedback sobre lo que escribasComo creador, estás demasiado encariñado con tu trabajo. No serás capaz de encontrar los fallos. Por eso una segunda opinión es tan valiosa.De hecho, en Ahrefs, cada post del blog y guión que escribimos está sujeto a ese nivel de escrutinio. Nos turnamos para leer los borradores del resto y ofrecer feedback. Señalamos cosas como agujeros en la lógica, falta de flujo, puntos poco claros, frases mal enunciadas y demás.Incluso permitimos que nuestros lectores sepan que cada artículo no es el trabajo de una sola persona. En lugar de eso, es el esfuerzo de mucha gente trabajando unida para hacerlo genial.Incluso si trabajas solo, puedes recibir opiniones de otra persona. Podría ser tu pareja, tu familia o incluso tus compañeros. Si lo necesitas, únete a comunidades de redacción.Sus opiniones harán que tu trabajo mejore.12. Responde preguntas que la gente está haciendoSi la gente busca respuestas a sus preguntas, sabes que esas preguntas son buenos temas para escribir.La forma más fácil de encontrar estas preguntas es usar una herramienta de keyword research gratuita. Aquí tienes cómo hacerlo: Ve al generador de palabras clave gratuito de AhrefsIntroduce un tema amplio relacionado con tu nicho o sitio web (por ejemplo, café o té)Activa la pestaña de preguntasVerás una lista de preguntas relacionadas al tema que has introducido. Estas preguntas se listan por orden de volumen de búsquedas, es decir, en promedio, cuántas veces busca la gente al mes tu palabra clave objetivo.Cuanto más alto sea el volumen de búsqueda, más gente lo está buscando.Mira la lista y anota todas las preguntas relevantes que podrías potencialmente responder con un post.Lectura recomendada: Cómo hacer investigación de palabras clave para SEO13. Mantén un libro de lugares comunes¿Cómo se te ocurren de forma constante ángulos únicos e ideas para tu contenido?La respuesta fácil es que como redactor de contenido, siempre deberías estar investigando. Ya sean libros, vídeos de YouTube, artículos o podcasts, deberías consumir contenido e incrementar lo que sabes de tu campo.Después, guarda tus recién adquiridos conocimientos en un libro de lugares comunes o commonplace.¿Qué es un libro de lugares comunes?Según Ryan Holiday, un libro de lugares comunes es:… un repositorio centralizado de ideas, citas, anécdotas, observaciones e información con la que te encuentras durante tu vida y actividades formativas. El propósito del libro es registrar y organizar estas joyas para usarlas después en tu vida, en tu empresa, en tu escritura, charlas o lo que sea que haces. Con este recurso a tu lado, no tienes que buscar ideas cuando llega el momento de escribir. Simplemente retíralas de tu libro de lugares comunes.Personalmente, mantengo mi libro de lugares comunes en Notion. Aquí va un vistazo de cómo es:Esta es mi primera parada antes de empezar el borrador de cualquiera de mis posts para el blog.Reflexiones finalesPara escribir contenido brillante, tienes que escribir.Pero si esperas a que la inspiración llame a tu puerta antes de tomar el papel y el lápiz, nunca publicarás nada. En lugar de eso, recomiendo que te comprometas con un calendario editorial. Básicamente es una agenda de cuándo quieres publicar nuevo contenido y qué contenido quieres publicar.Establecer plazos hará que seas sincero, evitarás la procrastinación y te obligará a publicar.Como el famoso dramaturgo Somerset Maugham dijo una vez:Escribo solo cuando me llega la inspiración. Por suerte, me llega cada mañana a las nueve en punto. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué es la redacción de contenidos? 13 Consejos para crear contenido maravilloso"
    },
    {
      "level": "H2",
      "text": "¿Qué es la redacción de contenido?"
    },
    {
      "level": "H2",
      "text": "¿Por qué la redacción de contenido es importante?"
    },
    {
      "level": "H2",
      "text": "Las mejores prácticas para la redacción de contenido"
    },
    {
      "level": "H3",
      "text": "1. Usa una plantilla"
    },
    {
      "level": "H3",
      "text": "2. Crea un esquema probado"
    },
    {
      "level": "H3",
      "text": "3. Haz que merezca la pena compartirlo"
    },
    {
      "level": "H3",
      "text": "4. Dale a tu post un ángulo único"
    },
    {
      "level": "H3",
      "text": "5. Establece credibilidad"
    },
    {
      "level": "H3",
      "text": "6. Enseña, no digas"
    },
    {
      "level": "H3",
      "text": "7. Elabora un título que sea cautivador"
    },
    {
      "level": "H3",
      "text": "8. Arranca tu introducción con la fórmula PAS"
    },
    {
      "level": "H3",
      "text": "9. Asegúrate de tu post es fácil de leer con la fórmula ASMR"
    },
    {
      "level": "H3",
      "text": "10. Escribe como hablas"
    },
    {
      "level": "H3",
      "text": "11. Recibe feedback sobre lo que escribas"
    },
    {
      "level": "H3",
      "text": "12. Responde preguntas que la gente está haciendo"
    },
    {
      "level": "H3",
      "text": "13. Mantén un libro de lugares comunes"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}