{
  "url": "https://ahrefs.com/blog/es/rediseno-web-seo/",
  "slug": "rediseno-web-seo",
  "title": "Cómo evitar arruinar el SEO durante el rediseño de una web",
  "description": "Es muy fácil destrozar el SEO durante el rediseño web. Te contamos lo que puede salir mal y cómo solucionarlo.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido Es muy fácil destrozar el SEO durante el rediseño de un sitio web. ¿Qué puede salir mal?Pérdida de rankings y tráfico.Pérdida de link equity.Páginas rotas.Carga lenta de las páginas.Mala experiencia móvil.Enlaces internos rotos.Contenido duplicado.Por ejemplo, este sitio eliminó cerca del 15% de las páginas orgánicas (línea amarilla) durante el rediseño, lo que se tradujo en una pérdida de tráfico orgánico de casi el 50% (línea naranja). Curiosamente, ni siquiera el crecimiento de los dominios de referencia (línea azul) posterior ayudó a recuperar el tráfico.Afortunadamente, no es tan difícil evitar estos y otros problemas comunes: basta con seguir seis reglas.1. Guarda una copia de seguridad del sitio antiguoEs fácil pasarlo por alto, pero puede salvarte del apuro. Una copia de seguridad garantiza la restauración del sitio original si algo va mal.Pide al desarrollador del sitio que esté preparado para esta estrategia alternativa. Lo único que tendrá que hacer es redirigir el dominio a la carpeta con el sitio antiguo y los cambios surtirán efecto casi al instante. Asegúrate también de que no sobrescriben ninguna base de datos actual.También puedes hacer tú una copia de seguridad. Comprueba si tu proveedor de hosting tiene una herramienta de copia de seguridad o utiliza un plugin como Updraft, si usas WordPress, o un CMS similar.2. Comprueba la compatibilidad de la web con dispositivos móviles y Core Web VitalsLa mejor forma de asegurarse de que un sitio nuevo cumple las directrices de experiencia de página de Google es comprobar su Core Web Vitals (CWV) y su compatibilidad con dispositivos móviles antes de ponerlo en funcionamiento.La cuestión es que el rediseño de un sitio web puede afectar gravemente a su velocidad, estabilidad, capacidad de respuesta y experiencia móvil. Algunos defectos de diseño serán fáciles de detectar, como el uso excesivo de animaciones o un diseño que no se adapte correctamente a los dispositivos móviles, pero otros, como el código no optimizado, no.Pide al desarrollador de tu sitio que realice pruebas de compatibilidad móvil y CWV en las páginas de la plantilla en cuanto estén listas (no es necesario probar cada una de las páginas) y solicita el informe. Por ejemplo, deberían poder ejecutar Google Lighthouse en un sitio web protegido por contraseña.CONSEJOPuedes realizar personalmente estas pruebas en sitios protegidos por contraseña con Ahrefs si tienes el plan Avanzado. Cuando configures un rastreo nuevo, haz clic en la pestaña Configuración de rastreo.Para probar las versiones de escritorio y móvil, tendrás que ejecutar dos pruebas separadas con el agente de usuario adecuado:La opción de autenticación está justo debajo:Por último, obtén una clave API gratuita de CWV y pégala aquí (solo tienes que hacerlo una vez por proyecto):Una vez finalizado el rastreo, busca los problemas resaltados en el informe All issues.3. Realiza una auditoría del sitio antes y después del lanzamientoUna auditoría SEO descubre los problemas SEO de tu sitio. Si se realiza antes y después del lanzamiento, se detectarán fácilmente nuevos problemas potenciales causados por el rediseño, especialmente los que realmente importan, como:Páginas no indexadas no deseadas.Sitios accesibles tanto como http como https.Páginas rotasAsí que antes de lanzar la nueva versión del sitio, haz clic en New crawl en Site Audit y luego, una vez más, justo al lanzar el sitio.A continuación, después del rastreo, dirígete al informe All issues y mira la columna Change: los errores encontrados entre rastreos se mostrarán en rojo (los errores corregidos en verde).Es posible que quieras dar más prioridad a unos problemas que a otros. Aquí tienes nuestra opinión sobre los problemas técnicos de SEO más importantes.RecomendaciónPuedes acceder al historial de auditorías de sitios haciendo clic en el nombre del proyecto en Site Audit. 4. Mantén la estructura de URL anteriorPor estructura de URL me refiero a la forma en que se organizan y formatean las direcciones web. Por ejemplo, estos se considerarían cambios en la estructura de las URL:ahrefs.com/blog a ahrefs.com/blog/ahrefs.com/blog a ahrefs.com/resources/blogahrefs.com/blog a blog.ahrefs.comahrefs.com/site-audit a ahrefs.com/site-audit-toolAlterar la estructura en un proceso incontrolado puede dar lugar a:Redirecciones rotas: redirecciones que llevan a páginas inexistentes o inaccesibles.Backlinks rotos: enlaces externos que apuntan a páginas eliminadas o desplazadas de su sitio.Enlaces internos rotos: enlaces internos del sitio que no funcionan, dificultando la navegación por el sitio y la imposibilidad de descubrir el contenido.Páginas huérfanas: páginas no enlazadas desde el sitio, lo que dificulta que los usuarios y los motores de búsqueda las encuentren.Naturalmente, hay que mantener la estructura de URL anterior a no ser que tengas la absoluta certeza de saber lo que es lo correcto. En este caso, tendrás que colocar algunas redirecciones. Además, asegúrate de enviar un mapa del sitio a través de Google Search Console para ayudar a Google a reflejar los cambios en tu sitio con mayor rapidez.CONSEJOGoogle también recomienda enviar un sitemap nuevo si vas a añadir muchas páginas del tirón. Es posible que te interese hacerlo, si ese es tu caso.5. Mantén las páginas orgánicas importantesLos rediseños suelen incluir algún tipo de recorte de contenidos o simplemente la eliminación arbitraria de contenidos antiguos. No obstante, hagas lo que hagas, es fundamental que mantengas las páginas que ya están en los primeros puestos.El tráfico es una de las razones, pero dado que estas páginas ya están posicionadas, lo más probable es que tengan algunos backlinks que podrías perder.Para asegurarte de que no estás eliminando nada que sea bueno, utiliza dos informes en Site Explorer de Ahrefs: Páginas principales y Mejor por enlaces.El informe Páginas principales es una lista de todas las páginas posicionadas de tu sitio entre las 100 primeras, con datos SEO y ordenadas por tráfico de forma predeterminada. Así, con un solo clic en la parte izquierda, verás una lista de los mejores “generadores de tráfico”.El informe Mejor por enlaces sigue la misma lógica, pero se centra en los enlaces (tanto externos como internos) y muestra todas las páginas rastreadas de tu sitio (no solo las que están entre las 100 primeras).También puedes introducir cualquier página en Site Explorer de Ahrefs y ver si se puede eliminar sin dañar el rendimiento orgánico del sitio.RECOMENDACIÓNSi parte del rediseño es una limpieza de inventario, puedes seguir recibiendo tráfico de productos que ya no ofreces si creas una página de “archivo” y enlazas a un lugar donde los visitantes puedan encontrar más productos similares. Los ecommerce y las marcas de ferretería lo hacen a menudo.De esta forma, puedes seguir posicionándote con términos relacionados, y la experiencia del usuario es mejor que simplemente redirigir los productos antiguos a los nuevos.Lecturas complementariasSigue nuestro proceso de auditoría de contenidos (plantilla incluida)6. Reduce al mínimo las modificaciones de las páginas mejor posicionadasPor último, si te encuentras en una situación en la que el diseño nuevo impone cambios significativos en tus páginas mejor posicionadas, ten mucho cuidado al alterar los siguientes elementos:Palabras clave en el texto, el título y los H1: cambiar las palabras clave puede alterar la relevancia de la página para las consultas correspondientes. Por ejemplo, si la página de un producto se posiciona para “patinete para niños”, puedes perder esa posición si empiezas a eliminar la frase de las partes cruciales del contenido.Profundidad del contenido: ampliar o reducir el contenido ha de hacerse con la intención de satisfacer mejor las necesidades del usuario, aportar más valor o aclarar la información existente (es decir, la intención de búsqueda). Ten en cuenta que Google premia el contenido útil y orientado a las personas, y no necesariamente la redacción creativa y persuasiva.Enlaces internos: cambiar o eliminar algunos enlaces internos no debería ser perjudicial, pero hay que ser táctico al respecto: pregúntate si algún cambio en particular podría perjudicar el ranking. Ten en cuenta que los enlaces internos favorecen el link equity y ayudan a Google a comprender el contexto de las páginas.Distancia de una página a la página de inicio: mantén las páginas de alto valor cerca de la página de inicio para señalar su importancia a los motores de búsqueda.Marcado Schema: cualquier cambio debe tener como objetivo describir con precisión el contenido y aprovechar las propiedades elegibles de Schema.Velocidad de la página: no abuses de gráficos pesados, animaciones ni vídeos. Como ya hemos dicho, y merece la pena reiterarlo, asegúrate de probar previamente una versión de prueba para CWV y realiza una auditoría del sitio justo después del lanzamiento.Reflexiones finalesAunque un rediseño web puede parecer un buen momento para introducir algo de SEO, hay que pensar en el tráfico y el valor de los backlinks que el sitio tiene. Si cambian demasiadas cosas del tirón, no sabrás qué ha funcionado y por qué y, lo que es más importante, qué no ha funcionado y cómo solucionarlo.La verdad es que el SEO siempre consiste en experimentar. Se pueden tener ciertas suposiciones, pero nunca se sabe realmente lo que va a pasar.¿Tienes preguntas? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo evitar arruinar el SEO durante el rediseño de una web"
    },
    {
      "level": "H2",
      "text": "1. Guarda una copia de seguridad del sitio antiguo"
    },
    {
      "level": "H2",
      "text": "2. Comprueba la compatibilidad de la web con dispositivos móviles y Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "3. Realiza una auditoría del sitio antes y después del lanzamiento"
    },
    {
      "level": "H2",
      "text": "4. Mantén la estructura de URL anterior"
    },
    {
      "level": "H2",
      "text": "5. Mantén las páginas orgánicas importantes"
    },
    {
      "level": "H2",
      "text": "6. Reduce al mínimo las modificaciones de las páginas mejor posicionadas"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}