{
  "url": "https://ahrefs.com/blog/es/republicar-contenido/",
  "slug": "republicar-contenido",
  "title": "Volver a publicar contenido: cómo actualizar publicaciones de blog antiguas para SEO",
  "description": "En esta guía, aprenderá cómo volver a publicar publicaciones de blogs antiguas para obtener más tráfico orgánico en tres sencillos pasos.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido No todas las publicaciones de blog que publiques se posicionarán en los motores de búsqueda. Incluso si has realizado una investigación de palabras clave y has escrito contenido excelente, no siempre es posible hacer las cosas bien desde el primer intento.Por ejemplo, publicamos una publicación sobre “qué es el SEO” a fines de 2018. No fue un completo fracaso, pero nunca se ubicó por encima de la parte inferior de la página uno ni recibió más de 500 visitas orgánicas estimadas por mes.Entonces, en agosto de 2019, reescribimos y volvimos a publicar la publicación. El tráfico prácticamente se duplicó durante la noche y siguió subiendo.Lo hemos hecho varias veces con resultados positivos. Si observas la cantidad de publicaciones republicadas en el blog en el Explorador de contenido de Ahrefs, verás que hemos vuelto a publicar 75 de nuestras más de 200 publicaciones al menos una vez.En esta guía, aprenderás cómo volver a publicar publicaciones de blogs antiguas para obtener más tráfico orgánico en tres sencillos pasos.Encuentra páginas de bajo rendimiento con problemas de contenidoActualiza el contenidoVuelve a publicar la publicaciónhttps://www.youtube.com/watch?v=9HWna4hK47cPaso 1. Encuentra páginas de bajo rendimiento con problemas de contenidoSi deseas aumentar el tráfico orgánico, volver a publicar cualquier publicación anterior no funcionará. Debes encontrar las que tienen un rendimiento inferior debido a problemas de contenido.Para ello, sigue los pasos de este diagrama de flujo:Repasemos cada uno de estos pasos con más detalle.Encuentra páginas de bajo rendimientoAsegúrate de que no sea una página nuevaDescartar factores de backlinksAsegúrese de que sea una consulta ‘informativa’A. Encuentra páginas de bajo rendimientoSi tu publicación se ubica entre los tres primeros por tu palabra clave objetivo, entonces probablemente no sea un gran candidato para volver a publicar porque el riesgo supera la recompensa. Ya está funcionando bien, por lo que volver a publicar podría hacer más daño que bien.Por esa razón, debes buscar publicaciones que se posicionen más abajo para tu palabra clave principal.Puedes encontrar esas palabras clave en Google Search Console. Simplemente diríjete al informe Resultados de la búsqueda, activa el selector de posición promedio y luego filtra el informe por palabras clave con una posición promedio de clasificación de cuatro o más.Examina la lista de palabras clave para los temas a los que se dirige con publicaciones de blog.Por ejemplo, escribimos una publicación sobre guest blogging, así que sé que esta es una palabra clave a la que nos dirigimos.Solo se que Search Console solo muestra posiciones promedio de posicionamiento, por lo que generalmente no es una representación particularmente precisa de tu posición de clasificación real. Para obtener datos de clasificación más precisos, pega su blog en el Explorador de sitios de Ahrefs y luego diríjete al informe Páginas principales para ver las publicaciones que generan la mayor cantidad de tráfico de búsqueda.Entonces es solo un caso de examinar el informe en busca de publicaciones que no tengan una clasificación alta para tu palabra clave objetivo principal. La mejor manera de hacer esto es mirar las columnas URL, Palabra clave principal y Posición.Por ejemplo, si revisamos el informe de nuestro blog, vemos nuestra guía para blogs invitados en la posición cuatro para ” guest blogged”.A partir de la URL, queda claro que nuestra palabra clave objetivo aquí es “guest blogging”, pero como la palabra clave principal es otra cosa, es muy poco probable que estemos clasificando en las tres primeras posiciones para “guest blogging”.Si pulsamos el cursor de “Palabras clave”, podemos confirmarlo buscando esa palabra clave y comprobando la posición en el ranking.Ten en cuenta que si tu publicación no está dirigida a una palabra clave “significativa” con potencial de tráfico de búsqueda, probablemente no sea la mejor candidata para volver a publicarla. Por ejemplo, nuestra publicación sobre cómo iniciar una campaña de construcción de enlaces rápidamente no se dirige a una palabra clave específica, por lo que no volveríamos a publicar esa publicación para obtener más tráfico de los motores de búsqueda.B. Asegúrate de que no sea una página nuevaNo tiene sentido volver a publicar publicaciones que se publicaron recientemente. Se necesita tiempo para que las publicaciones atraigan backlinks y para que Google comprenda dónde merecen posicionarse.Por esa razón, no solemos volver a publicar publicaciones a menos que tengan al menos doce meses de antigüedad.Puedes comprobar rápidamente la antigüedad de una publicación mirando la fecha de publicación.Parece que nuestra guía de blogs invitados se publicó hace más de dos años, por lo que esta está lista para una actualización.C. Descartar factores de backlinksEl contenido no siempre es la razón por la que tus publicaciones no se clasifican. A veces se debe a que aquellos que le superan en rango tienen vínculos de retroceso de mayor calidad y “autoridad de enlace”.Para verificar si ese es el caso, busca tu palabra clave en el Explorador de palabras clave, desplázate hasta la descripción general de SERP, luego mira las calificaciones de dominio (DR) y las calificaciones de URL (UR) de los sitios y páginas que lo superan.Si hacemos esto para “guest blogging”, vemos algunas páginas de menor autoridad de sitios de menor autoridad que nos superan en rango.Eso nos dice que probablemente sea un problema de contenido. Si tuviéramos que actualizar y volver a publicar la publicación, es muy probable que podamos clasificar al menos una o dos posiciones más arriba.Sin embargo, si hacemos lo mismo con la palabra clave, “cómo mejorar el SEO”, vemos lo contrario. Todas las publicaciones que nos superan tienen puntuaciones UR más altas, lo que indica una mayor autoridad a nivel de página. Entonces, en este caso, probablemente sea un problema de autoridad de enlace, no un problema de contenido.D. Asegúrate de que sea una consulta ‘informativa’Solo porque hay páginas que te superan en rango con menos backlinks, eso no siempre significa que existe la oportunidad de obtener más tráfico al volver a publicar tu publicación. Si el producto, la categoría o las páginas de destino están por encima de ti, es posible que los buscadores no estén buscando publicaciones de blog.Por ejemplo, está claro por los títulos y las URL que las páginas que nos superan en “blogs invitados” son publicaciones de blog. Buena seńal. Nos dice que el tipo de contenido que los buscadores quieren ver son publicaciones de blog.Sin embargo, es una historia completamente diferente para el “tráfico del sitio web”. Todas las páginas que nos superan son páginas de destino con herramientas gratuitas.Es poco probable que podamos superarlos con solo actualizar nuestro contenido. La mayoría de las personas buscan herramientas aquí, no publicaciones de blogs.Paso 2. Actualiza el contenidoSi has encontrado una publicación que podría necesitar una actualización, no puedes simplemente actualizarla de la manera anterior y esperar más tráfico orgánico. Debes adoptar un enfoque sistemático.Estos son los pasos:Asegúrate de que su publicación se alinee con la intención de búsquedaAnaliza las páginas de mayor rangoAnaliza tu perfil de backlinksA. Asegúrate de que tu publicación se alinee con la intención de búsquedaLa intención de búsqueda es la razón detrás de la consulta de un buscador. Ya evaluamos esto hasta cierto punto en el paso anterior al verificar si las páginas que nos superan son publicaciones de blog o algo más.Pero la intención de búsqueda va más allá del tipo de contenido. También debes asegurarte de que tu publicación se alinee con el formato y el ángulo de contenido deseados.Formato de contenidoEste es el formato de las páginas que la mayoría de la gente busca. Los formatos comunes incluyen:How-tosTutorialesPublicaciones de listaGuíasEditoriales de opiniónDefiniciones ampliadas (es decir, qué es / qué tipo de publicaciones)Si revisamos la descripción general de SERP para “guest blogging”, vemos dos formatos principales: definiciones expandidas y guías. El nuestro no es ninguno de esos, lo que probablemente sea parte de la razón por la que no se clasifica.Ángulo de contenidoEste es el punto de venta de tu publicación. Es básicamente el gancho sobre por qué alguien debería hacer clic y para quién es. Los ángulos comunes incluyen:Guías para principiantesGuías completasListas de [número] principalesSi comprobamos los resultados principales de “guest blogging”, todos están dirigidos a principiantes. Sin embargo, nuestra publicación se dirige a una audiencia más avanzada con el ángulo de construir enlaces a escala..Eso probablemente no sea muy atractivo o útil para un principiante y podría estar impidiendo que clasifiquemos más alto.Por supuesto, como hay un par de formatos y ángulos con los que podemos ir aquí, es posible que se pregunte cuál deberíamos elegir. ¿Deberíamos volver a publicar nuestra publicación como una guía completa o una definición ampliada? (es decir, “¿qué son los blogs invitados?”) En este caso, la opción más lógica sería la definición ampliada. ¿Por qué? Porque este tipo de publicaciones parecen clasificarse con menos enlaces que guías completas.Eso indica que el formato de definición expandido puede coincidir mejor con la intención de búsqueda.Sin embargo, si volviéramos a publicar nuestra publicación, probablemente seguiríamos buscando una guía completa. Eso es porque este ángulo tiene más valor comercial para nosotros. Nos presenta más oportunidades para mostrar nuestro producto y nos permite profundizar más en el tema que una definición ampliada.B. Analiza las páginas mejor posicionadasAhora que has decidido el formato y el ángulo, el siguiente paso es analizar las páginas de mayor rango para ver qué están haciendo bien. Esto implica visitar manualmente las páginas relevantes y buscar puntos clave.Si estuviéramos haciendo esto para nuestra publicación sobre blogs invitados, abriríamos algunas de las guías completas de alto rango, ya que ese es el ángulo que establecimos en el último paso.La buena noticia es que no es necesario leer todas las publicaciones palabra por palabra. Solo necesitas comprender la estructura y los puntos clave de conversación. La forma más sencilla de hacer esto es buscar en las etiquetas de encabezado los puntos en común.Para acelerar este proceso, instala la barra de herramientas de SEO de Ahrefs y consulta el informe en la página. Entre otras cosas, esto extrae las etiquetas de encabezado de la página en una lista ordenada.Nota al margen. El informe en la página es completamente gratuito. Puedes usar esta función de la barra de herramientas incluso si no eres cliente de Ahrefs. Si hacemos esto para las tres guías de blogs invitados y pegamos las listas de cada una en una hoja de cálculo, veremos muchos puntos en común.Las tres guías hablan sobre cómo encontrar oportunidades de guest blogging y cómo preparar una presentación, y dos de las tres también hablan sobre cómo escribir publicaciones, rastrear resultados y determinar metas. Estas son todas las cosas que tendría sentido mencionar en nuestra publicación actualizada.Otra forma de encontrar puntos clave de conversación es realizar un análisis de brechas de contenido. Para hacer esto, pega las URL de algunas páginas relevantes de alto rango en la herramienta Content Gap de Ahrefs. Deja el campo inferior en blanco, luego presiona “Mostrar palabras clave”.A continuación, deberías ver las palabras clave que posicionan una o más de estas páginas. Muchos de estos serán a menudo diferentes formas de buscar lo mismo, pero a menudo también hay subtemas entre ellos. Por ejemplo, vemos palabras clave como “qué es un guest blogging” y “funciona un guest blogging” arriba. Estas serían secciones útiles para incluir en nuestra publicación.C. Analiza tu perfil de backlinksUno de los errores que las personas cometen a menudo al volver a publicar publicaciones es eliminar puntos importantes que merecen la pena. Por esa razón, antes de reescribir tu publicación, es mejor verificar su perfil de backlinks para ver cómo obtuvo sus enlaces existentes.A continuación, te indicamos cómo hacerlo:Pega la URL en el Explorador de sitios de Ahrefs, diríjete al informe de backlinks y luego busca en la columna “Ancla y vínculo de retroceso” para buscar razones comunes sobre los vínculos.Por ejemplo, parece que algunas personas se han vinculado a nuestra guía de blogs invitados debido a una estadística que menciona “20%”.Para saber cuántos otros se han vinculado a nosotros debido a esta estadística, filtremos el informe para los vínculos de retroceso que mencionan “20” en el ancla o el texto circundante.Parece que 66 páginas únicas están vinculadas debido a esta estadística, por lo que probablemente valga la pena mantener esa mención en la publicación nuevamente publicada.Hay dos razones por las que esta es una buena idea:Asegura que los enlaces existentes se mantengan contextualmente relevantes.Puede ayudarlo a obtener más enlaces a la publicación en el futuro.Dicho esto, no hay razón para mantener todo lo que encuentres en el informe de backlinks. Solo manténlo en la publicación si aún es relevante, valioso y tiene sentido contextual. Por ejemplo, si algunas personas se están vinculando debido a una estadística desactualizada, tendría más sentido reemplazarla por una actualizada o eliminarla por completo.Paso 3. Vuelva a publicar la publicaciónVolver a publicar tu publicación es la parte fácil. Simplemente inicia sesión en el CMS de tu sitio (por ejemplo, WordPress), navega hasta la publicación anterior, luego elimina el contenido anterior y reemplázalo con el nuevo. Manten la URL como esta, pero asegúrate de actualizar el título y las etiquetas OG para reflejar el nuevo contenido.Finalmente, cambia la fecha de publicación a la fecha actual y presiona actualizar.Si tienes tu sitio configurado en Google Search Console, también vale la pena solicitar una nueva indexación después de volver a publicarlo. Para hacer esto, pega la URL completa de la publicación en la herramienta de inspección de URL de Google Search Console y presiona “Solicitar reindexación” en la siguiente pantalla.Ten en cuenta que este paso es completamente opcional. Google eventualmente volverá a rastrear y a indexar la publicación independientemente, pero hemos descubierto que tiende a ser más rápido cuando se solicita la reindexación.ConclusionesVolver a publicar publicaciones de blog es una forma inteligente de atraer más tráfico a tus publicaciones. Ha sido parte de nuestra estrategia de crecimiento de blogs durante un tiempo y no planeamos detenernos pronto.Sin embargo, vale la pena señalar que más tráfico de búsqueda no es la única razón para actualizar o volver a publicar una publicación. También debes actualizar las publicaciones para mantenerlas actualizadas y precisas.¿Sigues sin tener una clasificación más alta a pesar de volver a publicar? Lea esto o mira el video a continuación.https://www.youtube.com/watch?v=Rm1MbJneLSI¿Tienes preguntas? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Volver a publicar contenido: cómo actualizar publicaciones de blog antiguas para SEO"
    },
    {
      "level": "H2",
      "text": "Paso 1. Encuentra páginas de bajo rendimiento con problemas de contenido"
    },
    {
      "level": "H3",
      "text": "A. Encuentra páginas de bajo rendimiento"
    },
    {
      "level": "H3",
      "text": "B. Asegúrate de que no sea una página nueva"
    },
    {
      "level": "H3",
      "text": "C. Descartar factores de backlinks"
    },
    {
      "level": "H3",
      "text": "D. Asegúrate de que sea una consulta ‘informativa’"
    },
    {
      "level": "H2",
      "text": "Paso 2. Actualiza el contenido"
    },
    {
      "level": "H3",
      "text": "A. Asegúrate de que tu publicación se alinee con la intención de búsqueda"
    },
    {
      "level": "H4",
      "text": "Formato de contenido"
    },
    {
      "level": "H4",
      "text": "Ángulo de contenido"
    },
    {
      "level": "H3",
      "text": "B. Analiza las páginas mejor posicionadas"
    },
    {
      "level": "H3",
      "text": "C. Analiza tu perfil de backlinks"
    },
    {
      "level": "H2",
      "text": "Paso 3. Vuelva a publicar la publicación"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}