{
  "url": "https://ahrefs.com/blog/es/seo-basico/",
  "slug": "seo-basico",
  "title": "SEO Básico: Guía Para Principiantes para el Éxito en SEO",
  "description": "Las bases del SEO son bastante simples. Y como la mayoría de los propietarios de sitios web tienen un conocimiento limitado, conocer lo básico del SEO te ayudará a triunfar.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Muchas personas creen que el SEO es demasiado difícil y que no merece la pena. No es cierto. Las bases del SEO son en realidad bastante sencillas. Y con un 57.8% de todo el tráfico de la web llegando desde Google, ciertamente es algo que merece la pena aprender si tienes una web.Si crees que lo básico no es suficiente para que posiciones, considéralo de nuevo. La mayor parte de la gente que tiene una web tienen un entendimiento muy limitado del SEO, así que saber lo básico puede ayudarte a triunfar.Aquí está lo que aprenderás en esta guía:ContentsNota del Editor¿Completamente nuevo en SEO? Empieza con nuestra guía de posicionamiento web para principiantes.¿Tienes ya algún conocimiento? Continúa con el capítulo 1.Joshua HardwickDirector de Contenidos Empieza aquí 1¿Qué son los motores de búsqueda? 2Fundamentos de SEO 3Keyword research 4Contenido SEO 5SEO On-Page 6Link Building 7SEO técnico Part 1Fundamentos SEOPrimero vamos a asegurarnos de que entendemos lo absolutamente básico del SEO, incluyendo por qué importa y cómo se compara con otros canales de marketing.¿Por qué el SEO es importante?La mayor parte del tráfico web proviene de los resultados orgánicos de Google. Fuente: Sparktoro En otras palabras: la búsqueda orgánica supone más tráfico que el resto de fuentes de tráfico combinadas.Si lees nuestra guía sobre cómo funcionan los motores de búsqueda, sabrás que Google y otros motores de búsqueda eligen qué páginas posicionan en base a cientos de señales. El SEO es importante porque es el proceso de incrementar estas señales para posicionarse más alto en los resultados orgánicos de búsqueda.¿Cuáles son los beneficios del SEO?Posicionar más alto es el beneficio más publicitado del SEO, pero el posicionamiento es solo un medio para un fin. Muchos de los beneficios reales del SEO tienen que ver con el tráfico.1. El SEO lleva a conseguir más tráficoComo la mayoría de la gente tiende a hacer clic en uno de los primeros resultados, posicionar más alto normalmente lleva más tráfico a tu web.Por ejemplo, mira los primeros tres resultados de “submit website to search engines” (enviar web a los motores de búsqueda). Usando el Keywords Explorer de Ahrefs, podemos ver que la página mejor posicionada recibe la mayor parte del tráfico orgánico, seguida por la segunda, después por la tercera, etc.Nuestro estudio concluyó que estas observaciones son en general ciertas de forma global, ya que la posición en los resultados presenta una fuerte correlación con el tráfico general a una página.2. El SEO conduce a tráfico consistentePosicionar en motores de búsqueda consigue normalmente tanto tráfico consistente como pasivo. Eso rara vez es el caso para medios como las redes sociales o el email marketing, que suelen generar picos de tráfico que rápidamente se desvanecen en la nada.Esto pasa porque las redes sociales están diseñadas para destacar contenido novedoso. Los emails a menudo se marcan como leídos, se olvidan o acaban en la bandeja de spam. Sin embargo, como el número de búsquedas que se realizan en motores de búsqueda es en general consistente de un mes a otro, el tráfico tiende a ser tanto consistente como pasivo una vez que te posicionas.3. El SEO lleva a tráfico “gratuito”Al contrario que pagar por publicidad, el tráfico de búsqueda es “gratis”.Esto es algo importante, porque los anuncios en motores de búsqueda pueden ser caros.Por ejemplo, según el Site Explorer de Ahrefs, el Blog de Ahrefs recibe unas 390.000 visitas estimadas al mes desde motores de búsqueda. Si pagáramos a Google por ese tráfico, la estimación es que nos costaría un 1 millón de dólares al mes.Vale, crear contenido que posicione en Google no es gratis— pero normalmente es barato en comparación con pagar por publicidad.¿Cómo pones tu web en Google?El SEO te ayuda a posicionar más alto, pero no puedes posicionarte más alto si Google ni siquiera sabe que tu web existe.Con el tiempo, Google encontrará tu web por su cuenta, pero hay un par de beneficios clave en enviar manualmente tu sitio:Descubrimiento más rápido. La mayor parte de las webs nuevas no tienen ningún backlink (enlace entrante) de otras webs, así que puede llevar tiempo que Google las descubra.Mejorar tu web. Google Search Console te da recomendaciones sobre cómo mejorar y optimizar tu web.El primer paso para enviar tu web a Google es encontrar tu sitemap (mapa del sitio).Los sitemaps son archivos que listan todas las páginas importantes en tu web. Normalmente puedes encontrar el tuyo escribiendo una de estas URLs en tu navegador:sitioweb.com/sitemap.xmlsitioweb.com/sitemap_index.xmlSi no está ahí, ve a sitioweb.com/robots.txt, donde normalmente aparecerá listado.Si tampoco está ahí, probablemente no tienes. Entra en nuestra guía para crear un sitemap.El segundo paso es crear una cuenta gratuita de Google Search Console y enviar tu sitemap.¿Qué es el SEO? Cómo optimizar para motores de búsqueda como GooglePor qué el SEO es importante: 8 Hechos Innegables y Casos de Estudio (en inglés)Cómo Crear un Sitemap XML (y Enviarlo a Google)Cómo enviar tu Sitio Web a los Motores de Búsqueda9 Razones por las que Tu Página Web no Aparece en Google10 Maneras de Hacer que Google Indexe tu Sitio Part 2Preparándonos para el éxito en SEOConseguir que tu web sea indexada por los motores de búsqueda significa que estás en la competición, no que tengas probabilidades de ganarla. Ahí es donde entra el SEO. El SEO es un proceso continuo que, si se hace bien, incrementa tus posibilidades de ganar a lo largo del tiempo.Es mucho más fácil hacer SEO bien cuando tu web está correctamente configurada para el éxito SEO.Vamos a echar un vistazo a cómo hacerlo:Consigue un buen dominioUsa una plataforma webUsa un buen hosting webCrea una experiencia positiva de usuarioCrea una estructura de sitio lógicaUsa una estructura de URL lógicaInstala un buen plugin SEO Consigue un buen dominioNo te asustes si ya has registrado un dominio. Probablemente esté bien y no dificulte tus esfuerzos SEO. Pero si todavía no has elegido ninguno, es bueno que tengas en mente estos dos atributos para un buen dominio:1. Nombre de dominioEn primer lugar, no te preocupes por incluir tus keywords (palabras clave). Tu dominio no tiene que ser restauranteitalianoenlondres.com, ni restauranteitalianoenmadrid.com o restauranteitalianoenmexico.com para que los motores de búsqueda entiendan sobre qué es.Aquí van unos pocos atributos de un buen dominio:Es el nombre de tu negocioNo tiene guionesEs corto y memorable2) TLDTLD son las siglas de top-level domain (dominio de nivel superior). Es la parte después del nombre, como .com, .org, co.uk, .mx o .esJohn Mueller de Google dice que tu TLD no afecta al SEO. Sin embargo, para la mayoría de negocios, .com es normalmente lo mejor si puedes conseguirlo, porque es lo más reconocido y aporta más confianza.Si eres una organización benéfica, .org o el equivalente en tu país (por ejemplo, .org.uk) también está bien.Si solo haces negocios en un país fuera de Estados Unidos, ccTLD (dominio de nivel superior geográfico, como .mx, .es o .co.uk) también está bien.Probablemente lo mejor es mantenerse alejado de TLDs como .info o .biz, que suelen asociarse con sitios de baja calidad, pero no es el fin del mundo si tienes uno. Todavía puedes construir un sitio legítimo que posicione. Usa una plataforma webLa mayoría de la gente no programa su web de cero en HTML y CSS. Usan una plataforma web. Son programas de software que permiten a las personas con poco o ningún conocimiento de programación crear una web, gestionar contenido con facilidad y ocuparse de los tecnicismos aburridos.Hay dos tipos de plataforma web.Plataformas alojadasLas plataformas alojadas lo hacen todo bajo un mismo tejado. Alojan tu web, te ofrecen diseños ya preparados que puedes instalar y editar con facilidad y te permiten crear y gestionar contenido sin tener que tocar código.Plataformas auto-hospedadasLas plataformas que alojas en tu servidor te permiten gestionar y crear contenido sin código. La diferencia es que tienes que alojarlas e instalarlas por tu cuenta.Nota al margen. WordPress también dispone de una solución alojada en wordpress.com.¿Qué tipo de plataforma deberías elegir?La mayor parte de profesionales SEO recomiendan una plataforma auto-hospedada, de código abierto, como WordPress, porque:Es personalizable, ya que puedes editar el código abierto como quieras y hay una gran comunidad de desarrolladores que conocen la plataforma a fondo.Es extensible, ya que hay millones de plugins listos que pueden ampliar su funcionalidad, incluyendo miles de plugins SEO.Si quieres nuestra recomendación, es una solución auto-hospedada como WordPress.Sin embargo, si valoras la facilidad de uso y el soporte, una solución alojada como Wix o Squarespace puede ser un mejor encaje. La verdad es que la mayoría de las plataformas conocidas ofrecen capacidades SEO más que suficientes para la mayoría de las personas.Así que no te preocupes por mudarte a WordPress si ya estás usando una plataforma diferente. Usa un buen hosting webLos hosting Web almacenan tu sitio en un disco duro al que cualquiera con una conexión a Internet puede acceder.Si usas una plataforma alojada para tu web, tienes muy poco control sobre tu hosting. Pero si usas una plataforma auto-hospedada como WordPress, depende de ti encontrar dónde alojarla.¿Así que cómo eliges un buen hosting para SEO?La mayor parte de guías SEO dicen que el hosting dedicado es mejor que el hosting compartido. Es cierto, pero no supone una gran diferencia hasta que tu web recibe mucho tráfico. El hosting barato de cualquier compañía conocida está bien para la mayoría de personas; no hay mucha diferencia entre hostings cuando pagas unos pocos dólares al mes.Sin embargo, aquí van unas pocas cosas que sí importan:Seguridad. Asegúrate de que el hosting te ofrece un certificado gratuito SSL/TLS o soporta LetsEncrypt—una organización sin ánimo de lucro que ofrece certificados gratuitos TLS.Localización del servidor. Lleva tiempo que los datos viajen entre el servidor y el visitante, así que lo mejor es elegir un hosting con servidores en el mismo país del que proviene la mayoría de tu tráfico.Soporte. El soporte 24/7 es ideal. Prueba lo bueno que es su soporte haciendo las preguntas de arriba antes de registrarte.Nota al margen.No te preocupes demasiado sobre la localización de los servidores. Si descubres que la velocidad es un problema, siempre puedes invertir en una CDN (Content Delivery Network, o red de distribución de contenidos). Este servicio crea copias de tu web en servidores por todo el mundo para que las páginas siempre se sirvan a los visitantes desde un servidor cercano. Configurar y usar una CDN está fuera del alcance de esta guía, pero aquí tienes cómo hacerlo con WordPress. Crea una experiencia positiva de usuarioGoogle quiere posicionar páginas que le den a los usuarios una experiencia positiva. Así lo dicen en su guía SEO para principiantes: Debes tener presentes a tus usuarios tanto al diseñar tu sitio web como al optimizarlo porque, en ambos casos, tu objetivo debe ser mejorar su experiencia en tu sitio web.Aquí van unas formas fáciles para hacerlo:Usa HTTPSNada es peor para los visitantes que el que sus datos personales sean susceptibles de ser usados por hackers. Encripta siempre tu sitio con SSL/TLS.Elige un diseño atractivoA nadie le gusta un sitio que parece que se diseñó en los 90. Así que aunque no es necesario rediseñar tu sitio web cada seis meses, debería al menos ser visualmente atractivo y reflejar tu marca.Asegúrate de que es mobile-friendlyGoogle dice que ahora se hacen más búsquedas desde móviles que desde escritorio, así que es crítico que tu web sea tan agradable de usar en móvil como en escritorio.Usa un tamaño de fuente legibleHoy en día la gente navega por la web usando todo tipo de dispositivos. Asegúrate de que tu contenido sea legible en todas partes.Evita los pop-ups y anuncios intrusivosTodo el mundo odia los anuncios, pero a veces puedes necesitarlos. Si es el caso, la clave es evitar los intrusivos. Google tiene algunos consejos sobre lo que está bien y lo que no aquí.Asegúrate de que carga rápidoLa velocidad de página es un factor de posicionamiento confirmado tanto en escritorio como en móvil. Pero esto no significa que tu sitio necesite cargar a la velocidad del rayo. Más rápido es mejor, claro, pero Google dice que este factor solo afecta a sitios que “entreguen la experiencia más lenta a los usuarios”. Crea una estructura de sitio lógicaTanto los usuarios como los motores de búsqueda necesitan ser capaces de navegar por tu sitio fácil e intuitivamente, y por eso es por lo que es importante crear una jerarquía lógica para tu contenido.La forma fácil de hacerlo es esbozarlo en un mapa mental.Cada una de las ramas de tu mapa mental se convertirán en enlaces internos, que son enlaces en una página dentro de una web a otra.Los enlaces internos son cruciales para la UX (User Experience, o Experiencia de Usuario) y el SEO por unas pocas razones:Ayudan a los motores de búsqueda a encontrar nuevas páginas. Las páginas sin enlaces internos raramente son encontradas e indexadas.Ayudan a pasar PageRank a lo largo de tu sitio. PageRank es la base del algoritmo de posicionamiento de Google que intenta determinar el “valor” de una página.Ayudan a los motores de búsqueda a entender sobre qué es tu página. Para hacer esto, Google mira los anchor (anclas) y el texto de alrededor. Usa una estructura de URL lógicaLas URLs son importantes porque ayudan a los usuarios a entender el tema de una página.Muchas plataformas webs te permiten elegir cómo estructurar tus URLs. Estas son las cinco opciones principales para las URLs en WordPress:Simple: tusitioweb.com/?p=123Día y nombre: tusitioweb.com/2021/03/04/bases-SEO/Mes y nombre: tusitioweb.com/03/04/bases-SEO/Numérico: tusitioweb.com/865/Nombre de la entrada: tusitioweb.com/bases-SEO/Si estás configurando un nuevo sitio de cero, tiene sentido elegir la estructura estructura más clara y descriptiva. Probablemente, Nombre de la entrada (post name, en inglés).Usar fechas en las URLs es además una mala práctica porque puede que quieras actualizar los posts en el futuro.Si estás optimizando una web existente, probablemente es mejor no cambiar la estructura de URL—incluso aunque no sea la ideal. Hacerlo, puede romper otras cosas más importantes que tendrán un impacto profundamente más negativo en tu SEO. Instala un buen plugin SEOLa mayor parte de plataformas alojadas gestionan funcionalidades SEO por defecto, pero ese no es el caso de WordPress. Es virtualmente imposible implementar incluso las más directas de las mejores prácticas SEO sin un plugin SEO.Existen muchos plugins disponibles. Nosotros usamos Yoast, pero Rank Math también es bueno.La instalación es sencilla. Simplemente ve a:Plugins > Añadir nuevo > Buscar plugins > Instalar > Activar Ambos plugins añaden campos extra con inputs para tus posts y páginas (volveremos a estos más tarde).Si usas una plataforma alojada como Wix o Squarespace, no hay mucha necesidad de instalar un plugin, ya que estas plataformas te permiten hacer ajustes SEO básicos por defecto.¿Qué es HTTPS? Todo lo que tienes que saberArquitectura Web: Cómo Construir tus Bases SEOCómo Crear URLs amigables con el SEO (Paso-a-Paso)Cómo Mejorar la Velocidad de tu Sitio WordPress en 20 minutosLos 15 mejores plugins SEO para WordPress (Probados & Testados) - en inglésComo Hacer una Auditoría Básica a un Sitio Web para mejorar el SEO y la UX (en 10 pasos)Part 3Cómo hacer SEOEn esta fase, deberías tener una base SEO decente para el éxito. Pero esto es solo el comienzo. El SEO es un proyecto continuo que en general se divide en cuatro aspectos:Keyword researchSEO on-pageLink buildingSEO técnicoHemos publicado guías para principiantes para cada una de estos aspectos así que no cubriremos cada detalle. En lugar de eso, nos enfocaremos en las bases y adoptaremos una vista de alto nivel para ayudarte a entender por qué cada aspecto es tan importante y cómo encajan todos juntos. Keyword researchLa investigación de palabras clave o keyword research es el proceso de descubrir qué es lo que están buscando tus clientes, cuánto tráfico pueden enviarte esos términos y cómo de difícil es posicionarse en los mismos. Exploremos lo básico de cada uno de estos pasos.Encuentra palabras claveEntender qué tipo de cosas buscan tus clientes potenciales es el primer paso del proceso de keyword research. A menos que sepas esto, no hay forma en que puedas comenzar a crear páginas que posicionen en motores de búsqueda y atraigan tráfico de valor.Hacer un brainstorming de palabras y frases que definen tu industria es la mejor forma de comenzar este proceso. Para una tienda online de PCs, pueden ser cosas como:computer (ordenador o computador)PCmaclaptop (portátil)macbookDespués puedes usarlas como palabras clave “semilla” para encontrar más ideas. Simplemente, introdúcelas en una herramienta de keyword research como el Keywords Explorer de Ahrefs y comprueba uno de los informes de ideas de keywords.Busca ideas de keywords que sean valiosas para tu negocio.Comprueba el potencial de tráficoPrácticamente todas las herramientas de keyword research te mostrarán volúmenes de búsquedas estimadas al mes para las palabras clave que encuentren, incluyendo el Keywords Explorer de Ahrefs.El volumen de búsqueda normalmente es una forma razonable de estimar el potencial relativo de tráfico. Hablando en general, las páginas que apunten a palabras clave de alto volumen normalmente llevarán más tráfico a tu sitio que las páginas que apunten a keywords de bajo volumen.Pero el volumen de búsqueda de las palabras clave no es infalible. Hay casos en los que posicionarse en el número 1 para una palabra clave con 1.000 búsquedas mensuales llevará más tráfico que posicionar en el número 1 para una palabra clave con 2.000 búsquedas mensuales.Por ejemplo, “submit website to search engine” (enviar web a motores de búsqueda) vs. “seo tips” (consejos SEO):Incluso aunque el segundo tenga más volumen de búsqueda, la página mejor posicionada del primer término recibe más tráfico orgánico.Así que siempre merece la pena mirar el tráfico estimado de búsqueda orgánica a la página mejor posicionada para contar con un sentido más claro del potencial de tráfico de la palabra clave. Puedes hacer esto en Keywords Explorer.Comprueba la dificultad de posicionamientoIncluso aunque una palabra clave te parezca relevante para tu negocio y tenga un alto potencial de búsqueda, no siempre será fácil posicionarse en ella.Muchas cosas influyen en la dificultad de posicionamiento de una palabra clave, pero el número de sitios web relevantes, destacados, que enlazan a las páginas mejor posicionadas se puede decir que es el más importante. Google habla de esto en su guía sobre cómo funciona la búsqueda: Si otras webs importantes en la materia enlazan a la página, es una buena señal de que la información es de alta calidad.En parte por esta razón es por lo que basamos la puntuación de Ahrefs de Dificultad de Keyword (Keyword Difficulty o KD) en el número de webs que enlazan a las páginas de las primeras posiciones. Puntúa cada palabra clave en una escala entre 0-100 y es un buen punto de referencia cuando intentas evaluar la dificultad de posicionar.Sin embargo, como es imposible sintetizar la complejidad de la dificultad de posicionamiento en un número de 1 a 3 dígitos, no recomendamos confiar ciegamente en él. Entramos en más detalle sobre cómo evaluar la dificultad de posicionamiento en nuestra guía de keyword research. SEO on-pageEl SEO on-page consiste en crear el tipo de contenido que los usuarios están buscando y “optimizando” para ayudar a los motores de búsqueda a entender mejor sobre qué es. La mayor parte de la gente piensa que todo consiste en la ubicación de keywords. Aunque es una parte, está lejos de ser el aspecto más importante.Exploremos las bases de cómo optimizar una página para posicionar en motores de búsqueda.Satisface la intención de búsquedaFalla al crear el tipo de contenido que los usuarios están buscando y tus posibilidades de posicionar son prácticamente nulas. Esto se conoce en la industria como alinear tu contenido con la intención de búsqueda.Como Google entiende lo que los usuarios están buscando mejor que nadie, la mejor forma de evaluar la intención de búsqueda es buscar puntos en común entre las páginas que actualmente están mejor posicionadas en tu keyword objetivo.Por ejemplo, los resultados de “SEO tips” (consejos SEO) son todos posts de blog tipo lista. Pero los resultados de “speakers” (altavoces) son todos páginas de categoría de sitios de ecommerce.Esto nos dice que la gente que busca “speakers” está en modo de compra y la gente que busca “SEO tips” está en modo aprendizaje. Si queremos posicionarnos, necesitamos tener esto en cuenta y crear el tipo de contenido que se alinee con la intención de búsqueda.Elige una URL descriptivaEn el capítulo de configurar una web para tener éxito en SEO, hablamos de usar una estructura de URL lógica y descriptiva. Por cada página o post que publicas, también necesitas establecer un slug—la parte al final de la URL—descriptivo.Cómo hacer esto lo mejor posible depende de los subdirectorios antes del slug de la URL.Pongamos que tu palabra clave objetivo es “black mens jeans” (pantalones vaqueros negros para hombre).Si tu URL no tiene subdirectorios o subdirectorios genéricos como /blog/, simplemente establece el slug como tu palabra clave objetivo. tusitioweb.com/pantalones-vaqueros-negros-hombre/Si hay subdirectorios “contextuales” como /hombre/ o /pantalones-vaqueros/, normalmente es mejor excluir palabras clave repetidas: tusitioweb.com/hombre/pantalones-vaqueros/negros/Escribe una etiqueta de título atractivaLas etiquetas de título son los enlaces azules clicables en los resultados de búsqueda.Es una de las pocas armas que tienes para incitar a los usuarios a hacer clic en tu página, así que es importante hacerla lo más atractiva posible.La forma más fácil de hacer esto es alinearla con la intención de búsqueda.Por ejemplo, si miramos los títulos de los mejores resultados de “best bluetooth speaker” (mejor altavoz bluetooth), hay un par de puntos en común:Todos contienen el año. Esto da una pista de que la novedad es importante para los usuarios.Hay mucha conversación sobre la portabilidad. Esto apunta a que es un atributo importante.Usando estos conocimientos en nuestro beneficio, esta parece una etiqueta de título bastante buena: Los Mejores Altavoces Bluetooth (2021): Las Mejores Propuestas PortátilesOptimiza las imágenesLas imágenes pueden posicionarse en Google Imágenes y enviar tráfico a tu sitio. Solo en los últimos 3 meses hemos recibido miles de visitas de Google Imágenes.¿Cómo optimizas tus imágenes?Sigue estos tres pasos:Nómbralas adecuadamente. Los nombres de archivo ayudan a Google a entender la imagen, por lo que gato.png es mejor que IMG_948493.png.Usa texto alt descriptivo. El text alt es un código que describe una imagen en palabras. No es visible en la página a no ser que el visitante use un lector de imágenes o la imagen no se cargue.Comprímelas. Instala un plugin como Shortpixel para comprimir tus imágenes sobre la marcha y mejorar la velocidad de carga de la página. Link buildingLos enlaces desde otras páginas web actúan como “votos” y le muestran a Google que la gente está respondiendo por tu contenido.Se podría decir que son el factor de posicionamiento más importante, pero conseguir buenos enlaces no siempre es fácil.La mayoría de tácticas de link building gira en torno a crear contenido que merezca ser enlazado, después contactar a los propietarios de los sitios y editores con una razón convincente para que añadan tu enlace a una de sus páginas. Pero hay otras formas de conseguir enlaces.Echemos un vistazo a unas pocas tácticas de link building.Autor invitado (guest blogging)El guest blogging es cuando escribes un post para otra web. Aquí está un un post invitado que escribió Ryan Stewart para el blog de Ahrefs en 2018.Si miras la bio del autor, verás los enlaces a los perfiles sociales de Ryan y su web.La mayor parte de webs permiten a los autores invitados añadir aquí sus enlaces.Una de las formas más fáciles de encontrar oportunidades potenciales de guest blogging es usar Content Explorer, nuestra base de datos donde puedes buscar en más de 7.000 millones de páginas. Aquí puedes ver cómo:Busca un tema relevanteElige “en el título” en el desplegableComprueba la pestaña “sitios web”Aquí verás las webs que reciben la mayor parte del tráfico a páginas sobre tu tema:Ya que estas webs han escrito sobre este tema antes, es posible que estén abiertos a un post invitado sobre un tema similar. Simplemente escríbeles un email y pregunta.La técnica del rascacielosLa técnica del rascacielos es cuando consigues enlaces al crear un contenido mejor que el que la gente ya está enlazando.Aquí está el proceso básico:Encuentra una pieza de contenido con muchos backlinks (enlaces entrantes)Crea algo mejorPide a la gente que está enlazando al contenido original que en su lugar enlacen al tuyo.Se puede decir que Content Explorer es la forma más rápida de encontrar oportunidades “rascacielos”. Simplemente busca un tema, después filtra por páginas con multitud de dominios de referencia (webs que la están enlazando).Busca algo sobre lo que puedas mejorar, después publica algo incluso mejor. Después puedes introducir la URL en el Site Explorer de Ahrefs, encontrar todos los backlinks en el informe de Backlinks y contactar a esas personas.Persigue los enlaces de los competidoresEntender cómo los competidores están atrayendo backlinks es la mejor forma de crear una estrategia de link building. Si puedes encontrar patrones en su perfil de enlazado, sabes qué tácticas de link building son probablemente las más efectivas para tu sitio web.Para hacer esto, busca la keyword a la que estás apuntando en Keywords Explorer de Ahrefs y haz scroll en la vista general de la SERP. Busca una página que sea similar a la tuya y tenga muchos dominios de referencia (webs que la están enlazando).Si hacemos esto con “SEO basics” (SEO básico), vemos muchas páginas con montones de backlinks.Si hacemos clic en el informe de Backlinks de una de las páginas, podemos buscar tendencias entre sus backlinks.En este caso, parece que hay algunos pocos enlaces de guías de blogging.Así que podríamos fácilmente hacer una búsqueda en Content Explorer para encontrar más guías de blogging y después contactar a sus autores y sugerirles que este post sea un añadido a su guía. SEO técnicoEl SEO técnico es el proceso de ayudar a los motores de búsqueda como Google a encontrar, entender e indexar tus páginas. Puede ser bastante complicado pero como ya hemos cubierto lo básico en lo que se refiere a configurar un sitio para tener éxito con el SEO, no profundizaremos aquí.De momento, sugerimos que des de alta una cuenta gratuita en Ahrefs Webmaster Tools y agendes de forma regular rastreos de tu web. Estos rastreos (crawls) comprueban más de 100 problemas SEO, incluyendo muchos problemas técnicos comunes.Si encuentras algún problema preocupante o que suene a técnico en tu sitio, lee nuestra guía de SEO técnico para aprender más sobre cómo arreglarlos.Cómo hacer investigación de palabras clave para SEOSEO On-Page: Guía Completa para PrincipiantesLa Guía para Principiantes al Link BuildingSEO Técnico: La Guía para Principiantes (en inglés)Part 4Cómo medir el éxito en SEOEn esta fase, ya deberías tener un buen entendimiento de SEO. Pero, ¿cómo mides y realizas seguimiento del rendimiento de tus esfuerzos? La respuesta más obvia es que simplemente monitorees la cantidad de tráfico que tu web recibe desde búsqueda orgánica.Si usas Google Analytics, puedes obtener una vista rápida de tu tráfico orgánico yendo a:Adquisición > Todo el tráfico > Canales > Búsqueda OrgánicaSi no usas Google Analytics, puedes comprobar el tráfico orgánico estimado, actual y pasado, en Site Explorer de Ahrefs.Si este número está subiendo, entonces probablemente estás haciendo algo bien.También puedes monitorizar los rankings de palabras clave en Rank Tracker. Si un mes estás posicionando en el puesto #5 para una palabra clave y el #1 en el próximo, también es otra señal de que estás haciendo algo bien.Sin embargo, aunque no hace daño echar un ojo al tráfico orgánico y a los rankings, estas dos cosas son lo que se conoce como métricas de vanidad, porque a menudo no tienen relación con tus objetivos generales de marketing o de negocio.Es mucho mejor monitorizar métricas que tengan un impacto real de negocio.Exploremos solo un par de estas métricas.Monitoriza la Cuota de Voz orgánica (Share of Voice, SoV)La SoV orgánica es la visibilidad de tu marca en los resultados de búsqueda comparada con la competencia. Es importante porque hay una relación entre la SoV y la cuota de mercado.Puedes seguir la SoV orgánica en el Rank Tracker de Ahrefs. Simplemente añade las palabras clave que sean importantes para tu negocio y ponles una etiqueta apropiada.Desde ahí, dirígete a: Competitors (Competidores) > Overview (Vista General)Si todavía no lo has hecho, añade algunos competidores. Después comprueba la pestaña de Visibility (visibilidad) para ver qué porcentaje de todos los clics para las palabras clave que estás monitorizando terminan en tu página web, comparado con las que acaban en la de tus competidores.Monitoriza las conversiones del tráfico orgánicoLas conversiones ocurren cuando un visitante a tu web realiza una acción deseada. Eso puede ser desde un clic en un enlace a realizar una compra.Si usas Google Analytics, puedes seguir las conversiones para compras y prácticamente cualquier cosa que quieras. Después puedes filtrar por conversiones desde tráfico orgánico y comparar períodos para ver qué impacto están teniendo tus esfuerzos en SEO para las cosas que importan.Sigue Estos 3 KPIs de SEO para Tomar Mejores Decisiones de Marketing¿Qué es Share of Voice? Cómo medirlo en todos los canalesPart 5Herramientas Gratis de SEO Muchas herramientas SEO profesionales cuestan más de 100$ al mes. Dado que esta es una guía SEO básica, puede que todavía no estés preparado para invertir esa cantidad de dinero en herramientas potentes SEO como Ahrefs. Pero no te preocupes. Puedes conseguir mucho con herramientas SEO gratuitas.Aquí van unas algunas herramientas famosas con cada uno de los aspectos del SEO cubiertos en el capítulo 4.Herramientas de keyword researchGoogle Keyword PlannerEncuentra ideas de keywords únicas.Keyword GeneratorGenera cientos de ideas de keywords.SERP CheckerComprueba el potencial tráfico de búsqueda estimado para el tema en base a los tres primeros resultados.Keyword Difficulty CheckerComprueba la puntuación de dificultad de palabras clave (Keyword Difficulty, o KD).Herramientas SEO on-pageYoast SEOAñade etiquetas de título y descripciones meta a los posts y páginas de WordPress.Ahrefs Webmaster ToolsEncuentra etiquetas de título, descripciones meta y texto alt que falten en cualquier parte de tu web.Herramientas de link buildingAhrefs’ Backlink CheckerDescubre el top 100 de backlinks a cualquier sitio o página web.HAROConsigue oportunidades de enlace cada día (técnicamente, es más un servicio que una herramienta).GmailEnvía emails de contacto para conseguir potenciales enlaces. No es necesario un software sofisticado de contacto.Herramientas de SEO técnicoGoogle Search ConsoleEncuentra errores de cobertura de indexación, problemas de velocidad de página y más.Ahrefs Webmaster ToolsEncuentra más de 100 problemas SEO en tu página, incluyendo muchos problemas técnicos.Es hora de cerrarTodo lo de arriba debería servir como una introducción bastante concienzuda a las bases del SEO. Si buscas aprender más sobre los cuatro aspectos de los que hemos hablado en el capítulo cuatro, tenemos guías para principiantes de cada uno de los mismos.Aquí están los enlaces (recomendamos empezar con ):Guía para Principiantes de Keyword ResearchGuía para Principiantes de SEO on-pageGuía para Principiantes de Link BuildingGuía para Principiantes de SEO Técnico (en inglés) Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Colaboradores Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Colaboradores",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Básico: Guía Para Principiantes para el Éxito en SEO"
    },
    {
      "level": "H2",
      "text": "Fundamentos  SEO"
    },
    {
      "level": "H3",
      "text": "¿Por qué el SEO es importante?"
    },
    {
      "level": "H3",
      "text": "¿Cuáles son los beneficios del SEO?"
    },
    {
      "level": "H4",
      "text": "1. El SEO lleva a conseguir más tráfico"
    },
    {
      "level": "H4",
      "text": "2. El SEO conduce a tráfico consistente"
    },
    {
      "level": "H4",
      "text": "3. El SEO lleva a tráfico “gratuito”"
    },
    {
      "level": "H3",
      "text": "¿Cómo pones tu web en Google?"
    },
    {
      "level": "H2",
      "text": "Preparándonos para el éxito en SEO"
    },
    {
      "level": "H3",
      "text": "Consigue un buen dominio"
    },
    {
      "level": "H4",
      "text": "1. Nombre de dominio"
    },
    {
      "level": "H4",
      "text": "2) TLD"
    },
    {
      "level": "H3",
      "text": "Usa una plataforma web"
    },
    {
      "level": "H4",
      "text": "Plataformas alojadas"
    },
    {
      "level": "H4",
      "text": "Plataformas auto-hospedadas"
    },
    {
      "level": "H3",
      "text": "Usa un buen hosting web"
    },
    {
      "level": "H3",
      "text": "Crea una experiencia positiva de usuario"
    },
    {
      "level": "H4",
      "text": "Usa HTTPS"
    },
    {
      "level": "H4",
      "text": "Elige un diseño atractivo"
    },
    {
      "level": "H4",
      "text": "Asegúrate de que es mobile-friendly"
    },
    {
      "level": "H4",
      "text": "Usa un tamaño de fuente legible"
    },
    {
      "level": "H4",
      "text": "Evita los pop-ups y anuncios intrusivos"
    },
    {
      "level": "H4",
      "text": "Asegúrate de que carga rápido"
    },
    {
      "level": "H3",
      "text": "Crea una estructura de sitio lógica"
    },
    {
      "level": "H3",
      "text": "Usa una estructura de URL lógica"
    },
    {
      "level": "H3",
      "text": "Instala un buen plugin SEO"
    },
    {
      "level": "H2",
      "text": "Cómo hacer SEO"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H4",
      "text": "Encuentra palabras clave"
    },
    {
      "level": "H4",
      "text": "Comprueba el potencial de tráfico"
    },
    {
      "level": "H4",
      "text": "Comprueba la dificultad de posicionamiento"
    },
    {
      "level": "H3",
      "text": "SEO on-page"
    },
    {
      "level": "H4",
      "text": "Satisface la intención de búsqueda"
    },
    {
      "level": "H4",
      "text": "Elige una URL descriptiva"
    },
    {
      "level": "H4",
      "text": "Escribe una etiqueta de título atractiva"
    },
    {
      "level": "H4",
      "text": "Optimiza las imágenes"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H4",
      "text": "Autor invitado (guest blogging)"
    },
    {
      "level": "H4",
      "text": "La técnica del rascacielos"
    },
    {
      "level": "H4",
      "text": "Persigue los enlaces de los competidores"
    },
    {
      "level": "H3",
      "text": "SEO técnico"
    },
    {
      "level": "H2",
      "text": "Cómo medir el éxito en SEO"
    },
    {
      "level": "H3",
      "text": "Monitoriza la Cuota de Voz orgánica (Share of Voice, SoV)"
    },
    {
      "level": "H3",
      "text": "Monitoriza las conversiones del tráfico orgánico"
    },
    {
      "level": "H2",
      "text": "Herramientas Gratis de SEO"
    },
    {
      "level": "H3",
      "text": "Herramientas de keyword research"
    },
    {
      "level": "H4",
      "text": "Google Keyword Planner"
    },
    {
      "level": "H4",
      "text": "Keyword Generator"
    },
    {
      "level": "H4",
      "text": "SERP Checker"
    },
    {
      "level": "H4",
      "text": "Keyword Difficulty Checker"
    },
    {
      "level": "H3",
      "text": "Herramientas SEO on-page"
    },
    {
      "level": "H4",
      "text": "Yoast SEO"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Herramientas de link building"
    },
    {
      "level": "H4",
      "text": "Ahrefs’ Backlink Checker"
    },
    {
      "level": "H4",
      "text": "HARO"
    },
    {
      "level": "H4",
      "text": "Gmail"
    },
    {
      "level": "H3",
      "text": "Herramientas de SEO técnico"
    },
    {
      "level": "H4",
      "text": "Google Search Console"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools"
    },
    {
      "level": "H2",
      "text": "Es hora de cerrar"
    }
  ],
  "author": "Joshua Hardwick  Sam Oh Joshua Hardwick Joshua Hardwick"
}