{
  "url": "https://ahrefs.com/blog/es/seo-por-ti-mismo/",
  "slug": "seo-por-ti-mismo",
  "title": "SEO por ti mismo: Una Guía en 4 Pasos Básicos Que Cualquiera Puede Seguir",
  "description": "¿No tienes un gran presupuesto de marketing? ¿No puedes permitirte contratar una agencia de SEO? No te preocupes. Aprende cómo hacer SEO por tu cuenta en este sencillo tutorial, libre de jerga.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido ¿No tienes un gran presupuesto de marketing? ¿No te puedes permitir contratar una agencia SEO? No te preocupes. Es posible empezar en SEO por tu cuenta.Hace dos años trabajaba para una startup intentando vender un invento: una chaqueta que daba masajes.Al ser una startup no teníamos mucho presupuesto para marketing. Pero eso no era lo peor. Lo peor era que nadie en la empresa tenía idea ni de marketing ni de SEO.Yo acababa de graduarme en psicología y había leído un par de libros de marketing en mi tiempo libre. A sus ojos, era el más “cualificado”.Así que me pusieron a cargo de la estrategia de marketing.Como no sabía nada ni tenía dinero para marketing, empecé por leer un par de blogs de SEO. Intenté implementar algunas de las estrategias de las que hablaban y con el tiempo me las arreglé para posicionar el sitio por un par de keywords relacionadas con nuestro producto.Nota al margen. Debido a algunos desafíos del negocio, la empresa ya no existe. No te cuento esta historia para impresionarte. Te la cuento para impresionarte con el hecho de que con la guía adecuada, puedes hacer SEO.Solo necesitas la estrategia correcta.Después de todo, el SEO es bastante directo. Todo tiene que ver con:Entender lo que tus clientes objetivo están buscando;Crear contenido sobre esos temas (posts en el blog, páginas de producto, etc.);Ocuparse de los temas “técnicos” para empujar estas páginas más alto en los motores de búsqueda (¡esto incluye el link building!).Y en esta guía, aprenderás 4 formas de hacer tu propio SEO:Haz keyword researchCrea páginas que estén optimizadas para la búsquedaArregla los problemas técnicos de tu webConsigue enlacesEn esta guía paso a paso, aprenderás todo lo que tienes que saber para hacer SEO por ti mismo.1. Haz keyword research (investigación de palabras clave)La mayor parte de campañas SEO empiezan con keyword research. En esencia, keyword research es una actividad SEO para encontrar las palabras o frases más populares que tus clientes usan cuando buscan lo que haces.Una vez que sabes cuáles son esas palabras o frases, puedes empezar a crear contenido (o páginas) para posicionarte en ellas.El proceso normalmente es algo así:Encontrar un grupo de palabras clave (keywords) semillaIntroducirlas en una herramienta de keyword research para generar más ideas;Evaluarlas y priorizarlas.Aquí tienes cómo empezar.1.1. Haz un brainstorming de algunas palabras clave semillaLas palabras clave semilla son la base de tu keywords research. Las necesitarás para generar más ideas de keywords.Generar una lista de palabras clave iniciales es relativamente fácil. Coge papel y lápiz y empieza un brainstorming (lluvia de ideas) usando estas dos preguntas:¿Cómo buscaría la gente si quisiera encontrar tu página (o una parecida a la tuya)?¿Cómo describiría la gente tu producto o servicio?Si fuera a crear una lista de palabras clave para AiraWear podría incluir estas pocas keywords:Aliviar el dolor de espalda (Back pain relief);Masaje DIY (DIY massage);Automasaje (Self-massage);Aliviar el dolor de hombros.PRO TIPTambién puedes generar tu lista inicial de palabras clave semilla mirando a las keywords por las que ya estás posicionado.Puedes hacer esto en la Search Console de Google (aquí tienes una guía que te muestra cómo configurarla) o usando el informe de Palabras clave orgánicas en el Site Explorer de Ahrefs.1.2. Consigue más ideas de palabras claveCon tu lista de palabras clave semilla hecha, puedes empezar a expandir tu lista y generar incluso más ideas de keywords.Todo lo que tienes que hacer es meter estas keywords en la herramienta de tu elección. Por ejemplo, podría coger una palabra clave semilla—”dolor de espalda”—e introducirla en AnswerThePublic, una herramienta de keyword research.AnswerThePublic generará unas cuantas ideas de keywords basadas en preguntas, preposiciones, comparaciones, alfabéticos y búsquedas relacionadas.Esto te dará ideas más que suficientes para empezar.AnswerThePublic es solo una de las muchas herramientas gratis de keyword research que hay por ahí, así que elige la tuya.Si quieres ver un conjunto mucho más grande de ideas de keywords (junto a métricas SEO importantes), puedes usar una herramienta como el Keywords Explorer de Ahrefs. Introduce una o más de las palabras clave semilla que tienes en tu lista y Keywords Explorer generará miles de ideas para ti.1.3. Filtrando la lista de keywordsTener 8.000 ideas de keywords es asombroso. Pero es imposible apuntar a todas. Después de todo, tienes tiempo, presupuesto y recursos limitados.Es mejor enfocar tus esfuerzos en las palabras clave que es más probable que atraigan un tráfico más dirigido.¿Cómo? Puedes enfocarte en dos métricas principales:Volumen de búsqueda — la demanda general de esta keyword, o cuántas veces se busca esta palabra clave en Google, cada mes, en un país específico (o globalmente);Dificultad de Keyword — la dificultad de posicionar en una keyword, representada como un valor numérico entre cero y cien.NOTA. Cada herramienta de keyword research calcula la dificultad de keyword de forma diferente. La puntuación de Keyword Difficulty (KD) que tenemos en Ahrefs se basa en los perfiles de enlaces entrantes (backlinks) de los 10 primeros resultados de una keyword dada. Cuantos más enlaces entrantes de calidad tienen, más difícil es desbancarlas.Idealmente quieres ir a por palabras clave que podrían enviarte potencialmente montones de tráfico, pero que no tienen tanta competencia.Traducción: estás buscando keywords que tengan un alto volumen de búsqueda y Keyword Difficulty baja.Con herramientas como el Keywords Explorer de Ahrefs, encontrar estas keywords es fácil. Simplemente usa los filtros de volumen de búsqueda y Keyword Difficulty.Esto reduce la lista a un conjunto mucho más manejable de ideas de keywords con las que puedes trabajar. Asegúrate de hacer una revisión manual para comprobar que las palabras clave son relevantes para tu negocio. (¡En el ejemplo anterior, las palabras clave “muscles in the back” (músculos en la espalda) y “stretched” (presionado, estresado) parecen demasiado generales para apuntar a ellas!)Si quieres un conjunto de ideas más grande, siéntete libre de jugar con los filtros hasta que tengas una lista con la que estás satisfecho.Puedes aprender más sobre keyword research en nuestra guía de keyword research aquí.2. Crea páginas que están optimizadas para la búsquedaUna vez que ya has terminado de buscar palabras clave a las que apuntar, necesitarás crear páginas que puedan posicionar por estas palabras clave.Estas páginas pueden ser de varias formas. Dependiendo de tu palabra clave objetivo, podría ser tu página principal, una landing o página de aterrizaje, una página de producto o un artículo en el blog.Necesitarás asegurarte de que estas páginas están optimizadas para la búsqueda. Esto se conoce como SEO on-page o SEO en página. SEO on-page es el proceso de optimizar los elementos en la página de una web (como el contenido, estructura, código, etc.) para ayudar a que posicione más alto en Google.La mayor parte de la gente piensa que esto se reduce al número de veces que mencionan su keyword en la página. Eso es un error.El keyword stuffing—la práctica de meter con calzador palabras clave donde no deberían estar con propósitos SEO—murió hace más de una década. Hoy en día, Google puede entender sinónimos y palabras semánticamente relacionadas.¿Quieres una prueba? Aquí está el resultado número 1 para “best break dance songs” (“mejores canciones de break dance”):¿Sabes cuántas veces menciona esta página la palabra clave “best break dance songs”? Ninguna. Aún así, Google entiende que es un resultado de búsqueda relevante.¿Listo para preparar contenido que posicione? Sigue los consejos de abajo.2.1. Crea contenido que encaje con la intención de búsquedaGoogle quiere que sus usuarios sean felices. Para ellos, esto significa encontrar lo que está buscando la persona que busca (también conocido como intención de búsqueda o “search intent”) y después filtrar los mejores resultados.Esto quiere decir que si quieres posicionarte en Google, tienes que crear contenido que se ajuste a la intención de búsqueda.Por suerte, no es tan difícil como parece. Como Google ya sabe ofrecer el contenido más relevante para cada consulta, podemos aprovecharnos de eso.Simplemente mira las páginas de las primeras posiciones para hacerte una idea de lo que la gente quiere ver.Por ejemplo, si miro a la Vista general de SERP de “back pain relief” (aliviar el dolor de espalda), esto es lo que veo:NOTA. También puedes buscar en Google tu palabra clave objetivo. Sin embargo, los resultados serán localizados para tu país.Parece que los primeros resultados son posts de blogs. La mayoría son listicles (artículos tipo listado) sobre cómo remediar y aliviar el dolor de espalda.Esto quiere decir que si yo fuera a apuntar a esta keyword, tendría más oportunidades de posicionar creando un post tipo listado donde compartiera varios consejos y soluciones para aliviar el dolor de espalda.2.2. Asegúrate de que tu contenido es sencillo y fácil de leerLa mayor parte de SEOs creen que Google mira a las señales de usuario (dwell time o tiempo de permanencia, tiempo en la página, etc.) para influir en los rankings.Si tu texto es difícil de leer o entender, los usuarios volverán atrás más rápido de lo que puedas decir “¡ciao señales de usuario!”.No pienses solo en el SEO: ya sea una página landing, una de producto o un post en el blog, el texto en estas páginas debe ser persuasivo. Si es enrevesado o complejo, no solo es malo para el SEO, va a ser malo para el negocio.¿Cómo convences a alguien para que se una a tu lista de email o compre tu producto si tu texto ni siquiera se entiende?Mantén tu texto bonito y sencillo. Usa estos consejos:Evita las palabras grandilocuentes. No digas erróneo cuando puedes decir equivocado. Usa siempre lenguaje sencillo.Usa formatos como negritas, cursiva y listas para romper bloques de texto.Incluye multimedia, como imágenes, vídeos y GIFs para ilustrar tus puntos y romper muros de texto.En inglés, puedes usar herramientas como Hemingway para simplificar tu contenido.2.3. Crea etiquetas de título y meta descripciones irresistiblesLlevar a la página 1 es solo ganar la mitad de la batalla. La otra mitad es convencer a la persona que busca de hacer click en tu página en lugar de hacerlo en los otros resultados. ¿Cómo puedes hacerlo?Escribe etiquetas de título (title tags) y descripciones que inciten a hacer click.¡Más clicks = más tráfico! (Y más tráfico normalmente significa más ventas.)Además, hay evidencia de que un CTR alto (ratio de clicks o click-through-rate) puede tener un efecto más positivo en los resultados.Aquí van unos pocos ejemplos para escribir títulos meta y meta descripciones atractivos:Mantenlos cortos: Google empieza cortar tanto las etiquetas de título como las meta descripciones tras cierta longitud. Usa este simulador de SERP para comprobar que entras dentro de los límites.Usa palabras “potentes”: Impresionante. Poderoso. Probado. Etc. Estas son las palabras que provocan una respuesta emocional en los lectores. Aquí puedes ver más palabras potentes.Incluye tu keyword objetivo: No es un requisito absoluto. A veces no tiene sentido hacerlo. En general, sin embargo, esta es otra buena forma de mostrar al usuario que tu página es el resultado más relevante para su búsqueda.Para aprender más sobre cómo escribir la etiqueta de título perfecta, echa un vistazo a nuestro proceso en 4 pasos.2.4. Usa URLs descriptivasUna URL descriptiva te dice lo que puedes esperar de una página.Aquí va un ejemplo: https://ahrefs.com/blog/es/seo-local/ No hace falta ser un genio para darse cuenta de que esta página tiene que ver con el SEO local—se ve claramente solo con la URL. Esto hace que el resultado sea más clickable. Esto es porque es más probable que los usuarios hagan click en un resultado que muestre lo que pueden esperar de la página sin dejar lugar a dudas.Hay otra razón de por qué tiene sentido hacer esto: los enlaces entrantes que usen la URL desnuda como texto ancla (anchor text) incluirán tu palabra clave objetivo.2.5. Añade enlaces internosLos enlaces internos conectan unas páginas con otras en tu sitio. Por ejemplo, esto es un enlace interno a nuestra guía de palabras clave long-tail (de larga cola).¿Por qué son importantes?Los enlaces internos ayudan a transferir PageRank e incrementan la “autoridad” de páginas específicas en tu web. No solo eso, Google además mira el texto ancla de los enlaces internos para entender mejor la página.No tiene que ser exacto para ser útil 🙂— 🍌 John 🍌 (@JohnMu) October 19, 2017Por desgracia, la mayor parte de sitios ignoran esto. Se enfocan en crear nuevas páginas pero olvidan enlazarlas entre sí.No cometas el mismo error. Aquí tienes una forma rápida de empezar:Tienes una página a la que quieres enlazar. Tiene una palabra clave objetivo.Ahora, ve a Google. Introduce site:tudominio.com + “palabra clave”. Este operador de búsqueda te mostrará las páginas indexadas en tu sitio que mencionan el término objetivo. Por ejemplo, si yo quisiera añadir enlaces internos a nuestro post de “SEO para WordPress” (WordPress SEO) esto es lo que buscaría:Después, recorrería rápidamente estas páginas para encontrar dónde tiene sentido añadir enlaces internos.Si tienes acceso a la barra de herramientas SEO de Ahrefs puedes descargar todas estas páginas desde la SERP (página de resultados).Después, en el archivo CSV, puedes ordenar las URLs fácilmente por tráfico orgánico o Rating de la URL (UR) para encontrar las páginas más poderosas desde las que añadir enlaces internos.Para aprender más sobre cómo usar los enlaces internos para SEO, lee nuestra guía.3. Arregla los problemas técnicos de tu webLa manera más rápida de identificar todos los problemas técnicos en tu web es ejecutar un rastreo con Site Audit. Una vez que el rastreo esté terminado, señalará todas las URLs en tu sitio que tienen algún problema.Todo lo que necesitas hacer es encontrar las URLs que tienen errores y seguir las recomendaciones recibidas (todos los problemas son filtrables por su prioridad respectiva):¿No eres usuario de Ahrefs? No te preocupes.Debajo cubro dos de los problemas técnicos más comunes que se encuentran los propietarios de pequeños negocios.3.1. Haz que tu sitio sea seguro usando HTTPS¿Ves este pequeño candado aquí?El sitio es seguro gracias al uso del protocolo HTTPS. Esto quiere decir que la web está encriptada: solo tu ordenador y el servidor web pueden ver los datos transmitidos desde tu navegador.Dejando de lado la jerga técnica, ¿por qué deberías preocuparte?La seguridad es esencial. Google lo dijo. En 2014 Google anunció que HTTPS es un factor de posicionamiento.Aunque sea solo un pequeño empujón en el posicionamiento, deberías asegurarte de que usas HTTPS en todo tu sitio.Para aprender cómo configurar HTTPS adecuadamente, lee esta guía.3.2. Asegúrate de que tu sitio cargue rápido¿No odias cuando intentas acceder a una web y tarda mucho en cargar? Eso le pasa a tus clientes.Si quieres crear una experiencia de visita fácil necesitas asegurarte de que tu sitio cargue rápido.Además, hay un incentivo extra para ti. Ya desde 2010 Google ha dicho que la velocidad de carga de la página es un factor de posicionamiento. Esto es especialmente importante ahora que Google lanzó la indexación mobile-first (primero móvil).Site Audit debería haber señalado las páginas que son lentas:Pero si no has realizado una auditoría, también puedes usar la herramienta de Google PageSpeed Insights para comprobar la velocidad (¡es gratis!).Sin embargo, con Google PageSpeed Insights tendrás que comprobar la velocidad de cada página individualmente. No es algo grave si tienes un sitio pequeño, pero puede llevar bastante tiempo.Aquí tienes algunos consejos sobre cómo mejorar la velocidad de carga de la página:Elige el hosting adecuado. El hosting que usas (servidor compartido vs. dedicado) influye en la velocidad de carga. Aquí tienes una guía que compara la efectividad de diferentes alojamientos para WordPress.Reduce el tamaño de las imágenes. Si usas WordPress puedes instalar un plugin llamado ShortPixel. ShortPixel comprimirá de forma automática las imágenes que subas sin comprometer su calidad. Aprende más sobre esto en nuestra guía de imágenes para SEO.Activa la caché del navegador. Cuando la caché del navegador está activa, tus visitantes pueden almacenar elementos de tu página en su disco duro. Esto permite que carguen tu página sin enviar otra petición HTTP a tu servidor cuando vuelven a visitarla (¡lo que supone una carga más rápida!). Con WordPress puedes usar un plugin llamado W3 Total Cache para activar la caché fácilmente.¿No usas WordPress? Revisa esta guía con más consejos para acelerar tu web.4. Consigue algunos enlacesLos links son importantes. Son uno de los 3 principales factores de posicionamiento de Google.Esta es la razón por la que una gran parte del SEO tiene que ver con el link building. Usar estrategias creativas para conseguir que otros sitios te enlacen de vuelta lo es todo.Hay muchas tácticas probadas de link building que puedes usar para conseguir enlaces entrantes a tu sitio.Aquí van dos de ellas:4.1. Link building en comunidadesLas comunidades online son lugares donde tu audiencia objetivo pasa el rato para discutir temas, intercambiar consejos y pedir ayuda. Son lugares como foros, Reddit, Quora, grupos de Facebook y similares.Sin embargo, ten en cuenta que los enlaces que consigues aquí normalmente son “no follow”. Pero eso no es necesariamente malo. La promoción en estos sitios incrementa la exposición. Más audiencia puede de forma indirecta llevar a más enlaces.También puedes hacer lo mismo en sitios como Quora.Participa en la comunidad, hazte amigo de otras personas, entrega valor y tendrás una posibilidad de promocionar tu web.Nota del Editor¿Quieres saber las mejores preguntas para responder en Quora? Son las que ya se están posicionando en motores de búsqueda y reciben tráfico. Para encontrar estas ve a:Site Explorer > introduce quora.com > Mejores páginas > Filtra por keywords relacionadas con tu nichoJoshua HardwickHead of Content4.2. Copia los enlaces entrantes de tus competidoresSi tus competidores tienen más enlaces que tú, ¡no te preocupes! Puedes copiarlos. Simplemente tienes que encontrar quién les enlaza a ellos (pero no a ti) y encontrar una forma de replicar esos enlaces.Después de todo, si están enlazando a tus competidores, es posible que también te enlacen.La forma más rápida de empezar es usar una herramienta llamada Link Intersect. Con Link Intersect puedes ver quién está enlazando a múltiples competidores pero no a ti.En este ejemplo, he añadido a algunos de nuestros competidores en Link Intersect:Al hacer click en “Mostrar Oportunidades de Enlace” (show link opportunities) se generará una lista de oportunidades que podrías utilizar:Todo lo que queda es analizar los resultados y encontrar la razón por la que han enlazado a tus competidores pero no a ti. Después, ¡contáctales y asegúrate ese enlace para ti!Lee nuestra guía completa para copiar los enlaces entrantes de tus competidores para aprender más formas de hacerlo.Estas dos estrategias son solo la punta del iceberg en lo que se refiere al link building. Si estás buscando más tácticas, aquí está la lista completa de estrategias de link building que puedes implementar.Pensamientos finalesEsta sencilla guía de SEO DIY cubre los fundamentos del SEO.Puedes seguir esta guía una y otra vez para hacer keyword research, crear contenido optimizado para búsqueda, arreglar errores técnicos y conseguir enlaces para tu sitio.Una vez hecho esto, empezarás a posicionarte en keywords relevantes y significativas.Más éxito en los motores de búsqueda = más tráfico y ventas.Una bonita consecuencia de generar más ingresos con tu negocio es que dispondrás de más dinero para invertir en SEO. Podrías pensar en contratar a una agencia o consultor para llevar las cosas al siguiente nivel.O, si prefieres continuar la ruta DIY (Do It Yourself o “hazlo por ti mismo”), puedes aprender más tácticas y estrategias en nuestro blog, canal de YouTube y Academia.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el curso de WhatsApp Marketing & CRM. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO por ti mismo: Una Guía en 4 Pasos Básicos Que Cualquiera Puede Seguir"
    },
    {
      "level": "H2",
      "text": "1. Haz keyword research (investigación de palabras clave)"
    },
    {
      "level": "H3",
      "text": "1.1. Haz un brainstorming de algunas palabras clave semilla"
    },
    {
      "level": "H3",
      "text": "1.2. Consigue más ideas de palabras clave"
    },
    {
      "level": "H3",
      "text": "1.3. Filtrando la lista de keywords"
    },
    {
      "level": "H2",
      "text": "2. Crea páginas que están optimizadas para la búsqueda"
    },
    {
      "level": "H3",
      "text": "2.1. Crea contenido que encaje con la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "2.2. Asegúrate de que tu contenido es sencillo y fácil de leer"
    },
    {
      "level": "H3",
      "text": "2.3. Crea etiquetas de título y meta descripciones irresistibles"
    },
    {
      "level": "H3",
      "text": "2.4. Usa URLs descriptivas"
    },
    {
      "level": "H3",
      "text": "2.5. Añade enlaces internos"
    },
    {
      "level": "H2",
      "text": "3. Arregla los problemas técnicos de tu web"
    },
    {
      "level": "H3",
      "text": "3.1. Haz que tu sitio sea seguro usando HTTPS"
    },
    {
      "level": "H3",
      "text": "3.2. Asegúrate de que tu sitio cargue rápido"
    },
    {
      "level": "H2",
      "text": "4. Consigue algunos enlaces"
    },
    {
      "level": "H3",
      "text": "4.1. Link building en comunidades"
    },
    {
      "level": "H3",
      "text": "4.2. Copia los enlaces entrantes de tus competidores"
    },
    {
      "level": "H2",
      "text": "Pensamientos finales"
    }
  ],
  "author": "Si Quan Ong"
}