{
  "url": "https://ahrefs.com/blog/es/seo-off-page/",
  "slug": "seo-off-page",
  "title": "SEO Off Page: Qué es y por qué es importante",
  "description": "El SEO Off page es cualquier esfuerzo hecho fuera de un sitio web para mejorar su posición en los buscadores. ¿Pero qué implica además de la construcción de enlaces?",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido ¿A pesar de todo el esfuerzo que pones en tu contenido, aún tienes problemas posicionándote en Google? Es posible que tu SEO off-page (o la falta del mismo) sea el culpable.El SEO se puede dividir en dos categorías: SEO on-page (dentro de un sitio web) y SEO off-page (fuera del sitio web).Mucha gente piensa que el SEO off-page es lo mismo que el link building, pero ¿es realmente el caso?En este artículo cubriremos:Qué es el SEO off-pageEn qué se diferencia el SEO off-page del SEO on-pageLa importancia del SEO off-pageFactores off-page relacionados con los enlacesFactores off-page no relacionados con los enlaces¿Qué es el SEO off-page?El SEO off-page engloba todas las actividades que se realizan fuera de una página web para mejorar su clasificación en los motores de búsqueda.El link building es el mayor responsable, pero va mucho más allá.Diferencia el SEO off-page del SEO on-pageA diferencia del SEO on-page, con el SEO off-page es imposible tener un control absoluto.Un ejemplo de SEO off-page sería si le pido a alguien que me enlace a mi web, ya que realmente no cambiaría nada de mi propia web durante ese proceso. Por el contrario, si optimizo algunas imágenes de mi web mejorando así la velocidad de carga, eso sería SEO on-page porque representa un cambio directo en mi página.Si en algún momento no estás seguro de a qué categoría pertenecería una táctica de SEO, pregúntate sobre si ésta está bajo tu control o no. Si no lo está, lo más seguro es que sea una táctica de SEO off-page.Nota al margen. Hay algunos factores off-page sobre los que sí se puede tener un control total (por ejemplo, el Perfil de Empresa de Google).La importancia del SEO off-pageGoogle tiene en cuenta muchos factores off-page a la hora de decidir dónde clasificar las páginas web (si es que lo hace).Por ello, es muy complicado conseguir una buena clasificación aun teniendo un buen contenido.Este ejemplo lo demuestra bastante bien:Según estoy escribiendo este artículo, cuando busco en Google “noticias ciencia España” el primer resultado que me sale es la página de El País:De primeras, parece un contenido científico de actualidad. Por lo que no sería demasiado descabellado suponer que se clasifica en los primeros puestos por esta misma razón. Sin embargo, en cuanto haces clic en alguno de los artículos te topas con un content gate (muro de contenido).Realmente la página no ofrece mucho valor para la mayoría de la gente que aterriza en ella, ya que no pueden leer el texto. Quizá no debería salir en el primer puesto de búsqueda. Pero si lo analizamos desde un punto de vista de SEO off-page, es muy posible que ésta sea la razón por la que aparece en el primer puesto.Factores off-page relacionados con los enlacesLos backlinks son, posiblemente, la parte más importante del SEO off-page.La razón es muy sencilla: Porque las búsquedas de Google se basan en PageRank, un algoritmo que analiza la cantidad y calidad de los backlinks que apuntan hacia una página web. Algunos profesionales del SEO creen que el PageRank es un concepto obsoleto, pero Google hace unos años confirmó que sigue siendo un factor de clasificación.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理／경리” Illyes (@methode) February 9, 2017Quizá sea esa la razón por la que vemos una correlación tan clara entre el número de dominios de referencia (sitios web únicos) que apuntan hacia una página web y su clasificación.…lo que nos lleva a nuestra lista de factores off-page relacionados con los enlaces:1. Número de dominios de referenciaTener más enlaces de sitios web únicos (dominios de referencia) no sólo se traduce en una mejor clasificación, sino también en más tráfico de búsqueda orgánica.Nota al margen.Esto es un estudio de correlación, lo que significa que no prueba la causalidad.Para comprobar cuántos backlinks tiene tu página web, pega tu dominio en el Site Explorer de Ahrefs o en nuestro comprobador de backlinks gratuito.Como puedes comprobar, ahrefs.com tiene 148 millones de backlinks de 80.100 dominios de referencia.No obstante, el objetivo no es tanto construir más backlinks hacia tu página web en general, sino más bien construirlos directamente a las páginas en las que quieras clasificarte en los motores de búsqueda.Tenemos un montón de artículos y vídeos sobre link building que puedes ver aquí abajo:https://www.youtube.com/watch?v=Ovu2ZYWgOJQ&list=PLvJ_dXFSpd2tjUTuAHpHidz5e2hAedP_mLecturas complementarias9 estrategias de link building que funcionan (en inglés)Cómo ejecutar la técnica del skyscraper y obtener resultados (en inglés)Cómo conseguir backlinks: 7 tácticas que no requieren nuevos contenidosConstrucción de enlaces en la página de recursos: La guía definitiva (en inglés)Una guía sencilla (pero completa) de creación de enlaces rotos (en inglés)7 maneras de aprovechar los backlinks de tus competidores2. Autoridad de los enlacesNo todos los enlaces son iguales. La calidad importa.Esto está impregnado en el funcionamiento de PageRank: Cuanto mayor sea la “autoridad” de la página que enlaza, más autoridad transmitirá a las páginas a las que esté enlazando. Es muy sencillo, un enlace de una página con mucha autoridad vale más que uno de una página con poca autoridad.Así que la pregunta es, ¿cómo puedes juzgar la “autoridad” de una página web?Google solía tener puntuaciones públicas de PageRank, pero las suspendió en 2016. Realmente no existe una réplica exacta del PageRank, pero hay algunas métricas similares, una de las cuales es la Clasificación de URL (UR) de Ahrefs.La UR muestra la fuerza del perfil de backlinks de una URL objetivo en una escala de 0 a 100.Para ver la puntuación UR de cualquier página web, dirígete al Site Explorer de Ahrefs y pega la URL.También puedes ver la calificación de la URL de todas las páginas de referencia en el informe “Backlinks”.Esto te puede ayudar a juzgar la calidad y la autoridad de una página de enlace para buscar oportunidades de backlinks.Además, según nuestro estudio de unos 14 millones de páginas web, la UR se correlaciona perfectamente con el tráfico orgánico.3. “Dofollow” vs. nofollowGoogle no transfiere el PageRank a los enlaces nofollow (es decir, los enlaces con una etiqueta rel=“nofollow”), por lo que es más rentable dar prioridad a la creación de enlaces follow (“dofollow”).La mayoría de los enlaces en la web son follow (“seguidos”), pero en algunos sitios web como Forbes el “nofollow” está en casi todos los enlaces salientes. Por lo tanto, si estás construyendo activamente o buscando enlaces desde un sitio web en particular, merece la pena asegurarse de que tus enlaces salientes son follow.Para ello, puedes instalar nuestra barra de SEO que, entre otras cosas, resalta los enlaces nofollow en la página.También puedes filtrar muchos de los informes en el Site Explorer de Ahrefs para ver sólo los enlaces “dofollow”. Como hemos mencionado anteriormente, esto es útil a la hora de investigar y priorizar las oportunidades de backlinks.Hay que resaltar que los enlaces nofollow siguen teniendo valor. Pueden impulsar el tráfico de referencia, lo que puede generar un efecto positivo (indirecto) en el SEO. Sobre todo si usas atributos como “UGC” y “sponsored”. Pero si estás dedicando muchas horas y esfuerzo a la construcción de enlaces, entonces merece la pena priorizar tu tiempo.4. Texto de anclajeEl texto de anclaje se refiere a las palabras en las que se puede hacer clic para enlazar una página web con otra.Google afirma en su patente original de PageRank que:Google emplea una serie de técnicas para mejorar la calidad de las búsquedas, como el PageRank, el texto de anclaje y la información de proximidad.Lo que quiere decir que es posible que los backlinks con un texto ancla relacionado con el tema general de tu página web tengan cierta influencia en el posicionamiento.Esto es algo que hemos estudiado y encontrado una correlación entre los anclajes de coincidencia exacta, de frase y parcial (aunque muy pequeña).Las malas noticias es que si estás construyendo enlaces a través de métodos de white-hat, no vas a tener mucho control sobre los anclajes de los enlaces que estás recibiendo (con la excepción de los blogs de invitados).Pero aun teniendo control sobre el texto ancla de los enlaces entrantes externos, es posible que algo bueno se convierta en algo malo. Penguin, que ahora forma parte del algoritmo principal de Google, penaliza a los sitios que intentan manipular el posicionamiento mediante la creación de enlaces con anclajes con muchas palabras clave.Por suerte, la mayoría de la gente enlaza de forma natural y relevante. Es decir, si tu artículo habla de mecánica de coches, las posibilidades de que alguien lo enlace con un texto de anclaje relacionado con la mecánica de coches son bastante altas.5. RelevanciaLos backlinks son prácticamente votos. Si un sitio te enlaza, está avalando la calidad de tu contenido o negocio. Pero no todos los votos son iguales. La relevancia del sitio y la página web que te enlace también es importante.Usemos una analogía para explicar el por qué.Digamos que quieres contratar una empresa de catering para tu boda. Dos de tus amigos te recomiendan dos empresas diferentes. Los dos amigos te caen igual de bien, pero uno de ellos es contable y el otro es cocinero. ¿En quién vas a confiar? ¡En el chef!En internet las cosas funcionan igual. Si eres una empresa de catering y tienes un enlace de un blog de comida, es lógico que éste tenga más peso que un enlace de un blog de finanzas.Pero, ¿qué es más importante, la relevancia o la “autoridad”?Hicimos la siguiente pregunta a unos cuantos profesionales del SEO para intentar encontrar una respuesta:En igualdad de condiciones, ¿preferirías tener un enlace con mucha autoridad pero con baja relevancia temática o un enlace de baja autoridad con mucha relevancia temática?Estas fueron sus respuestas: Prefiero la relevancia que la autoridad, pero mi respuesta dependería del objetivo. Si hablamos de mejorar los rankings de forma rápida, probablemente me decantaría por una alta autoridad y una baja relevancia temática. Si el objetivo es mantener los rankings, el tráfico y las conversiones, optaría por una baja autoridad y una alta relevancia temática. Julie Joyce, Founder Link Fish Media No estoy seguro de mi respuesta. Creo que el contexto aquí es la clave, es decir, la competitividad del espacio, la autoridad del sitio, etc. Dicho esto, la mayoría de las veces elegiría el enlace de autoridad. Sobre todo si hablamos de mercados competitivos, ya que sería difícil posicionarse sin autoridad, independientemente de la relevancia de mis otros enlaces. De hecho, podría compensar algunos de los problemas de relevancia optimizando las palabras clave, enlaces internos, etc.Paul May, Co-founder Buzzstream Si un cliente busca exprimir al máximo la página donde hace dinero, mi experiencia me dice que los enlaces con mayor autoridad de dominio tienden a subir los rankings más, incluso si estos dominios no son demasiado relevantes temáticamente. Eso sí, si el tráfico es el mismo y el objetivo de la campaña es el tráfico de referencia y las conversiones, ahí ya me inclinaría por el enlace de menor autoridad y mayor relevancia temática. Robbie Richards, Founder RobbieRichards.com Preferiría tener un enlace que a mis competidores les cueste conseguir. Si el enlace de alta autoridad y escasa relevancia temática viene de un artículo de un periódico o revista, lo acepto. Se trataría de una decisión editorial y confiaría en el criterio del periodista o editor, y estoy segura de que el enlace se habría añadido porque han considerado que ofrecería valor a sus lectores. Pero yo, personalmente, no publicaría contenido irrelevante en mi web con la esperanza de atraer enlaces de alta autoridad de los medios de comunicación. Puede que funcione un par de veces, pero al final los periodistas se van a preguntar: “¿Por qué [marca] ha publicado contenido sobre [tema irrelevante]?” En conclusión, los enlaces de baja autoridad con alta relevancia temática serán más fáciles de conseguir, así que elegiría el enlace de alta autoridad. Gisele Navarro, Operations Director NeoMam Studios6. TráficoEstudiamos las 10 primeras posiciones de 44.589 palabras clave (no relacionadas con ninguna marca) y descubrimos una correlación clara entre las páginas mejor clasificadas y la suma de tráfico orgánico a sus páginas de referencia.Esto significa que los enlaces de páginas con mucho tráfico orgánico tienen más peso que los enlaces de páginas con poco o ningún tráfico orgánico.Puedes ver el tráfico orgánico estimado de cualquier página web en el Site Explorer de Ahrefs.También puedes ver el tráfico orgánico de las páginas de referencia en el informe de “Backlinks”.Si quieres imitar los backlinks de tus competidores, o estás llevando a cabo una táctica de construcción de enlaces como la Skyscraper Technique (la técnica del “rascacielos”), puedes clasificar el informe por tráfico orgánico para priorizar y buscar los enlaces de las páginas de más valor.De todas formas, aunque tenga sentido dar prioridad a los enlaces de páginas con tráfico, no hay ninguna evidencia que sugiera que los enlaces de páginas con poco o ningún tráfico no tengan valor. Pero si las páginas son relevantes y tienen un cierto nivel de “autoridad”, quizá te compense ir a por ellas.La razón por la que los enlaces siguen siendo un factor de clasificaciónTeniendo en cuenta que el PageRank tiene más de 20 años, no es de extrañar que te preguntes por qué los enlaces siguen siendo un factor de clasificación tan importante en 2022.Es muy sencillo: Siguen siendo uno de los factores más difíciles de manipular.Aunque es cierto que hay algunas formas “turbias” de adquirir backlinks (por ejemplo, comprándolos), conseguir enlaces de mucha calidad es generalmente muy difícil. La gente no suele enlazar contenidos a menos que tengan algún valor para sus usuarios.Factores off-page no relacionados con los enlacesEl SEO off-page se refiere a todo lo que haces fuera de tu página web con la intención de influir la clasificación en los motores de búsqueda. La construcción de enlaces es el ejemplo más obvio de todo esto, pero hay muchos otros factores off-page.Si tienes un negocio local y buscas posicionarte de forma local, esta sección te interesa, ya que muchos de estos factores son específicos para el SEO local. (Están marcados con un *)1. Menciones NAP*Las menciones NAP son menciones online de tu negocio, que también muestran el nombre, la dirección y el número de teléfono de tu empresa, conocidos colectivamente como NAP por sus siglas en inglés (Name, Address, Phone, en español: Nombre, Dirección, Teléfono).Según Moz, las señales de citación son uno de los principales factores de clasificación local off-page.Lo que significa que si tienes un negocio local y quieres clasificarte localmente, ya sea en los resultados destacados de Google o en los resultados de búsqueda orgánica normales, las menciones son muy importantes.Puedes encontrar muchas de las menciones que ya tienes buscando en Google algo así:Si haces lo mismo con tus competidores y luego cruzas las referencias de las páginas web que aparecen en estas búsquedas, puedes encontrar fácilmente más webs con las que podrías crear menciones. Lo malo es que esto puede llevar bastante tiempo y es complicado juzgar qué menciones te ayudarán de verdad a mejorar tu posicionamiento.Una solución es utilizar una herramienta dedicada a la búsqueda de menciones (por ejemplo, Whitespark). Otra es utilizar algo como el Link Intersect Tool de Ahrefs, que busca sitios web que enlazan con varios competidores, pero no con tu web. Dado que muchas menciones de NAP también tienen enlaces, pero “nofollowed”, esto suele revelar las menciones que tienen tus competidores, pero no las tuyas.Para utilizarlo, simplemente pega algunas URLs de competidores en la parte superior y la tuya en la parte inferior.Haz clic en el desplegable para ver más detalles sobre cada enlace y busca los que parecen ser de menciones.CONSEJOTambién hay que tener en cuenta que la información de tu NAP sea lo más coherente posible entre las menciones, ya que esto permite a Google vincular fácilmente esas menciones como parte de tu perfil online.Puedes obtener más información sobre las menciones del NAP en nuestra guía de SEO local.2. Menciones de marcaLas menciones de marca pueden ser con enlaces o sin enlaces.Las menciones que contengan un enlace van a tener más importancia en el SEO por razones obvias, pero ¿qué pasa con las menciones de marca sin ningún enlace?Google habla indirectamente de las menciones de marca no enlazadas en una de sus patentes, haciendo referencia a un sistema para contabilizar efectivamente los enlaces expresos (menciones enlazadas) y los enlaces implícitos (menciones sin enlace).Este es el extracto exacto de la patente: Un enlace express, por ejemplo, un hipervínculo, es un enlace que se incluye en un recurso fuente que un usuario puede seguir para navegar hasta un recurso de destino. Un enlace implícito es una referencia a un recurso de destino, por ejemplo, una mención al recurso de destino, que se incluye en un recurso fuente, pero no es un enlace expreso al recurso de destino.Google está básicamente diciendo: “Sabemos que la gente suele mencionar marcas y contenidos sin enlazar, y creemos que esas menciones nuestro algoritmo de clasificación las tiene que tener en cuenta junto con las menciones enlazadas”.Lógicamente, tiene sentido. La única diferencia de verdad entre una mención con enlace y una sin enlace es que en una se puede hacer clic y, por lo tanto, puede generar más tráfico de referencia.Entonces, si las menciones de marca son, probablemente, un factor de clasificación off-page, ¿cómo podemos conseguir más menciones?Aquí tienes algunas vías:Escribe artículos como invitado (guest blogging)Participa como invitado en podcastsInteracciona con otros blogsHazte viral (más fácil decirlo que hacerlo)También puedes utilizar herramientas como Google Alerts o en las Alertas de Ahrefs para hacer un seguimiento de las menciones de tu competencia, y esperar un poco para buscar esa conversión cuando sea apropiado. Por ejemplo, si trabajas para MailChimp, podrías crear alertas de nuevas menciones de competidores como ConvertKit y ActiveCampaign.Configuración de una alerta en Alertas de Ahrefs.Menciones enlazadas > Menciones sin enlazarAunque es cierto que Google puede asignar un cierto valor a las menciones sin enlace, las menciones con enlace siguen teniendo preferencia, aun si es solo por el tráfico de referencia. Por esto precisamente merece la pena contactar a las páginas que mencionan tu marca sin un enlace y pedirles que incluyan un enlace.Aprende a hacerlo en nuestra guía para convertir las menciones sin enlace en enlaces.3. Perfil de Empresa de Google*Perfil de Empresa de Google (GMB por sus siglas en inglés: Google My Business) es el perfil empresarial gratuito de Google.Estos perfiles son los que aparecen en los resultados destacados que salen en Google cuando buscamos “aperitivos Madrid”, por ejemplo. Se encuentran en la parte superior de los resultados de búsqueda para la intención de búsqueda local.Ejemplo de resultados destacados del Perfil de Empresa de Google en la búsqueda de “aperitivos Madrid”.No obstante, no es tan sencillo como simplemente reclamar tu perfil GMB.Moz descubrió que uno de los factores más importantes para aparecer en los resultados destacados de búsqueda es tener un perfil optimizado del Perfil de Empresa de Google, y por si no fuera poco, el cuarto factor más importante para la búsqueda orgánica local normal.En resumen, si quieres posicionarte en las búsquedas de forma local (por ejemplo, “fontanero cercano”), entonces reclamar y optimizar tu perfil de GMB va a ser lo más importante que puedas hacer de SEO off-page.Aprende a optimizar tu Perfil de Empresa de Google a través de esta guía completa.4. Valoraciones*Moz descubrió que las valoraciones son el tercer factor más importante para clasificarse en los resultados destacados de Google. Además de ser el quinto factor más importante para clasificarse en la búsqueda orgánica local normal.En general, cuantas más valoraciones positivas y genuinas tenga en tu Perfil de Empresa de Google y en sitios de terceros fiables, más probable será que te clasifique alto en los resultados destacados. Obviamente, las valoraciones negativas tienen el efecto contrario.Este mismo estudio también determinó que la “autoridad de los sitios de terceros en los que están presentes las valoraciones” influye en el posicionamiento orgánico local habitual.Aprende a conseguir más valoraciones en Google.5. Contenidos compartidos en las redes socialesLa postura oficial de Google es que los contenidos compartidos en las redes sociales no son un factor directo de clasificación.https://www.youtube.com/watch?v=udqtSM-6QbQHay gente que no se lo cree. Probablemente, se deba a estudios un poco anticuados como éste que muestran una correlación entre los rankings y los contenidos compartidos en las redes.¿Quién tiene razón?Nuestro veredicto: Probablemente Google.La razón de mayor peso es que es fácil manipular las “señales” sociales. Puedes comprar miles de likes por muy poco dinero en sitios como Fiverr. En el fondo, las cosas que son fácilmente manipulables no tienden a ser factores de clasificación fiables.Dicho esto, no cabe duda de que las acciones en redes sociales tienen una influencia positiva en el posicionamiento, aunque sea indirecta. ¿Por qué? Porque las acciones en las redes sociales reales llevan más tráfico a tu contenido, y más tráfico generan más enlaces, menciones, y todos los otros factores del SEO off-page que sabemos que tienen un efecto directo en el posicionamiento.Reflexiones finalesEs posible que el SEO off-page pueda parecer más difícil que el SEO on-page ya que hay muchos factores que están fuera de tu control. Pero ahí está el tema. Cuanto más difícil es conseguir algo, más fiable será como factor de clasificación.También hay que tener en cuenta que las actividades tradicionales de marketing online y offline pueden influir indirectamente en muchos de los factores anteriores.Por ejemplo, cuando Tesla lanzó un coche al espacio en 2018, hubo un montón de artículos que mencionaron a Tesla.Como es obvio, muchos de estos sitios enlazaron a tesla.com desde sus artículos.Con esto no estamos diciendo que lanzar un coche al espacio sea una táctica de marketing viable para la mayoría de las empresas. Lo más probable es que no necesites miles de enlaces o menciones a tu marca para posicionarte. Por ello las actividades de marketing offline a menor escala funcionan bien para empresas más pequeñas.Deja un comentario o escríbeme por Twitter si te ha parecido útil este artículo. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Off Page: Qué es y por qué es importante"
    },
    {
      "level": "H2",
      "text": "¿Qué es el SEO off-page?"
    },
    {
      "level": "H2",
      "text": "Diferencia el SEO off-page del SEO on-page"
    },
    {
      "level": "H2",
      "text": "La importancia del SEO off-page"
    },
    {
      "level": "H2",
      "text": "Factores off-page relacionados con los enlaces"
    },
    {
      "level": "H3",
      "text": "1. Número de dominios de referencia"
    },
    {
      "level": "H3",
      "text": "2. Autoridad de los enlaces"
    },
    {
      "level": "H3",
      "text": "3. “Dofollow” vs. nofollow"
    },
    {
      "level": "H3",
      "text": "4. Texto de anclaje"
    },
    {
      "level": "H3",
      "text": "5. Relevancia"
    },
    {
      "level": "H3",
      "text": "6. Tráfico"
    },
    {
      "level": "H2",
      "text": "Factores off-page no relacionados con los enlaces"
    },
    {
      "level": "H3",
      "text": "1. Menciones NAP*"
    },
    {
      "level": "H3",
      "text": "2. Menciones de marca"
    },
    {
      "level": "H3",
      "text": "3. Perfil de Empresa de Google*"
    },
    {
      "level": "H3",
      "text": "4. Valoraciones*"
    },
    {
      "level": "H3",
      "text": "5. Contenidos compartidos en las redes sociales"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}