{
  "url": "https://ahrefs.com/blog/es/seo-empresarial/",
  "slug": "seo-empresarial",
  "title": "Cómo tener éxito en SEO empresarial",
  "description": "El SEO empresarial puede definirse por el tamaño de la empresa o el sitio web, la complejidad de la tecnología o los equipos, o por las operaciones globales.",
  "content": "Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO. Contenido El SEO empresarial puede definirse por el tamaño de la empresa o el sitio web, la complejidad de la tecnología o los equipos, o por las operaciones globales. El objetivo es aumentar la visibilidad de estas empresas en los resultados de búsqueda orgánicos..¿Cómo saber si tu empresa cuenta como empresa? Me gusta bromear diciendo que sabes que es empresarial cuando todos hablan un nuevo idioma compuesto casi en su totalidad por acrónimos de tres letras (“¿El SEO SME revisó el PLP?”), Y hay equipos de personas para todo.Si eso suena como el entorno en el que estás trabajando, sigue leyendo, ya que voy a compartir ideas de mi experiencia anterior (cuatro años trabajando internamente para IBM y muchos años trabajando para otras empresas en agencia y consultoría). Eso puede ayudarte.Lo que necesita saber para tener éxitoYa sea que trabajes internamente en una empresa empresarial o seas una agencia que trabaje con clientes empresariales, esto es lo que necesitas saber para tener éxito en el mundo empresarial.Conseguir la aceptaciónPlanificación y recursos empresarialesDatos / informesOrganizaciónCapacitación y evangelizaciónConseguir la aceptaciónEn la empresa o en la agencia, tu trabajo número uno son las ventas. Si la empresa no ve el valor del SEO, entonces todos tus proyectos perderán recursos y priorizará lo que la empresa considere más importante.Lo que he descubierto que funciona aquí son mensajes fáciles de recordar, junto con la simplificación y la repetición. Cuanto más fácil sea recordar de qué se tratan tus proyectos, más posibilidades tendrán de ganar tracciónLe dirás las mismas cosas una y otra vez a mucha gente. Pero eventualmente, la gente entenderá mejor el SEO y probablemente encontrarás que tus defensores comenzarán a repetir lo que has dicho y te involucran en proyectos.Comencé muchas presentaciones con algunos datos y estadísticas simples que ayudan a la gente a comprender la importancia de la búsqueda. Aquí están algunos ejemplos:Todo el mundo googlea todo. La gente hace preguntas a Google que nunca le haría a otra persona. Puedes usar esto para promover el intercambio de datos, ya que los SEO pueden acceder a las consultas de búsqueda con herramientas como Keywords Explorer. La mayoría de las personas no saben que tienes datos sobre lo que busca la gente.El 89% de los investigadores B2B utilizan Internet durante el proceso de investigación B2B. (Google). En otras palabras, básicamente a todos.En promedio, los investigadores B2B realizan 12 búsquedas antes de participar en el sitio de una marca específica. El 71% comienza con una consulta genérica, por lo que primero busca un producto, no tu marca. (Google). Cada una de esas consultas es una parte integral del recorrido del cliente. Es probable que los buscadores de marcas que finalmente decidan comprar sean los que les brinden la información que necesitan. Esos clics pueden ser puntos de contacto de la marca y son oportunidades para que lo consideren líderes en su espacio. Deseas estar allí cada vez que alguien busca algo relacionado con tus productos.El 90,63% de las páginas no reciben tráfico de búsqueda orgánica de Google. (Ahrefs). El SEO es un trabajo duro. Tienes que esforzarte para hacer una página exitosa.La página promedio de alto rango también se ubica entre los 10 mejores resultados de búsqueda para casi 1,000 otras palabras clave relevantes. (Ahrefs). Esto puede ayudar a vender la idea de que el contenido debe cubrir un tema en profundidad.Más allá de estos, también me gusta incluir algunas estadísticas de la empresa. Las métricas como el porcentaje de tráfico de la búsqueda orgánica, el número de conversiones, los ingresos o el crecimiento año tras año (interanual) pueden ayudar a mostrar cómo el SEO es importante para la organización. También es útil recordarle a la gente que el SEO es un proceso continuo, ya que muchas personas lo ven como una tarea única.Una vez más, tu mensaje tiene que ser pegajoso si quieres que las personas recuerden quién eres y que se preocupen por el SEO.Planificación y recursos empresarialesLos recursos nunca son ilimitados. Eso es cierto tanto si formas parte de un equipo empresarial como si eres una agencia que trabaja con una empresa. Habrá grandes presupuestos, pero también hay mucho por hacer, y es probable que los equipos tengan pocos recursos en general.Llevará más tiempo hacer las cosas y es poco probable que estés siguiendo la última moda de SEO. En su mayor parte, si obtienes los conceptos básicos a nivel empresarial, lo estarás haciendo mejor que la mayoría. Aburrido = $$$ cuando se trata de SEO empresarial.Tendrás que hacer mucha más planificación de recursos y proyectos. Necesitarás una planificación anual o incluso una planificación trimestral para alinearse con los objetivos de la empresa. Muéstrales cómo el SEO ayuda a alcanzar los objetivos de la empresa y tendrá más éxito. Probablemente tendrá que hacer pronósticos de SEO sobre dónde estará dentro de un año e incluso pronosticar dónde estarás en relación con los competidores.Querrás una combinación de proyectos para tener éxito. Algunas pueden ser iniciativas de toda la empresa o proyectos de colaboración con otros equipos, mientras que otras pueden ser específicas de su equipo o incluso de individuos. Es posible que tengas algunos proyectos para centrarte en las páginas principales, secciones individuales del sitio, productos principales por ventas o cualquier cantidad de otras cosas. Parte de tu trabajo es priorizar todo. No puedes concentrarte en todo porque si todo es importante, nada lo es.Es probable que veas diferentes métodos de priorización que involucran cálculos como la Facilidad de importancia potencial (PIE). Me gusta usar una matriz de esfuerzo de impacto como la que se muestra a continuación porque es más visual. Cualquier cosa de alto impacto y bajo esfuerzo es una ganancia rápida, así que abordA esas tareas primero. Cosas como recuperar enlaces a tu sitio web o agregar enlaces internos probablemente se ajusten a esta descripción. La creación de contenido suele ser siempre un proyecto a largo plazo. Las cosas menos importantes entran en tu cartera de pedidos para cuando tenga más tiempo, y los proyectos en los que no puedes justificar los recursos porque requieren un gran esfuerzo y un bajo impacto probablemente nunca sucederán.Uno de los errores que cometen muchos SEO en un entorno empresarial es quedar atrapado en un ‘trabajo ajetreado’. Sí, cuantas más cosas te involucres, más cosas podrás captar e influenciar. Sin embargo, es fácil encontrarse en una posición en la que simplemente estás marcando casillas y no creando estrategias. El resultado son micro ganancias sin dejar de tener problemas macro. La empresa tiene que ver con la escala, y eso incluye cómo trabaja. Tienes que concentrarte en lo que tendrá el mayor impacto, lo que significa que realmente no deberías involucrarte en todas las tareas o procesos.Datos/informesLa presentación de informes puede ser una pérdida de tiempo colosal a nivel empresarial, pero es un mal necesario. Si no puedes demostrar el valor de tu trabajo y cómo contribuye a la empresa, nadie verá la importancia del SEO. Probablemente tendrás informes en PowerPoint, paneles y tal vez incluso en herramientas internas.Lo principal que debes recordar es ajustar tu informe para incluir lo que tu audiencia considera importante. Es posible que tengas KPI de SEO que sean importantes para tu equipo, pero es probable que otros equipos se centren más en las conversiones y los ingresos. Es probable que cuanto más alto llegues, más gente querrá simplemente un número que les diga cómo van las cosas. Probablemente también tendrás que ajustar la frecuencia de los informes, ya que algunos querrán informes en tiempo real y otros solo querrán informes mensuales, trimestrales o anuales.Los números pueden ser memorables y ayudar a vender ideas en presentaciones, pero querrás concentrarte más en visualizaciones que sean fáciles de entender al informar. Cuanto más fáciles de entender sean, más memorables serán. Por ejemplo, es probable que un gráfico circular rápido que muestre el tráfico de marca frente al tráfico sin marca muestre que la mayoría de los visitantes orgánicos provienen de términos de marca, y deberías centrarte más en los términos sin marca.También querrás hacer una descripción general con equipos de diferentes herramientas y datos a los que tienes acceso. Debes recordar que es probable que no conozcan las herramientas, métricas o datos que tienes, y es posible que no sepas qué datos necesitan para tomar decisiones. Reúnete con ellos y averigüa lo que necesitan. Algunas de las cosas que los SEO consideran simples, como los datos de palabras clave, pueden ser extremadamente útiles para otros equipos y ayudarlos a tomar decisiones informadas. Share of Voice será útil para los ejecutivos y equipos de productos para informarles su posición en el mercado. Es posible que los equipos pagados y de productos quieran ver la distribución de búsquedas orgánicas, pagadas y sin clic, como se muestra en el Explorador de palabras clave.Un último consejo para la elaboración de informes es utilizar el éxito de las iniciativas con un grupo para promover y desplegar en toda la empresa. Cuenta la historia de cómo trabajaste con el equipo, que salió bien, las lecciones aprendidas y cómo crees que el proceso debería cambiar en el futuro. La narración de historias contribuye en gran medida a impulsar la adopción. También puedes ganar puntos convirtiendo a otros en héroes; escríbeles buenos comentarios y reseñas de pares, y será más probable que se lleven bien contigo en el futuro.OrganizaciónLas organizaciones empresariales tienden a ser complicadas. Es probable que tenga muchas cadenas de administración y mucha complejidad que aprender antes de poder avanzar en algunos proyectos. El simple hecho de encontrar el camino hacia los equipos adecuados y las personas adecuadas puede llevar tiempo, y los equipos externos pueden tener que confiar en el equipo interno para obtener gran parte de este conocimiento.La organización de tu equipoLos equipos de SEO se sientan en muchas áreas diferentes: marketing, análisis, producto, desarrollo, contenido, digital, etc. No creo que haya una respuesta correcta o incorrecta sobre dónde deberían estar los SEO, y mucho depende de la organización de la empresa. No importa dónde estés, probablemente trabajarás con todos estos equipos y más. La ubicación de tu equipo puede incluso cambiar con el tiempo a medida que las empresas se reorganizan o se fusionan con otras empresas.Otros equiposPara cada tarea de la que una agencia de SEO puede ser responsable, es probable que haya un equipo que lo haga a nivel empresarial. Probablemente te encontrarás con equipos de los que nunca has oído hablar, como taxonomía / ontología, y trabajarás con equipos en los que no habrías pensado, como eventos, marcas o legales.En muchos casos, trabajarás con estos equipos en varios proyectos, o para obtener los permisos que necesites para tener éxito. Querrás tener la mayor visibilidad posible de lo que se está trabajando en la empresa y asegurarte de que estos equipos sepan que existes y te conecten cuando sea necesario.Descubrirás que muchos de estos equipos tienen reuniones semanales, horas de oficina, eventos de networking e incluso “almuerzan y aprenden”. Todas estas son excelentes formas de saber quién hace qué y en qué están trabajando. Probablemente también deberías tener todas estas cosas para SEO. Las rosquillas, la pizza y la cerveza te ayudarán a conocer gente, pero los componentes educativos y el intercambio de información te ayudarán a ser memorable.Siempre fui oportunista en mi enfoque de SEO y traté de trabajar con equipos cuando estaban listos para emprender proyectos. Pierde esta oportunidad, y podrías pasar un tiempo antes de que estén dispuestos a trabajar contigo nuevamente.ExternoEs probable que tengas una agencia o agencias trabajando contigo en diferentes cosas. La forma en que he visto que esto funciona mejor es que las agencias llenan los vacíos de su equipo. Tal vez eso sea hacer un trabajo más duro, tareas específicas en las que tu equipo puede no tener mucha experiencia o simplemente proporcionar recursos adicionales para permitir que tu equipo haga más.Si eres una agencia, mi mejor consejo es ser flexible y hacer lo que sea necesario de ti en ese momento. Tu trabajo es hacer que la persona interna o el equipo se vea bien, lograr que asciendan y obtener más recursos.Capacitación y evangelizaciónCuanto más compartas y empoderes a otros, más fácil será tu vida en una empresa. Recuerda, tienes limitaciones de recursos, así que capacita a las personas y encuentra a sus evangelistas que crean y ayuden a promover el SEO. Te ayudará a escalar tu impacto.Todas las cosas que mencioné anteriormente, como las reuniones semanales, el horario de oficina, los eventos de networking y el “almuerzo y aprendizaje” son excelentes para la capacitación y la evangelización. Pero también puedes realizar capacitaciones de equipos individuales, capacitaciones grupales, talleres y cursos internos que se enfocan en diferentes temas o herramientas. Busca oportunidades para agregar una sesión a los eventos / talleres / capacitación de la empresa que otros equipos puedan organizar. Es probable que haya eventos dirigidos al marketing, el desarrollo, la analítica o cualquier cantidad de oportunidades en las que el SEO pueda ser un tema relevante. Tal vez incluso comience un boletín informativo por correo electrónico con actualizaciones de la industria de SEO y de la empresa que la gente pueda encontrar útiles. Cualquier oportunidad de demostrar tu experiencia ayudará a que tu programa de SEO tenga éxito.Cómo hacer SEO empresarialUna de las cosas más interesantes de trabajar en SEO empresarial es tener un menú interminable de oportunidades. Tienes mucha más libertad para elegir lo que crees que es importante y lo que tendrá el mayor impacto. Muchas empresas desarrollan proyectos o equipos en torno a algunos de los principios básicos de SEO, contenido, enlaces y SEO técnico.Trabajar con contenido / activosConstruyendo y creando enlacesSEO técnicoTrabajar con contenido / activosExiste la idea errónea de que los sitios web grandes con alta DR pueden clasificar para cualquier palabra clave. La realidad es que muchos sitios web empresariales obtienen una gran parte de su tráfico general de búsquedas de marca y es posible que no se clasifiquen bien para los términos sin marca. Por ejemplo, apple.com tiene un DR de 97, lo que lo convierte en uno de los sitios web más sólidos de nuestro índice. La mayor parte de su tráfico proviene de términos de marca, y puede resultar sorprendente que no se posicione para términos como “smartphone”. De hecho, según Site Explorer de Ahrefs, más de 41 millones de visitas orgánicas en EE. UU. Provienen de palabras clave de marca. Eso es más de la mitad de su tráfico orgánico estimado en EE. UU.No estoy diciendo que el tráfico de marca sea malo porque no lo es. Es de alta calidad y genera buenas conversiones, y es probable que existan muchas oportunidades sin marca para estos sitios. Pero todavía tienen que esforzarse y hacer las cosas bien como cualquier otra persona si quieren tener éxito.Las ventas de la mayoría de las empresas empresariales son un embudo más largo. Aún así, muchas empresas quieren omitir el contenido informativo y de la parte superior del embudo y centrarse más en el final del tráfico del embudo que se convierte. Al hacerlo, reducen su cartera y brindan a sus competidores oportunidades de ser vistos como expertos y ayudar a las personas en lugar de a ellos. Asimismo, muchas empresas descuidan a los usuarios después de la venta. Esto conduce a la pérdida de oportunidades en la promoción y también a las ventas adicionales / cruzadas.Optimización del contenido existenteProbablemente te encontrarás con contenido demasiado centrado en la marca, demasiado centrado en el producto o incluso demasiado centrado en las palabras clave. Las personas querrán posicionar los términos de las páginas que controlan que no se alinean con la intención de búsqueda. Un buen ejemplo es alguien que quiere que la página de su producto se clasifique para un término informativo.En ocasiones, es posible que desees optimizar e incluso crear contenido para términos de marca, pero esta no debería ser tu estrategia habitual. Tampoco debes “esparcir algunas palabras clave” en las páginas centradas en la marca o el producto para tratar de clasificar los términos informativos. Estas páginas pueden estar llenas de jerga de marketing o ventas y no tener el contenido que se necesita para clasificar. Tu mejor estrategia será crear el contenido que sabes que es necesario. Eso significa tener una estrategia de contenido para crear nuevas páginas que se alineen con la intención de búsqueda.En otros casos, lo que puedes querer hacer es actualizar el contenido sin marca existente que ya funciona bien. Querrás asegurarte de que el contenido se alinee con lo que buscan las personas y de lo que están hablando otras páginas principales. Mejora el contenido encontrando al experto en el tema en tu empresa y obteniendo sus conocimientos; el tipo de información que otro contenido puede no cubrir.Una forma común de priorizar el contenido es buscar oportunidades de poca monta, como las páginas que se posicionan en las posiciones 6-10 u 11-20 para tu palabra clave principal. Es posible que puedas mejorar rápidamente el contenido de estas páginas para obtener una clasificación más alta y obtener más tráfico. Utiliza Google Search Console o el informe de palabras clave orgánicas en Site Explorer para encontrar páginas que se ajusten a tus necesidades.Crear contenidoAl crear contenido, busca un proceso que funcione mejor para tu empresa y los creadores de contenido. Me gusta hablar con los expertos o entrevistarlos para conocer sus opiniones. También veré lo que la gente busca en torno a un tema y lo que cubren otras páginas. Es probable que tengas un equipo de personas que crean el contenido y es posible que puedas capacitarlos para que realicen este proceso por sí mismos. Alternativamente, puedes proporcionarles un resumen simple de digerir o un resumen de contenido que cubra lo que esperas ver en el artículo.Si los empleados quieren escribir contenido, debes encontrar una manera de capacitarlos para que lo hagan. Estos son sus expertos y, si bien el contenido que crean puede requerir cierta edición, la información de estos empleados es valiosa y puede que no se encuentre en ningún otro lugar. Si tus expertos no tienen tiempo para escribir contenido, otra opción es entrevistarlos. La mayoría de las personas suelen estar felices de brindar información rápida verbalmente, que luego puedes usar en tu contenido.Me gusta comenzar con las páginas principales de mi competidor en lugar de comenzar la investigación con una lista de palabras clave. Si exportas y combinas estos datos, terminas con una lista del contenido más exitoso de tu competidor y puedes comenzar con el contenido que sabes que ya funciona y que probablemente genere valor para un competidor. A todos los equipos con los que trabajé, ya sean centrados en productos o en marketing, les encantó ver estos datos. Puedes encontrarlo en el informe Páginas principales en Site Explorer.La creación de contenido tendrá que ser simple, repetible y escalable, y querrás cubrir la mayor parte posible del recorrido del usuario. Recuerda que el contenido es para personas, por lo que debes estar allí para las diferentes cosas que buscan. Se útil, relevante, muestra tu experiencia y es probable que seas la empresa con la que los clientes potenciales elijan hacer negocios.Una de las cosas que me gustaba utilizar con los equipos de contenido era un ejercicio de clasificación de tarjetas. Toma los datos que estás viendo sobre lo que buscan la gente y sobre lo que hablan las páginas principales, y colocalos en tarjetas de índice. Haz que sus redactores de contenido organicen esto de una manera que tenga sentido para ellos. Van a agrupar sus datos en temas y subtemas y crearán las secciones de contenido o las páginas que deben escribir. Esto ayuda a capacitar a la gente para que realice esta tarea por sí mismas, y no hay una respuesta correcta o incorrecta sobre cómo debe organizarse. También puedes mostrar cómo las páginas principales cubren esta información como confirmación de que funciona.Otro consejo sobre la creación de contenido es traducir contenido exitoso. La mayoría de las empresas operan en muchos países y en muchos idiomas diferentes. Si tienes contenido que funciona bien en un idioma, es probable que también funcione bien en otro idioma. Hemos comenzado a hacer esto recientemente con nuestro contenido. A pesar de asignar recursos mínimos a este proceso, ya vemos resultados.Un último consejo es investigar qué canales promocionales están disponibles a través de otros equipos. Por ejemplo, los equipos sociales pueden promover contenido nuevo y los equipos pagos pueden impulsarlo con anuncios o distribución. Asegúrate siempre de presupuestar la promoción de contenido.Sindicación de contenidoCon sitios web más grandes, es probable que encuentres algo que quizás no hayas visto antes: distribución de contenido. La sindicación de contenido es cuando uno o más sitios de terceros vuelven a publicar una copia exacta del contenido que apareció originalmente en otro lugar. Sucede con frecuencia con el contenido de noticias, aunque, para ser honesto, cualquier sitio popular tendrá scrapers y probablemente una estrategia de sindicación pagada. La distribución tiene muchos beneficios, incluido un mayor alcance. Consulta nuestro artículo sobre distribución de contenido para obtener más información al respecto y saber cómo seguir las mejores prácticas.Construir y crear enlacesGran parte de la construcción de enlaces ocurre sin SEO a nivel empresarial. Las empresas suelen ser muy activas y hacer cosas diferentes. Es posible que veas anuncios de televisión, escuches anuncios de radio, tengas mucho contenido nuevo. Luego están las relaciones públicas, las redes sociales, la publicidad pagada, la sindicación de contenido, los eventos, las asociaciones corporativas, los influencers, la publicidad de celebridades, los programas de afiliados y más. La mayoría de los enlaces probablemente se producirán sin ti, pero puedes ayudar a guiar a muchos de los equipos a cargo de estos canales con las mejores prácticas.Enlaces externosSi vas a tener proyectos de construcción de enlaces, es posible que tengas algunas ganancias fáciles. Uno de mis favoritos es simplemente recuperar los enlaces que ya apuntan a tu sitio redirigiendo las páginas que actualmente son 404.Site Explorer> tudominio.com> Pages> Best by Links> agregue un filtro de respuesta HTTP “404 not found”> redireccione estas páginas a las páginas actuales relevantes.Site Explorer > tudominio.com > Pages > mejores por creación de enlaces > añadir “Redirigir estas páginas a páginas actuales relevantes. > Redirigir estas páginas a páginas actuales relevantes. Las menciones de marca sin enlazar, o incluso las menciones de los mejores empleados, son otra victoria fácil. Se tiende a hablar bastante de las empresas, y cada una de esas menciones ofrece la oportunidad de obtener un enlace. Incluso si inicialmente no hay un enlace, no está de más pedir uno. Puedes usar Content Explorer para encontrar estas menciones en la web y el filtro incorporado para resaltar dominios no vinculados para concentrarte en las menciones no vinculadas.También puedes terminar trabajando con sitios externos como plataformas de reseñas o agregadores. Muchos de estos cuestan dinero y los enlaces no siempre transmiten valor. Pero pueden ser increíbles para la exposición. Estos sitios se clasifican en función de muchos términos relevantes y es probable que muchos otros profesionales empresariales vean tus informes. En muchos casos, si no estás en estas redadas, es posible que no estés en la consideración establecida para la compra.Puedes utilizar Site Explorer para comprobar los enlaces de la competencia y los dominios de referencia también. Puedes ver su perfil de enlace general o incluso su perfil de enlace reciente para ver cómo están obteniendo o creando sus enlaces. Con estos datos, también puedes determinar si hay algo más que deseas hacer para la construcción de enlaces.Tienes una cantidad casi ilimitada de oportunidades de construcción de enlaces como empresa. Todo depende de tu presupuesto y de tu imaginación, pero cuando la gente me pregunta cuál es la diferencia más significativa en la construcción de enlaces a nivel empresarial, generalmente les digo que son adquisiciones. La forma más fácil de posicionarse para algo nuevo es comprar una empresa que ya tenga un buen posicionamiento para sus términos objetivo. No solo agrega un producto / servicio o nuevas características a tus productos, sino que también hereda el contenido existente, que probablemente fue parte de la razón por la que la empresa adquirida ya tuvo éxito.Con estas adquisiciones u otros sitios web que tu empresa pueda controlar, también tienes oportunidades para obtener más enlaces. Donde tenga sentido, querrás agregar enlaces entre estos sitios web. En última instancia, es posible que desees consolidar el contenido en un sitio, pero eso no siempre es factible. Incluso si es así, es posible que no suceda dentro de un período de tiempo razonable, por lo que es posible que desees agregar enlaces entre los sitios mientras tanto.Vínculos internosSiempre me ha parecido que los enlaces internos son una forma eficaz de ayudar a que las páginas tengan una clasificación más alta. Incluso estos enlaces pueden ser difíciles de conseguir en un entorno empresarial. A veces, diferentes personas son responsables de diferentes secciones del sitio web, lo que puede hacer que la vinculación interna lleve mucho tiempo.Además de los obstáculos políticos, el proceso de vinculación interna puede ser un poco complicado. Tienes que conocer bien el sitio y leer varias páginas en busca de oportunidades de enlaces, o puedes seguir un proceso que implica mucho raspado y rastreo para encontrar oportunidades.En Ahrefs, hemos hecho esto simple, escalable y accesible para que cualquiera pueda encontrar estas oportunidades. Tenemos un informe de oportunidades de enlaces internos en Site Audit que recomendará enlaces internos cuando corresponda.Hay un tutorial en el informe en sí que explica cómo funciona.También recomendaría estar atento a las oportunidades para utilizar un mejor texto de anclaje de enlace. Es común que los creadores de páginas hagan un uso excesivo del texto de anclaje de enlaces genéricos, como “obtener más información”, “leer más” o “hacer clic aquí”. Puedes buscar el uso de este tipo de copia genérica en el informe de backlinks internos en Site Explorer.PenalidadesNo estoy seguro de haber visto un sitio web grande que no reciba al menos un par de sanciones al año. Si bien esto puede ser sorprendente para algunas personas, sucede porque muchos de estos sitios tienen gente que abusa de secciones de contenido generado por el usuario donde envían spam a los enlaces. Por lo general, no es una preocupación porque las sanciones generalmente solo afectan partes del sitio. Sin embargo, algunos sitios web experimentan problemas más importantes. Cuando esto le sucede a una marca conocida, suele ser importante.SEO técnicoLos sitios empresariales pueden tener infraestructuras complejas y muchos sistemas heredados en su lugar. Incluso puede haber muchos equipos diferentes responsables de mantener todo, lo que significa que el entorno técnico y el entorno político pueden ser complicados. A veces, las páginas o secciones del sitio tendrán problemas que nunca se solucionan porque hacerlo es demasiado costoso.Un error puede mantener millones de páginas fuera del índice o eliminar un sitio completo de los resultados de búsqueda. Hay tantas partes móviles, tantas que pueden salir mal, y tantas veces que tendrás que elegir la opción menos mala. No tendrás el control de todo. Simplemente haz lo mejor que puedas y, cuando tenga la oportunidad, toma la decisión más preparada para el futuro que puedas.Al enfocarte en proyectos técnicos, es probable que tengas un número ilimitado de cosas requiriendo tu atención. Debes aprender a priorizar tareas y centrarte en los problemas más importantes. Si bien sería genial si pudieras obtener todo técnicamente perfecto, simplemente no es realista. Una de las cosas que me gustan de la Auditoría del sitio de Ahrefs es que puedes optar por ignorar los problemas que no consideras importantes.En el mundo empresarial, es probable que dependas de muchos equipos diferentes para realizar el trabajo. Tendrás que ser oportunista y ayudar a muchos de estos equipos en su propia línea de tiempo, cuando estén listos, pero eso no significa que no puedas prepararte para ellos con anticipación. Querrás saber cómo funcionan estos equipos, sus procesos y herramientas, y las oportunidades que puedes tener para interactuar con ellos, como llamadas de scrum, llamadas de equipo u horas de oficina a las que puedes unirte. Si puedes ser muy claro en tu comunicación con el equipo, facilitarán mucho el proceso. Aprende a escribir tickets en tu sistema de gestión de proyectos que comunican el problema, los resultados esperados y el valor de implementar los cambios.Un último consejo es que si no pareced estar progresando en los proyectos, intenta vender los cambios que deseas realizar como pruebas A / B. Muchas empresas desean realizar más pruebas y puedes “probar” tus cambios para ver el impacto que tienen. Con un impacto medible, puedes abogar por una solución más permanente.Ideas de proyectosQuería cubrir algunos proyectos para ayudarte a comenzar con el SEO técnico en una empresa.Indexación. Probablemente tengas algunas páginas indexadas que no deberían estar, y muchas páginas no indexadas que deberían indexarse. La canonicalización es otro problema que se debe verificar para asegurarte de que la versión correcta de la página está indexada. También puede ayudar a identificar problemas de seguridad y fugas de datos si observad qué páginas se han indexado accidentalmente.Redirecciones. Busque páginas rotas en tu sitio que tengan enlaces que las apunten, luego redirige esas páginas.Preparado para el futuro. Vale la pena analizar cualquier cosa que puedas hacer para evitar que algo se rompa en el futuro o evitar que los procesos o sistemas cambien nuevamente en el futuro.Enlaces rotos. Encuéntralos y arreglalos.Velocidad de página. Haz t sitio web más rápido.Implementa el marcado de esquema para ganar más presencia en los SERP.Agrega mapas del sitio. Me aseguraría de que esto esté automatizado. La creación manual de un mapa del sitio rara vez es un uso inteligente de su tiempo.Crea pautas, listas de verificación y árboles de decisiones. Básicamente, cualquier cosa que ayude a la gente a tomar las decisiones correctas le ahorrará tiempo en el futuro.Las pruebas automatizadas y el monitoreo del sitio pueden ayudar a detectar problemas antes de que ingresen al sistema o rápidamente después.Análisis de archivos de registro. Siempre digo que este es un gran quizás. Los archivos de registro pueden ser políticos, técnicamente complejos de extraer y almacenar, y costosos. Deberás estimar el tiempo y los recursos necesarios para ver si sus casos de uso justifican los recursos.ConclusionesHay mucho en juego en el SEO empresarial y muchas oportunidades. No te desanimes si no estás progresando. Solo prueba de otra manera y nunca te rindas, y progresaras. Cuando una empresa y su gente finalmente apoyan el SEO, pueden dominar una industria.En este artículo, quería comunicar algo de mi experiencia en el mundo empresarial y algunas cosas que pensé que serían útiles. Espero que sea información valiosa para algunos de los que están leyendo.Si tienes sugerencias, experiencias que te gustaría compartir o preguntas, házmelo saber en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Patrick Stox Patrick Stox es asesor de producto, técnico en SEO y embajador de marca Ahrefs. Organiza el Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup, Findability Conference y modera en / r / TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo tener éxito en SEO empresarial"
    },
    {
      "level": "H2",
      "text": "Lo que necesita saber para tener éxito"
    },
    {
      "level": "H3",
      "text": "Conseguir la aceptación"
    },
    {
      "level": "H3",
      "text": "Planificación y recursos empresariales"
    },
    {
      "level": "H3",
      "text": "Datos/informes"
    },
    {
      "level": "H3",
      "text": "Organización"
    },
    {
      "level": "H4",
      "text": "La organización de tu equipo"
    },
    {
      "level": "H4",
      "text": "Otros equipos"
    },
    {
      "level": "H4",
      "text": "Externo"
    },
    {
      "level": "H3",
      "text": "Capacitación y evangelización"
    },
    {
      "level": "H2",
      "text": "Cómo hacer SEO empresarial"
    },
    {
      "level": "H3",
      "text": "Trabajar con contenido / activos"
    },
    {
      "level": "H4",
      "text": "Optimización del contenido existente"
    },
    {
      "level": "H4",
      "text": "Crear contenido"
    },
    {
      "level": "H4",
      "text": "Sindicación de contenido"
    },
    {
      "level": "H3",
      "text": "Construir y crear enlaces"
    },
    {
      "level": "H4",
      "text": "Enlaces externos"
    },
    {
      "level": "H4",
      "text": "Vínculos internos"
    },
    {
      "level": "H4",
      "text": "Penalidades"
    },
    {
      "level": "H3",
      "text": "SEO técnico"
    },
    {
      "level": "H4",
      "text": "Ideas de proyectos"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Patrick Stox"
}