{
  "url": "https://ahrefs.com/blog/es/seo-descripcion-puesto/",
  "slug": "seo-descripcion-puesto",
  "title": "Roba Nuestra Plantilla de Descripción de Puesto de Especialista SEO",
  "description": "Esta plantilla de descripción de puesto de especialista SEO fue creada a partir de una encuesta de 15 responsables de contratación SEO.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido Los especialistas SEO son marketeros responsables de mejorar la visibilidad de un sitio web en los resultados orgánicos de búsqueda. Si trabajan en una agencia en lugar de en una empresa, toman esa responsabilidad para las webs de varios clientes.¿Te suena a alguien que intentas contratar? Te cubrimos las espaldas.Hemos rastreado portales de empleo como LinkedIn o Indeed en busca de rasgos comunes en las descripciones de empleo de Especialista SEO. Después preguntamos a 15 responsables de contratación de SEO—tanto en agencia como en empresa cliente—para ver si estas responsabilidades, capacidades y requisitos conectaban con ellos. A partir de sus respuestas, hemos creado una plantilla de descripción de puesto (job description en inglés).Sin más lío, aquí va la plantilla.Plantilla de descripción de puesto de Especialista SEO [Nombre de Empresa] busca especialista SEO que se encargará de [breve descripción de lo que harán].ResponsabilidadesRealizar keyword research y análisis de la competenciaEntender e implementar auditorías y cambios de SEO técnicoRealizar optimizaciones on-pageImplementar cambios en los CMS (content management systems).Gestionar la producción de contenidos planificando calendarios editoriales, gestionando redactores (o colaborando con los equipos de redacción de contenido) y apoyándolos en SEOConcebir y ejecutar métodos de seguimiento, informes, análisis y mejoras del rendimiento del SEOColaborar con responsables SEO y otros equipos internos de marketingColaborar con desarrolladores y equipos de producto para implementar las funcionalidades y cambios necesariosDesarrollar nuevos tests y estrategias SEOPresentar y comunicar estrategias y proyectos SEO a clientes y/o grupos de interés internosActuar como el principal experto/embajador SEO.Mantenerse al día de las últimas tendencias SEO, estrategias y cambios en el algoritmoRequisitos+2 años de experiencia trabajando en SEOBuen conocimiento de las mejores prácticas SEOPasión por el SEO y el marketing en internetCapacidad de crear, justificar, comunicar e implementar estrategias SEO en los equipos y agencias externas.Data-driven (enfocado en datos) y mentalidad analíticaAtención al detalleCapacidad de gestión de proyectosDeseableExperiencia trabajando con herramientas SEO, incluyendo Google Search Console, Google Analytics, Ahrefs, y Screaming FrogExperiencia con y/o conocimientos de programación (por ejemplo, HTML, CSS, JavaScript)Experiencia con y/o conocimientos de otros canales de marketing (por ejemplo, PPC)Experiencia trabajando con CMS conocidos (por ejemplo, WordPress)Experiencia con SEO técnicoExcelentes capacidades de redacción¿Quieres una plantilla de esta descripción laboral? Haz una copia aquíCómo usar la plantillaLa plantilla es solo un punto de partida. No es la Biblia. Dependiendo de si eres una agencia o un equipo interno, el especialista SEO que busques será distinto. Añade o elimina elementos de cada sección como quieras. Si una capacidad de la sección de “deseables” es importante en el rol que contratas, cámbiala al apartado de “Requisitos”.Más allá de eso, aquí van algunos consejos.1. Añade una breve descripción de tu empresaNo esperes que la gente sepa de qué va tu empresa. Dales una breve descripción de qué hace tu compañía. Puedes añadir esta parte justo al principio, antes de tu descripción del trabajo.Normalmente, las empresas incluyen su misión corporativa.La misión de Groupon es convertirse en hábito diario del comercio local y satisfacer nuestro propósito de construir comunidades fuertes gracias a pequeños negocios florecientes que conectan personas a un mercado global, dinámico, de servicios, experiencias y bienes locales.Si crees que tu visión y visión aporta valor, siéntete libre de incluirla.Sin embargo, intenta evitar la jerga corporativa. La descripción de puesto de KlientBoost ofrece un buen ejemplo de cómo hacer esto bien:Hey hey heyyy, gracias por echar un vistazo 😉Aquí van algunos fun facts sobre KB:Somos extremadamente transparentesNos encanta el feedback (Bueno o Malo)Queremos prosperar y crecerNos gusta la P.A.R.T.Y. (más después)¡Estamos creciendo! Nuevas oficinas en Raleigh, Austin y una oficina europea súper secreta (que será anunciada el mes que viene)La cultura es una de las grandes razones por las que las personas eligen trabajar con nosotros. Somos el tipo de empresa que ama poner primero a las personas, ayudarlas a mejorar y asegurarnos de que están listas para tener éxito. ¡Todo mientras pasamos un buen rato!Echa un vistazo en gram, YouTube & Glassdoor. (ese rating 4.9) Saben que las nuevas contrataciones se preocupan con la cultura de la empresa. Así que en lugar de un eslogan vacío creado por ejecutivos trajeados en su retiro vacacional de una-vez-al-año, fueron directamente a por la preocupación principal.2. Ofrece instrucciones claras sobre cómo aplicarEl objetivo de contratar no es recibir tantas solicitudes como sea posible. Lleva tiempo tener que filtrar montones de currículums.En lugar de eso, deberías enfocarte en encontrar personas relevantes y cualificadas. Una buena forma de hacer esto es incluir cómo te gustaría que se inscribieran. Esto disuadirá a las personas que se apuntan a las ofertas de forma perezosa y cuya única estrategia es enviar en masa sus currículum.Por ejemplo, en nuestras ofertas de empleo, decimos específicamente lo que queremos que hagan los candidatos:Cómo Inscribirse:Envía un email a Joshua Hardwick con la siguiente información:Enlaces a 1-2 de tus artículos publicados sobre SEO/marketingTu disponibilidad (tiempo completo/tiempo parcial/freelance)Tu experiencia en SEO/marketingPor qué eres un buen encaje para este puestoTu perfil de LinkedIn (por favor, explica brevemente tu experiencia laboral si no tienes)Una breve descripción de una campaña de marketing que dirigieras y los resultados (buenos y malos)Tu experiencia con herramientas de Ahrefs.3. Ofrece a los mejores candidatos una razón para aplicarToda empresa quiere contratar a jugadores-A. Pero no hay muchos por ahí. Así que tienes que decirle a esos candidatos por qué deberían elegirte sobre otras empresas.Esto normalmente implica hablar sobre el sueldo y tipo de beneficios que tu empresa ofrece.Sin embargo, no se limita a eso. Puedes reiterar la misión de tu empresa, presentar el futuro de la empresa, hablar sobre la flexibilidad de tiempo y/o ubicación y demás.Por ejemplo, esto es lo que hace Perfect Keto.Cómo hemos creado la plantilla de descripción del puestoEmpezamos por buscar los puntos en común entre las job description de Especialista SEO en portales conocidos de empleo. Para nada fue un proceso científico; lo hicimos a ojo. Después creamos una encuesta en base a esos patrones y la enviamos a 20 responsables de contratación SEO. 15 respondieron.La encuesta se dividía en dos secciones:ResponsabilidadesCapacidades y requisitosEchemos un vistazo más en detalle a las respuestas.ResponsabilidadesEn esta sección, presentamos a los responsables de contratación SEO 19 de las responsabilidades más comunes de las descripciones de puestos de Especialista SEO. Después les preguntamos si cada una de estas sería o no una responsabilidad en el día a día para su “Especialista SEO”.Aquí van los resultados.Para sorpresa de nadie, los deberes habituales de SEO como hacer keyword research, SEO on-page y SEO técnico son parte de las responsabilidades del día a día esperadas. Al igual que otras tareas clave como colaborar con otros equipos (especialmente, equipos de contenido), hacer informes, presentar estrategias SEO y recomendaciones a grupos de interés internos/externos y desarrollar nuevos tests SEO.Mantenerse al día con las últimas noticias y tendencias del sector también es algo que se espera como parte del trabajo. Sin embargo, no se espera que los especialistas SEO creen contenido y hagan link-building.Por supuesto, no presuponíamos saberlo todo, así que añadimos una pregunta:“¿Hay algunos otros roles y responsabilidades que te gustaría añadir que no estén en esta lista?”Aunque un par de personas aportaron ejemplos más específicos de responsabilidades, creo que esta respuesta de Jessica Levenson merece ser destacada:“Honestamente, es un conjunto de habilidades. Quiero a alguien que sea curioso. No tienen que tener todas las capacidades, tienen que estar dispuestos a aprender y ser siempre curiosos”Jessica Levenson, Head of Digital Strategy & SEO Oracle NetSuiteCapacidades y requisitosEn esta sección, le presentamos a los responsables de contratación SEO 15 de las capacidades y requisitos más comunes de las descripciones de Especialista SEO. Después les preguntamos si estas habilidades serían muy importantes, algo importantes o nada importantes para ellos si estuvieran contratando a un “Especialista SEO”.Aquí van los resultados.Como algo interesante, vemos que las capacidades en que la mayoría, sino todos, los encuestados coincidieron son las soft skills (habilidades blandas o interpersonales, como atención al detalle, mentalidad dirigida por datos, comunicación) o de actitud (por ejemplo, pasión por el SEO y marketing en internet).Como Jessica Levenson añadió,“La capacidad sobre la experiencia es siempre mi postura. Puedo enseñar SEO a cualquiera siempre que estén dispuestos y tengan voluntad. Por el contrario, no puedo desentrenar personalidades difíciles o una falta de voluntad de aprender”.Jessica Levenson, Head of Digital Strategy & SEO Oracle NetSuiteVale, eso no significa que las hard skills o habilidades técnicas no sean necesarias. Los encuestados estaban de acuerdo en que un buen entendimiento de las mejores prácticas SEO, de buenas capacidades de SEO técnico y experiencia previa en la industria SEO son deseables.¿Exactamente, cuántos años de experiencia buscan los responsables de contratación? La mayoría dijo que un mínimo de +2 años.Más allá de los años de experiencia en el sector, la mayoría de los encuestados también preferían que sus especialistas SEO tengan algo de experiencia con herramientas SEO.Aquí tienes lo que dijeron después de que les preguntáramos qué herramientas SEO en concreto:Finalmente, la mayoría dijo que “conocimientos de programación” era algo importante. Y aquí van los lenguajes de programación que dijeron que eran importantes.Reflexiones finalesLas habilidades técnicas son importantes. Pero la mayoría de los encuestados destacaron que la actitud es incluso más crucial. Si en algún momento encuentras un candidato que se deja guiar y es genial trabajando en equipo, pero al que le faltan ciertas habilidades técnicas, no temas darle una oportunidad.Las habilidades de marketing siempre se pueden enseñar a la persona adecuada.Si estás leyendo esto como potencial empleado en la industria SEO, no te desanimes. Casi todos estuvieron de acuerdo en que un título universitario y las certificaciones online no son para nada necesarias. Eso está en línea con las experiencias de la mayoría de los que estamos aquí, en Ahrefs—una mayoría del equipo de marketing no tiene titulaciones en marketing.En lugar de eso, enfócate en cultivar la actitud correcta. Aquí tienes en lo que deberías tratar de ser bueno, según Saijo George:Capacidad de aprender y desaprender cosas rápidamente;Mente inquisitiva;Intentar y resolver un problema, pero si no puedes, deberías ser capaz de pedir ayuda;Estar dispuesto a compartir tu conocimiento y experiencia con el equipo en general;Por encima de todo, ser un jugador de equipo. Ninguna habilidad importa si no juegas en equipo, ya que la mayoría de las habilidades se pueden enseñar.Aunque sea creando tu propia web o con una beca o pasantía, con la actitud adecuada y algo de experiencia, tienes una buena oportunidad de conseguir un empleo como especialista SEO.Finalmente, me gustaría dar las gracias a estas personas por ayudar:Jason Acidre — Co-founder, Avaris;Viola Eva — Founder, Flow SEO;Suganthan Mohanadasan — Co-founder & Technical SEO Lead, Snippet DigitalIan Ong — Co-founder & CEO, Roots Digital MediaAleksandrs Buraks — Head of Growth, DiscoverCarsAmanda Thomas — Managing Partner, Konstruct DigitalLily Ray — Senior Director of SEO y Head of Organic Research, Amsive DigitalSaijo George — SEO Director, SuppleMichael King — Founder, iPullRankJason Mun — Chief Search Officer, Overdose DigitalCori Graft — Associate Director, SEO, Seer InteractiveFabrizio Ballarini — Organic Growth, WiseJason Hennessey — CEO, Hennessey DigitalJessica Levenson — Head of Digital Strategy & SEO, Oracle NetSuiteAundraya Ruse — VP, Client Strategy, Siege Media¿Alguna pregunta o comentario? Dímelo por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar la guía de WhatsApp Marketing más completa. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Roba Nuestra Plantilla de Descripción de Puesto de Especialista SEO"
    },
    {
      "level": "H2",
      "text": "Plantilla de descripción de puesto de Especialista SEO"
    },
    {
      "level": "H3",
      "text": "Responsabilidades"
    },
    {
      "level": "H3",
      "text": "Requisitos"
    },
    {
      "level": "H3",
      "text": "Deseable"
    },
    {
      "level": "H2",
      "text": "Cómo usar la plantilla"
    },
    {
      "level": "H3",
      "text": "1. Añade una breve descripción de tu empresa"
    },
    {
      "level": "H3",
      "text": "2. Ofrece instrucciones claras sobre cómo aplicar"
    },
    {
      "level": "H3",
      "text": "3. Ofrece a los mejores candidatos una razón para aplicar"
    },
    {
      "level": "H2",
      "text": "Cómo hemos creado la plantilla de descripción del puesto"
    },
    {
      "level": "H3",
      "text": "Responsabilidades"
    },
    {
      "level": "H3",
      "text": "Capacidades y requisitos"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}