{
  "url": "https://ahrefs.com/blog/es/seo-freelance/",
  "slug": "seo-freelance",
  "title": "Cómo Convertirte en Freelance SEO - Lecciones Aprendidas en +10 Años en la Industria",
  "description": "Si quieres convertirte en freelance SEO a tiempo completo o adquirir experiencia y dinero extra, esta guía es para ti.",
  "content": "Nick LeRoy Consultor SEO Freelance @ Nick LeRoy Consulting. Autor de la newsletter SEO semanal #SEOForLunch. Contenido Por abril de 2020, cuando el COVID-19 empezó a llevarse el empleo por delante, recibí el aviso de que mi trabajo se eliminaría en 30 días.Después de buscar un nuevo trabajo y asistir a seis rondas de entrevistas, finalmente me llegó la iluminación: ser freelance SEO a tiempo completo era una opción real para mí.Digo “a tiempo completo” porque he sido freelance a tiempo parcial desde 2010. En el gráfico de abajo, puedes ver que esto me ha ayudado a complementar mis ingresos, pero solo cuando empecé a ser freelance a tiempo completo mis ingresos se dispararon. Aunque prefiero no mostrar los números exactos, la cantidad está en el rango de las 5 cifras al mes. Durante los ocho meses de freelance a tiempo completo generé un 150% más que con mi anterior salario anual.Así que si quieres encontrar tu propio trabajo a tiempo completo o conseguir algo de experiencia adicional (y dinero), este artículo es para ti.¿Por qué considerar ser freelance?Empecé a hacer trabajos como freelance en 2010 para complementar los ingresos de mi empleo habitual de 9 a 5, pero hay otras muchas razones por las que que podrías querer establecerte por tu cuenta. Aquí van algunas de las más obvias:Más libertadAumento de ingresosMejor equilibrio profesional/personalExperiencia en industrias y/o plataformas con las que puede que no hayas trabajado antesPersonalmente he experimentado todos estos beneficios, pero la mejora en el equilibrio profesional/personal quizá haya sido lo más positivo para mí. Te darás cuenta debajo de que mis horas totales desde que pasé a ser freelance a tiempo completo han disminuido. Eso es porque todas mis horas como freelance son facturables y no se desperdician en reunión tras reunión como en mi antiguo trabajo “de 9 a 5”.Más allá de las razones obvias de arriba, aquí van otras pocas razones para pasar a ser freelance de las que rara vez se habla.Bajas barreras de entradaNo más de 9 a 5Crecimiento de carrera infinitoControl completo1. Bajas barreras de entradaAl contrario que muchas otras aventuras emprendedoras, ser freelance SEO no tiene que ser extremadamente caro. Los rendimientos del trabajo llegan lejos en la industria SEO. De hecho, la lista de abajo supone el 90% de las herramientas que uso en mis servicios como freelance. Herramientasdeanálisis de palabras clave(keyword research) y análisis de enlaces - 99$ al mes (mira la versión de prueba de 7 días de Ahrefs). Herramienta de rastreo web/diagnóstico – Uso ScreamingFrog (193$ al año) — pero podrías usar el Site Audit de Ahrefs para ahorrarte este costo. Software de contabilidad para realizar seguimiento de ingresos, gastos, facturación, etc. - Uso QuickBooks por 50$ al mes. Software de propuestas – Uso Prospero por 8$ al mes. Software de seguimiento de tiempo - Uso Harvest por 12$ al mes. Google Analytics & Google Search Console - Gratis.Por menos de 200$ al mes, puedes establecerte con las herramientas que necesitas para pulverizar los resultados de búsqueda. Lo mejor es que no necesitas invertir este dinero hasta que ya tienes ingresos entrando por la puerta.2. No más de 9 a 5Cuando pasé a ser freelance a tiempo completo, luchaba contra la idea de no trabajar de 9 a 5. A pesar de haber terminado mi trabajo, sentía que estaba haciendo algo mal por no estar sentado en mi escritorio. Este era un hábito que trabajar más de 10 horas para otra persona me había inculcado.Si has hecho tu trabajo y estás disponible para tus clientes durante horas laborales, no importa si estás sentado en tu escritorio o juegas al golf a cualquier hora del día.3. Crecimiento de carrera infinitoNunca olvidaré las conversaciones que tenía con distintos líderes sobre promociones y aumentos. Siempre parecía que tenías que hacer más, generar más facturación, formar a más empleados junior. Solo entonces (si estaban de acuerdo) te recompensarían con una promoción y/o un aumento4. Control completo¿Cuántas veces has trabajado en un proyecto con el que no estabas de acuerdo? ¿Has sacrificado alguna vez tu ética porque tu jefe/empresa te lo decía? Recuperas todo esto cuando eres freelance a tiempo completo. No me entiendas mal, ser freelance a tiempo completo no es todo rayos de sol y arcoiris, pero tienes el control. Decides con quién trabajarás, por cuánto y qué nivel de trabajo te comprometes a ejecutar. Esto, para mí, era una necesidad crítica tras demasiados años de trabajar para otras personas.Cómo convertirte en freelance SEOSer freelance SEO es fácil a primera vista. Aprendes SEO, encuentras clientes y les cobras dinero por tus servicios. Pero como pasa con todo en la vida, es la ejecución lo que importa—y no es siempre algo tan directo. Debajo compartiré ocho lecciones que he aprendido en más de 10 años en la industria para ayudar a que tu negocio freelance empiece con buen pie.Construye tu redPon orden en tu contabilidadConfía en tus preciosLa comunicación efectiva es claveCrea tu propia webCrea activos para apoyar tus proyectosConsigue que te encuentren onlineConoce tu papelLección #1. Construye tu redCuando pasé a ser freelance a tiempo completo, lo primero que hice fue crear una hoja de cálculo con todos mis contactos en el sector. Después identifiqué a diez personas de esta lista a las que podía llamar para un favor u ofrecer directamente mis servicios. Envié diez emails explicando mi negocio recién creado. Esto llevó a muchas llamadas y cadenas de email adicionales. Algunas de estas personas tenían trabajo para mí, otras no, pero todas tuvieron consejos que eran tanto alentadores como aterradores, pero igual de valiosos.Hoy mucho de mi trabajo sigue llegando por referencias de clientes y personas en mi red. Te sorprendería saber cuántas agencias necesitan ayuda con sus excesos de trabajo. Así que aunque no te sugiero que vayas a cualquier evento de networking disponible, sí te recomiendo encarecidamente que empieces a conocer gente en tu sector y empieces a construir relaciones. No solo porque pueda llevar a algún negocio en el futuro, pero nunca sabes cuando puedes contactarlos para que te ayuden.Lectura Recomendada: 11 Comunidades en Slack para SEOs y especialistas en Marketing Digital (en inglés)Lección #2. Pon orden en tu contabilidadComo novato freelance me aterrorizaba que no iba a poder permitirme un contable. Empecé a estresarme por llevar el control de mis gastos y retener la cantidad adecuada de impuestos. Finalmente contacté a un contable que alguien me recomendó. Lo primero que me hizo hacer fue re-clasificarme como una S-Corp (algo parecido a una sociedad limitada para pequeñas empresas). El ahorro de impuestos que eso supuso pagó fácilmente por sus servicios. Si estás pensando en ser freelance a tiempo completo (o incluso a tiempo parcial), consigue un buen contable.Lección #3. Confía en tus preciosAl principio, cogía trabajos por la mitad de mi tarifa normal. Acabó por costarme dinero a medida que tenía que rechazar trabajos a precio completo al estar más ocupado. Aunque de forma natural ajustarástus tarifas al alza (si es un proyecto por el que no estás muy interesado) o a la baja (si es algo que de verdad despierta tu interés), te recomiendo encarecidamente que no cojas ningún trabajo por una tarifa de la que te arrepentirás en el futuro.¿No estás seguro de cuál debería ser tu tarifa? En 2018, Ahrefs encuestó a la industria SEO y descubrió que la tarifa por hora más habitual era de entre 100 y 150$ por hora. Si estás considerando poner precio a tus servicios por proyecto o en base a un pago mensual, echa un vistazo al estudio completo de precios SEO de abajo.¿Cuánto Cobran los SEOs Por Hora?Tarifa por horas% de respuestasLectura Recomendada: Precios SEO: ¿Cuánto Cuesta? [investigación sectorial] (en inglés)Lección #4. La comunicación efectiva es claveMe gusta considerar mis “habilidades con las personas” como una de mis fortalezas. Sin embargo, lo estropeécuando pasé a tiempo completo y me costó un proyecto de 10.000$. Tenía un cliente que había leído mi artículo sobre la importancia de las migraciones web y que me contactó para una consulta. Verbalmente se comprometió a trabajar conmigo en su proyecto inminente, entendiendo completamente que no era la opción más barata, pero que era algo que quería bien hecho. También me mencionó que estaba hablando con una empresa SEO extranjera para consultas recurrentes. Le compartí sin rodeos algunas de mis preocupaciones con su forma de hacer las cosas y el presupuesto que buscaba invertir al mes. Le ofendí. ¿Adivinas qué? Nunca me volvió a llamar para la migración de su web. Aunque no me arrepiento de ser transparente, podría haber tomado una aproximación distinta y haber conseguido el proyecto. Lección aprendida.Lectura Recomendada: La Comunicación Efectiva es una habilidad SEO infravalorada (en inglés)Lección #5. Crea tu propia webRecomiendo encarecidamente construir una web para tu marca. Como Tom Hirst tuiteó, tu web personal es tu currículum de 2020 en adelante. Si no tienes una web, ¿cómo puede la gente aprender más de ti, ver el tipo de servicios que ofreces o incluso ejemplos del éxito que has logrado?Your personal website is your 2020 resume.— Tom Hirst (@tom_hirst) September 1, 2020 Tu web personal es tu currículum de 2020.Sé creativo con tu web. Aunque siempre deberías trabajar para hacerla mejor, no permitas que eso evite que la hagas. Crea algo hoy.Lectura Recomendada: Auditando tu Sitio Web para SEO y UX.Lección #6. Crea activos para apoyar tus proyectosAllá por 2016 empecé a escribir la newsletter SEO semanal#SEOForLunch. Siempre fue mi intención devolver algo a la comunidad que tanto me había dado. Sin embargo, en el fondo, también sabía que era mi póliza de seguros. No me sentía lleno con el trabajo de mi antigua agencia y anhelaba la capacidad de establecerme por mi cuenta. Sabía que si construía una lista de email algún día podría apoyarme en ella cuando decidiera ser freelance a tiempo completo—y esto es exactamente lo que hice este año. Algunos de mis mejores proyectos han llegado de lectores valiosos que han sido suscriptores durante años.Lectura Recomendada: 7 Estrategias de Marketing que Realmente FuncionanLección #7. Consigue que te encuentren onlineNo necesitas una web con un Rating de Dominio (DR, o Domain Rating) elevado o una newsletter con miles de suscriptores para trabajar como un freelance SEO. Sin embargo, necesitas que se te pueda encontrar online. Tu oferta de servicios es conseguir que encuentren a tus clientes online, y si ELLOS no pueden encontrarte a TI online, puede ser una batalla cuesta arriba para cerrar ventas.Te puedes preguntar a ti mismo: “¿dónde/cómo empiezo?”. Mi respuesta a esa pregunta es que publiques en otras webs. De forma similar a cómo Ahrefs me da la oportunidad de escribir este post, puedes contactar con docenas de webs sobre SEO/digitales para contribuir con tu conocimiento.No es el momento de ponerse spamero. Buscas ofrecer valor real y asociar tu conocimiento a tu nombre. ¿Recuerdas el lead de la migración de sitio que perdí del que te hablaba antes? Llegó de un post publicado en Search Engine Land con una audiencia masiva. Simplemente le envié al equipo editorial un email con la idea de lo que quería escribir. Tras unos pocos borradores, me habían publicado. No te lo pienses demasiado. Haz fácil que otras personas te puedan ayudar ofreciéndoles un contenido maravilloso. Es una situación win-win.Lectura Recomendada: Guest Blogging para SEO.Lección #8. Conoce tu papelAl contrario que en tu trabajo de 9 a 5, ser freelance a tiempo completo requerirá que lleves varios sombreros: Gestor de Proyecto, Trabajador y Emprendedor. Ya estabas habituado al rol de “trabajador” en tu trabajo de 9 a 5, pero ¿también has sido gestor de proyectos y emprendedor? Cierto es que ser freelance a tiempo parcial durante diez años me dio una gran ventaja inicial. Ya estaba al tanto de la necesidad de ser el vendedor, el contable y el gestor del proyecto. Ciertamente, no soy la persona más organizada y ahí es dónde redoblo mis esfuerzos. Si quieres tener éxito como freelance a tiempo parcial o completo, debes saber lo que está en tu plato, establecer plazos y cumplirlos. Sin excepción.Reflexiones finalesSi estás buscando añadir experiencia a tu portfolio o algún dinero extra a tu bolsillo, ser freelance es algo que recomiendo probar a todo el mundo. Siempre que des un buen servicio, te comuniques con efectividad y cumplas los plazos, estoy seguro de que tendrás mucho éxito.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar el primer directorio de herramientas de WhatsApp Marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo Convertirte en Freelance SEO - Lecciones Aprendidas en +10 Años en la Industria"
    },
    {
      "level": "H2",
      "text": "¿Por qué considerar ser freelance?"
    },
    {
      "level": "H3",
      "text": "1. Bajas barreras de entrada"
    },
    {
      "level": "H3",
      "text": "2. No más de 9 a 5"
    },
    {
      "level": "H3",
      "text": "3. Crecimiento de carrera infinito"
    },
    {
      "level": "H3",
      "text": "4. Control completo"
    },
    {
      "level": "H2",
      "text": "Cómo convertirte en freelance SEO"
    },
    {
      "level": "H3",
      "text": "Lección #1. Construye tu red"
    },
    {
      "level": "H3",
      "text": "Lección #2. Pon orden en tu contabilidad"
    },
    {
      "level": "H3",
      "text": "Lección #3. Confía en tus precios"
    },
    {
      "level": "H3",
      "text": "Lección #4. La comunicación efectiva es clave"
    },
    {
      "level": "H3",
      "text": "Lección #5. Crea tu propia web"
    },
    {
      "level": "H3",
      "text": "Lección #6. Crea activos para apoyar tus proyectos"
    },
    {
      "level": "H3",
      "text": "Lección #7. Consigue que te encuentren online"
    },
    {
      "level": "H3",
      "text": "Lección #8. Conoce tu papel"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Nick LeRoy"
}