{
  "url": "https://ahrefs.com/blog/es/seo-internacional/",
  "slug": "seo-internacional",
  "title": "Cómo implementar una estrategia SEO internacional (paso a paso)",
  "description": "El SEO internacional consiste en optimizar tu sitio web para los usuarios de distintos países o idiomas. Aprende cómo hacerlo en siete pasos.",
  "content": "Jamie Grant Jamie es un Estratega de SEO en Kaizen, una agencia de crecimiento digital con sede en Londres. Cuando se toma un descanso de las etiquetas canónicas y hreflang, es probable que esté obsesionado con el último partido de fútbol o el Gran Premio de Fórmula 1. Contenido El SEO internacional es el proceso de optimizar tu web para usuarios de varios países o idiomas. Es clave si quieres llegar a una audiencia internacional con búsqueda orgánica.Pero crear una estrategia SEO internacional puede ser algo abrumador, incluso para SEOs profesionales.En esta guía dividiré el proceso y lo recorreremos paso a paso.ContenidoPaso 1. Conoce tus mercadosLa mayoría sabéis cuáles son vuestros mercados objetivo. A menudo esto se determina por factores no SEO, como la capacidad de operar en mercados específicos.A pesar de esto, merece la pena entender qué mercados son los que tienen un mayor potencial para tu negocio. Tu empresa puede:Decidir trabajar en ese mercado en el futuro.Perderse un mercado con una gran demanda de búsqueda.Perderse un mercado con baja competencia de búsqueda.Puedes hacerte una idea general de los mercados con potencial de búsqueda introduciendo competidores en el Site Explorer de Ahrefs. Simplemente revisa el gráfico que muestra la cuota por país.Por supuesto, necesitarás profundizar más. Pero abordaremos eso en el capítulo sobre keyword research. Por ahora, esto debería darte una buena idea de mercados potenciales.Paso 2. Comprende los requisitos técnicosAntes de dejarte llevar por una keyword research detallada, necesitas planificar tu aproximación técnica. Asegurarte de que tienes los fundamentos técnicos adecuados es vital en toda estrategia SEO internacional.Cada mercado necesita URLs dedicadasPara segmentar varios mercados de forma efectiva, cada landing page requiere una versión separada del contenido en una URL dedicada por idioma. Tener versiones específicas por países de la página también es algo recomendado cuando existe un foco muy específico. Traducir texto de forma dinámica en la misma URL no es una opción. Google recomienda el uso de URLs dedicadas, ya que eso permite a sus arañas descubrir, leer e indexar de forma eficiente todas las versiones de tu contenido.Decidiendo la estructura de las URLsHay varias elecciones a tener en cuenta a la hora de decidir la estructura de la URL. Todas las opciones viables tienen sus pros y contras.Dominio de nivel superior geográfico (ccTLD, country code top-level domain en inglés)Esta opción es muy conocida, sobre todo porque los usuarios están ya familiarizados con el dominio de nivel superior de su país. Esto contribuye a la sensación de estar en el lugar adecuado cuando llegas a la página.Por otro lado, tendrás que considerar el coste de adquirir varios dominios. En la opinión de muchos SEOs, también vas a diluir tu PageRank al dividir el contenido por varios dominios. Necesitarás construir tu autoridad SEO en varios dominios, en lugar de un único dominio, más fuerte.ProsEl país objetivo queda claro para los usuarios.Posibilidad de usar hosting localizados para mejorar los tiempos de carga.ContrasNormalmente es más costoso, ya que necesitarás comprar varios dominios.Mantener varios dominios puede ser un reto técnico.La URL no especifica el idioma (por ejemplo, .es podría ser para hablantes de castellano o catalán).SubdirectoriosLos subdirectorios no son solo muy populares entre los SEOs, también lo son para los webmasters. La razón es que todo el contenido se encuentra en un único dominio.También es mucho más fácil crear una nueva versión de una página simplemente cambiando la ruta de la URL (o el slug), frente a desplegar una nueva página en un hosting con una configuración completamente diferente. Los informes son más fáciles también, ya que solo tienes que instalar tu etiqueta de la herramienta de analítica en un único dominio.ProsRelativamente fácil de configurar.Nombres personalizables (por ejemplo, ejemplo.com/mexico).Es más fácil hacer seguimiento e informes.ContrasLos usuarios puede que no estén tan familiarizados con la estructura de URL.SubdominiosLos subdominios son menos populares pero tienen algunos beneficios propios. La posibilidad de usar nombres personalizables es algo destacable. No es algo que se pueda conseguir con los ccTLDs.Los contras, sin embargo, están bastante alineados con los de los ccTLD. A pesar de que los subdominios son una extensión de tu dominio principal, al principio Google tendrá que aprender a rastrearlos por separado.ProsPosibilidad de usar un hosting localizado.Nombres personalizables (por ejemplo, chile.ejemplo.com).ContrasMantener varios dominios puede ser un reto a nivel técnico.Los usuarios pueden no estar familiarizados con la estructura de URL.URL parametrizadaEsta opción debería evitarse a toda costa. Las URLs parametrizadas no son amigables de cara al usuario y también pueden confundir a los bots.Esta opción no está recomendada por Google para la internacionalización.Por estas razones, vamos a sacar la opción de URL parametrizada de la ecuación. El Veredicto de JamieEn mi opinión, los contras de la opción del subdominio sobrepasan a sus ventajas. Así que para mí, se trata de elegir directamente entre ccTLDs y subdirectorios. Si empiezas de cero, personalmente prefiero la opción de los subdirectorios. Para mí, los beneficios de alojar todo el contenido bajo el mismo dominio no es algo que se pueda pasar por alto. Dicho esto, está bien elegir otra ruta, como muchos SEOs hacen. No serás penalizado, ya que cualquiera de las tres opciones están soportadas por Google. Considera crear varios idiomas por paísSi trabajas con países donde la primera lengua puede ser una entre varias, puede que tengas que considerar ofrecer contenido en varios idiomas por país.Por ejemplo, supongamos que quieres dar servicio a todos los clientes potenciales de España. Necesitarás dirigirte tanto a usuarios que hablen en castellano como en catalán, euskera o gallego. Por tanto, necesitarás contar con versiones para estos idiomas. ¿Puedo crear solo versiones específicas por idioma? Está perfectamente dentro de las guías de Google el segmentar a los usuarios por idioma. En algunos tipos de contenido, puede funcionarte bien esta forma de hacer las cosas. Yo recomiendo que busques tus palabras clave principales para ver cómo resuelven esto las páginas mejor posicionadas.Adoptar un enfoque basado en el idioma puede ser el punto de partida perfecto para tu empresa, sobre todo si tienes pocos recursos. Trabajarás con menos páginas, lo que también supone menos probabilidades de que algo se estropee.Dicho esto, la mayoría de negocios tienen países específicos en mente. Desplegar contenido específico para el país es el enfoque óptimo. Esto te permite enfocar tu contenido en torno al país al que te quieres dirigir.Para empezar, querrás ofrecer tus productos o servicios en la moneda correcta. Más aún, puedes ajustar la terminología que uses, ya que esta varía entre países (incluso aunque el idioma sea el mismo).Estos matices no solo afectan a los usuarios, sino que es algo que Google también podría escoger. Después de todo, es responsabilidad de Google ofrecer el resultado más relevante a cada usuario.Instala una CDN (Content Delivery Network, red de distribución de contenidos)Ya que das servicio a tus usuarios en varios países, nunca ha habido un mejor momento para implementar una CDN. En la era de Core Web Vitals como factor de posicionamiento, que los usuarios tengan una experiencia lenta al cargar tu sitio desde otros países puede impactar en tu posicionamiento.Las CDN utilizan un grupo de servidores distribuidos, asegurándose de que tus usuarios carguen la página de un servidor localizado, en contraste con un servidor único y centralizado. Esto ayuda a mantener bajos tiempos de carga, lo que redunda en una experiencia de usuario más satisfactoria.Paso 3. Haz keyword research en los mercados elegidosAhora que ya hemos planificado las bases técnicas, el próximo paso es hacer keyword research en cada uno de los mercados elegidos. Esto es recomendable, incluso aunque solo vayas a desplegar tu estrategia internacional en un único idioma.Anteriormente mencioné que la terminología entre países, incluso aunque tengan el mismo idioma. Esto, a cambio, tendrá un impacto en las palabras clave que tus clientes potenciales estén buscando.Los volúmenes de búsqueda también serán distintos en cada país, ya que tanto la población como la demanda de búsqueda cambiarán. Esto es algo que necesitamos tener en cuenta al hacer proyecciones basadas en datos de palabras clave.Por ejemplo, usando Keywords Explorer de Ahrefs podemos ver que España es el país que tiene el mayor volumen de búsqueda en la palabra clave “seguro hogar”, con 6.700 búsquedas al mes. Estas palabras clave también tendrán impacto en la optimización on-page, de la que hablaré en el paso 4.¿Qué pasa si necesito hacer keyword research en un idioma extranjero?Habiendo trabajado en el lado de la agencia en SEO durante varios años, a menudo me he encontrado en esa situación. Trabajar con especialistas SEO nativos siempre es lo que ofrece un mejor resultado final. Si necesitas incorporar especialistas nativos, te recomiendo encarecidamente apoyarte en tu red y buscar en LinkedIn para encontrar al especialista más adecuado para tu caso.A menudo esto termina por ser también la solución más económica. Contar con especialistas nativos te ahorrará el pasar mucho tiempo tratando de averiguar que significan esas palabras clave en tu lista.¿Qué tal funciona usar herramientas de traducción automática?Evitaría traducir de forma directa palabras clave de tu lengua nativa a una extranjera. En muchas ocasiones, las herramientas de traducción no tienen en cuenta los matices. Esto te dejará con una lista de palabras clave que puede que tus clientes ni siquiera estén buscando (o que puede que ni siquiera tengan sentido). ¿No tienes presupuesto para contratar a un SEO local?Si no tienes el presupuesto para contratar a un especialista local que se encargue de hacer keyword research, las herramientas de traducción te vendrán bien. Como ya mencioné anteriormente, no siempre son precisas. Así que, en este caso, deberías usarlas como una guía para empezar.Aquí va un ejemplo. Vamos a suponer que mi empresa es un banco que ofrece cuentas bancarias para el consumidor final en España y está considerando ofrecer el servicio a clientes en países de habla inglesa.Uso Google Translate para traducir mis palabras clave principales en español a inglés y las pego en Keywords Explorer de Ahrefs En Reino Unido los resultados no parecen muy prometedores:En Estados Unidos sí parecen algo mejores:Sin embargo, si investigamos un poco, podemos ver que “payroll account”, a pesar de ser la traducción literal de “cuenta nómina” que nos ofrece Google Translate es un término que se usa de forma distinta. En el contexto de Estados Unidos o Reino Unido, la payroll account es una cuenta para que las empresas paguen las nóminas a sus empleados, en España la “cuenta nómina” es un tipo de cuenta para cobrar la nómina que abren las personas físicas, por lo que tiene un mayor volumen de búsquedas.Recuerda: ten cuidado cuando uses herramientas de traducción automáticas. En este caso podríamos haber cometido un error, pero las consecuencias pueden ser incluso peores.Siguiendo con el ejemplo del banco, suponiendo que queramos buscar un producto similar a la “cuenta nómina” (es decir, una cuenta para los gastos del día a día y donde cobrar el salario) podríamos introducir en Site Explorer la web de un competidor conocido, como, por ejemplo Bank of America, uno de los principales bancos de Estados Unidos para ver por qué palabras clave se posiciona.Como son demasiadas (más de 717.000) vamos a necesitar acotar los resultados, así que podemos aplicar una regla para incluir solo los resultados que incluyan la palabra “account” (cuenta en inglés), lo que reduce el número de palabras clave a solo +31.000:Si lo organizamos por volumen, podemos ver cómo hay términos mucho más populares para referirse a cuentas bancarias:Haciendo scroll podemos ver palabras clave como “checking account” o “savings account”, que son más parecidas a nivel conceptual a la cuenta nómina de España.Podríamos profundizar en esta análisis revisando las páginas mejor posicionadas para cualquiera de esas palabras clave, como, por ejemplo, checking account:Paso 4. Localiza el texto y optimiza todas las landing pagesInvolucrar a un experto nativo es algo obligatorio en este punto. Puedes salirte con la tuya ahorrando algo al hacer la investigación de palabras clave por tu cuenta. Pero en lo que respecta a crear contenido, no hay trucos bajo la manga.No solo es importante para la experiencia de usuario, también para Google. La labor de Google es ofrecer a los usuarios las páginas que presenten una mejor experiencia. Por tanto, Google preferirá ofrecer el contenido que sea relevante tanto para el país como el idioma del usuario.Todo lo que puede localizarse debería localizarse. Además del texto de la página y los metadatos, esto puede incluir:MonedasZonas horariasNúmeros de teléfono (cuando sea posible)Dirección de la oficina (cuando sea posible)Paso 5. Crea tus enlaces internos de la forma correcta Uno de los errores más fáciles de cometer al desplegar contenido internacional es poner los enlaces internos a la versión incorrecta. Esto no solo puede llevar a los usuarios a la página equivocada, también puede enviar señales conflictivas a Google.¿Qué pasa si solo tengo un número limitado de páginas para enlazar en un mercado concreto?Si estás haciendo esta pregunta, puede que sea demasiado pronto para lanzar en este mercado. Lanzar una nueva marca en un mercado con solo unas pocas páginas limitará tu potencial de conseguir resultados.Lanzar con un rango más amplio de contenido ayudará a que Google asocie tu sitio web y marca con el mercado en el que intentas lanzar. Como regla general, recomendaría que te asegures de que tienes suficiente contenido al que enlazar en tu menú superior y menú de pie de página cuando lances.Incluye un menú de navegación para cambiar entre las versiones de cada mercadoIncluso con las mejores opciones de segmentación geográfica en funcionamiento, puede darse el caso raro de que un usuario termine en la versión equivocada. Ofrecer un menú de navegación dedicado para cambiar a la versión correcta podría marcar la diferencia entre perder y ganar un cliente potencial.Por ejemplo, en el menú del encabezado de la web de Ahrefs puedes cambiar fácilmente de idioma.Paso 6. Ayuda a Google a ofrecer la versión correctaIncluso con las señales on-page que Google recoge en tu contenido, puede resultar confuso para Google entender qué páginas ofrecer en un mercado específico.Implementar hreflang es esencialHreflang es un código que normalmente se encuentra en el backend de una página (o, a veces, en sitemaps). Esencialmente es un proceso de mapeado, que ofrece a Google una lista de las URLs alternativas de una página concreta.Esto ayuda a que Google entienda:A qué mercado se dirige la página actual.Opciones alternativas para los usuarios en otros mercados.Una versión que ofrecer por defecto a los usuarios que busquen en mercados sin página dedicada (opcional).Implementar hreflang no solo mejorará la experiencia de usuario, también permitirá que tu posicionamiento se beneficie de duplicados cercanos (en concreto, las versiones que usan el mismo idioma).Aunque no se pasa PageRank a través de hreflang, Google usará la versión con más autoridad en el idioma buscado para determinar la posición en el ranking. Cuando un usuario realiza la búsqueda, Google servirá la versión más relevante para ese usuario.No hay duda de que hreflang puede convertirse rápidamente en una de las áreas más complejas del SEO. No temas, nuestro Joshua Hardwick ha creado una guía dedicada a hreflang para principiantes.Site Audit de Ahrefs es el sitio perfecto para revisar tu implementación de hreflang. En primer lugar, necesitarás realizar una auditoría de tu web.Una vez que tu auditoría esté completa, ve al informe de Localization (localización) para encontrar errores.Evita la redirección geográficaRedirigir a los usuarios en base a sus direcciones IP o por cookies debería evitarse por completo. Esto no solo frustrará a los usuarios, también confundirá a los bots.Google rastreará el contenido sobre todo desde una dirección IP de Estados Unidos. Por tanto, puede que saques a Google de todo contenido que no esté dirigido a Estados Unidos. Tampoco es buena idea hacer una excepción dejando pasar al agente de Googlebot. Es importante asegurarse de que Googlebot tenga exactamente la misma experiencia que tus usuarios.No me hagas caso a mí. Google también aconseja lo mismo:Evita redirigir automáticamente a los usuarios en función del idioma detectado, porque es posible que así impidas que los usuarios y los buscadores vean todas las versiones de tu sitio.La documentación profundiza en esto diciendo:No analices las IPs de los visitantes para adaptar tu contenido. Inferir la ubicación a través de las direcciones IP es difícil y, por lo general, poco preciso. Además, es posible que no podamos rastrear algunas versiones de tu sitio de manera adecuada. La mayoría de los rastreos de Google se hacen desde Estados Unidos y, cuando se llevan a cabo, no se prueban otras ubicaciones para detectar variaciones en el sitio. Utiliza uno de los métodos explícitos que se indican en este artículo, como hreflang, URLs alternativas o enlaces explícitos.Como alternativa a la redirección por IPs, puedes pedir al usuario que parezca estar en la ubicación equivocada que revise su versión de la página en la navegación. Así puedes ver cómo Apple ha implementado esta petición:Paso 7. Consigue enlaces en cada uno de tus mercados objetivo Independientemente de que tengas una presencia fuerte en tu mercado nativo, necesitarás conseguir autoridad en los nuevos mercados donde quieras desarrollarte.Un enlace de un sitio con alta autoridad en Estados Unidos puede que no tenga el mismo peso en México, por ejemplo.A menudo, este paso se pasa por alto. A pesar de aparecer en último lugar en esta guía, no debería dejarse de lado.Es bastante habitual que los responsables web sigan todos los pasos anteriores correctamente, para pasar por alto este último punto y acabar con un tráfico que se correlacione con su falta de enlaces localizados.Así que no te olvides de conseguir enlaces y construir tu presencia digital dentro de todos los mercados objetivo, no solo en tu mercado nativo.Puntos claveUsa la estructura de URL que mejor se ajuste a tus necesidades (evita parámetros en la URL a toda costa).Localiza tu estrategia tanto como puedas, desde la investigación de palabras clave a la optimización de contenidos.Utiliza hreflang para enviar señales claras a Google.La velocidad de la página importa para los usuarios de todos los países; instalar una CDN es clave.Consigue enlaces en todos los mercados para construir un buen perfil de enlaces y autoridad.¿Alguna pregunta? ¿Qué estructura de URL prefieres? Escríbenos por Twitter y cuéntanoslo. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo implementar una estrategia SEO internacional (guía paso a paso)"
    },
    {
      "level": "H2",
      "text": "Paso 1. Conoce tus mercados"
    },
    {
      "level": "H2",
      "text": "Paso 2. Comprende los requisitos técnicos"
    },
    {
      "level": "H3",
      "text": "Cada mercado necesita URLs dedicadas"
    },
    {
      "level": "H3",
      "text": "Decidiendo la estructura de las URLs"
    },
    {
      "level": "H4",
      "text": "Dominio de nivel superior geográfico (ccTLD, country code top-level domain en inglés)"
    },
    {
      "level": "H4",
      "text": "Subdirectorios"
    },
    {
      "level": "H4",
      "text": "Subdominios"
    },
    {
      "level": "H4",
      "text": "URL parametrizada"
    },
    {
      "level": "H3",
      "text": "Considera crear varios idiomas por país"
    },
    {
      "level": "H3",
      "text": "¿Puedo crear solo versiones específicas por idioma?"
    },
    {
      "level": "H3",
      "text": "Instala una CDN (Content Delivery Network, red de distribución de contenidos)"
    },
    {
      "level": "H2",
      "text": "Paso 3. Haz keyword research en los mercados elegidos"
    },
    {
      "level": "H3",
      "text": "¿Qué pasa si necesito hacer keyword research en un idioma extranjero?"
    },
    {
      "level": "H3",
      "text": "¿Qué tal funciona usar herramientas de traducción automática?"
    },
    {
      "level": "H3",
      "text": "¿No tienes presupuesto para contratar a un SEO local?"
    },
    {
      "level": "H2",
      "text": "Paso 4. Localiza el texto y optimiza todas las landing pages"
    },
    {
      "level": "H2",
      "text": "Paso 5. Crea tus enlaces internos de la forma correcta"
    },
    {
      "level": "H3",
      "text": "¿Qué pasa si solo tengo un número limitado de páginas para enlazar en un mercado concreto?"
    },
    {
      "level": "H3",
      "text": "Incluye un menú de navegación para cambiar entre las versiones de cada mercado"
    },
    {
      "level": "H2",
      "text": "Paso 6. Ayuda a Google a ofrecer la versión correcta"
    },
    {
      "level": "H3",
      "text": "Implementar hreflang es esencial"
    },
    {
      "level": "H3",
      "text": "Evita la redirección geográfica"
    },
    {
      "level": "H2",
      "text": "Paso 7. Consigue enlaces en cada uno de tus mercados objetivo"
    },
    {
      "level": "H2",
      "text": "Puntos clave"
    }
  ],
  "author": "Jamie Grant"
}