{
  "url": "https://ahrefs.com/blog/es/seo-para-abogados/",
  "slug": "seo-para-abogados",
  "title": "SEO para abogados y asesorías legales: la guía completa",
  "description": "Una guía para posicionar en el Map Pack de Google y en resultados orgánicos, adaptada para abogados, bufetes y asesorías legales.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido ¿Qué haces hoy en día cuando tienes una pregunta? Se la haces a Google. Y, ¿qué haces cuando buscas un servicio local? También le preguntas a Google. Por eso, abogados y profesionales del mundo legal están usando Google para conseguir más clientes. Y con esta guía de cuatro pasos, tú también podrás hacerlo.ContenidoPero antes, respondamos una pregunta importante…¿Por qué el SEO es importante para los abogados?El SEO (optimización para motores de búsqueda, o search engine optimization en inglés) es la práctica de incrementar el tráfico de un sitio web a partir de resultados de búsqueda orgánica.El resultado final del SEO es más visibilidad para tu web en las páginas de resultados de los motores de búsqueda (SERPs), para que más gente pueda contactar con tu empresa. Así es, en pocas palabras, cómo los usuarios pueden convertirse en visitas y las visitas en clientes.Más aún, algo genial del tráfico orgánico es que es continuo, mientras sigas posicionando, no tienes que pagar por cada clic conseguido (al contrario que con la publicidad digital).Hablando de publicidad, las palabras clave relacionadas con el derecho pueden ser bastante caras en el nicho legal. El SEO te permite aprovecharte de su popularidad sin presupuesto publicitario.Así que, básicamente, la razón por la que las firmas legales, como bufetes, asesorías legales o abogados, necesitan el SEO es la misma por la que necesitan una web: porque la gente busca servicios legales online. Cuando tu empresa no aparece en Google, simplemente te estás dejando dinero sobre la mesa.Otra forma en la que los abogados pueden beneficiarse del SEO es ganándose la confianza de clientes potenciales con contenido útil. Cuando alguien busca soluciones a sus problemas puede que encuentren tu contenido en Google y vean que sabes de lo que hablas.Así que sin más preámbulos vamos a ver cómo los abogados pueden sacar el máximo partido al SEO.1. Optimiza para el Map Pack de GoogleEl Map Pack de Google (también llamado Google Local Pack y Google Snack Pack) es lo que se conoce como un resultado enriquecido que Google muestra a los usuarios para ayudarlos a encontrar el mejor resultado en base a la ubicación, entre otros factores.En la mayoría de casos, las búsquedas que tus clientes potenciales hagan para encontrar empresas como la tuya activarán el pack de mapas porque Google “cree” que la gente quiere encontrar algo relacionado con una ubicación. Como ves, el pack de mapas de Google se muestra por encima de los resultados orgánicos. Y, a excepción de los anuncios, es lo primero que los usuarios ven. Así que el que tu nombre salga ahí incrementa mucho las posibilidades de que te conozcan.Nada ni nadie puede garantizar que tengas un sitio en el map pack. Porque tus competidores harán cosas parecidas para salir ahí. Además, nadie excepto el propio Google sabe cómo funciona exactamente el posicionamiento local. Lo que sabemos son los tres principios que Google usa de forma fluida para elegir lo que aparece en el pack local:Relevancia: lo bien que un perfil de empresa se alinea con el significado de la búsqueda.Distancia: la distancia entre el resultado de búsqueda y la ubicación del usuario o la ubicación especificada en la búsqueda (por ejemplo, “abogado madrid”).Importancia: esto cuenta en varios aspectos, como popularidad en el mundo “offline”, reviews online y rankings, enlaces a la web y, bastante interesante, posicionamiento en los resultados de búsqueda orgánicos.En base a las guías de Google y los factores de posicionamiento locales que se conocen, aquí van tres cosas que deberías hacer para mejorar tus posibilidades de aparecer en el map pack de Google. Crea y optimiza un Perfil de Empresa de GoogleEl map pack de Google se compone de Perfiles de Empresa de Google, así que es crucial que listes todas las ubicaciones de tu empresa dentro de este servicio (pero no uses oficinas virtuales).Lo que es más, con este perfil, tu empresa será elegible para aparecer en Google Maps. Y Google será capaz de mostrar un panel de conocimiento local para búsquedas, incluyendo el nombre de tu empresa.Si estás empezando, tendrás que crear tu perfil de empresa. Si el negocio ya existe o alguien más lo ha reclamado, puede que necesites reclamar tu perfil.Recuerda, cuanto más específica sea la información y más relevantes las fotos que compartas, mejor. Y, si tienes dudas, revisa las guías de Google. Porque una violación de las mismas puede conllevar la suspensión del perfil.Nota al margen.Algunas guías SEO afirman que la información que se muestra en estos resultados enriquecidos proviene de un marcado schema. No es así exactamente. En primer lugar y, principalmente, provienen de los perfiles de empresa. Así que aunque no haga daño aplicar un marcado schema a tu sitio web, deberías enfocarte en optimizar tu Perfil de Empresa de Google.Consigue que te mencionen en listados y directorios localesLas menciones locales y los directorios son menciones online de tu negocio que muestran el nombre de tu empresa, la dirección, teléfono y, en la mayoría de casos, también tu web.Los necesitas por tres motivos:Son un factor de posicionamiento en el Map Pack de Google; pueden ayudarte a posicionar mejor en esos resultados.Aunque cualquier directorio local te puede ayudar a posicionar mejor en el Map Pack de Google, aquellos que incluyan un link a tu web también te pueden ayudar con los resultados de búsqueda orgánicos.Ayudarán a los usuarios a encontrar tu empresa en a) motores de búsqueda como Google y b) resultados de búsqueda de esos directorios.Resultados de “abogado cerca de mí” en directorios y posts. Pueden ser una fuente de negocio si te mencionan.Empieza listándote con los grandes agregadores como Foursquare. Después envía tus datos a plataformas populares como Facebook, Yelp y Bing y ve a directorios conocidos en tu zona y sector como TopAbogados o los colegios de abogados. Asegúrate de que las menciones sean consistentes.Un método que ahorra tiempo cuando buscas menciones locales de forma manual es usar la herramienta de Ahrefs Link Intersect. Simplemente abre la herramienta, introduce las direcciones de tus competidores y deja en blanco la última caja.Aquí tienes algunos resultados de muestra. Fíjate en que puedes usar la herramienta para encontrar también otras oportunidades de enlace. (En este caso, la herramienta nos muestra más de 4.600 dominios)Lecturas complementariasCómo conseguir menciones locales (guía completa) Factores de posicionamiento en SEO localAnima a tus clientes a dejar reviewsSegún Google, las reseñas positivas y los ranking ayudan a su algoritmo a entender por qué algunas empresas son más importantes.Puedes pedirle a tus clientes que dejen reseñas de la forma que quieras. Ya que nos estamos enfocando en posicionarnos en Google, las reviews enviadas ahí probablemente sean las más importantes.Cosas a recordar: no compres reviews, no ofrezcas algo a cambio de reviews y trata de responder a las mismas tan pronto como puedas. (Esta es la guía de Google para gestionar reviews)RecomendaciónGoogle te ayuda al permitirte crear un enlace especial con el que puedes compartir una petición de reseña en Google.Esto es más o menos todo en lo que respecta a optimizar el Map Pack de Google. Vamos a pasar al tema ligeramente más complejo de optimizar para los resultados orgánicos, es decir, los resultados que están debajo del map pack.2. Optimiza para los resultados orgánicosPara tener alguna posibilidad de posicionar en los resultados de búsqueda orgánicos necesitas páginas con contenido relevante a una búsqueda. Cuanto más útil, interesante y bien enlazado esté el contenido, mayores serán tus posibilidades. En eso nos vamos centrar a partir de ahora.Lista tus servicios SEO o no, tienes que ofrecer a tus usuarios una lista de los servicios que ofreces y, además, compartir dónde los ofreces. Algunos de estos servicios tendrán una demanda de búsqueda considerable; otros puede que no. Más adelante explicaremos esto en más profundidad al hacer keyword research o investigación de palabras clave.Así que, por ejemplo, pongamos que estás especializado en derecho penal, incluyendo áreas como apropiación indebida, alcoholemia o bullying. Lo mínimo es que crees una página que explique tu experiencia en derecho del entretenimiento y que menciones las especialidades anteriores.Sin embargo, una táctica más efectiva es crear un content hub, donde la página pilar hable sobre tu experiencia en derecho del entretenimiento en general y, al mismo tiempo, enlaces a las subpáginas dedicadas a cada área en la que trabajas.Esta página es un ejemplo de un content hub (también conocido como topic cluster). Tenemos la información general sobre derecho penal:Y enlaces a áreas relevantes en el contenido. Cada enlace lleva a una página dedicada a un área.Y aquí algunos resultados:Este content hub genera casi 1.000 visitas de tráfico orgánico al mes.Algunas de las palabras clave por las que el content hub se posiciona. Está muy bien si eres un abogado penalista en Madrid.En resumen, estos son algunos de los beneficios de un content hub:Más autoridad temática: los enlaces de contenido relacionado forman relaciones semánticas. lo que puede ser una señal de autoridad del tema para Google (aprende más).Más autoridad de enlace: las páginas enlazadas en un hub se benefician entre sí de los backlinks de cada una de ellas.Una forma amigable para el usuario de navegar en tu sitio web: la información está solo a un clic de distancia.Mayor valor percibido: las personas suele percibir los hubs como recursos de valor sobre el tema (lo que también puede incrementar la propensión de que enlacen tu hub).Una idea adicional que merece la pena considerar es crear hubs separados por área y sector. De esta forma, incrementarás el número de palabras clave por las que posicionas a la vez que ofreces una estructura clara al usuario.Ejemplo de bufete de abogados que muestra tanto sectores como áreas en las que trabaja.Nota al margen. Según JurisPage, una agencia especializada en marketing legal, el contenido largo es lo que mejor funciona para páginas de servicio. Así que cuando crees tus hubs, incluye contenido informativo y de calidad. Lista tus ubicacionesEl objetivo aquí es ayudar a Google a indexar tu sitio web en palabras clave con intención de búsqueda local. Algunas serán explícitas. Es cuando el usuario utiliza un modificador de ubicación como “abogado laboral barcelona”. Algunos son implícitos, es decir, cuando no hay modificación de ubicación, pero Google cree que existe intención de búsqueda local (“pastelería” te mostrará pastelerías en tu área).Aquí va una táctica que te ahorrará tiempo que dedicarías a crear muchas páginas por cada ubicación y te evitará problemas de contenido duplicado:Puedes crear una página (por ejemplo, una llamada “Contacto”) con al menos la dirección exacta de cada ubicación (incluyendo la provincia y comunidad), teléfono y dirección de email (si las direcciones de email son distintas).Incluye tus ubicaciones en el pie de página. Así que si tienes varias ubicaciones, puedes mencionar el nombre de la región y ciudad y enlazarlas con la página que contiene los detalles de ubicación.Si quieres ofrecer más información específica relacionada con las ubicaciones, tales como abogados en activo, puedes crear subpáginas para cada ubicación. Recordatorio: asegúrate de listar todas las ubicaciones físicas en el Gestor de Perfiles de Google.Ejemplo de ubicaciones listadas en una página de contacto.Ejemplo de listado de ubicaciones en el footer. Todas llevan a páginas con más información.Nota al margen. No necesitas listar todas las abreviaturas de cada ciudad. Para Google, N.Y.C. es lo mismo que New York (Nueva York). Haz keyword researchHasta este punto, tenemos ideas sobre qué contenido crear desde la perspectiva de un abogado. Ahora vamos a examinar la perspectiva de un usuario. Desde el punto de vista de un usuario, una palabra clave es una palabra o frase que escriben en Google para encontrar cosas como productos o servicios locales.Esto para nosotros quiere decir que las keywords o palabras clave se convertirán en los temas de nuestro contenido, publicaciones en el blog, landing pages, etc. y/o en cosas que merezca la pena mencionar en nuestro contenido. Más importante, serán los principales motores del tráfico orgánico.Aquí tienes algunas ideas para hacer keyword research para abogados y asesorías legales.Amplía tus servicios analizando otras páginas que estén posicionadasPara esto, necesitarás una herramienta de keyword research como Keywords Explorer de Ahrefs.Ve a la herramienta, escribe una palabra clave semilla como “abogado corporativo” y ve a Términos relacionados. Te mostrará palabras clave por las que otras páginas se posicionan y sobre las que hablan a la vez que se posicionan en tu palabra clave semilla.Puedes cambiar entre entre los informes “También está posicionado para” y “También habla de” o mostrarlos todos a la vez. Elige Top 10 o Top 100 para limitar o ampliar tu búsqueda.Así que por ejemplo, puede que merezca la pena ir a por estas palabras clave:Busca palabras clave de competidores específicosAlgunos de tus competidores ya estarán por delante de ti en lo que respecta al SEO, apuntando a palabras clave de alto valor con su contenido. Pero eso no debería frenarte a la hora de posicionar en las mismas keywords (e incluso desbancar a la competencia).Hay dos métodos de analizar a tus competidores en este ámbito.El primero se hace introduciendo el dominio de tu competidor en Site Explorer de Ahrefs, configurado en “subdominios”. Esto mostrará todas las palabras clave por las que tu competidor se posiciona.Para conseguir una lista de keywords más manejable, también puedes introducir la URL de una página específica (como el blog o las áreas en que trabajan) y/o usar filtros para mostrar palabras clave por criterios como volumen de búsqueda, potencial de tráfico o dificultad de palabra clave.En el segundo método, puedes revisar algunos competidores de una vez. Ve al informe de Brecha de contenido (content gap) en Site Explorer , introduce tus competidores y deja la última caja vacía.Esto te mostrará palabras clave donde al menos uno de tus competidores se posicione en el top 10.Para incrementar la relevancia de los resultados puedes desmarcar la intersección “1 target” (1 objetivo).Si ya tienes una web en funcionamiento, también puedes introducir tu dominio para ver las palabras clave por las que tus competidores se posicionan, pero tú no. Para hacerlo, usa el último campo para tu dominio.Mira más alláSi quieres descubrir más oportunidades para generar tráfico orgánico de búsqueda, dedica algo más de tiempo a Keywords Explorer y busca:Sugerencias automáticas de Google.Preguntas comunes.Temas sobre los que tus competidores escriben.Por ejemplo, podemos elegir nuestro informe También está posicionado por y hacer que solo muestre palabras clave con preguntas añadiendo palabras como “por qué”, “cómo”, “cuándo”, etc. en el filtro Incluir.De esta forma podemos descubrir preguntas habituales relacionadas con áreas de la ley como la de abajo. Fíjate en que varios de los primeros resultados de búsqueda pertenecen a firmas de abogados. No es raro ver a empresas relacionadas con el mundo legal atraer visitas con contenido educativo.Una habilidad importante al hacer keyword research es elegir y priorizar palabras clave. Para ver cómo se hace paso a paso, lee esto: Cómo hacer investigación de palabras clave para SEO.Crea páginas optimizadas Ahora que sabemos sobre qué queremos crear contenido, es hora de aprender a crear ese contenido. Así que en esta sección vamos a poner el foco en optimizar los llamados factores SEO on-page: cosas que puedes incluir en tu página o dentro de su HTML para mejorar su posicionamiento y visibilidad en las SERPs.Alinéate con la intención de búsqueda La intención de búsqueda se refiere a la razón detrás de la búsqueda. Es uno de los factores de posicionamiento más fuertes.La intención de búsqueda de cualquier búsqueda se puede identificar mirando la SERP y determinando tres cosas:Tipo de contenido: ¿es el tipo dominante un post de blog, una landing page o una herramienta gratuita?Formato del contenido: Los formatos habituales incluyen tutoriales, opinión, posts con definiciones etc.Ángulo del contenido: el argumento de venta único en los resultados, como por ejemplo “en 2023”, o “para principiantes”.Por ejemplo, a juzgar por las páginas que mejor se posicionan y la caja de “Otras preguntas de los usuarios” de “emancipación en españa”, parece que Google piensa que la gente quiere saber qué es y cuál es la edad de emancipación. Así que la mejor forma de alinearse con la intención de búsqueda es con un artículo que explique lo que es la emancipación, poniendo énfasis en la edad y sus implicaciones legales.Para convertirte en un experto en intención de búsqueda, consulta nuestra guía: ¿Qué es la intención de búsqueda? Una guía completa para principiantes.Crea contenido de calidad y actualizadoGoogle está continuamente mejorando su comprensión de la calidad del contenido. Por darte un resumen rápido de sus guías SEO, deberías hacer que tu contenido fuera:Fácil de leer: cuando escribes sobre derecho y leyes es probable que no puedes evitar la jerga legal. Pero a pesar de eso puedes explicarla y usar frases sencillas que cualquiera (en realidad, incluso hasta un niño de 9 años) pueda leer.Organizado con claridad: divide el texto en secciones con titulares descriptivos.Actualizado: algo crucial en temas relacionados con derecho.Único: puedes tomar ideas del contenido con mejores resultados, pero a la vez trata de ofrecer un valor único a tus lectores. Por ejemplo, puedes ofrecer un ángulo de contenido singular o incluir materiales educativos como una infografía. Aquí es también donde puedes considerar hacer algo de link bait (contenido diseñado para atraer enlaces).Enfocado en ofrecer información esencial para resolver un problema que tengan los usuarios: contenido más largo no implica mayor calidad.Alineado con las guías E-A-T: más sobre esto en la próxima sección.Lecturas complementariasRedacción SEO: 12 consejos fáciles para un mejor contenido y mejor posicionamiento Cómo crear contenido que sea “mejor” que el de tus competidores Demuestra E-A-T E-A-T- son las siglas en inglés de expertise (experiencia), authoritativeness (autoridad) y trustworthiness (fiabilidad). Es un concepto tomado de una guía que los Quality Raters (supervisores de calidad) de Google usan para ayudar a sus ingenieros a mejorar el algoritmo de Google. Significa que Google quiere promover páginas que demuestren E-A-T y está mejorando en esto. Donde E-A-T tiene más importancia es en los temas YMYL (Your Money or Your Life, tu dinero o tu vida). Sin duda, el derecho y las leyes entran ahí.Además de cosas obvias como contar con un contenido preciso, actualizado y en el que cites tus fuentes cuando sea necesario, destacar tus credenciales es algo que puede ayudar.Así que crea una página “Acerca de” en la que te presentes a ti y a más abogados de tu empresa y demuestra por qué la gente debería confiar en ti. Menciona cosas como la educación, premios, asociaciones, etc.Destacar las credenciales no es alardear sin más. Si eres un abogado con méritos, la gente (y Google) te encontrará más fiable.Después asegúrate de que cada artículo que publiques mencione al autor y enlace a su página “Acerca de”.Otras dos tácticas que pueden ayudarte a demostrar tu experiencia, autoridad y fiabilidad son:Usa marcado schema en páginas donde presentes a los abogados: el marcado schema es un código sencillo que ayuda a Google a entender mejor tu contenido.Consigue enlaces de fuentes de autoridad: explicaré algunas tácticas de link building más adelante en este artículo.Lectura recomendada: ¿Qué es E-A-T? Por qué es importante para el SEOOptimiza títulos de página y meta descripciones Los títulos de página y las meta descripciones son importantes porque los usuarios pueden verlos en las SERPs y esto puede impactar en lo que hacen clic. Además, los títulos de página se consideran un “factor de posicionamiento pequeño”.Esto es algo que puedes tener en cuenta a la hora de escribir un título de página:Haz que el título sea llamativo y preciso: escribe una línea que capte el interés del usuario y que describa con precisión lo que hace único a tu contenido o propuesta.Incluye la palabra clave objetivo en tu título: haz que suene natural para el lector. Para el título de tu página principal, asegúrate de incluir el nombre de tu empresa.Que encaje en 60 caracteres.Y esto es lo que es importante para las meta descripciones:Hazlas atractivas, pero sin caer en el clickbait.Que encaje en 920 píxeles: Puedes usar una herramienta como SERPSim para ayudarte.Sincroniza la descripción con el título: la descripción puede ser una extensión o un apoyo a lo que afirmes en el título.Lecturas complementariasCómo crear la etiqueta de título de SEO perfecta en cuatro pasos Cómo escribir la meta descripción perfecta Usa URLs cortas y descriptivasLas URLs son otro “pequeño” factor de posicionamiento. Y deberías optimizar la URL con el usuario en mente. Lo que quiere decir:Mantenla corta: no uses una estructura excesivamente anidada. Las URLs deberían ser una indicación de la ubicación del usuario en una web.Haz que sea legible para las personas: usa pocas palabras que describan la página. No uses signos crípticos.Consigue un certificado SSL: esto mostrará a los usuarios que la conexión es segura y privada; Verán “HTTPS” al principio de tu dominio como señal de conexión segura en el navegador. También es una señal ligera de posicionamiento.Aquí tienes un ejemplo de una URL amigable para el usuario que cumple todos los requisitos anteriores. https://www.garciadelasantaabogados.es/despido-improcedente/Lectura recomendada: Cómo crear URLs amigables con el SEOAñade enlaces internos Los enlaces internos son los enlaces a otras páginas en tu web. Los necesitar por varias razones. Pueden:Ofrecer una ruta de rastreo a páginas objetivo.Mejorar otras páginas que poseas. Esto quiere decir que pasan link equity (valor de enlace). Así, las páginas que suelen recibir muchos enlaces pueden ayudar a otras páginas (en las que conseguir enlaces sea más difícil) a posicionar mejor (echa un vistazo al método del intermediario).Ayuda a Google a entender sobre qué es la página: esto es posible con los textos ancla de los enlaces internos.Ayuda a los usuarios a navegar por tu web.La fase de creación de contenido es el mejor momento para incluir enlaces internos. Los tres lugares que deberías considerar al añadir enlaces son:Tus páginas con valor económico o money pages, es decir, las páginas que describen tus servicios o ayudan a los usuarios a contactarte. Pero no lo fuerces, añádelos cuando sea un paso natural para el usuario.Otros artículos relevantes sobre el tema.Artículos relacionados.Para encontrar oportunidades de enlaces internos, puedes usar operadores de búsqueda en Google. Usa el operador site: junto a un término de búsqueda entre comillas, como este:Otra forma es usar el informe de Oportunidades de enlace en Site Audit de Ahrefs. Se centra en las 10 mejores palabras clave de cada página en tu web y busca menciones de esos términos en tus otras páginas.Puedes encontrar el informe en el menú de la izquierda en Site Audit.Resultados de muestra del informe de Oportunidades de enlace (Link opportunities) en Site Audit.Lectura recomendada: Por esto deberías priorizar los enlaces internos en 2022Optimiza imágenesOptimizar imágenes en SEO consiste en estas tres cosas:Comprime el tamaño de archivo de la imagen: si usas WordPress, puedes usar un plugin como ShortPixel o un optimizador de imágenes en lote como Kraken. Esto ayudará a que tu sitio cargue más rápido, y la velocidad de carga cuenta para el SEO (como se muestra en este caso de estudio).Usa nombres de archivo de imagen descriptivos.Usa textos alt descriptivos. Junto a los nombres de archivo, ayudan a Google a entender el contexto de tu página. Además, los textos alt ayudan a los usuarios con problemas de visión.Usando el nombre de una persona dentro del nombre del archivo de su fotografía; una buena práctica vista en Ecija.Traduce tu contenido (para regiones multilingües)Las firmas legales y los abogados que trabajan en regiones multilingües que ofrecen servicios en distintos idiomas deberían considerar traducir su contenido. Deberían hacerlo al menos para las páginas en las que quieran posicionar en frases multilingües, como por ejemplo, la página principal, servicios, ubicaciones y página de contacto.Estos son los motivos:El contenido en el mismo idioma que la búsqueda es probablemente más relevante para esa búsqueda.Ayuda al hacer link building en el mismo idioma.El contenido traducido será más accesible al grupo de personas que hablen ese idioma. Página web de un abogado canadiense con contenido en inglés y francés posicionando por una palabra claveEl SEO multilingüe supone muchos detalles y tecnicismos, así que permite que te recomiende nuestra guía sobre el tema: SEO en varios idiomas: guía de traducción y marketing.Con esto terminamos de lidiar con los factores on-page. Ahora podemos pasar a los factores off-page, es decir, lo que ocurre fuera de nuestro sitio web.Consigue enlacesLos enlaces desde otros sitios web son uno de los factores de posicionamiento con más impacto. Cuantos más enlaces de calidad tienes, mejor puedes posicionar en los resultados orgánicos.Puedes conseguir enlaces de dos formas:Conseguirlos orgánicamente a través de contenido digno de ser enlazado en tu web.Conseguirlos con métodos de link building (que explicaré en esta sección del artículo).Nota al margen. Según algunos SEOs todos los enlaces pueden ayudarte a posicionarte tanto en el map pack de Google como en los resultados orgánicos. Esto en realidad tiene sentido si lees las pistas que Google nos da sobre cómo determina el posicionamiento local:En general, para mejorar tu posicionamiento local, prioriza las oportunidades de enlaces que seas relevantes tanto a nivel contextual como local y que provengan de fuentes de autoridad.Con todo esto, vamos a ver algunas ideas que pueden ser útiles para que abogados y empresas relacionadas con el mundo legal consigan enlaces relevantes.Publica notas de prensaDespués de un caso importante puede ser una buena idea emitir una nota de prensa. Dependiendo del tipo de caso puede generar interés en medios internacionales, nacionales o locales.Un ejemplo de esto es el caso de Johnny Depp y Amber Heard que llevaban Camille Vasquez y Benjamin Chew de Brown Rudnick. Como puedes ver, el caso generó a ese bufete enlaces con follow de 213 dominios de calidad. Algunos eran locales, y algunos nacionales e internacionales.Siendo sinceros, ese caso generó tanta atención a nivel mundial que el bufete probablemente no tuvo que emitir una nota de prensa. Me apuesto algo a que existen menciones sin enlazar que se pueden convertir en enlaces, por lo que el número puede ser incluso más alto.Algunas otras ideas de notas de prensa pueden ser:Contrataciones.Fusiones.Novedades importantes sobre la empresa.Busca oportunidades de newsjackingTambién conocidas como “relaciones públicas reactivas” o “PR reactivo”, esta técnica consiste en ofrecer información fiable sobre eventos actuales.Esta técnica requiere monitorizar con regularidad lo que pasa en el mundo o en tu área local en relación a tu área de especialización legal. Aquí van dos formas para que lo hagas manteniendo la cordura. Puedes:Contratar a alguien, por ejemplo, a una agencia local de PR.Usar una herramienta de monitorización como Google Alerts. Si eres un usuario de Ahrefs, también puedes usar la herramienta de Menciones.Enlaces en tus publicaciones, formación o eventos públicosLos abogados suelen tener la oportunidad de dar clase en universidades y hacer presentaciones en conferencias, eventos y congresos. A veces esto ofrecerá la opción de incluir un enlace en la biografía del conferenciante. Es una gran oportunidad para conseguir un enlace de un dominio con alta autoridad (con un perfil de enlaces fuerte) y relevancia local, como en el ejemplo de abajo.Consigue oportunidades como autor invitado (guest blogging)El guest blogging es una práctica de link building habitual. Pero la cantidad de oportunidades varía en función del tema. Debajo tienes un ejemplo de artículo invitado en El Referente (medio líder sobre startups en España) sobre la nueva ley de startups. Su autor, Luis Gosálbez, es socio director en una firma legal.Esta es una forma en la que puedes encontrar y valorar oportunidades de guest blogging usando Content Explorer de Ahrefs:Escribe derecho AND (“autor invitado” OR “guest post”) en la barra de búsqueda. Esto servirá para buscar en nuestra base de datos la palabra “derecho” y al menos una de las dos frases “autor invitado” or “guest post”. También puedes probar con otras combinaciones como “abogado” o “ley”.Establece el filtro de tráfico web “A partir de 500” para filtrar webs nuevas y que puedan tener poca calidad.Activa el filtro “Solo enlaces activos” para quitar las páginas rotas.Usa la opción de “Una página por dominio” porque solo queremos un único resultado de cada web.Aquí tienes un ejemplo de lo que hemos encontrado. Fíjate en que puedes ver en el momento métricas de cada página, lo que te ayuda a evaluar las oportunidades. Responde peticiones de los periodistasServicios como Reportaro (en España) o HARO, ResponseSource y SourceBottle en el mundo anglosajón te permiten hacer seguimiento de peticiones de expertos de periodistas en busca de comentarios de expertos sobre temas legales (o desde una perspectiva legal). Si tu comentario aparece en un periódico o revista, te beneficias por dos lados: ganas un enlace e incrementas el reconocimiento de tu empresa.Todo lo que necesitas hacer es registrarte en uno de sus servicios, suscribirte a temas que te interesen y esperar un email con la última petición. Si algo capta tu atención, responde lo antes que puedas.Además, puedes seguir el hashtag #journorequest en Twitter, donde podrás ver peticiones de expertos en inglés de periodistas:https://twitter.com/LucyInTheSky22/status/1470443283713298434?ref_src=twsrc%5EtfwSi puedes, prioriza las noticias y revistas locales porque esos enlaces tienen relevancia local, lo que te puede ayudar a posicionarte en palabras clave con intención local.Rankings localesAquí va el último plato de nuestro menú: rankings locales publicados por revistas, blogs o sitios de reseñas locales.No lo confundas con los directorios y listados locales que destacamos al comienzo del artículo.A pesar de que hacer link building con rankings locales es una buena táctica para cualquier negocio local, no he visto muchas oportunidades en el nicho legal. A pesar de eso, si este tipo de oportunidad llama a tu puerta, considérala a fondo. Simplemente recuerda evaluarla en términos de relevancia contextual, relevancia local y autoridad.Listado de los mejores abogados en Valladolid en un ranking local.Con esto acabamos la sección de link building. Si quieres aprender más sobre link building, revisa nuestras guías en profundidad:La guía para principiantes al link building 9 tácticas de link building local fáciles Cómo conseguir backlinks: 15 tácticas comprobadas Próxima parada: cómo mantenerse al día en SEO técnico y hacer seguimiento de los resultados.3. Mantén la salud de tu webLa “salud SEO” de tu web puede impactar tu posicionamiento o evitar que aparezcas en Google. Nos adentramos en el territorio del SEO técnico: optimizar tu web para ayudar a que los motores de búsqueda encuentren, rastreen, entiendan e indexen tus páginas. Por suerte, existen herramientas para hacer esto.En resumen: la forma más fácil de mantener en forma la salud SEO de tu web es hacerte con una herramienta como Site Audit y arreglar cualquier error que muestre (también está disponible en Ahrefs Webmaster Tools).Revisar problemas técnicos SEO no es algo que vaya a llevarte mucho tiempo de forma habitual. Una vez que te asegures de que tu web es rastreable e indexable y arregles cualquier error o advertencia que ya tengas en tu sitio web (como, por ejemplo, enlaces rotos o páginas que tardan demasiado en cargar) se trata de revisar de vez en cuando el informe.Ejemplo de email de informe de SEO técnico en Site Audit.Para profundizar más en el SEO técnico, revisa esto:La guía para principiantes al SEO técnico Cómo hacer una auditoría de SEO técnico en 8 pasos 4. Haz seguimiento de tu progreso SEO Hacer seguimiento de tu progreso “a mano” en Google no es fiable, ya que Google personaliza los resultados en base a factores como el historial de búsqueda y la ubicación actual. Aquí van algunas herramientas que puedes usar en su lugar.Empezando con el Perfil de Empresa de Google, Google te permite hacer seguimiento de un conjunto de métricas de rendimiento de forma gratuita dentro del servicio. Por ejemplo, puedes ver las consultas que la gente usó para encontrar tu perfil, el número de peticiones de la dirección o el número de personas que vieron tu perfil.También necesitarás una herramienta para hacer seguimiento de los resultados de tu Map Pack de Google, como las herramientas freemium Grid My Business o Local Falcon. Si quieres hacer seguimiento del posicionamiento de todas tus palabras clave, prueba una herramienta como Rank Tracker de Ahrefs. Te permite hacer seguimiento de hasta 10.000 palabras clave y sus posiciones para los resultados “normales” de búsqueda orgánica, por país, estado, ciudad e incluso código postal.Lectura recomendada: 10 Métricas SEO que de verdad importan (y 4 que no)Reflexiones finalesAunque el SEO te puede traer tráfico por el que no tienes que pagar, hay que tener en cuenta que esta táctica de marketing lleva tiempo y esfuerzo. Cuanto más competitivas sean las palabras clave por las que quieres posicionar, más tiempo te llevará posicionar en ellas.Los primeros pasos probablemente serán los más difíciles, así que puede que no sea la mejor idea apostar todo al SEO. Pero una vez que tengas el proceso en funcionamiento, puedes usar las mismas técnicas una y otra vez para conseguir resultados consistentes con efectos compuestos.¿Alguna pregunta? Escríbenos en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO para abogados y asesorías legales: la guía completa"
    },
    {
      "level": "H2",
      "text": "¿Por qué el SEO es importante para los abogados?"
    },
    {
      "level": "H2",
      "text": "1. Optimiza para el Map Pack de Google"
    },
    {
      "level": "H3",
      "text": "Crea y optimiza un Perfil de Empresa de Google"
    },
    {
      "level": "H3",
      "text": "Consigue que te mencionen en listados y directorios locales"
    },
    {
      "level": "H3",
      "text": "Anima a tus clientes a dejar reviews"
    },
    {
      "level": "H2",
      "text": "2. Optimiza para los resultados orgánicos"
    },
    {
      "level": "H3",
      "text": "Lista tus servicios"
    },
    {
      "level": "H3",
      "text": "Lista tus ubicaciones"
    },
    {
      "level": "H3",
      "text": "Haz keyword research"
    },
    {
      "level": "H4",
      "text": "Busca palabras clave de competidores específicos"
    },
    {
      "level": "H4",
      "text": "Mira más allá"
    },
    {
      "level": "H3",
      "text": "Crea páginas optimizadas"
    },
    {
      "level": "H4",
      "text": "Alinéate con la intención de búsqueda"
    },
    {
      "level": "H4",
      "text": "Crea contenido de calidad y actualizado"
    },
    {
      "level": "H4",
      "text": "Demuestra E-A-T"
    },
    {
      "level": "H4",
      "text": "Optimiza títulos de página y meta descripciones"
    },
    {
      "level": "H4",
      "text": "Usa URLs cortas y descriptivas"
    },
    {
      "level": "H4",
      "text": "Añade enlaces internos"
    },
    {
      "level": "H4",
      "text": "Optimiza imágenes"
    },
    {
      "level": "H4",
      "text": "Traduce tu contenido (para regiones multilingües)"
    },
    {
      "level": "H3",
      "text": "Consigue enlaces"
    },
    {
      "level": "H4",
      "text": "Publica notas de prensa"
    },
    {
      "level": "H4",
      "text": "Busca oportunidades de newsjacking"
    },
    {
      "level": "H4",
      "text": "Enlaces en tus publicaciones, formación o eventos públicos"
    },
    {
      "level": "H4",
      "text": "Consigue oportunidades como autor invitado (guest blogging)"
    },
    {
      "level": "H4",
      "text": "Responde peticiones de los periodistas"
    },
    {
      "level": "H4",
      "text": "Rankings locales"
    },
    {
      "level": "H2",
      "text": "3. Mantén la salud de tu web"
    },
    {
      "level": "H2",
      "text": "4. Haz seguimiento de tu progreso SEO"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}