{
  "url": "https://ahrefs.com/blog/es/seo-programatico/",
  "slug": "seo-programatico",
  "title": "SEO programático para principiantes",
  "description": "El SEO programático se refiere a la creación de páginas orientadas a palabras clave de forma automática. Para hacerlo a gran escala, ayuda ser desarrollador web, pero hay formas menos técnicas. Te mostraremos cómo.",
  "content": "Ryan Law Ryan is the Director of Content Marketing at Ahrefs. He helps the team with spicy opinions, deep research, and wild experiments. Contenido El SEO programático se refiere a la creación de páginas orientadas a palabras clave de forma automática (o semiautomática).Permite a las empresas crear miles de páginas web orientadas a miles de palabras clave sin tener que diseñar, escribir y publicar páginas manualmente. Empresas como Zapier, Zillow y G2 utilizan el SEO programático para generar millones de páginas vistas cada año.Las páginas programáticas suelen crearse a partir de datos de una base de datos, como precios de productos, información meteorológica o de ubicación. Para crear contenido programático a gran escala, resulta útil ser desarrollador web, pero hay formas menos técnicas de aprender algunos de los principios básicos. Te mostraremos cómo.Ejemplos de SEO programáticoSEO programático es un nuevo término que viene de una idea antigua. Si alguna vez has visitado Amazon, Yelp o TripAdvisor, habrás visitado una página programática. De hecho, si una empresa ofrece miles de productos o presta servicios en miles de ubicaciones, un enfoque programático de la creación de contenidos es prácticamente necesario.Pero no hace falta ser un gigante del ecommerce para que el contenido programático sea útil.Páginas de destinos de NomadlistURL: https://nomadlist.com/Páginas estimadas: 25.873Tráfico orgánico mensual estimado: 41.200Nomadlist ayuda a los nómadas digitales a decidir qué países y ciudades visitar. El sitio web tiene miles de páginas programáticas que comparten la misma información básica (como la velocidad de internet, la temperatura media y los idiomas comunes) sobre pueblos y ciudades de todo el mundo.Directorio de aplicaciones de ZapierURL: https://zapier.com/appsPáginas estimadas: 800.632Tráfico orgánico mensual estimado: 306.000Zapier es una herramienta de automatización de flujos de trabajo que conecta diferentes productos de software entre sí (lo que permite guardar automáticamente correos electrónicos nuevos en Google Sheets, por ejemplo). La empresa ha creado programáticamente landing pages para cada uno de los miles de productos con los que se integra, mostrando las herramientas con las que se conecta y los flujos de trabajo que se pueden desencadenar.Plantillas web de WebflowURL: https://webflow.com/made-in-webflow/websitePáginas estimadas: 31.516Tráfico orgánico mensual estimado: 27.600Webflow es un generador de sitios web sin código. Han utilizado el SEO programático para crear landing pages únicas para miles de plantillas de sitios web creadas por sus usuarios. Su estrategia genera una buena cantidad de tráfico, pero también facilita que los visitantes clonen las plantillas y se conviertan en usuarios de Webflow.Páginas de conversión de divisas de WiseURL: https://wise.com/us/currency-converter/Páginas estimadas: 14.888Tráfico orgánico mensual estimado: 4.667.719Wise ofrece servicios bancarios internacionales, incluida la conversión de divisas. Generan millones de visitas mensuales mediante la creación programática de landing pages para ayudar a los usuarios a convertir entre distintas divisas: de dólares estadounidenses a rupias indias, de rupias indias a pesos mexicanos, etcétera. Prácticamente, cada par de divisas tiene su propia página.¿Programático… o spam?Antes de que te ilusiones demasiado con la perspectiva de publicar miles de páginas, merece la pena tener en cuenta lo que dice John Mueller, de Google: “El SEO programático es, a menudo, un banner elegante para el spam.”Cualquier empresa que publique muchas páginas muy similares corre el riesgo de crear thin content: contenido que ofrece poco o ningún valor al usuario final. Como cualquier otra página, el contenido programático debe satisfacer la intención del usuario (y no infringir las políticas de spam de Google).Si te preguntas qué diferencia el “buen” contenido programático del malo, la respuesta a menudo se reduce a los datos y la relevancia.Sitios como Wise y Zapier pueden generar millones de páginas vistas a partir de contenido programático en gran medida porque ofrecen datos buenos y relevantes para el producto en un formato útil para el lector:Las páginas de conversión de divisas de Wise también incluyen datos históricos de tipos de conversión, comparaciones de tipos con otros bancos y la posibilidad de enviar dinero utilizando Wise.Las páginas de aplicaciones de Zapier son más que listas básicas de herramientas: muestran docenas de flujos de trabajo útiles y permiten al usuario configurarlos por sí mismo.Hoy en día, es técnicamente posible generar un gran número de páginas web con poco más que una suscripción a ChatGPT, un Google Sheet y un script simple (que, de hecho, ChatGPT puede escribir). Pero solo porque, en teoría, puedas poner la creación de contenidos en piloto automático, no significa que vayas a obtener buenos resultados.No es posible que este tipo de contenido genere tráfico significativo durante un periodo de tiempo prolongado. Los datos relevantes y únicos suelen ser los que marcan la diferencia entre el contenido útil y el spam.Cómo empezar con el SEO programáticoLa verdadera creación programática de contenidos puede complicarse en muy poco tiempo. Es necesario obtener, sincronizar y actualizar miles (incluso millones) de datos. Hay que indexar miles de URL y crear miles de enlaces internos. Para crear algo como lo que han hecho Wise o Zapier, se necesitan desarrolladores.En cualquier caso, no todos los proyectos programáticos tienen que ser tan complicados. Puedes atraer mucho tráfico con solo unos cientos o miles de páginas.Aquí tienes un proceso sencillo sin código para empezar con el SEO programático. Este proceso te ayudará a identificar las mejores palabras clave para el SEO programático, a crear automáticamente prototipos de páginas e, incluso, a comunicarte más eficazmente con los desarrolladores que darán vida a tu proyecto.1. Encuentra palabras clave que escalenEl contenido programático funciona dirigiéndose a miles de palabras clave similares con una plantilla básica. Para empezar, es necesario encontrar palabras clave relevantes que tengan cientos (o incluso miles) de variaciones similares.Para empezar, introduce las palabras clave iniciales en Keywords Explorer de Ahrefs. Para un sitio web de finanzas personales, podrías utilizar términos como gestión de deudas, coste de la vida y seguimiento de gastos. A continuación, amplía tu lista de palabras clave potenciales seleccionando el informe Términos que concuerdan:Si no sabes con seguridad si puedes posicionarte con las palabras clave de mayor competencia, puede ser útil filtrar los resultados estableciendo la Dificultad de la palabra clave en <20 y la DR de los sitios mejor posicionados en <30. Esto mostrará las palabras clave con las que la mayoría de las webs podrían posicionarse, incluso las que no tienen muchos backlinks.Revisa la lista de palabras clave y busca patrones. En este caso, muchas de las palabras clave “coste de la vida” hacen referencia a un lugar concreto:Para centrarnos solo en este tipo de palabras clave, podemos utilizar el filtro Incluir para mostrar todas las palabras clave que incluyan “coste de la vida en”:Observando este ejemplo, hemos encontrado 1.143 palabras clave con un volumen de búsqueda mensual combinado de 122.000. Si consigues posicionarte en el ranking en algunos de estos términos, podrás generar un tráfico web considerable.Estas palabras clave son perfectas para el SEO programático. El tipo de contenido que mejor ayudaría a alguien que busca “cost of living in alaska” es posible que sea muy similar al tipo de contenido que ayudaría a alguien que busca “cost of living in hawaii”.Los datos de cada página tendrían que ser diferentes, pero la estructura y las ideas principales serían las mismas.2. Comprueba la intención de búsquedaA continuación, hay que determinar qué tipo de contenido ayudaría a la gente que busca esas palabras clave. Si miras las SERP de la palabra clave “coste de la vida”, muchos de los resultados de búsqueda contienen el mismo tipo de información:Una puntuación del coste de la vida en una escala de 0 a 100Comparaciones con estados cercanos en EE.UU.Costes habituales de gastos importantes como vivienda, alimentación y atención sanitariaEstos datos nos dan una idea del tipo de información que se necesita para satisfacer la intención del buscador. Los usuarios quieren poder comparar rápidamente el coste de la vida entre los estados de EE.UU. y, además, ver cómo se distribuyen esos costes entre las categorías principales.Para el contenido programático, es probable que tengas que incluir estos datos en todas las páginas.3. Busca datos relevantesA continuación, hay que obtener esos datos. Hay tres tipos de datos a nuestra disposición:Datos protegidos: datos originales que son exclusivamente tuyos, de tu empresa o de tu producto. Es el tipo de datos más deseable: puede proporcionar información que nadie más tiene.Datos públicos: datos a disposición del público con licencia para uso comercial. Suelen ser los datos más fáciles de encontrar, pero eso significa que otras empresas pueden estar utilizándolos en un contexto similar.Datos rastreados: datos extraídos de sitios web mediante herramientas de rastreo web. Pueden ser útiles, pero pueden plantear problemas de derechos de autor.Observando los resultados de la búsqueda de estas palabras clave, muchos de los artículos mejor posicionados contienen datos de la misma fuente de datos pública: el Cost of Living Index publicado por el Consejo de Investigación Económica y Comunitaria. Es posible que puedas utilizar estos mismos datos en tus contenidos programáticos.Si quieres ir un paso más allá, puedes considerar la posibilidad de añadir datos nuevos que otros artículos mejor posicionados no tienen. Sitios como Kaggle proporcionan conjuntos de datos para su uso en el entrenamiento de modelos de IA y aprendizaje automático, pero también pueden proporcionar puntos de datos adicionales para tu contenido.Realiza una búsqueda rápida de “coste de la vida” en Kaggle y aparecerán varios conjuntos de datos útiles. Puedes ordenar por edad para encontrar datos nuevos que, probablemente, no utilicen otras empresas:Con las fuentes de datos, puedes combinar todos los puntos de datos que quieras en un único lugar.4. Construye tus páginasA continuación, tienes que asignar tus fuentes de datos a las partes relevantes de tu página. En este punto, convendría contratar a un desarrollador web, pero mostraremos un ejemplo simplificado, utilizando Google Sheets como base de datos básica.TIPHaz una copia de nuestra base de datos de ejemplo de Google Sheets aquí: Programmatic Content ExampleEn la primera pestaña de la hoja de cálculo, tenemos nuestros datos de palabras clave, que puedes utilizar para crear títulos de páginas y URL. En la siguiente pestaña, tenemos los datos sobre el coste de la vida.Basándonos en nuestro análisis de intenciones, queremos que cada página incluya tres “cubos” de información:Coste de la vidaComparación con otros estados de EE.UU.Desglose de los costes en categorías clavePor tanto, en la tercera pestaña, hemos creado una fórmula que extrae los datos relevantes de nuestras diferentes hojas en una plantilla de página simplificada.Nota al margen.Si no conoces bien las fórmulas de Google Sheets, en la cuarta pestaña hemos incluido una consulta a ChatGPT que puede hacerlo por ti.Este texto hace referencia a los datos de la hoja del coste de la vida: muestra la puntuación, la clasifica en relación con los otros 49 estados, determina si un estado es barato, de precio medio o caro, y comparte los índices de coste en seis categorías principales.Si añades más estados a la lista arrastrando hacia abajo la fórmula de la columna A, se generan automáticamente URL nuevas, títulos de página y textos. Si combinas las fuentes de datos con una sola plantilla de página, puedes crear 50 páginas diferentes arrastrando el ratón.Lo más importante es que el contenido que hemos generado aquí es la definición de “escaso”, ya que contiene mucho texto duplicado y datos no originales. No obstante, si se añadieran datos únicos, se crearan visualizaciones de datos útiles y se proporcionara un contexto escrito único, entonces estas páginas podrían tener una oportunidad de ayudar a los lectores y posicionarse para sus palabras clave objetivo.5. Publica el contenido en tu webEl último paso es publicar el contenido recién creado en tu sitio web. Dependiendo del sistema de gestión de contenidos que utilices, existen algunas herramientas sin código que pueden ayudarte con este proceso:Si ya utilizas WordPress para tu sitio, prueba WP All Import.Si utilizas Webflow CMS, configura una integración Zapier para conectarte a tu hoja de cálculo.Si quieres crear un sitio web directamente desde tu hoja de cálculo, prueba Softr.Una vez configuradas, cada una de estas herramientas publicará automáticamente una página web nueva cada vez que se añada una nueva fila de datos a la hoja de cálculo.Reflexiones finalesEl SEO programático requiere recursos: gestionar datos y páginas a gran escala es realmente complicado. Para que tu contenido funcione y, de hecho, ayude a la gente, necesitarás datos relevantes e interesantes que compartir. (También ayuda ser desarrollador web).Pero la combinación de palabras clave “escalables” y grandes datos es una fuerza que se debe tener en cuenta. Con un poco de conocimiento, es posible generar miles (incluso millones) de visitas a partir de una sola plantilla de página, cosa que no está mal. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Ryan Law Ryan is the Director of Content Marketing at Ahrefs. He helps the team with spicy opinions, deep research, and wild experiments.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO programático para principiantes"
    },
    {
      "level": "H2",
      "text": "Ejemplos de SEO programático"
    },
    {
      "level": "H3",
      "text": "Páginas de destinos de Nomadlist"
    },
    {
      "level": "H3",
      "text": "Directorio de aplicaciones de Zapier"
    },
    {
      "level": "H3",
      "text": "Plantillas web de Webflow"
    },
    {
      "level": "H3",
      "text": "Páginas de conversión de divisas de Wise"
    },
    {
      "level": "H2",
      "text": "¿Programático… o spam?"
    },
    {
      "level": "H2",
      "text": "Cómo empezar con el SEO programático"
    },
    {
      "level": "H3",
      "text": "1. Encuentra palabras clave que escalen"
    },
    {
      "level": "H3",
      "text": "2. Comprueba la intención de búsqueda"
    },
    {
      "level": "H3",
      "text": "3. Busca datos relevantes"
    },
    {
      "level": "H3",
      "text": "4. Construye tus páginas"
    },
    {
      "level": "H3",
      "text": "5. Publica el contenido en tu web"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Ryan Law"
}