{
  "url": "https://ahrefs.com/blog/es/seo-local/",
  "slug": "seo-local",
  "title": "SEO local: La guía completa",
  "description": "El SEO local consiste en mejorar tu presencia online para generar más negocio a partir de las búsquedas locales, y se enfoca en la optimización para los usuarios de Google.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido El SEO local es el camino a seguir si quieres conseguir más clientes para tu negocio local a partir de la búsqueda orgánica.Pero, ¿qué es el SEO local, cómo funciona y qué factores de posicionamiento son los que importan?En esta guía aprenderás cómo posicionar tu negocio en búsqueda local para conseguir que más clientes pasen por tu puerta.Bases del SEO localKeyword research para SEO localFactores de posicionamiento en SEO localHerramientas de SEO localCapítulo 1. Bases del SEO localEn primer lugar vamos, a ver qué es el SEO local, por qué importa y qué lo diferencia del SEO “normal”.¿Qué es el SEO local?El SEO local es la práctica de mejorar tu presencia online para conseguir más negocio a partir de búsquedas locales. Estas búsquedas tienen lugar en muchos motores de búsqueda, pero el SEO local se enfoca en la optimización para los usuarios de Google.¿Por qué es el SEO local importante?El SEO local es importante porque muchas personas usan motores de búsqueda para encontrar negocios locales.De hecho, según Google:El 30% de todas las búsquedas móviles tienen relación con la ubicación.El 78% de las personas que buscan algo cercano en sus teléfonos visitan el negocio durante el día.El 28% de las búsquedas de algo cercano se convierte en una compra.Y en períodos como la Navidad, el 78% de los consumidores que visitaron una tienda, hicieron búsquedas online previamente.En resumen, los clientes buscan tu negocio. Si no estás ahí, estás dejando pasar oportunidades.¿Cómo funciona el SEO local?El SEO local se juega en dos campos, porque Google muestra dos tipos de resultados de búsqueda para la búsqueda local. Se trata de los resultados del “map pack” o pack de mapas y los resultados orgánicos de “enlaces azules”. Puedes posicionarte en ambos.Resultados del map pack o pack de mapasEl pack de mapas, también conocido como pack local, es una funcionalidad de la SERP (página de resultados) de Google que muestra la lista de los principales negocios locales en el mapa. A menudo aparece arriba del todo en los resultados de búsqueda de Google para las búsquedas locales.Resultados de búsqueda orgánicaLos resultados “normales” de búsqueda orgánica son los “diez enlaces azules” que ya conoces. Normalmente aparecen debajo de los resultados del map pack.Capítulo 2. Keyword research para SEO localLa investigación de palabras clave local es el proceso de entender cómo la gente busca los servicios locales que ofreces.Es importante porque quieres optimizar por lo que la gente busca.Vamos a ver cómo hacerlo.1. Encuentra palabras clave que tengan que ver con serviciosLa mayoría de la gente no piensa en las distintas formas en las que otros pueden buscar lo que hacen.Por ejemplo, si eres un fontanero, algunos clientes te encontrarán al escribir “fontanero” en Google. Pero otras personas buscarán servicios específicos como “desatascar tuberías”.Por eso, deberías empezar haciendo un brainstorming y listando los servicios que ofreces. Esto te ayudará a maximizar tu presencia en las búsquedas que hacen los clientes.En el caso de un fontanero podría ser algo así:Desatascar tuberíasReparación de calderaMantenimiento de calderaInstalación de radiadorReparación de tuberíaPara hacer crecer esta lista, usa las palabras clave de servicios como “semillas” para encontrar más servicios que la gente esté buscando.Por ejemplo, si introducimos los servicios de arriba en el Explorador de Palabras Clave de Ahrefs y revisamos el informe de Términos que concuerdan, veremos palabras clave como:mantenimiento caldera gasmantenimiento caldera gasoilmantenimiento caldera junkersSi ofreces esos servicios, puede que también te interese ir a por esas palabras clave.Aquí tienes otra forma de encontrar keywords “perdidas”:Introduce un negocio de la competencia en el Explorador de Sitios de Ahrefs, ve al informe de Mejores páginas y busca URLs que se refieran a servicios.2. Comprueba los volúmenes de búsquedaLas herramientas de keyword research te muestran volúmenes nacionales de búsqueda. Si quieres volúmenes de búsqueda en tu comunidad o provincia tendrás que usar Google Keyword Planner.Desafortunadamente, Keyword Planner tiene sus problemas:Muestra volúmenes de búsqueda amplios (como 1.000 - 10.000), no cifras absolutas.Agrupa las palabras clave y redondea el volumen combinado de búsquedas.Por eso, revisar la popularidad relativa de palabras clave a nivel nacional suele ser más productivo, ya que lo que sucede en una ciudad suele ser parecido en otra.Puedes hacer esto con herramientas de keyword research como el Explorador de Palabras Clave de Ahrefs.Por ejemplo, la herramienta nos dice que más gente busca “reparación caldera” que “instalación” caldera en España:Probablemente pase lo mismo en cualquier ciudad en la que estemos, así que es una forma excelente de priorizar palabras clave.3. Comprueba la intención localLa intención local quiere decir que los usuarios quieren comprar cerca. Si no fuera el caso de tus servicios, entonces no es una oportunidad de SEO local.Para comprobar la intención local de una búsqueda, ponla en Google y revisa los resultados.Si hay un map pack y/o algún tipo de resultados locales de “enlace azul”, tiene intención local.Si no hay map pack ni resultados locales de “enlace azul”, no tiene intención local.Aún así, puedes atacar palabras clave sin intención local, pero no se trata de SEO local.4. Asigna keywords a páginasEs improbable que tu página principal se posicione por todas tus palabras clave de servicios. Así que necesitarás atacar a algunas con páginas separadas.Para asignar palabras clave a URLs, piensa en los servicios a los que hacen referencia.Si se trata de servicios muy distintos, como “instalación caldera” y “reparación de tuberías rotas”, asígnalas a páginas distintas.Si se trata del mismo servicio, como “desatasco de cañerías” y “desatranque de cañerías”, asígnalas a la misma página.Puedes aprender más sobre este proceso en nuestra guía de keyword research local.Aprende más: Cómo hacer keyword research localCapítulo 3. Factores de posicionamiento en SEO localPuede que todavía recuerdes que el SEO local se juega en dos campos, porque hay dos formas de posicionar. La primera es el pack de mapas y la segunda es la “normal” de los resultados orgánicos.Los factores de posicionamiento pueden variar dependiendo de dónde quieras posicionar; pero algunos son importantes para ambos.A continuación, vamos a ver cuáles creen los SEOs que son los más importantes de cada una de las dos partesPerfil de Empresa de Google (anteriormente Google My Business) Un Perfil de Empresa de Google es un listado local con información sobre tu negocio. Es gratis y permite a tu negocio aparecer en el map pack y Google Maps.Qué dicen los SEOsEl 36% de los SEOs creen que el Perfil de Empresa de Google es el factor de posicionamiento más importante para el map pack. Y el 6% cree que es importante para los resultados orgánicos “normales”. Todo esto, según la encuesta de BrightLocal.Esto no es sorprendente, ya que necesitas un Perfil de Empresa de Google para tener alguna posibilidad de posicionar en el map pack.Además, las señales del Perfil de Empresa crecen en la importancia percibida para el map pack a lo largo del tiempo.Más allá de los rankings, Google afirma que es un 70% más probable que los clientes visiten empresas con el Perfil de Empresa completo. También es un 50% más probable que consideren comprar a esas empresas. Así que está claro que un Perfil de Empresa completo y optimizado es esencial si quieres atraer más negocio.Mejores prácticasMuchas de estas mejores prácticas vienen del propio Google:Sé específico al poner tu categoría de negocioConfigura tu horario de apertura (incluyendo festivos)Añade tu dirección (si tienes una tienda física)Establece tu área de servicio (si visitas o haces entregas a clientes)Añade los productos o servicios que ofrecesAñade fotosPide reviews a los clientesAprende más: Cómo optimizar tu ficha de Google My Business en 30 minutosCitaciones NAPUna mención NAP menciona a tu negocio por su nombre, dirección y número de teléfono (del inglés “name, address, phone”). Normalmente aparecen en directorios de empresa y perfiles de redes sociales.Nota al margen. También están las menciones NAPW, que incluyen tu web. Qué dicen los SEOs El estudio de 2021 de BrightLocal muestra que el 7% de los SEO piensan que las citaciones son el factor de posicionamiento más importante. Eso es cierto tanto para los resultados del map pack como para los resultados normales.En otras palabras, es algo importante; pero no tanto como solía ser.La importancia percibida de las citaciones entre los SEOs ha ido cayendo desde 2014.Dicho esto, las citaciones pueden ser útiles para que los usuarios descubran tu negocio online. Esto pasa porque los directorios suelen posicionarse en los resultados de búsqueda para las búsquedas locales. Así que si estás en esos directorios, la gente que vaya ahí desde los resultados de búsqueda puede encontrar tu negocio.Mejores prácticasRegístrate en agregadores big data (en Estados Unidos, son Data Axle, Localeze, y Foursquare)Sube tu listado a otros actores importantes (como Apple Maps, Yelp, Páginas Amarillas, Bing Places y Facebook) También puedes subir tu listado a directorios de tu región o sector.Mantén las menciones consistentes (mismo nombre, dirección, número de teléfono) en todas partes.Aprende más: Cómo Construir Menciones Locales (Guía Completa)TIPAquí tienes una forma rápida de encontrar directorios sectoriales:Pega tu página principal en el Explorador de SitiosVe a Link Intersect (intersección de enlaces)Introduce las páginas principales de algunos competidores de tu áreaEstablece el modo de búsqueda en “URL” para todos los objetivosHaz clic en “Mostrar oportunidades de enlace”Esto te mostrará sitios que enlazan a uno o más de tus competidores, pero no a ti.Si un sitio web enlaza a muchos competidores, probablemente es un directorio donde también puedes añadir una entrada.ReviewsLas reviews se refieren a la cantidad y calidad de las reviews de tu Perfil de Empresa de Google y en cualquier otro sitio online.Qué dicen los SEOsEl estudio de 2021 de BrightLocal muestra que el 17% de los SEOs consideran las reviews el factor de posicionamiento más importante para el posicionamiento en map pack. Pero solo el 5% lo ven como lo más importante para el posicionamiento orgánico.Las reviews también han crecido en su importancia percibida para el posicionamiento en el map pack en los últimos años.Pero las reviews no son solo importantes para el posicionamiento. Conseguir reviews en tu Perfil de Empresa de Google y en todas partes genera confianza con Google y con los clientes.Mejores prácticasMuchas de estas mejores prácticas para conseguir más reviews vienen del propio Google:Recuerda a los clientes que dejen reviews (puedes crear y compartir un enlace de review en el Administrador de Perfiles de Empresa de Google).Enfócate en conseguir reviews en tu Perfil de Empresa de Google.Responde a las reviews para generar confianza (necesitarás verificar con Google tu Perfil de Empresa para hacer esto).No ofrezcas o aceptes dinero a cambio de reviews (va en contra de los términos de Google).No trates de evitar las malas reviews o pidas buenas reviews a los clientes (va contra los términos de Google).EnlacesLos enlaces son como votos para tu sitio desde otros sitios web.Qué dicen los SEOsEl estudio de BrightLocal muestra que el 31% de los SEOs considera los enlaces como la señal más importante para posicionar en los resultados orgánicos normales. El 13% piensa lo mismo de los resultados de map pack.Para la mayoría, esto no será una sorpresa. En 2016 Google dijo que los enlaces eran uno de sus tres factores de posicionamiento favoritos. Además, muchos estudios han encontrado una fuerte correlación entre enlaces y tráfico orgánico.La importancia percibida de los enlaces también está creciendo en el posicionamiento local “normal”. Pero su importancia percibida en lo que respecta al “map pack” permanece más o menos estable a lo largo del tiempo.Mejores prácticasConseguir enlaces de otros sitios bien posicionadosConseguir enlaces que tengan los competidores (usa la herramienta Link Intersect de Ahrefs para esto)Consigue menciones locales (suelen tener enlaces)Reclama menciones sin enlazarReclama enlaces perdidos redireccionando versiones antiguas de tus páginas a nuevas versionesAprende más: 9 Tácticas de Link Building Local Fáciles (en inglés)On-pageEl SEO on-page es cuando haces cambios en el contenido de una página para ayudar a que se posicione mejor en los resultados de búsqueda orgánicos.Qué dicen los SEOsEl estudio de BrightLocal muestra que el 34% de los SEOs piensan que las señales on-page son el factor más importante para la búsqueda orgánica normal. Y el 16% cree que es el factor más importante para el posicionamiento en el map pack. También crece la importancia percibida de las señales on-page para el SEO local. Puedes verlo en los resultados de años anteriores de la encuesta de BrightLocal.Mejores prácticasAdapta tus páginas a la intención de búsqueda.Incluye tu información NAP (nombre, dirección, número de teléfono) en tu web.Escribe etiquetas de título y descripciones atractivas.Usa URLs descriptivas y amigables con el SEO. Optimiza tus imágenes. Enlaza internamente hacia y desde páginas donde sea relevante.Incluye detalles que le importen a los usuarios.TIPUna forma de encontrar detalles que le interesen a los usuarios es revisar de qué hablan las páginas mejor posicionadas en tu área. Puedes hacer esto mirando las propias páginas. O puedes usar el Explorador de Palabras Clave para encontrar palabras clave mencionadas entre las páginas mejor posicionadas. Aquí tienes cómo:Introduce [palabra clave de servicio] [ubicación] (por ejemplo, “reparación caldera madrid”)Ve al informe de Términos relacionadosActiva los botones de “También habla de” y “Top 10” Aquí van algunas de las palabras clave que se suelen mencionar en las páginas mejor posicionadas para “reparación de calderas madrid” y lo que probablemente quieran decir: “saunier duval” – Los usuarios probablemente quieran saber si se cuenta con servicio para esta marca en concreto. “Madrid” y “comunidad de madrid” – Los usuarios probablemente quieren saber si la empresa da servicio en su zona. “caldera” – Probablemente quieran saber si arreglamos calderas. “medio ambiente” – Es probable que los usuarios quieran saber si nuestros servicios mejoran la calidad del medio ambiente. Merecería la pena mencionar algunos de estos términos en tu página.Lectura recomendada: SEO On-Page: Guía Completa para PrincipiantesCapítulo 4. Herramientas de SEO localVamos a ir cerrando el tema con unas pocas herramientas de SEO local que te pueden resultar útiles.Administrador del Perfil de Empresa de GoogleEl Administrador de Perfiles de Empresa de Google, antes Google My Business, es con lo que gestionas tu Perfil de Empresa en Google. Registrarse es gratuito y algo que todo propietario de un negocio local debería hacer.Google Search ConsoleGoogle Search Console es una herramienta gratuita para monitorizar el rendimiento de tu sitio web en búsqueda. Te dice cuánto tráfico de búsqueda recibes, dónde va y de qué palabras clave viene.Rank Tracker de AhrefsRank Tracker te permite rastrear las posiciones de hasta 10.000 palabras clave para búsqueda orgánica “normal” por país, estado, ciudad e incluso código postal.Link Intersect de AhrefsNuestra herramienta Link Intersect te permite encontrar sitios web que enlacen a varios competidores. Esto es útil para encontrar menciones locales relevantes y menciones específicas del sector.Grid My BusinessGrid My Business muestra posiciones en el ranking de map pack para una palabra clave en la zona alrededor de tu negocio. Es freemium y es útil para entender si es probable que los usuarios locales vean tu negocio y de dónde vienen.YextYext es una herramienta para sincronizar y gestionar la información de tu negocio en distintos listados. Es útil para mantener las menciones consistentes, aunque puedes hacer esto a mano.Google Keyword PlannerGoogle Keyword Planner es una herramienta gratuita de keyword research de Google. Es una fuente útil para conocer el rango de los volúmenes de búsqueda a nivel local.Sigue aprendiendoCon suerte, ahora tienes una buena comprensión de cómo funciona el SEO local. Si quieres profundizar más y seguir aprendiendo, echa un vistazo a estos recursos:Cómo hacer reyword research localSoluciones de SEO local: 8 consejos para mejorar tu posicionamiento local (en inglés)Cómo conseguir menciones locales9 tácticas de link building local fácilesCómo optimizar tu Perfil de Empresa de Google en 30 minutos¿Alguna duda o consulta sobre SEO local? Cuéntanos en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "SEO local: La guía completa"
    },
    {
      "level": "H2",
      "text": "Capítulo 1. Bases del SEO local"
    },
    {
      "level": "H3",
      "text": "¿Qué es el SEO local?"
    },
    {
      "level": "H3",
      "text": "¿Por qué es el SEO local importante?"
    },
    {
      "level": "H3",
      "text": "¿Cómo funciona el SEO local?"
    },
    {
      "level": "H4",
      "text": "Resultados del map pack o pack de mapas"
    },
    {
      "level": "H4",
      "text": "Resultados de búsqueda orgánica"
    },
    {
      "level": "H2",
      "text": "Capítulo 2. Keyword research para SEO local"
    },
    {
      "level": "H3",
      "text": "1. Encuentra palabras clave que tengan que ver con servicios"
    },
    {
      "level": "H3",
      "text": "2. Comprueba los volúmenes de búsqueda"
    },
    {
      "level": "H3",
      "text": "3. Comprueba la intención local"
    },
    {
      "level": "H3",
      "text": "4. Asigna keywords a páginas"
    },
    {
      "level": "H2",
      "text": "Capítulo 3. Factores de posicionamiento en SEO local"
    },
    {
      "level": "H3",
      "text": "Perfil de Empresa de Google (anteriormente Google My Business)"
    },
    {
      "level": "H4",
      "text": "Qué dicen los SEOs"
    },
    {
      "level": "H4",
      "text": "Mejores prácticas"
    },
    {
      "level": "H3",
      "text": "Citaciones NAP"
    },
    {
      "level": "H4",
      "text": "Qué dicen los SEOs"
    },
    {
      "level": "H4",
      "text": "Mejores prácticas"
    },
    {
      "level": "H3",
      "text": "Reviews"
    },
    {
      "level": "H4",
      "text": "Qué dicen los SEOs"
    },
    {
      "level": "H4",
      "text": "Mejores prácticas"
    },
    {
      "level": "H3",
      "text": "Enlaces"
    },
    {
      "level": "H4",
      "text": "Qué dicen los SEOs"
    },
    {
      "level": "H4",
      "text": "Mejores prácticas"
    },
    {
      "level": "H3",
      "text": "On-page"
    },
    {
      "level": "H4",
      "text": "Qué dicen los SEOs"
    },
    {
      "level": "H4",
      "text": "Mejores prácticas"
    },
    {
      "level": "H2",
      "text": "Capítulo 4. Herramientas de SEO local"
    },
    {
      "level": "H3",
      "text": "Administrador del Perfil de Empresa de Google"
    },
    {
      "level": "H3",
      "text": "Google Search Console"
    },
    {
      "level": "H3",
      "text": "Rank Tracker de Ahrefs"
    },
    {
      "level": "H3",
      "text": "Link Intersect de Ahrefs"
    },
    {
      "level": "H3",
      "text": "Grid My Business"
    },
    {
      "level": "H3",
      "text": "Yext"
    },
    {
      "level": "H3",
      "text": "Google Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Sigue aprendiendo"
    }
  ],
  "author": "Joshua Hardwick"
}