{
  "url": "https://ahrefs.com/blog/es/seo-kpis/",
  "slug": "seo-kpis",
  "title": "12 KPIs SEO que deberías seguir cerca",
  "description": "Los Indicadores Clave de Desempeño (KPIs) te ayuda a entender cómo está progresando tu negocio hacia sus objetivos. Estos 3 KPIs son todo lo que necesitas.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Los KPIs SEO (key performance indicators, indicadores clave de rendimiento) son las métricas SEO más importantes y tienen una relación estrecha con el crecimiento de la empresa. Determinan las acciones que llevas a cabo, así que deberías elegirlos con cuidado.En este artículo vamos a ver 12 KPIs SEO habituales y a debatir sobre si deberías hacer seguimiento de los mismos o no (y cómo, en caso afirmativo).Contenido1. Visibilidad de búsquedaLa visibilidad de búsqueda (search visibility en inglés) mide lo visible que es tu marca en el mercado. También se denomina visibilidad SERP, es la versión SEO de uno de los KPIs más importantes en marketing: cuota de conversación, cuota de voz o share of voice (SOV).¿Deberías usarla como KPI SEO?Sí. La visibilidad de búsqueda es uno de los KPIs más útiles y universalmente aplicables en SEO. De hecho, quizá sea la única métrica que no es de conversión que puede tener una relación estrecha con el crecimiento de tu empresa.Esto es porque existe una fuerte relación entre SOV y cuota de mercado. En general, cuanto mayor sea tu SOV, mayor será tu cuota de mercado.Cómo hacer seguimientoPega las palabras clave que te interesen en Rank Tracker de Ahrefs. Ten en cuenta que deberían ser las palabras clave principales que incluyan lo que busca tu audiencia objetivo (no te preocupes por las palabras clave long tail). Añade una etiqueta para filtrar más adelante.A partir de ahí, dirígete a la pestaña de competidores y revisa la columna de visibilidad:2. Conversiones desde tráfico orgánicoLas conversiones son acciones importantes que tus usuarios realizan en la página web, tales como comprar, registrarse o suscribirse a un servicio. Hacer seguimiento de estas acciones para todas tus fuentes de tráfico, incluyendo el orgánico, es algo que la mayoría de empresas debería hacer.¿Deberías usarlas como KPI SEO?Sí. Quizá sea el único KPI SEO que no admite discusión. El seguimiento de conversiones es la única forma directa de relacionar tus esfuerzos de marketing con tus ingresos.Cómo hacer seguimientoConfigurar el seguimiento de conversiones en Google Analytics 4 no es tan complicado, aunque pueda intimidar al principio. No necesitas saber programar para hacerlo. Lo más importante aquí es asegurarse de que haces seguimiento de las conversiones adecuadas.Si te encargas de gestionar un e-commerce, el número de conversiones, su valor y el valor de tu pedido medio son las que tienen más sentido en tu caso. Tendrás que configurar el seguimiento específico para ecommerce en ese caso.Si ofreces software bajo suscripción, como nosotros, lo mejor que puedes hacer es hacer seguimiento de los leads, registros en la versión de prueba, suscripciones de pago y, con el tiempo, incluso cada nivel dentro de las nuevas suscripciones.¿Tienes ya los datos recogidos correctamente? En Google Analytics 4, ve a Informes > Interacción > Conversiones y filtra las sesiones de tráfico orgánico usando el botón de “Editar comparativa”: Hay mucho que decir sobre la precisión en los informes de conversión y todos los matices en lo que respecta a la atribución que hay por detrás. En general, conseguirás los datos más precisos si:Usas GA4 (ya deberías estar haciéndolo a estas alturas)Usas el modelo de atribución basado en datos por defecto (revisa en Administrar > Ajustes de atribución > Modelo de atribución de los informes).Tienes al menos algunos cientos de conversiones al mes (para asegurarte de que el modelo de Google tenga datos suficientes para hacer su magia).Si todavía no tienes tantas conversiones en tu sitio web, es buena idea comprobar también tus conversiones asistidas usando diferentes modelos de atribución. Ve a Publicidad > Atribución > Rutas de conversión, elige el evento de conversión que quieres analizar y comprueba el impacto de la búsqueda orgánica a través de los customer journeys:Recomiendo revisar este recurso sobre la modelización de atribución si quieres entender mejor este tema complejo. 3. ROI del SEOEl ROI (return on investment, retorno de la inversión) del SEO estima el valor a nivel de empresa de todas las actividades SEO en comparación con su coste. La fórmula es:ROI del SEO = (valor de las conversiones orgánicas - coste de las inversiones SEO)/coste de las inversiones en SEO *100En otras palabras, necesitas dividir el beneficio del SEO entre sus costes asociados y después multiplicarlo por 100 para conseguir el ROI en porcentaje.¿Deberías usarlo como KPI SEO?Solo si lo pide el cliente, tu jefe/a u otros grupos de interés. En esencia es un gran KPI SEO, pero muy difícil de medir correctamente.Quizá, el mayor reto provenga de la discrepancia entre los períodos de “inversión” y “retorno”. El SEO puede llevar mucho tiempo antes de que lleguen los resultados que se buscan, y casi nunca puedes decir con una confianza del 100% que la actividad X genera los resultados Y.Pero podemos abandonar la idea de revisar el ROI del SEO desde el punto de vista de toda la web. Para ser tan precisos como sea posible con esta métrica necesitamos medir de forma más granular.Cómo hacer seguimientoSi es posible, mide el ROI a nivel de categoría, página o incluso palabra clave. El motivo de esto es que puedes medir bien el “retorno” de posicionar con palabras clave concretas y calcular las “inversiones” que les dedicaste.Pongamos que gastaste 1.000€ en pagar a un redactor que creó una pieza de contenido para posicionar y generar conversiones. Gastaste otros 1.000€ en un agencia de link building que consiguió algunos enlaces. Cuentas 500€ por defecto como tu tiempo y el de tu equipo (por ejemplo, diseñadores, editores) por encargarse del resto del trabajo. Y ya estamos en 2.500€.Pasado un año, revisas Google Analytics y miras que esta página landing orgánica generó 5.000€ en conversiones. Puedes afirmar que tienes un ROI del 200% y probablemente siga en aumento.Este es un ejemplo simplificado, claro. Pero si sientes curiosidad, dirígete a mi guía de ROI en SEO.4. Nuevos enlacesLos enlaces (backlinks) son uno los factores de posicionamiento SEO más importantes.El número y calidad de nuevos enlaces que apuntan a tu sitio web en general son un reflejo de tu trabajo en SEO, marketing de contenidos y relaciones públicas, por lo que es algo a lo que la mayoría de empresas prestarán atención.¿Deberías usarlos como KPI SEO?Sí, pero solo es útil como KPI SEO si de forma activa trabajas para conseguir enlaces y haces un seguimiento de resultados de los contactos realizados. Es la única forma de tener en cuenta solo los enlaces que merece la pena perseguir.Cómo hacer seguimientoHacer seguimiento de los resultados de tu outreach (contactos) no puede ser más fácil una vez que has terminado con la prospección de enlaces, es decir, del proceso de averiguar qué enlaces quieres conseguir. Simplemente añade una columna, nota o comentario en tu hoja de seguimiento de prospección que indique si conseguiste o no el enlace.Aquí tienes un ejemplo del aspecto que tenía el seguimiento de nuevos enlaces cuando hacía el outreach por mi cuenta:Te enterarás de que tus contactos han dado fruto al recibir una respuesta positiva o al descubrir uno de los enlaces deseados en el informe de Enlaces en Site Explorer de Ahrefs:Puedes ver nuevos enlaces que apuntan al blog de Ahrefs en español, descubiertos en los últimos siete días y que añadieron el enlace en cualquier momento después de publicar.5. Rankings de palabras claveEl ranking de posiciones de palabras clave se refiere a las posiciones orgánicas de una web en los resultados de búsqueda de palabras clave concretas.¿Deberías usarlos como KPI SEO?No. En lugar de esto, usa la visibilidad de búsqueda como KPI, es una métrica mejor. Pero como necesitas una buena investigación de palabras clave para hacer seguimiento de ese KPI, las posiciones en el ranking de búsquedas podrían servir como sustituto provisional hasta que llegues a ese punto.Cómo hacer seguimientoSimplemente pega un grupo de palabras clave que consideres importantes en Rank Tracker de Ahrefs. Puedes recibir alertas periódicas por email con el progreso de las palabras clave de las que has hecho seguimiento o, simplemente, consultar los informes de Rank Tracker de vez en cuando:6. Tráfico orgánicoEl tráfico orgánico representa todos los clics no pagados que llegan desde los motores de búsqueda.¿Deberías usarlo como KPI SEO?No, salvo que estés monetizando tu sitio web con anuncios de display. No tiene mucho sentido para otras empresas, porque tener más tráfico no se traduce necesariamente en mayores ingresos.Por ejemplo, la página de HubSpot en la que explican cómo escribir el emoji de encogerse de hombros (“shrug”) recibe unas 82.800 visitas orgánicas de búsqueda. Pero dudo que alguna de esas visitas se convierta en un mayor reconocimiento de marca, mucho menos en ventas.Cómo hacer seguimientoLa pestaña de Rendimiento en Google Search Console (GSC) te proporciona la visión más precisa de tu tráfico orgánico a lo largo del tiempo:7. Número de páginas indexadasTe dice cuántas de tus páginas tiene un motor de búsqueda en su índice.¿Deberías usarlo como KPI SEO?Depende. Ver cómo aumenta el número de páginas indexadas a medida que publicas nuevo contenido es un indicador sólido de que Google no tiene problemas para rastrear e indexar tu web. Pero la mayoría de webs no tienen ese problema. Así que considera hacer seguimiento de este número como KPI SEO solo si es probable que tengas problemas para que tu contenido se indexe adecuadamente. Esto es algo habitual solo en el caso de webs grandes y complejas.Cómo hacer seguimientoLa mejor forma de hacer seguimiento del número de páginas indexadas es comprobar el informe de Páginas en tu cuenta de GSC. Ahí, elige el filtro “Todas las páginas enviadas” para mostrar solo páginas de tus sitemaps:Hacemos esto porque tu sitemap solo debería incluir URLs que quieres que estén indexadas. Analizar el número de páginas indexadas en este segmento y relacionándolo con las “No indexadas” es, por tanto, la mejor elección para este KPI de de SEO técnico:8. Puntuación de salud de sitio webLa puntuación de salud de sitio o Health Score, muestra la proporción de URLs internas en tu sitio web que no tienen errores técnicos SEO.¿Deberías usarla como KPI SEO?No. Es una gran métrica aproximada del estado general de tu SEO técnico, pero eso es todo. Siempre vas a necesitar más contexto para que sea información de valor. Aquí tienes un ejemplo de por qué:El código de estado HTTP 404 es uno de esos problemas técnicos SEO que generará un aviso de error en cualquier rastreador. Mostrar que el recurso no se encontró en general es malo tanto para los usuarios como para los motores de búsqueda. Pero existe una gran diferencia entre tener un 404 en una página con buena conversión y alto tráfico orgánico y una que no es muy importante.En resumen, algunos errores SEO técnicos son mucho más serios que otros, pero la puntuación de salud no muestra esas diferencias.Cómo hacer seguimientoLa mayoría de herramientas SEO ofrecen una puntuación de salud o alguna medida alternativa con nombre distinto. En el caso de Site Audit de Ahrefs, necesitas configurar un proyecto, realizar el primer rastreo y después revisar la puntuación de salud (Health Score) en la vista general del rastreo:9. Clasificación del dominio (Domain rating, DR)La Clasificación del Dominio o Domain Rating (DR) es una métrica de Ahrefs que muestra la fuerza relativa del perfil de enlaces de una web.¿Deberías usarla como KPI SEO?No. Puedes usarla para medir el perfil de enlaces de una web, pero siempre se necesita un análisis en más profundidad para evaluarlo adecuadamente. DR es solo otra métrica aproximada que a los SEOs les gusta usar.Si buscas un KPI de enlaces, vuelve atrás, hasta el apartado de “nuevos enlaces”. Es una elección mucho mejor donde tenemos en cuenta todas las variables importantes de enlaces.Cómo hacer seguimientoBusca cualquier dominio en Site Explorer de Ahrefs y te encontrarás con la puntuación de DR como la primera métrica en la caja de vista general:10. CTR (click-through rate o tasa de clics)El CTR muestra la proporción de las impresiones de la SERP (página de resultados) que se convierten en clics. El CTR representa cuán efectiva es tu presencia a la hora de atraer gente a tu página web. ¿Deberías usarlo como KPI SEO?No. Tener más tráfico de búsqueda por contar con entradas en la SERP que generan más interacción no se va a traducir necesariamente en más ventas. El clickbait consigue justo lo contrario. Y sí, Google está lejos de ser perfecto y todavía posiciona páginas de clickbait para ciertas palabras clave.Otra razón por la que no deberías obsesionarte con el CTR es que hay muchas cosas fuera de tu control que pueden afectar. Las SERP son terreno en constante cambio.Por último, pero no menos importante, el CTR es inútil cuando está agregado al nivel de toda tu web. Solo tiene tiene sentido hacer seguimiento y optimizar el CTR a nivel de página, porque ese es al nivel al que optimizas.Cómo hacer seguimientoAbre tu informe de Rendimiento en GSC, ve a la pestaña de Páginas y revisa los CTRs de tus páginas específicas:11. Core Web VitalsLas Core Web Vitals (CWV) o métricas web principales, son un conjunto de tres métricas SEO relacionadas con la velocidad de tu sitio web y la experiencia de usuario.¿Deberías usarlas como KPI SEO?No. Google ha estado usando las métricas web principales (CWV) como un factor de posicionamiento menor desde junio de 2021. Como la palabra “menor” implica, no puedes esperar una mejora significativa en el posicionamiento incluso si tienes una puntuación perfecta en toda tu web.Centrarse en CWV tiene su hueco en el SEO, pero se ha exagerado su importancia. Si cualquiera de las tres métricas que componen CWV son muy malas, probablemente sea una buena idea trabajar en mejorarlas. Pero no cumplen los requisitos ni de lejos para ser consideradas un KPI SEO.Cómo hacer seguimientoHay muchas formas de hacer seguimiento de las CWV, pero la más directa es revisar el informe de Métricas web principales en GSC:12. Métricas de interacciónLas métricas de interacción te dan una idea de lo conectados que están tus usuarios con tu sitio web. La mayoría de la gente las conoce por Google Analytics e incluyen métricas como la tasa de rebote, la tasa de interacción, tiempo en página o duración media de la sesión.¿Deberías usarlas como KPI SEO?No. Estas métricas normalmente no reflejan tu crecimiento SEO, menos el crecimiento de la empresa. Pero, por alguna razón, muchos profesionales del marketing están obsesionados con ellas.En resumen, aquí van tres razones por las que, en el mejor de los casos, podrían usarse solo como métricas secundarias:Es fácil que estén sesgadas por problemas inherentes al software de analítica y errores al configurar el seguimiento.La metodología para calcular algunas de estas métricas es más bien mala.Solo son útiles de alguna forma cuando las segmentas a nivel de página para una fuente de tráfico específica.Si te interesa aprender más, profundizo en todas estas razones en nuestra guía para interpretar y mejorar la Tasa de Rebote, una de las métricas de interacción más conocidas y usadas.Cómo hacer seguimientoLa mayoría de tus informes en Google Analytics te mostrarán estas métricas de interacción por defecto. Como mencioné anteriormente, si te planteas usarlas, lo mejor es que filtres tu informe para mostrar páginas específicas por una fuente de tráfico:Reflexiones finalesPuede que te haya sorprendido que solo los dos primeros KPIs SEO de esta lista recibieran un “sí” absoluto por mi parte. Bueno, elegir los objetivos correctos y sus respectivos KPIs es lo principal para crear una gran estrategia de marketing. Y como todo lo que tiene que ver con estrategia, tiene más que ver con elegir lo que no hacer. En este caso, a qué métricas SEO no prestar mucha atención.A pesar de eso, hay usos para todas las métricas de esta lista. Generalmente es una buena idea hacer seguimiento de todas ellas. Algunas se correlacionan con tus KPIs elegidos y pueden incluso ser una mejor elección para evaluar tu trabajo SEO en el día a día. Simplemente, piénsatelo dos veces antes de otorgar demasiada importancia a un métrica en concreto.Por último, pero no por ello menos importante, hacer seguimiento del KPI correcto no es una panacea para tu SEO. Necesitas aprender a analizar e interpretar los KPIs para tomar decisiones lo más informadas posibles. El pensamiento crítico, el conocimiento de tus datos y las plataformas de seguimiento, así como la estadística básica forman parte del conjunto de capacidades deseadas.¿Alguna pregunta? Escríbenos por Twitter, contestamos siempre. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "12 KPIs SEO que deberías seguir cerca"
    },
    {
      "level": "H2",
      "text": "1. Visibilidad de búsqueda"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarla como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "2. Conversiones desde tráfico orgánico"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlas como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "3. ROI del SEO"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlo como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "4. Nuevos enlaces"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlos como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "5. Rankings de palabras clave"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlos como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "6. Tráfico orgánico"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlo como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "7. Número de páginas indexadas"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlo como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "8. Puntuación de salud de sitio web"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarla como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "9. Clasificación del dominio (Domain rating, DR)"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarla como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "10. CTR (click-through rate o tasa de clics)"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlo como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "11. Core Web Vitals"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlas como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "12. Métricas de interacción"
    },
    {
      "level": "H3",
      "text": "¿Deberías usarlas como KPI SEO?"
    },
    {
      "level": "H3",
      "text": "Cómo hacer seguimiento"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek"
}