{
  "url": "https://ahrefs.com/blog/es/serps/",
  "slug": "serps",
  "title": "¿Qué son los SERPs? Las páginas de resultados del motor de búsqueda explicadas",
  "description": "Las páginas de resultados del motor de búsqueda (SERP) son las páginas que Google y otros motores de búsqueda muestran en respuesta a la consulta de búsqueda de un usuario.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Las páginas de resultados del motor de búsqueda (SERP) son las páginas que Google y otros motores de búsqueda muestran en respuesta a la consulta de búsqueda de un usuario.Están formados por resultados de búsqueda orgánicos y de pago.En esta guía, aprenderás:Por qué los SERP son importantes para el SEOCómo aparecer en las SERPsQué características de SERP hay (y cómo puede aparecer en ellas)Por qué los SERP son importantes para el SEOLa mayoría de las personas hacen clic en resultados orgánicos en la primera página de los SERP y rara vez visitan la página dos.Es por eso que todos quieren clasificarse en la primera página de Google. Si estás en la página dos o más allá, eres prácticamente invisible.Pero la clasificación en la primera página no siempre equivale a mucho tráfico por varias razones.Primero, la mayoría de los clics orgánicos van a las primeras posiciones.Segundo, los resultados pagados a menudo empujan las clasificaciones orgánicas hacia abajo en el SERP.Por ejemplo, Google muestra cuatro anuncios pagados por encima de los resultados orgánicos para “comprar gafas en línea”. Debido a esto, el 39% de todos los clics van a resultados pagos.Mostrando el 39% de los clics que van a resultados pagos de la consulta, “compre anteojos en línea”. Datos del Explorador de palabras clave de Ahrefs.En tercer lugar, Google a veces muestra características de SERP que responden la consulta en los resultados de búsqueda.Solo echa un vistazo a los resultados de “lo más buscado en Google”:Debido a que Google responde la pregunta en el SERP, no es necesario que los buscadores hagan clic en un resultado.Cómo aparecer en las SERPsLas SERP pueden tener un aspecto diferente para cada consulta, pero todas están formadas por los mismos tres componentes básicos. Estos son:Anuncios pagadosResultados orgánicosCaracterísticas SERPA continuación, veremos cada uno de estos en detalle y explicaremos cómo puede aparecer allí.Anuncios pagadosLos resultados de búsqueda pagados aparecen antes y, a veces, también después de los resultados orgánicos.Ambos tipos de resultados son prácticamente indistinguibles, la única diferencia real es que los anuncios pagados están marcados como tales.Los anuncios pagos funcionan en función de pago por clic (PPC), lo que significa que los anunciantes ofertan por palabras clave y pagan a Google por cada clic. Los mejores postores generalmente reciben una ubicación privilegiada, aunque Google también tiene en cuenta otros factores como la relevancia del anuncio y el CTR.En pocas palabras: si desea aparecer en anuncios pagados, tendrá que cavar en su alcancía.Resultados orgánicosLos resultados de búsqueda orgánicos son páginas del índice de Google.Debido a que a menudo hay miles de resultados coincidentes, Google los ordena utilizando cientos de factores de clasificación. Como resultado, las páginas más relevantes y de alta calidad generalmente terminan en la primera página de los SERP.Nadie conoce todos los factores de clasificación de Google, pero sí conocemos algunos de ellos.Por ejemplo, sabemos que la cantidad de vínculos de retroceso a una página es importante.En términos de cómo Google muestra resultados orgánicos, generalmente muestran el título, la URL y un fragmento descriptivo.Google muestra la URL, el título y un fragmento descriptivo de nuestra publicación sobre palabras clave de LSI.Puedes decirle a Google qué mostrar en el SERP configurando la etiqueta del título de la página, el slug de URL y la meta descripción.Sin embargo, aunque Google casi siempre muestra la etiqueta de título codificada en el SERP, a menudo elige algo más que la meta descripción para el fragmento.Para páginas con datos estructurados, Google a veces muestra fragmentos enriquecidos junto con los resultados orgánicos regulares también.En pocas palabras: si desea aparecer en los resultados de la búsqueda orgánica, debe centrarse en crear el mejor y más relevante resultado para la consulta. También debe asegurarse de que Google pueda indexar sus páginas y de que estén optimizadas para la búsqueda.Características SERPLas características de SERP son resultados no tradicionales. Pueden ser pagados, orgánicos o extraídos directamente del Knowledge Graph de Google.Varios tipos de características SERP en los resultados de búsqueda.Si bien el propósito de las características de SERP es a veces generar ingresos directamente para Google (es decir, anuncios de Shopping), el objetivo es proporcionar información en los resultados de búsqueda sin la necesidad de hacer clic en un resultado.Por esta razón, las características de SERP tienen un efecto significativo en SEO.Estimaciones recientes sugieren que más del 50% de las búsquedas ahora no generan clics:Pagado, orgánico, y búsquedas zero-clicks en Google (junio de 2019)Datos extraídos de búsquedas de navegadores de millones de ordenadores y móviles en Estados UnidosBúsquedas zero-clicksBúsquedas con clicks orgánicosBúsquedas con clips de anunciosNota al margen. Google no siempre ha mostrado las características de SERP en los resultados. Comenzaron a aparecer con más frecuencia en los últimos años a medida que Google construía su Knowledge Graph, y su comprensión de la intención de búsqueda mejoró..Sin embargo, aparecer en las características de SERP también puede aumentar los clics en su sitio web.En pocas palabras: es posible que aparezca en algunas características de SERP, pero la forma en que lo haga depende del tipo de característica.¿Qué características de SERP hay?Google muestra docenas de funciones SERP en los resultados, y siempre están probando otras nuevas.A continuación, cubriremos algunos de los más comunes, sus fuentes de datos y si es posible aparecer en ellos para ganar más tráfico a tu sitio.Fragmentos destacadosLos fragmentos destacados muestran un fragmento de contenido de una de las páginas web de mayor clasificación. Por lo general, se muestran en la parte superior de la SERP, aunque a veces aparecen otros resultados sobre ellos.Ejemplo de un fragmento destacado.Los formatos de fragmentos comunes incluyen:PárrafoListaMesaNo todos los fragmentos destacados son texto. Google a veces muestra videos (a menudo denominados clips sugeridos):¿Puedes aparecer en fragmentos destacados?Si. La mayoría de las veces, Google extrae el fragmento de uno de los cinco mejores resultados.Si ya te encuentras entre los cinco primeros para una consulta y Google muestra un fragmento destacado, puede valer la pena optimizar su página para intentar que aparezca allí.Tarjeta de conocimientoLas tarjetas de conocimiento aparecen en la parte superior de la SERP y ofrecen una respuesta breve y definitiva a la consulta. Vienen en varios formatos.Existen tres fuentes principales de datos para las Tarjetas de conocimiento: Knowledge Graph de Google, socios de datos y otras fuentes altamente confiables como Wikipedia y organismos gubernamentales oficiales.¿Puedes aparecer en las tarjetas de conocimiento?Improbable. Dado que los datos se obtienen exclusivamente de fuentes de terceros de propiedad de Google y de confianza, no es posible aparecer en una Tarjeta de conocimiento para la mayoría de los sitios web.Panel de conocimientoLos paneles de conocimiento proporcionan información sobre el tema principal de la consulta. Por lo general, aparecen cerca de la parte superior de la SERP en dispositivos móviles y en el lado derecho en el escritorio.Al igual que las tarjetas de conocimiento, la mayoría de los datos en los paneles de conocimiento provienen de Knowledge Graph y de fuentes confiables como Wikipedia y Wikidata.Sin embargo, Google a veces también se vincula a perfiles sociales y socios.¿Puedes aparecer en el Panel de conocimiento?Si. Google muestra paneles de conocimiento de marca para empresas en el gráfico de conocimiento. Estos generalmente incluyen un enlace directo al sitio web de la empresa y enlaces a perfiles sociales.El logotipo de tu empresa también puede aparecer en los paneles de conocimiento de la competencia, aunque no se vincula a su sitio web. Realiza una búsqueda en Google del nombre de la empresa al hacer clic.Paquete de imágenesLos paquetes de imágenes muestran un puñado de miniaturas, y al hacer clic en ellas se accede a Google Imágenes. A menudo aparecen en la parte superior de la SERP pero pueden aparecer más abajo en la página.¿Puedes aparecer en paquetes de imágenes?Mas o menos. Las imágenes de tu sitio web pueden aparecer aquí, pero el enlace siempre llevará al buscador a Google Images, no a tu sitio web. Sin embargo, una vez que hagan clic para acceder a Google Images, verán un enlace a la fuente de la imagen.Mejores historiasLos carruseles de historias principales muestran artículos publicados recientemente, blogs en vivo y videos. Google muestra una miniatura, un título, un nombre de editor y una marca de tiempo para cada resultado, y generalmente aparecen cerca de la parte superior de la SERP.¿Puedes aparecer en los carruseles de Top Stories?Si. Sin embargo, según una investigación realizada por News Dashboard, el 99.31% de los resultados en ordenadores de escritorio provienen de sitios que están indexados en Google News.También vale la pena señalar que la mayoría de las clasificaciones aquí son de corta duración, ya que el propósito de la función SERP es generalmente mostrar nuevos resultados y las páginas no pueden ser nuevas por mucho tiempo.La gente también pregunta (PAA)Los cuadros de También Preguntan muestran preguntas relacionadas que los usuarios le hacen a Google. Cada pregunta se despliega para revelar una respuesta extraída de una página web que se muestra de manera similar a los Fragmentos destacados.Google carga más preguntas relacionadas cada vez que hace clic para revelar una respuesta.¿Puedes aparecer en los cuadros de personas también preguntan?Si. Al igual que los fragmentos destacados, las respuestas a las preguntas en los cuadros PAA provienen de terceros. Tener contenido que responda a una o más de estas preguntas significa que tienes la posibilidad de aparecer en un cuadro de PAA.Dicho esto, es poco probable que aparecer aquí genere mucho más tráfico. Las cajas PAA son más útiles para la investigación de contenido.Resultados de comprasLos resultados de Shopping, oficialmente conocidos como anuncios de ficha de producto (PLA), muestran productos relevantes de anunciantes pagados. Cada resultado presenta el nombre del producto, el precio y el minorista, y algunas reseñas de espectáculos y ofertas especiales.La mayoría de los resultados de Shopping aparecen para consultas con intención de búsqueda de investigación comercial o transaccional. Por ejemplo, “compre proteína en polvo” o “mejores proteínas en polvo”.¿Puedes aparecer en los resultados de Shopping?Sí, pero cuesta dinero. No hay forma de aparecer aquí orgánicamente. Aprende más aquíTweets boxesLos cuadros de tweets muestran tweets populares recientes en un carrusel. Por lo general, provienen de una cuenta oficial de Twitter asociada con la consulta, pero a veces muestran tweets de varias cuentas.Cuadro de tweets que muestra tweets de la cuenta de Ahrefs en Twitter.Cuadro de tweets que muestra tweets sobre Danny Devito de varias cuentas.¿Puedes aparecer en cuadros de Tweets?Si. Para las búsquedas de marca (por ejemplo, “Ahrefs”), Google generalmente muestra tweets recientes de la cuenta oficial de Twitter de la compañía. Para las búsquedas sin marca, los tweets relevantes de tu cuenta aún pueden aparecer en el cuadro Tweets.Enlaces de sitioLos enlaces de sitio son enlaces a otras páginas en el sitio web de clasificación u otras partes de la página de clasificación. Son más una mejora de los resultados orgánicos regulares que una función SERP, ya que aparecen como enlaces “adicionales” debajo de un resultado.Ejemplo de enlaces de sitio para una consulta de marca.Ejemplo de enlaces de sitio para una consulta sin marca.El beneficio de los enlaces de sitio es doble:Las personas pueden encontrar lo que buscan más rápido.Es más probable que las personas hagan clic en su sitio web en el SERP, lo que significa más tráfico orgánico.¿Puedes aparecer en enlaces de sitio?Si. Google muestra sitelinks para consultas de marca, por lo que es probable que las personas ya vean enlaces de sitio cuando busquen tu sitio web.Para consultas sin marca, es más probable que “ganes” enlaces de sitio cuando tu pagina sea popular y tenga enlaces internos a otro contenido relevante, al menos según mis observaciones.VideosLos resultados de video son resultados orgánicos mejorados con una miniatura de video. Solo son elegibles las páginas con videos incrustados, y Google también suele mostrar la fecha de carga, la duración y el nombre del cargador en el SERP.La mayoría de los resultados de vídeo provienen de YouTube, pero también pueden aparecer en otros sitios web.¿Puedes aparecer en los resultados de video?Si. Para los videos alojados en YouTube, Google muestra miniaturas en el SERP de forma predeterminada. Para los videos incrustados alojados en YouTube, Google a veces muestra miniaturas en el SERP. Para los videos incrustados alojados en otro lugar, la página necesita un VideoObject schema markup para ser elegible para esta función.Sigue aprendiendoLea nuestra guía interactiva de 7 pasos para clasificar en la primera página de Google (SERP).Si ya está en la primera página de los SERP, eche un vistazo a nuestra guía de 6 pasos para obtener una clasificación más alta. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "¿Qué son los SERPs? Las páginas de resultados del motor de búsqueda explicadas"
    },
    {
      "level": "H2",
      "text": "Por qué los SERP son importantes para el SEO"
    },
    {
      "level": "H2",
      "text": "Cómo aparecer en las SERPs"
    },
    {
      "level": "H3",
      "text": "Anuncios pagados"
    },
    {
      "level": "H3",
      "text": "Resultados orgánicos"
    },
    {
      "level": "H3",
      "text": "Características SERP"
    },
    {
      "level": "H2",
      "text": "¿Qué características de SERP hay?"
    },
    {
      "level": "H3",
      "text": "Fragmentos destacados"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en fragmentos destacados?"
    },
    {
      "level": "H3",
      "text": "Tarjeta de conocimiento"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en las tarjetas de conocimiento?"
    },
    {
      "level": "H3",
      "text": "Panel de conocimiento"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en el Panel de conocimiento?"
    },
    {
      "level": "H3",
      "text": "Paquete de imágenes"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en paquetes de imágenes?"
    },
    {
      "level": "H3",
      "text": "Mejores historias"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en los carruseles de Top Stories?"
    },
    {
      "level": "H3",
      "text": "La gente también pregunta (PAA)"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en los cuadros de personas también preguntan?"
    },
    {
      "level": "H3",
      "text": "Resultados de compras"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en los resultados de Shopping?"
    },
    {
      "level": "H3",
      "text": "Tweets boxes"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en cuadros de Tweets?"
    },
    {
      "level": "H3",
      "text": "Enlaces de sitio"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en enlaces de sitio?"
    },
    {
      "level": "H3",
      "text": "Videos"
    },
    {
      "level": "H4",
      "text": "¿Puedes aparecer en los resultados de video?"
    },
    {
      "level": "H2",
      "text": "Sigue aprendiendo"
    }
  ],
  "author": "Joshua Hardwick"
}