{
  "url": "https://ahrefs.com/blog/es/sindicacion-de-contenido/",
  "slug": "sindicacion-de-contenido",
  "title": "Sindicación de contenido: qué es y cómo comenzar",
  "description": "La sindicación de contenido es cuando los sitios de terceros vuelven a publicar una copia exacta del contenido que apareció originalmente en otro lugar. Aprenda a usarla en su ventaja.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido ¿Alguna vez ha notado cómo un artículo que aparece en Reuters vuelve a aparecer en varias publicaciones?Esto se conoce como sindicación de contenido.En este artículo, aprenderá:Qué es la sindicación de contenidoLos beneficios de la sindicación de contenidoLas diferencias entre la sindicación, la reutilización y los blogs invitadosCómo la sindicación de contenido afecta al SEOCómo comenzar con la sindicación de contenidoCómo ir más allá de la sindicaciónSindicación pagada y propiaMás allá de la sindicación¿Qué es la sindicación de contenido?La sindicación de contenido es cuando uno o más sitios de terceros vuelven a publicar una copia exacta del contenido que apareció originalmente en otro lugar.Por ejemplo, James Clear publicó por primera vez una publicación sobre práctica deliberada en su blog.Más tarde, Lifehacker volvió a publicar el mismo artículo.Los beneficios de la sindicación de contenidoAdemás de atraer más atención a su contenido, también hay beneficios comerciales tangibles para la sindicación.Obtener tráfico de referenciaLa mayoría de los sitios web que publican de nuevo su contenido le dicen a sus lectores dónde apareció originalmente, y enlazan con la fuente original.Si los lectores disfrutan de la pieza sindicada, pueden hacer clic en su sitio web para obtener más información.Así es como James Clear consiguió toneladas de tráfico de referencia a su sitio; él estaba sindicando a Lifehacker.Obtenga suscriptores de correo electrónicoSarah Peterson acumuló más de 1,000 nuevos suscriptores al volver a publicar su artículo en EliteDaily.Ella hizo esto haciendo que el editor permitiera un enlace a su curso en su biografía.D) evaluación de interésEn una escala de 1-5 ¿ cuánto le interesa cada tema ? 1 siendo más o menos interesado, y 5 que le interesa tanto que puede leer o ver todo lo que ve al respeto.En cuanto más alta la evaluación, más probable es que el tema esté hecho para usted.Ahora, empecemos con un claro ganador.Después de hacer esta evaluación, lo más seguro es que note por lo menos un tema destacado.No vale con solamente apuntar la información. Debe empezar con este tema. Y recuerde. Si no actúa, se estanca.Sarah Peterson es la autora de Unsetlle.org, dónde anima a la gente a nunca estancarse con trabajos que no les gustan. Apúntese a su curso gratuito para encontrar la idea perfecta de negocio y estilo de vida. Así podrá ganar en libertad y flexibilidad y ejercer el trabajo qué quiere.Este artículo fue originalmente publicado en unsetlled.orgConstruya su marcaCuando las personas ven su marca o nombre constantemente en sitios autorizados, se crea un efecto de halo. Comenzarán a verte como autoritario también.Además, debido al simple efecto de exposición, las personas que ven su marca con más frecuencia tienen más probabilidades de comprar su producto en el futuro.Sindicación de contenido vs. reutilización vs. blogging invitado¿Cual es la diferencia?ReutilizaciónLa reutilización de contenido es cuando encuentra un nuevo uso para su contenido existente.Por ejemplo, es posible que desee convertir un video que produjo en una publicación de blog o viceversa.Hacemos eso con bastante frecuencia aquí en Ahrefs. Como ejemplo, reutilizamos nuestra publicación en video SEO en un video:https://www.youtube.com/watch?v=BObU_VCwnvYGuest bloggingLos blogs invitados son cuando creas una pieza de contenido completamente nueva para un sitio específico.Aquí hay uno que publiqué recientemente en SmartBlogger:Tenga en cuenta que escribí esto específicamente para este sitio. No lo publiqué en ningún otro lado.Sindicación de contenidoLa sindicación de contenido es más una táctica de distribución que cualquier otra cosa. Se publica algo en su sitio web y se vuelve a publicar palabra por palabra en otro lugar.Eche un vistazo a estas dos publicaciones, por ejemplo, son las mismas:Esto es lo que hace que la sindicación de contenido sea una táctica de distribución escalable. No tiene que perder tiempo reutilizando o reescribiendo para llegar a una nueva audiencia.¿Cómo afecta la sindicación de contenido al SEO?Algunas personas temen que la distribución de su contenido cause problemas de contenido duplicado y resulte en una penalización de Google.Hay cierta lógica detrás de esta idea, ya que duplicar contenido en dominios puede ser una táctica de spam, que Google señala aquí:En algunos casos, el contenido se duplica deliberadamente en todos los dominios en un intento de manipular las clasificaciones de los motores de búsqueda o ganar más tráfico. Prácticas engañosas como esta pueden resultar en una experiencia de usuario deficiente, cuando un visitante ve sustancialmente el mismo contenido repetido dentro de un conjunto de resultados de búsqueda.Pero Google también entiende que el contenido a menudo aparece en más de un sitio por razones legítimas, como es el caso de la sindicación de contenido.No estás intentando manipular los resultados y clasificar tu contenido varias veces; solo intentas atraer más la atención de tu contenido al acceder al público de otros sitios.Google ha desarrollado formas de explicar esto y ha confirmado que no existe una penalización por contenido duplicado.¿Sabías que Google no tiene una penalización por contenido duplicado, pero tener muchas URL que sirven el mismo contenido reduce el presupuesto de rastreo y puede diluir la señal ? pic.twitter.com/3sW4PU8hTi— Gary “鯨理／경리” Illyes (@methode) February 13, 2017Dicho esto, la distribución de contenido puede llevar a algunos problemas, como Google clasificando un sindicato sobre el original.Esto no suele suceder porque Google tiene algoritmos para identificar duplicados, agruparlos e identificar el original, que luego clasifica para los términos relevantes.Los problemas solo ocurren cuando el algoritmo de Google identifica incorrectamente un duplicado como el original.En términos generales, esto rara vez ocurre a menos que sea un sitio pequeño que distribuye publicaciones grandes. Entonces, aunque no es una gran preocupación, es de tener en cuenta.La mejor manera de protegerse contra esto es hacer que el sindicato agregue un enlace canónico al original.Este enlace informa a Google que su página es la original y debe ser la que aparece en los resultados de búsqueda. También puede ayudar a mejorar las clasificaciones ya que todo el “valor de enlace” adquirido por la pieza sindicada se pasará al original.Cómo comenzar con la sindicación de contenidoSiguiendo estos tres pasos:Paso 1: crea contenido excelenteLas publicaciones generan dinero de la publicidad. Más visitas a la página significan más ingresos publicitarios.La sindicación les permite aprovechar el contenido que ya ha demostrado generar vistas, o al menos les permite apostar por un escritor que conseguirlo.Entonces, lo que falta en las publicaciones no es contenido gratuito, sino contenido excelente.Por lo tanto, para ser sindicado, debe sentar las bases y crear contenido notable.¿Cómo? Es un artículo completo en sí mismo, pero este video debería llevarlo por el camino correcto:https://www.youtube.com/watch?v=Ml4mQJjgX6gPaso 2: Encuentre posibles sindicatosUna vez tenga una buena reputación para creando contenido, necesitará encontrar sitios dispuestos a volver a publicarlo.Aquí hay un par de formas de encontrarlos:A. Usando GoogleSi las publicaciones tienen contenido sindicado de otros, es más probable que sean receptivos a volver a publicar contenido suyo.Por lo general, estas publicaciones se vinculan a los artículos originales usando algunas frases similares, como:Republicado con permisoOriginalmente apareció enPublicado originalmente enPuede aprovechar eso combinando frases con operadores de búsqueda de Google para encontrar oportunidades de sindicación.Por ejemplo, puede buscar \"Apareció originalmente en” + [tema] para encontrar sitios que hayan publicado contenido anteriormente.También puede instalar la barra de herramientas SEO de Ahrefs para detectar rápidamente sitios relevantes y de autoridad (alta calificación de dominio) donde desee distribuir contenido.Esta táctica también es útil si tiene una publicación en mente, pero no está seguro de si publican contenido sindicado. Puede resolver esto haciendo una búsqueda de huella + site:domain.com.B. Use el Explorador de sitiosSi ya ha visto el contenido de un autor sindicado en un par de sitios, es probable que también se esté distribuyendo a otros lugares.Para encontrarlos, pegue el sitio del autor en el Explorador de sitios de Ahrefs, vaya al informe de enlaces externos, luego ingrese una de las huellas de arriba en el cuadro “Incluir”. Esto mostrará los sitios que han vuelto a publicar contenido de su dominio de destino.Anote los sitios relevantes y populares a los que quizás desee sindicar contenido.Paso 3: Contácte y negocieEncuentre el nombre y la dirección de correo electrónico del propietario o editor del sitio web, luego comuníquese y pregunte si estarían dispuestos a sindicar su contenido.Solo recuerde que los sitios grandes tienen diferentes periodistas para diferentes temas, así que asegúrese de investigar y comunicarse con la persona adecuada.Sindicación pagada y propiaLlegar a las publicaciones y pedirles que vuelvan a publicar su contenido no es su única opción. También puede pagar por la sindicación, o pedir una sindicación propia.Sindicación pagadaLa sindicación pagada es cuando gasta dinero para colocar su contenido en grandes publicaciones.Por ejemplo, plataformas como Outbrain y Taboola colocan enlaces a su contenido al final del contenido editorial, generalmente en publicaciones notables como The Guardian.Nota al margen. Outbrain y Taboola se fusionaron recientemente para formar una compañía. Si está familiarizado con los anuncios de Facebook, le complacerá saber que configurar una campaña de distribución paga es relativamente similar. Regístrese, elija los objetivos de su campaña, el presupuesto, a dónde desea apuntar, etc.Configuración de la campaña OutbrainAuto-sindicaciónLa sindicación automática es cuándo republica su contenido en otros sitios web usted mismo.Hay algunos lugares donde puede hacer esto:A. MediumMedium es una publicación online muy popular donde cualquiera puede contribuir. Obtiene unas 39 millones de visitas mensuales estimadas sólo de búsqueda orgánica.Pero no tiene que publicar contenido nuevo aquí; puede sindicar contenido existente.Para hacer esto, haga clic en su foto de perfil y vaya a Historias> Importar una historia> Pegar en la URLTodo se importa en segundos, completo con imágenes y formato. Medium también agrega un enlace canónico al original.B. LinkedInSi bien puede compartir un enlace directo a su publicación en la plataforma, puede obtener más atención sobre su contenido al volver a publicar directamente en LinkedIn.Para hacer esto, haga clic en “Escribir un artículo” y copie y pegue su contenido:Cuando hice esto anteriormente para mis artículos, obtuve una cantidad decente de visitas:C. RedditReddit es otro lugar popular donde cualquiera puede publicar. El problema es que a los usuarios no les agrada la autopromoción descarada.Con eso en mente, su mejor opción es volver a publicar su publicación palabra por palabra en un subreddit relevante, y vincular a la fuente al final.No intente calzar enlaces promocionales o afiliados, esa es una forma segura de ser expulsado.Más allá de la sindicaciónNo está limitado a sindicar a otros sitios para promocionar su contenido. Dado que lleva tiempo y esfuerzo crear un artículo sobresaliente, debe trabajar para que cada una dé un paso más.Hay dos formas de hacer esto: reformatear o astillar.ReformateoReformatear significa convertir su artículo en un nuevo formato, como un video o un podcast.Hay dos razones para hacer esto:Como nadie quiere leer, puede llegar a un público más amplio que prefieren mirar o escuchar.Nuevos formatos significan nuevas oportunidades de sindicación. Por ejemplo, puede sindicar videos a YouTube y Facebook, y podcasts a Soundcloud, Spotify y Google Podcasts.AstillarUn solo artículo puede contener toneladas de consejos únicos e individuales. Extraiga estos “fragmentos de sonido” y reutilícelos en otro lugar.Por ejemplo, regularmente convertimos nuestras imágenes únicas en consejos “merienda” en Twitter:¿Cuántas páginas web obtienen tráfico de búsqueda orgánica?Tomamos toda la base de datos de nuestra herramienta Content Explorer (más de mil millones de páginas) y estudiamos cuántas páginas obtienen tráfico de la búsqueda orgánica. pic.twitter.com/ouwpJuoFOF— Ahrefs (@ahrefs) February 10, 2020Y dado que ya formateamos nuestros artículos en videos, también vamos más allá al dividir los videos en versiones pequeñas que volvemos a publicar en Twitter:🔑Consejo de investigación de palabras clave: buscar palabras clave para las que los foros están clasificandoLos foros con alto tráfico de búsqueda, especialmente los de nicho relevantes, son una mina de oro para las ideas de palabras clave. pic.twitter.com/FVAbTfHVFu— Ahrefs (@ahrefs) February 18, 2020¿Quieresacar aún más partido?Distille estas “mini ideas” en publicaciones únicas para invitados, que luego puede lanzar a otros sitios.Las posibilidades son infinitas. Todo lo que necesita es un poco de creatividad.Si desea más ideas para dividir y reutilizar contenido, lea esta publicación para ver cómo lo hace GaryVee.ConclusiónSi ha pasado tiempo creando una gran pieza de contenido, no se limite en presionar “publicar”.En su lugar, distribuya su contenido para llegar a nuevas audiencias en otras plataformas y publicaciones, y para aumentar el conocimiento de la marca.¿Nos perdimos algo importante en esta guía? Avíseme en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Sindicación de contenido: qué es y cómo comenzar"
    },
    {
      "level": "H2",
      "text": "¿Qué es la sindicación de contenido?"
    },
    {
      "level": "H2",
      "text": "Los beneficios de la sindicación de contenido"
    },
    {
      "level": "H3",
      "text": "Obtener tráfico de referencia"
    },
    {
      "level": "H3",
      "text": "Obtenga suscriptores de correo electrónico"
    },
    {
      "level": "H3",
      "text": "Construya su marca"
    },
    {
      "level": "H2",
      "text": "Sindicación de contenido vs. reutilización vs. blogging invitado"
    },
    {
      "level": "H3",
      "text": "Reutilización"
    },
    {
      "level": "H3",
      "text": "Guest blogging"
    },
    {
      "level": "H3",
      "text": "Sindicación de contenido"
    },
    {
      "level": "H2",
      "text": "¿Cómo afecta la sindicación de contenido al SEO?"
    },
    {
      "level": "H2",
      "text": "Cómo comenzar con la sindicación de contenido"
    },
    {
      "level": "H3",
      "text": "Paso 1: crea contenido excelente"
    },
    {
      "level": "H3",
      "text": "Paso 2: Encuentre posibles sindicatos"
    },
    {
      "level": "H4",
      "text": "A. Usando Google"
    },
    {
      "level": "H4",
      "text": "B. Use el Explorador de sitios"
    },
    {
      "level": "H3",
      "text": "Paso 3: Contácte y negocie"
    },
    {
      "level": "H2",
      "text": "Sindicación pagada y propia"
    },
    {
      "level": "H3",
      "text": "Sindicación pagada"
    },
    {
      "level": "H3",
      "text": "Auto-sindicación"
    },
    {
      "level": "H4",
      "text": "A. Medium"
    },
    {
      "level": "H4",
      "text": "B. LinkedIn"
    },
    {
      "level": "H4",
      "text": "C. Reddit"
    },
    {
      "level": "H2",
      "text": "Más allá de la sindicación"
    },
    {
      "level": "H3",
      "text": "Reformateo"
    },
    {
      "level": "H3",
      "text": "Astillar"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Si Quan Ong"
}