{
  "url": "https://ahrefs.com/blog/es/tacticas-marketing-digital/",
  "slug": "tacticas-marketing-digital",
  "title": "13 tácticas de marketing digital que funcionan",
  "description": "Si tienes un presupuesto de marketing limitado, la web es uno de los mejores sitios para promocionar un producto o un servicio. Te contamos 13 ideas de tácticas de marketing digital para aprovechar este potencial.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido Si tienes un presupuesto de marketing limitado, la web es uno de los mejores sitios para promocionar un producto o un servicio. Las dos razones principales son: (1) la web te ofrece tráfico de bajo coste o incluso gratuito, y (2) hay muchas oportunidades de promocionarse a través de las web y perfiles de redes sociales de otras personas. Debajo encontrarás 13 ideas para aprovechar este potencial.1. Escribe blog posts que se posicionan y convierten Los artículos de blog que se posicionan y convierten son los que lo hacen de forma simultánea:Consiguen un posicionamiento alto en los motores de búsqueda para las cosas que la gente busca: Esta es la parte que genera tráfico de forma gratuita.Destacan tu producto/servicio como la solución: Esta es la parte en la que puedes convertir a los visitantes de la web en clientes.Por ejemplo, nuestra guía sobre keyword research se diseñó para explicar cómo resolver el problema del título usando Ahrefs. Al conseguir un posicionamiento alto en términos relevantes como “cómo hacer investigación de palabras clave” y “análisis de palabras clave en SEO”, nos aporta tráfico gratuito.Para obtener tráfico orgánico gratuito a tu web, necesitas un tema con potencial de tráfico de búsqueda. Sigue estos pasos:Dirígete al Explorador de palabras clave de Ahrefs y escribe palabras o frases relevantes para tu nicho. También puedes elegir un país en el que quieras posicionarte en uno de los 10 motores de búsqueda.Abre la pestaña del Términos que concuerdan.Obtén ideas de palabras clave en la columna del potencial de tráfico (TP).Si la lista es demasiado larga para administrarla, puedes usar filtros como Dificultad de palabra clave (KD) o palabras clave con intención informativa (“cómo”, “qué”, “guía”, etc.).A partir de ahí, prioriza las palabras clave en función de su capacidad para presentar tu producto de forma natural. Aquí tienes un sistema de puntuación que puedes utilizar:2. Posicionar vídeos en las búsquedasEl SEO y el marketing de vídeo son un power couple: proporcionan uno de los tipos de contenido más atractivos con una fuente de tráfico gratuita. Vídeos de YouTube en la primera página de Google.Para esta técnica, necesitas ideas sobre temas de vídeo que obtengan tráfico de búsqueda en Google.Abre el Site Explorer y escribe “youtube.com”Dirígete al informe de Palabras clave orgánicas, allí obtendrás las palabras clave en las que los vídeos de YouTube se posicionan en las SERP (páginas de resultados de los motores de búsqueda)Usa filtros para encontrar vídeos que sean relevantes para tu webPRO TIPSi encuentras un tema con el que ya estás posicionado, todavía mejor. Si también consigues posicionar el vídeo, puedes “duplicar” la demanda de búsqueda.3. Mantén la tasa de envío de email en buena forma Hoy en día, una de las mejores formas de convencer a alguien para que se suscriba a tu newsletter es prometerle algo como esto: La razón es obvia: el email tiene mala reputación por todas estas décadas de spam y técnicas de venta agresivas.Los marketers tampoco quieren enviar emails que la gente no quiera. Lo único que haría es dañar su “reputación de remitente de email” y conduciría a una menor tasa de envío. Incluso pueden ser expulsados de su programa de email marketing.Para no pillarse las manos, los marketers tienen que vigilar estas métricas:Número de emails enviadosTasa de bajasQuejas de spamTasas de reboteMétricas de engagement (tasas de apertura bajas, respuestas, reenvíos, clics)Por ello, algunos de los mejores consejos (y al mismo tiempo los más contraintuitivos) sobre el email marketing son:Envía menos emails: envía solo cosas relevantes que prometiste enviar con la frecuencia prometida. Algunas excepciones son aceptables, pero rara vez la gente envía más de un email por semana.Elimina las direcciones de email inactivas de tu lista: aunque hayas trabajado duro para conseguir estos emails, te arriesgas a tener un índice de participación bajo y a que alguien acabe dándose de baja.4. Escribe guest postsCuando hablamos de guest posts (también conocidos como artículos de invitado) hablamos de artículos que se publican en otras webs. Algo que genera ciertos beneficios:Obtienes un boost en el tráfico de tu web.Expones tu marca a una nueva audiencia.El enlace obtenido contribuye a tu perfil de backlinks y puede impulsar tu SEO.Puedes hacer nuevas conexiones en la industria.Por otro lado, el que publica estos guest posts obtiene el beneficio de conseguir contenidos gratuitos de calidad para sus lectores. Por lo que no hay que sentirse incómodo a la hora de enviar tus artículos.Se pueden encontrar oportunidades de guest posts simplemente buscándolas en Google. Puedes utilizar operadores de búsqueda para obtener resultados más relevantes. Por ejemplo, (viajes OR moda) AND (\"guest post\" OR \"autor invitado\") .Es más fácil con la barra de herramientas SEO de Ahrefs o con cualquier plan premium de Ahrefs. Ahí ya puedes investigar qué oportunidades puedes encontrar a medida que las buscas en Google con la ayuda de métricas SEO como Domain Rating (DR) o el tráfico orgánico del sitio web.Lecturas complementariasGuest Blogging para SEO: Cómo construir enlaces de alta calidad en escalaBlogger Outreach: cómo hacerlo a escala de forma sencilla5. Propuestas para podcasts y newslettersLos podcasts y las newsletters son los sitios perfectos en los que las empresas pueden aparecer.Los podcasts suelen entrevistar a empresarios, directivos y otros profesionales.Las newsletters no escatiman en publicar buenos artículos procedentes de empresas.Algunos de ellos promocionan directamente productos de “eficacia probada”.Puedes encontrar podcasts y newsletters a los que les puedas enviar una propuesta de la misma forma que lo harías con un guest post. (Véase la sección anterior).Además, existe la posibilidad de que alguien ya haya hecho una lista de sitios a los que le puedas hacer un pitch. Intenta buscar en Google cosas como \"los mejores podcasts de [tu nicho]\".Aparecer en podcasts y newsletters no suele costar nada. Aunque suele haber una opción de pago.Dependiendo de tu presupuesto, puedes patrocinar un par de episodios y hacer lo mismo en varios podcasts/newsletters.Por nuestra propia experiencia, hemos descubierto que es una técnica eficaz para generar conocimiento de marca. Algo que a la larga sale rentable. Puedes leer más sobre nuestras experiencias con la publicidad en podcasts en este artículo.6. Pide a bloggers y revistas que opinen sobre tu productoLo más probable es que encuentres muchas oportunidades para que hagan reviews sobre tu producto.La gente busca reviews de marcas que le interesan o incluso en las que confía (la gente necesitas la opinión de otra persona antes de comprar, las cosas como son).La gente busca el mejor producto o servicio en una categoría determinada, independientemente de la marca.La gente incluso le hace a Google las mismas preguntas que le haría a una persona real.Además de buscar reseñas de productos similares en Google o YouTube, puedes verificar de dónde obtuvieron tus competidores las suyas. La razón es muy sencilla: opinar sobre productos similares demuestra neutralidad en la opinión.Puedes encontrar oportunidades que se ajusten a tus necesidades analizando los backlinks:Introduce la URL de tu competidor en el Site Explorer de AhrefsDirígete al informe de EnlacesEstablece el filtro “Palabra o frase” y escribe “review” o “reseña”Haz clic en “Mostrar resultados”En la página de resultados, cambia el desglosado de “Agrupar similares” y selecciona “Un enlace por dominio” para obtener una lista de webs que muestran los productos de tu competenciaDe cara al futuro, la parte importante del proceso es la propia propuesta en sí. Aquí tienes algunos consejos para enviar tu propuesta de review:Envía mensajes personalizados.Cuenta un poco sobre tu empresa.Envía solicitudes a través del canal de contacto proporcionado. Es una señal de que has leído las pautas de revisión y respetas a los revisores.Explica quién es el target del producto y por qué su audiencia estaría interesada.Proporciona un paquete de medios completo con imágenes, vídeos y especificaciones técnicas (si corresponde). Lo que también puede ser efectivo es ofrecer una demo online en directo.Muestra en qué sitios ya se ha presentado tu producto. También puedes compartir testimonios de tus clientes.7. Responde a las peticiones de los periodistas para conseguir prensa gratuita¿Te has preguntado alguna vez de dónde sacan los periodistas todas esas citas de expertos?Algunas de ellas proceden de servicios como HARO (Help a Reporter Out), donde los periodistas se limitan a publicar solicitudes de citas. Este método es muy útil para conseguir un enlace con un DR (Domain Rating) alto, además del beneficio de conseguir brand awareness de forma gratuita.Todo lo que tienes que hacer es registrarte en un servicio tipo HARO, SourceBottle o Terkel. Según encuentres algo que te encaje responde lo antes posible.Al utilizar estos servicios, es posible que recibas muchos emails. Te recomendamos usar filtros para la gestión:Aprende más: Digital PR: la guía para principiantes de PR para hacer que tu marca no pase desapercibida8. Aprovecha el contenido generado por la gente en las redes socialesLas redes sociales son tierras “tenebrosas” para las marcas, siendo LinkedIn la excepción.Las marcas pueden publicar anuncios y prestar servicios de atención al cliente. Pero el principal reto de las redes sociales es tener algo que decir de forma constante.Una de las mejores soluciones es publicar contenidos generados por los usuarios (CGU).Es un tipo de contenido natural para todos los tipos de plataformas de marketing social, porque se supone que las redes sociales tratan de personas, no de empresas.Puedes publicarlo con regularidad.Es una forma de promoción eficaz y no intrusiva.Amplifica el boca a boca porque da de qué hablar. Los autores del contenido contarán a sus amigos que una marca interesante ha compartido su contenido. Otros usuarios empezarán conversaciones con los propios autores.Aquí hay unos ejemplos. Ten en cuenta que todos presentan el producto de una forma u otra: View this post on Instagram A post shared by GoPro (@gopro)We teamed up with Fender artists to share their favorite riffs, techniques and tips. This week, Bassist @ramielabidin shows the ins and outs of walking basslines. Watch the full episode here: https://t.co/3LVKwzZh6o pic.twitter.com/U939TYUzr5— Fender (@Fender) August 21, 2022Casi todo este contenido se producirá de forma orgánica. Alguien publicará una foto o un vídeo etiquetando tu marca. Ahí ya puedes volver a publicarlo en tu canal pidiendo permiso a esa persona. De esta forma, lo mismo encuentras algunos ambassadors de tu marca.También puedes fomentar UGC de esta forma:Organiza un concurso. Puede ser un concurso en el que la persona con la mejor foto gana (se pueden usar los likes como votos).Lanza un hashtag oficialOfrece algo a cambio. Ejemplos: un obsequio, un código de descuento, etc.La regla general es que el contenido que publiques tenga una faceta humana por así decirlo. Aquí te dejamos algunas opciones interesantes:Opción 1: Muestra a la gente que hay detrás de la empresa y su trabajo. Esto funciona muy bien para artesanos y artistas. View this post on Instagram A post shared by Robert Dudzic (@robertdudzic)Opción 2: Dale personalidad a tu cuenta de redes sociales. No seas otra empresa aburrida.I love me some @Wendys frys #ChooseHotAndCrispy— Marie ehlers (@marierose112680) August 3, 2022I blew through all my #dalle2 credits to make this,but you’re worth it.I #ChooseHotAndCrispy 💝💍 pic.twitter.com/YqVzjqP3rV— ➖Dustin Miller➖ (@spdustin) August 3, 2022Jr. Cheeseburger, 4 PC Nugg (Crispy OR Spicy) Jr. Fry, and a drink—and it’ll only cost you 4 bucks. #WendysHotandCrispy— Wendy’s (@Wendys) August 3, 20229. Prueba las redes de marketing de afiliados para comerciantesEn el marketing de afiliados, el comerciante es la empresa o persona que ofrece algo a la venta. En este tipo de marketing, tú dejas que otras personas (afiliados) promocionen tu producto a cambio de una parte de los beneficios de las ventas que te han ayudado a generar.El marketing de afiliados requiere muy poca inversión inicial. La mayoría de los costes se basan en el rendimiento (sólo pagas si ganas dinero), por lo que puedes empezar prácticamente sin riesgos.Es posible crear tu propio programa, pero puede requerir bastante trabajo y una marca establecida para atraer afiliados. View this post on Instagram A post shared by Kat: Chief Excel Officer (@miss.excel)La forma más fácil de empezar con este tipo de marketing es unirse a una red como ClickBank, ShareASale, o GiddyUp. Son redes que proporcionan la tecnología… y los afiliados también.Simplemente configura tu perfil, rellena la información de tu producto y te podrán descubrir los influencers de tu nicho. Aunque también puedes seleccionar aquellos con los que te gustaría trabajar (según lo que ofrezca su red).A partir de ahí, los afiliados están listos para incluir tus productos en su contenido (si creen que merece la pena recomendarlo). Por ejemplo, aquí hay un artículo sobre la creación de un estudio de grabación en casa por Musician on a Mission. Según podemos comprobar en el Site Explorer, este artículo recibe unas 10.000 visitas orgánicas (y probablemente esta no sea la única fuente de tráfico para este artículo). Definitivamente hay potencial en el marketing de afiliación.10. Crea contenido link baitContenido link bait no es lo mismo que clickbait. El link bait es un contenido diseñado para atraer backlinks. Es algo tan valioso e interesante que los blogueros y periodistas quieren enlazarlo.Ejemplo: Este informe sobre side hustles en Estados Unidos de Zapier es una investigación de 637 palabras que obtuvo 804 backlinks con algunos DRs muy altos.Hay dos beneficios principales del contenido link bait:Los backlinks obtenidos ayudarán a que el contenido link bait se posicione mejor en las SERPs (ya que los backlinks son un factor clave de posicionamiento).Puedes distribuir parte de la autoridad de enlace del link bait a otras páginas y ayudarles a posicionarse mejor en las SERPs.La forma más fácil de identificar contenido que merezca enlaces es ver qué páginas atraen más backlinks en webs de prestigio de tu nicho.Introduce el dominio de tu competidor en el Site Explorer de AhrefsDirígete al informe Mejor por enlacesBusca patrones como la repetición de tipos de contenidos. También puedes buscar contenidos que funcionen bien y recrearlos.Puedes profundizar aún más y saber qué partes del contenido atrajeron más backlinks.Abre el informe de Texto anclaFíjate en el anclaje que obtuvo el mayor número de dominios de referenciaObtén más información: ¿Qué es el link bait? 7 ejemplos de éxito11. Reutiliza contenidoLa reutilización de contenidos te permite sacar más partido a tus contenidos compartiéndolos en otros canales de marketing y en otros formatos. Es un poco como franquiciar el contenido: un libro se convierte en una película, luego en un videojuego, después en una serie en Netflix, etc.Para ilustrar, nuestro post sobre verificación de SEO recibe unas 4.400 visitas de Google cada mes.Además, reutilizamos el artículo en un vídeo que nos ha dado 224.000 vistas adicionales en YouTube (sin mencionar los likes y los comentarios).Hay muchas opciones de como reutilizar el contenido con una ligera transformación:Blog posts como hilos de TwitterBlog posts como vídeo (y viceversa)Agrupar vídeos individuales y hacer un curso completoEbooks desglosados en campañas de emailExtractos de libros electrónicos como artículos de invitadoEntre otros.Tenemos una guía completa sobre la reutilización de contenidos. Puedes usarla para inspirarte para ver cómo puedes reutilizar tus contenidos.PRO TIPA la hora de convertir tus contenidos de texto en vídeo, puedes dar prioridad a los temas que obtienen tráfico de búsqueda en Google. He aquí cómo encontrarlos:Dirígete al Site Explorer e introduce tu dominioAbre el informe de Brecha de contenido (también puede salir como Content gap)En los dos primeros campos de entrada, introduce tu dominio y youtube.com. Deja la última entrada en blancoHaz clic en “Mostrar palabras clave”En la página de resultados, configura los filtros en 2 targets. De esta forma, la página de resultados mostrará las palabras clave en las que tu web y YouTube se posicionanPuedes utilizar los filtros para obtener una lista más precisa. Por ejemplo, recuento de palabras a partir de 2, volumen a partir de 500, palabras clave que incluyan “seo”Para ilustrarlo, el informe Content gap nos muestra que potencialmente podemos crear un vídeo sobre cómo hacer “SEO en los vídeos de YouTube”.12. Amplifica tu contenidoCrear contenidos que sean buenos es sólo una parte del trabajo. Hay que promocionarlos.Parece algo obvio, pero la falta de promoción (o de canales de distribución) es un problema bastante común en el marketing de contenidos. Los marketers tienden a acabar con mucho contenido que nadie conoce.Que la gente vea el contenido y hacerlo de forma eficaz depende de la plataforma que utilices para su promoción. Es decir, compartir el tipo de contenido que la gente espera ver y en su formato adecuado.Por ejemplo, supongamos que has creado un curso online de pago sobre fotografía. Aquí tienes los pasos que puedes dar para promocionar este curso. Puedes:Crea una serie de posts que enlacen al curso para que puedas obtener tráfico gratuito de Google. Por ejemplo, “mejores fondos fotográficos” o “fotografía de coches”.Escribe un guest post para una revista de fotografía donde puedas mencionar tu curso.Utiliza Instagram y/o Pinterest para enseñar muestras de fotos hechas con las técnicas explicadas en el curso.Utiliza TikTok para mostrar lo más destacado del curso. Es decir, compartiendo pequeños consejos digeribles que puedan demostrarse en pocos segundos.Reinvierte parte de los ingresos del curso en comprar anuncios en Pinterest. Todavía es muy barato comprar anuncios en la red social (en comparación con otras grandes plataformas), y es muy buena en cuanto al contenido visual.Comparte la sección para principiantes de tu curso de forma gratuita en YouTube. Puedes anunciarlos en YouTube. Echa un vistazo al hilo de abajo para aprender más a cómo hacer conseguir un buen retorno de tus YouTube Ads.If you create YT tutorials that feature your product, consider spending 💰 on ads. Doesn’t have to be a lot. In July, we spent 154.62 SGD (~112.75 USD) for 174.8 hours of watch time (10,488 minutes).That’s $0.01/min or $0.65/hour. Name a cheaper medium for relevant/focused attn— Sam Oh (@samsgoh) August 16, 2020Lecturas complementarias13 técnicas de promoción de contenido para dirigir más atención a tu contenidoGuía de distribución de contenido: qué es y cómo hacerlo13. Crear un lead magnet Un lead magnet (en otras palabras, un “imán de clientes potenciales”) ofrece algo valioso al visitante de una web a cambio de su información de contacto. Cuando el visitante proporciona esta información, se convierte en un cliente potencial.Algunos ejemplos populares de lead magnets son las pruebas gratuitas, las herramientas online, las plantillas, checklists, ebooks, las consultas gratuitas, los cursos, los descuentos… te puedes hacer una idea.Disponer de la información de contacto de un cliente potencial te permite una comunicación directa, de forma que puedes “nutrir” esta relación y, quizá, se convierta en un cliente o seguidor de la marca. Es una técnica básica para productos o servicios en los que los clientes necesitan más tiempo para investigar sus opciones y tomar una decisión. Lo primero que tienes que tener en cuenta es encontrar un tema para tu lead magnet. Esto puede ser algo que muestre un potencial de tráfico orgánico o que le interese a tu audiencia.Un beneficio notable del primer tipo es que te permite obtener tráfico gratuito de los motores de búsqueda. Puedes encontrar ideas de lead magnets con una herramienta de investigación de palabras clave agregando algunos tipos de lead magnets comunes en los filtros.Para obtener más información sobre la búsqueda de temas para lead magnets y cómo dirigir el tráfico hacia ellos, puedes leer 17 ejemplos de lead magnets + consejos sobre temas y fuentes de tráfico.Reflexiones finales Algunos de los mejores sitios para buscar técnicas de marketing digital que funcionen son… otras webs, especialmente los de la competencia. Aquí tienes un par de herramientas de inteligencia competitiva para el trabajo:Ahrefs: para analizar las estrategias de SEO, marketing de contenido y anuncios de Google de cualquier webMailCharts: para análisis de marketing por emailBrand24: para análisis de redes socialesVisualping: para monitorear cambios en las webs¿Preguntas? ¿Dudas? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "13 tácticas de marketing digital que funcionan"
    },
    {
      "level": "H2",
      "text": "1. Escribe blog posts que se posicionan y convierten"
    },
    {
      "level": "H2",
      "text": "2. Posicionar vídeos en las búsquedas"
    },
    {
      "level": "H2",
      "text": "3. Mantén la tasa de envío de email en buena forma"
    },
    {
      "level": "H2",
      "text": "4. Escribe guest posts"
    },
    {
      "level": "H2",
      "text": "5. Propuestas para podcasts y newsletters"
    },
    {
      "level": "H2",
      "text": "6. Pide a bloggers y revistas que opinen sobre tu producto"
    },
    {
      "level": "H2",
      "text": "7. Responde a las peticiones de los periodistas para conseguir prensa gratuita"
    },
    {
      "level": "H2",
      "text": "8. Aprovecha el contenido generado por la gente en las redes sociales"
    },
    {
      "level": "H2",
      "text": "9. Prueba las redes de marketing de afiliados para comerciantes"
    },
    {
      "level": "H2",
      "text": "10. Crea contenido link bait"
    },
    {
      "level": "H2",
      "text": "11. Reutiliza contenido"
    },
    {
      "level": "H2",
      "text": "12. Amplifica tu contenido"
    },
    {
      "level": "H2",
      "text": "13. Crear un lead magnet"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}