{
  "url": "https://ahrefs.com/blog/es/tacticas-seo-black-hat/",
  "slug": "tacticas-seo-black-hat",
  "title": "6 Tácticas Arriesgadas de SEO Black Hat que Evitar en 2021 (Y Sus Alternativas White Hat)",
  "description": "Las tácticas SEO black-hat no merecen el riesgo. Aléjate de estas seis tácticas SEO black-hat y en su lugar sus alternativas white-hat.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido El SEO es un juego de guerra de suma cero.Es por eso por lo que algunos empresarios recurren a tácticas black-hat para desbancar a sus competidores de los primeros resultados de las SERPs.Aunque hay algunas tácticas SEO black-hat (de “sombrero negro”, una forma de decir que son malas prácticas) que claramente no deberías usar, como el hackeo (porque es ilegal), otras parecen menos arriesgadas, pero incluso esas que parece que podrían merecer la pena no son nunca una buena idea para negocios legítimos—así que deberías evitarlas a toda costa.En este artículo vamos a cubrir seis tácticas SEO black-hat y qué hacer en su lugar:Comprar enlacesKeyword stuffingSpam en comentarios de blogsArticle spinningSEO negativoSpam en fragmentos enriquecidos1. Comprar enlacesComprar enlaces quiere decir pagar a otra web para que enlace a tu sitio.El pago por enlaces puede ser económico, de bienes o servicios.Comprar enlaces es malo a muchos niveles: Es una violación de las Guías para Webmaster de Google. Google explica esto aquí. Puede llevar a una penalización de Google. Google penalizará tu sitio si te pillan vendiendo o comprando enlaces. Algunos SEOs se cuestionan cómo de bueno es el algoritmo de Google detectando enlaces pagados, pero la verdad es que están mejorando en esto. Así que, aunque puede que no los identifiquen, lo más posible es que algunos enlaces que compres en el mejor de los casos no tengan ningún efecto y, en el peor, afecten a tu posicionamiento. Los enlaces pagados son caros. 361.44$ de media, según nuestro estudio de 2018.En lugar de eso, ¿qué deberías hacer?Link outreach, es decir, contactar para conseguir enlaces.Esto es cuando creas un recurso de valor y después contactas al propietario de una web de la que quieres un enlace y le ofreces una razón convincente para que lo enlace.Una forma genial para empezar con esta aproximación es usar la técnica de la guinda del pastel:Crea un recurso útil.Encuentra páginas donde tu recurso sea un complemento.Presenta tu recurso a los propietarios de las webs.Vamos a ver un ejemplo…Pongamos que has creado una lista curada de plantillas de CVs. Esto es un recurso valioso, así que el siguiente paso es encontrar páginas a las que tu recurso les sirva como complemento. En este caso, pueden ser posts sobre “cómo escribir un cv”. Después de todo, una guía para escribir un CV está bien, pero una guía para escribir un CV con plantillas es seguramente mejor.Puedes encontrar estas páginas muy fácilmente en Content Explorer, una base de datos accesible de miles de millones de páginas web. Aquí tienes cómo:Ve a Content ExplorerBusca title:“tema” - “sobre qué es tu página”Activa el botón Una página por dominioPor ejemplo, si buscas title:“how to write a resume” -“templates” (“cómo escribir un cv” - “plantillas”) verás más de dos mil posts sobre escribir CVs que no mencionan nada de plantillas: Fácilmente puedes contactar a estos sitios y explicar que:Has llegado a su guía sobre escribir un CV.Te has dado cuenta de que no incluyen ninguna plantilla para que la gente empiece.Acabas de reunir una lista muy completa de las mejores plantillas de CVs en Internet.Tu recurso puede ser algo útil que añadir a su artículo.No todos te enlazarán, pero algunos sí (siempre que tu propuesta tenga sentido).2. Keyword stuffingKeyword stuffing, “relleno de palabras clave” o “exceso de palabras clave” es la práctica de repetir las mismas palabras clave (o frases similares) en tu contenido para manipular el posicionamiento.Allá por los años 90 esta táctica solía funcionar. Ya no.Keyword stuffing es una mala práctica SEO porque: Te hace sonar poco natural. Atiborrar con todas las keywords que puedas en tu contenido hace que tu redacción suene robótica y ridícula. Así que se convierte en fuente de rechazo instantánea para tus lectores. Puede llevar a una penalización de Google. Google dice que “llenar una página con palabras clave o números […] puede dañar el posicionamiento de tu sitio”, así que no te molestes salvo que quieras que tu posicionamiento se hunda.En lugar de eso, ¿qué deberías hacer?El antídoto para el keyword stuffing es el contenido coherente.Lo puedes crear de dos formas.Primero, escribe contenido en profundidad que cubra un tema de forma meticulosa. ¿El resultado? De forma natural incluirás la mayoría de expresiones y palabras clave de larga cola (long-tail) que las personas usan para hablar del tema.En segundo lugar, intenta cubrir subtemas que los usuarios quieren y esperan ver.Estas dos cosas pueden ayudar a que tu contenido posicione más alto porque Google no solo juzga el contenido en base a cuántas veces mencionas la consulta de la búsqueda. También mira si la página contiene otras palabras clave y contenido relevantes:Hay muchas formas de encontrar subtemas potenciales por cubrir, como:Buscar subtítulos habituales entre las páginas mejor posicionadas para la palabra clave objetivo.Hacer un brainstorming de temas relacionados con tu equipo.Comprobar la sección “otras preguntas de los usuarios” en las SERPs.Pero estos métodos son intensivos en trabajo.La forma más fácil y eficiente es realizar un análisis de content gap (brecha de contenidos) para tu página. Esto te muestra palabras clave en las que las páginas mejor posicionadas posicionan y tú no, algo que suele representar subtemas.Aquí tienes cómo se hace:Introduce tu URL en Site Explorer.En el menú de la izquierda, haz clic en Content Gap.Introduce las URL de 2-3 páginas parecidas de las que mejor posicionan para tu palabra clave objetivo en los campos.Realiza la búsqueda y busca keywords que representen subtemas.Por ejemplo, si hacemos esto para nuestra guía de guest blogging (autor invitado), vemos un par de palabras clave relacionadas con “guías”:Si miramos uno de los posts de las páginas mejor posicionadas, pronto vemos que estas palabras clave son relativas a consejos sobre revisar las guías de guest blogging antes de presentar tu propuesta:Revisa las Guías de Autor Invitado del SitioSé que tienes mejores cosas que hacer con tu vida que leer un listado de guías de guest posting.Lo pillo.Pero algunos bloggers tienen guías muy, muy específicas.Algunas están ahí para estandarizar sus posts.Otras están ahí para asegurarse de que la gente las lee.Omitimos esto en nuestro post. Puede merecer la pena añadirlo para conseguir un artículo más completo que (ojalá) derrote a nuestros competidores.3. Spam en comentarios de blogsEl spam en comentarios de blogs es cuando publicas comentarios irrelevantes en posts de blogs con el único objetivo de conseguir un enlace a tu web.Incluso si dejamos de lado lo molesto que es esto para los blogs que lo reciben, no es bueno para el SEO porque los enlaces de los comentarios de los blogs son casi siempre nofollow. Eso quiere decir que es extremadamente improbable que los enlaces te ayuden a posicionar.En lugar de eso, ¿qué deberías hacer?Escribe comentarios útiles en posts con tráfico alto.Hacer esto no llevará a enlaces de mayor valor que dejar comentarios spameros, ya que siguen siendo nofollow. Sin embargo, es más probable que la gente lea un comentario de valor y útil y haga clic para ir a tu web. Eso no lleva a beneficios directos SEO, pero la gente puede compartir tu contenido y terminar enlazándote—así que puede llevar a beneficios SEO indirectos.Aquí va una buena forma de encontrar páginas para dejar comentarios usando Content Explorer:Introduce un tema relevante.Cambia el modo de búsqueda a En el título.Realiza la búsqueda.Añade unfiltro de Tráfico de la página con el mínimo establecido en 100.Activa Excluir páginas de inicio.Busca posts de blog en los resultados con secciones de comentarios donde puedas añadir un contenido de valor.Por ejemplo, pongamos que eres un experto en dropshipping. Puedes buscar en Content Explorer “make money online” (ganar dinero online) y ver estos resultados:El post destacado tiene montones de tráfico orgánico y muchos comentarios:Este post es un candidato perfecto para un comentario potente que puede llevar tráfico a tu sitio.4. Article spinningEl article spinning, también conocido content spinning, consiste en tomar una pieza de contenido y reescribirla para crear muchas “nuevas” piezas de contenido.Las personas que hacen esto rara vez usan contenido de sus blogs. En lugar de eso, lo usan para crear muchos posts invitados “únicos” para publicar en varios sitios y conseguir enlaces rápida y fácilmente.El article spinning es malo para el SEO porque: Rara vez termina en un artículo interesante que leer. El contenido que nace del article spinning suele sonar poco natural y raro, por lo que solo es probable que sitios de baja calidad publiquen este tipo de post. Termina con enlaces de baja calidad. Porque solo los sitios de baja calidad suelen publicar este tipo de artículos, los enlaces que consigues rara vez tienen mucho valor SEO.En lugar de eso, ¿qué deberías hacer?Usa la técnica de la perspectiva para crear variaciones únicas de un post invitado desde distintas perspectivas. Por ejemplo, pongamos que escribes un post como invitado titulado “El futuro del link building”.Podrías cambiar fácilmente la perspectiva de ese post para crear varios posts como invitados únicos y de valor:La Técnica de la PerspectivaEl futuro del linkbuilding para: - Startups - Negocios locales - ONGs - Pequeños negocios - Sitios de ecommerce¿Supone esto más trabajo que el article spinning? Claro. Pero es mucho menos trabajo que escribir posts invitados en temas completamente no relacionados porque ya has hecho la mayor parte de la investigación y el trabajo duro para el post original.Incluso mejor, cambiar la perspectiva te ayuda a conseguir enlaces de una variedad más amplia de webs.Piensa en esto: “El futuro del link building para startups” difícilmente será atractivo para un blog de PYMEs, pero un post sobre “el futuro del link building para pequeñas empresas” lo será.También puedes aproximarte al mismo tema desde ángulos opuestos. Por ejemplo, pongamos que escribes un post sobre “X Beneficios del Link Building Para Startups”. Podrías darle la vuelta y escribir un post para otro sitio titulado “X Errores de Link Building que Cometen las Startups”.5. SEO negativoEl SEO negativo es una técnica deshonesta de intentar sabotear el posicionamiento de una web o páginas competidoras.El SEO negativo es malo porque: No es ético, a veces es ilegal. Las tácticas como dejar reviews negativas o bombardear a un competidor con enlaces de baja calidad son oscuras y poco éticas. Pero hackear y otras formas de ciberataques son, de forma bastante literal, criminales. Rara vez funciona. O al menos, ese es el caso para los tipos más comunes de SEO negativo: apuntar con enlaces de baja calidad a un sitio o página de la competencia. Google es bastante bueno identificando y descontando estos enlaces por completo. Como mucho puede ser una solución a corto plazo. Incluso si el SEO negativo funciona, otra página pronto llegará y desbancará tu página de baja calidad.En lugar de eso, ¿qué deberías hacer?Crea contenido que realmente se merezca posicionar—y demuestra ese hecho a Google.Esto es más fácil de decir que de hacer, pero normalmente hay dos ingredientes cruciales:Alinearse con la intención de búsquedaConseguir backlinksVamos a empezar con la intención de búsqueda…La intención de búsqueda es la razón detrás de una búsqueda. A menos que tu página se alinee con la intención de búsqueda y le ofrezca al usuario lo que está buscando, tus posibilidades de posicionar son entre escasas y ninguna.Puedes identificar la intención de búsqueda analizando las páginas mejor posicionadas para las tres Cs de la intención de búsqueda: Tipo de Contenido. ¿Son los resultados mejor posicionados posts de blog, páginas de producto, páginas de categoría u otra cosa? Sigue el ejemplo. Formato de Contenido. ¿Son la mayoría de resultados mejor posicionados listicles, tutoriales, piezas de opinión u otra cosa? Sigue el ejemplo. Ángulo del Contenido. ¿Tienen un ángulo en común los resultados mejor posicionados? Como “para principiantes” o “en 2021”. Sigue el ejemplo.Respecto a los enlaces, los necesitas—al menos si quieres competir por algo mínimamente competitivo.Lo sabemos porque Google dijo que los enlaces son uno de los tres principales factores de posicionamiento. Nuestro estudio de más de 1.000 millones de páginas también encontró una clara correlación entre el posicionamiento y los enlaces:​​Revisa los recursos de abajo para aprender más sobre conseguir enlaces para tus páginas.Lecturas complementariasLa Guía para Principiantes al Link Building9 Estrategias Fáciles de Link Building (Que Cualquiera Puede Usar)Caso de estudio de Linkbuilding: Cómo construimos backlinks con una página de “estadísticas”6. Spam en fragmentos enriquecidosEl spam de fragmentos enriquecidos es cuando haces un mal uso de datos estructurados para (intentar) sacar ventaja en las SERPs.El spam de fragmentos enriquecidos es malo porque: Puede llevar a una penalización de Google. Google dice que las páginas o sitios que violen sus guías de datos estructurados “pueden recibir un posicionamiento menos favorable”. También aplican acciones manuales a las páginas que descubren que contienen “datos estructurados engañosos”. Puede hacer que el fragmento enriquecido sea ilegible. Los fragmentos enriquecidos a menudo mejoran las tasas de clic en las SERPs. Eso es porque la gente las quiere, y por eso es por lo que el spam en fragmentos enriquecidos existe. Pero Google dice que tu página o sitio puede “marcarse como no elegible para resultados enriquecidos en la búsqueda de Google” si violas sus guías de marcado de datos estructurados. Rara vez funciona. Google es bastante bueno detectando datos estructurados spameros e irrelevantes hoy en día (al contrario que hace unos pocos años). Así que es improbable que veas fragmentos enriquecidos basados en marcado irrelevante o spamero en los resultados de búsqueda.En lugar de eso, ¿qué deberías hacer?Incluir datos estructurados precisos en tus páginas donde sea relevante siguiendo las directrices generales de datos estructurados de Google.Google dice que esto les ayuda a “entender el contenido de la página”.Seguir las reglas también aumenta tus posibilidades de ser incluido en funcionalidades especiales de resultados de búsqueda y mejoras.Revisa los recursos de abajo para aprender más sobre la implementación de datos estructurados y ganar fragmentos enriquecidos.Lecturas complementariasFragmentos enriquecidos: ¿qué son y cómo se consiguen?¿Qué Son los Datos Estructurados y Por Qué Deberías Implementarlos?¿Qué es el marcado Schema? Cómo usarlo para SEOReflexiones finalesLas tácticas de SEO black-hat no merecen el riesgo, así que aléjate de ellas.Pueden hacer que tu sitio sea penalizado y dañar la reputación de tu marca.Es mejor que te enfoques en alternativas de white-hat viables. Desde luego, las tácticas que he sugerido en esta guía necesitan más esfuerzo que las tácticas oscuras y rápidas. Pero la buena noticia es que funcionan y traen resultados duraderos.¿Alguna pregunta? Escríbeme por Twitter.Tra­duci­do por Iván Fanego, que analiza herramientas y tendencias en marketing y software y acaba de lanzar la guía de CRM en WhatsApp más completa. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "6 Tácticas Arriesgadas de SEO Black Hat que Evitar en 2021 (Y Sus Alternativas White Hat)"
    },
    {
      "level": "H2",
      "text": "1. Comprar enlaces"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "2. Keyword stuffing"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "3. Spam en comentarios de blogs"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "4. Article spinning"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "5. SEO negativo"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "6. Spam en fragmentos enriquecidos"
    },
    {
      "level": "H3",
      "text": "En lugar de eso, ¿qué deberías hacer?"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}