{
  "url": "https://ahrefs.com/blog/es/tacticas-generacion-leads/",
  "slug": "tacticas-generacion-leads",
  "title": "10 Tácticas de Generación de Leads Que Funcionan (Con Ejemplos)",
  "description": "Aprende 10 tácticas distintas de generación de leads que puedes usar como parte de tu estrategia de generación de leads.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido La generación de leads es el proceso de atraer, interactuar y captar el interés de tu mercado objetivo.Conseguir más leads es importante porque te da la capacidad de nutrir tu relación con clientes potenciales y acercarlos a la compra de tu producto o servicio.En este post, aprenderás 10 tácticas diferentes de generación de leads que puedes usar como parte de tu estrategia de generación de leads.Aquí van las tácticas de generación de leads:Convierte tu blog en una máquina de generar leadsEscribe como invitado en blogs para conseguir leadsCrea herramientas gratuitasAlíate con otras marcasLanza un evento virtualHaz giveaways (sorteos y concursos)Convierte tu página principal en un lead magnetEstablece un programa de referidosPosiciona vídeos en YouTubeRetargeting1. Convierte tu blog en una máquina de generar leadsEl artículo sobre cómo escribir una newsletter de Sumo recibe unas ~1.000 visitas estimadas de búsqueda:Dentro del artículo, Sumo ofrece una descarga gratuita:Dado que Sumo vende una herramienta de captación de emails, cualquiera que se descargue este recurso es un lead perfecto.Esta estrategia es la forma en la que puedes convertir tu blog en una máquina de captación de leads.Cómo hacerloPrimero, asegúrate de que tus artículos posicionen alto en Google para temas que tu mercado objetivo está buscando. Después, incluye una pieza de contenido como bonus a cambio de su información de contacto.a) Apunta a temas con un alto potencial de búsquedaNo puedes simplemente escribir sobre cualquier tema y esperar a posicionar. Para conseguir tráfico de búsqueda tienes que apuntar a temas con potencial de tráfico de búsqueda.¿Cómo encuentras estos temas?Empieza por introducir unas pocas palabras clave en Keywords Explorer de Ahrefs. Por ejemplo, si vendes máquinas de café online, puedes introducir términos como “coffee” (café), “espresso” y “french press” (prensa francesa). Después, ve al informe de Phrase match (concordancia de frase) y verás miles de palabras clave entre las que puedes elegir.Busca palabras clave tanto con tráfico como con potencial de negocio. En otras palabras, keywords que tu mercado objetivo probablemente esté buscando.b) Crea contenido que posicionePara llegar a las primeras posiciones de Google necesitarás crear contenido que merezca posicionarse. Mira este vídeo para aprender cómo:https://www.youtube.com/watch?v=8BdZ0dUu7VQc) Capta el interés de los lectores con un upgrade de contenidoSumo capta leads ofreciendo descargas gratuitas de contenido como bonus. En el mundo del marketing, llamamos a esto un “upgrade de contenido”. Puede ser una worksheet, una plantilla, un checklist, y más cosas.Pero fíjate en que no puedes adjuntar cualquier contenido como bonus. Fíjate con cuidado y verás que Sumo siempre ofrece un upgrade de contenido que es relevante para el artículo que el lector acaba de consumir. En el post de “cómo escribir una newsletter”, Sumo ofrece un archivo de ejemplos con ideas para newsletter—encaja perfectamente.Claro, podrías dar algo mucho más simple como una versión en PDF del post—pero esto rara vez será una oferta atractiva. Idealmente quieres dar algo tan valioso que suscribirse se convierta en algo obvio.Como mi amigo Nathan Collier escribe:“¡Me encantan los popups!”“¡¡Estoy tan emocionado por poder guardar este artículo en mi PCen PDF!!”Dijo nadie al leer tu artículo.Nunca.Si quieres jugar al juego de los content upgrades, da algo de valor. Una herramienta gratuita. Un mini-curso. Una entrevista que no pueda recibir en ninguna otra parte.No te limites a pasar a PDF tu artículo y creer que eso convertirá a la gente a tu lista.2. Escribe como invitado en blogs para conseguir leadsEl guest blogging es cuando escribes un post de blog para otro sitio web.Si te preguntas por qué deberías hacer esto cuando podrías publicar el post en tu propio sitio, la respuesta es fácil: puedes subirte a los hombros de la “autoridad” de un sitio grande para posicionar en temas competitivos y de alto volumen en los que te costaría posicionar con tu propio sitio. Después puedes convertir ese tráfico en leads enlazando a un upgrade de contenido desde el post invitado. Por ejemplo, Sarah Cy escribió un post post invitado para SmartBlogger y enlazó a su checklist gratuita:Con el post generando unas ~3.100 visitas de búsqueda estimadas al mes, casi seguro que Sarah está consiguiendo un número decente de leads al mes.Cómo hacerloPara empezar, encuentra sitios con autoridad para los que puedas escribir. Debería ser relativamente fácil si estás familiarizado con tu nicho. Si no, ve a Content Explorer de Ahrefs, introduce un tema general como “weight loss” (pérdida de peso) o “dieting” (dieta). Content Explorer es un mini buscador dentro de Ahrefs. Funciona gracias a nuestra base de datos de 5 mil millones de páginas y puedes usarlo para encontrar menciones a cualquier cosa en la web.Establece tu búsqueda a “En el título”. Añade un filtro de “Rating de Dominio” para ver solo webs con autoridad.Ve a la pestaña de “Websites” (Sitios web).Mira la lista y elige los sitios para los que te gustaría escribir.Después, deberías encontrar un tema que ofrecer que tenga potencial de tráfico. La forma más fácil de hacer esto es realizar un análisis de brecha de contenidos o content gap. Esto te mostrará temas por los que el sitio al que te estás presentando no posiciona, pero en los que otros sitios similares sí están posicionando.Introduce los otros sitios que has encontrado en la pestaña de “Sitios web” en la sección de arriba y tu sitio objetivo en la de abajo.Haz click en “Mostrar palabras clave” (“show keywords”).Revisa la lista y mira si hay algún tema adecuado sobre el que puedas escribir. Después, encuentra el email del editor y preséntale esos temas. En tu presentación, asegúrate de añadir que estos son los temas en los que otros sitios parecidos ya están posicionando, pero ellos no. Seguramente estén interesados.Lectura recomendada: Guest Blogging para SEO: Cómo construir enlaces de alta calidad en escala3. Crea herramientas gratuitasEl contenido escrito no es el único tipo de contenido que puedes crear y posicionar para generar leads. También puedes crear herramientas gratuitas. Esto es especialmente poderoso si eres un empresa de software como servicio (SaaS, o software as a service en inglés). Elimina algunas funciones de la versión de pago de tu herramienta y ofrécela gratis. Si alguien la usa, puedes estar seguro de que son 100% leads geniales.Por ejemplo, en Ahrefs ofrecemos montones de herramientas SEO gratuitas:Sin embargo, no te desanimes si no vendes software. Puedes crear una herramienta en la que resuelvas un problema relacionado con un servicio que ofrezcas o un producto que vendas. Por ejemplo, Crunch ofrece servicios de contabilidad y cuenta con una calculadora gratuita de pago de impuestos.Cómo hacerloAhora, “el secreto”. Ninguna de las herramientas gratuitas que hemos creado en Ahrefs han salido del aire. Fueron creadas porque tenían un potencial de tráfico de búsqueda. ¿Te suena familiar? Es exactamente la misma táctica que bloguear para generar leads.Lo que significa que la próxima pregunta es: ¿cómo encuentras estos temas?Empieza por introducir unas pocas palabras clave relevantes en Keywords Explorer de Ahrefs. Si eres un agente inmobiliario, estas pueden ser “mortgage” (hipoteca), “rent” (alquiler) y “down payment” (anticipo).Después, ve al informe de Phrase match (concordancia de frase) y añade palabras como calculadora, herramienta, herramientas y comprobadoren la caja de “incluya”.Pulsa en “cualquier palabra” (any word) y pulsa en “Aplicar”.Deberías ver una lista de herramientas relevantes que la gente busca. Elige la más relevante y crea tu herramienta.Aunque tu herramienta gratuita debería ser lo bastante potente para satisfacer a aquellos que la están usando, no olvides incluir un call-to-action (CTA o llamada a la acción) para animar a los que quieran más a registrarse. Por ejemplo, aquí puedes ver el CTA de nuestro comprobador de backlinks:Y aquí cómo es el CTA de la calculadora de pago de impuestos de Crunch:4. Alíate con otras marcasEn 2018 trabajamos con Buffer, una herramienta de programación de publicaciones en redes sociales, en un webinar llamado “How to Get Website Traffic With Evergreen Content and Social Media Marketing” (cómo conseguir tráfico a la web con contenido evergreen y marketing en redes sociales).https://www.youtube.com/watch?v=xn2XCFqREbUNo somos competidores. Pero ambos nos dirigimos a la misma audiencia: expertos en marketing digital.Hay muchos negocios por ahí que tienen la misma audiencia que quieres. Encuéntralos y colabora con ellos. Trabaja con ellos para crear contenido de valor para su audiencia. Puede ser un webinar, un eBook, un post para el blog, un vídeo de YouTube o incluso un curso. A cambio, recibes exposición ante su audiencia y puedes llevar tráfico a tu web.En nuestra alianza con Buffer decidimos que no teníamos que crear una oferta específica, ya que nuestra página principal estaba diseñada para explicar nuestro conjunto de herramientas y captar leads. Cualquiera que estuviera interesado en nuestro producto después del webinar podría buscar nuestra marca en Google y encontrarnos. Pero siéntete libre de crear una página landing específica para la colaboración si esa es tu estrategia.Tampoco tiene que ser siempre con otra compañía. También puedes trabajar con influencers. Mientras tengan la audiencia a la que te diriges, pueden ser un buen encaje.Lecturas complementariasCómo Encontrar Influencers en Tu Nicho (6 Sencillos Pasos)Marketing de Influencers: Una Guía Accionable5. Lanza un evento virtual¿Ya estás trabajando con otra marca en un webinar? Aquí va una idea: ¿por qué no ir más allá, trabajar con más marcas/influencers y crear un evento completo?En el mundo del marketing, estos se conocen como eventos virtuales. Escuché algo sobre ellos por primera vez en 2017. Fueron muy populares durante un tiempo, pero después murieron. Pero ahora, con las dificultades de mantener un evento en vivo, los eventos virtuales han vuelto a recuperar popularidad. Incluso nuestro Chief Marketing Officer (CMO, director de Marketing), Tim Soulo habló hace poco en uno:La idea básica es hacer crowdsourcing con el contenido de expertos y convertirlo en un recurso valioso para tu audiencia objetivo. Aquí va cómo funciona:Crea un evento relacionado con lo que vendes. Por ejemplo, si vendes servicios de link building, puedes crear un evento tipo “Outreach Virtual Summit” (evento virtual de contactos). Contacta a un grupo de influencers, entrevístalos y graba estas entrevistas.Pon una fecha para tu evento.Consigue que la gente se registre y asista al evento.Presenta las entrevistas grabadas en un período de 3—5 días.Cualquiera que se registre en tu evento está obviamente interesado en tu tema elegido. Y por tanto, serán leads geniales para tu negocio.Eventos como este pueden suponer tiempo de organización, pero generar cientos (o incluso miles) de leads con un solo evento no es raro. Es definitivamente mucho más fácil que organizar eventos físicos. Además, con herramientas de conferencias virtuales como Zoom y Podia disponibles hoy en día, crear un evento como este debería ser facilísimo. Aunque tenemos experiencia asistiendo y hablando en eventos virtuales, no tenemos experiencia organizando uno. Por eso, te dejo con algunos recursos geniales que te enseñarán cómo montar uno:Cómo Joe Slack Generó 10.000$ en Facturación y +500 Suscriptores de Email con un Evento Virtual Sencillo9 pasos para crear un evento virtual: 7.827 suscriptores y 55 entrevistasEvento Virtual: una táctica de autoridad y construcción de lista de email que tienes que probar6. Haz giveaways (sorteos y concursos)Hace unos pocos años, trabajaba en una startup donde vendíamos un producto desconocido: una chaqueta de masajes. Queríamos lanzar en Kickstarter y necesitábamos una lista de leads en la que nos pudiéramos promocionar… Rápido. Ahí es dónde nos encontramos con los giveaways. Cuando se hacen bien, los giveaways son una táctica poderosa de generación de leads. Pero fíjate en la advertencia: “cuando se hacen bien”. La razón por la que digo esto es porque he visto muchas empresas que dan premios aleatorios (como un Tesla) esperando recibir a cambio tantos leads como sea posible.Pero como mencionaba, la calidad de los leads, es lo que importa. Dar premios grandes, caros, puede generar mucha atención, pero también atrae a muchos cazarrecompensas. Definitivamente, no son tus clientes ideales.Lo que deberías hacer es dar algo que tu audiencia objetiva quiera. En la mayor parte de casos, se trata de tu producto. En Ahrefs, solíamos dar una suscripción gratuita anual cuando patrocinábamos podcasts.Aunque ya no hacemos sorteos de producto, todavía los hacemos con productos promocionales. De hecho, hicimos uno hace poco y generó mucho interés:Who wants this pretty box with some Ahrefs’ swag and goodies?😜Just tell us which Ahrefs’ feature is your favourite. We’ll select 10 people at random and send them these swag boxes. 🙃 pic.twitter.com/5DQ32B6Qly— Ahrefs (@ahrefs) April 7, 2021 ¿Quién quiere esta bonita caja con productos promocionales de Ahrefs? 😜 Simplemente dinos qué funcionalidad de Ahfes es tu preferida. Elegiremos 10 personas al azar y les enviaremos estas cajas. ¿Qué pasa si eres una nueva empresa o tienes un producto que nadie conoce? Bueno, esa era exactamente mi situación. No podíamos regalar nuestra chaqueta porque éramos tan nuevos que solo teníamos un prototipo. En ese caso, sigue la táctica #4—alíate con otra empresa.En mi caso, trabajé junto a una empresa parecida y ofrecimos su producto como premio.Una vez que te has decidido por algo apropiado, configurar un sorteo es fácil. Simplemente usa una aplicación gratuita como KingSumo y listo.Todo lo que queda es promocionar el sorteo. Hacer marketing de una campaña de sorteo es parecido a la promoción de contenido—envíalo a tu lista de correo, publícalo en redes sociales, compártelo en comunidades, trabaja con influencers y demás.Sigue esta lista de comprobación de promoción de contenidos si quieres una lista de cosas que hacer:https://www.youtube.com/watch?v=PoVYweKH4ck7. Convierte tu página principal en un lead magnetLa página principal de Ahrefs es la que más tráfico recibe de todas las páginas de nuestro sitio.Es probablemente igual en tu caso. Tiene sentido—después de todo, tu página principal está enlazada desde el resto de páginas. También es la “cara” de tu web. Cierto porcentaje de personas que llegan desde otra página probablemente hacen clic para ir a tu página principal y echan un vistazo.Si tu objetivo es generar más leads, una idea potencial es convertir tu página principal en un lead magnet, como el que ves en Gaps.com:O en OkDork:Un aviso: no saltes directo a hacer esta táctica porque se lo hayas visto a tus marketeros favoritos de Internet. Depende de tu estrategia—podría ser una buena idea si quieres más leads y vender a través de tu lista de email. Pero si eres una empresa SaaS como nosotros, puede que quieras reservar tu página principal para explicar tu propuesta de valor.8. Establece un programa de referidosSegú Nielsen, el 92% de las personas confían en las recomendaciones de amigos y familiares por encima de cualquier otro tipo de publicidad. Esto supone que los leads generados a través del boca-oreja sean de los de mayor calidad que puedes conseguir.Aunque los clientes satisfechos puedan recomendar de forma natural tu producto o servicio a sus amigos, la mayoría necesitarán un pequeño empujón. Ahí es donde un programa de referidos entra en juego.Un programa de referidos da un “empujoncito” a estos clientes satisfechos al ofrecerles incentivos. Se asume que los incentivos son lo bastante buenos para ellos para que se lo digan a sus amigos. Y estos incentivos se ofrecen tanto al que referencia como al referido.Así, el éxito del programa de referidos depende del incentivo en sí mismo. En general, hay dos tipos de incentivos que puedes dar:MonetariosNo-monetariosLos incentivos monetarios son directos. Por cada nuevo cliente que alguien referencia, le das a esa persona y a la que han referido X$. Por ejemplo, en sus primeros tiempos, PayPal daba 20$ a cualquiera que se abriera una cuenta y otros 20$ por referenciar a alguien que se abriera una cuenta.Eso les hizo crecer a más de 100.000 clientes en solo un mes.Respecto a los incentivos no-monetarios, hay varios entre los que puedes elegir. Puedes dar descuentos, crédito en la tienda, tu producto o más. El ejemplo más famoso es el programa de referidos de Dropbox. Gamificaron el proceso completo ofreciendo más espacio de almacenamiento por cada referido con éxito.Fuente: DropboxEntre los incentivos monetarios y no-monetarios, ¿cuáles deberías elegir? En general, depende de si tus clientes hacen compras recurrentes.Si no compran frecuentemente (por ejemplo, un colchón), una recompensa monetaria puede ser más atractiva para los clientes. Si compran a menudo (por ejemplo, ropa), quizá podrías darle créditos en la tienda que puedan usar en su próxima compra.Por supuesto, esto es solo una regla general. Tendrás que probarla en tu tienda para ver qué es lo que funciona mejor.9. Posiciona vídeos en YouTubeHemos hablado sobre contenido escrito y herramientas gratuitas. Pero hay otro formato popular del que todavía tenemos que hablar. Los vídeos.YouTube es el segundo motor de búsqueda más popular del mundo. Cada día, la gente ve más de 1.000 millones de horas de vídeo en YouTube. Hay una gran oportunidad para que generes leads a través del vídeo.Cómo hacerloAquí tienes cómo puedes generar leads a través de YouTube.a) Apunta a temas de vídeo con potencial de tráfico de búsquedaEn vídeo marketing, sigue la misma estrategia de marketing de contenidos que usaste con el blog y las herramientas gratuitas—apunta a temas de vídeo que tengan tanto potencial de búsqueda como de negocio.Para encontrar estos temas, introduce una palabra clave relevante en Keywords Explorer de Ahrefs. Cambia el motor de búsqueda a “YouTube”. Por ejemplo, si vendes equipamiento para barbacoas, puedes introducir términos como “BBQ”, “barbecue” y “barbeque” (barbacoa). Ve al informe de Phrase match (concordancia de frase).Mira la lista y elige aquellos que parezcan relevantes.b) Crea un vídeo que merezca posicionarPara posicionar en YouTube los tiempos de visionado son importantes. Por tanto, tu vídeo tiene que ser entretenido, informativo y captar la atención de tu audiencia. Recomendamos que guionices tus vídeos para que puedas mantener el vídeo enfocado. Después, edítalo con inteligencia para generar un engagement elevado.https://www.youtube.com/watch?v=j5EOWffq-gkc) Capta leadsHablando en general, el ecosistema de YouTube no es amigable para generar leads. Pero eso no quiere decir que no sea posible. Aquí va cómo el famoso canal de baloncesto ILoveBasketballTV lo hace.Primero, usando las funcionalidades de la pantalla final de YouTube, añade el enlace de tu página landing/lead magnet al final de tu vídeo:Después, añádela en tu descripción:Finalmente, escribe un comentario enlazando a tu página landing y destácalo:10. RetargetingHas usado una de las tácticas de arriba. Generó cierto número de leads. Pero, naturalmente, no todo el mundo que visitó tu sitio se registró. Puede que pienses que es el final—si no se registraron, se han perdido para siempre.Pero no es cierto. Todavía puedes intentar traerlos de vuelta. ¿Cómo? Haciendo Retargeting.El retargeting es una forma de publicidad que te permite segmentar a visitantes que dejaron tu web. Básicamente, la mayoría de plataformas publicitarias (Facebook, Google, etc.) generarán un código JavaScript (conocido como pixel) que puedes añadir a tu sitio web. Cuando un visitante llega a tu web, el píxel coloca una cookie anónima en el navegador del visitante.Cuando el visitante deja tu sitio, la cookie permite a tu plataforma publicitaria mostrarle tu anuncio.El retargeting no es una táctica que personalmente usemos en Ahrefs. Pero muchos negocios lo hacen. Puedes usarla también.Retargetiza a gente que ha visitado ciertas páginas y envíales a una landing con una oferta para que se registren. Hazla atractiva al darles algo beneficioso a cambio—un eBook, un curso gratis, etc.Pero no asumas que la “zanahoria” que ofreces es la “bala mágica” que funciona. Envía a tu audiencia retargetizada a páginas landing diferentes con ofertas distintas y mira qué funciona mejor.Reflexiones finalesEspero que te hayas llevado unas pocas tácticas de generación de leads que puedas probar en tu web. ¿Me he dejado alguna táctica genial de generación de leads? Si tienes alguna que compartir, dímelo por Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar la guía de WhatsApp Marketing más completa. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "10 Tácticas de Generación de Leads Que Funcionan (Con Ejemplos)"
    },
    {
      "level": "H2",
      "text": "1. Convierte tu blog en una máquina de generar leads"
    },
    {
      "level": "H3",
      "text": "Cómo hacerlo"
    },
    {
      "level": "H4",
      "text": "a) Apunta a temas con un alto potencial de búsqueda"
    },
    {
      "level": "H4",
      "text": "b) Crea contenido que posicione"
    },
    {
      "level": "H4",
      "text": "c) Capta el interés de los lectores con un upgrade de contenido"
    },
    {
      "level": "H2",
      "text": "2. Escribe como invitado en blogs para conseguir leads"
    },
    {
      "level": "H3",
      "text": "Cómo hacerlo"
    },
    {
      "level": "H2",
      "text": "3. Crea herramientas gratuitas"
    },
    {
      "level": "H3",
      "text": "Cómo hacerlo"
    },
    {
      "level": "H2",
      "text": "4. Alíate con otras marcas"
    },
    {
      "level": "H2",
      "text": "5. Lanza un evento virtual"
    },
    {
      "level": "H2",
      "text": "6. Haz giveaways (sorteos y concursos)"
    },
    {
      "level": "H2",
      "text": "7. Convierte tu página principal en un lead magnet"
    },
    {
      "level": "H2",
      "text": "8. Establece un programa de referidos"
    },
    {
      "level": "H2",
      "text": "9. Posiciona vídeos en YouTube"
    },
    {
      "level": "H3",
      "text": "Cómo hacerlo"
    },
    {
      "level": "H4",
      "text": "a) Apunta a temas de vídeo con potencial de tráfico de búsqueda"
    },
    {
      "level": "H4",
      "text": "b) Crea un vídeo que merezca posicionar"
    },
    {
      "level": "H4",
      "text": "c) Capta leads"
    },
    {
      "level": "H2",
      "text": "10. Retargeting"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}