{
  "url": "https://ahrefs.com/blog/es/tecnica-rascacielos/",
  "slug": "tecnica-rascacielos",
  "title": "Cómo ejecutar la técnica del rascacielos (y obtener resultados)",
  "description": "En 2015, Brian Dean creó la Skyscraper Technique, una estrategia de link building en la que se mejora el contenido popular existente y se replican los backlinks. Pero, ¿sigue funcionando hoy en día?",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido En 2015, Brian Dean reveló una nueva estrategia de link building. La llamó Skyscraper Technique.Con más de 10.000 backlinks desde que se publicó el post, es justo decir que la técnica del rascacielos (Skyscraper Technique) sacudió al mundo en 2015. Pero, ¿qué es exactamente esta técnica y cómo puedes implementarla y seguir obteniendo resultados con ella en 2024?Empecemos por el principio.Contenido¿Qué es la técnica del rascacielos?La técnica del rascacielos es una estrategia de link building en la que se mejora el contenido popular existente y se replican los backlinks.Brian la llamó así porque, en sus palabras, “A los humanos nos gusta aquello que sea mejor, por lo que esta estrategia consiste en encontrar el “rascacielos” más alto en tu zona… Y añadirle 20 pisos encima”.La técnica funciona así:Cómo implementar la técnica del rascacielosSigue estos tres pasos para ejecutar la Skyscraper Technique.1. Encuentra contenido relevante con muchos backlinksExisten tres métodos para encontrar páginas relevantes con muchos enlaces:Utiliza el Site ExplorerIntroduce un sitio popular en el Site Explorer de Ahrefs. A continuación, accede al informe Mejor por enlaces.Este informe muestra una lista de las páginas del sitio con el mayor número de dominios de referencia. Si hay contenidos con más de 50 dominios de referencia, es posible que sean buenos objetivos potenciales.Nota al margen.Ignora las páginas de inicio y otros contenidos irrelevantes cuando eches un vistazo a este informe.Utiliza el Content ExplorerEl Content Explorer de Ahrefs es una base de datos de 10.000 millones de páginas con la que se pueden realizar búsquedas. Puedes utilizarla para encontrar menciones de cualquier palabra o frase.Empecemos introduciendo un tema amplio relacionado con tu nicho en el Content Explorer. A continuación, configuremos un filtro de Dominios de referencia con un mínimo de 50.También podemos añadir:Filtro de idioma para obtener solo páginas en nuestro idioma de destino.Excluir páginas de inicio para eliminarlas de los resultados.Echa un vistazo a los resultados para ver si hay algún contenido potencial que puedas batir.Utiliza el Keywords ExplorerIntroduce una palabra clave amplia en el Keywords Explorer de Ahrefs. A continuación, dirígete al informe Términos que concuerdan y establece un filtro de Dificultad de palabra clave (KD) de un mínimo de 40.¿Por qué filtrar por KD?La razón reside en el método que utilizamos en Ahrefs para calcular el KD. Nuestra puntuación KD se calcula a partir de una media recortada de dominios de referencia (RD) a las 10 primeras páginas del ranking.En otras palabras, las páginas mejor posicionadas con palabras clave con puntuaciones de KD altas tienen, de media, muchos backlinks.A partir de aquí, te recomendamos que revises el informe para encontrar posibles temas sobre los que podrías crear un contenido que sea mejor.2. Hazlo mejorLa idea central detrás de la técnica del rascacielos es que, se supone, que la gente quiere ver lo mejor.Una vez que hayas encontrado el contenido que quieras superar, el siguiente paso es hacer algo aún mejor.Según Brian, hay cuatro aspectos que merece la pena mejorar:Longitud. Si el artículo tiene 25 consejos, enumera más.Actualidad. Actualiza las partes obsoletas del artículo original con imágenes nuevas, capturas de pantalla, información, estadísticas, etc.Diseño. Haz que destaque con un diseño personalizado. Incluso, puedes hacerlo interactivo.Profundidad. No te limites a enumerar cosas. Completa los detalles y haz que sean prácticos.3. Contacta con las personas adecuadasLa clave para ejecutar con éxito la técnica del rascacielos es la difusión por correo electrónico. Ahora bien, en vez de enviar spam a todos tus contactos, dirígete a aquellos que ya han enlazado con el contenido específico que has mejorado.La hipótesis: como ya han enlazado a un artículo similar, es más probable que lo hagan a uno mejor.Para encontrar a estas personas, pega la URL del artículo original en el Site Explorer de Ahrefs y, luego, accede al informe Enlaces.Este informe muestra todos los backlinks de la página. En este caso, hay 17 grupos de enlaces.Eso sí, no todos estos enlaces serán buenos prospectos, así que es posible que tengas que añadir algunos filtros para limpiarlos. Por ejemplo, puedes:Añadir un filtro de Idioma para el idioma al que te diriges (por ejemplo, español).Cambiar la pestaña a Dofollow para los enlaces que pasan equity.¿Sigue funcionando la técnica del rascacielos?Han pasado aproximadamente nueve años desde que Brian compartió esta estrategia de link building. Siendo sinceros, la técnica se ha sobresaturado. Dado su uso generalizado, su eficacia puede ser realmente limitada.Algunos SEO incluso dicen que no la recomendarían.I’ll be covering why you should stop doing these:🛑 #1 Skyscraper technique🛑 #2 Broken backlink building🛑 #3 Buying “500 DA 50+ links for $50”And start doing these:✅ #1 Stats compilation✅ #2 Data-backed research report✅ #3 Create a free tool— Debbie Chew (@justdebbb) January 6, 2022Por ello, decidimos hacer esta pregunta a nuestros seguidores de Twitter y LinkedIn, y recibimos 1.242 votos. Aquí tienes los resultados:Está claro que muchos SEO y marketers siguen creyendo que la técnica funciona.Nota al margen.Según el informe anual de Aira sobre el estado del link building, solo el 18% de los SEO sigue utilizando la técnica del rascacielos. No es un recurso para muchos SEO, ya que ocupa el puesto 20 en la lista de tácticas. Supongo que su popularidad ha disminuido porque: (1) es antigua y los SEO están buscando cosas más nuevas, y (2) hoy en día los SEO creen que el contenido es más importante que los enlaces.Por qué fracasa la técnica del rascacielos y cómo mejorar las probabilidades de éxitoFundamentalmente, tiene sentido que la técnica del rascacielos siga funcionando. Después de todo, los principios son los mismos detrás de (casi) cualquier estrategia de link building:Crea un contenido de calidad.Ponte en contacto con la gente y promociónalo.¿Por qué la gente piensa que ya no es tan eficaz? Existen algunas razones y conocerlas te ayudará a mejorar tus posibilidades de éxito con la Skyscraper Technique.Empecemos por:1. Enviar solo la plantilla de email de BrianEn su post original, Brian sugería a sus lectores una plantilla de correo electrónico:Hola, he encontrado tu post: http://post1<complemento genérico>Enlaza con este post: http://post2Hice algo mejor: http://post3Por favor, cambia el enlace por el mío.Por desgracia, muchos SEO decidieron utilizar esta plantilla exacta palabra por palabra.El link building no existe en el vacío. Si todo el mundo en tu nicho decide enviar esta plantilla exacta a cada sitio web en existencia, dejará de ser efectiva muy rápido… Y eso es exactamente lo que pasó.Ahora bien, si el propietario de un sitio web ve esta plantilla, lo más probable es que la elimine inmediatamente.Nota al margen.A juzgar por mi bandeja de entrada, todavía hay gente que utiliza esta misma plantilla. Como todo el mundo, borro el correo inmediatamente.No digo esto para menospreciar los emails con plantillas. Si envías algo a gran escala, las plantillas son necesarias, pero aléjate de esta plantilla. Escribe la tuya propia, personalízala en la medida de lo posible y sigue los principios de difusión expuestos aquí.Mejor aún, pregúntate:“¿Qué hace que mi contenido sea único y digno de un enlace?”2. No segmentar a tus clientes potencialesLa gente enlaza por razones diversas, por lo que no debes enviar a todo el mundo el mismo mensaje.Plantéate dividir tu lista de prospectos en segmentos según el contexto en el que enlazaron. Para ello, consulta el informe Texto ancla en Site Explorer.Entre otros, se puede ver que la gente está enlazando a las diferentes estadísticas de nuestro post de estadísticas SEO. Así, por ejemplo, si estuviésemos haciendo outreach para un post hipotético, podríamos mencionar al primer grupo que tenemos una nueva estadística para “Más del 90% del contenido no recibe tráfico de Google”.Luego, al segundo grupo, le mencionaremos que tenemos una nueva estadística para “El 68% de las experiencias online”, y así sucesivamente.De hecho, es exactamente lo que hicimos cuando construimos enlaces a este post. Consulta el caso de estudio aquí:3. No contactar con suficientes personasEn última instancia, el link building sigue siendo un juego de números. Si no te pones en contacto con cierto número de personas, no conseguirás enlaces suficientes.En pocas palabras: tienes que elaborar una lista más amplia de posibles enlaces.Por lo tanto, en vez de limitarte a replicar los backlinks del contenido original, deberías replicar también los backlinks de otras páginas mejor posicionadas que cubran el mismo tema.Para encontrar estas páginas, introduce la palabra clave de destino en el Keywords Explorer y desplázate hasta la vista general de las SERP, SERP overview.En este ejemplo, la mayoría de las páginas mejor posicionadas tienen un montón de enlaces y todas ellas (después de filtrarlas, por supuesto) podrían ser candidatas potenciales de enlaces.PRO TIP¿Quieres encontrar más candidatas? Utiliza Content explorer.Busca tu palabra clave, establece un filtro de Dominios de referencia y verás páginas relevantes en las que puedes “minar” en busca de más clientes potenciales.4. Pensar a lo grande = mejorAlguien crea una lista con 15 herramientas. La siguiente persona la aumenta a 30. Otro “eleva el rascacielos” a 50, y la siguiente la aumenta a 100.No solo se trata de una carrera armamentística interminable, sino que tampoco tiene valor para el lector.Nadie quiere ojear 5.000 palabras o cientos de artículos solo para encontrar lo que necesita. El valor reside en la selección.Cuando tengas en cuenta los cuatro aspectos mencionados por Brian, no mejores las cosas simplemente por mejorarlas. Añadir 25 consejos mediocres a una lista existente de 25 no la hace “mejor”. Lo mismo ocurre si cambias la fecha de publicación o añades unas cuantas ilustraciones de poca calidad.Ejemplo: Mi compañero Chris Haines publicó hace poco un post sobre las mejores ideas para sitios de nicho. A pesar de que solo incluyó 10, ya ha superado a los demás artículos “rascacielos”:Se diferenció por sus conocimientos y experiencia. Después de todo, Chris cuenta con 10 años de experiencia en SEO.Así que, cuando estés creando tu artículo, mira siempre cualquier mejora a través de la lente del valor:¿Estás aportando más valor al lector?5. No tener en cuenta la marcaComo dice Ross Hudgens, “La mejora no se produce en un vacío de marca”.La mayoría de las veces, el contenido no se juzga tan solo por su calidad; también se juzga por su procedencia. Nosotros también lo descubrimos cuando intentamos construir enlaces a nuestra guía de investigación de palabras clave.La mayoría de las veces, la gente no leía el artículo. Nos enlazaban por nuestra marca y reputación: sabían que publicábamos contenidos de calidad de forma constante y confiaban en que el artículo que les ofrecíamos también lo fuera.En otras palabras, hay ocasiones en las que, por mucho que te empeñes en “subir el listón”, la gente no te enlazará porque no saben quién eres.Hoy en día, tener una marca personal es importante, pero piénsalo: ¿qué es una “marca fuerte” sino una producción constante de trabajo de calidad que le guste a la gente? Un rascacielos solitario suelto no hace una ciudad, sino muchos rascacielos juntos.Lo que quiero decir es lo siguiente: no te desanimes si tu artículo sobre “rascacielos” no obtiene resultados. Y no te desanimes simplemente porque no tengas una marca ahora mismo… Puedes trabajar en ella con el tiempo.Sigue creando contenidos de calidad, rascacielos o no, y los resultados llegarán si confías en el proceso.“Roma no se construyó en un día, pero sí que se ponían ladrillos cada hora”.Reflexiones finalesLa técnica del rascacielos es una técnica legítima de link building que funciona, pero eso solo ocurrirá si tienes:Contenido con una USP fuerteUna marca establecidaUna “plantilla” distinta a lo que usa el restoDoes the Skyscraper Technique still work in 2023?— Ahrefs (@ahrefs) January 20, 2023¿Dudas? ¿Preguntas? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "Cómo ejecutar la técnica del rascacielos (y obtener resultados)"
    },
    {
      "level": "H2",
      "text": "¿Qué es la técnica del rascacielos?"
    },
    {
      "level": "H2",
      "text": "Cómo implementar la técnica del rascacielos"
    },
    {
      "level": "H3",
      "text": "1. Encuentra contenido relevante con muchos backlinks"
    },
    {
      "level": "H4",
      "text": "Utiliza el Site Explorer"
    },
    {
      "level": "H4",
      "text": "Utiliza el Content Explorer"
    },
    {
      "level": "H4",
      "text": "Utiliza el Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "2. Hazlo mejor"
    },
    {
      "level": "H3",
      "text": "3. Contacta con las personas adecuadas"
    },
    {
      "level": "H2",
      "text": "¿Sigue funcionando la técnica del rascacielos?"
    },
    {
      "level": "H2",
      "text": "Por qué fracasa la técnica del rascacielos y cómo mejorar las probabilidades de éxito"
    },
    {
      "level": "H3",
      "text": "1. Enviar solo la plantilla de email de Brian"
    },
    {
      "level": "H3",
      "text": "2. No segmentar a tus clientes potenciales"
    },
    {
      "level": "H3",
      "text": "3. No contactar con suficientes personas"
    },
    {
      "level": "H3",
      "text": "4. Pensar a lo grande = mejor"
    },
    {
      "level": "H3",
      "text": "5. No tener en cuenta la marca"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Si Quan Ong"
}