{
  "url": "https://ahrefs.com/blog/es/tecnicas-seo/",
  "slug": "tecnicas-seo",
  "title": "10 técnicas SEO para conseguir más tráfico",
  "description": "¿Buscas impulsar tu SEO en 2020? Prueba qué te parece esta lista de 11 técnicas accionables y sencillas.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido Puedes conseguir más tráfico a tu web a partir de búsquedas orgánicas de tres formas.Puedes:Posicionarte mejor en palabras clave existentes.Posicionarte en más palabras clave.Conseguir más clics.Todas las técnicas SEO que te explicamos a continuación te ayudan a hacer una o más de estas cosas.Contenido1. Aprende de tus competidoresLa competencia te complica la vida, pero tus competidores también pueden ser una fuente de ideas de temas.Para encontrar las páginas de tus competidores con más tráfico, puedes usar el informe de Mejores páginas en Site Explorer de Ahrefs.Por ejemplo, si introducimos uno de nuestros competidores en la herramienta, vemos que su guía de SEO para Magento recibe una cantidad decente de tráfico de búsqueda.Todavía no hemos tratado este tema, pero parece que podría merecer la pena.También puedes usar el informe de Brecha de contenidos (content gap) en Site Explorer para encontrar palabras clave por las que posicionen tus competidores y tú no.Este es el proceso:Introduce tu dominio en Site Explorer.Ve al informe de Brecha de contenidos (content gap).Introduce unos cuantos competidores.Por ejemplo, CampamentoWeb, 40defiebre y Dinorank se posicionan (aunque no todos entre los 10 primeros resultados) en “contenido duplicado” y “ctr SEO”, pero son temas que no hemos tratado en nuestro blog en español. Quizá merezca la pena añadirlos a nuestro calendario de contenidos.2. Prioriza temas con dificultad bajaMerece la pena priorizar temas de baja dificultad si tu sitio es nuevo porque probablemente te costará posicionar en temas competitivos nada más empezar.Puedes encontrarlos con una herramienta de keyword research como el Explorador de palabras clave de Ahrefs. Simplemente busca ideas de palabras clave y después filtra por las que tengan puntuaciones bajas de dificultad de palabra clave (KD, Keyword Difficulty).3. Actualiza contenido antiguoEl contenido antiguo necesita actualización periódica porque los rankings no duran para siempre, especialmente si tu objetivo son temas sensibles a la actualidad.Por ejemplo, aquí tienes el tráfico orgánico estimado a nuestra lista de lo más buscado en Google a lo largo del tiempo:Cada caída ocurrió cuando el contenido perdió su actualidad. Los usuarios querían una lista actualizada de lo más buscado en YouTube, pero la nuestra se quedó anticuada. Por eso se hundió el posicionamiento. Los picos ocurrieron al actualizar el contenido.Puedes encontrar páginas en tu web que puede que necesiten una actualización en Site Explorer. Simplemente introduce tu sitio web, ve al informe de Mejores páginas, establece el modo de comparación en “Año anterior”, ordena el informe por cambio en el tráfico de menor a mayor y busca temas donde la novedad pueda ser un problema.Si usas WordPress puedes encontrar páginas que ya no tengan un buen rendimiento realizando una auditoría de contenidos con el plugin SEO de Ahrefs.4. Cubre los huecos sin contenidoNuestro estudio descubrió que si una página está en el primer puesto para una palabra clave, posiciona por casi 1.000 palabras clave más en en el top 10 de media. Muchas de estas keywords serán formas distintas de buscar lo mismo. Pero es probable que algunas representen subtemas que has tratado en tu contenido.Por ejemplo, nuestra guía para enviar tu web a Google se posiciona en el top 10 “enviar url a google”.Esto pasa porque hemos tratado este subtema en el post.Sin embargo, tenemos muchos artículos que casi seguro que se dejan subtemas importantes. Si los encontramos y tratamos lo que hemos pasado por alto es posible que nuestra página pueda posicionarse en palabras clave relacionadas y conseguir más tráfico.Esta es una forma fácil de encontrar temas que has pasado por alto en tu contenido.Introduce una de tus URLs en Site Explorer.Ve al informe de Brecha de contenido.Pega algunas de las URLs mejor posicionadas de tu palabra clave principal.Revisa las palabras claves en busca de ideas y temas que hayas podido pasar por alto.Por ejemplo, InboundCycle y Hotmart se posicionan en el top 10 de “guest posting”, pero nosotros no.Esto pasa porque no cubrimos ese subtema en nuestra guía de guest blogging, mientras que ellos sí lo hicieron.Desarrollar un tema más en profundidad no solo nos ayuda a posicionar en más palabras clave long-tail o de larga cola, también podría ser más útil para el usuario con información de su interés.5. Crea content hubsLos content hubs o hubs temáticos son colecciones entrelazadas de contenido sobre un tema concreto.Por ejemplo, nuestra guía SEO para principiantes es un content hub. Tiene una página pilar sobre el SEO que enlaza a y desde subpáginas sobre cómo funcionan los motores de búsqueda, los fundamentos del SEO, keyword research, etc.El principal beneficio de los content hubs es que la autoridad de los enlaces fluye desde y hacia todas las páginas del hub gracias a los enlaces internos. En otras palabras, si una de las subpáginas recibe muchos enlaces, todas se fortalecen y potencialmente posicionan mejor.Si ya tienes contenido en tu web, la forma más fácil de crear un hub de contenidos es reorganizar páginas relacionadas alrededor de una página “hub” o central.Si quieres crear un content hub nuevo, una de las formas más fáciles para encontrar temas es echar un vistazo a los mejores subdirectorios o subcarpetas de tus competidores.Por ejemplo, vamos a introducir la versión en español de DietDoctor en Site Explorer y a a ir al informe de Estructura del sitio. Vemos que tiene 13 páginas en el subdirectorio /es/keto/recetas-cetogenicas que reciben una estimación de 39.673 visitas de búsqueda al mes.Si hacemos clic en el número de páginas, veremos todas las páginas que se encuentran bajo esa estructura de URL junto a su tráfico total estimado y su palabra clave principal.Muchos de estos temas tendrían sentido para un content hub.Aprende más: Content Hubs para SEO: consigue más tráfico y links con clusters temáticos6. Consigue más enlacesLos backlinks son uno de los principales factores de posicionamiento de Google, pero conseguir enlaces de alta calidad es más fácil de decir que de hacer. Es quizá una de las partes más complicadas del SEO.Por eso, antes de que empieces a conseguir más enlaces a una página, merece la pena que compruebes si es probable que vaya a servir de algo.Por ejemplo, si introduces nuestro artículo sobre redirecciones 301 en Site Explorer, puedes ver que tiene enlaces de 12 dominios de referencia (sitios web):Esta página actualmente está en el puesto número 2 de la palabra clave “redirecciones 301”:Pero si revisas las páginas mejor posicionadas para esa palabra clave en Keywords Explorer puedes ver que la página que nos supera tiene el mismo número de dominios, pero un número bastante inferior de enlaces. Estas cifras no tienen en cuenta la calidad de los enlaces, por lo que podría darse el caso de que la página mejor posicionada nos supere porque tiene enlaces de más calidad. Pero, en general, no parece que se trate de un problema de falta de enlaces.Por otro lado, si revisamos la SERP de “what is seo” (qué es SEO), vemos que nuestra página tiene significativamente menos enlaces que las páginas que están por delante.Conseguir más enlaces probablemente sea la forma de proceder en este caso.Lecturas complementariasLa guía para principiantes al link buildingCómo conseguir backlinks: 15 tácticas comprobadas9 estrategias fáciles de link building7. Optimiza enlaces internosLos enlaces internos son enlaces de una página de tu sitio web a otra.Al igual que los backlinks, transfieren “link equity” (valor de enlace) de página a página. Al contrario que con los backlinks, tienes un control completo de dónde y cómo enlazas internamente en tu sitio web. Por eso, una técnica conocida en SEO es dirigir más enlaces internos a páginas que necesiten un empujón.Para encontrar estas páginas, introduce tu dominio en Site Explorer, ve al informe de palabras clave orgánicas y filtra por las posiciones de palabra clave entre 2-10.Puedes echar un vistazo a este informe para buscar tus palabras clave objetivo más importantes.Por ejemplo, posicionamos en el puesto número 7 para “serp”.Para encontrar oportunidades relevantes y contextuales para enlazar internamente esta página, podemos añadirla al filtro de página objetivo en el informe de Oportunidades de enlace en Site Audit de Ahrefs.En este ejemplo, el reporte sugiere que enlacemos internamente una mención contexual de “seo off-page” en nuestra guía de SEO on-page. Aprende más: Enlaces internos para SEO: una guía accionable8. Arregla enlaces rotosLos enlaces rotos son una problema habitual porque es habitual que alguien borre o mueva páginas a lo largo del tiempo. A menos que redirijas estas páginas a sus nuevas URLs, los enlaces anteriores que apuntaban a las páginas antiguas en realidad no irán a ninguna parte.Aquí tienes cómo encontrar páginas con enlaces rotos en tu sitio:Pega tu dominio en Site Explorer.Ve al informe de Mejor por enlaces.Añade un filtro de “404 no se encuentra”.Ordena el informe por dominios de referencia de mayor a menor.Por ejemplo, haciendo esta comprobación en nuestro blog en español descubrimos que no teníamos ninguna página con enlaces rotos.Pero en nuestro blog en inglés descubrimos que teníamos backlinks de 57 dominios de referencia que apuntaban a la URL antigua de nuestra barra de herramientas SEO.Dado que la página de nuestra barra de herramientas SEO todavía existe, podemos reclamar esos enlaces redirigiendo nuestra URL antigua a la nueva.Aprende más: Cómo encontrar y arreglar enlaces rotos9. Consigue más clicsPosicionar bien en Google es solo parte de la batalla. También tienes que incitar a los usuarios a hacer clic en tu resultado.Aquí tienes un par de formas de hacerlo:Escribe etiquetas de título y meta descripción atractivas.Añade marcado schema para poder ser elegido como fragmento destacado.Google a menudo muestra etiquetas de título y meta descripciones en los resultados de búsqueda, así que hacer que sean lo más atractivos posible sin caer en el clickbait es importante.Aquí tienes algunos consejos:Cumple la intención de búsquedaEvita que se corte el texto (usa una herramienta gratuita de optimización del fragmento en la SERP para comprobarlo, como esta)Dirígete al usuarioIncluye tu palabra clave principalTambién puedes usar el marcado schema para hacer que las páginas sean elegibles para fragmentos destacados. Es donde Google muestra información adicional debajo del fragmento de búsqueda, como notas de reviews y preguntas frecuentes.Dado que estas optimizaciones llevan tiempo, merece la pena priorizar páginas con el mayor tráfico de búsqueda. Puedes encontrarlas en Google Search Console o hacerte con una estimación usando el informe de Mejores páginas en Site Explorer de Ahrefs.Lecturas complementariasCómo crear la etiqueta de título perfectaCómo escribir la meta descripción perfectaFragmentos enriquecidos: ¿qué son y cómo se consiguen?¿Qué es el marcado Schema? Cómo usarlo para SEO10. Optimiza para conseguir fragmentos destacadosLos fragmentos destacados son respuestas cortas que se muestran en algunos resultados de búsqueda. Google los recoge de alguna de las páginas mejor posicionadas.Conseguir algún fragmento destacado puede ser un atajo a los primeros puestos de Google. Pero antes, tienes que encontrar las mejores oportunidades.Aquí tienes cómo hacerlo:Introduce tu dominio en Site Explorer.Ve al informe de palabras clave orgánicasFiltra por los 10 primeros puestosFiltra por SERPs (páginas de resultados) con fragmentos destacados donde no posicionesAhora deberías ver todas las palabras clave en las que posicionas en el top 10 y donde Google muestra un fragmento destacado de otro resultado.Por ejemplo, posicionamos en el puesto número 3 en “herramientas seo”, pero Google recoge el fragmento destacado de otra página.Conseguir fragmentos destacados no es una ciencia exacta, pero es improbable que lo consigas a menos que tu página tenga la información que Google quiera ver.Por ejemplo, está claro que Google aquí quiere una lista de herramientas.Nuestro post ya tiene una lista de 29 herramientas, pero quizá añadirla en un resumen al final, o agruparla de otra forma, podría incrementar las posibilidades de conseguir el fragmento destacado.Lecturas complementariasCómo optimizar para los fragmentos destacados de GoogleEstudio de Ahrefs de 2 millones de fragmentos destacados: 10 conclusiones importantesReflexiones finalesConseguir más tráfico de búsqueda a tu sitio web consiste en posicionar mejor en tus palabras clave existentes, conseguir posicionar en más palabras clave o conseguir más clics. Hay muchas técnicas SEO que puedes usar para hacerlo. Estas son solo algunas de ellas.Si quieres más, lee nuestra lista de consejos SEO.¿Alguna pregunta? Escríbenos por Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "10 técnicas SEO para conseguir más tráfico"
    },
    {
      "level": "H2",
      "text": "1. Aprende de tus competidores"
    },
    {
      "level": "H2",
      "text": "2. Prioriza temas con dificultad baja"
    },
    {
      "level": "H2",
      "text": "3. Actualiza contenido antiguo"
    },
    {
      "level": "H2",
      "text": "4. Cubre los huecos sin contenido"
    },
    {
      "level": "H2",
      "text": "5. Crea content hubs"
    },
    {
      "level": "H2",
      "text": "6. Consigue más enlaces"
    },
    {
      "level": "H2",
      "text": "7. Optimiza enlaces internos"
    },
    {
      "level": "H2",
      "text": "8. Arregla enlaces rotos"
    },
    {
      "level": "H2",
      "text": "9. Consigue más clics"
    },
    {
      "level": "H2",
      "text": "10. Optimiza para conseguir fragmentos destacados"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}