{
  "url": "https://ahrefs.com/blog/es/tendencias-seo/",
  "slug": "tendencias-seo",
  "title": "Tendencias SEO que no puedes ignorar en 2024",
  "description": "La mayoría de las tendencias SEO pasan de moda rápido, pero algunas perduran y merecen nuestra atención. Veamos cuáles son y cómo aprovecharlas.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido La mayoría de las tendencias SEO pasan de moda rápido, pero algunas perduran y merecen nuestra atención.Veamos cuáles son y cómo aprovecharlas.1. Todo el mundo usa ChatGPT (y otras herramientas de IA) para escribir contenidosSi le das un título a ChatGPT y le pides que escriba un post, lo hará en cuestión de segundos.Es impresionante, pero hay un par de problemas:Todo el mundo que utiliza ChatGPT está creando el mismo contenido. Lo mismo les ocurre a los usuarios de otras herramientas de escritura con IA basadas en GPT, que son básicamente todos.El contenido es extremadamente soso. Por supuesto, puedes pedirle a ChatGPT que “lo haga más entretenido”, pero normalmente se sobrecompensa y te devuelve una versión deprimente del mismo contenido soso.Como dice Gael Breton:Everyone wants to create AI content but nobody wants to read it 🤷‍♂️— Gael Breton (@GaelBreton) January 14, 2023Cómo aprovechar esta tendencia SEONo utilices la IA para escribir artículos enteros. Utilízala como un compañero creativo que te ayude a escribir contenidos y a automatizar tareas monótonas.Por ejemplo, puedes pedirle a ChatGPT que escriba un esquema a partir de un título provisional y una lista de palabras clave (que puedes extraer de Ahrefs), y puede hacer un trabajo decentePrompt:Crea un esquema para un post titulado “[título provisional]” basado en estas palabras clave: [lista]Resultado:Cuando hayas escrito un borrador, puedes pedir a ChatGPT que lo corrija un poco en cuestión de segundos.Así puedes automatizar las cosas aburridas, como crear etiquetas de título…… y escribir una metadescripción:Si al cabo de unos meses te das cuenta de que tu contenido se posiciona bien pero no ha ganado el snippet destacado, ChatGPT también puede ayudarte con ello.Por ejemplo, Ahrefs nos dice que estamos en la posición 3 en “affiliate marketing” pero no tenemos el snippet.Si consultamos Google, el fragmento es una definición. Pedir a ChatGPT que simplifique nuestra definición puede resolver este problema.En resumen, hay un número casi infinito de formas de utilizar ChatGPT (y otras herramientas de escritura de IA) para crear mejores contenidos. Eso sí, todas ellas van en contra de la tendencia de pedirle que escriba artículos repetitivos desde cero.2. Todo el mundo utiliza el SEO programático para crear contenidosEl SEO programático se refiere a la creación de páginas orientadas a palabras clave de forma automática (o semiautomática).Las páginas de localización de NomadList son un ejemplo perfecto:Cada página se centra en una ciudad concreta y comparte la misma información básica: velocidad de Internet, coste, temperatura, etc. Toda esta información se extrae programáticamente de una base de datos y se calcula que el sitio recibe 51.000 visitas mensuales en total.El SEO programático no es nada nuevo. Siempre ha existido. Ahora está de moda porque las herramientas de IA como ChatGPT lo hacen más fácil y accesible que nunca.¿Cuál es el problema? Como señaló John Mueller en X, está plagado de spam:I love fire, but also programmatic SEO is often a fancy banner for spam.— John 🧀 … 🧀 (@JohnMu) July 25, 2023Cómo aprovechar esta tendencia SEONo utilices el SEO programático para publicar cantidades insensatas de spam que probablemente se verán afectadas en la próxima actualización de Google. Utilízalo para escalar contenido valioso que resista el paso del tiempo.Por ejemplo, se calcula que las páginas de conversión de divisas de Wise reciben 43,6 millones de visitas mensuales:Esto se debe a que el contenido es realmente útil. Cada página presenta una herramienta interactiva que muestra el tipo de cambio en directo para cualquier cantidad…… y el tipo de cambio a lo largo del tiempo…… y una práctica opción de notificación por correo electrónico cuando los tipos de cambio superan una determinada cantidad…… con tablas de conversión de cantidades populares…… y una comparación de las formas más baratas de enviar dinero al extranjero en la divisa elegida:No importa que todas estas páginas utilicen la misma plantilla. Los datos son exactamente los que quieres ver cuando buscas [[divisa 1] a [divisa 2].Probablemente por eso Wise se encuentra entre las 10 primeras posiciones en más de 73.000 de estas palabras clave:¿Quieres aprovechar el contenido programático en 2024 como Wise? Consulta la guía a continuación.Lecturas complementariasSEO programático para principiantes3. Todo el mundo busca respuestas en la IA generativaA la gente le encanta ChatGPT porque responde a las preguntas de forma rápida y concisa, así que no es de extrañar que la IA generativa ya se esté abriendo camino en las búsquedas.Por ejemplo, si preguntas a Bing por una definición o cómo hacer algo básico, la IA generará una respuesta sobre la marcha allí mismo, en los resultados de búsqueda.En otras palabras, gracias a la IA, los usuarios ya no tienen que hacer clic en un resultado de búsqueda para obtener respuestas a preguntas sencillas. Es como los fragmentos destacados con esteroides.Puede que esto no sea un gran problema ahora mismo, pero cuando la versión de Google de esto (Search Generative Experience) salga de la beta, muchos sitios web verán cómo los clics empiezan a desaparecer.Cómo aprovechar esta tendencia SEONo inviertas demasiado en temas que la IA generativa puede responder fácilmente. A la larga, perderás clics como un loco a favor de la IA. Empieza a priorizar los temas que la IA tendrá dificultades para responder.¿Cómo saber qué temas le costará responder? Prueba a preguntar a ChatGPT. Si da una respuesta buena y concisa, está claro que es una pregunta fácil.Por ejemplo, en EE.UU. se realizan cientos de búsquedas al mes sobre cómo calcular un porcentaje en Google Sheets:Si le pides la solución a ChatGPT, te da una respuesta perfecta en pocas palabras.Este es el ejemplo perfecto de un tema en el que la IA generativa eliminará para muchos la necesidad de hacer clic en un resultado de búsqueda.Probablemente no será el caso de un tema como este:La IA generativa podría decirte cómo crear una plantilla, pero no puede crear una por ti. Aunque pudiese crear una en el futuro, nunca será un experto en finanzas personales con experiencia. Siempre tendrás que hacer clic en un resultado de búsqueda de una plantilla creada por esa persona.Este es el tipo de temas a los que hay que dar prioridad en 2024.Nota al margen.Nada de esto significa que tengas que dejar de centrarte en temas “sencillos”. Siempre podrás obtener algo de tráfico de ellos. Lo que quiero decir es que no hay que obsesionarse con el posicionamiento de palabras clave que tengan los días contados. En su lugar, prioriza los temas con valor a largo plazo.Bonus: 3 tendencias SEO a ignorar en 2024No todas las tendencias SEO son beneficiosas. Aquí tienes algunas de ellas y la razón para ignorarlas.La gente utiliza más que nunca la búsqueda por vozEn 2014, Google reveló que el 41% de los estadounidenses utiliza la búsqueda por voz a diario. Según una investigación de UpCity, esa cifra ascendía al 50% a partir de 2022. Aún no he visto datos para 2023, pero imagino que superará el 50%.Por qué deberías ignorar esta tendencia SEOEl 75% de los resultados de las búsquedas por voz proceden de una página situada entre las tres primeras y el 40,7% de un fragmento destacado. Si ya estás optimizando para esas cosas, no hay mucho más que puedas hacer.La gente utiliza más que nunca la búsqueda visual para comprarEn 2022, Insider Intelligence informó de que el 22 % de los adultos estadounidenses habían comprado con búsquedas visuales (Google Lens, Bing Visual Search, etc.). Esta cifra es superior al 15 % de 2021.Por qué deberías ignorar esta tendencia SEOAl igual que ocurre con la búsqueda por voz, no existe una forma real de optimizar la búsqueda visual. Sin duda, ayuda tener imágenes de producto de buena calidad, nombres de archivo y texto alternativo optimizados, y el marcado de esquema de producto en tus páginas, pero es algo que deberías estar haciendo de todos modos.La gente utiliza Bing más que nuncaYusuf Mehdi, de Bing, anunció en marzo de 2023 que el motor de búsqueda había superado por primera vez los 100 millones de usuarios activos diarios. Esto se produjo solo un mes después del lanzamiento de Bing con IA.Por qué deberías ignorar esta tendencia SEOPuede que Bing sea más popular que nunca, pero su cuota de mercado se sitúa en torno al 3% según las estimaciones de Statcounter. La cuota de mercado de Google se sitúa en torno al 92%, por lo que es recomendable optimizar para este últimoAdemás, se suele dar el caso de que si te posicionas en Google, también lo harás en Bing, por lo que no merece ninguna atención extra.Reflexiones finalesIntentar aprovecharse de las tendencias SEO tiene sentido, pero no dejes que te distraigan de aquellas cosas aburridas que siempre funcionan: encuentra lo que la gente busca > crea contenido sobre ello > construye backlinks > repite.¿Tienes preguntas? Estamos en X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Tendencias SEO que no puedes ignorar en 2024"
    },
    {
      "level": "H2",
      "text": "1. Todo el mundo usa ChatGPT (y otras herramientas de IA) para escribir contenidos"
    },
    {
      "level": "H3",
      "text": "Cómo aprovechar esta tendencia SEO"
    },
    {
      "level": "H2",
      "text": "2. Todo el mundo utiliza el SEO programático para crear contenidos"
    },
    {
      "level": "H3",
      "text": "Cómo aprovechar esta tendencia SEO"
    },
    {
      "level": "H2",
      "text": "3. Todo el mundo busca respuestas en la IA generativa"
    },
    {
      "level": "H3",
      "text": "Cómo aprovechar esta tendencia SEO"
    },
    {
      "level": "H2",
      "text": "Bonus: 3 tendencias SEO a ignorar en 2024"
    },
    {
      "level": "H3",
      "text": "La gente utiliza más que nunca la búsqueda por voz"
    },
    {
      "level": "H4",
      "text": "Por qué deberías ignorar esta tendencia SEO"
    },
    {
      "level": "H3",
      "text": "La gente utiliza más que nunca la búsqueda visual para comprar"
    },
    {
      "level": "H4",
      "text": "Por qué deberías ignorar esta tendencia SEO"
    },
    {
      "level": "H3",
      "text": "La gente utiliza Bing más que nunca"
    },
    {
      "level": "H4",
      "text": "Por qué deberías ignorar esta tendencia SEO"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Joshua Hardwick"
}