{
  "url": "https://ahrefs.com/blog/es/tipos-de-marketing/",
  "slug": "tipos-de-marketing",
  "title": "Los 21 tipos principales de marketing",
  "description": "Aprende sobre los 21 tipos diferentes de marketing que puedes usar para hacer crecer tu negocio.",
  "content": "Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos. Contenido Hay muchos, muchos tipos de marketing. Dependiendo de tu situación, el mercado, el momento y muchos otros factores, será mejor que uses uno u otro. Aquí te lo contamos.Para poner las cosas más fáciles hemos recopilado los 21 tipos de marketing que han demostrado ser más útiles y con más recorrido a lo largo del tiempo. Han sido desarrollados, probados y testados por generaciones de profesionales del marketing en distintos sectores y entornos.Hemos añadido ejemplos e ideas de cómo usarlos y algo de contexto sobre el tipo de empresas, situaciones y momentos en los que mejor se pueden aplicar. Nos hemos basado en nuestra experiencia directa y en las opiniones de otros expertos del sector.Puedes encontrar ejemplos de los 21 tipos a tu alrededor. También es probable que cada uno tenga alguna conferencia anual dedicada en alguna parte del mundo.Cada uno es distinto, pero la mayoría se puede usar en paralelo para crear un motor de crecimiento a prueba de bombas.Antes de empezar, una nota: no son excluyentes (salvo excepciones) y los puedes remezclar. Algunos son más generales y otros, mucho más específicos. Organizar y categorizar todos los tipos de marketing existentes es una tarea casi imposible, pero aquí hemos recopilado algunos de los más útiles y habituales.Además de añadir ejemplos en cada tipo de marketing, incluimos algunos datos para que puedas compararlos y saber si encaja mejor en tu situación:Público objetivo. ¿Es un tipo de marketing que sirva para B2C (para consumidor final) o para B2B (para empresas)? ¿Es para un sector concreto o vale para todo el mundo?Qué canales suele involucrar. Esto puede tener truco, no todos los tipos de marketing funcionan en todos los canales. ¿Es algo que requiera de redes sociales? ¿De una en concreto? ¿De chat? ¿O necesitas un espacio físico?Cuándo usarlo y para qué tipo de empresa encaja mejor. ¿En qué tipo de situaciones resultaría más adecuado? ¿Funciona con cualquier tipo de empresa o tiene que tener algunas características concretas?Pagado/orgánico. Finalmente, ¿es un tipo de marketing que requiera inversión directa, pago por publicidad, o es algo que puede funcionar en orgánico?Vamos a empezar, aquí tienes la lista completa:Marketing digitalMarketing offlineInbound marketingOutbound marketingMarketing de contenidosMarketing en buscadores (search engine marketing)Growth marketingMarketing B2BMarketing B2CMarketing de afiliadosMarketing en redes socialesBranding o Brand marketingMarketing directoMarketing de influencersEmail marketingMarketing word-of-mouthMarketing de eventosMarketing de guerrillaSaas MarketingMarketing conversacionalBranded content1. Marketing digitalEl marketing digital es un término general que engloba todo tipo de actividad promocional que se apoye en internet como canal para transmitir el mensaje. Por ello, incluso dos tácticas diferentes, como el SEO y PPC, se consideran marketing digital.Este término se usa a menudo para diferenciar una categoría de tácticas del marketing offline.Personalmente, en mi experiencia en departamentos de marketing y comunicación de gran empresa o en agencia, he visto cómo la distinción entre “digital y no digital” se iba volviendo cada vez más difusa. Quizá en 2010 tenía sentido hacer la separación, pero hace años que estamos en un entorno de “digital por defecto”. Además, es muy habitual que las campañas traspasen barreras entre digital y análogico: una lona llamativa en Madrid puede convertirse en una publicación viral en redes sociales.Público objetivo. Tanto B2C como B2B. Prácticamente cualquier empresa puede usar marketing digital hoy en día.Qué canales suele involucrar. Canales digitales (email, redes sociales, etc.). Pero también puede arrancar en el mundo offline.Cuándo usarlo y para qué tipo de empresa encaja mejor. Salvo excepciones (raras) en las que tu público sea 0% digital, tiene sentido que hagas marketing digital.Pagado/orgánico. Ambos. Hay tácticas y disciplinas tanto orgánicas, como pagadas.Ejemplo de marketing digitalEn Ahrefs usamos varias tácticas de marketing digital y herramientas para compartir nuestro conocimiento en SEO y marketing, y promocionar nuestro producto.A menudo, un tema particular, como una checklist SEO, se usará en un post del blog, después se reutilizará en otras plataformas y se promocionará a través de distintos canales; todo eso es marketing digital.Aquí va un tuit que muestra la checklist SEO resumida en una infografía:Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021También hemos promocionado la checklist a través de publicidad online. Este ejemplo es de Quora Ads:Y aquí está nuestra newsletter de resumen semanal promocionando el post original:Lecturas complementarias7 Estrategias de marketing que realmente funcionan2. Marketing offlineAl contrario que en el marketing digital, el marketing offline (a menudo denominado marketing tradicional) es un término general que engloba cualquier tipo de marketing que se realiza sin usar internet ni medios digitales.Si un anuncio se publica en una revista de papel en lugar de una revista online, eso es marketing offline. Igualmente, si se envía un mensaje personalizado por correo postal en lugar de por correo electrónico, también sería marketing offline.Aunque palabras como “offline” y “tradicional” puedan generar la impresión de que este tipo de marketing es algo del pasado, los anuncios en revistas en papel o en programas de televisión todavía no han desaparecido.Según Statista, los anuncios en televisión todavía consiguen el mayor alcance de todos los tipos de publicidad.La TV todavía es el medio principal para la publicidad en Estados UnidosPorcentaje de encuestados que afirmó haber visto anuncios a través de uno de los siguientes canales en las 4 semanas anteriores- TV- Redes Sociales- YouTube- Radio- Web- Motores de búsqueda- Apps- Publicidad de exteriores25.000 adultos de Estados Unidos encuestados en 2022Fuentes: Statista Global Consumer SurveyPúblico objetivo. Al igual que en el marketing digital, cuando hablamos de marketing offline o tradicional, estamos hablando de algo muy general, que podríamos usar con muchos tipos de público.Qué canales suele involucrar. Todos los que sean “no digitales”. Podemos hablar de revistas o periódicos, cartelería y publicidad de exteriores, correo postal o incluso eventos.Cuándo usarlo y para qué tipo de empresa encaja mejor. En general, vamos a necesitar más presupuesto y nos encontraremos más barreras de entrada que en el marketing digital. Tiene sentido usarlo cuando nuestro público es poco digital o los canales digitales están muy saturados.Pagado/orgánico. En general, solemos hablar de acciones pagadas. Pero también pueden ser orgánicas (como lanzar una revista en papel para distribuir entre tus clientes).Ejemplos de marketing y publicidad tradicionalEntre 1999 y 2002, Anheuser-Busch, la productora de cerveza, promocionó su cerveza Budweiser con un anuncio de televisión que se convirtió en un fenómeno de la cultura popular.La campaña “Whassup?” ganó muchos premios publicitarios, incluido el Gran Premio del Jurado (Grand Prix) de Cannes y ayudó a la empresa a incrementar las ventas de 2.4 millones de barriles a 99.2 millones en 2020.https://youtu.be/JJmqCKtJnxMEn el año 2000, la marca de coches BMW, junto a la agencia SCPF, lanzaba la mítica campaña “¿Te gusta conducir?”. La campaña no solo recibió multitud de premios en algunos de los festivales más prestigiosos (entre otros el Gran Premio y el Sol de Oro en el Festival Publicitario de San Sebastián de 2001, el León de Oro en Cannes, el Gran Premio a la Eficacia de la Publicidad), también ayudó a elevar las ventas en seis años.https://www.youtube.com/watch?v=bmYYpHI6clYPero no todo son campañas de hace más de 20 años. Cabify (la alternativa española a Uber o Lyft) lanzó en 2023 una revista de papel que incluye en todos sus coches para amenizar los trayectos de sus clientes.3. Inbound marketingEl inbound marketing es una estrategia de marketing que busca atraer clientes con contenido útil y relevante.Para entender mejor este término, vamos a compararlo con el outbound marketing.Mientras que el outbound marketing intenta llegar al consumidor con un mensaje que le “interrumpa” (por ejemplo, anuncios en televisión, PPC, carteles), el inbound marketing busca crear una situación donde un cliente potencial descubra una empresa mientras busca una solución.Por ejemplo, un cliente que busca algo en Google y se encuentra con un artículo relevante en la web de una empresa.Público objetivo. Aunque se puede usar en B2C, en general, las técnicas de inbound marketing se usan más en entornos B2B.Qué canales suele involucrar. El inbound marketing puede involucrar varios canales. Al menos, necesitaremos una web o una landing (página de aterrizaje) y, generalmente, algún sistema para enviar emails. También es posible que estén involucradas redes sociales y que se realicen estrategias SEO para posicionar el contenido en buscadores.Cuándo usarlo y para qué tipo de empresa encaja mejor. Aunque muchas empresas se pueden aprovechar del inbound marketing, es un tipo de marketing que encaja mejor en empresas que venden a empresas (B2B) y productos con cierta complejidad, que necesitan más explicación o tienen ciclos de venta más largos.Pagado/orgánico. El inbound marketing suele hacer uso de medios orgánicos, pero se puede combinar también con pagados.Ejemplo de inbound marketingLas herramientas gratuitas de Ahrefs, como el Backlink Checker gratuito, están diseñadas como una forma de inbound marketing.Captan clientes desde las páginas de resultados de los motores de búsqueda (SERP, search engine results pages) en búsquedas como “backlink checker” o “analizar backlinks”. Si la demanda de búsqueda es alta, este tipo de herramienta gratuita puede traer una cantidad significativa de tráfico orgánico:Lecturas complementarias¿Qué es Inbound Marketing? Una Guía para Principiantes4. Outbound marketingEl outbound marketing es una forma de marketing de “interrupción” donde una empresa empuja un mensaje sobre un producto a un potencial cliente a través de llamadas en frío, emails en frío, correo directo o la mayoría de formas de publicidad, etc.El outbound marketing trata de incrementar el reconocimiento de un producto o inspirar acciones (por ejemplo, compra, suscripción, visitar una tienda) entre la audiencia objetivo sin tener en cuenta su interés.Público objetivo. Es un tipo de marketing general, que se realiza tanto a empresas como a personas, en casi todo los sectores.Qué canales suele involucrar. Casi cualquier canal puede servir para hacer outbound: redes sociales (con mensajes directos, por ejemplo), medios de comunicación tradicionales, llamadas telefónicas, etc.Cuándo usarlo y para qué tipo de empresa encaja mejor. Ciertas prácticas de outbound marketing pueden considerarse muy intrusivas, otras están más asumidas. Una de las ventajas que tienen son sus rápidos resultados, pero, como lado negativo, suele generar tasas de respuesta bajas y rechazo.Pagado/orgánico. En general, es pagado. Pero también nos podemos encontrar situaciones en las que no son claramente pagados, como cuando hablamos de mensajes directos en LinkedIn o campañas de buzoneo (repartir folletos en los buzones de correo).Ejemplos de outbound marketingLugares como Times Square en Nueva York son ejemplos de outbound marketing en su máximo exponente, tanto en términos de espacio usado para lanzar el mensaje como del presupuesto necesario para difundirlo. Lo que puedes ver en la foto de abajo es outbound marketing a través de carteles y vallas publicitarias.Las campañas de telemarketing también pueden ser otro ejemplo. Si estás leyendo esto, es posible que hayas recibido alguna llamada en tu vida para cambiar de operador y ese sería un claro caso de outbound marketing.No todo tiene que ser “tradicional”, también podemos encontrar muchos casos en los que se usan canales digitales para hacer outbound marketing, como el contacto directo a través de LinkedIn o de otras redes sociales.5. Marketing de contenidosEl marketing de contenidos es el proceso de crear y distribuir contenido para atraer y retener clientes.El marketing de contenidos en ocasiones se hace como una forma de inbound marketing, donde el contenido ofrece una solución a un problema que un potencial cliente está investigando. Los potenciales clientes descubren productos promocionados al aprender cómo se usan.Existe cierta confusión con el concepto, y para muchas personas significa cosas distintas. A veces nos podemos referir a gestionar contenidos en redes sociales, otras, a crear contenidos pensados para posicionar en buscadores.A menudo se utiliza para generar leads, con el contenido de mayor valor disponible después de rellenar un formulario que solicita información personal como nombre, número de teléfono o email. Más adelante, esa información se puede usar para otras tácticas de marketing (incluyendo outbound).Público objetivo. Se usa tanto en B2B como en B2C.Qué canales suele involucrar. Generalmente, webs y redes sociales, pero también correo electrónico y otras plataformas de contenido.Cuándo usarlo y para qué tipo de empresa encaja mejor. El marketing de contenidos suele (no siempre) funcionar mejor cuando tenemos productos o servicios de los que resulta útil o interesante generar contenidos. Categorías que en principio pueden parecer menos atractivas (productos financieros) pueden beneficiarse más del marketing de contenidos que otras que parecen más divertidas (caramelos).Pagado/orgánico. En general, orgánico (aunque se puede incrementar su visibilidad con tácticas de pago).Ejemplos de marketing de contenidosAlgunos tipos conocidos de marketing de contenidos son:Artículos de blogVídeos y vlogsPodcastsWebinarsCasos de estudioeBooksWhite papersAquí tienes un ejemplo de cómo algunos de estos tipos se pueden usar en una estrategia de marketing de contenidos coherente:Para saber másMarketing de Contenidos: Una Guía Coherente para 2021Cómo Crear una Estrategia de Contenidos Ganadora7 Ejemplos Inspiradores de Marketing de Contenidos (Y Cómo Replicarlos) - en inglés6. Marketing en buscadores (search engine marketing)El marketing en buscadores es un término usado para describir los mensajes promocionales que se publican en las SERP. El SEM divide el mensaje en dos categorías: resultados de pago y orgánicos.Los resultados orgánicos son páginas que un motor de búsqueda como Google encuentra, rastrea e indexa en sus SERP. La posición en resultados orgánicos no puede comprarse, solo se puede influir en ella a través del marketing de contenidos y el SEO.Los resultados pagados son una forma de publicidad de pago por clic o pay-per-click. Las empresas pagan a las empresas de motores de búsqueda para participar en una puja y competir por la mejor ubicación del anuncio. OpiniónAunque la definición “formal” de SEM incluya al SEO, en España y muchos países de América Latina se suele usar “SEM” para referirse en exclusiva a la publicidad pay-per-click que se hace en buscadores.En todas las empresas y agencias en las que he trabajado, se asumía de forma natural que el equipo de SEM se encargaba de la parte pagada y el de SEO de la orgánica.Público objetivo. Casi cualquier tipo de empresa, da igual que sea B2B o B2C.Qué canales suele involucrar. Buscadores (Google, Bing, etc.)Cuándo usarlo y para qué tipo de empresa encaja mejor. El marketing en buscadores es útil para casi cualquier empresa. Pero hay casos en los que resulta menos útil. Cuando nos encontramos con productos nuevos, sin demanda preexistente, puede ser más complicado o menos efectivo. Si, por ejemplo, lanzamos una nueva marca de zumo de naranja, podemos plantear nuestra estrategia en buscadores para posicionarnos (pagando o con resultados orgánicos) en términos relacionados con el zumo de naranja. Pero si lanzamos una bebida completamente nueva, tendremos que destinar más esfuerzos a crear la categoría. Eso sí, siempre podemos pensar en otro tipo de tácticas, como anunciarnos o posicionarnos en categorías adyacentes o competidoras (por ejemplo, si estás lanzando por primera vez una marca de kombucha en un mercado donde apenas se conoce esta bebida, quizá te interese aparecer en temas relacionados con el té o bebidas sanas).Pagado/orgánico. En la definición formal, ambos. En el uso que se da en España y otros países, solo pagado.Ejemplo de marketing en buscadoresSupongamos que quieres posicionar en la primera página de Google para la palabra clave “marketing automation” (automatización de marketing) en España. Tienes dos opciones para hacer esto: una es a través de resultados pagados y la otra es a través de resultados orgánicos.Cualquiera de estos serían resultados de pago: Y un resultado orgánico se parecerá a alguno de estos:Como ves, son muy parecidos (y encajan con lo que Google quiere). La principal diferencia es que le costará al anunciante 1-2 euros por clic el ser incluido entre los grandes actores en el espacio publicitario (eso en España, porque en Estados Unidos, por ejemplo, pueden ser más de 50$).Para ser incluido en el espacio no pagado, el orgánico, el anunciante tiene que crear contenido relevante que se alinee con la intención de búsqueda y conseguir algunos enlaces.Puntuación de dificultad de palabra clave (Keyword Difficulty) y coste medio por clic de la palabra clave “marketing automation” en España, en Keywords Explorer de Ahrefs.Lecturas complementariasSEO vs. SEM: ¿Cuál es la diferencia y por qué debería importarte?7. Growth marketingEl growth marketing es el proceso de incrementar los ingresos de una empresa mediante la aplicación de un enfoque integral dirigido por la experimentación en todas las fases de atracción de clientes.El growth marketing es otro término que se usa a menudo en contraposición al “marketing tradicional”. Esto es porque cuando el growth marketing entró en escena a principios de los 2000, fue rápidamente adoptado por las startups que necesitaban una aproximación distinta que les ayudara a:A. Competir con empresas establecidas.B. Conseguir la atención de inversores al probar tácticas de crecimiento escalables.La tabla siguiente explica las diferencias entre growth marketing, “marketing tradicional” y growth hacking.Público objetivo. Funciona tanto en B2B como en B2C.Qué canales suele involucrar. Generalmente, solo digitales.Cuándo usarlo y para qué tipo de empresa encaja mejor. Encaja mejor en startups y empresas pequeñas, que suelen trabajar mejor en entornos Agile.Pagado/orgánico. AmbosEjemplo de growth marketingHay muchas historias modernas maravillosas e inspiradoras de crecimiento: Slack, Spotify, Uber y Square.Pero quiero que te fijes en la estrategia de crecimiento de Notion porque parece captar correctamente casi todos los aspectos del growth marketing. Además, se ha analizado decenas de veces, por lo que es un gran ejemplo del que emprendedores y marketeros pueden aprender.El éxito de Notion se apoya en muchos pilares: un gran producto, una comunidad grande y participativa y el modelo “freemium”.Hace growth marketing pero no se trata de ningún tipo de growth hacking de black hat. Crece rápido, pero su estrategia está centrada en el cliente, no compromete a la marca y planifica en el largo plazo.Muchos también enfatizan el papel que juegan las plantillas generadas por los usuarios en el éxito de Notion. La empresa anima a que se creen y compartan plantillas que puedan utilizarse para varios documentos y operaciones.Los usuarios de Notion crean plantillas que atraen, vinculan y retienen a otros usuarios. Muchos de esos nuevos usuarios crearán y compartirán sus propias plantillas, siguiendo con el ciclo.Aquí tienes un gráfico Foundation que explica a la perfección cómo esta táctica toca el embudo de marketing al completo y forma un bucle de crecimiento.El Bucle de crecimiento de las “plantillas” para los SaaSUsar plantillas para atraer, activar y retener usuariosAtraer nuevos usuarios. Captar nuevos usuarios con plantillas que resuelvan sus problemas.Activar usuarios. Conseguir nuevos usuarios y hacer que avancen rápido usando plantillas como plataforma de lanzamiento.Retener usuarios. Sacar a la luz más plantillas para más casos de uso que sirvan para retener usuarios.Los usuarios crean plantillas. Los usuarios activos crean sus propias plantillas para compartir con la comunidad.8. Marketing B2BEl marketing B2B, o marketing para empresas (business-to-business, de empresa a empresa) se refiere al marketing de productos o servicios de empresas para otras empresas.Este término se usa mucho entre profesionales del marketing para nombrar y diferenciar tipos de estrategias de marketing y tácticas que son especialmente efectivas en las relaciones B2B (por ejemplo, el account-based marketing o marketing basado en cuentas), al contrario que las relaciones de empresa a consumidor (B2C o business-to-consumer).El marketing B2B suele tener más relación con tácticas de ventas que el marketing de consumo pero hay excepciones. En muchas empresas conviven ambos tipos de marketing.A veces, empresas que parecen puramente B2C (telcos, energéticas o banca) tienen unidades B2B muy importantes que trabajan de forma casi independiente (compartiendo la marca y parte de la cultura).En muchos casos, la unidad B2B es más grande que la B2C. Cuando trabajaba como consultor, a través de una agencia, en una empresa energética (CEPSA), descubrí que más de la mitad de su facturación provenía de vender a otras empresas, aunque en mi cabeza, era una empresa que solo vendía a personas.Público objetivo. Aquí es obvio que empresas.Qué canales suele involucrar. Puede involucrar casi cualquier canal, pero los medios de comunicación masivos (como televisión o revistas) son menos habituales. Es un error pensar que el marketing B2B se reduce a LinkedIn y poco más, al final, aunque se venda a empresas, las empresas están compuestas por personas. Personas que también buscan en Google o usan Instagram.Cuándo usarlo y para qué tipo de empresa encaja mejor. Cuando el público de tu empresa sean otras empresas.Pagado/orgánico. Ambos.Ejemplos de marketing B2BA las empresas les gusta anunciarse en LinkedIn. La razón: sus usuarios van a la plataforma con propósitos relacionados con el trabajo. LinkedIn se aprovecha de eso (por diseño) y ofrece una variedad de productos publicitarios.De lejos, LinkedIn supone un tercio de toda la facturación publicitaria B2B en Estados Unidos. Como puedes ver abajo, incluso gigantes como IBM usan los anuncios de LinkedIn para atraer clientes.Este anuncio B2B apunta a un formulario de captación de leads que ofrece créditos gratuitos en el servicio de cloud (nube) de IBM.CuriosidadComo curiosidad, cuando entras en LinkedIn, lo primero que ves es una publicación orgánica, lo segundo, es siempre un anuncio (o casi siempre). Fíjate a partir de ahora.A veces la segmentación deja algo que desear, como este anuncio que está dirigido a personas que tienen una cartera de 500.000€ (no es mi caso, por desgracia).También se puede hacer marketing B2B en canales que consideramos de “consumo y ocio”, como Instagram o Facebook.Por ejemplo, en esta campaña, Atlassian está anunciando plantillas de Confluence, con la idea de generar leads cualificados.¿Por qué? Básicamente, los costes de LinkedIn suelen ser más altos que los de Instagram o Facebook, por lo que existe toda una industria para llegar a ese tipo de público profesional en plataformas de consumo.Lecturas complementariasGuía para principiantes de Account-Based Marketing (ABM) - en inglés¿Qué es el marketing de contenidos B2B? 7 ejemplos exitosos9. Marketing B2CEl marketing B2C, o marketing de empresa a consumidor (business-to-consumer marketing) se refiere al marketing de productos o servicios de empresas a consumidores finales.En el mundo del marketing, a menudo se usa este término para nombrar y distinguir los tipos de estrategias de marketing y tácticas que son especialmente efectivas en las relaciones B2C (por ejemplo, el marketing de influencers), en contraposición a las relaciones B2B.Aunque las barreras se desdibujan en muchos casos y las tácticas que se suelen considerar B2C pueden ser efectivas en B2B.Público objetivo. Personas físicas, no empresas.Qué canales suele involucrar. Cualquier canal.Cuándo usarlo y para qué tipo de empresa encaja mejor. Hablamos de un tipo de marketing tan general, que cualquier empresa que venda a cliente final, a personas, hará algún tipo de marketing B2C (incluso las que piensan que no hacen marketing).Pagado/orgánico. Ambas.Ejemplo de marketing B2CEl marketing B2C está en todas partes. Ni siquiera tengo que enlazar un estudio que te pruebe cuánto nos bombardean con anuncios. Solo necesitas mirar a tu alrededor.Todas las cosas que posees se compraron por el marketing B2C. Eso quiere decir que, o bien viste alguna forma de publicidad o promoción B2C que te convenció de hacer una compra, o alguien más te habló de lo genial que era el producto, o lo encontraste en el momento que lo necesitabas.Permite que empiece este ejercicio terapéutico conmigo mismo.Un día, estaba con mis cosas. De repente, recibí un email de Vans diciendo que tenía estas enormes rebajas del inventario de su outlet. Ok, Vans. Haré clic.Ese email (está en polaco) me llevó a su página landing, donde vi estas zapatillas.Eran exactamente lo que necesitaba ese otoño. Así que unos pocos días después, las zapatillas aparecieron en mi puerta.Y esa es la historia resumida de cómo el marketing B2C me hizo comprar unas zapatillas en segundos. Ni siquiera visité la tienda para probármelas. Estaba haciendo algo completamente distinto y ni siquiera pensaba comprar unas zapatillas.Pero no todos los emails pueden hacer eso. Estás viendo el poder de la marca, siendo Vans una de mis marcas favoritas.Con emails como estos y oportunidades de compra online, una marca puede capitalizar sobre cualquier otra actividad en la que haya invertido, haciendo que las conozcamos, nos gusten y confiemos en ellas.Este ejemplo es muy obvio. Es habitual confundir el marketing B2C con la publicidad, y no tiene por qué ser así. El marketing es mucho más amplio y podemos encontrar otros más sutiles o, incluso, que son “anti publicidad”.O2, parte de Telefónica (la principal telco española), ha hecho de la “no publicidad intrusiva” una seña de identidad. En lugar de llamar para que te pases a su empresa, dar las mejores promociones a los nuevos clientes y maltratar a los existentes, O2 te promete (y lo cumple) no molestarte, contactarte solo para cosas necesarias (facturas, cambios en las condiciones) y darte acceso a las mismas ventajas que a los nuevos clientes.Este es un extracto del email que recibes cuando te das de alta:Además de las facturas, solo recibo algún email para comunicarme cosas como las mejoras en el servicio, como este:O2 sigue la misma filosofía que en su día llevó a Pepephone al éxito, donde Pedro Serrahima aplicó estrategias de marketing desde el sentido común y completamente contrarias a las que seguían el resto de empresas del sector.10. Marketing de afiliadosEl marketing de afiliados es un tipo de promoción donde una empresa le paga una comisión a una web externa por tráfico o ventas generadas.Puedes detectar enlaces de afiliados sobre todo en blogs. Estos son los enlaces que contienen parámetros de seguimiento como “tag” (etiqueta), “hop” o “customid” (identificador personalizado):Eso quiere decir que el propietario del sitio web recibe una comisión cada vez que alguien hace clic en ese enlace o compra algo a través del mismo. De esta forma, la empresa que paga recompensa a los afiliados influyendo en sus ingresos.Público objetivo. Tanto B2C, como B2B (sobre todo, con software, donde los programas de afiliación son muy habituales).Qué canales suele involucrar. En general, web o email, donde los enlaces son más fácilmente trazables. Pero también se utiliza mucho en redes sociales. Prácticamente siempre se hace a través de canales digitales.Cuándo usarlo y para qué tipo de empresa encaja mejor. Cuando tengas un producto o servicio en el que las recomendaciones de otros clientes sean importantes.Pagado/orgánico. En cierto modo, se encuentra en la intersección.Ejemplos de marketing de afiliadosEste blog de cocina explica cómo incrementó sus ingresos por cinco en tres meses, siendo una de las tácticas el marketing de afiliados.Alguien compró cápsulas de setas por valor de 3.240 $ en Amazon tras hacer clic en un enlace en el blog. Y solo por eso, los dueños recibieron 145 $ ese día, 24 horas después de publicar un artículo destacando esas cápsulas de setas.Todos ganan en esta historia—el productor, el comercio, Amazon, ese blog y la persona que compró las cápsulas (supongo).Hay otra forma de marketing de afiliados que a veces se llama partner marketing (aunque partner marketing tiene al menos dos significados distintos).Es cuando los proveedores de soluciones tienen un programa de partners (asociados) para que otras empresas generen la demanda y adopción de un producto o servicio usando las capacidades de mercado de los asistentes al programa.Así es como Microsoft presenta su programa de partners: “Microsoft Partner Network es un centro de personas, recursos y ofertas que se reúnen para ofrecerle todo lo que necesita para desarrollar y ofrecer soluciones exitosas para sus clientes”.Otro ejemplo puede ser Wetaca. Wetaca es un servicio de comida envasada al vacío a domicilio, que funciona tanto por suscripción como por compra de menús.Uno de sus motores de crecimiento es su programa de afiliados: cada cliente tiene su propio código para invitar a sus amigos y familiares (o compartir por redes sociales o WhatsApp), con el que dan 20€ a cada uno (al que invita y al que recibe la invitación):También lo mezcla con marketing de influencers, pero ese ejemplo lo vamos a ver después.Lecturas complementariasMarketing de afiliación para principiantes: 7 Pasos al éxitoCómo construir un exitoso sitio afiliado de Amazon (paso a paso)11. Marketing en redes socialesEl marketing en redes sociales es el uso de medios sociales como Facebook, Twitter o LinkedIn para llevar al mercado los productos o servicios de una empresa.El objetivo de las redes sociales es hacer crecer una audiencia e interactuar con ella. Esto lleva a un mayor conocimiento de marca, tráfico a la web y, con el tiempo, a ventas.El marketing en redes sociales contiene una mezcla de tácticas, incluyendo publicar contenido, responder a comentarios y hacer publicidad en redes sociales.Público objetivo. Tanto B2B como B2C.Qué canales suele involucrar. Redes sociales, como Instagram, TikTok, X (Twitter), LinkedIn o Facebook.Cuándo usarlo y para qué tipo de empresa encaja mejor. El marketing en redes sociales lo puede hacer prácticamente cualquier empresa.Pagado/orgánico. Ambas. La gestión del contenido y comentarios son tácticas orgánicas, pero también se puede hacer publicidad pagada en redes sociales.Ejemplo de marketing en redes socialesLa cuenta de Twitter de Wendy’s se ha convertido en casi una leyenda. Aquí está el por qué:La historia comenzó con roasts (un tipo de humor basado en insultos cómicos) que no perdonaban a nadie. Empezó de forma accidental con una respuesta directa a un comentario no muy inteligente de un cliente y rápidamente evolucionó para ser lo destacado de este usuario de Twitter.Ese tipo de “voz de marca” le dio a los mensajes de Wendy’s un toque de autenticidad que hizo que sus competidores sonaran como corporaciones sin corazón.Mientras más personas se fijaban en lo próximo que iba a decir Wendy’s, apareció este tuit, también conocido como el tercer tuit más retuiteado en la historia:HELP ME PLEASE. A MAN NEEDS HIS NUGGS pic.twitter.com/4SrfHmEMo3— Carter Wilkerson (@carterjwm) April 6, 2017Este hombre no consiguió esos 18 millones de retuits (solo 3.1 millones). Pero Wendy’s le dio un año de nuggets de pollo gratis de todas formas. Wendy’s probó no solo que puede conseguir la atención de la gente, sino también que mantiene sus promesas (algo por lo que no son conocidas las cadenas de comida rápida).Hay más estudios sobre el caso de Wendy’s en redes sociales (mira GroupNug o March Madness). Pero aunque empuje los límites del marketing corporativo, Wendy’s no se olvida de que las redes sociales también tienen que ver con el servicio de atención al cliente o con simplemente promocionar el negocio de vez en cuando.En España, el uso de Twitter de KFC también hace un gran uso del humor y los memes.Algo que también le está funcionando en TikTok o Instagram, donde, según los paneles de la consultora Epsilon, es una de las marcas que más conversación genera.Fuente: Epsilon.Pero no todo tienen que ser “cosas divertidas y graciosas” en redes sociales. Podemos ver casos de empresas “serias” que crean contenido en TikTok.Notion, una herramienta de gestión de proyectos y conocimiento, tiene más de 120.000 seguidores en TikTok, donde comparte tutoriales, trucos y mucho más: @notionhqShow us how you use Notion AI for studying! 📚 #notion #notionapp #notiontok #notionai #notiontemplate #backtoschool #notionforlife #challenge ♬ original sound - Notion 12. Branding o brand marketingEl branding o brand marketing es un término que describe las acciones que promocionan un producto o servicio de forma que destaca la marca y forma su imagen.Pero, ¿qué es una marca?En el moderno campo del marketing es bastante difícil dar una definición que sea exhaustiva y satisfactoria. Después de todo, el marketing de marca se practica en muchos estilos.Como dice Fernando de Córdoba, experto en branding y estrategias de contenido, “una marca es un cajoncito mental”. Una marca es, sobre todo, coherencia, manteniendo la consistencia en todos los puntos de contacto.Aquí van algunos ejemplos de marcas fuertes. Fíjate con qué las asocias.AppleMastercardLos VengadoresFacebookBMWCoca-Cola¿Qué se te ocurrió? ¿Despertaron estos nombres en tu mente algún tipo de imagen o asociación con una persona? Quizá evocaron cierto sentimiento y recuerdos, o incluso te dieron sed. Eso es lo que las marcas son en esencia: activadores cognitivos y emocionales.Así que es menos importante lo que son las marcas. En su lugar, es bastante más importante lo que hacen. Y ese es el objetivo del branding, fortalecer el efecto que las marcas tienen en los consumidores y hacer que:Reconozcan el producto (y lo distingan del resto). De otra forma, te harías la pregunta: “¿es esa la barrita de chocolate tan rica que me tomé la última vez?”La asocien con una experiencia positiva. Puede que no hayas probado el producto. Pero si la fantasía de verte consumiendo el producto te da un sentimiento positivo, eso es todo lo que importa.Racionalicen el coste del producto. Los BMW no son los coches mejor fabricados del mundo. Y tampoco son los más baratos. Aún así, en Estados Unidos y otros mercados se dice de BMW que es “la máquina de conducción definitiva”. Y las campañas de marca de BMW (como vimos un poco más arriba) han sido todo un éxito.Los clientes no son el único objetivo posible del branding. Las empresas también pueden usar este tipo de marketing para incrementar su valoración en bolsa o atraer talento a su empresa (employer branding).Público objetivo. B2C y B2B.Qué canales suele involucrar. Ninguno en concreto. Es algo que hay que aplicar en todos los puntos de contacto.Cuándo usarlo y para qué tipo de empresa encaja mejor. A pesar de lo que se suele pensar, todas las empresas, e incluso las personas de forma individual, deberían (deberíamos) pensar en nuestra marca.Pagado/orgánico. Ambas.Ejemplo de brandingTengo que ser honesto. Me enamoré de este anuncio al momento. Hizo que quisiera comprar algunos LEGO y “reconstruir el mundo” (rebuild the world):https://youtu.be/XraFU5BjYjQEl anuncio muestra un poco del producto de LEGO. Pero, más importante, destaca a la marca y da forma a su imagen.No sé si estarás de acuerdo conmigo, pero este anuncio enmarca a LEGO como juguetes positivos, no violentos y con estímulos cognitivos para todo el mundo.Más aún, este es el juguete para los creadores del mañana. Un mundo construido sobre la diversidad, el respeto y la ayuda mutua; un mundo que no es de suma cero.Y no importa qué set de LEGO compres—todos son así. Y a través del branding, LEGO se las ha apañado para lanzar todo ese mensaje en 60 segundos.Pero no todo se reduce a anuncios y spots. Cada contacto con el cliente es un punto crítico en el que podemos (y debemos) ser coherentes con nuestra marca. Como vimos en el ejemplo de marketing B2C con O2, de nada sirve invertir en campañas que digan una cosa, si luego hacemos la contraria.13. Marketing directoEl marketing directo es una estrategia en la que la empresa se comunica de forma directa con la audiencia objetivo en lugar de usar medios masivos.El marketing directo se elige normalmente por sus costes más bajos (en comparación con los medios masivos), la habilidad de personalizar el mensaje y la posibilidad de que la audiencia responda al mensaje (por ejemplo, a través de un formulario).Público objetivo. Tanto B2B como B2C.Qué canales suele involucrar. Solo canales directos.Cuándo usarlo y para qué tipo de empresa encaja mejor. Casi cualquier empresa.Pagado/orgánico. Pagado.Ejemplo de marketing directoTodos recibimos marketing directo. La prueba de eso es la pequeña caja metálica que muchos tenemos junto al buzón, diseñada para que los flyers y catálogos queden ordenados en un único sitio. También se puede ver en la omnipresencia de este tipo de señales:Pero ahora, permite que te dé un ejemplo positivo y efectivo de marketing directo: los primeros catálogos de Ikea.Así es como empezó el negocio de Ikea en sus principios. Ikea era algo distinta en aquellos tiempos. No vendía principalmente muebles; vendía prácticamente de todo.Este es un ejemplo de un catálogo por correo de Ikea de 1950:Hoy en día, podemos simplemente ir a la tienda Ikea y recoger algo. Nadie necesita enviarnos nada por correo. Mejor aún, podemos ver el inventario online y hacer una compra sin salir de casa.Y esa era la idea que había detrás de los primeros catálogos de Ikea que se encontraban en un mundo sin internet y con muy pocas televisiones. Era una solución ingeniosa (pero no exactamente original) para llegar a muchos clientes potenciales y “disminuir la fricción” de comprar productos.También, para la gente que vivía en áreas remotas de Suecia, los catálogos representaban variedad y estilo enviados a sus puertas.Otro caso que me gusta recordar tiene más de 25 años, no es nada original y se ha usado cientos de veces, pero puede ser muy efectivo.En los 90, Gillette, la conocida marca de cuchillas de afeitar, distribuyó por todos los buzones de mi ciudad unos folletos (no tengo la imagen, esto ocurrió en la era anterior al móvil) con unas pegatinas. En el folleto ponía algo así:¿Quieres una maquinilla de afeitar gratis? Pon esta pegatina en tu buzón y te dejaremos una con 2 cuchillas.Justo estaba empezando a afeitarme, así que puse la pegatina y unos días después tenía una maquinilla nueva en mi casa. La usé durante años, gastando cientos de recambios. Una campaña simple, muy poco original, pero efectiva.14. Marketing de influencersEl marketing de influencers es la práctica de trabajar con personas influyentes para promocionar marcas, productos o servicios.En este sentido, un influencer puede ser cualquiera con una red significativa, o “base de seguidores”, de personas o una autoridad en un campo concreto.Los mecanismos de influencia que se apoyan en este tipo de marketing pueden adoptar muchas formas: inspiración, confianza, creencia e imitación. El marketing de influencers es efectivo porque seguir los ejemplos de otros, o los consejos, ayuda a las personas a tomar decisiones.Más aún, ya que la influencia es un fenómeno de relaciones humanas, el marketing de influencers funciona tanto en B2B como en B2C.Público objetivo. B2B y B2C.Qué canales suele involucrar. Canales digitales, sobre todo, redes sociales (pero también webs o email).Cuándo usarlo y para qué tipo de empresa encaja mejor. Funciona mejor cuando el producto o servicio tiene un componente de recomendación importante.Pagado/orgánico. Pagado, pero aprovechando la audiencia del propio influencer.Ejemplos de marketing de influencersAquí va un ejemplo de una superproducción de marketing de influencers.La YouTuber Meredith Foster era una de las pocas influencers cuidadosamente seleccionadas para promocionar la nueva línea de smartphones de Motorola.Aquí tienes lo que se le ocurrió a Meredith:Quiero agradecer a Lenovo por patrocinar este vídeo y enviarme el Moto Z y #MotoMods.Echa un vistazo a todos los Moto Mods + los vídeos de YouTube Heroes:El canal de Meredith tiene 4,8 millones de suscriptores. Compara eso con el alcance medio de los programas de noticias en Estados Unidos y es fácil ver por qué el marketing de influencers puede ser una estrategia poderosa.Como comentamos en el punto de “marketing de afiliación”, Wetaca (comida envasada al vacío a domicilio) hace un uso interesante del marketing de influencers, mezclándolo con la afiliación.Si buscas “código Wetaca” en X (Twitter), puedes ver cientos de personas compartiendo sus códigos:Muchos de estas personas tienen decenas de miles de seguidores. A los usuarios más influyentes, Wetaca les regala la comida de la semana a cambio de que compartan estas publicaciones (además de lo que generen con sus códigos de venta).Lecturas complementariasInfluencer Marketing en 2021: definición, ejemplos y tácticas15. Email marketingEl email marketing es cualquier tipo de mensajes de marketing enviados a través del correo electrónico.Dicho esto, el email marketing no es solo enviar emails. Conlleva:Construir una lista de email.Diseñar y enviar emails a la lista de suscriptores.Hacer seguimiento de los resultados.Cuidar la lista de email.Este tipo de marketing sirve a 4 propósitos principales:Generar tráfico. Puedes comunicarte con tu audiencia a través de emails con el objetivo de llevarles desde el email a una página específica, por ejemplo, a tu último contenido.Lead nurturing. Esto incluye las conocidas como campañas drip (goteo en inglés), usadas de forma metódica email a email y toque a toque, llevando a los suscriptores de email a una oportunidad de compra. Este proceso también “cualifica” leads en diferentes tipos de suscriptores, por ejemplo, oportunidades potenciales de negocio y fans de la marca.Onboarding. Se refiere a secuencias de email enviadas a través del “ciclo de vida” de un cliente para hacer que descubran y experimenten el valor de un producto y con el tiempo fidelizarlos. Un uso común de los emails de onboarding es dentro del período de pruebas de un producto SaaS.Generar ingresos. Como Vans hizo conmigo. Las marcas a menudo ofrecen a los clientes un incentivo para registrarse en una newsletter, como el 20% de descuento en la próxima compra. Después les envían ofertas especiales a los suscriptores de email.Público objetivo. B2B y B2C. Suele hacerse con clientes existentes o potenciales, que son parte de la lista de la empresa, pero también se pueden hacer envíos a listas de terceros.Qué canales suele involucrar. Email.Cuándo usarlo y para qué tipo de empresa encaja mejor. El email es uno de los canales de marketing más clásicos y rentables. Lo puede usar cualquier tipo de empresa, pero en fases iniciales es más complicado (porque todavía no tendrás una base de datos a la que enviar emails y tendrás que construirla).Pagado/orgánico. Orgánico.Ejemplos de email marketingYa que te he mostrado dos emails antes, y dado que probablemente recibes un montón de mensajes de correo electrónico, aquí va una ilustración de un workflow de email marketing.En esta sencilla campaña de drip por email, los receptores reciben emails en función a su interacción de forma automática.Si los receptores reaccionan positivamente a los emails, reciben más materiales educativos en profundidad e incluso una demo de producto.Pero si no abren los emails siguientes, se les pone en el camino de materiales educativos que consumen menos tiempo y con el tiempo se les saca del workflow de la campaña drip.Este tipo de workflow o flujo de trabajo de email marketing se puede diseñar a través de un editor WYSIWYG (What You See Is What You Get, lo que ves es lo que obtienes) en muchas de las herramientas de email de hoy en día sin tener que saber programar.Probablemente recibas decenas de emails al día, así que te resultará fácil encontrar más ejemplos.El email marketing también se puede utilizar para reactivar clientes dormidos, como trata de hacer Nespresso conmigo en este caso:16. Marketing Word-of-mouth (WOMM)El marketing boca a boca, boca a oreja o word-of-mouth marketing es el proceso de influir y animar las discusiones naturales sobre un producto, servicio o empresa.En el día a día, se pueden describir dos tipos de situaciones:WOMM que se produce como “efecto colateral”, de forma natural, de las operaciones de una empresa, como superar las expectativas de un consumidor de un producto o servicio. En casos así, la empresa puede que no tenga la intención de influir activamente en la difusión de los debates. Sin embargo, su forma de actuar crea una experiencia tan fuerte que los clientes quieren compartirla con sus amigos, familiares, seguidores en las redes sociales, etc.WOMM como táctica usada para influir con intención y de forma activa en la difusión de debates sobre la empresa o sus productos o servicios. Este tipo de WOMM será el foco de este breve capítulo.La esencia del WOMM es darle a las personas una razón para que hablen. La razón por la que esta estrategia funciona es que la gente a menudo confía en lo que otras personas tienen que decir.Ese fenómeno incluso ha sido estudiado:Un estudio de Nielsen de 2021 reveló que el 89% de los de los encuestados confiaba en las recomendaciones de personas que conocían. Sin embargo, apenas un tercio confiaba en los canales de publicidad online (los anuncios en televisión o el product placement, gozaban de bastante más credibilidad).El mencionado “motivo para hablar” no tiene por qué ser una recomendación de los servicios de una empresa. Puede ser cualquier cosa que dé publicidad a una empresa, cree buzz (ruido) y aumente el reconocimiento de su marca. Por eso, a menudo el WOMM recibe el nombre de buzz marketing.El word-of-mouth marketing o marketing boca a boca puede adoptar muchas formas. Puede empezar como una campaña en redes sociales, una campaña de PR o de recomendación que incentiva la difusión del mensaje de la empresa.Público objetivo. Tanto B2B como B2C. En empresas, es muy común confiar en las opiniones de otros profesionales (sobre proveedores o herramientas, por ejemplo).Qué canales suele involucrar. Recomendaciones de personas.Cuándo usarlo y para qué tipo de empresa encaja mejor. Es difícil que este tipo de marketing funcione si tienes un mal producto o servicio, hará más mal que bien.Pagado/orgánico. Orgánico (puede combinarse con pagado, usando las opiniones de otras personas como material publicitario).Ejemplos de word-of-mouth marketing Una cosa es “ganarse” el word-of-mouth marketing en forma de reviews positivas y conversaciones en redes sociales en los que no se haya influido. Otra cosa es diseñar y controlar toda la película.En “Buzzmarketing: Get People to Talk About Your Stuff” (“Buzzmarketing: Consigue que la gente hable de tus cosas”), Mark Hughes describe cómo se las ingenió para cambiar el nombre de una ciudad en Estados Unidos al nombre de una startup de plataforma de e-commerce que estaba promocionando.Así que una ciudad llamada Halfway fue renombrada a Half.com. Durante un año. Eso literalmente puso a la nueva plataforma de e-commerce en el mapa.Ese acto era tan notable que atrajo la atención de Associated Press (AP), Reuters, USA Today, Good Morning America, entre otros. Así que imagina cuánta publicidad consiguió esa empresa de e-commerce con esta única acción—todo a tiempo para el lanzamiento de la plataforma.A cambio, la ciudad de Halfway recibió nuevos equipos informáticos para la escuela, una nueva web y 110.000 $.Y seis meses después, Half.com (el e-commerce) fue vendido a eBay por 300 millones de dólares.Otro ejemplo interesante, que mezcla el contenido generado por el usuario, con el boca a oreja, puede ser la campaña de Spotify con carteles (físicos) en Nueva York, dedicada a un usuario que reprodujo la canción “Sorry” (lo siento) 42 veces en San Valentín:Aprovecha los datos de la propia plataforma para crear algo que puede generar conversación, invirtiendo también en distribución pagada (los carteles).17. Marketing de eventosEl marketing de eventos es una táctica de marketing donde los eventos de marca se usan como forma de comunicación con la audiencia objetivo y promoción de productos o servicios.El objetivo del marketing de eventos es crear una experiencia memorable interactuando con los participantes del evento, animándolos a interactuar directamente con la marca.Las interacciones pueden adoptar distintas formas: probar un producto, ver una demostración de producto, ver un concierto, asistir a comidas, networking, tomar parte en un seminario o conferencia, etc.Pueden ser eventos propios (creados y promovidos por la marca) o que se realicen junto a otras empresas.Público objetivo. Tanto en B2C como en B2B.Qué canales suele involucrar. Eventos.Cuándo usarlo y para qué tipo de empresa encaja mejor. Los eventos pueden ser más complicados de lo que parece. Y, a veces, reunir una audiencia es más difícil de lo que se cabría esperar. Funcionan mejor en empresas que ya están establecidas y cuentan con cierta presencia (aunque también se puede hacer con partners para evitar problemas).Pagado/orgánico. Orgánico. La difusión puede ser pagada.Ejemplos de marketing de eventosDesde 2003, Salesforce ha organizado un evento anual llamado Dreamforce. Reúne a “la comunidad global de Salesforce para aprender, divertirse, crear comunidad y filantropía”.El evento es un gran parque temático temporal para todo lo relacionado con Salesforce y que dura tres días. Este año, el evento también se difundió por streaming.Permite a Salesforce crear un experiencia de producto con varias caras: los asistentes pueden aprender sobre las novedades de producto de Salesforce, descubrir usos avanzados del CRM y conseguir alguna certificación en Salesforce.Pero al igual que cualquier parque temático, tiene distintos tipos de atracciones. El evento no solo promociona el CRM de Salesforce. Dreamforce es una oportunidad para escuchar charlas de celebridades, líderes de opinión y políticos. Por último, pero no menos importante, los asistentes pueden divertirse en una fiesta.Lo que también es interesante sobre este ejemplo de marketing de eventos es que está abierto a otras marcas. La friolera de 103 marcas distintas ayudan a que Salesforce haga posible este evento a través de patrocinios, consiguiendo su parte de reconocimiento de marca.También puedes colaborar con otras empresas para organizar o participar en sus eventos. Por ejemplo, en nuestro caso, hace poco colaboramos con la agencia de SEO y marketing online Internet República¡Comienza el taller de @ahrefs de la mano de @erik_sarissky! 🚀Muy agradecidos de tenerte hoy con nosotros, en un rato también en ¡nuestro #TerraSEO! 🌴🤗 pic.twitter.com/SqQ7zT6fMf— Internet República (@i_Republica) September 28, 2023Internet República lleva años organizando TerraSEO, un evento de networking SEO. Este mismo año, nuestro country manager para España y LATAM, Erik Sarissky, participó en el evento con un taller de las herramientas SEO de ahrefs.18. Marketing de guerrillaEl marketing de guerrilla es un tipo de marketing que incluye el uso de interacciones no convencionales e inesperadas para evocar emociones fuertes y provocar el boca a boca.Algunas características del marketing de guerrilla:Bajo coste.Creativo.Mensajes fáciles y breves.Uso de lugares públicos como calles o centros comerciales como medio publicitario.Crea una impresión fuerte, memorable.Público objetivo. B2C generalmente (pero vamos a ver un ejemplo de B2B, aunque no lo parezca, también es posible).Qué canales suele involucrar. No se trata de un canal específico, se trata de aprovechar canales de forma no convencional.Cuándo usarlo y para qué tipo de empresa encaja mejor. Por experiencia propia, es algo que depende mucho más de la cultura interna de lo que pueda parecer. En teoría, casi cualquier empresa podría hacer marketing de guerrilla, pero es difícil hacerlo si hay que pasar por 12 departamentos y comités.Pagado/orgánico. Ninguna de las dos.Ejemplos de marketing de guerrillaCreo que este ejemplo cumple todas las casillas como marketing de guerrilla ejemplar.Este es uno de los muchos ejemplos de la campaña de promoción de guerrilla de la película “IT”. Incluso si no has oído hablar del payaso mortal de la novela de Stephen King, esta señal es tan rara que seguro que al menos te hace buscar en Google la película.Más aún, apuesto a que le dirías a otras personas lo que viste ese día o incluso puede que lo pusieras en Twitter (yo sé que lo haría).Y si al final fueras a ver la película y vieras esa escena con el globo saliendo de la alcantarilla, recordar este anuncio de guerrilla haría la película más real y aterradora.Respecto al coste de esta campaña, es bastante obvio. Es el coste de algunos globos, cuerda y pintura blanca.Hablamos de Salesforce hace nada para mencionar su evento, Dreamforce. Lo que no es tan conocido (aunque roza la categoría de mito para los expertos en marketing para SaaS) es cómo Salesforce boicoteaba los eventos de la competencia a principios de los 2000, cuando todavía era una joven startup que estaba peleando contra gigantes como Oracle o Siebel.En un momento dado, llegaron incluso a contratar manifestantes de mentira en eventos de la competencia e, incluso, pagaban a medios (también falsos) para entrevistar a esos manifestantes. Lo cuenta en su libro, Behind the Cloud, Marc Benioff, el fundador de Salesforce.Imagen: Flickr de Salesforce.19. SaaS MarketingEl SaaS marketing es el proceso de construir reconocimiento de marca, incrementar el interés y adquirir más clientes para un producto de software como servicio (SaaS, software as a service).En el caso de Ahrefs, siendo una herramienta SaaS, tenemos mucho que contar, pero vamos a hacerlo sencillo (debajo enlazamos una guía completa): el marketing para SaaS involucra muchos otros tipos de marketing, desde los eventos al SEO o la creación de contenidos.Cada caso es único y todo depende del público al que te dirijas y el tipo de SaaS que seas.Público objetivo. Tanto B2B como B2C.Qué canales suele involucrar. Prácticamente cualquier canal.Cuándo usarlo y para qué tipo de empresa encaja mejor. En este caso, se aplica a empresas que venden software.Pagado/orgánico. Ambos.Ejemplos de SaaS marketingYa hemos citado ejemplos de Salesforce (que, en cierto modo, fue quien creó la categoría SaaS), pero en este caso podemos hablar de Ahrefs directamente. Si estás leyendo esto, probablemente ya sepas que Ahrefs es una herramienta de SEO todo en uno.Como comentamos en el caso de inbound, una de las tácticas que usamos consiste en crear herramientas gratuitas que cuenten con alguna parte de las funcionalidades de la herramienta completa. Los usuarios llegan cuando buscan una solución a sus problemas, se registran, usan nuestra herramienta y así conseguimos captar nuevos clientes potenciales, que nos conocerán mejor y tendrán una idea más clara de lo que podemos hacer.Las herramientas gratuitas de SEO son una importante fuente de tráfico para Ahrefs:Y, por supuesto, también de clientes satisfechos:En las guías que te dejamos a continuación puedes aprender más sobre otras técnicas de SaaS Marketing.Lecturas complementarias¿Qué es el SaaS marketing? 8 Tácticas que usamos en Ahrefs (en inglés)Marketing de contenidos para SaaS20. Marketing conversacionalEl marketing conversacional propone usar el diálogo y las conversaciones en tiempo real para interactuar con clientes potenciales y acelerar el proceso de ventas.El término fue acuñado por Drift, una plataforma de “chat en web” y marketing conversacional.Público objetivo. B2B y B2C.Qué canales suele involucrar. Web y chat.Cuándo usarlo y para qué tipo de empresa encaja mejor. Lo puede usar casi cualquier tipo de empresa, pero aquellas que cuenten con productos o servicios complejos que requieran de más interacción y aclaraciones se pueden beneficiar más.Pagado/orgánico. Orgánico (aunque la captación del tráfico puede ser pagada).Ejemplos de marketing conversacionalLa propia Drift cuenta con un buen caso de uso, pero, en español, podemos ver que HubSpot también lo ha implementado:En su página web sobre marketing conversacional, lanza un chatbot donde podemos interactuar, dejar nuestros datos y conseguir más información.Como en muchos otros ejemplos, aquí estamos mezclando SEO (llegué a la página buscando en Google “marketing conversacional”), marketing de contenidos (ofrecen un descargable sobre el tema) y marketing conversacional (porque todo se puede gestionar desde el chat).21. Branded contentExisten varias definiciones de lo que es el branded content, pero en su base, se trata de acciones de marketing y comunicación que buscan conectar con el público objetivo de una marca, transmitiendo sus valores y aportando valor en forma de entretenimiento o información útil.En España tenemos la definición oficial de la BCMA (Branded Content Marketing Association):Branded Content es un activo/s de comunicación producido/s o coproducido/s por una marca que, mediante formatos que cumplan un rol de entretenimiento, información y/o utilidad, tiene el fin de comunicar sus valores y conectar con una audiencia, que al encontrarlo relevante le dedica voluntariamente su tiempo de atención.Público objetivo. Tanto B2C (más común) como B2B.Qué canales suele involucrar. No depende de un único canal.Cuándo usarlo y para qué tipo de empresa encaja mejor. En general, las acciones de branded content suelen contar con presupuestos de cierto volumen, pero no siempre es el caso, por lo que casi cualquier empresa puede usarlo.Pagado/orgánico. Principalmente orgánico, pero se puede incrementar el alcance con medios pagados.Lecturas complementariasBranded content: guía completa con ejemplosEjemplos de branded contentExisten muchos casos. Vamos a nombrar un par de los más conocidos.El banco español BBVA lanzó en 2018 “Aprendemos Juntos” (actualmente, “Aprendemos Juntos 2030”), un proyecto de branded content centrado en la educación y que materializa la promesa de marca del banco: crear oportunidades.En los últimos años, se ha convertido en uno de los casos más importantes de branded content del mundo, que ya en 2020 acumulaba más de 1000 millones de visualizaciones y una comunidad de 4 millones de personas, acumulando decenas de premios.También podríamos citar otros casos, como “Pienso, luego actúo”, un proyecto de Yoigo (telco) que difunde y colabora con iniciativas sociales.Lecturas complementariasBranded content: guía completa con ejemplosReflexiones finalesCon estos 21 tipos de marketing, uno se pregunta: ¿dónde está la navaja de Occam cuando la necesitas? ¿No podrías simplemente usar un tipo de marketing y dejar de preocuparte?Bien, todos los tipos de marketing de los que hemos hablado tienen su razón de ser.Algunos se usaron para diferenciarse de competidores y otros para ajustarse a los estilos de vida de los clientes.La clave es que puedes considerar estos tipos de marketing como soluciones ya preparadas para lograr tu objetivo.Conocer estos tipos de marketing probados y testados hacen el trabajo algo más fácil. Solo necesitas elegir sabiamente.Pero, si te fijas, muchos de los ejemplos que hemos puesto mezclan varios tipos de marketing para hacer algo nuevo. En el mundo que vivimos, es muy difícil trazar ciertas líneas.¿Es una lona en una plaza de Madrid una acción de marketing digital? No lo parece, pero cuando se ve más veces la publicación de esa lona en redes sociales que en la propia calle, ¿no empieza a tener cierto toque digital?Imagen: Yago de Vega en X (Twitter).Y, ¿es el marketing de guerrilla algo exclusivo de empresas de consumo o de startups en sus fases iniciales? A veces puede parecer eso, pero siguiendo con las lonas, Atresmedia (una empresa completamente tradicional) se la jugó a las plataformas de streaming cuando lanzó este mensaje:Imagen: La Sexta.Y, ¿qué pasa cuando un banco como BBVA hace publicidad de un proyecto de branded content como es Aprendemos Juntos? ¿Es publicidad? ¿Es contenido?Si algo me gustaría que te quedaras de este post es que los tipos de marketing existentes son un lienzo sobre el que empezar a pintar, no algo escrito en piedra que no se pueda cambiar.Todo evoluciona y lo que hace 10 años estaba muy claro, hoy, no lo está tanto. Y, probablemente, dentro de 10 años, lo esté aún menos.Así que prueba, experimenta y ajusta con todos los tipos de marketing que puedas.¿Añadirías alguno más? ¿No estás de acuerdo en algo? Cuéntanoslo en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Mateusz Makosiewicz Investigador en marketing y educador en Ahrefs. Mateusz tiene más de 10 años de experiencia en marketing conseguidos en agencias, negocios SaaS (software como servicio) y hardware. Cuando no está escribiendo, está componiendo música o disfrutando de largos paseos.",
  "headers": [
    {
      "level": "H1",
      "text": "Los 21 tipos principales de marketing"
    },
    {
      "level": "H2",
      "text": "1. Marketing digital"
    },
    {
      "level": "H3",
      "text": "Ejemplo de marketing digital"
    },
    {
      "level": "H2",
      "text": "2. Marketing offline"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing y publicidad tradicional"
    },
    {
      "level": "H2",
      "text": "3. Inbound marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplo de inbound marketing"
    },
    {
      "level": "H2",
      "text": "4. Outbound marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplos de outbound marketing"
    },
    {
      "level": "H2",
      "text": "5. Marketing de contenidos"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing de contenidos"
    },
    {
      "level": "H2",
      "text": "6. Marketing en buscadores (search engine marketing)"
    },
    {
      "level": "H3",
      "text": "Ejemplo de marketing en buscadores"
    },
    {
      "level": "H2",
      "text": "7. Growth marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplo de growth marketing"
    },
    {
      "level": "H2",
      "text": "8. Marketing B2B"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing B2B"
    },
    {
      "level": "H2",
      "text": "9. Marketing B2C"
    },
    {
      "level": "H3",
      "text": "Ejemplo de marketing B2C"
    },
    {
      "level": "H2",
      "text": "10. Marketing de afiliados"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing de afiliados"
    },
    {
      "level": "H2",
      "text": "11. Marketing en redes sociales"
    },
    {
      "level": "H3",
      "text": "Ejemplo de marketing en redes sociales"
    },
    {
      "level": "H2",
      "text": "12. Branding o brand marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplo de branding"
    },
    {
      "level": "H2",
      "text": "13. Marketing directo"
    },
    {
      "level": "H3",
      "text": "Ejemplo de marketing directo"
    },
    {
      "level": "H2",
      "text": "14. Marketing de influencers"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing de influencers"
    },
    {
      "level": "H2",
      "text": "15. Email marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplos de email marketing"
    },
    {
      "level": "H2",
      "text": "16. Marketing Word-of-mouth (WOMM)"
    },
    {
      "level": "H3",
      "text": "Ejemplos de word-of-mouth marketing"
    },
    {
      "level": "H2",
      "text": "17. Marketing de eventos"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing de eventos"
    },
    {
      "level": "H2",
      "text": "18. Marketing de guerrilla"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing de guerrilla"
    },
    {
      "level": "H2",
      "text": "19. SaaS Marketing"
    },
    {
      "level": "H3",
      "text": "Ejemplos de SaaS marketing"
    },
    {
      "level": "H2",
      "text": "20. Marketing conversacional"
    },
    {
      "level": "H3",
      "text": "Ejemplos de marketing conversacional"
    },
    {
      "level": "H2",
      "text": "21. Branded content"
    },
    {
      "level": "H3",
      "text": "Ejemplos de branded content"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Mateusz Makosiewicz"
}