{
  "url": "https://ahrefs.com/blog/es/tipos-de-marketing-de-contenidos/",
  "slug": "tipos-de-marketing-de-contenidos",
  "title": "5 tipos de marketing de contenidos ganadores para hacer crecer su negocio",
  "description": "Hay muchos tipos de marketing de contenidos. ¿Cuál deberías elegir? En esta publicación, verás los cinco formatos que hemos usado en Ahrefs para aumentar nuestros ingresos.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random. Contenido El marketing de contenidos es sencillo. Creas contenido diseñado para atraer a tu público objetivo y convertirlos en clientes.Hay muchas formas de hacer esto.Estos son solo algunos tipos populares de marketing de contenido:BloggingVideo marketingPodcastingCorreo de propagandaSeminarios webEstudios de casoPresentacioneseBookslibros blancosLa lista continua.¿Es posible hacer todo eso? Probablemente no. La mayoría de las marcas simplemente no tienen los recursos.Entonces, ¿en qué formato deberías centrarte?La respuesta a esa pregunta es diferente para todos. En esta publicación, no voy a cubrir todas las tácticas de marketing de contenidos. Voy a analizar los tipos de marketing de contenido que nos han funcionado y nos han ayudado a aumentar nuestro tráfico y nuestros ingresos.BloggingVideo marketingPodcastingHerramientas gratuitasCursos online1. BloggingLos blogs son el formato que hemos estado usando durante más tiempo para generar más tráfico a nuestro sitio y obtener más clientes.Nuestro objetivo principal con los blogs es ocupar un lugar destacado en Google en temas relevantes para nuestro negocio y adquirir tráfico orgánico pasivo.Y ha resultado bastante bien hasta ahora:Así es como lo hacemos.Paso 1. Encuentra temas ganadoresSi deseas tráfico orgánico, debes orientar tus anuncios a los temas que busca la gente.La forma más sencilla de encontrarlos es con una herramienta de búsqueda de palabras clave. Ingresa un tema relevante en una herramienta de palabras clave gratuita como el Generador de palabras clave de Ahrefs, luego activa el informe “Preguntas”. Te mostrará las preguntas relacionadas que la gente está buscando y sus volúmenes de búsqueda mensuales estimados.Revisa la lista y anote los temas relevantes.Solo asegúrate de no cegarte por el volumen de búsqueda. Debes elegir temas que los clientes potenciales probablemente estén buscando.Por ejemplo, digamos que vende coches urbanos baratos. Clasificar “cuál es el automóvil más rápido del mundo” probablemente no atraerá a muchos clientes potenciales a tu web.Lectura recomendada: Cómo realizar una investigación de palabras clave para SEO - Guía de AhrefsPaso 2. Crea el tipo de contenido adecuadoPara tener la mejor oportunidad de posicionarte, debes crear el tipo de contenido que los buscadores desean ver.Supongamos que deseas posicionarte para “cómo reducir el seguro de automóvil”. Tu instinto probablemente te diga que escribas una guía paso a paso. Después de todo, la consulta comienza con “cómo”, por lo que parece ser lo que la gente quiere, ¿verdad?No tan rápido. Si observas los resultados de clasificación superior para esta consulta, en su mayoría son listas de sugerencias.Si te preguntas por qué esto es importante, es porque Google trabaja arduamente para obtener los mejores resultados para la mayoría de las personas. Por tanto, los resultados de mayor rango suelen ser un buen indicador de lo que la gente quiere.Cuando se trata de publicaciones de blog, a menudo será de cuatro tipos:ListaGuía paso por pasoGuía para principiantesDefinición ampliadaAprenda cómo abordar cualquiera de estos tipos de publicaciones de blog en nuestra publicación aquí.Paso 3. Promociona la publicación del blogUno de los mayores mitos de Internet es: “si lo construyes, vendrán”.Dado que diariamente se publican más de cinco millones de publicaciones de blog, nadie encontrará la publicación de tu blog a menos que la pongas frente a tu audiencia.El trabajo no está terminado cuando presionas “publicar”. Todavía tienes que promocionar tu contenido.Sigue esta lista de verificación de promoción de contenido para obtener más información sobre tu contenido:https://www.youtube.com/watch?v=PoVYweKH4ckLecturas complementarias86 ideas para publicaciones de blog (con ejemplos exitosos)Cómo escribir una publicación de blog en 9 pasos (que la gente realmente quiera leer)¿Qué es el contenido SEO? Cómo escribir contenido que se clasifique17 consejos de blogs para principiantes (que realmente funcionan)¿Qué es la redacción de contenido? 11 consejos para un tráfico más orgánicoCómo promocionar su blog: 7 estrategias fundamentales86 Blog Post Ideas (With Successful Examples)How to Write a Blog Post in 9 Steps (That People Actually Want to Read)What is SEO Content? How to Write Content that Ranks17 Blogging Tips For Beginners (That Actually Work)What is Content Writing? 11 Tips For More Organic TrafficHow to Promote Your Blog: 7 Fundamental Strategies2. Video marketingPublicamos videos en YouTube desde 2015. Desde entonces, acumulamos más de 6.4 millones de visitas y acumulamos más de 140.000 suscriptores.No solo hemos podido acceder a la audiencia de YouTube de dos mil millones de usuarios, sino que el marketing de video también nos ha permitido demostrar nuestros productos e ideas mejor que las palabras.Esto nos ha ayudado a obtener registros consistentes en YouTube.Entonces, ¿cómo lo hacemos?Paso 1. Encuentra temas que las personas buscan en YouTubeSi recién estás comenzando en YouTube, no tienes suscriptores para promocionar tus videos.¿La solución? Clasifica sts videos según los temas que buscan la gente.Para encontrar estos temas, ingresa una palabra clave relevante en nuestra herramienta gratuita de palabras clave de YouTube. Te mostrará hasta 150 ideas para palabras clave y sus volúmenes de búsqueda mensuales estimados.Observa la lista y anota los temas que sean relevantes para tu canal.Lectura recomendada: Cómo realizar una investigación de palabras clave de YouTube en 3 sencillos pasosPaso 2. Crea videos optimizadosIncluso si ocupas el primer lugar en cada palabra clave, nadie verá tu video si es aburrido y poco atractivo.Una forma sencilla de solucionar este problema es escribir un script para tus videos antes de grabarlos. Esto mantendrá tus videos concisos y evitará que se desvíe por la tangente.Más allá de eso, una buena edición también puede ayudar a que tus videos sean interesantes.https://www.youtube.com/watch?v=j5EOWffq-gkLectura recomendada: SEO de YouTube: cómo clasificar sus videos de principio a finPaso 3. Obtén más vistas de tu videoEl posicionamiento en YouTube es excelente, pero no es la única forma de obtener más vistas.Aprende cómo obtener más vistas en YouTube en este video:https://www.youtube.com/watch?v=iwkUlTl2IowLecturas complementariasCómo utilizar el marketing de video para hacer crecer su negocioSEO de video: Cómo clasificar videos de YouTube en Google14 formas comprobadas de obtener más reproducciones en YouTube3. PodcastingHay dos formas de utilizar los podacasts para el marketing de contenidos:Iniciar tu propio podcast;Obtener una entrevista en el podcast de otra persona.Si bien comenzar tu propio podcast es excelente para la construcción de marca y audiencia, puede llevar bastante tiempo ganar tracción.Entonces, en lugar de lanzarte de inmediato a crear un podcast, ¿por qué no aparecer primero en algunos podcasts y decidir si te gusta el formato? Dado que hay más de un millón de podcasts en la actualidad, existen muchas oportunidades para que te entrevisten.Y esto fue lo que hizo Tim, nuestro director de marketing. En 2019, se propuso aparecer en más de 20 podcasts, y lo logró en solo cuatro meses.La aparición de Tim en el podcast Smart Passive Income de Pat Flynn.Esto nos ha traído una cantidad bastante decente de registros:¿Cómo lo hizo Tim?Paso 1. Encuentre oportunidades de podcastLa forma más sencilla de hacerlo es utilizar Google. Simplemente busca top [tu nicho] podcasts, y obtendrás toneladas de listas seleccionadas:Sin embargo, algunos de estos podcasts probablemente serán enormes. Si eres nuevo en los podcasts, es poco probable que tu primer podcast sea la Joe Rogan Experience..Por lo tanto, una mejor manera es identificar a alguien de calibre similar en tu industria que haya sido invitado en varios podcasts. Por ejemplo, Laura Roeder, la fundadora de MeetEdgar, es alguien en nuestra industria que ha aparecido en muchos podcasts.Para descubrir los podcasts en los que ha estado, peguemos su sitio en Site Explorer de Ahrefs, vayamos al informe de enlaces externos y escribamos su nombre en el cuadro “Incluir”. Ahora, los enlaces de la columna “Página de referencia” son prácticamente todos podcasts.Paso 2. Proponte como invitadoUna vez que hayas identificado los podcasts en los que desea participar, el siguiente paso es presentarte como invitado.Pero antes incluso de comunicarte con el anfitrión, asegúrate de escuchar algunos episodios del podcast. Esto no solo te ayudará a crear un correo electrónico más personalizado, sino que también podrás proponer algunos temas para discutir en función de los episodios anteriores.Lectura recomendada: 12 lecciones que aprendí al hacer más de 20 entrevistas de podcast en 4 meses¿Decidiste que deseas iniciar tu propio podcast?Aquí hay algunos recursos que pueden ayudar:Lecturas complementariasCómo iniciar un podcast en 2020: el tutorial completo de podcastingCómo creé un podcast clasificado # 1 con más de 60 millones de descargasEquipo de podcast de Tim Ferriss4. Herramientas gratuitasEn Ahrefs, somos un gran admirador de lanzar herramientas gratuitas como estrategia de marketing de contenido.Herramientas como nuestro verificador de backlinks gratuito nos permiten mostrar las capacidades de nuestro producto. Si bien es útil por sí solo, también brinda a los clientes potenciales una idea de lo que pueden obtener si se registran en nuestro servicio.Resultados de nuestro verificador de backlinks gratuitoAdemás, también se clasifica para toneladas de palabras clave relevantes, lo que nos envía una gran cantidad de tráfico orgánico pasivo:De hecho, nuestras herramientas gratuitas nos envían casi 200.000 visitas orgánicas cada mes:Bastante bien, ¿verdad?He aquí cómo hacerlo.Paso 1. Encuentre oportunidades para crear herramientas gratuitasAl igual que con los blogs y el marketing de video, no deseas crear herramientas gratuitas al azar. Debes asegurarte de que las personas estén buscando las herramientas que deseas crear para que puedan tener una clasificación alta en Google y obtener tráfico orgánico.Para hacer esto, puede utilizar el Explorador de palabras clave de Ahrefs.Supongamos que tienes un sitio sobre automoción y deseas crear una herramienta gratuita. Ingresa una palabra clave amplia como “autos” en el Explorador de palabras clave de Ahrefs y ve al Informe de concordancia de frase.Luego, en el cuadro “Incluir”, agrega términos como “calculadora”, “herramienta”, “herramientas” y “verificador”. Elije “Cualquier palabra” y haz clic en “Aplicar”.Ahora puedes ver algunos temas interesantes como “calculadora de préstamos de automóviles”, “calculadora de financiamiento de automóviles” y “calculadoras de alquiler de automóviles”. Estas pueden ser buenas opciones para crear una herramienta gratuita.Paso 2. Crea la herramienta gratuitaCon la oportunidad que has encontrado, es hora de crear la herramienta gratuita.Pero antes de hacerlo, asegúrate de revisar los resultados de mayor rango para tu palabra clave objetivo. Busca problemas con ellos. Pregúntate:¿Qué tienen de bueno?¿Cómo podrían mejorarse?Luego, toma lo que has aprendido y haz algo similar, pero mejor.Paso 3. Crea enlacesTu herramienta gratuita no se posionará por sí sola. Dado que existe una correlación positiva entre los enlaces y las clasificaciones, deberás crear enlaces a yu herramienta gratuita recién creada.La forma más fácil de hacer esto es llegar a aquellos que están vinculados a herramientas similares pero inferiores.Por ejemplo, supongamos que creaste una calculadora gratuita de préstamos para automóviles. Deberías haber revisado las páginas actuales de mayor rango en el paso anterior, haber identificado lo que no era tan bueno en ellas y haber solucionado esos problemas con tu herramienta.Ahora puedes comunicarte con las personas que enlazan a esas herramientas, hacerles saber que tu herramienta existe y explicar por qué es mejor que la que ya tienen.Esto se conoce comúnmente como la técnica del rascacielos.Para encontrar personas que enlacen a estas herramientas, simplemente ingresa su URL en el Explorador de sitios de Ahrefs, luego ve al informe de enlaces externos.Revisa la lista, encuentre oportunidades relevantes, encuentra sus correos electrónicos, luego comunícate con ellos y preséntales tu nueva herramienta.Lectura recomendada: Cómo ejecutar la técnica Skyscraper (y obtener resultados)5. Cursos onlineCualquiera puede crear un curso en línea.Por ejemplo, en Ahrefs, tenemos una academia donde los clientes potenciales pueden ver cualquiera de nuestros dos cursos gratuitos:Esto ha generado un buen número de inscripciones para nosotros:Así es como lo hicimos.Paso 1. Elija un problema para resolverCrear un curso es una tarea enorme. Tim tardó casi un año en completar el curso Blogging for Business, desde la conceptualización, la creación de scripts y la grabación, hasta la promoción.Nota al margen. No trabajó en el curso a tiempo completo. Lo hizo mientras hacía malabares con otros aspectos del trabajo.Entonces, antes de lanzarte al fondo, debes pensar en el problema que deseas resolver. Y esto debería ser algo que tu producto o servicio ayude a resolver. De esa manera, puedes promover tu negocio a lo largo del curso.Por ejemplo, la creación de blogs para empresas fue una obviedad para Tim. No solo tenía toneladas de experiencia, conocimiento y éxito con los blogs, sino que también era un tema en el que, naturalmente, podía hablar sobre Ahrefs como solución.Tim SouloNacido en Ucrania. Vive en Singapur.Tim Soulo es el director de marketing y asesor de productos de Ahrefs (una herramienta SE0 líder en la industria, impulsada por Big Data).Tim comparte con entusiasmo su conocimiento dando charlas en vivo en varias conferencias de marketing digital en todo el mundo y publicando artículos de blog en el Blog Ahrefs. Es autor de muchos estudios de investigación SE0 basados en datos y de una serie de guías de marketing detalladas.Paso 2. Crea el cursoEl 90% de las personas que se inscriben en clases en línea no las completan. Y este número podría ser aún mayor para los cursos gratuitos, ya que la gente generalmente valora menos el contenido gratuito.Es importante comprender esa información para poder diseñar un curso que sea “pegajoso”.Esta fue la razón por la que Tim se centró tanto en la calidad de la producción y la calidad de la explicación. La mayoría de los cursos gratuitos se filman como un screencast o como una cabeza parlante. Pero cada lección de Blogging for Business está animada profesionalmente:https://www.youtube.com/watch?v=QLy5mVV__AsEs casi seguro que esto es parte de la razón por la que la gente lo encontró tan “digno de un atracón”:Me, an hour ago: I guess I’ll check out @timsoulo’s blogging for business course… but I doubt I’ll learn anything.Me, right now: *eyes glued to the screen, desk covered in notes*Well played, Tim.https://t.co/k3AnL3laos via @ahrefs #seo #contentmarketing pic.twitter.com/KkXGOxCJYH— Kyle Byers 🇺🇦 (@Kyle_Byers) May 8, 2018Hace una hora eché un vistazo a @timsoulo’ y su curso de blogging para de negocios … pero dudaba que aprenda algo. Yo, ahora mismo: * ojos pegados a la pantalla, escritorio cubierto de notas* Bien jugado, Tim.Ahora, enseñarte cómo crear un curso en línea está fuera del alcance de este artículo, así que te dejo algunos recursos a continuación sobre cómo hacerlo.Lecturas complementarias10 pasos para crear un curso en línea tremendamente exitosoCómo crear un curso en línea: 5 pasosCómo crear increíbles cursos en línea (7 pasos probados)Paso 3. Promocionar el cursoPromocionar un curso en línea es bastante similar a promocionar una publicación de blog. Puede promocionarlo a su audiencia existente o en plataformas donde su audiencia pasa el rato (por ejemplo, Product Hunt):Bloguear para empresas en Product HuntTambién puede promocionar su curso ofreciendo “bonificaciones”. Por ejemplo, cuando lanzamos por primera vez Blogging for Business, ofrecimos dos bonificaciones principales:Prueba gratuita de 14 días. Si eres nuevo en Ahrefs, deberás registrarse en nuestra prueba de 7 días por $ 7. Pero como parte del lanzamiento de Blogging for Business, regalamos 14 días de acceso gratuito a Ahrefs para todos los que se inscribieron en el curso.Comunidad de Slack. También creamos una comunidad en Slack donde los participantes del curso podían hacerle a Tim cualquier pregunta sobre el curso (o el marketing en general).¿Cómo sabes qué es una buena bonificación para regalar?La clave para elegir un buen bono es regalar algo que sea lo suficientemente valioso como para venderse como un producto o servicio independiente. Por ejemplo, para obtener acceso a Ahrefs, normalmente tendrías que ser un cliente de pago. Pero, durante el período del curso, puedes usarlo gratis. Eso fue valioso.Del mismo modo, si deseas que Tim te brinde una consulta, probablemente tendrás que pagar por su tiempo. Pero como parte del curso, puedes hacerle cualquier pregunta relacionada con el marketing. Nuevamente, eso es muy valioso.¿Qué tipo de marketing de contenidos deberías utilizar?La creación de contenido requiere mucho tiempo y esfuerzo. Entonces, al principio, debes enfocar tus esfuerzos en un solo tipo de contenido.Mi sugerencia sería comenzar con blogs, video marketing o podcasting. Las herramientas gratuitas y los cursos en línea tienen una barrera de entrada mucho mayor.Pero de estas tres opciones, ¿cuál deberías elegir?Primero, debes pensar en qué tipo de contenido le gusta a tu audiencia. Por ejemplo, la mayoría de las personas tienden a leer publicaciones de blogs en el nicho de SEO. Por eso comenzamos con los blogs. Si eres un profesional del acondicionamiento físico que enseña a las personas cómo hacer ejercicio desde casa, es posible que desees comenzar haciendo videos.En segundo lugar, debes pensar en dónde se encuentran tus habilidades. Por ejemplo, a algunas personas les puede resultar más fácil hablar que escribir. En cuyo caso, los podcasts son un buen punto de partida.Una vez que has decidido, quédate con este formato hasta que hayas descubierto un buen proceso para crear ese tipo de contenido de manera constante. Solo entonces deberías pasar a un nuevo formato.Nuevamente, eso es lo que hicimos. Casi todos nuestros esfuerzos estuvieron en el blog hasta 2018 cuando contratamos a Sam para que se hiciera cargo de nuestro canal de YouTube. Y Tim no empezó a aparecer en podcasts hasta que delegó el blog y YouTube a Josh y Sam.Ahora, incluso cuando hayas decidido cambiar a un nuevo formato, no siempre tendrás que empezar de cero. También puedes reutilizar el contenido de los formatos que ya estás utilizando.Hacemos esto todo el tiempo en Ahrefs. Por ejemplo, convertimos nuestro video sobre marketing de afiliados en una publicación de blog.A la izquierda: nuestro video sobre marketing de afiliados. A la derecha: nuestro artículo sobre marketing de afiliados.ConclusiónCon suerte, esta publicación te ha ayudado a despejarte sobre qué tipo de marketing de contenido elegir.¿Quieres aprender a crear una estrategia de marketing de contenidos exitosa? Lee esto.¿Tienes alguna pregunta o comentario? Hazme ping en Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Si Quan Ong Marketing @ Ahrefs. Leo, hago breakdance y realizo experimentos vitales random.",
  "headers": [
    {
      "level": "H1",
      "text": "5 tipos de marketing de contenidos ganadores para hacer crecer su negocio"
    },
    {
      "level": "H2",
      "text": "1. Blogging"
    },
    {
      "level": "H3",
      "text": "Paso 1. Encuentra temas ganadores"
    },
    {
      "level": "H3",
      "text": "Paso 2. Crea el tipo de contenido adecuado"
    },
    {
      "level": "H3",
      "text": "Paso 3. Promociona la publicación del blog"
    },
    {
      "level": "H2",
      "text": "2. Video marketing"
    },
    {
      "level": "H3",
      "text": "Paso 1. Encuentra temas que las personas buscan en YouTube"
    },
    {
      "level": "H3",
      "text": "Paso 2. Crea videos optimizados"
    },
    {
      "level": "H3",
      "text": "Paso 3. Obtén más vistas de tu video"
    },
    {
      "level": "H2",
      "text": "3. Podcasting"
    },
    {
      "level": "H3",
      "text": "Paso 1. Encuentre oportunidades de podcast"
    },
    {
      "level": "H3",
      "text": "Paso 2. Proponte como invitado"
    },
    {
      "level": "H2",
      "text": "4. Herramientas gratuitas"
    },
    {
      "level": "H3",
      "text": "Paso 1. Encuentre oportunidades para crear herramientas gratuitas"
    },
    {
      "level": "H3",
      "text": "Paso 2. Crea la herramienta gratuita"
    },
    {
      "level": "H3",
      "text": "Paso 3. Crea enlaces"
    },
    {
      "level": "H2",
      "text": "5. Cursos online"
    },
    {
      "level": "H3",
      "text": "Paso 1. Elija un problema para resolver"
    },
    {
      "level": "H3",
      "text": "Paso 2. Crea el curso"
    },
    {
      "level": "H3",
      "text": "Paso 3. Promocionar el curso"
    },
    {
      "level": "H2",
      "text": "¿Qué tipo de marketing de contenidos deberías utilizar?"
    },
    {
      "level": "H2",
      "text": "Conclusión"
    }
  ],
  "author": "Si Quan Ong"
}