{
  "url": "https://ahrefs.com/blog/es/trafico-sitio-web/",
  "slug": "trafico-sitio-web",
  "title": "Descubre cuánto tráfico recibe un sitio web: Comparamos 3 formas de hacerlo",
  "description": "3 de las formas más conocidas de estimar el tráfico comparado de un sitio web. Además algunas sugerencias para estimar el tráfico sin ninguna herramienta.",
  "content": "Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO). Contenido ¿Quieres ver cuánto tráfico recibe un sitio web? Hay varias maneras de hacerlo.Sin embargo, antes de llegar a eso, he aquí un punto importante:Si eres el dueño del sitio web, no hay necesidad de hacer una estimación. Puedes instalar Google Analytics (de forma gratuita) y ver los números de tráfico exactos.Crecimiento del blog de Ahrefs en Google AnalyticsNota al margen. El análisis del archivo de registro del servidor puede proporcionar aún más datos sobre tu tráfico, como se explica en este artículo.Pero como estás leyendo este artículo, me arriesgaré a adivinar que no eres el dueño del sitio web en cuestión, ¿verdad?Probablemente estés intentando adivinar cuánto tráfico recibe tu competidor, y es poco probable que compartan su Google Analytics contigo.En este post, voy a contarte tres maneras de obtener estimaciones de tráfico para cualquier sitio web.Método 1. Utiliza una herramienta de estimación de tráficoExisten dos tipos de herramientas de estimación de tráfico:Herramientas que estiman el tráfico total: Los visitantes de tu sitio web pueden venir de todo tipo de lugares: motores de búsqueda, foros, redes sociales, etc. Estas herramientas estiman la cantidad total de tráfico de todas las fuentes.Herramientas que sólo estiman el tráfico orgánico: La mayoría de los sitios web obtienen una buena parte de su tráfico de los motores de búsqueda como Google; esto se llama “tráfico orgánico”. Las estimaciones de estas herramientas no tienen en cuenta el tráfico de otras fuentes (por ejemplo, las redes sociales).Exploremos cada una de estas con un poco más de detalle.1. Descubre cuánto tráfico total obtiene un sitio webAquí en Ahrefs hemos probado todas las herramientas principales de estimación de tráfico total y hemos hecho un par de pequeños experimentos internos para saber cuál es la más precisa. Ganó SimilarWeb.SimilarWeb te muestra muchas estadísticas relacionadas con el tráfico, incluyendo:Visitas totales;Páginas por visita;Duración promedio de la visita;Tasa de reboteNota al margen. Aprende más sobre cómo Similarweb define y calcula estas métricas aquí, aquí, aquí y aquí (en inglés). Aquí está el tráfico estimado de ahrefs.com en julio de 2018:Curiosamente, no proporciona estimaciones de páginas vistas. Pero para esto puedes utilizar ingeniería inversa multiplicando el total de visitas por páginas por visita (para nosotros, esto sería 5,63M * 7,5 = 42,23M de páginas vistas).Los usuarios también pueden gratuitamente ver las estimaciones mensuales de tráfico de hasta seis meses en un gráfico interactivo.Los suscriptores de pago pueden ver estos datos hasta por dos años.Todas las estimaciones de tráfico incluyen tráfico móvil y de escritorio, y puedes segmentar por categoría de dispositivo si eres un suscriptor de pago.Desplázate hacia abajo, y el informe te mostrará algunas estadísticas más útiles relacionadas con el tráfico, como el tráfico por países (sólo en escritorio)…Nota al margen. Los usuarios gratuitos sólo pueden ver las estadísticas de los 5 países con mayor porcentaje de tráfico. … fuentes de tráfico (directo, referidos, búsquedas, etc)…… sitios principales de tráfico referido (esto es muy útil para hacer building links o buscar oportunidades para hacer guest posting que traerá tráfico referido)…… y el top 5 de palabras clave orgánicas…¿De dónde surgen estos datos?Para entender la fiabilidad de estos datos, es vital que sepamos de dónde provienen.Esto es lo que SimilarWeb tiene para decir al respecto:Nuestros datos provienen de 4 fuentes principales:Un panel de dispositivos monitoreados, actualmente el más grande de la industria;Proveedores locales de servicios de Internet (ISPs) ubicados en muchos países diferentes;Nuestros rastreadores web que escanean todos los sitios web públicos para crear un mapa altamente preciso del mundo digital;Cientos de miles de fuentes de medición directa de sitios web y aplicaciones que están conectados directamente con nosotros.Traducción: SimilarWeb obtiene sus datos de una variedad de fuentes que recopilan información anónima sobre la actividad en línea de los usuarios.No dicen cuán grande es su cobertura, pero no obtienen información de cada persona en el mundo. Así que sus datos se derivan de una muestra relativamente pequeña de la “población en línea”.¿Son los datos precisos?Probémoslo. Esto es lo que hicimos:Tomamos una muestra de 116 sitios web de Flippa;Obtuvimos el total de visitantes únicos y páginas vistas de Similarweb para los 116 sitios;Los comparamos.Nota al margen. Sólo utilizamos sitios web de Flippa que tuvieran al menos un año de antigüedad y que tuvieran tráfico verificado.Esto es lo que encontramos:SimilarWeb sobreestimó el total de visitantes únicos para el 91,67% de los sitios web.SimilarWeb sobreestimó el total de visitantes únicos en un 308,81% en promedio;SimilarWeb sobreestimó el total de páginas vistas para el 70,83% de los sitios web;SimilarWeb sobreestimó el total de páginas vistas en un 210,58% en promedio.En resumen, SimilarWeb tiende a sobreestimar drásticamente a los visitantes únicos y las páginas vistas reales, según nuestras pruebas. Pero no siempre sobreestima las cosas; subestima a los visitantes únicos aproximadamente 1/12 parte de las veces, y las páginas vistas entre ⅓ y ¼ de las veces.Pero hay un punto crítico:SimilarWeb sólo mostró estimaciones para aproximadamente ⅕ de los sitios que probamos.Para el otro ⅘, esto es lo que vimos:No hay datos. Nada.Si te estás preguntando por qué sucedió esto, probablemente se deba al tamaño de los sitios que probamos. Todos ellos eran sitios relativamente pequeños de Flippa.Recordarás que SimilarWeb calcula sus estimaciones basándose en los datos de un pequeño subconjunto de toda la población en línea. Así que si no muestran estimaciones de tráfico para un sitio en particular, es porque no lo han visitado un número suficiente de personas pertenecientes al subconjunto del que obtienen sus datos.Es por eso que SimilarWeb tiende a tener menos o ningún dato en sitios más pequeños.Para probar esto, miramos si SimilarWeb dio o no estimaciones para los 100 sitios más importantes del mundo, según el Rank de Ahrefs. SimilarWeb dio estimaciones para todos ellos.Volvamos a los datos:Debido a que SimilarWeb sólo dio estimaciones de tráfico para aproximadamente ⅕ de sitios, todos nuestros hallazgos se basan en un tamaño de muestra de sólo 24 sitios web. Es cierto que esto es bastante pequeño.Por lo tanto, deberías tomar nuestros hallazgos con pinzas.2. Descubre cuánto tráfico obtiene un sitio web desde motores de búsquedaEs cierto que existen varias herramientas de estimación de tráfico orgánico en el mercado. Pero confiamos completamente en nuestra herramienta (Ahrefs) y estamos convencidos de que tiene la mejor calidad de datos.Aquí están las estimaciones relacionadas con el tráfico que te damos:Visitas mensuales estimadas desde Google (en todo el mundo);Valor del tráfico estimado (es decir, el costo equivalente del tráfico orgánico mensual para el sitio web o URL si se compra a través de PPC);Número estimado de palabras clave (top 100) que el sitio web posiciona en Google.Veamos las estimaciones de tráfico en Ahrefs para ahrefs.com, a partir de julio de 2018:Puedes ver que ahrefs.com recibe un estimado de 270.000 visitantes mensuales de Google.Esta es una estimación de tráfico “en vivo”, lo que significa que es un “promedio móvil”. Se ajusta cada vez que actualizamos el conjunto de palabras clave para las que el sitio web está posicionado en nuestra base de datos. Debido a esto, las estimaciones de tráfico pueden variar ligeramente de un día para otro. Este número incluye tanto el tráfico de escritorio como el tráfico móvil.¿Quieres ver las estimaciones de tráfico para una sub-sección de un sitio web?Simplemente pega cualquier subdominio o subcarpeta (por ejemplo, ahrefs.com/blog o blog.ahrefs.com) en el Site Explorer. Selecciona la opción “Prefix” en el menú desplegable.Por ejemplo, si ingresas ahrefs.com/blog, verás la suma total del tráfico de búsqueda a través de todas las páginas dentro de la carpeta “/blog/”, así:Si deseas ver el tráfico de cada página dentro de esta carpeta, utiliza el informe Mejores páginas. Se mostrará una lista de páginas ordenadas por tráfico (de mayor a menor).Pero esto es tráfico global. Haz clic en la pestaña Búsqueda Orgánica del reporte Vista General y verás el tráfico desglosado por 170 países.Nota al margen. Presiona “Mostrar más” para revelar la lista completa de los 170 países. También notarás que trazamos estimaciones históricas de tráfico orgánico en un gráfico. Esto muestra las estimaciones del tráfico orgánico diario desde mediados de 2015. También es totalmente interactivo. Basta con pasar el ratón por encima del gráfico para ver las estadísticas de tráfico estimadas para cualquier fecha a lo largo de los años.¿Deseas ver este gráfico filtrado para un país específico? Puedes hacer eso.Aquí se filtra para mostrar sólo las estimaciones de tráfico para el Reino Unido:Pero espera, hay más: ve al reporte de Palabras clave orgánicas, y te mostraremos todas las palabras clave que impulsan el tráfico hacia el sitio, empezando por las que generan más tráfico.En resumen: Ahrefs almacena toneladas de datos para casi cualquier sitio web o URL. ¿Pero cómo?¿De dónde provienen los datos?Las estimaciones de Ahrefs se basan en nuestra base de datos de 6,1 MIL MILLONES de palabras clave.Esta base de datos se actualiza mensualmente, incluyendo las estimaciones del volumen de búsqueda (mira algunas estadísticas de búsqueda divertidas del mes pasado aquí).Esto es lo que hacemos para calcular las estimaciones de tráfico en pocas palabras:Tomamos todas las palabras clave para las que un sitio web está posicionado;Comprobamos el volumen de búsqueda mensual, la posición en el ranking y el CTR para cada palabra clave (en 170 países);Calculamos cuánto tráfico recibe el sitio desde cada palabra clave;Suma estos números para estimar el tráfico orgánico total que recibe un sitio.Puedes aprender más sobre cómo calculamos exactamente este número aquí.¿Son precisos estos datos?Probémoslo. Esto es lo que hicimos:Tomamos la misma muestra de 116 sitios web de Flippa (los cuales mostraban todos números de tráfico de búsqueda orgánicos globales verificados);Obtuvimos los números de tráfico orgánico de Ahrefs de los 116 sitios web;Los comparamos.Esto es lo que encontramos:Ahrefs subestimó a los visitantes únicos orgánicos para el 74,14% de los sitios web;Ahrefs subestimó a los visitantes únicos orgánicos en un 38,08% en promedio;Ahrefs subestimó las páginas vistas orgánicas para el 90,52% de los sitios web;Ahrefs subestimó las páginas vistas orgánicas en un 52.04% en promedio.En resumen, Ahrefs tiende a subestimar a los visitantes únicos orgánicos y las página vistas, según nuestras pruebas. Pero no siempre subestima las cosas; sobreestima a los visitantes únicos orgánicos aproximadamente 1/4 de las veces, y las páginas vistas orgánicas aproximadamente 1/10 de las veces.Nota al margen. Por cierto, estos hallazgos se basan en un tamaño de muestra mayor que los datos de SimilarWeb, porque Ahrefs mostró estimaciones para todos los 116 sitios que analizamos. (¿Recuerdas que SimilarWeb sólo dio un estimado para aproximadamente ⅕ de ellos?)¿Pero por qué Ahrefs tiende a subestimar el tráfico de todos modos?Esto se debe a que sólo podemos estimar el tráfico de las 6,1 MIL MILLONES de palabras clave que tenemos en nuestra base de datos. ¿Suena a mucho? Lo es, tenemos la base de datos más grande de todas las herramientas similares en el mercado.Pero incluso una base de datos de 6,1 MIL MILLONES de palabras clave no es suficiente para contener todas las búsqueda posibles que se puedan escribir en Google. Eso sería imposible.Por ejemplo, mucha gente realiza búsquedas super long-tail…Traducción: Google por favor muéstrame la mejor lista de proteínas en polvo del mundo… que no tenemos en nuestra base de datos y, por lo tanto, no podemos estimar el tráfico.Así es como funcionan todas las herramientas de estimación de tráfico orgánico, así que no estamos solos aquí. Todos tienden a subestimar el tráfico. El grado en que esto sucede se reduce al tamaño de su base de datos de palabras clave; cuanto más grande sea, más precisas serán sus estimaciones de tráfico.Por eso es importante que nosotros (Ahrefs) tengamos la mayor base de datos de palabras clave del mercado.También vale la pena señalar que nadie tiene estimaciones de volumen de búsqueda totalmente exactas, ni siquiera Google. Esta es otra razón por la que nuestras estimaciones tienden a ser subestimadas.¿Qué herramienta es mejor para comparar múltiples sitios?A veces, no se trata tanto de estimar el tráfico con una precisión desmedida, sino de poder comparar la popularidad relativa de dos o más sitios.Por ejemplo, imagina que tienes una lista de cien prospectos para outreach y quieres priorizar tus esfuerzos comenzando con los sitios que reciben más tráfico.En este caso, deseas comparar los sitios entre sí y clasificarlos por orden de tráfico.Entonces, ¿qué herramienta es la mejor para hacer esto?Para aprender eso, ejecutaremos una correlación Spearman en nuestros datos.Aquí están los resultados de SimilarWeb:Actual “Unique visitors” VS SimilarWeb Total visitsActual “Pageviews” VS SimilarWeb “PageViews”0.7130.779… y Ahrefs:Actual “Unique organic visitors” VS Ahrefs “Global” organic trafficActual “Organic Pageviews” VS Ahrefs “Global” organic traffic0.7670.784¿Confundido?Aquí tienes lo que la correlación Spearman muestra:El coeficiente de correlación del rango de Spearman es una técnica que puede ser utilizada para resumir la fuerza y la dirección (negativa o positiva) de la relación entre dos variables. El resultado estará siempre entre 1 y menos 1. Clasifica los dos conjuntos de datos.¿Aún más confundido? Déjame explicar (con ejemplos).Estamos viendo la correlación entre dos conjuntos de datos: los números de tráfico “reales” (conjunto #1) y el tráfico estimado (conjunto #2). Si los números se correlacionan positivamente de alguna manera, la correlación de Spearman será entre cero y 1. Si se correlacionan negativamente, será entre cero y -1.Por lo tanto, cuanto más cercana sea la correlación a 1, más positiva será la correlación entre los dos conjuntos de datos.Supongamos que tenemos tres sitios web con el siguiente tráfico real.…Sitio1 - 100Sitio2 - 5.000Sitio3 - 40.000… y Ahrefs informa las siguientes estimaciones de tráfico…Sitio1 - 50Sitio2 - 2.000Sitio3 - 10.000… sería una correlación positiva perfecta de 1. (El “rango” de los números correspondientes en cada conjunto de datos tiene una correlación positiva perfecta entre sí)Pero si Ahrefs estimó las estadísticas de tráfico de la siguiente manera.…Sitio1 - 10.000Sitio2 - 2.000Sitio3 - 50… eso sería una correlación negativa perfecta de -1. (El “rango” de los números correspondientes en cada conjunto de datos tiene una correlación positiva negativa perfecta entre sí)Así que básicamente, cuanto mayor sea la correlación, mejor será la herramienta para comparar dos o más sitios.Mirando los datos de correlación de Spearman arriba, se puede ver que tanto Ahrefs como SimilarWeb tienen una fuerte correlación positiva con el tráfico “real”. Pero Ahrefs triunfa sobre SimilarWeb, marginalmente.Esto significa que si utilizas nuestra herramienta Batch Analysis para obtener estimaciones de tráfico a nivel de dominio para un grupo de prospectos para outreach, debes clasificar por tráfico (de mayor a menor).…… es probable que este sea un buen juez de la relativa popularidad de estos sitios.¿Entonces qué herramienta de estimación de tráfico deberías usar?Es importante tener en cuenta que cada una de estas herramientas hace cosas diferentes.SimilarWeb estima el tráfico total, mientras que Ahrefs estima el tráfico orgánico (es decir, Google).Uno de los beneficios únicos de SimilarWeb es que puedes ver de dónde viene la mayor parte del tráfico de un sitio web (por ejemplo, búsqueda orgánica, social, etc.):Puedes ver, por ejemplo, que thewirecutter.com obtiene aproximadamente 2/3 de su tráfico de los motores de búsqueda, según SimilarWeb.Lo que nos lleva a un buen punto:Si ves que un sitio obtiene mucho tráfico de búsquedas orgánicas en SimilarWeb, puedes usar Ahrefs para profundizar y entender mejor ese tráfico.Por ejemplo, en el caso de thewirecutter.com, Ahrefs puede mostrar cómo ha crecido el tráfico orgánico en los últimos 3+ años.…… o cada una de las 3,1 MILLONES de palabras clave para las que posiciona…… o las páginas responsables de traer el mayor tráfico orgánico al sitio…… y mucho más!Pero basta de fanfarronadas 😉 Hablemos brevemente sobre los precios.SimilarWeb no publica información sobre precios en su sitio web. Pero este hilo de Quora pone su plan más barato (que te da acceso a sólo 6 meses de datos de tráfico) a $199/mes.Eso es el doble del costo de nuestro plan más económico. También tenemos una versión de prueba de 7 días, mientras que SimilarWeb no ofrece tal cosa.Pero antes de tomar una decisión, echemos un vistazo a un par de otras formas de averiguar cuánto tráfico recibe un sitio web.Método 2. Busca una página de “publicita con nosotros”La mayoría de los bloggers reciben tantos correos electrónicos de “Estoy interesado en publicitar en tu sitio; ¿cuánto tráfico recibe?” que tiene sentido publicar esta información en una página de publicidad de acceso público.Esta es una de las páginas de geekwire.com:Indica sus visitantes únicos mensuales, páginas vistas y alguna otra información útil (por ejemplo, estadísticas sociales). No son sólo los grandes sitios los que hacen esto tampoco, he visto muchos bloggers individuales con páginas similares.Pero, ¿cómo encuentras estas páginas?La forma más fácil es con la siguiente búsqueda en Google:site:sitioweb.com publicita con nosotros9 de cada 10 veces, si tienen tal página, será el primer resultado.¿No ves estadísticas de tráfico en la página de publicidad? Mira si hay un enlace a un “paquete de medios”; muchos sitios incluyen sus estadísticas de tráfico aquí.Sin embargo, esta táctica no siempre funciona por tres simples razones:No todos los sitios web tienen páginas de “publicita con nosotros”;Las estadísticas de tráfico no siempre se publican;Los números de tráfico no siempre están actualizadosSi encuentras una página de “publicita con nosotros” con estadísticas de tráfico, siempre intenta comprobar si están actualizadas.La mayoría de los sitios web mostrarán cuándo se actualizaron por última vez…ejemplo de TravelFashionGirl.com… pero algunos no lo hacen.Por ejemplo, las estadísticas de tráfico que aparecen en la página de publicidad de geekwire.com no se han actualizado desde hace al menos un año.Si el sitio web no ha actualizado sus estadísticas de tráfico recientemente (o simplemente no da una fecha de “última actualización”), no confíes en los números; es poco probable que sean precisos.Método 3. ¡Pregunta!Si deseas conocer estadísticas de tráfico precisas y actualizadas de un sitio web, deberás ponerte en contacto con el dueño y preguntarle directamente.Pero la mayoría de los bloggers no van a darle esa información a un completo extraño, ¿verdad?Te sorprenderías. Muchos bloggers están perfectamente dispuestos a compartir estos datos con aquellos que tengan una razón genuina para preguntar, como por ejemplo:Estás interesado en comprar su sitio web;Quieres anunciarte en su sitio.Aquí tienes un ejemplo de correo electrónico que he usado en el pasado cuando trataba de averiguar estadísticas de tráfico:Nota al margen. No aconsejamos enviar correos electrónicos como este a menos que realmente estés buscando oportunidades de publicidad. ¡No le hagas perder el tiempo a la gente! Como he dicho, la mayoría de los bloggers estarán encantados de compartir los números de tráfico actualizados con los anunciantes auténticos. Muchos incluso harán capturas de pantalla de los datos de Google Analytics como prueba.Mientras que este método es típicamente la manera más confiable de descifrar las estadísticas de tráfico, no es 100% infalible. Aquí está el porqué:Algunos bloggers/webmasters fabricarán estadísticas de tráfico con el fin de vender publicidad;No todo el mundo tiene Google Analytics instalado. Muchos dependerán de plataformas analíticas menos que precisas (por ejemplo, plugins de WordPress) para sus datos;Google Analytics puede desinstalarse fácilmente, lo que significa que los datos no siempre son precisos. Si el tráfico reportado suena demasiado alto, intenta revisar el sitio web para ver si hay código GA duplicado. Alternativamente, pregúntales cuál es su tasa de rebote; una tasa de rebote súper baja es a menudo un buen indicador de código GA duplicado.Por lo tanto, incluso si te acercas al blogger y obtienes esas escurridizas estadísticas de tráfico, te recomendamos que verifiques su legitimidad con herramientas de terceros.Aquí tienes un par más de consejos para estimar el tráfico de sitios web…Las estadísticas de tráfico estimadas son un buen punto de partida, pero se puede saber mucho sobre la popularidad de un sitio web comprobando manualmente algunas cosas, como por ejemplo:# de comentarios en sus publicaciones (en promedio);# de reproducciones en videos de YouTube;# de acciones de compartir en redes sociales;Niveles de interacción en sus páginas (por ejemplo, página de Facebook, Twitter, etc.)Si le echas un vistazo al blog de Ahrefs, por ejemplo, verás que prácticamente todas las entradas del blog tienen un buen número de comentarios.La mayoría de los lectores no se molestan en dejar un comentario, no importa cuán impresionante sea el contenido. Por lo tanto, un blog que recibe un número constantemente alto de comentarios es casi seguro que recibirá una cantidad significativa de tráfico.Nota al margen. También recomendaría verificar la calidad de los comentarios cuando se utiliza esta táctica; a veces los comentarios son altos debido a que son mayormente spam.La cantidad de veces que un post haya sido compartido en redes sociales puede ser otro indicador de tráfico alto.Por ejemplo, si revisamos el informe Mejor Contenido para ahrefs.com en el Site Explorer, podemos ver que la mayoría de los artículos en el blog de Ahrefs reciben toneladas de acciones sociales.Y finalmente está YouTube…Todos nuestros videos en YouTube tienen cientos de miles de vistas.Si esta cantidad de gente está viendo nuestros videos de YouTube, bueno, probablemente es seguro decir que unos cuantos están visitando nuestro sitio también.ConclusionesLas herramientas de estimación de tráfico no son perfectas. Sin embargo, ofrecen la manera más rápida de estimar el tráfico de sitios que no posees.Si necesitas números exactos, tendrás que preguntar directamente; no hay dos maneras de hacerlo.¿Conoces alguna otra forma confiable de estimar/encontrar estadísticas de tráfico de sitios web? Cuéntanos.Tra­duci­do por Agen­cia Eleven. Des­de Argenti­na, hace­mos que te encuentren. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Joshua Hardwick Jefe de Contenido de Ahrefs (o también se puede decir que soy el responsable de asegurar que cada entrada del blog que publiquemos sea ÉPICO).",
  "headers": [
    {
      "level": "H1",
      "text": "Descubre cuánto tráfico recibe un sitio web: Comparamos 3 formas de hacerlo"
    },
    {
      "level": "H2",
      "text": "Método 1. Utiliza una herramienta de estimación de tráfico"
    },
    {
      "level": "H3",
      "text": "1. Descubre cuánto tráfico total obtiene un sitio web"
    },
    {
      "level": "H4",
      "text": "¿De dónde surgen estos datos?"
    },
    {
      "level": "H4",
      "text": "¿Son los datos precisos?"
    },
    {
      "level": "H3",
      "text": "2. Descubre cuánto tráfico obtiene un sitio web desde motores de búsqueda"
    },
    {
      "level": "H4",
      "text": "¿De dónde provienen los datos?"
    },
    {
      "level": "H4",
      "text": "¿Son precisos estos datos?"
    },
    {
      "level": "H3",
      "text": "¿Qué herramienta es mejor para comparar múltiples sitios?"
    },
    {
      "level": "H3",
      "text": "¿Entonces qué herramienta de estimación de tráfico deberías usar?"
    },
    {
      "level": "H2",
      "text": "Método 2. Busca una página de “publicita con nosotros”"
    },
    {
      "level": "H2",
      "text": "Método 3. ¡Pregunta!"
    },
    {
      "level": "H2",
      "text": "Aquí tienes un par más de consejos para estimar el tráfico de sitios web…"
    },
    {
      "level": "H2",
      "text": "Conclusiones"
    }
  ],
  "author": "Joshua Hardwick"
}