{
  "url": "https://ahrefs.com/blog/es/volumen-busqueda-exacto/",
  "slug": "volumen-busqueda-exacto",
  "title": "El volumen de búsqueda “exacto” no existe",
  "description": "… Y aunque existiera dicho volumen, no lo necesitarías.",
  "content": "Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía. Contenido A menudo publico las novedades de Ahrefs que más me gustan en X. Y la última vez que anuncié nuestra última incorporación (predicción del volumen de búsqueda) a Keywords Explorer alguien me respondió con esto:I mean it is good for seasonal keywords but to be honest it would be great if the search volume in general would be more accurate…— Kim von Däniken (@KimvonDaniken) March 6, 2024Está bien para palabras clave estacionales, pero, la verdad, estaría genial si el volumen de búsqueda en general fuera más preciso…No era la primera vez que nos criticaban por la exactitud de nuestra métrica de volumen de búsqueda.Pero aquí viene lo bueno…El volumen de búsqueda exacto NO EXISTELos volúmenes del Planificador de palabras clave de Google no son exactos.Las “Impresiones” en GSC tampoco son exactas.Y la propia métrica no es más que una media de los datos anteriores.Ya publiqué un artículo bastante detallado sobre la métrica del volumen de búsqueda en 2021. Pero no creo que mucha gente lo haya leído.Ya se ha dicho todo lo que había que decir. Pero como nadie escuchaba, hay que decirlo todo de nuevo.André Gide Así que permitid que aborde este tema desde un ángulo totalmente nuevo.Los volúmenes de búsqueda en el Planificador de palabras clave (Keyword Planner) de Google no son precisosEn primer lugar, ¿a qué se refieren las personas que se dedican al SEO cuando piden que los volúmenes de búsqueda sean “precisos” o “exactos”?Bueno, las menos experimentadas solo quieren que las métricas de las herramientas de terceros coincidan con lo que ven en GKP.Pero las que tienen más experiencia ya conocen todos los secretos ocultos del Planificador de palabras clave de Google:Las cifras son medias anuales redondeadas.Esas medias se asignan después a “grupos por volumen”.Las palabras clave con un significado similar suelen agruparse y se suma su volumen de búsqueda.En otras palabras, las cifras de volumen de búsquedas que ves en GKP son muy imprecisas. Y una vez que un profesional SEO lo sabe, deja de utilizar GKP como referencia de precisión.Utilizan GSC.Los volúmenes de búsqueda en Google Search Console tampoco son precisosVale. Las cifras de GKP están redondeadas, agrupadas y todo eso. Pero Google Search Console te muestra las impresiones reales de una palabra clave determinada, ¿no?Bueno, ¿sabías que una simple herramienta de rank tracking puede contaminar tus impresiones de SGC?What it looks like when the only impressions are coming from other SEOs’ rank trackers. 😑 pic.twitter.com/v1gYnvuQJ4— Joy Hawkins (@JoyanneHawkins) October 31, 2023Este es el aspecto cuando las únicas impresiones provienen de otras herramientas SEO de rank trackingPiensa en cuántos “robots” diferentes podrían estar rastreando los resultados de búsqueda de una palabra clave determinada y, por tanto, dándote una impresión bastante inexacta de su volumen de búsqueda real (humana).Además, para ver el volumen de búsquedas mensual real, tu página tiene que estar posicionada entre las 10 primeras durante treinta días seguidos. Y debe estar posicionada en todo el país, porque los resultados de búsqueda pueden variar según la ubicación.Además, estoy seguro de que GSC no es diferente de cualquier otra herramienta de análisis en el sentido de que puede tener ciertas discrepancias a la hora de “contar” esas impresiones. Es decir, compara los “clics” que te indica GSC con los logs de tu servidor. Apuesto a que las cifras no coinciden.La métrica del volumen de búsqueda muestra el pasado, no el futuro¿Cuánto tiempo crees que pasa desde que seleccionas una determinada palabra clave para posicionarte hasta que tu página se posiciona realmente en los primeros puestos de Google?Según nuestras anteriores investigaciones, una página recién publicada puede tardar entre dos meses y un año en llegar a las primeras posiciones. ¿No crees que para entonces habrá cambiado el volumen de búsqueda mensual de una palabra clave?Esa es exactamente la razón por la que hemos añadido la previsión del volumen de búsquedas a nuestra herramienta Keywords Explorer. Utiliza datos anteriores para proyectar lo que probablemente ocurrirá con el volumen de búsquedas en los próximos 12 meses:¿Es exacto? No.Pero, ¿ayuda a agilizar tu investigación de palabras clave y a tomar mejores decisiones? Por supuesto que sí.Imagina que el volumen de búsqueda FUERA exactoHagamos un experimento mental e imaginemos que existiera una herramienta SEO que te diera un volumen de búsqueda muy preciso para cualquier palabra clave. ¿Para qué la utilizarías? ¿Podrías predecir con exactitud el tráfico de búsqueda de esa palabra clave?¡No!No puedes saber con seguridad en qué posición acabará posicionándose tu página. Hoy podrías estar en la tercera posición, mañana en la quinta, pasado mañana en la primera. Los rankings son volátiles y rara vez se mantiene una posición determinada durante un periodo de tiempo lo bastante largo.Y aunque eso pasara, no disponemos de datos precisos sobre el CTR (tasa de clics, clickthrough rate) de cada posición en Google. Cada SERP es única, y Google no deja de implementar más y más funciones SERP que roban clics. Así que, aunque supieras con precisión el volumen de búsqueda de una palabra clave y la posición exacta en la que permanecería tu página, seguirías sin poder calcular la cantidad exacta de tráfico de búsqueda que obtendrías.Y por último…¡Las páginas no se posicionan por una sola palabra clave! Hace siete años publicamos un estudio que demostraba que una página típica que se sitúa en los primeros puestos de Google para una palabra clave se posiciona a la vez para, aproximadamente, otras mil palabras clave relacionadas.Entonces, ¿qué sentido tiene intentar medir tus clics a partir de una sola palabra clave, cuando acabarás posicionándote en mil a la vez?Y la conclusión de todo esto es…“Que la dirección sea precisa” es suficienteEn Ahrefs dedicamos una gran cantidad de tiempo, esfuerzo y recursos para asegurarnos de que nuestra base de datos de palabras clave está en buena forma. Tanto en términos de su cobertura de las consultas de búsqueda existentes como de las métricas SEO que te proporcionamos para cada una de estas palabras clave.Sin embargo, ninguna de nuestras métricas SEO es “exacta”. Ni el volumen de búsquedas, ni la dificultad de las palabras clave, ni el tráfico potencial, lo que quieras.Pero ninguna puede serlo.Están diseñadas para ser “direccionalmente precisas”. Te dan una idea general de la demanda de búsqueda de una palabra clave determinada y te indican si es mucho mayor (o menor) en comparación con otras palabras clave que estás evaluando.No puedes utilizar esas métricas para hacer cálculos precisos.Pero cientos de miles de profesionales SEO de todo el mundo utilizan precisamente estas métricas para guiar sus estrategias SEO y obtienen precisamente los resultados que esperan obtener. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Tim Soulo Tim es el CMO y Asesor de Producto de Ahrefs pero lo más importante es que es el mayor fanboy y el verdadero evangelizador de la compañía.",
  "headers": [
    {
      "level": "H1",
      "text": "El volumen de búsqueda “exacto” no existe"
    },
    {
      "level": "H2",
      "text": "Los volúmenes de búsqueda en el Planificador de palabras clave (Keyword Planner) de Google no son precisos"
    },
    {
      "level": "H2",
      "text": "Los volúmenes de búsqueda en Google Search Console tampoco son precisos"
    },
    {
      "level": "H2",
      "text": "La métrica del volumen de búsqueda muestra el pasado, no el futuro"
    },
    {
      "level": "H2",
      "text": "Imagina que el volumen de búsqueda FUERA exacto"
    },
    {
      "level": "H2",
      "text": "“Que la dirección sea precisa” es suficiente"
    }
  ],
  "author": "Tim Soulo"
}