{
  "url": "https://ahrefs.com/blog/es/wise-caso-estudio-seo/",
  "slug": "wise-caso-estudio-seo",
  "title": "Wise.com Caso de Estudio SEO: 5 Razones Por las que Su SEO Triunfa",
  "description": "Aprende los secretos de la exitosa estrategia SEO de Wise (antes Transferwise) que les llevó a 6.4 millones de visitas orgánicas mensuales estimadas.",
  "content": "Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos. Contenido Pocas marcas mainstream son tan fascinantes y sabias en SEO como Wise.Anteriormente conocida como TransferWise, esta empresa fintech que ofrece cuentas multidivisa y transferencias rápidas de dinero con tasas justas recibe actualmente una estimación de 6.4 millones de visitas orgánicas al mes:Eso es especialmente impresionante considerando que han migrado dominios a principios de 2021—una migración tan bien ejecutada que provocó olas en la comunidad SEO. Añade a esto que tienen un CMS personalizado para escalar sus esfuerzos SEO y tienes una marca cuya estrategia SEO merece ser investigada.En este caso de estudio único vamos a explorar cinco razones por las que la estrategia SEO de Wise triunfa:Plantillas de páginas landing que pueden ser escaladasUn CMS personalizado construido alrededor de sus necesidades SEOContenido optimizado para fragmentos destacadosMúltiples formas de atraer y adquirir enlacesMigrar sin fallos millones de páginas con mucho riesgo1. Plantillas de páginas landing que pueden ser escaladasRealizar keyword research es normalmente la parte más fácil de crear una estrategia de contenidos, así que no es una sorpresa que Wise refleje lo que sus (potenciales) clientes buscan con el contenido que producen.El reto viene cuando la investigación de palabras clave te dice que hagas decenas de miles de páginas landing. ¿Cómo creas y optimizas tanto contenido para posicionar bien en Google?Wise intenta estar presente en los resultados de búsqueda a lo largo de todo el customer journey y hay mucho contenido por cubrir—especialmente en la parte de arriba del funnel.Por ejemplo, solo para visitantes de Estados Unidos tienen cerca de 12.000 páginas landing sobre combinaciones de códigos swift:Datos del informe de Mejores Páginas en Ahrefs Site Explorer.Y no es solo el subdirectorio de códigos swift el que tiene tantas páginas landing. Hay otros subdirectorios con miles de páginas sobre cosas como conversores de divisa y números de ruta:Datos del informe de Subdirectorios Principales en Site Explorer de Ahrefs. Muestra los subdirectorios en wise.com ordenados por tráfico orgánico de mayor a menor.Estas páginas, más bien de la parte superior del funnel, suponen una gran mayoría de su tráfico orgánico a lo largo de varios países e idiomas. Aquí va un ejemplo de su tráfico alemán:El truco para crear tantas páginas landing optimizadas como esta es usar plantillas—y esto es lo que Wise hizo. Se dieron cuenta de que la gente que buscaba códigos SWIFT/BIC o números de ruta querían información muy parecida. La variable principal era el código en sí mismo.Desde una perspectiva de contenido, todo lo que necesitaban era una página perfectamente creada para un banco específico. A partir de ahí, podrían usar la plantilla una y otra vez para distintos bancos.Crear una página landing con tanta destreza requiere un gran copy, diseño, UX y alineación con la intención de búsqueda—ofreciendo toda la información que el visitante pueda necesitar. Un ejemplo de lo que los usuarios buscan se puede encontrar en su sección de FAQ (que también maximiza las oportunidades SEO a través de los fragmentos enriquecidos de FAQ):En general, Wise dio en el clavo al escalar su creación de contenido con foco en SEO. Su tráfico orgánico crece con el número de páginas indexadas:Diapositiva tomada de la presentación de Fabrizio Ballarini.Crecemos a la velocidad en la cual enviamos/optimizamos páginas.2. Un CMS personalizado construido alrededor de sus necesidades SEOEscalar la creación de contenido al nivel de las necesidades de Wise requiere de recursos de desarrollo. No puedes producir con éxito tanto contenido en varios idiomas usando las opciones de tu CMS estándar. En esta presentación, Fabrizio Ballarini, la persona a cargo del crecimiento orgánico de Wise, hace un esquema de las características SEO de su CMS personalizado, Lienzo:Usar plantillas y textos tipo para crear miles de nuevas páginas landing rápidamenteGestionar bien el enlazado internoGenerar y actualizar meta etiquetas y datos estructurados a escalaGestionar atributos hreflang y la generación y actualización de etiquetas canonicalClonar, actualizar o borrar páginas existentes a escalaProbar cambios en un entorno local antes de subirlos a producciónPlataforma integrada de monitorización para detectar y arreglar problemas cuanto antesCapacidades integradas de split testing para experimentos SEOIntegración fluida con bases de datos y APIsAsignación de roles de usuario, para que los miembros de equipo tengan acceso a todas las herramientas que necesitanPuede ser mucho para digerir, así que aquí va un ejemplo de su UI (interfaz de usuario):Diapositiva tomada de la presentación de Fabrizio Ballarini.Aunque puede parecer arriesgado empujar tanto contenido desde el punto de vista técnico, Wise consiguió atraer más y más interés de Googlebot a lo largo del tiempo:The more content you feed to Google bot the more it gets addicted to crawling, indexing and serving your site. Especially for brand new sites it’s so important to keep up feeding good quality pages. My favourite KPI on early stage projects is indexed pages/month pic.twitter.com/s9gZDk0OW1— Fabrizio Ballarini - Hiring wise.jobs (@Pechnet) May 17, 2020 Cuanto más contenido das a Google bot, más adicto se vuelve a rastrear, indexar y servir tu sitio.Especialmente para sitios nuevos es muy importante seguir alimentando con páginas de buena calidad.Mi KPI favorito en proyectos en sus primeras fases es páginas indexadas al mes. Poner a Google de su parte en esto puede haber sido un pequeño desafío. Primero, cada página tenía que ser única, valiosa y alinearse con la intención de búsqueda. Después tenían que actualizar enlaces internos y sitemaps para asegurar un buen rastreo e indexación a tiempo.Lienzo parece que hace todo esto mucho mejor que cualquier CMS prefabricado.3. Contenido optimizado para fragmentos destacadosUna cosa que me maravilló sobre el rendimiento SEO de Wise es cuántos fragmentos destacados poseen. Pero no estaba claro si esto es porque hacen un trabajo mucho mejor que sus competidores o es simplemente la naturaleza de las SERPs de finanzas.Así que miré a sus dominios competidores:El informe de Dominios Competencia en Site Explorer de Ahrefs muestra webs que se posicionan en el top 10 por las mismas palabras clave que la web que estás investigando.Después elegí unas pocas de esas con generalmente alto tráfico orgánico y muchas palabras clave solapadas. Quería saber en cuántas palabras clave con “activadores de fragmentos destacados” se posicionan en el top 10 y cuántas de esas poseen.Aquí está cómo hice esto en Site Explorer de Ahrefs para cada web que quería investigar:Introduje el dominioNavegué al informe de Organic Keywords 2.0 (palabras clave orgánicas 2.0)Filtré por keywords en posiciones 1-10Filtré por keywords que activan fragmentos destacados, apunté el número de resultadosFiltré por keywords que activan fragmentos destacados que el dominio posee, apunté el número de resultados (este paso está en la imagen de abajo)Aquí están los resultados. Wise domina tanto en cifras absolutas como relativas:Está claro que Wise hace la optimización de fragmentos destacados realmente bien y les lleva mucho tráfico. Estoy más bien sorprendido de que su competidores orgánicos no hagan un trabajo mejor con oportunidades tan claras como esta, por ejemplo:Te puedes preguntar cómo haces que una tabla destaque. Debe ser una lotería qué tabla elige Google para el fragmento destacado, ¿verdad? Bien, aquí tienes el aspecto de la tabla en la web de Chase:La situaron dentro de un bloque colapsable que está colapsado por defecto. No es el contenido principal en la página. Además, la tabla podría tener mejores nombres de columna y no haría daño mencionar que son de hecho los números de ruta de Chase en alguna parte en el contexto de la tabla.Wise hace todo esto mejor, anota la tabla con título claro y entrelaza cada fila con su respectiva página landing:No digo que una optimización como esta vaya a asegurar un fragmento destacado, pero Wise lo merece en este caso.Lectura recomendada:Cómo optimizar para los fragmentos destacados de Google4. Múltiples formas de atraer y adquirir enlacesIncluso la mejor configuración de SEO on-page y técnica, procesos y ejecución no aseguran el éxito en las SERPs si tu contenido no tiene un perfil de backlinks sólido. El link building es la parte del SEO que menos puedes controlar, así que siempre es una buena idea emplear varias tácticas y aproximaciones al link-building. Wise también hace un trabajo excelente en esto.Las empresas centradas en producto atraen enlaces de forma naturalTu mejor activo de link-building es quizá algo en lo que no influyes mucho como SEO: un producto realmente valioso y popular. Esto a menudo viene con una marca fuerte. Yo, yo mismo, soy un cliente de Wise satisfecho, y sabía de ellos mucho antes de convertir.Tener el mejor producto en la industria te permite construir de forma natural un perfil fuerte de backlinks sin construir enlaces de forma activa mediante el outreach o contacto. De hecho, Wise no tuvo un equipo SEO hasta 2015 y fueron capaces de conseguir grandes enlaces con solo algunas actividades de PR y publicidad.Alcanzar un Domain Rating (DR, o rating de dominio) de 75 sin SEO en el equipo es realmente impresionante:Datos del informe Overview (vista general) en Site Explorer de Ahrefs.Uso de campañas creativas de PRAl investigar cómo Wise creció hasta convertirse en la empresa que es hoy, descubrí muchos ejemplos de grandes campañas de PR que consiguieron mucha cobertura y enlaces.Las campañas de PR de Wise van desde apostar por lo que creen en una forma bastante estándar:Una petición online comenzada por TransferWise en 2014.A trucos puros de PR que también fortalecían su posicionamiento:https://www.youtube.com/watch?v=ZufqOLl6ajEhttps://www.youtube.com/watch?v=mKOAZkuP6_EEstos trucos de PR les consiguieron excelentes enlaces al principio:Está claro que el PR y la publicidad les ayudaron a construir una marca y un perfil de enlaces fuerte antes de que empezaran a tomarse el SEO en serio:Diapositiva tomada de la presentación de Fabrizio Ballarini.Los anuncios + PR construyeron un fuerte perfil de enlaces y búsqueda pero no hicieron crecer el número de páginas que tenían como objetivo las palabras clave sin marca.Programas de referidos & afiliados como canales de adquisición principalesWise incentiva a sus usuarios a invitar a amigos con un bonus económico y esto se convirtió en uno de sus principales canales de adquisición al principio:Wise también tiene un programa de afiliados que incentiva a los propietarios de webs a ganar comisiones compartiendo sus enlaces de afiliados con su audiencia.Vale, el valor SEO de los enlaces de referidos o afiliados es cuestionable en el mejor de los casos. Wise actualmente tiene cerca de 9.000 backlinks relacionados con afiliados sin atributos de enlace, lo que debería pasar PageRank:Filtrando por backlinks “follow” a wise.com usando el informe Backlinks 2.0 Site Explorer de Ahrefs.Si nosotros (Ahrefs) podemos identificar fácilmente estos enlaces, estoy seguro de que Google también puede. Probablemente devalúan o descalifican por completo estos enlaces en términos de PageRank.Pero el punto aquí es otro. Un producto derivado de que la gente comparta enlaces de referencia y afiliados se traduce en más enlaces normales y cobertura. Cuanto mayores sean tus programas de referidos y afiliados, mayores beneficios cosechas. Hay un efecto bola de nieve en esto.5. Migrar sin fallos millones de páginas con mucho riesgoMigrar una web grande a un nuevo dominio es una tarea abrumadora en sí misma. Añade a esto una gran base de clientes que confía en tu servicio 24/7 para gestionar su dinero y tienes un reto que estresaría a cualquier SEO.Wise actualmente tiene cuatro millones de URLs indexadas en Google y el número seguirá probablemente subiendo ya que no hace tanto que migraron desde transferwise.com (marzo de 2021):Consiguieron transferir con éxito su tráfico orgánico sin pérdidas notables a su nuevo dominio en cuatro meses desde la migración. Si eres nuevo en la migración de webs, este es un resultado excelente porque muchas migraciones acaban perdiendo una porción grande del tráfico orgánico.Aquí está el gráfico del tráfico orgánico de transferwise.com:Y aquí cómo se tradujo a wise.com:Nota al margen. Yo atribuiría la última caída de tráfico que ves arriba a las actualizaciones del algoritmo de junio y julio de 2021. Dudo que tenga nada que ver con la migración del dominio. Migrar millones de páginas, mantener tu servicio en funcionamiento durante el proceso y no perder tráfico por esto es simplemente un éxito. Pero incluso si haces todo bien, todavía te puedes encontrar problemas que son difíciles de explicar y arreglar:2 months since the @Wise domain migration, Google decided to index and rank a URL that is: 1) canonicalised 2) parameterised, 3) 301 redirects to the new domain and 4) meant for another market (en-US when we have en-GB available)🤯 Any ideas what could be wrong @JohnMu? 🙏 pic.twitter.com/uIOWuwNN4d— Lucia Lecesne (@LumiSionnain) May 4, 2021 2 meses desde la migración de dominio de @Wise, Google decidió indexar y posicionar una URL que está: 1) canonizada 2) parametrizada, 3) con redirección 301 al nuevo dominio y 4) dirigida a otro mercado (en-US cuando tenemos en-GB disponible). ¿Alguna idea de qué pudo salir mal @JohnMu? Fabrizio ofreció más perspectiva sobre su preparación para la migración en este este hilo de Twitter:As some might have noticed we didn’t redirect the entire domain on day 1 but we put https://t.co/sWmD3ONZzx live next to https://t.co/jZmGpMuK2eDuring the last week or so we then performed a bunch of tests to protect our existing customers moving to https://t.co/sWmD3ONZzx https://t.co/9Oto7KmQHC pic.twitter.com/INSrjufD44— Fabrizio Ballarini - Hiring wise.jobs (@Pechnet) March 2, 2021 Como algunos habréis notado no redirigimos el dominio entero en el día 1, si no que pusimos wise.com en vivo a la vez que transferwise.comDurante la última semana más o menos realizamos unos cuantos tests para proteger a nuestros clientes existentes al migrar a wise.comPara mí destacan dos consejos: Informa adecuadamente a tus usuarios y audiencia sobre una migración de dominio que esté en camino. Esto es especialmente importante para Wise debido a la naturaleza de su negocio. Llegar de repente a un nuevo dominio de blog no es comparable a logarte en la cuenta donde tienes el dinero en un dominio distinto sin saber nada por adelantado.Prueba tus redirecciones en una parte pequeña de tu dominio y monitoriza los logs de servidor para entender cómo se comportan los rastreadores. Esta es definitivamente una buena práctica antes de que hagas (redirecciones) 301 de todo.Reflexiones finalesWise destaca en términos de compromiso en SEO en todos sus equipos. Esto subraya la importancia de las soft skills en SEO. Necesitas comunicar de forma adecuada el valor del SEO y tus necesidades a otras personas en la organización para tener éxito.Me encontré unos pocos aspectos más que podría haber discutido aquí, pero los cinco de arriba fueron los que me parecieron más interesantes e inspiradores. Si tienes alguna pregunta, idea o quizá incluso peticiones para analizar el SEO de otras compañías, siéntete libre de escribirme en Twitter.Tra­duci­do por Iván Fanego, que en sus ratos libres analiza herramientas y tendencias en marketing y software y que acaba de lanzar la guía de WhatsApp Marketing más completa. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Escrito por Michal Pecánek Marketer y redactor de contenidos en Ahrefs. Adicto al SEO, la aviación, las fragancias, el sushi y los tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Wise.com Caso de Estudio SEO: 5 Razones Por las que Su SEO Triunfa"
    },
    {
      "level": "H2",
      "text": "1. Plantillas de páginas landing que pueden ser escaladas"
    },
    {
      "level": "H2",
      "text": "2. Un CMS personalizado construido alrededor de sus necesidades SEO"
    },
    {
      "level": "H2",
      "text": "3. Contenido optimizado para fragmentos destacados"
    },
    {
      "level": "H2",
      "text": "4. Múltiples formas de atraer y adquirir enlaces"
    },
    {
      "level": "H3",
      "text": "Las empresas centradas en producto atraen enlaces de forma natural"
    },
    {
      "level": "H3",
      "text": "Uso de campañas creativas de PR"
    },
    {
      "level": "H3",
      "text": "Programas de referidos & afiliados como canales de adquisición principales"
    },
    {
      "level": "H2",
      "text": "5. Migrar sin fallos millones de páginas con mucho riesgo"
    },
    {
      "level": "H2",
      "text": "Reflexiones finales"
    }
  ],
  "author": "Michal Pecánek"
}