{
  "url": "https://moz.com/blog/category/competitive-research/p4",
  "slug": "p4",
  "title": "Competitive Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin November 6, 2015 Recovering the Data Google Has Hidden Away Keyword Research | Whiteboard Friday | Competitive Research It's no secret that Google keeps a lot of secrets. From keyword data to link data to traffic data (and surely more), there's a lot that we could benefit from — if they'd only share it! Since that's not likely to happen anytime soon, Rand takes us through various ways to access that all-important data in this week's Whiteboard Friday. Read this post By: Rebecca Lehmann October 27, 2015 How to Build a Real-Time Listening Post for a Time-Sensitive Vertical Competitive Research | SEO Tools Using social listening to spy on the competition is an underrated tactic for marketers looking to gain the upper hand in competitive verticals. Read this post By: Rand Fishkin October 6, 2015 Beyond the SEO Plateau: After Optimizing Your Website, What's Next? Advanced SEO | Competitive Research It's a near-universal experience for consultants and in-house SEOs who've worked on numerous organic search campaigns. The first 3-6 months (longer if the site is very large or complex) of any SEO effort is almost always exclusively dedicated to fixing mistakes, improving existing issues, tweaking and tuning the suboptimal, and generally closing the gap between what exists now and current best... Read this post By: Greg Strandberg July 30, 2015 Five Dead-Simple Tips for Using Google+ to Grow Your Brand Competitive Research | Social Media | Community Management If you believe the hype about Google+ being dead or dying, you're missing out on a great opportunity to grow your community and your brand. Read this post By: Casey Meraz June 28, 2015 Advanced Local SEO Competition Analysis Local SEO | Competitive Research Competition in local search is fierce. While it's typical to do some surface level research on your competitors before entering a market you can go much further down the SEO rabbit hole. In this article we will look at how you can find more competitors, pull their data, and use it to beat them in the search game. Read this post By: Andrea Lehr May 26, 2015 Exposing The Generational Content Gap: Three Ways to Reach Multiple Generations Content Marketing | Marketing Industry | Competitive Research Are you marketing content across generations? If so, there's a good bet you're missing some key opportunities, many of which are revealed in this study. Read this post By: Ronell Smith April 30, 2015 How to Create Boring-Industry Content that Gets Shared Content Marketing | Competitive Research Many marketers balk at the prospect of creating content for industries that just aren't conducive to interesting topics. This post explains why that's short-sighted, and offers a different approach. Read this post By: Eric Enge April 15, 2015 Using Term Frequency Analysis to Measure Your Content Quality Content Marketing | Advanced SEO | Competitive Research A spreadsheet and term frequency analysis can yield surprising insights into what Google might see when it looks at your content Read this post By: Simon Penson April 8, 2015 Off with Your Head Terms: Leveraging Long-Tail Opportunity with Content Content Marketing | On-page SEO | Competitive Research In this post, Simon details a new content process designed to take advantage of the trend toward long-tail keywords by tying your content to more specific search opportunities. Read this post By: Ellie Wilkinson November 20, 2014 Conquer Your Competition with these Three Moz Tools - Next Level Competitive Research | Moz Tools Size up your competition and gain the upper hand with this second installment of the Next Level video series. We'll take you on a SERP-fari where you can try out three ways to use the Moz tools to conquer your competitors. Read this post By: Philip Petrescu October 1, 2014 Google Organic Click-Through Rates in 2014 Competitive Research | Search Engines We've all been there. Trying to improve our organic rankings so we can get more traffic from the search engines. And every time we do that, we are left with some big questions in our minds, like: How much traffic would I actually get if I rank on the first page? This post offers a new study of click-through rates of various positions on SERPs in an attempt to answer those questions. Read this post By: David Mihm July 2, 2014 Stop Worrying About the New Google Maps; These URL Parameters Are Gold Local SEO | Competitive Research | Mobile SEO Somewhat inspired by a Pete Wailes YouMoz post from many years ago, I set out last week to explore Google Maps with a fresh set of eyes and an open mind to see what I could discover about how it renders local business results. Read on, for what I think I found. Read this post By: Aleyda Solis May 29, 2014 The Illustrated SEO Competitive Analysis Workflow Competitive Research An integral part of keyword research is an in-depth look at your competition. This post offers a concise flowchart to visualize and guide you through that process. Read this post By: Cyrus Shepard December 5, 2013 New Moz-Builtwith Study Examines Big Website Tech and Google Rankings Competitive Research BuiltWith has cataloged over 5,000 different website technologies on over 190 million sites. Like BuiltWith, Moz also has a lot of data. Every two years, we run a Search Engine Ranking Factors study where we examine over 180,000 websites in order to better understand how they rank in Google's search results. We thought, \"Wouldn't it be fun to combine the two data sets?\" We wanted to find out what technologies websites were using, and also see if those technologies correlated with Google rankings. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Competitive Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Competitive Research"
    },
    {
      "level": "H2",
      "text": "Recovering the Data Google Has Hidden Away"
    },
    {
      "level": "H2",
      "text": "How to Build a Real-Time Listening Post for a Time-Sensitive Vertical"
    },
    {
      "level": "H2",
      "text": "Beyond the SEO Plateau: After Optimizing Your Website, What's Next?"
    },
    {
      "level": "H2",
      "text": "Five Dead-Simple Tips for Using Google+ to Grow Your Brand"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Advanced Local SEO Competition Analysis"
    },
    {
      "level": "H2",
      "text": "Exposing The Generational Content Gap: Three Ways to Reach Multiple Generations"
    },
    {
      "level": "H2",
      "text": "How to Create Boring-Industry Content that Gets Shared"
    },
    {
      "level": "H2",
      "text": "Using Term Frequency Analysis to Measure Your Content Quality"
    },
    {
      "level": "H2",
      "text": "Off with Your Head Terms: Leveraging Long-Tail Opportunity with Content"
    },
    {
      "level": "H2",
      "text": "Conquer Your Competition with these Three Moz Tools - Next Level"
    },
    {
      "level": "H2",
      "text": "Google Organic Click-Through Rates in 2014"
    },
    {
      "level": "H2",
      "text": "Stop Worrying About the New Google Maps; These URL Parameters Are Gold"
    },
    {
      "level": "H2",
      "text": "The Illustrated SEO Competitive Analysis Workflow"
    },
    {
      "level": "H2",
      "text": "New Moz-Builtwith Study Examines Big Website Tech and Google Rankings"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rebecca Lehmann\n          \n            Rand Fishkin\n          \n            Greg Strandberg\n          \n            Casey Meraz\n          \n            Andrea Lehr\n          \n            Ronell Smith\n          \n            Eric Enge\n          \n            Simon Penson\n          \n            Ellie Wilkinson\n          \n            Philip Petrescu\n          \n            David Mihm\n          \n            Aleyda Solis\n          \n            Cyrus Shepard"
}