{
  "url": "https://moz.com/blog/category/competitive-research/p6",
  "slug": "p6",
  "title": "Competitive Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 21, 2011 Headsmacking Tip #18: Use Discussion Search as Competitive Intel Competitive Research Most of us in the search field have likely seen the addition of \"Discussions\" to Google's search options. It lets searchers specifically target either forums or Q+A sites for their queries (or both, by default), and it's a gold mine for competitive intelligence and research.... Read this post By: Benjamin Estes March 20, 2011 Defining Your True Competitors Competitive Research Businesses seeking SEO often know who their real world competitors are but don't have a good idea who their competitors are in the SERPs. I examine one powerful method to figure this out. Read this post By: Joanna Lord April 28, 2010 Competitive Intelligence: Purpose & Process Competitive Research When it comes to marketing your brand online there is just so much to do. We spend our days researching, creating, implementing, and then measuring the success of our efforts. There are dozens of channels to participate in, and obviously thousands of ways to go about marketing your brand, but however you slice it—online marketing comes down to introducing ne... Read this post By: Rand Fishkin December 2, 2007 How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis Competitive Research This week, the SEOmoz crew and I are heading to Pubcon in Las Vegas for one of the search industry's more advanced conferences. However, before departing, I felt an irresistable urge to do some coverage of a tough competition shaping in the world of search marketing... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Competitive Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Competitive Research"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #18: Use Discussion Search as Competitive Intel"
    },
    {
      "level": "H2",
      "text": "Defining Your True Competitors"
    },
    {
      "level": "H2",
      "text": "Competitive Intelligence: Purpose & Process"
    },
    {
      "level": "H2",
      "text": "How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    }
  ],
  "author": "Rand Fishkin\n          \n            Benjamin Estes\n          \n            Joanna Lord\n          \n            Rand Fishkin"
}