{
  "url": "https://moz.com/blog/category/technical-seo/p10",
  "slug": "p10",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Cyrus Shepard August 1, 2016 301 Redirects for SEO: Google Removes the Penalty Technical SEO | Search Engines | SEO Basics Last week, Google blew our minds when they said 3xx redirects no longer lose PageRank. Cyrus is here to give you the low-down on what this means for SEO. Read this post By: Mike Arnesen July 12, 2016 The Search Marketer's Guide to ItemRef & ItemID Technical SEO | Advanced SEO Structured data has never been more important than it is today. This post will help you implement semantic markup and structured data with greater ease and enable you to create a more robust and complete web of linked data on your website (and beyond). Read this post By: Cyrus Shepard June 28, 2016 10 Illustrations of How Fresh Content May Influence Google Rankings (Updated) Technical SEO | Search Engines | Advanced SEO How fresh is this article? Through patent filings over the years, Google has explored many ways that it might use “freshness” as a ranking signal. Back in 2011, we published a popular Moz Blog post about these “Freshness Factors” for SEO. Following our own advice, this is a brand new update of that article. Read this post By: Chris Goddard June 19, 2016 Using Google Tag Manager to Dynamically Generate Schema Code Technical SEO | Advanced SEO Implementing Schema used to require a lot of changes to your site's markup, but the JSON-LD format created a great alternative to adding microdata to a page with minimal code. This post details how to make it even easier to dynamically generate Schema.org/JSON-LD tags for your site using Google Tag Manager. Read this post By: Dominic Woodman June 13, 2016 How to Use BigQuery for Large-Scale SEO (Or Whenever Excel Fails) Technical SEO | Advanced SEO | SEO Tools Sometimes you have so much data it causes Excel to fail. When that happens, turn to Google BigQuery to help. Dominic Woodman walks you through setting up and using BigQuery for making huge datasets manageable. Read this post L By: Laura Lippay June 7, 2016 Optimizing for Accessibility: Alt Text, Videos, Images & More On-page SEO | Technical SEO | User Experience (UX) Alt Text For Video Accessibility: Have you been following along as we explore SEO + Accessibility? In this post, we shares resources and advice on SEO and Accessibility overlaps when optimizing alt text for images, video, and non-text elements. Read this post By: Logan Ray June 5, 2016 Here’s How to Keep 301 Redirects from Ruining Your SEO Technical SEO | Advanced SEO While 301 redirects can yield significant value to your SEO efforts, it's important to remain vigilant about how they're used. Logan Ray details four common ways redirects can be negatively affecting your page load time and what you can do about them. Read this post By: Wei Leen Ng June 2, 2016 Is Quora Skirting the Edge of ‘Spammy’ When it Comes to SEO? Technical SEO | Competitive Research While Google says all spam is treated equally, taking a deep, hard look at Quora made this author wonder if that's really the case. Read this post L By: Laura Lippay June 2, 2016 Optimizing for Accessibility + SEO: Formatting & Link Overlaps On-page SEO | Technical SEO | User Experience (UX) Do you know the overlaps between SEO and accessibility? If you’re optimizing for search engines, you’re also affecting how people using assistive technologies experience your site. Let's examine the effects and best practices for keyword usage, text formatting, and links. Read this post L By: Laura Lippay May 19, 2016 Optimizing for Accessibility + SEO: Site & Page Structure Overlaps On-page SEO | Technical SEO | User Experience (UX) How well can ALL visitors navigate your site? In this first post of three, we'll try out simple screen readers & look at structural overlaps in SEO + accessibility like titles, headings, semantic markup, page structure & sitemaps. Read this post By: Aleyda Solis May 17, 2016 Recovering Your Organic Search Traffic from a Web Migration Gone Wrong Technical SEO | SEO Analytics | Advanced SEO You'd never change a URL without ensuring your 301s, links, sitemaps, and canonicals are in order... but a new client might have in the past. Here's what you can do to untangle any migration messes you've inherited and regain lost organic traffic. Read this post By: Will Critchlow May 16, 2016 Just How Long Are Big-Company SEOs Waiting for Their Most Important Changes? Technical SEO | Advanced SEO | SEO Consulting What would you say if I told you that the average SEO at a big company has been waiting over six months for their highest priority technical change and doesn’t anticipate seeing it deployed for at least another six months? (40+% have been waiting over a year.) Read this post By: Sherry Gray April 28, 2016 Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat Technical SEO Selecting a new web host, even under duress, is a much simpler process when you're prepared. Read this post By: Larry Kim April 18, 2016 Does Organic CTR Impact SEO Rankings? [New Data] Keyword Research | Technical SEO | Advanced SEO Does organic CTR data impact page rankings? Sharing recent research findings, Larry Kim makes the case that RankBrain and higher organic click-through rates are deeply intertwined. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "301 Redirects for SEO: Google Removes the Penalty"
    },
    {
      "level": "H2",
      "text": "The Search Marketer's Guide to ItemRef & ItemID"
    },
    {
      "level": "H2",
      "text": "10 Illustrations of How Fresh Content May Influence Google Rankings (Updated)"
    },
    {
      "level": "H2",
      "text": "Using Google Tag Manager to Dynamically Generate Schema Code"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Use BigQuery for Large-Scale SEO (Or Whenever Excel Fails)"
    },
    {
      "level": "H2",
      "text": "Optimizing for Accessibility: Alt Text, Videos, Images & More"
    },
    {
      "level": "H2",
      "text": "Here’s How to Keep 301 Redirects from Ruining Your SEO"
    },
    {
      "level": "H2",
      "text": "Is Quora Skirting the Edge of ‘Spammy’ When it Comes to SEO?"
    },
    {
      "level": "H2",
      "text": "Optimizing for Accessibility + SEO: Formatting & Link Overlaps"
    },
    {
      "level": "H2",
      "text": "Optimizing for Accessibility + SEO: Site & Page Structure Overlaps"
    },
    {
      "level": "H2",
      "text": "Recovering Your Organic Search Traffic from a Web Migration Gone Wrong"
    },
    {
      "level": "H2",
      "text": "Just How Long Are Big-Company SEOs Waiting for Their Most Important Changes?"
    },
    {
      "level": "H2",
      "text": "Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat"
    },
    {
      "level": "H2",
      "text": "Does Organic CTR Impact SEO Rankings? [New Data]"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Mike Arnesen\n          \n            Cyrus Shepard\n          \n            Chris Goddard\n          \n            Dominic Woodman\n          \n            Laura Lippay\n          \n            Logan Ray\n          \n            Wei Leen Ng\n          \n            Laura Lippay\n          \n            Laura Lippay\n          \n            Aleyda Solis\n          \n            Will Critchlow\n          \n            Sherry Gray\n          \n            Larry Kim"
}