{
  "url": "https://moz.com/blog/category/technical-seo/p12",
  "slug": "p12",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Gerard Martínez September 16, 2015 How to Unlock Your Website’s Potential and Increase Load Speed by Nearly 30 Percent Technical SEO | Advanced SEO | User Experience (UX) One of the best steps you can take to improve the performance of your website is to make loading speed a priority. Read this post By: Billy Hoffman August 26, 2015 The SEO Professional's Guide to Waterfall Diagrams Technical SEO A waterfall diagram, such as those produced by WebPageTest, is a powerful indicator of optimization opportunities. Do you know how to read them? Read this post By: Rand Fishkin August 7, 2015 Why Effective, Modern SEO Requires Technical, Creative, and Strategic Thinking Technical SEO | Whiteboard Friday While SEO is a different field than it once was, technical chops are still required to do things really well. In today's Whiteboard Friday, Rand pushes back against the idea that those skills are no longer necessary. Read this post By: Mark Isham July 20, 2015 The SEO Expert's Guide to Web Performance Using WebPageTest Technical SEO Site performance has an undeniable impact on user experience and search rankings, and in this post, our friends at Zoompf show us how to use a fantastic free tool to see how we're doing. Read this post By: Tom Anthony July 13, 2015 An Open-Source Tool for Checking rel-alternate-hreflang Annotations Technical SEO | SEO Tools | International SEO With the increasing number of SEO directives and annotations available, and the ever-changing guidelines around how to deploy them, it is important to automate whatever areas possible. In this blog post I'm going to share an open source Python library which makes it easy to read the hreflang entries from a page and identify errors with them. Read this post By: Daniel Morgan July 9, 2015 Google’s Direct Answers: How to Keep Visitors Coming to Your Site Content Marketing | Technical SEO | Advanced SEO Have you considered how to make Google's Direct Answers Box work for your website? It begins with a few simple tweaks. Read this post By: Cyrus Shepard July 6, 2015 The Meta Referrer Tag: An Advancement for SEO and the Internet Technical SEO | SEO Analytics The movement to make the Internet more secure through HTTPS brings several useful advancements for webmasters. Sadly, HTTPS also has its downsides, including the loss of referral information. Enter the meta referrer tag. Read this post By: Dr. Peter J. Meyers June 18, 2015 The Colossus Update: Waking The Giant Technical SEO | Search Engines June 16, 2015 marked one of the hottest days on MozCast. Was this a change in Google's HTTPS algorithm, or the aftershock of waking the Wikipedia giant? Read this post By: Roy Hinkis June 15, 2015 Study: 300 Google Sitelinks Search Boxes - Triggers and Trip-Ups Analyzed Technical SEO | Advanced SEO This recent study unravels some of the mystery behind the sitelinks searchbox and shines a light on some areas website owners can exploit for possible success. Read this post By: Eric Enge June 11, 2015 Eliminate Duplicate Content in Faceted Navigation with Ajax/JSON/JQuery On-page SEO | Technical SEO | Advanced SEO Page tags like rel=canonical and noindex are powerful, but each has limitations. In some cases, Ajax-based solutions are a better solution. Read this post By: Ruth Burr Reedy June 5, 2015 Should I Use Relative or Absolute URLs? Technical SEO | Whiteboard Friday Should we use relative or absolute URLs on our sites? It's a simple question with a nuanced answer, and in today's Whiteboard Friday, Ruth Burr Reedy guides us through. Read this post By: Samuel Scott May 26, 2015 How to Use Server Log Analysis for Technical SEO Technical SEO | Search Engines | SEO Analytics Your server log files, though they may seem bland, contain a wealth of information that you can use in your SEO work. In today's post, Samuel Scott shows you how to find it and take full advantage. Read this post By: Bill Slawski May 21, 2015 The Long Click and the Quality of Search Success Technical SEO | Advanced SEO A recent patent filing from Google offers hints about the long click, and in this post Bill Slawski helps decode the legalese. Read this post By: Rand Fishkin May 15, 2015 How to Combat 5 of the SEO World's Most Infuriating Problems Technical SEO | Whiteboard Friday When SEOs with the best of intentions are stymied by things out of their control, it can make us absolutely crazy. In today's Whiteboard Friday, Rand offers some clarity and a way forward. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "How to Unlock Your Website’s Potential and Increase Load Speed by Nearly 30 Percent"
    },
    {
      "level": "H2",
      "text": "The SEO Professional's Guide to Waterfall Diagrams"
    },
    {
      "level": "H2",
      "text": "Why Effective, Modern SEO Requires Technical, Creative, and Strategic Thinking"
    },
    {
      "level": "H2",
      "text": "The SEO Expert's Guide to Web Performance Using WebPageTest"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "An Open-Source Tool for Checking rel-alternate-hreflang Annotations"
    },
    {
      "level": "H2",
      "text": "Google’s Direct Answers: How to Keep Visitors Coming to Your Site"
    },
    {
      "level": "H2",
      "text": "The Meta Referrer Tag: An Advancement for SEO and the Internet"
    },
    {
      "level": "H2",
      "text": "The Colossus Update: Waking The Giant"
    },
    {
      "level": "H2",
      "text": "Study: 300 Google Sitelinks Search Boxes - Triggers and Trip-Ups Analyzed"
    },
    {
      "level": "H2",
      "text": "Eliminate Duplicate Content in Faceted Navigation with Ajax/JSON/JQuery"
    },
    {
      "level": "H2",
      "text": "Should I Use Relative or Absolute URLs?"
    },
    {
      "level": "H2",
      "text": "How to Use Server Log Analysis for Technical SEO"
    },
    {
      "level": "H2",
      "text": "The Long Click and the Quality of Search Success"
    },
    {
      "level": "H2",
      "text": "How to Combat 5 of the SEO World's Most Infuriating Problems"
    }
  ],
  "author": "Gerard Martínez\n          \n            Billy Hoffman\n          \n            Rand Fishkin\n          \n            Mark Isham\n          \n            Tom Anthony\n          \n            Daniel Morgan\n          \n            Cyrus Shepard\n          \n            Dr. Peter J. Meyers\n          \n            Roy Hinkis\n          \n            Eric Enge\n          \n            Ruth Burr Reedy\n          \n            Samuel Scott\n          \n            Bill Slawski\n          \n            Rand Fishkin"
}