{
  "url": "https://moz.com/blog/category/technical-seo/p13",
  "slug": "p13",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Nathan Byloff April 8, 2015 Use the Google PageSpeed Module to Dramatically Increase the Speed of Your Website Technical SEO | Advanced SEO A fast website is no longer a luxury; it an expectation from site visitors and search engines. Google's PageSpeed Module can give you a leg up in creating a better user experience. Read this post By: Dan Shure March 30, 2015 Music SEO - 7 Lessons in Brand Optimization for 2015 Technical SEO | Search Engines | Social Media For B2B or ecommerce, people often discover your brand with commercial queries like \"dining room lamps\" or an informational search like \"how to fix a dishwasher\". Then they look around your site, your social profiles, get retargeted—before ever making a purchase—but in many cases that journey started with an non-branded organic search. Read this post By: Todd McDonald March 20, 2015 The Power of Basic Technical SEO: Case Study Technical SEO | SEO Basics Technical SEO is an area worth your attention and can have a huge impact on the performance of your website. Read this post By: Jared Gardner March 18, 2015 How to Stop Spam Bots From Ruining Your Analytics Referral Data Technical SEO | SEO Analytics | Advanced SEO Don't give spam bots a free ride on your website. Create an inhospitable environment for the invasive pests in a few simple steps. Read this post By: Adam Thompson March 5, 2015 Case Study: How An OpenCart Store Used Caching To Improve Page Load Speed Technical SEO | E-Commerce SEO | User Experience (UX) Page load speed is an important factor in optimizing website performance. These tips will have your ecommerce pages loading faster in no time. Read this post By: Rand Fishkin February 24, 2015 15 SEO Best Practices for Structuring URLs Technical SEO | SEO Basics URL BEST PRACTICES - It's been a long time since we covered one of the most fundamental building blocks of SEO--the structure of domain names and URLs--and I think it's high time to revisit. Read this post By: Matthew Egan February 18, 2015 How To Use Vanity URLs and Avoid SEO Self-Cannibalization Technical SEO | SEO Basics | User Experience (UX) Vanity URLs are a useful, creative way to expand the reach of your brand while retaining the SEO-integrity of your main web domain. Read this post By: Justin Briggs February 17, 2015 Everything You Need to Know About Mobile App Search Technical SEO | Advanced SEO | Mobile SEO Mobile isn't the future. It's the present. Learn about new and emerging mobile app search opportunities, from mobile search results to app indexation. The growth of mobile search is transforming how we define technical SEO, moving beyond front-end and back-end optimization of websites into the realm of structured data and application development. Read this post By: Cyrus Shepard February 2, 2015 Google's Sitelinks Search Box: What You Need to Know On-page SEO | Technical SEO | SEO Basics Several months ago, Google announced a new sitelinks search box. Despite its strong adoption, until now we've had very little evidence to understand its effects. We implemented it to share with you the results. Here's what we found... Read this post By: Geoff Kenyon January 19, 2015 Technical Site Audit Checklist: 2015 Edition Technical SEO Back in 2011, I wrote a a technical site audit checklist, and while it was thorough, there have been a lot of additions to what is encompassed in a site audit. I have gone through and updated that old checklist for 2015. Read this post By: Richard Foulkes December 22, 2014 A Step-by-Step Guide to Updating Your Website Without Destroying Your SEO Technical SEO | SEO Basics Redesigning a website is one of the most neglected areas of online marketing. Often, the right parties are not involved, or they are involved too late, leading to errors, omissions or drastic decreases in site traffic. Don't allow your business to fall into this trap. Read this post By: Billy Hoffman December 11, 2014 HTTP/2: A Fast, Secure Bedrock for the Future of SEO Technical SEO Google developed a protocol called SPDY that is now being used as the basis for HTTP/2. This post details how this new protocol works, why it is important to you, and how you can get started using it today. Read this post By: Casey Meraz November 5, 2014 How to Perform the Ultimate Local SEO Audit Local SEO | Technical SEO | Advanced SEO Are you looking to dominate local search? This guide is all you will need to learn how to perform The Ultimate Local SEO Audit for your business or your clients. Learn what key areas you need to pay attention to, which ones carry the most weight, and determine what you need to do to start beating your competition today. Read this post By: Billy Hoffman November 4, 2014 Enabling HTTPS Without Sacrificing Your Web Performance Technical SEO | Advanced SEO When HTTPS was confirmed as a ranking factor, many organizations rushed to implement it without realizing they were impacting the UX of their sites. In this post, the folks at Zoompf detail the steps we should all take to minimize those side effects. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Use the Google PageSpeed Module to Dramatically Increase the Speed of Your Website"
    },
    {
      "level": "H2",
      "text": "Music SEO - 7 Lessons in Brand Optimization for 2015"
    },
    {
      "level": "H2",
      "text": "The Power of Basic Technical SEO: Case Study"
    },
    {
      "level": "H2",
      "text": "How to Stop Spam Bots From Ruining Your Analytics Referral Data"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Case Study: How An OpenCart Store Used Caching To Improve Page Load Speed"
    },
    {
      "level": "H2",
      "text": "15 SEO Best Practices for Structuring URLs"
    },
    {
      "level": "H2",
      "text": "How To Use Vanity URLs and Avoid SEO Self-Cannibalization"
    },
    {
      "level": "H2",
      "text": "Everything You Need to Know About Mobile App Search"
    },
    {
      "level": "H2",
      "text": "Google's Sitelinks Search Box: What You Need to Know"
    },
    {
      "level": "H2",
      "text": "Technical Site Audit Checklist: 2015 Edition"
    },
    {
      "level": "H2",
      "text": "A Step-by-Step Guide to Updating Your Website Without Destroying Your SEO"
    },
    {
      "level": "H2",
      "text": "HTTP/2: A Fast, Secure Bedrock for the Future of SEO"
    },
    {
      "level": "H2",
      "text": "How to Perform the Ultimate Local SEO Audit"
    },
    {
      "level": "H2",
      "text": "Enabling HTTPS Without Sacrificing Your Web Performance"
    }
  ],
  "author": "Nathan Byloff\n          \n            Dan Shure\n          \n            Todd McDonald\n          \n            Jared Gardner\n          \n            Adam Thompson\n          \n            Rand Fishkin\n          \n            Matthew Egan\n          \n            Justin Briggs\n          \n            Cyrus Shepard\n          \n            Geoff Kenyon\n          \n            Richard Foulkes\n          \n            Billy Hoffman\n          \n            Casey Meraz\n          \n            Billy Hoffman"
}