{
  "url": "https://moz.com/blog/category/technical-seo/p17",
  "slug": "p17",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Omar Sayyed August 2, 2012 Use SEOmoz Toolbar & Google Analytics for 301 Redirect Opportunities Technical SEO Diluting page authority can be a major problem for ecommerce sites. SEOs all over can benefit from this quick review of how to use the SEOmoz toolbar and Google Analytics to identify 301 redirect opportunities. This approach really focuses on low hanging fruit because it takes less than 10 minutes to uncover good finds. Here is a quick guide to show how we identify 301 redirect opportunities and the results of a successful implementation. Read this post By: Andrea Pernici July 10, 2012 An In-depth Analysis of Authorship, Google+ and Snippets Technical SEO I am currently receiving more inquiries than ever about what factors into the comparisons and associations apparent in authorship, enabling a given listing to stand out from the crowd in the SERPs. People want to pinpoint a cause and effect scenario. People want answers. Here are a number of tests related to what influences authorship. Read this post By: David Sottimano July 2, 2012 Googlebot Crawl Issue Identification Through Server Logs Technical SEO Sifting through server logs has made me infinitely better at my job as an SEO. If you're already using them as part of your analysis, congrats - if not, I encourage you to read this post. In this post we're going to: Briefly introduce a server log hit Understand common issues with Googlebot's crawl Use a server log to... Read this post By: Matthew Edgar June 29, 2012 Can Google Really Access Content in JavaScript? Really? Technical SEO But the question keeps coming up: can Google execute JavaScript and AJAX? Can they really? Read this post By: CJ Patrick May 30, 2012 Add Expires Headers? Why You Should Think Twice Before Using Them Technical SEO This article explains what expires headers are and how they benefit SEO, explains the dangers of improper implementation, and offers some insight on preventing issues. Read this post S By: Sujan Patel May 23, 2012 Cross-Browser Compatibility Testing for Website Owners Technical SEO Whether your website exists to reach out to customers, engage with them, build a community, sell products or act as a voice for your offline business, all of your efforts at maintaining your digital presence may be in vain if your website itself doesn’t display correctly! Read this post By: Luke Summerfield May 21, 2012 How to Pull the Old Switcheroo on Your Google SERP Listing Technical SEO A solution for those looking to play switcheroo to get better pages on your site ranking for your keywords. Read this post By: Mark Ginsberg May 11, 2012 Liberating Your Data from Google Webmaster Tools - a Step-by-Step Guide Technical SEO How to use XAMPP to collect crawl error data (and more) from Google Webmaster Tools via their API. Read this post By: Bob Jones April 25, 2012 8 Reasons Why Your Site Might Not Get Indexed Technical SEO Hi Mozzers, I've recently had to deal with several indexing problems that a few clients were experiencing. After digging deeper into the problems, I figured I'd write a post for Moz to share my experience so others don't have to spend as much time digging for answers to indexation problems. All it means is that your site or parts of it are not getting added to the Google (or one of the other guys) index, which means that no body will ever find your content in the search results. Read this post By: Stephanie Chang April 11, 2012 How Should You Handle Expired Content? [3 Strategies] Technical SEO Handling expired content can be an overwhelming experience for any SEO in charge of a dynamic website, whether it be an e-commerce, a classified (example: job search, real estate listings), or a seasonal/promotional (example: New York Fashion Week) site. Read this post By: Everett Sizemore March 28, 2012 Uncrawled 301s - A Quick Fix for When Relaunches Go Too Well Technical SEO A lot of things can go wrong when you change most of the URLs on a website with thousands or millions of pages. But this is the story of how something went a little too \"right\", and how it was fixed by doing something a little bit \"wrong\". On February, 28 2012 FreeShipping.org relaunched with a new design and updated site architecture.The site'... Read this post By: Daniel Butler March 27, 2012 The Lowdown on Structured Data and Schema.org - Your Questions Answered! Technical SEO First of all, thank you to everyone who listened in to the Microformats and Schema.org webinar with Richard Baxter and myself. If you are a PRO member and haven't had a chance to listen in, be sure to check it out! During and after the webinar we received a ton of great feedback and q... Read this post By: Dr. Peter J. Meyers March 21, 2012 Logic, Meet Google - Crawling to De-index Technical SEO Since Panda, more and more people are trying to get a handle on their indexed pages. I discuss a common mistake in de-indexation - blocking crawl paths to the pages you want out of the index. Read this post By: PracticeFusion March 19, 2012 How Sitelinks Are Quietly Costing You Conversions Technical SEO “It’s official, Google is broken and my career is over. Time to hide under my desk.” A bit extreme? Yes. But, if you saw what I saw a month ago, your reaction would’ve been exactly the same. Let me explain. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Use SEOmoz Toolbar & Google Analytics for 301 Redirect Opportunities"
    },
    {
      "level": "H2",
      "text": "An In-depth Analysis of Authorship, Google+ and Snippets"
    },
    {
      "level": "H2",
      "text": "Googlebot Crawl Issue Identification Through Server Logs"
    },
    {
      "level": "H2",
      "text": "Can Google Really Access Content in JavaScript? Really?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Add Expires Headers? Why You Should Think Twice Before Using Them"
    },
    {
      "level": "H2",
      "text": "Cross-Browser Compatibility Testing for Website Owners"
    },
    {
      "level": "H2",
      "text": "How to Pull the Old Switcheroo on Your Google SERP Listing"
    },
    {
      "level": "H2",
      "text": "Liberating Your Data from Google Webmaster Tools - a Step-by-Step Guide"
    },
    {
      "level": "H2",
      "text": "8 Reasons Why Your Site Might Not Get Indexed"
    },
    {
      "level": "H2",
      "text": "How Should You Handle Expired Content? [3 Strategies]"
    },
    {
      "level": "H2",
      "text": "Uncrawled 301s - A Quick Fix for When Relaunches Go Too Well"
    },
    {
      "level": "H2",
      "text": "The Lowdown on Structured Data and Schema.org - Your Questions Answered!"
    },
    {
      "level": "H2",
      "text": "Logic, Meet Google - Crawling to De-index"
    },
    {
      "level": "H2",
      "text": "How Sitelinks Are Quietly Costing You Conversions"
    }
  ],
  "author": "Omar Sayyed\n          \n            Andrea Pernici\n          \n            David Sottimano\n          \n            Matthew Edgar\n          \n            CJ Patrick\n          \n            Sujan Patel\n          \n            Luke Summerfield\n          \n            Mark Ginsberg\n          \n            Bob Jones\n          \n            Stephanie Chang\n          \n            Everett Sizemore\n          \n            Daniel Butler\n          \n            Dr. Peter J. Meyers\n          \n            PracticeFusion"
}