{
  "url": "https://moz.com/blog/category/technical-seo/p22",
  "slug": "p22",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Richard Baxter March 10, 2010 SEO Health Checks - Regular Housekeeping Tasks for Your Website's SEO Technical SEO Technical problems, errors and surprise releases are all regular features in the day to day management of a website when you’re an SEO. There’s no doubt that maintaining a quick, error free and well optimised site can lead to long term traffic success. Here are some of my tips for regular checks you should be doing to stay on top of your website to maximise your search engine performan... Read this post By: Rand Fishkin March 2, 2010 Pagination: Best Practices for SEO & User Experience Technical SEO We've been getting a lot of questions in Q+A and on the road at events like last week's Miva Merchant conference, Online Marketing Summit and the YCombinator conference about h... Read this post By: Rob Ousbey February 7, 2010 The Elements of an HTML Link Technical SEO Links. We often talk about why we want them and how to get them, but today I'd like to go back to basics and look at the constituent parts of the HTML code behind them. This is definitely a post for the new SEO, or web-developer looking to expand their experience, but even experienced search marketers may want to comment the nuances of some parts of the humble anchor tag's attributes. Read this post M By: Maciej Gałecki February 5, 2010 Testing How Crawl Priority Works Technical SEO A SHORT INTRODUCTION... We all know that the search engine robots more frequently visit popular pages, i.e. those that have the largest number of incoming links, both internal and external ones. The architecture of a website is usually correlated with the popularity of these pages expressed by number of backlinks:Home page has the most backlinks,1st ... Read this post M By: Michael Cottam February 1, 2010 It's a Feeding Frenzy for Keyword-Rich Domains Technical SEO It's a well-known fact in the SEO world that Google shows enormous favoritism in its rankings to domain names that contain one or more of the keywords being searched for. If your domain name is a close match to the search keywords all glued together, it's as easy as fishing with dynamite to get on page 1 of the SERPs for that search phrase.&... Read this post By: Mario Lurig January 8, 2010 Making Website URLs SEO Friendly... and Pretty Technical SEO Inspired by the Anatomy of a URL post, a pretty URL is great for SEO but requires more from a custom website than installing changing a wordpress setting. Luckily, the setup is not that difficult since most websites have two primary levels of design: a webpage, and a filter. For the technical folks, we will be using a feature... Read this post By: Rand Fishkin December 2, 2009 Diagrams for Solving Crawl Priority & Indexation Issues Technical SEO Yesterday night I stayed up way too late authoring a post on Google's Indexation Cap. Today, despite getting up way too early, I wanted to follow up and answer some of the questions from the comments, Twitter and my email. I think SEOs who read the post rightly asked for more direction in solving this problem - a fair request. Read this post By: Lindsay Wassell October 15, 2009 Rethinking Duplicate Content Technical SEO This post is about three pretty interesting things in my book; opportunities at SEOmoz, a new kind of duplicate content, and me. Despite the cleaver title, this post is not about SEO. You've been warned, OK? Read this post By: Rand Fishkin September 15, 2009 Crawling & Indexing - It's Not as Simple as Just In or Out Technical SEO Short post tonight as I'm just back from a short trip with Mystery Guest to celebrate our one year anniversary (which was awesome, BTW) and need to get caught up on lots of email. Let's start with a quick quiz - which of the following statements is true? A) My pages are in my XML sitemaps file, so they must be getting crawled B) My pages have been crawle... Read this post P By: Phillip Barbiero September 9, 2009 A Developer's Adventure Into the World of SEO Technical SEO Before I begin, I would like to emphasize I had never before done SEO. I had no clue about the terminology used, and I was never part of the club most of you have been in for a while. I have a tentancy to ramble, but I assure you it is all relevant to my tale of mystery, drama, and eventually, wonder. So please bear with me. I am not trying to bring new information to the table, rather I am try... Read this post By: Jennifer Sable Lopez August 5, 2009 Building SEO into the Development Process Technical SEO Over the past few weeks we’ve been having some great conversations about how SEOs and developers view each other, how they can work together, and why they shouldn’t try to kill each other. Heh. The conclusion that we should all know at least a little about each other’s jobs and that working together (rather than against each other) is beneficial to everyone is fairly obvious. ... Read this post D By: Duncan Morris August 3, 2009 10 Things You Must Check When You Re-launch Your Website Technical SEO Re-launching a site is a crucial and often worrying time. There are many many things that can go wrong, and when they do go wrong the results are often spectacular. Read this post By: Jennifer Sable Lopez July 22, 2009 High Impact/Low Effort SEO from a Developer's Perspective Technical SEO When was the last time you had a heated discussion with your developer? Or better yet, when was the last time they rolled their eyes at you when you asked them to make some sort of change to the website? My guess is that it probably hasn't been all that long. Or has it? A higher probability is actually that you work with some wicked smart developers who blow your mind away with their sheer awesomeness! Read this post M By: Michael Cottam July 17, 2009 Dynamic Landing Pages: Optimizing for Natural Search Technical SEO We all know the conversion benefits of tuning your PPC ad titles to match the exact words the customer typed in their search, breaking out what would be convenient \"groupings\" of ads with the same landing page into separate ads with separate, search-matching titles.For example, we have a honeymoon registry--but brides might... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "SEO Health Checks - Regular Housekeeping Tasks for Your Website's SEO"
    },
    {
      "level": "H2",
      "text": "Pagination: Best Practices for SEO & User Experience"
    },
    {
      "level": "H2",
      "text": "The Elements of an HTML Link"
    },
    {
      "level": "H2",
      "text": "Testing How Crawl Priority Works"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "It's a Feeding Frenzy for Keyword-Rich Domains"
    },
    {
      "level": "H2",
      "text": "Making Website URLs SEO Friendly... and Pretty"
    },
    {
      "level": "H2",
      "text": "Diagrams for Solving Crawl Priority & Indexation Issues"
    },
    {
      "level": "H2",
      "text": "Rethinking Duplicate Content"
    },
    {
      "level": "H2",
      "text": "Crawling & Indexing - It's Not as Simple as Just In or Out"
    },
    {
      "level": "H2",
      "text": "A Developer's Adventure Into the World of SEO"
    },
    {
      "level": "H2",
      "text": "Building SEO into the Development Process"
    },
    {
      "level": "H2",
      "text": "10 Things You Must Check When You Re-launch Your Website"
    },
    {
      "level": "H2",
      "text": "High Impact/Low Effort SEO from a Developer's Perspective"
    },
    {
      "level": "H2",
      "text": "Dynamic Landing Pages: Optimizing for Natural Search"
    }
  ],
  "author": "Richard Baxter\n          \n            Rand Fishkin\n          \n            Rob Ousbey\n          \n            Maciej Gałecki\n          \n            Michael Cottam\n          \n            Mario Lurig\n          \n            Rand Fishkin\n          \n            Lindsay Wassell\n          \n            Rand Fishkin\n          \n            Phillip Barbiero\n          \n            Jennifer Sable Lopez\n          \n            Duncan Morris\n          \n            Jennifer Sable Lopez\n          \n            Michael Cottam"
}