{
  "url": "https://moz.com/blog/category/technical-seo/p23",
  "slug": "p23",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "P By: Philip Murphy June 24, 2009 Redirecting Spiders on Windows Servers (Specify http crawling) Technical SEO In a recent visit to Bing Webmaster tools, I discovered that many pages on my site (including my home page) were being indexed as https:// rather than http:/ I had a look into my Yahoo Webmaster stats and discovered a similar phenomenon.Google indexed http pages only.Because I run a shopping cart on my site that requires https for certain pages, 301 redirecting the entire s... Read this post By: Rand Fishkin June 19, 2009 Are 404 Pages Always Bad for SEO? Technical SEO There are some very different schools of thought out there regarding 404 error code pages. Some SEOs recommend: Never allowing them - 301'ing every error page back to the home page or an internal category level page to preserve the maximum amount of link juice (in case someone links to a broken URL) Letting any erroneous/mistyped URL 404. Something... Read this post M By: Michael Cottam June 14, 2009 Down and Dirty: Write Your Own URL Rewrite Technical SEO We all know by this time about the benefits of converting your parameterized URLs to human- and crawler-friendly URLs, but the stock tools of the trade (ISAPI_Rewrite, mod_rewrite, etc.) don't necessarily scale all that well when you have a large number of categories, product pages, etc. I'm going to walk you through what it takes to code this yourself, and I think you'll find it's less scary and complex than you thought, and gives you a number of benefits in terms of ongoing maintenance, flexibility, etc. Read this post By: Darren Shaw June 4, 2009 Using .htaccess to Rewrite Dynamic URLs to SEO Friendly URLs Technical SEO I recently read jennita's excellent post, \"URL Rewrites and 301 Redirects - How does it all work?\", and thought a mod_rewrite example might be helpful to some. So, here's some example code of how I have used mod_rewrite to replace dynamic URLs with SEO friendly URLs. Read this post D By: Dana Schumacher June 3, 2009 The Cookie Conundrum Technical SEO I have been going back and forth with SEOmoz’s Danny Dover for the past couple weeks regarding a crawling error occurring within the site I am currently doing SEO for. He has been a tremendous help to me, and believes others may be having the same issues as I. So…low and behold, I’m going to discuss it here in hopes of finding others just like me and some further expertise on how to handle the situation. Read this post By: Jennifer Sable Lopez May 20, 2009 URL Rewrites and 301 Redirects - How Does It All Work? Technical SEO URL rewrites and 301 redirects... you talk about them, you recommend them, but do you truly understand how they work? Sure, you know that rewriting a URL means that the URL displayed in the browser changes to be more SEO (and user) friendly. And you know that a 301 redirect is a permanent redirect. But let's dig a little deeper, and explain how they work together. Read this post By: John McElborough May 4, 2009 A Better Web Development Process Based On the Concept of Link Bait Technical SEO Before I became a full time SEO I was developing websites for years, and while I enjoyed the finished result something always sat a bit uneasy with me about the web design/ development process; basically, its in the wrong order. I would expect most readers will have noted this or something similar themselves, so I guess this article is more of an attempt to help the enlightened explain and build a case for a better web development process (which ultimately leads to a more successful SEO campaign). Read this post V By: Vicroads April 17, 2009 IIS SEO Issues Technical SEO This entry was inspired by a YOUmoz post by Jeremy Chatfield called IIS Case Folding, Robots and Results. I believe Jeremy's post only scratched the surface of SEO issues isolated to IIS, so I thought I would cover some of the other issues worth considering. I have been working with IIS and MCMS now for over 6 months, and although only a third of my job is dedicated to SEO, I have taken the time to isolate all the SEO issues that plague our site. The following IIS issues do not just impact your SEO, they also impact your analytics and your ability to ensure the information you are passing onto your managers is accurate. Read this post By: Matt Lambert April 16, 2009 Uncovering Issues Via Site Reviews Technical SEO I've just read the technical issues blogpost about CDN's and redirects from Mr Critchlow. Interesting stuff, but beyond anything I see from day to day. However, when he mentions redirects and how getting things put in scope is difficult, I HAVE come across those issues, even in my early days. Read this post By: Will Critchlow April 6, 2009 Are There Any Good Solutions for Caching Redirects? Technical SEO A couple of large client projects we are working on at the moment have had me thinking about a tricky issue that rears its head in enterprise SEO projects especially. When large clients are making extensive website changes, our experience is that the section entitled '301 redirects' is inevitably the section that gets read quickly and then quietly shuffled out of scope. We have found we have to push hard to get large businesses to see the importance of permanent redirects. Read this post By: Rand Fishkin April 5, 2009 New Info from Google and Yahoo! Tilts the Geo-Targeting Balance Technical SEO At the SMX Sydney conference in Australia this past week, search engineers Priyank Garg & Greg Grothaus (of Yahoo! & Google, respectively) shared information about duplicate content filtering across domains of which I and many of the other speakers/attendees were previously unaware. Priyank, when asked about best practices for \"localizing\" English language content acro... Read this post By: Rand Fishkin March 4, 2009 12 Easy Mistakes That Plague Newcomers to the SEO Field Technical SEO I've been working with a lot of newcomers to SEO lately thanks to our PRO membership Q+A (BTW - sorry for the delays, the volume's tripled in the last 3 weeks, so we're a bit overwhelmed). It's been a great learning experience and I've gotten to see many of the struggles and misconceptions that affect entrants to the subject. As a partial remedy, I thought I'd take some time tonight to cover a ... Read this post By: Will Critchlow February 19, 2009 How Do You Register for Google Local with Multiple Languages? Technical SEO There are some difficulties at the moment with how to manage large numbers of local listings. As the tools for managing local listings improve, this will all get easier, but there is a fundamental problem with the setup if you operate in multiple languages. The guidelines currently say that you cannot create multiple listings for an individual entity (business location in a city) - but each listing is just associated with a single URL which doesn't work well when you operate in multiple languages. Read this post By: Rand Fishkin February 13, 2009 Canonical URL Tag - The Most Important Advancement in SEO Practices Since Sitemaps Technical SEO The announcement from Yahoo!, Live & Google that they will be supporting a new \"canonical url tag\" to help webmasters and site owners eliminate self-created duplicate content in the index is, in my opinion, the biggest change to SEO best practices since the emergence of Sitemaps. It's rare that we cover search engine announcements or \"news items\" here on SEOmoz, as this blog is devoted more towards tactics than breaking headlines, but this certainly demands attention and requires quick education. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Redirecting Spiders on Windows Servers (Specify http crawling)"
    },
    {
      "level": "H2",
      "text": "Are 404 Pages Always Bad for SEO?"
    },
    {
      "level": "H2",
      "text": "Down and Dirty: Write Your Own URL Rewrite"
    },
    {
      "level": "H2",
      "text": "Using .htaccess to Rewrite Dynamic URLs to SEO Friendly URLs"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The Cookie Conundrum"
    },
    {
      "level": "H2",
      "text": "URL Rewrites and 301 Redirects - How Does It All Work?"
    },
    {
      "level": "H2",
      "text": "A Better Web Development Process Based On the Concept of Link Bait"
    },
    {
      "level": "H2",
      "text": "IIS SEO Issues"
    },
    {
      "level": "H2",
      "text": "Uncovering Issues Via Site Reviews"
    },
    {
      "level": "H2",
      "text": "Are There Any Good Solutions for Caching Redirects?"
    },
    {
      "level": "H2",
      "text": "New Info from Google and Yahoo! Tilts the Geo-Targeting Balance"
    },
    {
      "level": "H2",
      "text": "12 Easy Mistakes That Plague Newcomers to the SEO Field"
    },
    {
      "level": "H2",
      "text": "How Do You Register for Google Local with Multiple Languages?"
    },
    {
      "level": "H2",
      "text": "Canonical URL Tag - The Most Important Advancement in SEO Practices Since Sitemaps"
    }
  ],
  "author": "Philip Murphy\n          \n            Rand Fishkin\n          \n            Michael Cottam\n          \n            Darren Shaw\n          \n            Dana Schumacher\n          \n            Jennifer Sable Lopez\n          \n            John McElborough\n          \n            Vicroads\n          \n            Matt Lambert\n          \n            Will Critchlow\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Will Critchlow\n          \n            Rand Fishkin"
}