{
  "url": "https://moz.com/blog/category/technical-seo/p26",
  "slug": "p26",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "K By: Kate Morris April 24, 2008 Sitemaps: The Ultimate Online Smoke Signal Technical SEO Getting a new website found on the internet can be difficult for some. You just have to put it up there right? Nope. You need links, or to tell the main engines that it's there. Screaming in the forest does nothing, but the homing beacon can do wonders. An XML sitemap is a great beacon. Based on ... Read this post T By: Theo van der Zee April 22, 2008 The HTTP Referer: Friend or Foe? Technical SEO The referer - which is actually a misspelling for the word referrer - is a commonly used and powerful tool. It points out on which website the link was located that the current visitor clicked to visit your website. Both webdesigners and SEO'ers can profit greatly from knowing where a visitor came from. This is the case for both internal clicks on a website, and clicks from an external webs... Read this post V By: Valentin Vieriu April 10, 2008 SEO-Friendly FLEX Websites Technical SEO When building a FLEX( Flash ) application that must be available to the user via Internet, always comes the next question : Will the website containing the application be SEO friendly?And the answer is NO. Google and other search engines cannot see inside your FLEX( Flash ) website/application and and index your pages. If SEO is important to you, and it should be important, you... Read this post By: Brian Brown April 8, 2008 SEOmoz Is Clueless Technical SEO Or so Google Imagebot might have us believe. As a fellow contributor, participant, follower and fan, I'm going to take Imagebot's opinion with a large grain of salt -- or a ... Read this post T By: Theo van der Zee April 1, 2008 Removing ?PHPSESSID from a URL Technical SEO You’ve worked hard to prevent any duplicate content on your website. No copy-paste on your copy, no two url’s returning the exact same webpage due to incorrect usage of mod_rewrite and so on. But then, a couple days after the big launch, Google starts getting cluttered with dozens of references to your website, which harms your rankings. All due to an incorrect and insecure alternat... Read this post By: Rand Fishkin February 5, 2008 The Problem with Pagination on CPM Ad Driven Websites Technical SEO This morning I woke up at 3:45am (just about the time I usually go to sleep), kissed my fiancée goodbye and jetted off for a day-long meeting in Phoenix, AZ with the folks at Village Voice Media (operators of 16 weekly newspapers and many media-focused sites and blogs). During our chat, the issue of pagination for article content reared its ... Read this post By: Rand Fishkin February 4, 2008 Controlling Search Engine Access with Cookies & Session IDs Technical SEO We've talked plenty in the past about methods to control search engine spiders' access to documents on your website, and we've discussed cloaking in several depths as well. But I feel that an under-utilized and extremely powerful methodology for serving unique content in different ways to visitors and search engines, based on the different experiences sought by the two, is critical to advanced ... Read this post E By: ekal February 1, 2008 The Complete Introduction to Joomla SEO Technical SEO Hey All. At the suggestion of a few people in the Joomla community I decided to site down and write a beginner's guide to optimizing a Joomla site for SEO. The bad news: the default version of Joomla i... Read this post By: Rand Fishkin January 30, 2008 Rewriting the Beginner's Guide to SEO: Redirection, Server, & Hosting Issues Technical SEO I'm currently in the process of re-authoring and re-building the Beginner's Guide to Search Engine Optimization, section by section. You can read more about this project here. Redirecting Pages f... Read this post By: Brian Brown January 28, 2008 How to Make a Spider Crawl Backwards Technical SEO First off, we need to begin with the usual disclaimers and warnings -- not that they are necessarily necessary -- but just in case ... your mileage may vary, no claims made, use at own risk, don't try this at home, performed on a closed track with professional driver, and so on. And please note that these ideas are strictly conceptual, at least that I'm aware, and have not been te... Read this post By: Rand Fishkin January 28, 2008 Choosing the Right CMS Platform for Your Website (from an SEO perspective) Technical SEO The Question: I'm starting a new site and have no idea what I should do for software. Do I need to use a content management system, and if so, should I build my own or use someone else's? The Answer: It depends... I want to try taking a new tact with this blog post and give some direction about how to approach this issue. There's no way to tack... Read this post A By: aaron_hunter January 16, 2008 Wordpress vs. Joomla: A Handy Guide Technical SEO A Google search for “wordpress vs. joomla” returns 389,000 pages, so clearly there have been volumes of debate written on content management systems. But given the popularity of PiperTax’s post on SEO for Joomla and some of the comments, I thought it would be useful to have a place to discuss the pros and cons ... Read this post By: Sebastian January 16, 2008 Robots Exclusion Protocol 101 Technical SEO <p>The Robots Exclusion Protocol (REP) is a conglomerate of standards that regulate Web robot behavior and search engine indexing. Despite the \"Exclusion\" in its name, the REP covers mechanisms for inclusion too. The REP consists of</p><ol><li>The original REP from <a href=\"http://www.robotstxt.org/orig.html\">1994</a>, extended <a href=&qu... Read this post By: Rand Fishkin January 15, 2008 12 Ways to Keep Your Content Hidden from the Search Engines Technical SEO Here at SEOmoz, we're usually talking about how to make your content more visible to the search engines. Today, we're taking a different direction. It may seem unusual, but there are plenty of times when content on your website needs to be protected from search indexing and caching. Why? Many reasons: Privacy Duplicate Content Issues Keyword Cann... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Sitemaps: The Ultimate Online Smoke Signal"
    },
    {
      "level": "H2",
      "text": "The HTTP Referer: Friend or Foe?"
    },
    {
      "level": "H2",
      "text": "SEO-Friendly FLEX Websites"
    },
    {
      "level": "H2",
      "text": "SEOmoz Is Clueless"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Removing ?PHPSESSID from a URL"
    },
    {
      "level": "H2",
      "text": "The Problem with Pagination on CPM Ad Driven Websites"
    },
    {
      "level": "H2",
      "text": "Controlling Search Engine Access with Cookies & Session IDs"
    },
    {
      "level": "H2",
      "text": "The Complete Introduction to Joomla SEO"
    },
    {
      "level": "H2",
      "text": "Rewriting the Beginner's Guide to SEO: Redirection, Server, & Hosting Issues"
    },
    {
      "level": "H2",
      "text": "How to Make a Spider Crawl Backwards"
    },
    {
      "level": "H2",
      "text": "Choosing the Right CMS Platform for Your Website (from an SEO perspective)"
    },
    {
      "level": "H2",
      "text": "Wordpress vs. Joomla: A Handy Guide"
    },
    {
      "level": "H2",
      "text": "Robots Exclusion Protocol 101"
    },
    {
      "level": "H2",
      "text": "12 Ways to Keep Your Content Hidden from the Search Engines"
    }
  ],
  "author": "Kate Morris\n          \n            Theo van der Zee\n          \n            Valentin Vieriu\n          \n            Brian Brown\n          \n            Theo van der Zee\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            ekal\n          \n            Rand Fishkin\n          \n            Brian Brown\n          \n            Rand Fishkin\n          \n            aaron_hunter\n          \n            Sebastian\n          \n            Rand Fishkin"
}