{
  "url": "https://moz.com/blog/category/technical-seo/p8",
  "slug": "p8",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Will Critchlow May 29, 2017 Evidence of the Surprising State of JavaScript Indexing Advanced SEO | Technical SEO | On-page SEO What exactly is going on with JavaScript indexing? The evidence suggest Google is able to crawl it, but how and to what extent? Will Critchlow shares a collection of facts from across the web that paints a picture of the state of JavaScript indexing today and issues a hypothesis you just might wish to test. Read this post By: Russ Jones May 24, 2017 Tackling Tag Sprawl: Crawl Budget, Duplicate Content, and User-Generated Content Advanced SEO | Technical SEO | SEO Consulting An unapologetically nerdy guide to combating bad, duplicate user-generated content with data, statistics, and sheer force of will. Read this post By: Benjamin Estes May 15, 2017 Faster Sites: Beyond PageSpeed Insights Technical SEO | SEO Analytics | Advanced SEO PageSpeed Insights can be useful, but a perfect score doesn’t guarantee a fast site. There are smarter ways to assess and improve site speed. Read this post By: Sam Nemzer May 9, 2017 How to Implement SEO Changes Using Google Tag Manager Technical SEO | Advanced SEO | SEO Tools Rigid CMS? Backed-up dev queue? Using Google Tag Manager, you can move past your issues implementing technical SEO changes and start adding structured data, canonicals, noindex tags, mobile switchboard tags, and more. Read this post By: Jono Alderson April 26, 2017 There's No Such Thing as a Site Migration Technical SEO | Advanced SEO We all have horror stories of migration projects gone wrong. Things get missed, priorities change, and performance is impacted. Can we do better if we improve our definitions? Read this post By: Dr. Peter J. Meyers April 24, 2017 Half of Page-1 Google Results Are Now HTTPS Search Engines | Technical SEO HTTPS results have topped 50% of page-1 Google rankings, according to our 10K tracking data. Dr. Pete explores the trends, major hold-outs, and what to expect in the near future. Read this post By: Serge Stefoglo April 20, 2017 Large Site SEO Basics: Faceted Navigation Advanced SEO | Technical SEO Faceted navigation is great for users, but it negatively impacts SEO with duplicate content, wasted crawl budget, and inefficient use of link equity. Sergey Stefoglo shares how to tackle the issue of faceted nav in a more SEO-friendly way. Read this post M By: Michael Cottam April 11, 2017 XML Sitemaps: The Most Misunderstood Tool in the SEO's Toolbox Technical SEO | SEO Tools XML sitemaps are a powerful tool for SEOs, but are often misunderstood and misused. Michael Cottam explains how to leverage XML sitemaps to identify and resolve indexation problems. Read this post By: Dominic Woodman April 6, 2017 How to Get More of Your Search Console Data from the API (Plus, Learn How to Use Python) Technical SEO | Advanced SEO Using the Google Search Console API, you can get up to 5,000 queries at once, apply multiple filters instantly, and run multiple queries quickly and easily. All it takes is a little elbow grease and some practice with Python. Read this post By: David Deering April 3, 2017 Schema.org Just Released New Restaurant Menu Markup — Here's How to Get Started Local SEO | Technical SEO Restaurant site owners rejoice — Schema.org just released a far more detailed way to mark up your menus in the SERPs. Check out the new possibilities and how to get started here! Read this post By: Everett Sizemore March 22, 2017 How to Do a Content Audit Content Marketing | Technical SEO | On-page SEO Learn how to do content audits for SEO in this Moz guide by Everett Sizemore, including tips for crawling large websites, rendering JavaScript content, and auditing dynamic mobile content. Read this post M By: Michael Cottam March 13, 2017 Google Algorithmic Penalties Still Happen, Post-Penguin 4.0 Technical SEO | Search Engines Penguin penalties might be a thing of the past, but link-based algorithmic penalties still exist in Google. Read this post By: Britney Muller March 6, 2017 Infinite \"People Also Ask\" Boxes: Research and SEO Opportunities Advanced SEO | Technical SEO People Also Ask boxes have grown by 1,723% since July 2015. Google has also launched infinite PAAs so searchers can more deeply explore topics they're searching for. What's the future of PAAs and how is machine learning powering them? Read this post By: Dr. Peter J. Meyers March 1, 2017 Mastering Google Search Operators in 67 Easy Steps Technical SEO | Advanced SEO Google search operators are like chess – knowing how the pieces move doesn't make you a master. Dive into 67 examples, from content research to site audits, and level up your search operator game. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Evidence of the Surprising State of JavaScript Indexing"
    },
    {
      "level": "H2",
      "text": "Tackling Tag Sprawl: Crawl Budget, Duplicate Content, and User-Generated Content"
    },
    {
      "level": "H2",
      "text": "Faster Sites: Beyond PageSpeed Insights"
    },
    {
      "level": "H2",
      "text": "How to Implement SEO Changes Using Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "There's No Such Thing as a Site Migration"
    },
    {
      "level": "H2",
      "text": "Half of Page-1 Google Results Are Now HTTPS"
    },
    {
      "level": "H2",
      "text": "Large Site SEO Basics: Faceted Navigation"
    },
    {
      "level": "H2",
      "text": "XML Sitemaps: The Most Misunderstood Tool in the SEO's Toolbox"
    },
    {
      "level": "H2",
      "text": "How to Get More of Your Search Console Data from the API (Plus, Learn How to Use Python)"
    },
    {
      "level": "H2",
      "text": "Schema.org Just Released New Restaurant Menu Markup — Here's How to Get Started"
    },
    {
      "level": "H2",
      "text": "How to Do a Content Audit"
    },
    {
      "level": "H2",
      "text": "Google Algorithmic Penalties Still Happen, Post-Penguin 4.0"
    },
    {
      "level": "H2",
      "text": "Infinite \"People Also Ask\" Boxes: Research and SEO Opportunities"
    },
    {
      "level": "H2",
      "text": "Mastering Google Search Operators in 67 Easy Steps"
    }
  ],
  "author": "Will Critchlow\n          \n            Russ Jones\n          \n            Benjamin Estes\n          \n            Sam Nemzer\n          \n            Jono Alderson\n          \n            Dr. Peter J. Meyers\n          \n            Serge Stefoglo\n          \n            Michael Cottam\n          \n            Dominic Woodman\n          \n            David Deering\n          \n            Everett Sizemore\n          \n            Michael Cottam\n          \n            Britney Muller\n          \n            Dr. Peter J. Meyers"
}