{
  "url": "https://moz.com/blog/category/technical-seo/p9",
  "slug": "p9",
  "title": "Technical SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Maryna Samokhina February 20, 2017 Strategic SEO Decisions to Make Before Website Design and Build SEO Basics | Technical SEO | Design Asking the right SEO questions before you build a site sets you up for success later on. Check out the most important considerations to make before going all-in with a new website. Read this post By: Alexis Sanders February 9, 2017 A Guide to JSON-LD for Beginners Technical SEO | SEO Basics Structured data is a must-have for many sites, but it can be hard to get a handle on the technical considerations. Learn the important basics of JSON-LD and how to ramp up your education as you apply it. Read this post By: Joe Robison January 10, 2017 How to Find and Fix 14 Technical SEO Problems That Can Be Damaging Your Site Now Technical SEO Are there technical issues plaguing your site beneath the surface? Learn about some of the most common and damaging technical SEO problems and how to begin fixing them. Read this post By: Rand Fishkin January 6, 2017 How to Kickstart an SEO Audit for Your Startup Technical SEO | Whiteboard Friday | Advanced SEO It's incredibly important to consider SEO when launching a startup. In this Whiteboard Friday, Rand shares how to kickstart a comprehensive SEO audit for your new business's site. Read this post By: Pete Watson-Wailes November 22, 2016 Automating Technical Reporting for SEO Technical SEO | SEO Reporting Learn how you can set up an early warning system for your site's more important errors using server logs and see what you should watch out for. Read this post By: Russ Jones November 7, 2016 Google's War on Data and the Clickstream Revolution Technical SEO | Search Engines | Advanced SEO SEOs rely on data more than ever, and it seems Google is obscuring, blocking, or removing it at every opportunity. But there is hope, and we call it clickstream data. Read this post M By: Michael King October 25, 2016 The Technical SEO Renaissance: The Whys and Hows of SEO’s Forgotten Role in the Mechanics of the Web Technical SEO | Advanced SEO Technical SEO is more complicated and more important than ever before, while much of the SEO discussion has shied away from its growing technical components in favor of content marketing. Mike King makes a compelling case for exactly why and how a returned focus on technical SEO will rejuvenate and revolutionize the search game. Read this post By: Mihai Aperghis October 16, 2016 How to Use Search Analytics in Google Sheets for Better SEO Insights Technical SEO | SEO Analytics | Advanced SEO There’s no reason to go over what is or why you should use Google Search Console’s most powerful data-powered tool, Search Analytics. As an SEO, whether you’re working in-house or handling many clients in an agency, you’ve likely been using this tool for a bunch of reasons. Whether it's diagnosing traffic and position changes, or finding opportunities for optimiz... Read this post By: Joe Robison September 21, 2016 How to Fix Crawl Errors in Google Search Console Technical SEO | SEO Tools Search Console is one of the most powerful tools we have for diagnosing website errors. Learn how to prioritize and resolve your site's crawl errors in Google Search Console — those hundreds of 404 errors may not be so daunting after all. Read this post By: Pete Watson-Wailes September 15, 2016 Introducing Progressive Web Apps: What They Might Mean for Your Website and SEO Technical SEO | Advanced SEO | Mobile SEO Progressive Web Apps are the next big thing when it comes to delivering a dynamite mobile experience. But what actually makes a PWA? Should you have one? And if you create one, how will you make sure it ranks? Read this post By: Lucía Marín September 14, 2016 Here’s How to Generate and Insert Rel Canonical with Google Tag Manager On-page SEO | Technical SEO | Advanced SEO In this article, we’re going to learn how to create the rel canonical URL tag using Google Tag Manager, and how to insert it in every page of our website so that the correct canonical is automatically generated in each URL. Read this post By: Everett Sizemore September 7, 2016 The Most Effective Way to Improve Sitewide Quality and Rankings (Most of the Time) Content Marketing | Technical SEO | SEO Basics How much dead weight is bringing your site down in rankings? Armed with compelling case study data, Everett Sizemore shares his single most effective and scaleable tactic for improving your site's overall level of quality, in most situations. Read this post By: David Sottimano August 10, 2016 An Essential Training Task List for Junior SEOs Technical SEO | Advanced SEO | SEO Basics With 5 detailed projects that drag you through the technical trenches, this customizable training program for Junior SEOs should put you on the road to skill mastery (and a nice career edge) in just a couple of months. Read this post By: Jennifer Slegg August 3, 2016 Google's Rolling Out AMP to the Main SERPs – Are You Prepared? Technical SEO | Advanced SEO | Mobile SEO Are you ready for AMP? Google announced that AMP is going beyond the news carousel to join the \"10 blue links.\" Jen Slegg takes you through the changes, what to expect, and how to prepare. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Technical SEO"
    },
    {
      "level": "H2",
      "text": "Strategic SEO Decisions to Make Before Website Design and Build"
    },
    {
      "level": "H2",
      "text": "A Guide to JSON-LD for Beginners"
    },
    {
      "level": "H2",
      "text": "How to Find and Fix 14 Technical SEO Problems That Can Be Damaging Your Site Now"
    },
    {
      "level": "H2",
      "text": "How to Kickstart an SEO Audit for Your Startup"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Automating Technical Reporting for SEO"
    },
    {
      "level": "H2",
      "text": "Google's War on Data and the Clickstream Revolution"
    },
    {
      "level": "H2",
      "text": "The Technical SEO Renaissance: The Whys and Hows of SEO’s Forgotten Role in the Mechanics of the Web"
    },
    {
      "level": "H2",
      "text": "How to Use Search Analytics in Google Sheets for Better SEO Insights"
    },
    {
      "level": "H2",
      "text": "How to Fix Crawl Errors in Google Search Console"
    },
    {
      "level": "H2",
      "text": "Introducing Progressive Web Apps: What They Might Mean for Your Website and SEO"
    },
    {
      "level": "H2",
      "text": "Here’s How to Generate and Insert Rel Canonical with Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "The Most Effective Way to Improve Sitewide Quality and Rankings (Most of the Time)"
    },
    {
      "level": "H2",
      "text": "An Essential Training Task List for Junior SEOs"
    },
    {
      "level": "H2",
      "text": "Google's Rolling Out AMP to the Main SERPs – Are You Prepared?"
    }
  ],
  "author": "Maryna Samokhina\n          \n            Alexis Sanders\n          \n            Joe Robison\n          \n            Rand Fishkin\n          \n            Pete Watson-Wailes\n          \n            Russ Jones\n          \n            Michael King\n          \n            Mihai Aperghis\n          \n            Joe Robison\n          \n            Pete Watson-Wailes\n          \n            Lucía Marín\n          \n            Everett Sizemore\n          \n            David Sottimano\n          \n            Jennifer Slegg"
}