{
  "url": "https://moz.com/blog/category/social-media/p16",
  "slug": "p16",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 11, 2009 Facebook Advertising - An Opportunity for Deep Targeting at Very Low Cost Social Media The following post is a collaborative effort by myself and David Klein (DK), who does far more Facebook advertising consulting than SEOmoz :-) He recently visited with the Facebook crew and has been helping more online marketers get comfortable and invested in the space. Read this post J By: John Shehata March 2, 2009 SEO Friendly Maps Social Media Though I have been a member of SEOmoz for sometime now and am actually one of the first 5 PRO members on SEOmoz (under my top secret account), this is my first blog post. I was encouraged by Rebecca’s request for SEOmozzers to unite. In a recent post I discussed creating SEO friendly widgets, so today I will discuss how to create SEO friendly maps. Read this post By: Fábio Ricotta February 25, 2009 Twitter Dupe Content and Link Building Strategy Social Media Hello YOUmozzers! These days I was reading a post of Andrew Kirkcaldy at YOUmoz that talks about some link juice opportunities into Twitter. While I was reading it, something into my head told me “check the number of indexed pages in Twitter!” So I did it. Read this post E By: Edward Sexton February 19, 2009 The Privacy of Photos on Facebook Social Media Privacy on social networking sites such as Facebook was exposed quite painfully with the whole Beacon debacle, which was using user data both on and off site to target ads. Read this post J By: jojos February 18, 2009 How Can You Use Social Media as Marketing Channels Social Media In the age of new media, how can we use them effectively to increase sales/business? How can you use new-age social media as a marketing channel? Let’s start from some basics to have a thought on this subject. People always neglect some simple facts, and that’s why most people fail in building a social media brand. This article is about how can we use even our simplest web activity as a marketing effort. It’s about how to use the power of social media as a powerful inbound marketing tool. Read this post S By: Sarah Carling February 17, 2009 Social Networking - The Other Side Social Media I am so sick of hearing about using social networking sites to boost SERPs. Every time someone suggests this, I feel like banging my head against a wall. Not only does it go completely against the spirit of these sites, it is probably one of the hardest things to do successfully, and without alienating an entire community in the process. Read this post O By: Oliver Bayes-Shelton February 10, 2009 How to Promote Yourself, Web 2.0 Style Social Media As we all know, there are a lot of so-called SEO experts sending out emails telling you that they guarantee page 1 ranking but then ask for your link. I don't agree with that strategy; instead, I think that taking these 7 steps will help get your name out there and connect with the people within our industry and make you look like a real SEO expert. Read this post By: Rand Fishkin February 9, 2009 Yes, Social Media is Powerful. No, It's Not as Powerful as Search. Social Media It's late. I'm just back from a week of travel and crazy amounts of email (note to other CEOs, when emailing 120K people with a special offer, be wary of putting your email address as the reply-to). I had a terrific time at the Online Marketing Summit - great people, many of whom I'd never met before, an impressive turnout of more than 500 (even in a down economy; wow!) and some terrific networking parties (the conference even featured catered dinner for the attendees, which was really nice). One of the subjects that arose, as usual, was the emergence and power of social media, and I had some quick thoughts to share. Read this post T By: Tom Critchlow February 6, 2009 An Example Of Why Content is King - The Guardian Chalkboards Social Media Sometimes the power of the internet and the modern age just astounds me. I'll see something that I just need to share and this is one of those times. It's not necessarily about SEO directly but it certainly demonstrates some amazing internet marketing and it re-emphasis just how powerful data and original content is. Read this post O By: Oliver Bayes-Shelton February 5, 2009 The Future for SEO Social Media So as we all know, universal searching is going to be more widespread in the future. But we all know that images, videos and news comes from social media portals. So does this mean that in order to make an effective SEO campaign, an SMO campaign is equally important? Read this post By: Rebecca Kelley December 10, 2008 Social Media: The People's Choice Awards of the Internet Social Media I've been hearing a lot of grumbling lately about the steady degradation of the quality of content online, especially as it relates to social media and social news sites. I don't necessarily agree with the gripes--was content that magical in 1999? As far as I can recall, there were hamster dances, dancing babies and Geocities pages long before LOLcats, Rickrolls and MySpace. Sure, there are millions and millions more people online now than there were 10 years ago and there are buttloads more pages of content, but to me, the type and quality of content hasn't changed all that much. You still have news articles and research papers and useful information in one corner, and porn, memes, photoshopped images, and general nonsense in another corner. Read this post By: Patrice Albertus November 30, 2008 Widget Marketing Model Social Media [Text translated from the French version of my blog - patricealbertus.net/_blog] As you already know by using your iphone or by reading blogs, the widget revolution is flying up! But what exactly are all theses widgets offering to e-marketers? Let’s look at it as a gadget, one easy-to-use application, something which has to be practical for its user, in order to simplify as much as possible the essential meaning of a widget: your product, your service, your branding. This post will outline how to figure out the new widget marketing and “ecosystem\" and about the innovation that opened its field from the Internet over to all new media from the numeric convergence. Read this post T By: Tom Critchlow November 28, 2008 How To Actually Get Links From Your Linkbait Social Media I like talking about link building - it is, after all, one of the most important rankings factors (hey Rand, when's that going to be updated?) and also one of the things people struggle with the most in the SEO industry. So here's some more tip... Read this post By: Rand Fishkin November 18, 2008 Which Social Media Platforms Work Best For Your SEO Efforts? Social Media The SEO world, particularly the blogosphere and forum chatter, is overwhelmed with talk of how to leverage social media sites for SEO value. Tonight, I'm curious - which types of social media platforms do you actually get the most direct SEO benefit from? Think classic SEO - higher rankings and more search traffic. Which slice of social media sites help you achieve this goal?... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Facebook Advertising - An Opportunity for Deep Targeting at Very Low Cost"
    },
    {
      "level": "H2",
      "text": "SEO Friendly Maps"
    },
    {
      "level": "H2",
      "text": "Twitter Dupe Content and Link Building Strategy"
    },
    {
      "level": "H2",
      "text": "The Privacy of Photos on Facebook"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How Can You Use Social Media as Marketing Channels"
    },
    {
      "level": "H2",
      "text": "Social Networking - The Other Side"
    },
    {
      "level": "H2",
      "text": "How to Promote Yourself, Web 2.0 Style"
    },
    {
      "level": "H2",
      "text": "Yes, Social Media is Powerful. No, It's Not as Powerful as Search."
    },
    {
      "level": "H2",
      "text": "An Example Of Why Content is King - The Guardian Chalkboards"
    },
    {
      "level": "H2",
      "text": "The Future for SEO"
    },
    {
      "level": "H2",
      "text": "Social Media: The People's Choice Awards of the Internet"
    },
    {
      "level": "H2",
      "text": "Widget Marketing Model"
    },
    {
      "level": "H2",
      "text": "How To Actually Get Links From Your Linkbait"
    },
    {
      "level": "H2",
      "text": "Which Social Media Platforms Work Best For Your SEO Efforts?"
    }
  ],
  "author": "Rand Fishkin\n          \n            John Shehata\n          \n            Fábio Ricotta\n          \n            Edward Sexton\n          \n            jojos\n          \n            Sarah Carling\n          \n            Oliver Bayes-Shelton\n          \n            Rand Fishkin\n          \n            Tom Critchlow\n          \n            Oliver Bayes-Shelton\n          \n            Rebecca Kelley\n          \n            Patrice Albertus\n          \n            Tom Critchlow\n          \n            Rand Fishkin"
}