{
  "url": "https://moz.com/blog/category/social-media/p17",
  "slug": "p17",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dan Tynski November 17, 2008 Social Media + Viral Social Engineering = More Traffic and Links Than GOD Social Media Past Paradigms of Viral Marketing In the past few years we've all started to understand the value of social media, the importance of great content, and the great success that can be had when one reaches the so called \"tipping point\" of virility when promoting their content. Read this post By: Rebecca Kelley November 6, 2008 Customer Service and Reputation Management the Twitter Way: A Case Study Social Media Last year I bought Comcast's NBA League Pass, which gave me access to the entire season of NBA basketball games. My brother egged me on to order it so he could use my online login and watch streaming games at home in Michigan (his cable provider didn't offer League Pass). A couple weeks ago I received a letter from Comcast informing me that they've auto-renewed me for NBA League Pass this year and that if I don't want to renew I'd have to cancel. I asked my brother if he wanted it again this year and he said that he didn't really want to shell out the money for it, so I could go ahead and cancel it if I wasn't going to use it. ... Read this post By: Rebecca Kelley October 23, 2008 Have a Commercial Website? Then Digg Won't Like You Social Media I'm a fan of Digg and visit it every day to read various stories and check out what's new. Every so often I comment on stories and submit stuff. I get a \"woo hoo!\" feeling whenever one of my comments gets a bunch of diggs or when a submission hits the home page, which, combined with the site's content and news stories, keeps me coming back for more. Sure, lots of people bash Digg... Read this post S By: Sarah Carling October 22, 2008 Un-Raveled: How Ravelry Successfully Created a Dedicated Community Social Media Reading the recent post on the nature of online communities got me thinking about my favourite online community, Ravelry. This is one of the largest niche communities I have ever come across, with it fast approaching 200,000 members all talking about....knitting! Read this post By: Jane Copland October 22, 2008 Help! My Industry Is Boring And My Imagination Is Hurting Social Media This is an older topic, but one which is still worth discussing: what is the best way to investigate linkbait, viral or other content-based link building efforts in \"boring\" industries? How best to find out what worked in the past? How best to find out what didn't work? We have a range of tools at our disposal when it comes to content-based link building research. You've h... Read this post October 20, 2008 YOUmoz NBA TweetK9 Fantasy League Social Media Welcome to the social media extravaganza known as the NBA TweetK9 Fantasy League. What you need to know about the NBA TweetK9 Fantasy League... Read this post T By: Tom Critchlow October 16, 2008 The Nature of Online Communities Social Media So this weekend I had a bit of free time so I decided to learn how to play go (narrowly beating chess I might add). Now as anyone who's familiar with go will know, it will probably take me more than a weekend to learn how to play but still, you have to start somewhere right!? Of course, being an internet junkie one of the first things I did was Google around to find some information online about g... Read this post By: Jane Copland October 8, 2008 All Linkbait Is Not Created Equal: What Linkscape Reveals About Popular Content Social Media Name the number one criticism of linkbait: from a technical point of view, the top problem with popular content is that it often doesn't attract many links. \"Linkbait\" has become a word we use to mean pretty much anything that gets media attention, no matter whether it is heavily linked to or not. In fact, one could argue that social media sites harm linkbait as much as they help it: if ... Read this post By: Rand Fishkin October 2, 2008 Branding Strategies for Your Social Media Profiles on the Web Social Media If your job or current tasklist includes building a social media strategy for your organization (or yourself, personally), you should be thinking about the branding created by the profiles you create. The profile name, the image you use as an icon or avatar, the webpage you link to and the words you use to describe yourself have a significant impact in how you're perceived and how you're rememb... Read this post By: Jane Copland September 17, 2008 The Dangers And Advantages Of Meme Marketing Social Media Who said life ain't a pretty place?... Read this post By: Gabriel Goldenberg September 10, 2008 Facebook Viral Videos: TapeWorms, Trojans and Obfuscation Social Media Did you know that my friend saw my sex tape on the web and messaged me about it on Facebook? Neither did I. The Blah is tracking and other garbage edited out to avoid helping out by sharing potentially useful variables. The f... Read this post By: Rebecca Kelley September 3, 2008 Holy Sh*t, I Joined Twitter Social Media Sigh. After much badgering, cajoling, nudging, and subtle threatening from my coworkers, colleagues, friends, and Jane (yes, Jane gets her own category--she badgered me a lot), I finally joined the Twitter. Much like Jane did when she begrudgingly joined, I'll take you through the terrifying process of nervously dipping a toe i... Read this post P By: Patrick Sexton August 20, 2008 Social Media is People Social Media I just read Aaron Walls great article called \"Social Media Free for All Pages\" and it made me think about something I wanted to put out about social media and how we speak about it. There s... Read this post By: Danny Dover August 15, 2008 Question for the Moz Community - SEOmoz's Twitter Account Social Media Disclaimer: This post doesn’t include any information about SEO. If you are looking for SEO related content, please read the normal search related posts on this blog. The SEOmoz community has always been a fundamental driving force behind this company. All of you provide the motivation to keep us working and the guidance to keep us on the right track. When asked why I like my ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Social Media + Viral Social Engineering = More Traffic and Links Than GOD"
    },
    {
      "level": "H2",
      "text": "Customer Service and Reputation Management the Twitter Way: A Case Study"
    },
    {
      "level": "H2",
      "text": "Have a Commercial Website? Then Digg Won't Like You"
    },
    {
      "level": "H2",
      "text": "Un-Raveled: How Ravelry Successfully Created a Dedicated Community"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Help! My Industry Is Boring And My Imagination Is Hurting"
    },
    {
      "level": "H2",
      "text": "YOUmoz NBA TweetK9 Fantasy League"
    },
    {
      "level": "H2",
      "text": "The Nature of Online Communities"
    },
    {
      "level": "H2",
      "text": "All Linkbait Is Not Created Equal: What Linkscape Reveals About Popular Content"
    },
    {
      "level": "H2",
      "text": "Branding Strategies for Your Social Media Profiles on the Web"
    },
    {
      "level": "H2",
      "text": "The Dangers And Advantages Of Meme Marketing"
    },
    {
      "level": "H2",
      "text": "Facebook Viral Videos: TapeWorms, Trojans and Obfuscation"
    },
    {
      "level": "H2",
      "text": "Holy Sh*t, I Joined Twitter"
    },
    {
      "level": "H2",
      "text": "Social Media is People"
    },
    {
      "level": "H2",
      "text": "Question for the Moz Community - SEOmoz's Twitter Account"
    }
  ],
  "author": "Dan Tynski\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Sarah Carling\n          \n            Jane Copland\n          \n            Tom Critchlow\n          \n            Jane Copland\n          \n            Rand Fishkin\n          \n            Jane Copland\n          \n            Gabriel Goldenberg\n          \n            Rebecca Kelley\n          \n            Patrick Sexton\n          \n            Danny Dover"
}