{
  "url": "https://moz.com/blog/category/social-media/p2",
  "slug": "p2",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin January 19, 2018 Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms? Social Media | Whiteboard Friday | Content Marketing Increasingly, social networks are tweaking their algorithms to favor content that remains on their site, rather than send users to an outside source. This spells trouble for those trying to drive traffic and visitors to external pages, but what's an SEO or content marketer to do? This edition of Whiteboard Friday goes into detail on the pros and cons of each approach, then gives Rand's recommendations on how to balance your efforts going forward. Read this post By: Rand Fishkin January 11, 2018 9 Predictions for SEO in 2018 Marketing Industry | Advanced SEO | Social Media For the past ten years, Rand has made a set of predictions for SEO in the year ahead, and for all ten years he's been largely correct. Check out what he got right in 2017, and pay close attention to his predictions for 2018 — they're doozies! Read this post By: Michelle LeBlanc August 30, 2017 Building a Community of Advocates Through Smart Content Content Marketing | Social Media | Community Management Having strong brand advocates can help insulate your brand from crisis, lead to referring links and positive media coverage, and help you create content for your brand. Learn how to develop advocates for your brand in this post. Read this post By: Jen Carney August 2, 2017 Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger Reach Content Marketing | SEO Basics | Social Media You've spend too much time and effort on content creation to share it only once. Check out 4 smart strategies you can implement today to improve the reach of your existing content. Read this post By: Tara Reed December 16, 2016 Twitter Deep Dive: How to Use Social Media to 10x Your Website Traffic Social Media Nearly all of us tweet links to our content, but we're often lacking the knowledge of how to make that work most effectively. In today's Whiteboard Friday, Tara Reed of appswithoutcode.com walks us through the three primary parts of her strategy. Read this post By: Eric Enge December 14, 2016 Reach and Influence: Your First Marketing Priority Content Marketing | Social Media The concept of the search box is likely to disappear in the next 5 years. Build a change-proof content strategy via a renewed focus on your reach and influence. Read this post By: Alexandra Tachalova November 15, 2016 The Battle for Traffic: Organic SEO vs. Social Media Marketing Advanced SEO | Social Media It's that age-old question: does social media marketing have an effect on organic SEO? In her analysis of five popular blogs in each niche, Alexandra Tachalova comes to a conclusion. Read on to learn more. Read this post By: Ryan Stewart October 14, 2016 How to Build a Facebook Funnel That Converts Social Media | Whiteboard Friday | Paid Search Marketing (PPC) Are you getting the most out of your Facebook ads? In this guest-hosted Whiteboard Friday, Ryan Stewart outlines his process for using remarketing and targeted content creation to boost conversions. Read this post By: Larry Kim September 5, 2016 What's the Real Relationship Between Organic Rankings & Social Shares? (Hint: They're Related, But Not the Way You Think) Advanced SEO | Social Media Why do top-performing posts often also have a high number of shares? What exactly is causing these observable correlations? Larry Kim shares the results of his study and delves into answering these burning questions. Read this post By: Andrew Choco August 30, 2016 Combining Email and Facebook for a Dynamite Ecommerce Marketing Campaign Social Media | Email Marketing Most people view email marketing and social advertising as two separate entities, and I’ll be honest, I used to think that as well. However, I’ve discovered that combining multiple different avenues for a coherent marketing campaign yields some pretty impressive results. Read this post By: Celine Mirzaian April 12, 2016 How to Bring Life to Your Brand with Facebook Canvas Social Media | Online Advertising Facebook's new Canvas ad platform is worth a look for brands looking to up engagement on the social network. Read this post By: Daniel Marks April 11, 2016 The Buzzfeed Approach to Social Media Strategy Social Media BuzzFeed does social media a little differently from the rest, and with great success. What can you learn from their strategy that's directly applicable to your own? Read this post By: David Pierce April 1, 2016 Introducing UpDog: Untangling the World of Social Media Barketing Social Media Moz is proud to reveal UpDog, our brand-barkin'-new company-wide initiative to bring canine innovation to the new world of social media barketing! What's UpDog, you ask? Read on for the exciting news! Read this post By: Nichole Elizabeth DeMeré March 29, 2016 Truly Awesome Tactics to Gain Traffic from Twitter Social Media Here’s a crazy statistic. On average, Twitter sees 500 million tweets per day. Out of all of the interactions people have with these tweets, 92 percent of them involve clicking links. For some of us, getting in on that action feels as easy as chatting with a barista at the local coffee shop. For others, getting website traffic from Twitter may as well be alchemy. I promise, it’s possible to... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms?"
    },
    {
      "level": "H2",
      "text": "9 Predictions for SEO in 2018"
    },
    {
      "level": "H2",
      "text": "Building a Community of Advocates Through Smart Content"
    },
    {
      "level": "H2",
      "text": "Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger Reach"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Twitter Deep Dive: How to Use Social Media to 10x Your Website Traffic"
    },
    {
      "level": "H2",
      "text": "Reach and Influence: Your First Marketing Priority"
    },
    {
      "level": "H2",
      "text": "The Battle for Traffic: Organic SEO vs. Social Media Marketing"
    },
    {
      "level": "H2",
      "text": "How to Build a Facebook Funnel That Converts"
    },
    {
      "level": "H2",
      "text": "What's the Real Relationship Between Organic Rankings & Social Shares? (Hint: They're Related, But Not the Way You Think)"
    },
    {
      "level": "H2",
      "text": "Combining Email and Facebook for a Dynamite Ecommerce Marketing Campaign"
    },
    {
      "level": "H2",
      "text": "How to Bring Life to Your Brand with Facebook Canvas"
    },
    {
      "level": "H2",
      "text": "The Buzzfeed Approach to Social Media Strategy"
    },
    {
      "level": "H2",
      "text": "Introducing UpDog: Untangling the World of Social Media Barketing"
    },
    {
      "level": "H2",
      "text": "Truly Awesome Tactics to Gain Traffic from Twitter"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Michelle LeBlanc\n          \n            Jen Carney\n          \n            Tara Reed\n          \n            Eric Enge\n          \n            Alexandra Tachalova\n          \n            Ryan Stewart\n          \n            Larry Kim\n          \n            Andrew Choco\n          \n            Celine Mirzaian\n          \n            Daniel Marks\n          \n            David Pierce\n          \n            Nichole Elizabeth DeMeré"
}