{
  "url": "https://moz.com/blog/category/social-media/p20",
  "slug": "p20",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "R By: Ryan O'Donnell April 23, 2008 Tools or Fools? Social Media BACKGROUNDRecently I've been bombarded with a slew of SEO tools and thought it would be best to share those here and see what experiences others have had. This list, of course, is not a complete list of such tools / services, but these are the ones I have seen most recently. Morever, I have not used all these tools / services so anyone who has, feel free to share you... Read this post By: Danny Dover April 16, 2008 I Submitted to Digg But All I Got Was This Lousy T-Shirt Social Media If you are involved with internet marketing for more than five minutes you will inevitably hear someone preach about the power of Digg. It is funny how hard people work for their 15 minutes of fame. Yes, if you make it on the homepage your website will receive hundreds of thousands of views in a single day. Yes the links it provides will help your search rankings. And yes the ... Read this post O By: Oatmeal April 14, 2008 Widgetbait Gone Wild Social Media Here's the deal: I build links. I build a lot of them - tens of thousands every month. How do I do this? I create fun online quizzes and then provide HTML code with quiz scores that bloggers and website owners can embed on their own sites. A good example is this widget, which tells you if you talk too much in your blog, or ... Read this post By: Danny Dover April 14, 2008 I Broke the Law and the Law (made me number) One Social Media I really like YouTube. It is brilliantly easy to use, almost universally accessible and unparalleled in its ability to popularize creative and funny people. YouTube is single handedly responsible for causing an irreversible drop in world productivity while simultaneously bringing countless amounts of joy to average people. It... Read this post By: Rebecca Kelley April 9, 2008 How a Good Title and Description Can Make or Break Your Social Media Submission Social Media For today's Social Wednesday, I thought I'd share an interesting case study. My boyfriend works for Payscale, a salary and compensation information website (hey, he's my boyfriend, so I gotta throw them a good link). One day while I was at work, Jason (aka Manstery Guest) IM'd me and told me about this neat... Read this post J By: Jaamit Durrani April 1, 2008 How Social Media Optimisation Leads to Engagement With Your Audience Social Media DISCLAIMER: This post is NOT written for SEO professionals, so Mozzers will probably find nothing new here. Rather it is an exercise in explaining some basic concepts of Social Media Optimisation to Joe Public. There's a lot of simplification there, but I strongly believe that SEO and Search Engine algorithms should be something you can explain very simply to clients, ... Read this post By: Danny Dover March 28, 2008 Viral Marketing is Stupid Social Media Yesterday, I was arguing with my friend about the existence of one sight or sound that is universally funny. He argued that since different cultures find humor in different things, there couldn't possibly be one example of something that is funny to everyone. Unconvinced, I started searching for the holy grail of funny. Immediately, I went on YouTube and starting browsing my favorite videos. Event... Read this post By: Jane Copland March 26, 2008 The Power Of Online Campaigns, And The Sad Downfall of Jericho Social Media I don't watch much television. It's silly really. I bought a big flat screen HDTV DVR OMG WTF television before I could really afford such things and I only regularly watch two shows. Tonight, one of my two shows will go off air for the last time, leaving me with only American Idol, which I encourage you all to link to from now on as American Idle (and al... Read this post K By: Kamanashish Roy March 19, 2008 Bees Attract Bees - Social Networking Over the Net Social Media An Idea can change the world.But internet is a funny place – so many great ideas and start ups failed for so many unknown reasons. So... Read this post By: Jane Copland March 19, 2008 StumbleUpon - Demographics and Returning Traffic Spikes Social Media Like most SEOs I know, I have a couple of sites that act as my side projects. They aren't monetised and I plan to keep them that way: I like to keep an eye on it for the purpose of experiments. By this I mean that I like to mess around with them and if one of them drops completely from every search engine, loses all of its PageRank and its server catches fire, it doesn't matter all that much.... Read this post By: Hamlet Batista March 17, 2008 Don't Be Too Clever When Marketing (especially in Miami International Airport) Social Media Feb 17 2:00PM – In preparation for our product launch at SMX West, I came up with the idea of writing famous Google bombs on a T-shirt as a promotional giveaway. The idea was simple and funny—and, admittedly, only makes sen... Read this post By: Jane Copland March 12, 2008 Twitter Begrudgingly Revisted Social Media Caught during a moment of extreme moral ineptitude on Saturday, I did the unthinkable. I signed up to Twitter. I felt like a fourteen seventeen year old who's been thinking about sneaking into the parents' booze cabinet with her friends and finally makes the decision to pick the lock. I felt bad immediately, especially given ... Read this post By: Danny Dover March 8, 2008 YouTube's New #1 Video: The Unprecedented Rise and the Mobocracy that Led to its Fall Social Media On March 04, 2008, the internet community saw the culmination of the world's most successful video marketing campaign. With 80 million views in 2 months, Clarus Bartel's homemade music video dethroned the Evolution of Dance as the most viewed video of al... Read this post H By: Helene Hall March 4, 2008 Is Facebook Monetising the Wrong Opportunities? Social Media I visited the Technology for Marketing and Advertising 2008 in London earlier this month and attended an interesting seminar with Blake Chandlee, the Commercial Director of Facebook in the UK.He started by regaling us with some pretty impressive user stats, and then took us through the advertising options on Facebook. He started out with Facebook Ads. Now, when I first starte... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Tools or Fools?"
    },
    {
      "level": "H2",
      "text": "I Submitted to Digg But All I Got Was This Lousy T-Shirt"
    },
    {
      "level": "H2",
      "text": "Widgetbait Gone Wild"
    },
    {
      "level": "H2",
      "text": "I Broke the Law and the Law (made me number) One"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How a Good Title and Description Can Make or Break Your Social Media Submission"
    },
    {
      "level": "H2",
      "text": "How Social Media Optimisation Leads to Engagement With Your Audience"
    },
    {
      "level": "H2",
      "text": "Viral Marketing is Stupid"
    },
    {
      "level": "H2",
      "text": "The Power Of Online Campaigns, And The Sad Downfall of Jericho"
    },
    {
      "level": "H2",
      "text": "Bees Attract Bees - Social Networking Over the Net"
    },
    {
      "level": "H2",
      "text": "StumbleUpon - Demographics and Returning Traffic Spikes"
    },
    {
      "level": "H2",
      "text": "Don't Be Too Clever When Marketing (especially in Miami International Airport)"
    },
    {
      "level": "H2",
      "text": "Twitter Begrudgingly Revisted"
    },
    {
      "level": "H2",
      "text": "YouTube's New #1 Video: The Unprecedented Rise and the Mobocracy that Led to its Fall"
    },
    {
      "level": "H2",
      "text": "Is Facebook Monetising the Wrong Opportunities?"
    }
  ],
  "author": "Ryan O'Donnell\n          \n            Danny Dover\n          \n            Oatmeal\n          \n            Danny Dover\n          \n            Rebecca Kelley\n          \n            Jaamit Durrani\n          \n            Danny Dover\n          \n            Jane Copland\n          \n            Kamanashish Roy\n          \n            Jane Copland\n          \n            Hamlet Batista\n          \n            Jane Copland\n          \n            Danny Dover\n          \n            Helene Hall"
}