{
  "url": "https://moz.com/blog/category/social-media/p22",
  "slug": "p22",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin January 7, 2008 Separating the Linkbait Wheat from the Chaff Social Media Last week in Whiteboard Friday: Why Your Viral Content Isn't Working, I covered the importance of creating content that goes beyond just reaching the top of social media portals into the realm of attracting coveted high value links as well. Today, as promised, I'll share the big separations between th... Read this post By: Rebecca Kelley December 28, 2007 Things I Hate About MySpace Social Media I hate MySpace, but then again, so does most everyone else. It's not news or anything, but it's just after Christmas and posting is light lately, so I thought I'd get this out of the way before the new year hits and Rand's bugging me to put up actual, relevant posts. Anyway, I created an account a few years ago, and within the last year I've been letting my account awkwardly hang o... Read this post By: Jane Copland December 25, 2007 Offline Marketing for Mobile Purposes Social Media I want to get a new telephone. There is really nothing wrong with the one I have right now: it's been dropped a couple of (ten) times and I once dropped it into Lake Union. It dried. It calls other phones, receives calls and text messages, and it fits nicely in pockets and purses. But it doesn't do Internet, and that's not acceptable. Too often, I'm away from my computer and I want to look somethi... Read this post By: Rishi Lakhani December 19, 2007 Phishing on Facebook? Social Media As you all know, FB is a very viral network, and with two of the most viral applications easily available (superwall and funwall), it was about time people got up to mischief. I have been geting a whole lot of chain posts lately, but the one below takes the cake: Attention all Facebook membeRs.Facebook is recently becoming very overpopulated,There have been many members complaining that F... Read this post J By: justFred December 14, 2007 Search V26.0 - An Intelligent Search Engine Social Media Who's asking? I am no search engine expert. I am not even a blogger! I love to read the Moz Blog, and I especially love Whiteboard Friday. While I have heard it elsewhere as well, one analogy I received from WBF was the concept of a \"Blind Surfer\". Makes sense, and thus far it has made a killer engine. So the algorithm is based on the theory of a blind surfer, a surf... Read this post By: Jane Copland December 12, 2007 The Things We Didn't Have Back in My Day Social Media Those of you long-time readers who were here about a month ago may remember Rebecca's highly popular post, Please Stop Spamming Me for Votes. In the post, Rebecca recounts a tale of an SEO asking her to vote on a story at a social media site. When she refused, the SEO replied with, \"Tuesdays and Thursdays are social da... Read this post By: Gabriel Goldenberg December 11, 2007 20 Top Sphinners You Should Know Social Media Google's guidelines on one topic per page aside, I've got so much running through my tiny brain I need to get it all out or I'm gonna go nuts. This post is on several topics: Top Sphinners, A landing page contest I'd like to run here at Youmoz, An invitation to linkbait me (for what that's worth, lol), and participate in some linkbait research... Read this post By: Rand Fishkin December 10, 2007 A Visual Tour Through the Basics of Social Media Marketing Social Media I've been asked several times to give presentations on the basics of social media marketing, and have now refined my 15 minute introductory tour to the point where I think it's fairly good (and I'm really damn picky about my presentations). The following presentation (in visual and text form) should be helpful for anyone trying to convince their bosses, team or cohorts that investing in SMM is ... Read this post C By: Ciaran Norris November 29, 2007 Facebook Social Ads: Shark Jumped? Social Media Following Gab's excellent post about must-read bloggers (which I feature on, making it no surprise I think it's excellent) I thought that it was about time that I added to my list of YouMoz posts. And because I had said in a comment that the reason I hadn't posted recently was that I found it easier to do q... Read this post By: Rishi Lakhani November 20, 2007 Wonderbra - How It Made My Day! Social Media The last two days I have been attending the SMX London - which was in overall a very satisfactory experience - I got to meet quite a few SEOmozers who turned out to be a very approachable lot even offline (online they are great!). Well earlier today I attended the \"Linkbaiting and Viral Search Marketing\" session - the speakers included Jane Cop... Read this post By: Rebecca Kelley October 30, 2007 Please Stop Spamming Me for Votes Social Media Let me walk you through my morning thus far. I came into the office, logged on to Trillian, and started working. I received an IM from an SEO who made some small talk before getting to the point: he wanted me to digg/reddit about four stories. I clicked on the links and (pay attention here) voted for the ones I thought were interesting. I keep working. I notice that I get several email no... Read this post M By: manthy October 29, 2007 Traffic Exchanges Social Media For the past year I have been using Traffic Exchanges to try and get visitors to my website, and I have came to a conclusion,while they will provide hits to your website...Traffic exchanges do not work for getting quality traffic.Most of the traffic exchanges I use are auto surfs...meaning that you click a autosurf now button and you are off and surfing, the idea is for every site you vi... Read this post By: Jane Copland October 29, 2007 Straight to YouTube: Wetpaint Does Viral Video Social Media Seattle-based wiki website Wetpaint have always done things a little differently to most wiki providers. With a highly user-friendly interface, Wetpaint lets even the most technically-uninclined people create websites. The sites, which are of course all wikis, can either be hosted at Wetpaint or on a ... Read this post G By: GeoffreyF67 October 16, 2007 To Sphinn or Not to Sphinn - That is the Question! Social Media A while back I removed all of the social media bookmark links from my blog. At the time, my reasoning was that it was simply cluttering up the page and really added no value. It also looked rather silly to have 15 icons at the bottom of each post so that someone might bookmark it.I'd actually add it back in if:A) I thought there were some value in doing so.B... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Separating the Linkbait Wheat from the Chaff"
    },
    {
      "level": "H2",
      "text": "Things I Hate About MySpace"
    },
    {
      "level": "H2",
      "text": "Offline Marketing for Mobile Purposes"
    },
    {
      "level": "H2",
      "text": "Phishing on Facebook?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Search V26.0 - An Intelligent Search Engine"
    },
    {
      "level": "H2",
      "text": "The Things We Didn't Have Back in My Day"
    },
    {
      "level": "H2",
      "text": "20 Top Sphinners You Should Know"
    },
    {
      "level": "H2",
      "text": "A Visual Tour Through the Basics of Social Media Marketing"
    },
    {
      "level": "H2",
      "text": "Facebook Social Ads: Shark Jumped?"
    },
    {
      "level": "H2",
      "text": "Wonderbra - How It Made My Day!"
    },
    {
      "level": "H2",
      "text": "Please Stop Spamming Me for Votes"
    },
    {
      "level": "H2",
      "text": "Traffic Exchanges"
    },
    {
      "level": "H2",
      "text": "Straight to YouTube: Wetpaint Does Viral Video"
    },
    {
      "level": "H2",
      "text": "To Sphinn or Not to Sphinn - That is the Question!"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Jane Copland\n          \n            Rishi Lakhani\n          \n            justFred\n          \n            Jane Copland\n          \n            Gabriel Goldenberg\n          \n            Rand Fishkin\n          \n            Ciaran Norris\n          \n            Rishi Lakhani\n          \n            Rebecca Kelley\n          \n            manthy\n          \n            Jane Copland\n          \n            GeoffreyF67"
}