{
  "url": "https://moz.com/blog/category/social-media/p3",
  "slug": "p3",
  "title": "Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Angela Cherry March 2, 2016 Tweeting & Politics: Are the Same Candidates Winning at the Polls Winning on Twitter? Social Media This time around, we're serving up some hot insights from the results of the super-exciting Nevada caucus, South Carolina primary, and Super Tuesday. Get ready to draw some conclusions about US presidential candidates' Twitter wins compared with their wins in the race for the 2016 nomination! Read this post By: Sam Anthony March 1, 2016 Here’s How a Brand New Website Built an Email List of More than 1,300 Contacts in Three Days Blogging | Email Marketing | Social Media Today I'm going to share how the website FunThingsToDo.io generated 22,000+ pageviews from one blog post. The unbelievable part is the post has zero backlinks and the domain name is only 3.5 months old... Read this post By: Erica McGillivray February 18, 2016 Success Metrics in a World Without Twitter Share Counts Social Media | SEO Tools Last November, Twitter quietly removed share counts. Here are some ideas of what you can do instead to fill that data void. Read this post By: Ann Boyles February 10, 2016 What Can Twitter Teach You about the Top 6 US Presidential Candidates? Social Media What juicy details can Twitter reveal about the top 2016 US presidential candidates? Follow along with our \"wonky\" journey as we use in-depth Followerwonk analysis to uncover insights about this wild election year. Read this post By: Matt Round February 1, 2016 What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings Marketing Psychology | Content Marketing | Social Media Online word-of-mouth can drive exponential traffic growth, attract broad media coverage, and result in tons of backlinks and social shares. Matt Round describes the 11 key traits you should include when devising interactive content that taps into the impulse to share things on Facebook and Twitter. Read this post By: Garrett Mehrguth January 26, 2016 Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips Local SEO | Social Media For years, local businesses have relied solely on direct mail, stickers, flyers, referrals, and word of mouth. These were the life-blood of their business. Now, in the digital age, we can replace these tactics with a more affordable digital channel that has the power to bolster all of our other marketing channels.I would like to introduce and take an advanced dive into... Read this post By: Larry Kim January 24, 2016 3 Unusual Hacks to Dramatically Up Your LinkedIn Game Content Marketing | Branding | Social Media It's time to start paying more attention to what LinkedIn can do to broaden your reach. In this article, Larry Kim shows you how to drive engagement and qualified traffic to grow your business and brand using LinkedIn updates and Pulse. Read this post By: Kelsey Libert January 19, 2016 Leverage This Social Network Mind Trick for More Effective Influencer Marketing Social Media When it seems like everyone you know is talking about the same thing, don't be fooled — it may just be a trick of influence. Learn how to harness the power of the \"majority illusion\" for yourself to strategically boost your audience reach. Read this post By: Erica McGillivray January 13, 2016 How to Build an Empathetic Social Media Strategy for Times of Tragedy Social Media | Community Management In crisis and tragedy, we turn to social media, so here's how to make sure your brand responds appropriately and you stay sane. Read this post By: Tim Allen January 11, 2016 How to Create Audience Personas on a Budget Using Facebook Insights Social Media We know Facebook has a huge amount of data on people. For the last 18 months, they've been sharing more of this information than ever before through their platform, Audience Insights. As a result, we can begin to pull together audience personas for very little cost other than time, effort, and a Facebook account. Read this post By: Ryan Stewart December 29, 2015 How [and Why] to Build a Booming Facebook Group Social Media | Community Management Facebook is still a bustling, active hub of the Internet. One way to tap into all that potential traffic? Building a vibrant, quality Facebook Group. Ryan Stewart gives us the hows and whys of creating and maintaining a great Group in the era of one billion active Facebook users in a single day. Read this post By: Larry Kim December 2, 2015 The Ridiculously Smart Guide to Buying Legit Twitter Followers Social Media | Online Advertising | Paid Search Marketing (PPC) Don't give in to the temptation of paying for bogus followers. For the same amount and with a little ingenuity, you could buy real Twitter fans with Followers Campaigns — and get a few other bonuses out of the deal, too! Read this post By: Simon Penson November 18, 2015 The Content Marketing Campaign Playbook – Guaranteeing Success in 2016 Content Marketing | Public Relations | Social Media Planning your content marketing campaigns for 2016? This indispensable guide will help you ensure each one is a hit all the way through. Plus, a free downloadable campaign planner! Read this post By: Kane Jamison November 3, 2015 10 Things I've Learned While Learning Facebook Ads Social Media | Online Advertising | Paid Search Marketing (PPC) Kane Jamison is convinced Facebook Ads are one of the most powerful tools that we currently have as digital marketers, and he's going to share the 10 biggest hurdles that have caught him off guard since he started using Facebook Ads — all in the name of helping you avoid some of the same mistakes. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Social Media"
    },
    {
      "level": "H2",
      "text": "Tweeting & Politics: Are the Same Candidates Winning at the Polls Winning on Twitter?"
    },
    {
      "level": "H2",
      "text": "Here’s How a Brand New Website Built an Email List of More than 1,300 Contacts in Three Days"
    },
    {
      "level": "H2",
      "text": "Success Metrics in a World Without Twitter Share Counts"
    },
    {
      "level": "H2",
      "text": "What Can Twitter Teach You about the Top 6 US Presidential Candidates?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings"
    },
    {
      "level": "H2",
      "text": "Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips"
    },
    {
      "level": "H2",
      "text": "3 Unusual Hacks to Dramatically Up Your LinkedIn Game"
    },
    {
      "level": "H2",
      "text": "Leverage This Social Network Mind Trick for More Effective Influencer Marketing"
    },
    {
      "level": "H2",
      "text": "How to Build an Empathetic Social Media Strategy for Times of Tragedy"
    },
    {
      "level": "H2",
      "text": "How to Create Audience Personas on a Budget Using Facebook Insights"
    },
    {
      "level": "H2",
      "text": "How [and Why] to Build a Booming Facebook Group"
    },
    {
      "level": "H2",
      "text": "The Ridiculously Smart Guide to Buying Legit Twitter Followers"
    },
    {
      "level": "H2",
      "text": "The Content Marketing Campaign Playbook – Guaranteeing Success in 2016"
    },
    {
      "level": "H2",
      "text": "10 Things I've Learned While Learning Facebook Ads"
    }
  ],
  "author": "Angela Cherry\n          \n            Sam Anthony\n          \n            Erica McGillivray\n          \n            Ann Boyles\n          \n            Matt Round\n          \n            Garrett Mehrguth\n          \n            Larry Kim\n          \n            Kelsey Libert\n          \n            Erica McGillivray\n          \n            Tim Allen\n          \n            Ryan Stewart\n          \n            Larry Kim\n          \n            Simon Penson\n          \n            Kane Jamison"
}