{
  "url": "https://www.semrush.com/blog/user/145667169/",
  "slug": "145667169",
  "title": "Martin Kura – Semrush profileAuthor Photo",
  "description": "Semrush's digital marketing blog is an innovative resource for content strategy, content marketing, SEO, SEM, PPC, social media and more.",
  "content": "International Web Hosting Issues: Does Server Location Really Matter?Back in 2009, the younger version of Matt Cutts explained: Now, in 2015, Google‘s John Mueller has come out with a slightly different statement: For search, specifically for geotargeting, the server‘s location plays a very small role, in many cases it‘s irrelevant. If you use a ccTLD or a gTLD together with Webmaster Tools, then we‘ll mainly use the geotargeting from there, regardless of where your server is located.General SEOJan 19, 20175 Common Myths About Choosing Domain Names for International SEOIs a .COM domain really the best choice for international targeting? Can a local TLD rank as well abroad as at home? Can a domain rank well internationally even when we don’t use ccTLDs? Read on to find out about the most frequent misconceptions concerning domain names and international SEO.General SEOAug 12, 2015The Ultimate Hreflang Guide for DummiesWith Google coming out with its new international targeting feature, I’ve seen more poorly implemented Hreflang annotations than good ones. These 5 easy steps will help you avoid mishaps and implement Hreflang tags correctly across your multilingual website.Technical SEOJan 21, 2015",
  "headers": [
    {
      "level": "H1",
      "text": "Martin Kura"
    },
    {
      "level": "H2",
      "text": "Author"
    },
    {
      "level": "H3",
      "text": "International Web Hosting Issues: Does Server Location Really Matter?"
    },
    {
      "level": "H3",
      "text": "5 Common Myths About Choosing Domain Names for International SEO"
    },
    {
      "level": "H3",
      "text": "The Ultimate Hreflang Guide for Dummies"
    }
  ],
  "author": ""
}