{
  "url": "https://www.semrush.com/blog/user/194325521/",
  "slug": "194325521",
  "title": "Jakub Zielinski – Semrush profileAuthor Photo",
  "description": "Semrush's digital marketing blog is an innovative resource for content strategy, content marketing, SEO, SEM, PPC, social media and more.",
  "content": "The Content Marketing Landscape in 2022: Small & Midsize BusinessesSemrush Marketplace surveyed 217 small and midsize businesses (SMBs) in the US, across a range of different industries. Our mission: To understand how they create content, who they work with, what their goals are—and what content types get them the best bang for their buck. Explore our findings and insights to get a better understanding of content marketing and how SMBs across the US are using it to grow.Original Research & StudiesApr 13, 2022Passive Voice: SEO Sin or Acceptable Writing Style?Is there a connection between using passive and active voice and SEO? When is it OK to use the passive voice, and when it‘s better to convert it to the active voice? Let‘s dive into our article and discover what marketers and SEO experts say about using passive voice and its impact on search engine results. You will also learn how to write SEO-friendly content.ContentMar 04, 2022How Experts Measure Writing Quality & Content PerformanceContent marketing requires investments. Outsourcing content itself means spending up to even more than $30K every month. And there are also other aspects that are crucial to spreading the word about content and are not costless: SEO, PPC, social media, etc. So, how can you know your content was worth investing in? By measuring its performance.Original Research & StudiesJan 20, 2022",
  "headers": [
    {
      "level": "H1",
      "text": "Jakub Zielinski"
    },
    {
      "level": "H2",
      "text": "Author"
    },
    {
      "level": "H3",
      "text": "The Content Marketing Landscape in 2022: Small & Midsize Businesses"
    },
    {
      "level": "H3",
      "text": "Passive Voice: SEO Sin or Acceptable Writing Style?"
    },
    {
      "level": "H3",
      "text": "How Experts Measure Writing Quality & Content Performance"
    }
  ],
  "author": ""
}