{
  "url": "https://www.similarweb.com/blog/marketing/sem-ppc/holiday-ppc/",
  "slug": "holiday-ppc",
  "title": "Fightclub.com Doubles Its Holiday PPC Traffic | Similarweb",
  "description": "See what works. Get the inside scoop about how one leading retailer doubled its paid holiday traffic and learn how to replicate its success.",
  "content": "HomeBlogMarketingSEM & PPCHow One Leading Retailer Doubled Its Paid Holiday Traffic And How You Can Too Marketing Intelligence How One Leading Retailer Doubled Its Paid Holiday Traffic And How You Can Too Download the report by Sarah Mehlman , Sr. Marketing Intelligence Specialist 5 Min. November 2, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Everyone knows the first rule of flight club is that you don’t talk about flight club. But I’m a rule breaker, so here goes nothing. Last year sneaker superstore flightclub.com took its gloves off and dominated paid campaigns with strategic optimizations mid-way through the holiday season, and Similarweb has the receipts to prove it. Let’s dive into the data to see what it actually did to knock out the competition, and what you can do to claim the same glory. Review your paid search performance: warming up Between November and December 2020, flightclub.com paid traffic more than doubled. By expanding our timeframe to see paid channels performance over an 18-month period (Apr. 2020 – Sep. 2021), we see that the brand peaked in PPC traffic and engagement in December 2020 and May 2021. A closer look at the data reveals that both highs were evidence of specific campaigns rather than a continuous uptick. This is evidence that the traffic highs were due to strategic changes in the company’s paid search strategy rather than due to industry trends. Pro tip: By reviewing your paid search performance, you give yourself the opportunity to see what is working so you can make informed optimizations that really pack a punch. If you are confident that your messaging, product, and ads are resonating with your audience, then you can easily double down on your success and win more leads. Focus on strong keywords: float like a butterfly The secret to a power-packed campaign? Keeping a close eye on your keywords. Similarweb data shows that Flightclub’s top keywords “jordan 1 mocha,” “jordan 1,” and “jordan 12” grew about 700%, 119%, and 330% respectively month over month from October – November 2020. This indicates that the company was relying heavily on its buzzy Jordan collection to win traffic during Black Friday. Even with such strong growth, the brand didn’t stop there. By keeping its eyes on the keywords that drove the most traffic and doubling down on them at the most opportune time (the December holidays), Flightclub was able to outdo the competition and take home a traffic win. As such, keywords “air jordan,” “jordan 1,” and “jordans” continued to gain traction, growing approximately 210%, 87%, and 123% month over month that year. Lift up landing pages: sting like a bee As though going in swinging with a smashing strategy wasn’t enough, flightclub.com also leaned into its strengths with paid landing pages laden with the same, hard-hitting keywords. Its landing page “flightclub.com/air-jordans”, for example, was its third-biggest winner in November 2020 with a spend of $5,200 and about a 15% month-over-month traffic growth. With the success of such keywords already behind it, the site upped its spend on that landing page in December to $10,100, increasing the page’s traffic once again by about 9% month over month. Optimize your strategy: the hands can’t hit what the eyes can’t see It’s great to know your own paid campaign strategy, but unless you can see your competitor’s strategy, you’ll never know when to zig and when to zag. Use Similarweb to stay on your toes, see your competitors’ paid campaign strategy, and get the scoop on how to optimize your campaigns in real-time. Step 1: Scope out your competition Find the industry paid search leaders in Website Industry Analysis and analyze the quality of their paid traffic by using Search Leaders. Then take it a step further by diving into the domains by Traffic Share to determine the split of paid search traffic between category players. Step 2: Find actionable insights Benchmark against your toughest competitors via Paid Search Overview to optimize your paid search strategy. Pro Tip: Pinpoint where your competitor’s campaigns have a high investment and understand how campaigns perform with our PPC Spend metric. Step 3: Crown your keyword champions Identify your hardest-hitting keywords by seeing which paid keywords have the highest volume and are highly ranked. Look at search volumes, rankings, and visits, to understand the potential of each keyword and how much traffic it generates in your industry. Pro Tip: Look at non-branded keywords to gain a deeper understanding of the most searched products or services. Step 4: Use your keywords to uncover your opponents Analyze which websites receive the most traffic from the keywords on your keywords list. Remember, visibility is key to KO’ing your competitors online. Step 5: Identify more high-potential long-tail keywords Identify new long-tail keywords that drive traffic to other sites and add to your campaigns. Use our search bar to focus your analysis on one search term, and compare your traffic share for relevant keywords. Toggle between % and # to see how many website visits the term won. Pro Tip: Filter by Organic Traffic to find high-potential keywords that might be worth investing more budget into for your paid campaigns. Step 6: Assess your competitors’ paid ads and landing pages Learn your competitors’ marketing strategies by studying the campaigns they are running for each keyword. This might give you ideas for your next campaign and also help you predict their next move. Dominate holiday paid search with winning campaigns Paid search is dynamic. You need to be constantly tapped into current trends and competitor strategies to best plan your next move. Flightclub.com is a prime example of how understanding your opponents and opportunities allows you to beef up your campaigns like a champ for the holiday season. Time to get you into fighting form. Demo Similarweb today to clinch the competition. Get more digital marketing holiday optimization tips with our Display and Affiliate holiday insights articles. How To Create a Winning PPC Strategy Report Learn how you can drive more PPC traffic Download now by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How One Leading Retailer Doubled Its Paid Holiday Traffic And How You Can Too"
    },
    {
      "level": "H2",
      "text": "Review your paid search performance: warming up"
    },
    {
      "level": "H2",
      "text": "Focus on strong keywords: float like a butterfly"
    },
    {
      "level": "H2",
      "text": "Lift up landing pages: sting like a bee"
    },
    {
      "level": "H2",
      "text": "Optimize your strategy: the hands can’t hit what the eyes can’t see"
    },
    {
      "level": "H3",
      "text": "Step 1: Scope out your competition"
    },
    {
      "level": "H3",
      "text": "Step 2: Find actionable insights"
    },
    {
      "level": "H3",
      "text": "Step 3: Crown your keyword champions"
    },
    {
      "level": "H3",
      "text": "Step 4: Use your keywords to uncover your opponents"
    },
    {
      "level": "H3",
      "text": "Step 5: Identify more high-potential long-tail keywords"
    },
    {
      "level": "H3",
      "text": "Step 6: Assess your competitors’ paid ads and landing pages"
    },
    {
      "level": "H2",
      "text": "Dominate holiday paid search with winning campaigns"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}