{
  "url": "https://www.similarweb.com/blog/marketing/sem-ppc/ppc-metrics/",
  "slug": "ppc-metrics",
  "title": "Top 14 Most Important PPC Metrics To Track | Similarweb",
  "description": "14 PPC metrics you should know and track to increase your ROI. Get the best tips to strategize your next successful campaign. Click to learn more",
  "content": "HomeBlogMarketingSEM & PPCWhat are PPC Metrics? A Guide to Measuring Success Marketing Intelligence What are PPC Metrics? A Guide to Measuring Success Start your free trial by Monique Ellis , Content Marketing Manager 11 Min. June 15, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Strap in, we’re about to take a ride through the world of pay-per-click (PPC) metrics. But first, let’s make sure we’re all on the same page by answering the question: what is PPC? PPC is a type of online advertising where businesses bid on popular keywords or targeting options to make their ads visible on search engines, social media platforms and websites. It has the power to get the right message to the right person at the right time. AKA the queen of quick wins, SEO’s partner-in-crime, and magic bullet right to the heart of your audience. Here, we’ll dig into the most important PPC metrics, why they’re a big deal, and how to measure each one. We’ll also show you how to view the PPC metrics of your competitors, so you can spend smarter using Similarweb Digital Marketing Intelligence. What are PPC metrics? PPC metrics are important data points that help you measure how your campaigns are performing. They’ll show you things like: How visible your ads are How many people are clicking on them How many are completing a desired action Whether the ads are actually profitable On an everyday level, you can use this data to continually tweak your ads so they get the limelight they deserve and the outcome you want. On a broader level, tracking PPC campaign metrics of both you and your competition can help turn the tactical into the strategic: smarter spend and increased ROI. Important PPC metrics: Impressions What are impressions? You get an impression every time your ad comes up on a search engine results page (SERP), social media platform, website or network. Why do impressions need to be measured? To measure the visibility and reach of your ad. If you’ve got low impressions, it means the ad is not getting under the noses of your audience. Perhaps you haven’t targeted a wide enough audience or your keywords aren’t quite hitting the mark. (Psst! Here’s a great guide on how to fix this with some stellar PPC keyword research) How to measure impressions: Impressions are measured by tracking the total number of times your ad has been displayed within a specific timeframe. You can see this information on PPC advertising platforms like Google Ads, Facebook Ads or LinkedIn Campaign Manager. Cost per mille (CPM) What is cost per mille (CPM)? Aka cost per thousand impressions, CPM is the King of measuring ad exposure. It shines a light on the cost you incur every 1,000 times your ad is seen. Why does it need to be measured? Measuring CPM is great for understanding the reach and visibility of your ads on a large scale (via impressions) and a useful tool for budget control, comparison and evaluation and fine-tuning your targeting. How to measure CPM: Calculate CPM by dividing the total cost of your campaign by the number of impressions, then multiply by 1,000. Impression share What is impression share? Impression share measures how many impressions your ad is actually getting compared to the estimated amount they are eligible to receive. For example, if your keywords were searched 100 times and your ad was only shown to users 50 out of 100 of those times, then your impression share would be 50%. Why does it need to be measured? Impression share shows how effective your ads are at competing for attention, so tracking impression share highlights where you are missing opportunities to increase your reach to its full potential. How to measure impression share: Impression share is measured by the percentage of impressions your ad gets compared with the total number of impressions you are eligible to receive. Clicks What are clicks in PPC? ‘Clicks’ are when a user interacts with your ad by clicking on the associated link or image (or any relevant part of the ad) Why do clicks need to be measured? By tracking the number of clicks, you can see a certain level of intent and curiosity from your audience. A lack of clicks can indicate that you need to work on ad relevance, messaging or targeting. How to measure clicks You can measure clicks by counting the total number of times users click on your ad using analytical tools. Click-through rate (CTR) What is CTR? CTR shows the percentage of users that clicked on your ad out of the total number of users that saw it (impressions). Why does CTR need to be measured? Measuring CTR gives you a more in-depth look into engagement than simply the number of raw clicks an ad gets. It gives more context and acts as a compass for relevance and effectiveness. Ad visibility is only half the battle. CTR puts into perspective how many times the ad was clicked on compared with how many opportunities you had for clicks (impressions). A lower CTR could mean your ad isn’t quite grabbing your audience’s attention and the messaging or call-to-action isn’t resonating. How to measure CTR CTR is calculated by dividing the number of clicks by the ad’s total impressions and multiplying by 100. Conversions What are conversions? A conversion is what happens when a user both clicks on your ad and completes the desired action. The action is determined by you and could be downloading a guide, signing up to a weekly newsletter or booking a discovery call. Why do conversions need to be measured? Let’s hark back to the compass idea from earlier. Not measuring conversions is like going on a hike without your compass: you may have a general sense of direction but won’t know if you’re actually moving towards your goal or going off track along the way. There’s little benefit in having an ad with lots of views if the desired action isn’t being taken. It’s essentially money down the drain. How to measure conversions: You can see conversion metrics on your PPC platform. They gather this data with a piece of code that’s triggered each time the desired action is completed. It could be attached to a ‘Thank You’ page that comes up when a user signs up for the newsletter or downloads a whitepaper. Conversion rate (CVR) What is a PPC conversion rate? After a user clicks on your ad, that’s when the real magic happens. And if that’s what a conversion is, then the PPC conversion rate is the percentage of actual conversions compared with the total number of attempts (aka clicks). Why does it need to be measured? The reason for measuring CVR is very similar to why you should measure conversions but with a little more depth. It shows you how many opportunities you’re missing and nudges you to keep tweaking until you’re driving as many conversions as possible. The conversion rate also helps you understand the intent and readiness-to-buy of users. So, if one of your campaigns has a higher CVR than others, then the intent of the users from this campaign is likely higher. How to measure conversion rate: Conversion rate is calculated by dividing the number of conversions by the total number of clicks on your ad within a particular time frame. Then multiply it by 100 to get a percentage. Cost/spend What is cost/spend? This is how much it’s costing you to run your PPC campaigns, as each interaction with your ads comes with a small fee. Why does it need to be measured? This is how you know if you’re staying within your budget. How to measure cost/spend: This is pretty easy to see on your analytics dashboard. You can dig as deep as you like, as many have detailed reports where you can see your spend by things like time period or campaign. Cost per click (CPC) What is CPC? The cost-per-click (CPC) is the fee that you pay for a click on the ad. You bid the maximum that you’re willing to pay for each click. Naturally, the higher the bid, the better chance of your ad being shown for the particular keyword. Why does it need to be measured? Once you start upping your CPC, it’s a slippery slope to budget mayhem! That’s why you’ve got to keep a close eye on this metric How to measure CPC To work out your CPC, simply divide the total cost of clicks by the total number of clicks. Side note: On Google, although you bid a certain amount, what you end up paying is actually determined using your Quality Score (we’ll get into that later), with this formula: (Competitor’s Ad Rank / Your Quality Score) + 0.01 = True CPC Cost per view (CPV) What is Cost-per-view (CPV)? CPV applies when you are running a video campaign on platforms like YouTube and Facebook. If the viewer watches your video ad for more than 30 seconds (or the full duration if less than 30 seconds) a view is counted and you will be charged a fee for the interaction. Why does CPV need to be measured? By measuring the cost per view, you have access to data that will help you identify trends, patterns or certain videos that are performing better or worse. It’s also crucial to know how much each view is costing so you can allocate your budget strategically. How to measure CPV You can calculate your CPV by dividing the total cost of the campaign by the number of views. Cost per conversion What is cost per conversion (CPC part II)? Cost-per-conversion measures how much you pay for each conversion on your ad. It works as an overarching metric as several things can be viewed as a conversion depending on the campaign. Under the CPC umbrella, there are a few similar metrics, such as: Cost-per-lead (CPL): CPL tells you how much you’re investing to capture each potential lead, and evaluates the cost of converting those visits into actionable leads for your business. Cost-per-acquisition (CPA): CPA is a bit like a financial detective. It measures the average cost to get a customer or generate the desired action and tells you if you’re paying too much per customer. Why does it need to be measured? These metrics need to be measured to assess the cost-effectiveness of ad campaigns, evaluate the investment required for each conversion or lead, and determine if the cost to acquire customers aligns with business goals. Monitoring these metrics helps optimization, resource allocation, and ensures your desired outcomes are achieved. How to measure CPC: Gather CPC data by dividing the total cost of your campaign by the number of successful conversions (or by lead generated if you’re working out CPL.) Return on ad spend (ROAS) What is ROAS? ROAS measures how effectively your ad campaigns specifically generate revenue compared to the amount invested. Why is measuring ROAS important? Measuring ROAS matters for two reasons. 1) It helps you make data-driven decisions with your ad budget. 2) High ROAS = success, low ROAS = make some adjustments and take another whack at it! How do you measure ROAS? Divide your revenue from ads by the cost of those ads, then multiply by 100. The higher the percentage, the better the return on your ad spend. Ad position What is ad position? Ad Position is where your ad appears on a page in search engine results. It’s determined by a few things, including the quality of your ad and the amount you bid for the keyword. Google Ads doesn’t give a specific ad position, instead has top and absolute top-of-page metrics that help you understand how often your ad appears at – you’ve guessed it – the top of the SERPs above organic results. Why is your ad position important? It’s a bit like a reality check. Your ad position will tell you clearly if your ad is relevant and engaging enough and whether you’re bidding the right amount. You can use your ad position to assess whether you need to make those adjustments to stay competitive. How do you measure your ad position? You’ll find this on your PPC platforms and the metric may differ slightly depending on which advertiser you are using. Quality score What is your quality score? Quality score is a metric used in paid search only (advertising on search engines) to determine how relevant your ad is compared to others, how likely it is to be clicked on, and how good an experience your landing page offers. Is quality score still important? Quality Score still has some relevance today but it’s only really visible, and therefore relevant, for keywords. So, when it comes to other types of PPC ads, good alternative metrics to track are ‘landing page experience’ and ‘ad relevance’. Advertising platforms prefer ads they know the user will love. So, a higher quality score or ad relevance means a better ad position at a lower cost-per-click. Who doesn’t want that? How to measure it: Things like quality score and ad relevance is worked out by advanced search engine algorithms and is based on things like keyword relevance, ad relevance, landing page experience and historical performance. Why is it important to look at competitors’ PPC metrics? PPC metrics matter most when compared to those of your competitors. It’s what contextualizes them, and arms you with the data points you need to drive better results. We hate to brag (or do we?) but this is where Similarweb really shines. We’re proud to say that we’ve got Competitor PPC Analysis nailed, and here’s exactly how you can leverage Digital Marketing Intelligence to shoo competitors away and get your ads on center stage. They’ll get more attention than a Kardashian family scandal. First up, you can choose any competitor(s) to see their top-paid keywords. In the Top Paid Keywords overview, you can immediately see the keywords that your competitor is bidding on, along with useful information on keyword volume and CPC. With this snapshot, you can decide whether it’s worth your investment to bid on similar keywords or focus on keyword opportunities they’ve missed. This overview also gives you a glimpse into how your competitor is performing. You can see by looking at their Traffic Share and Ad position. Traffic share is an even more granular version of impressions. This metric will show you how much traffic a search term drives to a website. You can compare this to the keyword’s search volume and reverse engineer how search volume equates to traffic to better understand the competitive landscape. Next up, you can choose any keyword and see who the competition is and some key data points. As shown above, Similarweb will also show you key metrics for your chosen keyword: see its search volume, traffic split, keyword difficulty, and search intent along with the all-important CPC. Here we have the Traffic Share overview, which shows the split of traffic between websites ranking for this keyword. From here, you can investigate each individual competitor to reveal more insights on their PPC strategy – everything from organic vs. paid and desktop vs. mobile. When it comes to CPC, we’ve already told you how important it is for your own campaigns. So having an overview of your competitors spend is an incredibly powerful tool that will help you bid smarter, avoid costly mistakes, and work more efficiently. The bottom line on PPC metrics Alright, we’ve come to the end of our journey through the nitty-gritty of PPC metrics. Hopefully you’ve unraveled the mysteries of everything from impression share to conversion rates and, most importantly, learned how to glean insights from the many PPC data points available to you. And better yet, understood why it’s crucial to keep a keen eye on your competitors’ PPC strategy. By tracking their metrics you have an opportunity to learn from their successes (and failures!) to refine your own strategies and grab the top spots for your ads. Supercharge your PPC competitive analysis With the most up-to-date data in the world. Try Similarweb free FAQs What are PPC metrics and why are they important? PPC metrics are data points that show how well your search campaigns are performing. They provide insights into the visibility of your ads, audience engagement, conversions, and profitability. Tracking these metrics helps optimize your ads and increase your ROI. Can PPC campaign metrics help in measuring success? PPC metrics play a crucial role in measuring the success of your campaigns. They provide tangible data on key performance indicators such as CTR, conversions, ROI, and more. By setting specific goals and tracking relevant metrics, you can assess the success of your campaigns against those objectives. This allows you to gauge the overall performance and effectiveness of your PPC efforts. What is CTR and why does it matter? CTR, or click-through rate, shows the percentage of users who clicked on your ad compared to the total number of impressions. CTR is important because it measures the engagement and relevance of your ads. A higher CTR indicates that your ads are attracting user attention and driving clicks. Why should conversions be measured? Conversions measure the desired actions taken by users after clicking on your ad, such as purchases or sign-ups. Measuring conversions is crucial because it shows the effectiveness of your campaigns in achieving your goals. It helps you determine if your ads are generating meaningful results or need optimization. by Monique Ellis Content Marketing Manager Monique, with 7 years in data storytelling, enjoys crafting content and exploring new places. She’s also a fan of historical fiction. Related Topics: SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What are PPC Metrics? A Guide to Measuring Success"
    },
    {
      "level": "H2",
      "text": "What are PPC metrics?"
    },
    {
      "level": "H2",
      "text": "Important PPC metrics:"
    },
    {
      "level": "H3",
      "text": "Impressions"
    },
    {
      "level": "H3",
      "text": "Cost per mille (CPM)"
    },
    {
      "level": "H3",
      "text": "Impression share"
    },
    {
      "level": "H3",
      "text": "Clicks"
    },
    {
      "level": "H3",
      "text": "Click-through rate (CTR)"
    },
    {
      "level": "H3",
      "text": "Conversions"
    },
    {
      "level": "H3",
      "text": "Conversion rate (CVR)"
    },
    {
      "level": "H3",
      "text": "Cost/spend"
    },
    {
      "level": "H3",
      "text": "Cost per click (CPC)"
    },
    {
      "level": "H3",
      "text": "Cost per view (CPV)"
    },
    {
      "level": "H3",
      "text": "Cost per conversion"
    },
    {
      "level": "H3",
      "text": "Return on ad spend (ROAS)"
    },
    {
      "level": "H3",
      "text": "Ad position"
    },
    {
      "level": "H3",
      "text": "Quality score"
    },
    {
      "level": "H2",
      "text": "Why is it important to look at competitors’ PPC metrics?"
    },
    {
      "level": "H2",
      "text": "The bottom line on PPC metrics"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Monique Ellis"
}