{
  "url": "https://www.similarweb.com/blog/marketing/sem-ppc/ppc-trends/",
  "slug": "ppc-trends",
  "title": "PPC Trends That Pack a Punch | Similarweb",
  "description": "What are the top PPC trends that shaped and shifted 2021? Find out just that and how you can use them to better your strategy in 2022 and beyond.",
  "content": "HomeBlogMarketingSEM & PPCThe Top PPC Trends of 2021 Marketing Intelligence The Top PPC Trends of 2021 Get the guide by Kaitlyn Boehm , Client Services Analyst, Similarweb 6 Min. November 23, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As I reflect on the conversations I’ve had with paid marketers in different industries, one theme has stayed consistent: we are in a fast-paced and increasingly difficult subsection of marketing, and it will only get harder to improve and maintain the quality of traffic we’ve come to expect from paid traffic. When it comes to change, 2021 was a landmark year. The good news is this year strengthened our ability to navigate through uncertainty and learn as we go to ultimately face continued challenges. With 2022 just around the corner, let’s reflect on the top PPC trends that I identified throughout the year that will continue to prevail going forward. Google announces change after change Just as we’re shaking off 2020, Google embraced the unprecedented times by announcing a series of changes to its Google Ads platform. Starting with the removal of a core strategy from any digital marketer’s toolbox, the modified broad keyword was retired in July of 2021 in exchange for a more robust phrase match search term. Likely the most impactful change that paid marketers, specifically display marketers, will have to battle through is Google’s vision of a cookieless future. Originally planned for 2022, the tech giant announced the end of utilizing third-party cookies on Google Chrome browser, which will fundamentally change display marketing strategies. This change has divided the community, with some marketers considering it a win for consumer privacy in an increasingly digital world while others, myself included, are concerned about the implications this could have on the industry and campaign strategy best practices overall. Just months after this announcement, Google decided to delay the change by two years in order “to move at a responsible pace, allowing sufficient time for public discussion on the right solutions and for publishers and the advertising industry to migrate their services.” Throughout 2021, Google continued to update its policies around ad disapprovals by implementing the “three strike” rule. This system monitors accounts in certain industries, and gives them only three strikes for ad policy disapprovals within a short timeframe. Repeat offenders posed the risk of having their entire Google Ads account shut down for a period of time, which could have huge implications for companies that rely on paid ad traffic. The least surprising change was the recent announcement that expanded text ads (ETAs) would be discontinued starting in June of 2022. This ad format will be replaced with the pre-existing responsive search ads (RSAs) that allow up to fifteen headlines and four descriptions per ad, instead of the traditional three headlines and two descriptions. This comes after months of Google making it increasingly difficult to create net new ETAs through its constant push to have accounts automatically switch to the new RSA format with suggested headlines. Ad spend is back in full swing Even with all the changes Google made to paid search strategy, major retailers and companies are back to investing in paid traffic once again, with certain players spending even more than pre-pandemic budgets. Most notable is amazon.com, which famously cut back its paid spend at the start of the pandemic due to already increased demand on its platform. The online marketplace has since widened the gap against other retailers like walmart.com going into the holiday season, totaling over $184 million in ad spend from January to September. Businesses didn’t just start scaling spend on Google, but within amazon.com as well! When consumers began flooding amazon.com back in 2020, 10.9% of all on-site product views resulted from a paid click. Even before the holiday season, amazon.com’s 2021 numbers outrank last years, resulting in 13.3% paid traffic share. But don’t let these numbers fool you – it’s not just household brands like Apple and Sony leading the paid charge – small business sales have grown tremendously over the past year, with an average increase of 14.29% in sales YoY. This year’s top non-branded keyword is…. My favorite question to ask my friends who aren’t in the marketing field is, “what do you think is the top searched item on Google this year?” I get the typical answers back: iPhones, PS5, toilet paper, hand sanitizer. Their answers make me realize the lasting impact COVID-19 has had on search term perception, especially considering that, in reality, the first COVID-19-related keyword is at #18 in the paid search standings. Back in 2020, we saw Nintendo Switch and PS5 battle it out for the number one paid spot in the rankings on desktop – and it made sense! With COVID-19 restrictions keeping us at home, there was a surge in people trying to fill up their time with video games. This year resulted in a slightly different leaderboard. The Amazon Kindle, the 8th keyword on the rankings in 2020, secured the #1 spot with only two months left in the year. As the holiday season quickly approaches, the fight for the top spots will likely get more competitive, and we could potentially see a shift. One aspect of this leaderboard is consistent though: everything is a tech gadget. The only keyword in the leaderboard that doesn’t meet this theme is “jobs near me” in 19th place. Other search engines earn spots at the table Although Google is the most popular search engine worldwide, we can’t discount how important others are when it comes to having a robust digital marketing strategy. Currently, Bing has around 5.8% market share across all devices in the U.S., which is a slight decline from the previous year. Even with this market share decrease, Microsoft Ad revenue is up over 10% YoY totalling $8.5 billion dollars in 2021. With more businesses beginning to invest in other search engines, competition will only continue to increase – especially as Microsoft makes it incredibly easy to begin advertising through the use of Google Ads Import. Another engine that marketers need to keep an open mind to is DuckDuckGo. Known as the “private” search engine, DuckDuckGo differentiates itself from other engines by stating that it doesn’t collect the personal information that other engines utilize to offer a more catered advertising experience. The statement appealed to the market, with yearly searches increasing by over 56% from 2019 to 2020. Even though DuckDuckGo claims to have only 2.45% market share currently, it’s quickly emerging as a threat to Google at the same rate as Bing. As we shift to a less cookie-centric advertising landscape, DuckDuckGo hints that a more traditional approach to advertising is appealing to a larger audience who don’t want to feel stalked as they navigate through their consumer journey. The demand for paid marketers grows Although not specific to search, the continued demand for digital marketers is worth mentioning. As more and more companies increase their online presence, the need for experienced marketers continually grows – as does the competition for job posting sites to attract them. Still, keep in mind this data only records active searchers in the market and omits internal traffic on platforms like LinkedIn, where talent acquisition managers may be hunting for potential marketers. If you’re currently in the paid marketing community, it’s worth asking around to see how many of your colleagues are constantly fielding offers in their inbox! Use these trends to prepare for 2022 As 2021 comes to a close and we (hopefully) head into a post-pandemic world, one trend will always remain. The paid advertising industry is constantly evolving and we need to be ready to continue persevering through major changes that can affect the bottom line. These are the questions I’m asking myself about paid media planning as we move into the new year: How will we measure success? Are our goals changing as more people go online to complete their purchasing journey? Does our current campaign structure may rely too heavily on third-party cookies? What would happen if we changed this structure overnight? What are my competitors’ paid marketing strategies? Have they been ramping up spending on specific themes or consumer intent? Have I considered diversifying my marketing strategy further to capture a pool of searchers who may use atypical engines? As paid search demand increases, does my team have the capacity to grow our online presence? Create a Winning 2022 PPC Strategy Get an easy to use guide on how to create a killer PPC strategy now Download now by Kaitlyn Boehm Client Services Analyst, Similarweb Kaitlyn, with a background in paid search and a B.S. from UMass Amherst, enjoys video games, cooking, and houseplants. Related Topics: SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Top PPC Trends of 2021"
    },
    {
      "level": "H2",
      "text": "Google announces change after change"
    },
    {
      "level": "H2",
      "text": "Ad spend is back in full swing"
    },
    {
      "level": "H2",
      "text": "This year’s top non-branded keyword is…."
    },
    {
      "level": "H2",
      "text": "Other search engines earn spots at the table"
    },
    {
      "level": "H2",
      "text": "The demand for paid marketers grows"
    },
    {
      "level": "H2",
      "text": "Use these trends to prepare for 2022"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Kaitlyn Boehm"
}