{
  "url": "https://www.similarweb.com/blog/marketing/sem-ppc/ppc-etas/",
  "slug": "ppc-etas",
  "title": "Google’s Expanded Texts Ads Are Going Away | Similarweb",
  "description": "With Google expanded text ads going away and moving to RSAs, change is inevitable. Learn how to use this shift to your advantage and win more traffic.",
  "content": "HomeBlogMarketingSEM & PPCThe End of an Era? Google to Say Goodbye to Expanded Ads Marketing Intelligence The End of an Era? Google to Say Goodbye to Expanded Ads Get a demo by Sarah Mehlman , Sr. Marketing Intelligence Specialist 3 Min. September 29, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Five years after its 2016 launch, Google has announced that it will be ending its expanded text ads (ETAs) for PPC campaigns in June 2022. This news, although disappointing, does not come as a complete shock as the tech giant is clearly keeping tabs on evolving search trends. Google’s official announcement stated that 15% of all daily queries are new, never-before-seen searches. In light of this, the company decided to end expanded ads and push PPCers toward responsive search ads (RSAs). What are the differences between ETAs and RSAs? Even though expanded text ads are going away, let’s clarify what they are. ETAs consist of three headlines that appear in the order you write them. RSAs allow you to write as many headlines as you want and then Google mixes and matches them to find the order that performs best. What does this change mean for your ETAs? You can continue to pause, resume, and remove your extended search ads, but you will not be able to create new ones or edit your current ones. Google suggests preparing for this change by having at least one responsive search ad in every ad group by June 30, 2022. 5 tips from Google to use RSAs effectively Google seems to understand that this is the question on everyone’s mind as marketers and advertisers alike prepare to say goodbye to ETAs, and as such, including these tips in its statement: What does this change mean for PPC? Responsive ads leverage automation to help you show the right ads to the right audience, at the right time. They enable you to participate in more auctions by delivering ads that adapt messaging for relevant queries. Ultimately, this change will allow you to create fewer ads and still drive incremental conversions. Benjamin Bernstein, Similarweb’s Head of PPC, identified there are two key takeaways from Google’s shift. This makes copywriting slightly more complicated as you formulate three headlines that can appear in any order (1st, 2nd, or 3rd position) in your ad. Google’s announcement fits perfectly with all the changes it has made historically. The company’s goal is to gradually give more and more power to its algorithm. Once upon a time, ads were actually paid per click (hence PPC manager) and we had to make a million tiny adjustments for each audience, topic, and demographic. Now, we simply bid on a specific result (target CPA, target ROAS, or maximize conversions). Before June, it’s crucial for all marketers who use PPC to drive traffic to test RSAs to better understand how to use and measure them. We recommend following trends over the next several months closely to see how Google’s decision impacts who is winning PPC traffic. Keep in mind, once ETAs are officially closed to new campaigns, trends will shift very rapidly so you’ll need to check the latest data frequently to stay on top. Trends will shift very rapidly so you’ll need to check the latest data frequently to stay ahead Tweet this Bernstein concludes “The benefit of these changes means we are actually bidding on what we need (i.e. a lead, a sale, etc). On the other hand, it means there are fewer opportunities for clever PPC managers to outsmart the system, so up-to-date data is more critical than ever.” We’ll continue to cover this breaking PPC news, so stay tuned for more details. by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The End of an Era? Google to Say Goodbye to Expanded Ads"
    },
    {
      "level": "H2",
      "text": "What are the differences between ETAs and RSAs?"
    },
    {
      "level": "H2",
      "text": "What does this change mean for your ETAs?"
    },
    {
      "level": "H2",
      "text": "5 tips from Google to use RSAs effectively"
    },
    {
      "level": "H2",
      "text": "What does this change mean for PPC?"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}