{
  "url": "https://www.similarweb.com/blog/insights/jobs-career-news/digital-100-jobs-career/",
  "slug": "digital-100-jobs-career",
  "title": "Digital 100 Jobs & Careers Winner: Merit America | Similarweb",
  "description": "A technology training company topped the Digital 100 ranking of the fastest growing Jobs & Career companies, followed by AI tools to facilitate hiring",
  "content": "HomeBlogInsightsJobs & Career NewsDigital 100 Jobs & Careers Winner: Merit America Insights Digital 100 Jobs & Careers Winner: Merit America Start your free trial by David F. Carr 3 Min. January 25, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic AI recruiting solutions and popular company career portals grew the most The fastest growing Jobs & Careers company in the Similarweb.com Digital 100 is Merit America, which offers training and coaching for tech careers and attracted nearly 230% more traffic in 2022 than the year before. Jobs & Careers is one of 10 key categories that make up the annual Similarweb Digital 100 ranking of the fastest-growing companies on the web. The ranking is based on desktop and mobile web traffic from the United States (see also the reports for the U.K., Germany, France, and Japan, with one for Australia to follow. Key takeaways AI is playing a bigger role. Artificial intelligence technologies are increasingly being employed to organize the job market, accounting for four of the top 10 domains, including the #2 and #3 on our list: eightfold.ai (up 213.5%), paradox.ai (up 195.8%), beamery.com (up 98.8%), and modernhire.com (up 62.9%). Tech and digital business careers remain desirable. While big tech has seen more than its share of layoffs recently, an element of Merit America’s success is the way it connects with learners wanting to break into the field. The careers site of the digital business Airbnb grew its traffic by 61% – and a big driver of that is the company’s “work from anywhere” policy, leveraging technology to enable flexible work arrangements. The announcement of that policy in April drove an immediate 89% traffic surge. Four of the top 10 sites were the careers portals of specific companies: Truist, FlyBreeze, Airbnb, and food services specialist Compass Group. The Fastest-Growing Jobs & Career Companies Get your copy. Following close behind Merit America were multiple AI-powered recruiting solutions promising to help employers do a better job of sorting through applications and hiring the best talent. In addition, the career portals of major employers made the list, in some cases because they had a strong story to tell about why they would be good to work for, like the gain AirBnB enjoyed from announcing a permissive “work from anywhere” policy at a time other employers were calling people back to the office. The Digital 100 Jobs & Careers Top 10 Domain YoY Growth Description 1 meritamerica.org 229.9% Training for careers in tech 2 eightfold.ai 213.5% AI recruiting solution 3 paradox.ai 195.8% AI recruiting solution 4 careers.truist.com 157.4% Career portal of a company 5 schooljobs.com 124.5% Public sector job board 6 jobs.flybreeze.com 109.8% Career portal of a company 7 beamery.com 98.8% AI recruiting solution 8 modernhire.com 62.9% AI recruiting solution 9 careers.airbnb.com 61.3% Career portal AirBnb 10 careers.compassgroupcareers.com 57.9% Career portal for food services jobs Reasons why they won In a sign of strong brand awareness and repeat business, 56.8% of Merit America’s traffic comes directly to the website, and 21.82% comes from organic search – with almost 63% of that search traffic coming from people specifically searching for Merit America’s brand. Marketing channel analysis for meritamerica.org Of our top 10, eightfold.ai was the most successful at driving traffic across the direct, display advertising, referral, and social media channels, and ranked second in email and search traffic. Airbnb was a winner in branded search, with the keywords “airbnb careers” and “airbnb jobs” driving more than 700,000 visits to the careers website. More from the Digital 100 For more details, visit the Similarweb Insights blog for posts on individual categories. A series of infographics are also available for the media and use on social media. Eligibility criteria: The rankings are based on industry categories Similarweb tracks on an ongoing basis, ranked based on year-over-year change in their total traffic for 2022 over 2021. To qualify for the U.S. ranking, a domain had to average at least 100,000 monthly views for 2022 and 50,000 for 2021. Domains that had no measurable traffic at the beginning of 2021 were also eliminated. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Jobs & Career News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms? Jobs & Career News by Similarweb 3 Min. Jun 20, 2023 Insights SoFi Leads Neobanks in Web Traffic, Up 57% in 2023 Jobs & Career News by David F. Carr 5 Min. Jun 8, 2023 Insights UK Goes From “Great Resignation” to Search for a Side Hustle Jobs & Career News by Similarweb 3 Min. Oct 28, 2022 Insights “Quiet Quitting” Searches Highlight Growing Trend Jobs & Career News by Jim Corridore 3 Min. Sep 13, 2022 Insights Approaching Labor Day, Supply of Jobs Exceeds Demand Jobs & Career News by David F. Carr 3 Min. Aug 31, 2022 Insights Biden Loan Forgiveness Drives Millions to Student Aid Site Jobs & Career News by David F. Carr 2 Min. Aug 30, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Digital 100 Jobs & Careers Winner: Merit America"
    },
    {
      "level": "H2",
      "text": "AI recruiting solutions and popular company career portals grew the most"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The Fastest-Growing Jobs & Career Companies"
    },
    {
      "level": "H2",
      "text": "The Digital 100 Jobs & Careers Top 10"
    },
    {
      "level": "H2",
      "text": "Reasons why they won"
    },
    {
      "level": "H2",
      "text": "More from the Digital 100"
    },
    {
      "level": "H3",
      "text": "With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms?"
    },
    {
      "level": "H3",
      "text": "SoFi Leads Neobanks in Web Traffic, Up 57% in 2023"
    },
    {
      "level": "H3",
      "text": "UK Goes From “Great Resignation” to Search for a Side Hustle"
    },
    {
      "level": "H3",
      "text": "“Quiet Quitting” Searches Highlight Growing Trend"
    },
    {
      "level": "H3",
      "text": "Approaching Labor Day, Supply of Jobs Exceeds Demand"
    },
    {
      "level": "H3",
      "text": "Biden Loan Forgiveness Drives Millions to Student Aid Site"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}