{
  "url": "https://www.similarweb.com/blog/insights/jobs-career-news/jobs-supply-demand/",
  "slug": "jobs-supply-demand",
  "title": "Approaching Labor Day, Supply of Jobs Exceeds Demand | Similarweb",
  "description": "For the past year, the supply of new job postings has almost always exceeded traffic generated by job seekers, according to Similarweb research.",
  "content": "HomeBlogInsightsJobs & Career NewsApproaching Labor Day, Supply of Jobs Exceeds Demand Insights Approaching Labor Day, Supply of Jobs Exceeds Demand Start your free trial by David F. Carr 3 Min. August 31, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic For the past year, the supply of new job postings has almost always exceeded traffic generated by job seekers, according to Similarweb research. Key takeaways The year-over-year growth in new job website postings indexed by Google has been up by double digits almost every month for the past year, with increases of more than 29% in February and June. That pattern broke in July with a 12% drop. With the exception of a couple of months in late 2021, the trend in traffic to the jobs websites has consistently been weaker than the growth in the supply of jobs. When the number of postings dipped in July by 12%, traffic dropped even faster, with a 47% year-over-year decline. Supply exceeded demand for most of the past year To create a picture of supply and demand in the U.S. job market, we used an analysis of Google for Jobs data produced by Similarweb’s Rank Ranger subsidiary. This represents an aggregation of job postings across many different websites – a measure of the supply of jobs. The “great resignation” and the broader trend toward job seekers being pickier about the work they will accept has not abated, based on our research. To estimate demand, we looked up desktop and mobile web data on those same domains. One major limitation we had to work around is that the job posting section of LinkedIn is a major source of new job postings, but Similarweb doesn’t allow segment analysis of traffic to linkedin.com because of user privacy concerns. On the other hand, we included traffic to indeed.com, which isn’t included in our job listing stats because Indeed has chosen not to share its job postings with Google. Still, by looking at the year-over-year change in the volume of traffic to job search websites (excluding LinkedIn) versus the volume of new jobs posted, we can see the ebb and flow of supply and demand in the jobs market. It’s a picture of supply almost always outstripping demand for the past year. In July, the supply dipped, down 12%, after being up 29% in June. But traffic to the job posting sites we looked at dropped even faster, down 47% year over year. Based on preliminary data for August, the supply of new job postings is likely to recover at least somewhat when we have full-month totals. Fluctuations in job posting volume LinkedIn is the largest of the job websites with postings reflected in Google’s index. The number of new jobs indexed by Google fluctuates from month to month, and our overall supply number was influenced by a big year-over-year decline in listings on linkedin.com in July. Other job posting websites saw big gains, with postings to ziprecruiter.com up 107% and postings to salary.com up 729%. Top job posting websites by traffic Here is how the job posting websites covered by our index stack up by traffic, excluding LinkedIn (a major player, but we can’t easily separate job posting traffic from other traffic to the website). More to follow Similarweb is planning a series of articles on trends in the job market, as revealed by web data, and this is just the first installment. This research focused on listings from and traffic to the major job posting marketplaces, showing the imbalance of supply and demand. Watch for future articles analyzing trends as revealed by the career pages on corporate websites. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Jobs & Career News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms? Jobs & Career News by Similarweb 3 Min. Jun 20, 2023 Insights SoFi Leads Neobanks in Web Traffic, Up 57% in 2023 Jobs & Career News by David F. Carr 5 Min. Jun 8, 2023 Insights Digital 100 Jobs & Careers Winner: Merit America Jobs & Career News by David F. Carr 3 Min. Jan 25, 2023 Insights UK Goes From “Great Resignation” to Search for a Side Hustle Jobs & Career News by Similarweb 3 Min. Oct 28, 2022 Insights “Quiet Quitting” Searches Highlight Growing Trend Jobs & Career News by Jim Corridore 3 Min. Sep 13, 2022 Insights Biden Loan Forgiveness Drives Millions to Student Aid Site Jobs & Career News by David F. Carr 2 Min. Aug 30, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Approaching Labor Day, Supply of Jobs Exceeds Demand"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Supply exceeded demand for most of the past year"
    },
    {
      "level": "H2",
      "text": "Fluctuations in job posting volume"
    },
    {
      "level": "H2",
      "text": "Top job posting websites by traffic"
    },
    {
      "level": "H2",
      "text": "More to follow"
    },
    {
      "level": "H3",
      "text": "With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms?"
    },
    {
      "level": "H3",
      "text": "SoFi Leads Neobanks in Web Traffic, Up 57% in 2023"
    },
    {
      "level": "H3",
      "text": "Digital 100 Jobs & Careers Winner: Merit America"
    },
    {
      "level": "H3",
      "text": "UK Goes From “Great Resignation” to Search for a Side Hustle"
    },
    {
      "level": "H3",
      "text": "“Quiet Quitting” Searches Highlight Growing Trend"
    },
    {
      "level": "H3",
      "text": "Biden Loan Forgiveness Drives Millions to Student Aid Site"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}