{
  "url": "https://www.similarweb.com/blog/insights/jobs-career-news/quiet-quitting-on-the-rise/",
  "slug": "quiet-quitting-on-the-rise",
  "title": "“Quiet Quitting” Searches Highlight Growing Trend | Similarweb",
  "description": "Searches on “quiet quitting” have risen sharply in recent months, as have searches on the related notion of “quiet firing,” Similarweb data shows.",
  "content": "HomeBlogInsightsJobs & Career News“Quiet Quitting” Searches Highlight Growing Trend Insights “Quiet Quitting” Searches Highlight Growing Trend Start your free trial by Jim Corridore , Senior Analyst 3 Min. September 13, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Searches on “quiet quitting” have risen sharply in recent months, as have searches on the related notion of “quiet firing,” Similarweb data shows. The two terms are a notable result of “The Great Resignation” as well as recent trends in employment, wages, and cost of living increases. Key takeaways The term “quiet quitting” started showing up in internet searches for the first time in March 2022, according to Similarweb Keyword Search data, but only really started to gain traction in July and August, seeing 1.2 million monthly searches in August 2022, an increase of 3,334% over the prior month. “Quiet firing” first began showing up at meaningful levels in August 2022, seeing 16,300 searches that month. The search trend has become a global phenomenon, but is largest in the United States, the U.K., Canada, Germany, and Australia. “Quiet Quitting,” the buzz phrase of 2022? The term “quiet quitting” first popped up on the internet in articles in March 2022, referencing the trend of doing the bare minimum at a job rather than working extra hard and doing more than is asked of you. Related search terms include “what is quiet quitting,” “quiet quitting job,” “quietly quitting,” and “quiet quitting meaning.” Similarweb data shows that there has been rising interest in the term over the past month, with the search term rising 3,334% in August (from July) to 1.2 million searches. In the chart below, the blue line represents searches on quiet quitting, while the orange represents searches on “quiet firing”, which is starting to rise in response. “Quiet Firing” has risen in response The search term “Quiet Firing” only started to see increases in August 2022, showing 16.3k searches for the month, versus virtually none the month prior. While it is still very small in its overall presence on the internet, it is clearly a response to “quiet quitting” trends. Quiet firing refers to employers, instead of firing unproductive or problematic workers, instead sidelining them by denying them raises, promotions or challenging assignments, possibly in hopes they will quit on their own. News websites have the largest share of traffic for “Quiet Quitting” Similarweb data shows that nine of the ten largest domains in terms of searches on the trend filter to news organizations, though it seems clear that there is an opportunity for job boards like Linkedin (2.1% of share of the search term) can benefit from the potential job dissatisfaction that seems to be inherent in people searching on that phrase. The United States leads in “Quiet Quitting” searches A look at the search by country shows the United States leading with almost 41% of searches, followed by the UK with 12%, Canada with 7% and Germany with 10%. Clearly, the trend is becoming a global phenomenon. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Jim Corridore Senior Analyst Jim provides insights across multiple sectors. With 30 years on Wall Street and numerous awards for stock-picking, he is a SUNY Albany graduate. Related Topics: Jobs & Career News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms? Jobs & Career News by Similarweb 3 Min. Jun 20, 2023 Insights SoFi Leads Neobanks in Web Traffic, Up 57% in 2023 Jobs & Career News by David F. Carr 5 Min. Jun 8, 2023 Insights Digital 100 Jobs & Careers Winner: Merit America Jobs & Career News by David F. Carr 3 Min. Jan 25, 2023 Insights UK Goes From “Great Resignation” to Search for a Side Hustle Jobs & Career News by Similarweb 3 Min. Oct 28, 2022 Insights Approaching Labor Day, Supply of Jobs Exceeds Demand Jobs & Career News by David F. Carr 3 Min. Aug 31, 2022 Insights Biden Loan Forgiveness Drives Millions to Student Aid Site Jobs & Career News by David F. Carr 2 Min. Aug 30, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "“Quiet Quitting” Searches Highlight Growing Trend"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "“Quiet Quitting,” the buzz phrase of 2022?"
    },
    {
      "level": "H2",
      "text": "“Quiet Firing” has risen in response"
    },
    {
      "level": "H2",
      "text": "News websites have the largest share of traffic for “Quiet Quitting”"
    },
    {
      "level": "H2",
      "text": "The United States leads in “Quiet Quitting” searches"
    },
    {
      "level": "H3",
      "text": "With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms?"
    },
    {
      "level": "H3",
      "text": "SoFi Leads Neobanks in Web Traffic, Up 57% in 2023"
    },
    {
      "level": "H3",
      "text": "Digital 100 Jobs & Careers Winner: Merit America"
    },
    {
      "level": "H3",
      "text": "UK Goes From “Great Resignation” to Search for a Side Hustle"
    },
    {
      "level": "H3",
      "text": "Approaching Labor Day, Supply of Jobs Exceeds Demand"
    },
    {
      "level": "H3",
      "text": "Biden Loan Forgiveness Drives Millions to Student Aid Site"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Jim Corridore"
}