{
  "url": "https://www.similarweb.com/blog/insights/jobs-career-news/uk-part-time-jobs/",
  "slug": "uk-part-time-jobs",
  "title": "UK Goes From \"Great Resignation\" to Search for a Side Hustle | Similarweb",
  "description": "Economic turmoil and the surging cost of living are driving people in the United Kingdom to search for part-time employment, a Similarweb analysis suggests.",
  "content": "HomeBlogInsightsJobs & Career NewsUK Goes From \"Great Resignation\" to Search for a Side Hustle Insights UK Goes From “Great Resignation” to Search for a Side Hustle Start your free trial by Similarweb 3 Min. October 28, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Economic turmoil and the surging cost of living are driving people in the United Kingdom to search for part-time employment, a Similarweb analysis suggests. In the “Great Resignation,” hundreds of thousands of employees across the world who decided to quit their jobs, sure that they could find better opportunities elsewhere or in self employment. Given the recent economic downturn and waves of layoffs, workers today might be scared to take that same leap of faith. This is particularly true in the UK, where the cost of living crisis is acute and economic uncertainty keeps increasing. Instead of leaving a job, or seeking a new one, Brits may be motivated to hold on tight to their current employment – and perhaps take on side hustles for extra income. We can see signs of that in the job search and job site traffic data. After steadily increasing until about May, traffic to the major job boards has been stabilizing or even slowing. Search volume for keywords related to part-time employment has risen by 52% in the last 12 months, according to Similarweb estimates. London was the city most associated with this kind of search, maybe because, as the Guardian reported, rents to have increased by 16% YoY. Secondly, part-time jobs searches within leading job boards are increasing 6% YoY as of September ‘22; however, with new energy prices that started to rise on October 1st alongside with the economic turmoil that Liz Truss has put the UK in, more recent figures (using the last 28 days of data) saw an even stronger increase. Total searches for part-time jobs are up 31% YoY as of September 26th- October 19th 2022. Leader uk.indeed.com saw traffic to its part-time job postings rise 16% YoY. Reed.co.uk has seen a significant increase in searches for part-time jobs on its site (112%); desktop traffic share for part-time jobs’ segment went up from 3% last year to nearly 8%. What about freelancers? It seems that these past few months, Brits have been looking slightly more at this type of employment that offers both flexibility and a potential additional income stream on the side. Taking a look at total traffic to the top 15 freelance job boards, including Fiverr, total traffic increased 1% YoY between July and September 2022, and by 2% YoY as of September. The increase is lower than for part-time job searches and can be explained by the lack of certainty that freelance jobs offer. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. Photo by Luis Villasmil on Unsplash by Similarweb Related Topics: Jobs & Career News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms? Jobs & Career News by Similarweb 3 Min. Jun 20, 2023 Insights SoFi Leads Neobanks in Web Traffic, Up 57% in 2023 Jobs & Career News by David F. Carr 5 Min. Jun 8, 2023 Insights Digital 100 Jobs & Careers Winner: Merit America Jobs & Career News by David F. Carr 3 Min. Jan 25, 2023 Insights “Quiet Quitting” Searches Highlight Growing Trend Jobs & Career News by Jim Corridore 3 Min. Sep 13, 2022 Insights Approaching Labor Day, Supply of Jobs Exceeds Demand Jobs & Career News by David F. Carr 3 Min. Aug 31, 2022 Insights Biden Loan Forgiveness Drives Millions to Student Aid Site Jobs & Career News by David F. Carr 2 Min. Aug 30, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "UK Goes From “Great Resignation” to Search for a Side Hustle"
    },
    {
      "level": "H3",
      "text": "With Employment at Record Highs, What’s to Become of Australia’s Gig Economy Platforms?"
    },
    {
      "level": "H3",
      "text": "SoFi Leads Neobanks in Web Traffic, Up 57% in 2023"
    },
    {
      "level": "H3",
      "text": "Digital 100 Jobs & Careers Winner: Merit America"
    },
    {
      "level": "H3",
      "text": "“Quiet Quitting” Searches Highlight Growing Trend"
    },
    {
      "level": "H3",
      "text": "Approaching Labor Day, Supply of Jobs Exceeds Demand"
    },
    {
      "level": "H3",
      "text": "Biden Loan Forgiveness Drives Millions to Student Aid Site"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Similarweb"
}