{
  "url": "https://moz.com/blog/10-blog-posts-ill-never-publish-due-to-controversy",
  "slug": "10-blog-posts-ill-never-publish-due-to-controversy",
  "title": "10 Blog Posts I'll Never Publish Due to Controversy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "No SEO stuff here; this one's just for fun. I can't tell you how many emails I get asking if I'll write a post exposing  hypocrisy ABC or fraudulent company practices XYZ. It's a lot. The thing is - I  wish I could write those posts and offer them up to the search blogosphere. The  information is…",
  "content": "10 Blog Posts I'll Never Publish Due to Controversy Public Relations A By: anonymousblogger July 10, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: anonymousblogger July 10, 2008 10 Blog Posts I'll Never Publish Due to Controversy Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. No SEO stuff here; this one's just for fun. I can't tell you how many emails I get asking if I'll write a post exposing hypocrisy ABC or that Fraudulent Company practices XYZ. It's a lot. The thing is - I wish I could write those posts and offer them up to the search blogosphere. The information is valuable, whether it's helping you avoid a scam or giving you insight into the ethics of consultants and businesses in the space. Problem is, the great value to a large number of community participants isn't worth the negative backlash, controversy, and turmoil caused by a few. I have to face facts - when I've had negative backlash from blog posts in the past, it's hurt my reputation, my business, and my bottom line (I'd bet even you SEOmoz bloggers have encountered this). There are glaring examples throughout the industry - the search blogosphere is a rough place, with a tragically high number of aggressive, opportunistic bloggers and participants happy to tear people and companies down for the joy of seeing their name mentioned around the web. Quite honestly, I suspect it's not just search. Check out the horrific uproars in the scrapbooking world (yes, scrapbooking). I'm hardly the first to observe that the web isn't conducive to maturity, forethought, or consideration for others - just the opposite. See diagram below: However, in the spirit of moz-parency (have you coined that yet, Rand?) and in order to have a little fun with all those topics I'd love to write about but can't, I figured an anonymous \"Top Ten List\" of the posts I'd most love to disclose would be just the ticket: Hey Major Search Engine - Remember that Client I Did Work for That You Called Up and Requested That they Cloak their Content for You? Yeah, Can You Spell Hypocrisy? The Five SEO Personalities Who Will Only Make You More Confused if You Read Them Ahem. I Believe You've Now Been Proven Wrong, Ms. SEO Blogger. How About an Apology? Why All those \"Top Ranked\" SEO Company Lists are Full of Sh-t The 4709 Threads That Should Never Have Gone Popular on Sphinn, and the 112 that Were Decent Dear Conference Organizers, Why Do You Continually Invite Those Same 3 Terrible Speakers to Present? Sorry So-and-So, Because of that Homophobic/Racist/Misogynistic/Political Post or Comment, It's Unlikely I'll Ever View You or Your Work with Respect Again Things to Keep in Mind About Matt Cutts - He Gets Personal, He Never Forgets What You Did 5 Years Back and, Although He Claims to Be Even-Handed (and probably wants to be), Google Would Be a Worse Search Engine if He Was. 2 Text Link Brokers Whose Links Haven't Been Found Yet, And 1 Whose Links You Can Buy to Hurt Your Competitors Sure, You Probably Hate These 3 A$$hole Bloggers, But They Keep You Honest, Don't They? Now I think I'll sit back, relax, and watch the comments try to figure out who I'm talking about. Of course, knowing the goody-two-shoes mozzers, they probably won't even post this (but you gotta admit - I put in a lot of work on that diagram to make it hard to resist). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Blog Posts I'll Never Publish Due to Controversy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Blog Posts I'll Never Publish Due to Controversy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "anonymousblogger\n          \n            anonymousblogger"
}