{
  "url": "https://moz.com/blog/10-clear-questions-for-the-engines-that-deserve-some-answers",
  "slug": "10-clear-questions-for-the-engines-that-deserve-some-answers",
  "title": "10 Clear Questions for the Engines that Deserve Some Answers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the past few days, I've seen a lot of questions in our Q+A section and across the blogosphere that suggest it's time for some direct answers from the search engines on major issues that affect business practices, consulting and website building. Here are the ones I believe are in desperate…",
  "content": "10 Clear Questions for the Engines that Deserve Some Answers Technical SEO By: Rand Fishkin May 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 7, 2008 10 Clear Questions for the Engines that Deserve Some Answers Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the past few days, I've seen a lot of questions in our Q+A section and across the blogosphere that suggest it's time for some direct answers from the search engines on major issues that affect business practices, consulting, and website building. Here are the ones I believe are in desperate need of straight responses: To all the engines - does content on subdomains inherit the full ranking ability provided by the pay-level domain? Website builders deserve to know this ahead of time so they can be intelligent about the ways they design their site structure (via SEJ). To Yahoo! and Microsoft/Live - Are you going to offer geo-targeting options like Google does in their Webmaster Tools? If not, would you be willing to follow a common format in robots.txt or meta tags to let sites tell you which countries/languages their content is targeted towards? To Google - if a site creates two subdomains, one targeting Canada and one targeting the US with very similar or nearly the same content on each, can both of those subdomains operate successfully targeting their specified country without causing duplicate content issues? If not, why? To Google - although you claim to notify webmasters inside Webmaster Tools about penalties to their site, I've seen many, many penalized domains and only one penalty message, ever. Why create and publicize the feature if you're going to continue to withhold that information from site owners? Surely your algorithms are savvy enough to detect pure spam vs. legitimate sites and businesses that simply made mistakes or attempted bad practices - why not give these domains the benefit of the doubt? Does more penalty reporting actually correlate with more spam? I'd find that hard to believe. To Yahoo! and Microsoft/Live - Penalty reporting would be an excellent feature - will we ever see it? To Google - An extraordinarily small percentage of questions get answered or addressed by Google representatives in the Google Groups for Webmasters area, yet you could easily create a more open, communicative environment by allowing your analysts to participate actively. What fears are preventing that direction? The strategy of Webmaster Central was always to open up communication, yet the party line of \"well, most threads get good answers from the community\" really ignores the potential abilities of your staff and the publicly promoted strategy of the group - where's the disconnect? To Yahoo! and Microsoft/Live - Any chance you'll offer groups/forums where webmasters can interact with engine representatives? (UPDATE: Yahoo! has a webmaster forum here and Live has one here, though it's down at the time of this writing.) To Google - Yahoo!'s Dynamic URL Rewriting system is a clear leap forward in letting site owners properly canonicalize page level content and is not a massively challenging process to implement - why not offer it (or something similar in meta tags or robots.txt)? Savvy SEOs can conditionally re-direct, but most organizations don't have this SEO intelligence - why punish them? (BTW - To Yahoo!ers reading this, the reason folks don't use the system is because they still have to fix it manually for Google & Live, so it's generally not worth the effort. It really is a great system.) To all the engines - can you offer some clear guidelines for what is cloaking vs. what is IP delivery (or whatever other name you have for showing different content to humans and bots in a good way)? Many companies worry about the practice, even when it's wise and engines would probably approve, while other push the boundaries because they haven't been well defined. To all the engines - would you consider offering a clear method for showing if a site's links no longer pass link juice? Google's current process of sometimes lowering PageRank in the toolbar is particularly weak, as those not savvy enough to be buying links from low quality directories and sites selling them are also often the ones who have no idea how to see what a domain's PageRank used to be or whether the current PR bar is meant to tell them something. On the other hand, Yahoo! and Live offer no method whatsoever. This strategy would seem to fit very well with the concept of protecting consumers, and the downside that some sites that escape detection could still sell links for a time would seem to be, by far, the lesser of the two evils here. Sometimes, I'm on the side of the search engines keeping things quiet, and I understand and empathize with their reasons. However, for these questions, I think straight answers are in their best interests. I must say that I've been generally impressed with the search engines offering more transparency of late, so I have hope that we might get good responses on some of these. Please feel free to provide your own questions of similar nature in the comments if you've got them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Clear Questions for the Engines that Deserve Some Answers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Clear Questions for the Engines that Deserve Some Answers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}