{
  "url": "https://moz.com/blog/10-essentials-sems-practice-to-boost-performance-attitute-at-work-1897",
  "slug": "10-essentials-sems-practice-to-boost-performance-attitute-at-work-1897",
  "title": "10 Essentials SEMs Should Practice to Boost Performance & Attitude at Work - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here's a list of 10 non-marketing related tasks that can be used by search engine professionals to boost performance, keep a great work attitude, help to retain more knowledge and have more energy each day. Although the duties we perform on a daily basis are fun and challenging they can often lead…",
  "content": "10 Essentials SEMs Should Practice to Boost Performance & Attitude at Work Public Relations By: Matt Franklin March 9, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matt Franklin March 9, 2007 10 Essentials SEMs Should Practice to Boost Performance & Attitude at Work Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Here's a list of 10 non-marketing related tasks that can be used by search engine professionals to boost performance, keep a great work attitude, help to retain more knowledge, and have more energy each day. Although the duties we perform on a daily basis are fun and challenging, they can often lead to stress, burn outs, tiredness, and feelings of being overworked or overloaded. Taking a few minutes each day to remember the following ten things will help to overcome many of the attitudes that plague busy marketers as they deal with the demands from clients, bosses, co-workers, and colleagues. Remember to take deep breaths often during stressful times. Drink plenty of water and try to stay away from coffee and caffeine. Be sure to get plenty of rest at night so you can start each day fresh. Eat healthy lunches and snacks throughout the day for extra energy. Take an occasional break for fresh air, to stretch, or socialize with peers. Keep the lines of communication open with clients and co-workers. Forgive those who cause you stress so it doesn't linger the next time. Be grateful for those who help you and practice telling them you are. Accept the things you may not want to do or put off because of stress. (Not for everyone) Consider using a higher power or spiritual means. Desk rage is certainly common in today's work environment, and we often forget the little things that can help us overcome the emotions behind the feelings that cause stress, fatigue, and anger while at work. Here are some more good tips for combating desk rage if it's a problem at your work place. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Essentials SEMs Should Practice to Boost Performance & Attitude at Work"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Essentials SEMs Should Practice to Boost Performance & Attitude at Work"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Franklin\n          \n            Matt Franklin\n          \n            Matt Franklin"
}