{
  "url": "https://moz.com/blog/10-link-building-lies-you-must-ignore",
  "slug": "10-link-building-lies-you-must-ignore",
  "title": "10 Link Building Lies You Must Ignore - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Even though link building has been a trade for more than a decade, it’s clear that there is still an enormous amount of confusion around it.",
  "content": "10 Link Building Lies You Must Ignore Link Building | Marketing Industry By: David Farkas September 16, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: David Farkas September 16, 2019 10 Link Building Lies You Must Ignore Link Building | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Even though link building has been a trade for more than a decade, it’s clear that there is still an enormous amount of confusion around it. Every so often, there is a large kerfuffle. Some of these controversies and arguments arise simply from a necessity to fill a content void, but some of them arise from genuine concern and confusion: “Don’t ask for links!” “Stick a fork in it, guest posting is done!” “Try to avoid link building!” SEO is an everchanging industry; what worked yesterday might not work today. Google’s personnel doesn’t always help the cause. In fact, they often add fuel to the fire. That’s why I want to play the role of “link building myth-buster” today. I’ve spent over ten years in link building, and I’ve seen it all. I was around for Penguin, and every iteration since. I was around for the launch of Hummingbird. And I was even around for the Matt Cutts videos. So, if you’re still confused about link building, read through to have ten of the biggest myths in the business dispelled. 1. If you build it, they will come There is a notion among many digital marketers and SEOs that if you simply create great content and valuable resources, the users will come to you. If you’re already a widely-recognized brand/website, this can be a true statement. If, however, you are like the vast majority of websites — on the outside looking in — this could be a fatal mindset. In order to get people to find you, you have to build the roads that will lead them to where you want. This is where link building comes in. A majority of people searching Google end up clicking on organic results. In fact, for every click on a paid result in Google, there are 11.6 clicks to organic results! And in order to build your rankings in search engines, you need links. Which brings me to our second myth around links. 2. You don’t need links to rank I can’t believe that there are still people who think this in 2019, but there are. That’s why I recently published a case study regarding a project I was working on. To sum it up briefly, the more authoritative, relevant backlinks I was able to build, the higher the site ranked for its target keywords. This isn’t to say that links are the only factor in Google’s algorithm that matters, but there’s no doubt that a robust and relevant backlink profile goes a long way. 3. Only links with high domain authority matter As a link builder, you should definitely seek target sites with high metrics. However, they aren’t the only prospects that should matter to you. Sometimes a low domain authority (DA) might just be an indication that it is a new site. But forget about the metrics for one moment. Along with authority, relevancy matters. If a link prospect is perfectly relevant to your website, but it has a low DA, you should still target it. In fact, most sites that will be so relevant to yours will likely not have the most eye-popping metrics, and that is precisely because they are so niche. But more often than not, relevancy is more important than DA. When you focus solely on metrics, you will lose out on highly relevant opportunities. A link that sends trust signals is more valuable than a link that has been deemed important by metrics devised by entities other than Google. Another reason why is because Google’s algorithm looks for diversity in your backlink profile. You might think that a profile with over 100 links, all of which have a 90+ DA would be the aspiration. In fact, Google will look at it as suspect. So while you should absolutely target high DA sites, don’t neglect the “little guys.” 4. You need to build links to your money pages When I say “money pages,” I mean the pages where you are specifically looking to convert, whether its users into leads or leads into sales. You would think that if you’re going to put in the effort to build the digital highways that will lead traffic to your website, you would want all of that traffic to find these money pages, right? In reality, though, you should take the exact opposite approach. First off, approaching sites that are in your niche and asking them to link to your money pages will come off as really spammy/aggressive. You’re shooting yourself in the foot. But most importantly, these money pages are usually not pages that have the most valuable information. Webmasters are much more likely to link to a page with resourceful information or exquisitely created content, not a page displaying your products or services. Building links to your linkable assets (more on that in a second) will increase your chances of success and will ultimately raise the profile of your money pages in the long run as well. 5. You have to create the best, most informative linkable asset If you’re unfamiliar with what a linkable asset is exactly, it’s a page on your website designed specifically to attract links/social shares. Assets can come in many forms: resource pages, funny videos, games, etc. Of course, linkable assets don’t grow on trees, and the process of coming up with an idea for a valuable linkable asset won’t be easy. This is why some people rely on “the skyscraper technique.” This is when you look at the linkable assets your competitors have created, you choose one, and you simply try to outdo it with something bigger and better. This isn’t a completely ineffective technique, but you shouldn’t feel like you have to do this. Linkable assets don’t need to be word-heavy “ultimate guides” or heavily-researched reports. Instead of building something that really only beats your competitor’s word count, do your own research and focus on building an authoritative resource that people in your niche will be interested in. The value of a linkable asset has much more to do with finding the right angle and the accuracy of the information you’re providing than the amount. 6. The more emails you send, the more links you will get I know several SEOs who like to cast a wide net — they send out emails to anyone and every one that even has the tiniest bit of relevancy of authority within their niche. It’s an old sales principle: The idea that more conversations will lead to more purchases/conversions. And indeed in sales, this is usually going to be the case. In link building? Not so much. This is because, in link building, your chances of getting someone to link to you are increased when the outreach you send is more thoughtful/personalized. Webmasters pore over emails on top of emails on top of emails, so much so that it’s easy to pass over the generic ones. They need to be effectively persuaded as to the value of linking to your site. If you choose to send emails to any site with a pulse, you won’t have time to create specific outreach for each valuable target site. 7. The only benefit of link building is algorithmic As I mentioned earlier, links are fundamental to Google’s algorithm. The more quality backlinks you build, the more likely you are to rank for your target keywords in Google. This is the modus operandi for link building. But it is not the only reason to build links. In fact, there are several non-algorithmic benefits which link building can provide. First off, there’s brand visibility. Link building will make you visible not only to Google in the long term but to users in the immediate term. When a user comes upon a resource list with your link, they aren’t thinking about how it benefits your ranking in Google; they just might click your link right then and there. Link building can also lead to relationship building. Because of link building’s very nature, you will end up conversing with many potential influencers and authority figures within your niche. These conversations don’t have to end as soon as they place your link. In fact, if the conversations do end there every time, you’re doing marketing wrong. Take advantage of the fact that you have their attention and see what else you can do for each other. 8. You should only pursue exact match anchors Not all myths are born out of complete and utter fiction. Some myths persist because they have an element of truth to them or they used to be true. The use of exact match anchor text is such a myth. In the old days of SEO/link building, one of the best ways to get ahead was to use your target keywords/brand name as the anchor text for your backlinks. Keyword stuffing and cloaking were particularly effective as well. But times have changed in SEO, and I would argue mostly for the better. When Google sees a backlink profile that uses only a couple of variations of anchor text, you are now open to a penalty. It’s now considered spammy. To Google, it does not look like a natural backlink profile. As such, it’s important to note now that the quality of the link itself is far more important than the anchor text that comes with it. It really should be out of your hands anyway. When you’re link building the right way, you are working in conjunction with the webmasters who are publishing your link. You do not have 100 percent control of the situation, and the webmaster will frequently end up using the anchor text of their choice. So sure, you should optimize your internal links with optimized anchor text when possible, but keep in mind that it is best to have diverse anchor text distribution. 9. Link building requires technical abilities Along with being a link builder, I am also an employer. When hiring other link builders, one skepticism I frequently come across relates to technical skills. Many people who are unfamiliar with link building think that it requires coding or web development ability. While having such abilities certainly won’t hurt you in your link building endeavors, I’m here to tell you that they aren’t at all necessary. Link building is more about creativity, communication, and strategy than it is knowing how to write a for loop in javascript. If you have the ability to effectively persuade, create valuable content, or identify trends, you can build links. 10. All follow links provide equal value Not all links are created equally, and I’m not even talking about the difference between follow links and no-follow links. Indeed, there are distinctions to be made among just follow links. Let’s take .edu links, for example. These links are some of the most sought after for link builders, as they are thought to carry inordinate power. Let’s say you have two links from the same .edu website. They are both on the same domain, same authority, but they are on different pages. One is on the scholarship page, the other is on a professor’s resource page which has been carefully curated. They are both do-follow links, so naturally, they should both carry the same weight, right? Fail. Search engines are smart enough to know the difference between a hard-earned link and a link that just about anyone can submit to. Along with this, the placement of a link on a page matters. Even if two links are on the exact same page (not just the same domain) a link that is above-the-fold (a link you can see without scrolling) will carry more weight. Conclusion Link building and SEO are not rocket science. There’s a lot of confusion out there, thanks mainly to the fact that Google’s standards change rapidly and old habits die hard, and the answers and strategies you seek aren’t always obvious. That said, the above points are some of the biggest and most pervasive myths in the industry. Hopefully, I was able to clear them up for you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Link Building Lies You Must Ignore"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Link Building Lies You Must Ignore"
    },
    {
      "level": "H2",
      "text": "1. If you build it, they will come"
    },
    {
      "level": "H2",
      "text": "2. You don’t need links to rank"
    },
    {
      "level": "H2",
      "text": "3. Only links with high domain authority matter"
    },
    {
      "level": "H2",
      "text": "4. You need to build links to your money pages"
    },
    {
      "level": "H2",
      "text": "5. You have to create the best, most informative linkable asset"
    },
    {
      "level": "H2",
      "text": "6. The more emails you send, the more links you will get"
    },
    {
      "level": "H2",
      "text": "7. The only benefit of link building is algorithmic"
    },
    {
      "level": "H2",
      "text": "8. You should only pursue exact match anchors"
    },
    {
      "level": "H2",
      "text": "9. Link building requires technical abilities"
    },
    {
      "level": "H2",
      "text": "10. All follow links provide equal value"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Farkas\n          \n            David Farkas"
}