{
  "url": "https://moz.com/blog/10-lessons-from-a-100k-pageview-post",
  "slug": "10-lessons-from-a-100k-pageview-post",
  "title": "10 Lessons from a 100k Pageview Post - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This kind of thing might happen to Rand all the time, but it’s not often that a digital marketing company based in Leeds gets 100,000+ people reading anything it does (at least on its own site). That’s what unexpectedly happened to us on www.branded3.com a few weeks ago – what essentially started…",
  "content": "10 Lessons from a 100k Pageview Post Blogging By: Stephen Kenwright May 23, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Stephen Kenwright May 23, 2013 10 Lessons from a 100k Pageview Post Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This kind of thing might happen to Rand all the time, but it’s not often that a digital marketing company based in Leeds gets 100,000+ people reading anything it does (at least on its own site). That’s what unexpectedly happened to us on www.branded3.com a few weeks ago – what essentially started as a rant from some guy having a bad day blew up and now has 1,184 votes on Hacker News (and incoming links from some of the biggest sites in the world). I think it’s likely I’ll never replicate this, and I didn’t intend this either – so I’ll not preach: “this is how you get 100,000 page views.” Everyone else is just as qualified as I am to write a post that’s read all around the world, and that’s exactly what I want to happen. I’d like to tell you what I’m taking away from this, and how I’ll use it when I’m creating content for my clients in the future. Commonly known as sharking. Google it. 1. [citation needed]...but not always. Google only wants you to list the links that are most relevant to and most important to your content – Eric Enge likened this to a research paper around a month ago on Search Engine Watch. The difference between your content and a research paper, though, is that your content doesn’t get discredited if there is nobody to link to that backs up the point you’re trying to make. In a Webmaster Help Video earlier in the year, Google Engineer Matt Cutts said don’t link out to low quality sites – this is pretty much the equivalent of quoting from Wikipedia in an essay. You don’t have to get peer approved before people will read your post, though, so if there’s nobody to link to that’s talking about whatever you are then that could actually be a good thing. If someone else is covering the same subject as you there’s no real reason why you should get all the links, so you should definitely write about things that no one else is covering if you can. NB: Not having anyone to back up your point doesn’t excuse you from not having a point in the first place. 2. Content needs to solve people’s problems…or highlight them. I had a problem with Path and as of the time I started writing the post, nobody had solved it, though a few people had tweeted about experiencing similar problems. I tweeted @path at roughly 7am and the first person to reply was someone else who was (very) actively looking for an answer to the same problem. I embedded Design33’s tweet in the post and linked to him; let my cohort know; and instantly a problem shared is a problem…erm, doubled. Whether your content is solving someone’s problem, or you’re just empathising with them; if you know where to find them…let them know it’s there and get your influencers on board. 3. Find out what people are looking for. The principles behind content marketing are gaining real traction in the SEO community, and more and more companies are getting on board with long-term content strategies. There’s plenty to say about planning your content out for months in advance, but as Simon points out in this fantastic YouMoz post from last year, it’s not all about Google Keyword Tool anymore. There are some great tools out there to find hot topics (Bottlenose is particularly useful), but the best way to find what your audience is looking for is by using the same tools as they are. Wil Reynolds is a great advocate of using Google Complete to find content topics (check out Wil’s LinkLove 2013 presentation, around slide 90) – start typing questions, don’t press enter; just note down what people are actually searching for. Search Twitter and find out not only what problems need solving, but who it is that actually has that problem (see point two)! Google Keyword Tool shouldn’t be your first stop when you’re looking for fires to put out, and if it’s monthly search volume you’re looking at, chances are someone faster has created content solving the same issue weeks ago. 4. Find your forum. …by which I don’t literally mean a forum, since as an industry we’ve pretty much ruined that for everyone – all I’m saying is that you just need to find the right soapbox to spread your message. In the comment string on our site this guy called me out for posting this on a company blog. At the time I hadn’t really questioned where else I could actually write this up, so Luca made me think. If I had put this on my own blog nobody would have read it…I would have just been complaining without any real platform to build on (might as well have just put it on Facebook or Twitter). One of our clients is a cloud storage company who obviously have a vested interest in online security, and do write about issues such as this from time to time. They’d never approve something like this for their blog (more in point six) so I would have had to dry it right out…or put it on another site on their behalf. Hammering this article to fit brand guidelines would have dulled its impact so much, and for a company to write about real life issues like this they really would have had to find a real life case…otherwise they’re just tipping off the media. It would never have worked. If you’re going to be controversial, find a site that’s fine with that to host your content – that goes for the content you’re putting out on behalf of your clients too. We’ve had plenty of content turned down by webmasters for being too much for their blogs, and you’ve got to respect that. Guest blogging is like the name implies, and you’ve got to make sure you don’t leave a mess in someone else’s house. 5. Write for your audience… Something everyone is taught in English class from a relatively early age is how to write for an audience. Even if you came into SEO from something else – a computer science degree, MA in marketing; whatever – you still have those classes to fall back on, and they’ll give you a pretty solid foundation in content marketing. In this industry everything comes from experience – if you covered search engine optimisation in your degree I’m sure you found half the things you knew were obsolete by the time you’d graduated…and post-Penguin the other half will get you penalised too. I found when I moved from in-house to agency side search engine marketing, most of the things I’d been doing for the last year were considered pretty spammy. If you’re writing to put content on websites that nobody reads, like article marketing websites, then you’re not writing for an audience…and that shows in the work you put out. You don’t have to be a journalist to create great content. If you’re solving problems imagine you’ve got that problem yourself and then just write for you… 6. …don’t write for your client. If you think you’ve found a hot topic and your client isn’t happy with being associated with it, there’s probably a case for not pushing that. Controversial content gets links, but there’s a certain amount of press that comes with those links. I don’t have a PR agency, so TechCrunch pointing out that it was probably my fault isn’t a disaster from my point of view. If your client makes a mistake then it might be. In the case of my blog post it wasn’t long before the media-at-large didn’t care anymore (TechCrunch may have even been the start of that) and the chances are pretty good that nobody will remember a guy getting mad at his phone in a few weeks – if a tech company posted a rant about Path it would probably be called a smear campaign. …and I won’t lie – when the VP of Marketing called me I was more than a little worried. 7. Your content has to be worthy of links to get any… This is my very first YouMoz post, and there’s a good reason for that – up until now I’ve not really had anything to say that I think might help the community, so I’ve stuck to my blog, Twitter and getting all up in other people’s business when I get the chance. If you’ve got an opportunity to write for a great site – or to work with a well-known journalist, or whatever – giving them a few hundred words of nothing content will a) not generate much in the way in traffic, b) not generate any leads, and c) make that great site think twice about having you back. 8. …and so does your site. Which leads me on to number eight: the whole point of placing links as part of a content marketing strategy (or at least it probably should be the main point) is for people to click through to your site. Make sure your users are arriving on a page they want to see. @stekenwright @phillipsnick @newsyc20 @path I think that branded3.com needs to install a WordPress caching plugin. :D — David Lynch (@kemayo) April 30, 2013 When St. Louis-based developer David Lynch submitted the post to Hacker News our entire site went down almost immediately (at 17:25, which our Development team were definitely not happy about). It’s a pretty extreme example, but if your site doesn’t present people with the screen they were expecting to see they’re probably going to leave straight away. This applies not only in a technical SEO sense (see Aleyda Solis’ wonderful resources on mobile SEO and which versions of a page you should be serving to which people for a start), but also in something as intrinsic as the services you’re providing. Going back to point four (Find your forum): the company I work for not only has a burgeoning social team, but an entire blog dedicated to social media – the perfect place to host an article about a social network, in my opinion. Make sure your link is pointing to the kind of page your audience wants to find. 9. Be funny, or insightful. Probably not both. The links generated by my post contain so much more useful information and insight than my content does. Like I said, I’m not pretending to be a journalist uncovering a story. I just presented a real life experience in a humorous way…because it was pretty funny. How do you explain what you do to your partner’s grandparents? I go with “I work with computers”. Imagine trying to explain a social network to two different pairs of 80 year-olds before 6:30 in the morning? You’ve got to laugh, as the expression goes. Your multi-national debt management firm probably can’t be funny in its content (very happy for people to prove me wrong here). Companies like this have guidelines to uphold and the chances are they’re much more interested in their brand guidelines than the links you’re working so hard to get for them. Make sure you take tone of voice into account and if your content doesn’t work in their speak, see point six. You’re writing the wrong thing. Your post definitely needs a Wonka meme. 10. Don’t do it for the links. Writing my blog post, I had absolutely no intention of getting a single link. In all honestly I didn’t fully expect the guys at Path to see it – I just wanted to vent and if possible, make my colleagues laugh. In a very helpful post on Quick Sprout last October KISSmetrics’ Neil Patel wrote that he never manually built a link – he just kept writing. We’re not KISSmetrics, but our blog has been covering as many of the happenings in the digital marketing world as we can possibly manage for more than half a decade – and mostly we just do it because we want to. Posting a piece of content on your blog every few weeks or months and expecting it to get picked up isn’t going to happen; and it’s definitely not content marketing – it’s just content. No matter how good your stuff is, don’t be disheartened if you don’t get any traction with a blog post…or a hundred blog posts. What I do think is important is that you look at every piece of content you write and think about how to make it better this time. You don’t need to over-analyse every post before it goes live – I would guess you’ve got targets and deadlines to make after all – just think about how to improve on what you’ve got so your next article will make outreach easier, or will help more people out; and if your last piece performed well, how are you going to beat it? Even if you know you won’t. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Lessons from a 100k Pageview Post"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Lessons from a 100k Pageview Post"
    },
    {
      "level": "H2",
      "text": "1. [citation needed]...but not always."
    },
    {
      "level": "H2",
      "text": "2. Content needs to solve people’s problems…or highlight them."
    },
    {
      "level": "H2",
      "text": "3. Find out what people are looking for."
    },
    {
      "level": "H2",
      "text": "4. Find your forum."
    },
    {
      "level": "H2",
      "text": "5. Write for your audience…"
    },
    {
      "level": "H2",
      "text": "6. …don’t write for your client."
    },
    {
      "level": "H2",
      "text": "7. Your content has to be worthy of links to get any…"
    },
    {
      "level": "H2",
      "text": "8. …and so does your site."
    },
    {
      "level": "H2",
      "text": "9. Be funny, or insightful. Probably not both."
    },
    {
      "level": "H2",
      "text": "10. Don’t do it for the links."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stephen Kenwright\n          \n            Stephen Kenwright"
}