{
  "url": "https://moz.com/blog/10-reasons-custom-web-design-is-dying",
  "slug": "10-reasons-custom-web-design-is-dying",
  "title": "10 Reasons Custom Web Design is DYING - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ten years ago, it was taboo to utter the word “template” to a customer when discussing their new website. I avoided this word at all costs, and if I ever did say the word \"template\" I quickly followed it with an explanation of why the word “template” just left my mouth. After all, haven't we all…",
  "content": "10 Reasons Custom Web Design is DYING Design By: Marvin Russell September 24, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Marvin Russell September 24, 2013 10 Reasons Custom Web Design is DYING Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ten years ago, it was taboo to utter the word “template” to a customer when discussing their new website. I avoided this word at all costs, and if I ever did say the word \"template\" I quickly followed it with an explanation of why the word “template” just left my mouth. After all, haven't we all heard a client say, \"this design looks too much like a template\" when rejecting one of our custom website designs. Because of this fear, I along with thousands of other web designers went through a huge identity crisis. We all thought that every website should be custom, because that's what we thought our customers wanted. Looking back years later, I've realized that nothing could be further from the truth. Custom web design is dying and here are 10 reasons why. 1. Design is Too Important The word \"custom\" implies that the customer knows more than the web designer does. It also encourages clients to pretend they are web designers, and the design of a website is far too important to let a client mess it up. Clients are control freaks, and they think that having eyes and surfing the web qualifies them as web design experts. How many amazing websites have you designed only to have it later destroyed by your customer? That happened so much at The Ocean Agency that we stopped linking to our client's websites on our portfolio. Now we just show screenshots to save us from the embarrassment of what some of our clients later did to their amazing custom websites. Clients have no idea how many years of experience web design requires before you're any good. Nor do they understand how important professional and strategic web design is to the success of their digital marketing efforts. However, as web designers we must take full responsibility for this, and never blame our clients. Blaming the client only inhibits your ability to change and improve the situation. So instead of blaming our clients let's just take that word \"custom\" completely out of the equation. 2. Users Don't Care about Custom We need to do a much better job of communicating to our clients that websites are not built for them, they are built for users. Users don't care whether your website is custom or not. Honestly, they really don't care how beautiful your site is. Users visit your website for content and/or functionality, that's it. To your users your website is neither custom nor a theme. It's just good or bad. The more simple, readable, and usable your website is, the longer they will stay, and more likely come back later. In 2011, HubSpot released a survey where they found that 76% of users said that the most important factor in the design of a website was that “The website makes it easy for me to find what I want.” Only 10% of users said, “beautiful appearance” was the most important thing to them. That being said, a custom website could be detrimental to your brand and online success. Go with a tested and proven theme designed by an expert web designer with years of experience. By no means does this mean that themes are perfect. Every website needs AB testing and multi-variant testing. But as far as building something from scratch, why reinvent a really awesome wheel? 3. Form Follows Function On the web, \"function\" is much more important than \"form\" because good functionality leads to content. To a visitor, \"form\" is a subconscious given. However, quality content is not. Rarely do consumers make purchasing decisions based on how cute your website is. Consumers make decisions based on ease of functionality and quality of content. Therefore, clients should allocate the majority of their budget to a quality content strategy, not custom web design. The easiest way to do that is to use a predesigned theme where functionality and design have already been tested and perfected by professionals, leaving more time to focus on quality content. This reminds me of a question I once asked Khoi Vinn, former Design Director for the NYTimes.com. ME: Should \"function\" ever follow \"form\"? KHOI VINN: Yes, in the alphabet. ME: Great answer. Thank you! By the way, have you ever noticed how confusing \"form follows function\" looks when written down? The phrase \"form follows function\" actually contradicts itself when written. 4. Templates and Themes are Awesome Now Five or six years ago, templates and themes sucked. I would have never recommended them to any client. Custom was the way to go. But not today. Websites like themeforest.net have revolutionized the industry. Experienced web designers from all over the world showcase and sell their themes and templates in one place. They've spent years perfecting the form and function of these website themes leaving you more time to focus on quality content. Why themes are awesome: Theme design is as good or better than anything custom Functionality is fantastic Many are responsive They are already coded They are built on common CMS platforms Many provide support and updates They are very inexpensive (often less than $50) I do have one gripe with themes. Many are not practical for businesses. They're designed as if every business is a web design company. Have you ever noticed that 90% of themes have portfolios, and the same basic pages that web design companies would have? Theme designers need to do a little more collaborating with business experts to perfect themes for different industries, but I suspect that's in the near future. 5. You'll Sell More! QUESTION: Why do some cereal companies use a glue mixture instead of milk when showing a bowl of cereal in a commercial? ANSWER: Because glue photographs much better than milk to a consumer, and consumers are very visual. QUESTION: Why is it a waste of time to sell a car online with no pictures? ANSWER: Again, because consumers are very visual and like to see what they are buying. Web design customers are no different from other consumers. They're just as visual and love being able to see what they buy. Showing a prospective client what their website will actually look like before they buy it will give you a HUGE advantage over your competition. Yes, they'll need to use their imagination by picturing their logo, colors, and content on the site, but that's great. You want your customers visualizing their brand on your product. For you naysayers; yes, it's possible to sell cereal without using glue and yes it's possible to sell a car online with no pictures. But, it's not as probable. As a sales person, I want to increase my chances of a sale as much as possible and showing my prospective clients their new website before they buy it has dramatically increased my sales. 6. Opportunity Cost Opportunity cost is the loss of potential profits by choosing one alternative over another. In other words, the longer you work on one project, the less money you can make on other projects. For example, let's say Team A can develop and launch one custom website in 60 days for $10,000. But Team B can develop and launch four website themes (back to back) over 60 days for $7,000 each. At the end of 60 days Team A would have $10,000 in revenue and Team B would have $28,000 in revenue. Of course, this assumes Team A can even launch on time. By the way, one of the hardest things to do when custom designing a website is to launch on time. That's because there are so many factors that go into finishing a custom website and getting it approved by your client. You can limit rounds of approvals all you want, but by the time your client finishes asking his step-mother, neighbor, and IT department for their advice your timeline is shot and so is your opportunity cost. 7. Competitive Pricing Everyone wants to save money, especially in this economy, and anything custom is expensive for everyone, especially the client. Themes take many time-consuming tasks out of the equation, dropping your costs and your pricing. Custom design shops won't be able to compete. At The Ocean Agency, we've been able to cut our pricing by around 30-50%, resulting in more clients and more revenue. Here's what you can cut back on or completely cut out of your timeline when utilizing themes: Wire-framing Multiple design revisions and approvals Mobile/responsive design CSS & HTML coding CMS integration SEO integration Cheaper functionality by using plugins 8. Sales Don't Always Equal Profits By offering themes, not only did we cut pricing, but we actually increased our profit margins.We often turn down clients who want a custom web design because our margins are often too low. In fact, I can remember many times when custom web design wasn'tprofitable at all; it just kept the lights on. Let me give you an example of a tough lesson I learned in the past. In 2008, our agency generated about half a million in revenue. In 2010, our agency generated about 1 million in revenue. Sounds great, right? It was actually terrible. My team did twice the amount of work and I made the exact same salary both years. That's when I learned a very valuable lesson about sales. Sales don't always equal profits. After that, I completely changed my thinking. I started to work smarter to make more money, not harder. Offering themes was a huge change and much smarter for my agency and our clients. It lowered everyone's costs and dramatically increased our profit margins. 9. Clients from Hell If everyone in the industry suddenly stopped doing custom web design ClientsFromHell.net would lose about 80% of their content. Much of that AWESOME blog is custom web design horror stories. Some clients can be a real pain in the butt, and yes, some of them may actually be from hell. A client from hell is much easier to control when developing a theme rather than a custom website. There are fewer opinions, less changes, and less time spent with the client. 10. Build Your Own Site .com's If you're a web designer and you're scared about websites like Wix and 1and1.com, don't be. They're not going to put you out of business. However, they may force you to evolve and change; and the worst thing you can do is fight change. DIY web design sites love marketing to consumers and businesses, telling them that they can build their own website and consumers will magically come. That's crap and totally misleading. If you build it, consumers won't come. Sure, you can build your own website. You could probably build your own furniture and design your clothes as well. But you wouldn't because your furniture and clothes would suck. Our clients will never learn the basic principles of web design and marketing like the laws of visual hierarchy, Occam's Razor, negative space, form follows function, the laws of proximity. Our clients are lawyers, real estate agents, restaurant owners, bloggers, sales clerks, bar owners, car salesmen, and more. We are web designs, but first we are marketers! (In my Braveheart voice). One of my favorite bloggers, Peep Laja at ConversionXL.com, once said, \"Don’t design your own website. No, really. It will suck\". He also said, \"If you build your own site, it will be ugly and it will hurt your business. You will lose money. Every day will be a wasted opportunity.\" That was so refreshing to read because it's so true. Web designers should use websites like Wix and 1and1.com to work smarter by removing the headaches of custom web design. These sites will also give you more competitive pricing and ultimately make you more profitable. The Exception to this Rule Every rule has its exceptions, so before you start yelling at me, here's this exception. Of course, there are still a few reasons to custom design a website, but not very many. I don't expect websites like Amazon, Facebook, Bing and other big brands to start picking out themes or templates…yet. Much of what I said above applies to small-medium sized business and most big corporations, who happen to make up 85% of the business in the United States of America. Conclusion Custom web design is dying. In many agencies, custom web design is already dead. This leaves you two choices. You can either fight change, or adapt and evolve. If you are still offering custom web design in the next two years, you will slowly but surely find yourself with fewer clients and more of the same headaches I left behind years ago. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Reasons Custom Web Design is DYING"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Reasons Custom Web Design is DYING"
    },
    {
      "level": "H2",
      "text": "1. Design is Too Important"
    },
    {
      "level": "H2",
      "text": "2. Users Don't Care about Custom"
    },
    {
      "level": "H2",
      "text": "3. Form Follows Function"
    },
    {
      "level": "H2",
      "text": "4. Templates and Themes are Awesome Now"
    },
    {
      "level": "H2",
      "text": "5. You'll Sell More!"
    },
    {
      "level": "H2",
      "text": "6. Opportunity Cost"
    },
    {
      "level": "H2",
      "text": "7. Competitive Pricing"
    },
    {
      "level": "H2",
      "text": "8. Sales Don't Always Equal Profits"
    },
    {
      "level": "H2",
      "text": "9. Clients from Hell"
    },
    {
      "level": "H2",
      "text": "10. Build Your Own Site .com's"
    },
    {
      "level": "H3",
      "text": "The Exception to this Rule"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marvin Russell\n          \n            Marvin Russell"
}