{
  "url": "https://moz.com/blog/10-simple-tips-for-creating-a-blog-your-readers-will-adore",
  "slug": "10-simple-tips-for-creating-a-blog-your-readers-will-adore",
  "title": "10 Simple Steps for Creating a Blog Your Readers Will Adore - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The keys to making your blog a success is knowing who'll be reading it and what they desire in the way of content.",
  "content": "10 Simple Steps for Creating a Blog Your Readers Will Adore Content Marketing | Blogging | SEO Copywriting By: Martina Mercer March 21, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Martina Mercer March 21, 2016 10 Simple Steps for Creating a Blog Your Readers Will Adore Content Marketing | Blogging | SEO Copywriting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I’ve written blog posts for numerous global brands; it's one of my favorite pastimes. After my last article last article for YouMoz, it occurred to me that I should share some marketing and copywriting tips for writers who are as passionate about blogging as I am. Ultimately, I decided to take my original idea one very big and important step further. As a result, this article contains a simple plan for creating a blog your readers will adore — in just 10 steps. First of all, you need to know who will be reading your blog. That brings us to the first step of the plan. Step #1: Identify your target audienceA blog is a great tool for bringing in new customers you have been unable to reach through other channels, and for building loyalty with existing customers. Keep in mind that your blog must consistently add value to both types of readers' days in order to achieve desired your desired outcomes.When choosing who you will target with your blog, consider the following:Ideal ageIdeal location(s)Income range/disposable income rangeIntelligence levelLifestyle/popular hobbiesThis isn’t an exhaustive list, so feel free to add your own.Once you have identified your target audience, you need to decide what to blog about. Here's a hint: It cannot be about you or your brand.If you are selling yourself as a product, that's one thing, especially if you're, say, a Kardashian. However, if the paparazzi are not outside your office door waiting for a snap, it’s best to leave this alone, or save it for your personal Facebook updates. Besides, your website should already have an “About” or “Meet the Team” page that serves this purpose.Step #2: Choose your subject carefullyChoosing the subject of your blog isn’t easy. You need to wear the customer’s psyche like a second skin. Think about what your customers do in their free time. Research some people in your target market and see what they share on social media.Once you’ve found what makes your customers tick, tie it to your products or services.Example #1A great example is the post I wrote for a freelance employment site shown in the screenshot below. It tied the brand's personality to the psychology of the target audience — freelancers. I was able to accomplish this because I had in-depth knowledge of my audience.Example #2If you are a health club, don’t blog about the new equipment, the success of your team, or the gym. This is what landing pages are for. Instead, focus on a subject that is as interesting as it is practical — one visitors to your blog will desire to read about again and again.Popular subjects for gym blogs include: Weight training tips and advice Recipes for healthy eating Quizzes about fitness training and motivationExample #3I write regular blogs Sunday Woman Magazine (shown below). The topics I cover are related to those areas women are most interested in learning about.You can do the same for your brand, or the brands you work with.Expand your mind and you will expand your reach. Customers who buy designer handbags, for instance, will probably be interested in shoes, fashion, cosmetics, travel, and all the other trappings of a luxury lifestyle.Popular subjects for a luggand and handbag website could include: \"The top ten exotic locations around the world\" \"Tips for turning a summer wardrobe into autumn work wear\" [Quiz ] \"What does your handbag contents say about you?\" [Video] \"How to spot a fake Chanel handbag\"All of these ideas provide information and value, while having the potential to be revisited as checklists and be easily shared on social media. The quizzes are a great tool to appeal to a customer’s ego. When the results of the quiz massage the readers ego with glowing praise, they will want to share both their personal results and the quiz with all their friends.Step #3: Do your researchOnce you’ve decided on a theme (which is interchangeable, depending on who you attract to your blog), you need to research the subject matter. Trends change daily and research can help you stay current while further developing your imagination for content ideas. Backing up your blog with well-researched facts can make all the difference when it comes to building credibility and trust with your readers. For instance, consider the following facts I dug up on how blogs help build business: Small businesses with blogs generate 126% more leads. Interesting content is one of the top three reasons people follow a brand on social media. 81% of consumers trust advice from blogs.Don’t you want to start your own blog now?This is a blog I write for Money Mate (a brand focused on phone and home insurance products):Money Mate's blog proves that even the most boring subjects can be made interesting.Step #4: Create a content calendarMost blogs are lost in obscurity, started with the best of intentions before fading into the nether regions of the blogosphere, never to be seen again.Consider setting realistic expectations for the frequency of updating your blog and don't forget to make time to respond to blog comments. Updating your blog frequently is great, but consistently updating it at regular intervals is crucial. If you end up not having the time to keep your blog updated once consider hiring a copywriter to update it for you.Step #5: Make your blog a feast for the eyesThe words you use in your blog posts will keep your visitors on-site and ensure they return to check for updates, but images are what will grab people's initial attention and pull them into your blog. So incorporate high-quality visual content into your posts and overall blog design, including videos and screenshots. Try to show, not just tell, and you'll have readers hooked on your blog in no time.(A blog I wrote for a friend's Botox clinic, pictured above.)Step #6: Make your blog search-engine friendlyYou now know what to blog about and when to do it, as well as where to find inspiration for content creation. Now let's talk about what to do to make your blog search-engine friendly (and what to avoid).DOChoose a good title and description for each postPerform keyword researchPromote your content and make it easy to shareDON'TOverstuff your posts with keywordsUse an irrelevant, keyword-stuffed title (or sensationalize it) simply to get clicksShare a link to your post without including a summaryAlso, don’t forget to add a solid meta description and meta tags. The tags will become indispensable for you organising content as your blog grows.Step #7: Experiment with keywordsRemember, a blog can connect you with potential customers you have not been able to reach elsewhere, so using alternative keywords when optimizing your content can increase your reach. In other words, think beyond exact match keywords and sprinkle in words and phrases that might be closely tied to user intent.Step #8: Consider guest bloggingOnce you’ve mastered the art of writing for your own blog, you can use it to show other relevant sites the type of content you could create for them as a guest blogger. This, of course, could lead to valuable backlinks for your site that improve its presence in search results.(A guest blog I wrote for HuffPo, pictured above)Step #9: Show your readers appreciationA blog is a great tool for developing a relationship with your customers. It can inspire confidence, encourage loyalty, and even make your visitors ambassadors for your brand. It can offer the perfect after-sales care and answer your customers' questions.Step #10: Make calls-to action a top priorityFrom a psychology point of view, it can be argued that calls-to-action (CTAs) cheapen a blog. A potential customer could have truly enjoyed your blog, only to feel a little deflated when it ends with, “Buy this product now!”That's why creating effective, non-promotional CTAs are a must.Instead of making it obvious that you're trying to sell a product or service, subtly make your pitch. For example, \"Need marketing help? We're here if you need us...\" works a lot better than \"We're the marketing pros. Give us a call!\"I've included a lot of important tips for creating a successful blog in this article. I hope you find them useful, and would enjoy reading a few of your own tips. Please share your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Simple Steps for Creating a Blog Your Readers Will Adore"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Simple Steps for Creating a Blog Your Readers Will Adore"
    },
    {
      "level": "H2",
      "text": "Step #1: Identify your target audience"
    },
    {
      "level": "H2",
      "text": "Step #2: Choose your subject carefully"
    },
    {
      "level": "H2",
      "text": "Step #3: Do your research"
    },
    {
      "level": "H2",
      "text": "Step #4: Create a content calendar"
    },
    {
      "level": "H2",
      "text": "Step #5: Make your blog a feast for the eyes"
    },
    {
      "level": "H3",
      "text": "Step #6: Make your blog search-engine friendly"
    },
    {
      "level": "H3",
      "text": "Step #7: Experiment with keywords"
    },
    {
      "level": "H3",
      "text": "Step #8: Consider guest blogging"
    },
    {
      "level": "H3",
      "text": "Step #9: Show your readers appreciation"
    },
    {
      "level": "H3",
      "text": "Step #10: Make calls-to action a top priority"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Martina Mercer\n          \n            Martina Mercer\n          \n            Martina Mercer"
}