{
  "url": "https://moz.com/blog/10-unique-viral-blockbusters-we-can-all-learn-from",
  "slug": "10-unique-viral-blockbusters-we-can-all-learn-from",
  "title": "10 Unique Viral Blockbusters We Can All Learn From - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are many ways to \"go viral\" these days, with new and creative methods surfacing regularly. In my experience as an internet marketer, I've seen many impressive and ingenious techniques for generating traffic, buzz, and links.  Although not all of these examples were created with specific goals…",
  "content": "10 Unique Viral Blockbusters We Can All Learn From Link Building N By: Nick Santillo December 7, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nick Santillo December 7, 2009 10 Unique Viral Blockbusters We Can All Learn From Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There are many ways to \"go viral\" these days, with new and creative methods surfacing regularly. In my experience as an internet marketer, I've seen many impressive and ingenious techniques for generating traffic, buzz, and links. Although not all of these examples were created with specific goals (traffic, links, cash) they are notable for their creativity and effectiveness. If you're ever having trouble thinking of ways to increase you're exposure, read this over, I bet it will get those creative juices going, and you will think up the next viral blockbuster in no time. 1. Million Dollar Home Page The Million Dollar Home Page was a single page site conceived in 2005 by Alex Tew, a University student in England as a way to pay for his college education. The idea was simple, create a 1,000x1,000 grid of pixels, and then sell each pixel for 1$ to advertisers (Were sold in 10x10 blocks) Each block contained an image hotlinked to the advertiser's website. The site launched on Aug 26th 2005. In the first few weeks Alex began by selling to friends and relatives. After two weeks he had managed to sell 4,700 pixels to only people he knew. At this point, Alex created and launched a press release about his idea and success thus far. The press release was picked up by the BBC, and spread virally both on and offline from there. By New Years of 2005, the site was seeing in excess of 25,000 unique visitors per hour, with more than 999,000 pixels sold. Alex auctioned the remaining 1,000 pixels on ebay for $38,100. After all was said and done, Alex estimates he cleared between $650,000-$700,000. Notable Features of the Viral The crucial thing in creating the media interest was the idea itself: it was unique and quirky enough to stand out. I only had to push the idea a bit in the first few days by sending out a press release which essentially acted as a catalyst. This interest coupled with traditional word-of-mouth created a real buzz about the homepage, which in turn created more interest. —Alex Tew, 22 February 2006 1. Uniqueness & Originality - It's safe to say this idea will never work the same way again. It was successful first and foremost because it was a unique/novel idea. 2. Seeding and Promotion - Unproven ideas are hard to get behind. Alex was very smart to sell a good number of pixels sold BEFORE doing a press release. This added the legitimacy needed for an organization like the BBC to pick it up. 3. Viral Component - Advertisers purchasing spots have a stake in the website doing well. The more visibility the site gets, the more visibility the advertiser gets. This no doubt meant that advertisers helped to push the popularity a great deal. 4. Early Participants Bonus - Used in Multi-Level-Marketing for ages, first adopters have more to gain. In this case, early advertisers gained more visibility because they were there during heavy press coverage. 2. One Red Paperclip The site One Red Paperclip was the brainchild of Kyle MacDonald, a Canadian blogger who wanted to test his ability at bartering. The concept, again, was simple. He would start with a single red paperclip, and trade it for another item. This item would then be traded, and so on, for one year, with the incentive of always \"trading up\" for a more valuable item. These were his trades: Paperclip -->fish-shaped pen -->hand-sculpted doorknob. -->Coleman camp stove. -->Honda generator. -->\"instant party\": an empty keg, an IOU for filling the keg with the beer of the holder's choice -->Ski-doo snowmobile. -->two-person trip to Yahk, British Columbia -->Cube van -->recording contract with Metal Works in Toronto -->a year's rent in Phoenix, Arizona -->one afternoon with Alice Cooper -->KISS motorized snow globe -->a role in the film Donna on Demand -->Traded the movie role for a two-story farmhouse in Kipling, Saskatchewan Kyle Macdonald's blog became very popular, and even years later is bringing 10,000+ unique visitors per month. Consequently, a book was also published about his idea, and his journey from a paper clip to a house. From a linkbuilding standpoint, the site has been wildly successful, showing nearly 24,000 backlinks in Yahoo Site Explorer. Notable Features of the Viral 1. Uniqueness & Originality: This cannot be stressed enough. A completely new concept will outperform an old concept, or reworked concept in almost all instances. 2. Novelty in Simplicity: Part of what makes this viral concept so great is that it's incredibly simple. One Red Paperclip demonstrates the power of bartering, something widely known, yet underutilized. The \"wow\" factor comes from the realization of the power of barter. 3. The \"I could do that\" factor: Part of the appeal of simplicity is that it seems that most anyone could have thought of it or done it. Million Dollar Homepage had a similar appeal. 3. SaveToby.com SaveToby.com was created in 2005. The owner claimed that he had found a wounded rabbit outside his home and nursed it back to health. However, he was not able to afford the rabbit any longer and would be forced eat the rabbit, unless he could come up with $50,000. The money could be contributed either by donating directly, or by purchasing \"save toby\" merchandise. The site included many pictures of toby, along with recipes for rabbit based dishes.The site became viral online soon after its launch and was noticed by the mainstream media, with attention from news outlets as large as NBC Nightly News. Attempts were made to have the site removed by animal rights groups, but the host (Godaddy.com) denied the claims, stating \"it was perfectly legal to eat a rabbit.\" It is claimed that over $24,000 was collected by the website. The site was later bought by Bored.com for an undisclosed sum. A book was also made. Notable Features of the Viral 1. Emotional Appeal: While clearly this concept had a negative emotional appeal, it was the primary motivating factor in both the money generated and the viral spread of the site. 2. Group Effort: Keeping a running tally on a monetary fund raising goal is a great way to make participants feel as though they are part of a group effort. Another aspect to the viral appeal of SaveToby.com was the feeling of being part of a larger altruistic team who would rescue Toby from being eaten. 3. Time Constraints: Urgency is another good catalyst for action. With the days counting down until Toby's demise, visitors were incentivized to take immediate action (either by sharing the story, or by donating cash) 4. Lockerz.com From the Lockerz.com about us: \"Lockerz is the place to go to buy the coolest stuff at the lowest prices, watch exclusive video, discover new music, play the hottest games, hang out with your friends - and get rewarded for just about EVERYTHING you do on the site.\" Lockerz.com is currently still in beta, but has thus far generated an enormous amount of viral buzz through its beta program. Lockerz.com is currently available by invitation only, but current members can invite new members. This has been a scheme used effectively before (Gmail and others). From here, lockerz has added several other layers to their viral promotion, all of which use a \"proprietary currency\" called PTZ. New users are given a base number of PTZ's(points), and can earn more by completing tasks. Tasks include taking quizzes, signing up new members, playing games, and more. PTZ can then be cashed in for prizes. The points required for the good prizes are out of the reach of most participants, and are perpetually out of stock, but have thus far acted as incredibly valuable incentives for the spread of Lockerz.com. The site has not even exited beta yet and is currently at nearly 300,000 unique visitors per month and 32,000+ backlinks Notable Features of the Viral 1. Exclusivity: Gmail used this method effectively, by offering it as an invitation only service. Lockerz has done a similar thing. Making it an exclusive club by invitation only gives members a feeling of being special. This coupled with the ability to choose who else can get in, gives users a sense of both belonging and power. 2. Viral Sharing and Incentives: The PTZ proprietary currency acts as an excellent motivator for both site participation and spread of the site virally. Users are given points for recruiting new members which can be traded in for actual products. 3. Early Adopters Bonus: Lockerz makes it clear on its website that the current system of PTZ is only for beta users, and that once the site goes live, the number of PTZ required to get the prizes will go up. This has a twofold effect. First it additionally incentivizes people to become a member early, and second, it motivates them to work hard during the finite period of time before launch in order to maximize their points. 5. Ihateyourachel.com The now defunct Ihateyourachel.com is an example of an interesting viral script I had the opportunity to study through a friend. The visitor is shown an initial picture of a \"hot girl\" and is told that it is the site authors \"ex-girlfriend\" and that he's trying to spread NSFW images of her around the internet as revenge. The images are actually taken from an 18+ non-nude model. In order to see more than just the first few images of the girl, the visitor must perform one of two actions. 1. Get others to visit the site (via a custom referral url) the more visitors sent, the more images unlocked 2. Complete an offer (sign up for a CPA offer, mailing list, etc.) Instantly unlocks all the images. The test of something being truly viral is if it is shared at a higher rate than it is abandoned. By incentivizing every user to easily spread the word, this method generated an enormous amount of traffic in a very short period of time. The Ihateyourachel.com was promoted via a few social news outlets, and withing hours was pulling in 1,000+ visitors per hour. Below is a look at traffic over the following ten days. Notable Features of the Viral 1. Easy Sharing: Sharing was done by creating a unique referrer for each visitor interested in seeing additional pictures (a process that took the user mere seconds) from here users had many simple built in buttons and tools to spread the word (Twitter, Facebook, Myspace,Email, IM, etc.) Referrals were seen from each of these places almost immediately. 2. Quantification: Users knew how many more visitors they needed to generate to see the next visitor, this is very important in them completing the goal. 3. Appealing to base desires: Sex sells, period. Using sexuality as a motivator or incentive is done regularly, although not usually in such a blatant way. Conclusions: While many of these techniques relied on somewhat questionable ethics, the ideas themselves can serve as a base for similarly structured viral campaigns. Additionally, there are many features present in these campaigns that can be used as a sort of checklist when creating your own viral content. The following are some notable features demonstrated. 1. Virals need to be unique and original. 2. Seeding your viral before promotion can add legitimacy. 3. Incentives play a large role. Give visitors a reason to share your content. 4. Exclusivity can increase virility. 5. Emotion, especially sex and anger are strong motivators for sharing. 6. Simplicity of concept is a factor in many successful virals. 7. Making your visitors feel as though they are part of a group effort increases virility. 8. Time constraints act as a motivator for increasing the speed of viral sharing. 9. Early adoptor bonuses work well as a method for increasing sharing and participation. 10. Quantification and tracking of goals gives your visitors something to work towards. This was part 1 of 2. We are featuring another 5 Viral Methods case study like the 5 that were outlined today on the Voltier Blog, so follow us and don't miss out! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Unique Viral Blockbusters We Can All Learn From"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Unique Viral Blockbusters We Can All Learn From"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Santillo\n          \n            Nick Santillo"
}