{
  "url": "https://moz.com/blog/10-ways-to-get-more-seo-clients",
  "slug": "10-ways-to-get-more-seo-clients",
  "title": "10 Ways to Get More SEO Clients - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been traveling for the past few weeks and talking to dozens of SEO consultants, and you know what they are all saying? They are at their max for clients. Yup, that's right...they can't take on new clients. They have TOO much work! This is good for all sorts of reasons. One, it shows we are in…",
  "content": "10 Ways to Get More SEO Clients SEO Basics By: Joanna Lord November 29, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord November 29, 2010 10 Ways to Get More SEO Clients SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been traveling for the past few weeks and talking to dozens of SEO consultants, and you know what they are all saying? They are at their max for clients. Yup, that's right...they can't take on new clients. They have TOO much work! This is good for all sorts of reasons. One, it shows we are in a good place during an economically difficult time, and two, there are people out there desperately seeking out your services, with nowhere to turn. So how do you find these clients begging to pay you money? Here are ten ways to build your client base, and ultimately make sure the clients keep-a-coming... 10. Refer a client/affiliate program Setting up a referral or affiliate program can be something as simple as offering discounts on your prices to clients that refer new clients, or something as complicated as full blown affiliate programs with ongoing commissions for successful client signups. I find too many consultants think of this as bothering a past client, but if you offer them a kickback for mentioning your good services to their friends that need them...it seems like such an obvious double win to me. So what are you doing to leverage your current client list for a bigger, better looking one? 9. Optimize your site/resume This is one of those \"oh snap\" moments. It's such a simple idea, but few of us are doing it. As SEOs we spend our days helping people rank their sites higher, and optimize for more conversions. Well uhmmm, what about your site? I know you are doing all the right stuff to make sure you rank #1 for \"best SEO consultant in the universe\" but what about when they actually land on your site? Is it easy for them to request more info? How about trust signals, testimonials, and other valuable information...is it doing it's job? Potential clients will naturally spy on you check out your website and resume. Do you know what they are going to find? Is it enough? 8. Speak at events/hold site clinics As we all know this industry operates, for the most part, virtually. However, when it comes to signing clients nothing can replace a potential client seeing you in person. Speaking at conferences can be a great way to reach a relevant audience and pitch yourself before having to pitch your services. You get to network, and possibly get links to help build your brand. In addition to speaking, if you can finagle it, hold site clinics at conferences. The whole room gets to see you action, and your future clients get to see exactly how you will help them...once they sign with you. Can you say cha-ching? _Martin MacDonald's excellent presentation at the London Pro Training likely earned him some new clients_ 7. Guest blogging As SEO's we know the value of guest blogging. Words like \"visibility,\" \"links,\" and \"personal branding\" come to mind. All of these make guest blogging the perfect way to funnel potential clients to your site and your services. Take this idea and think outside of the box. If you focus on SEO for your local area, where are local businesses reading information online? Get in there. If you do SEO for enterprise sites, where are those CMO's getting their information? Make sure your byline is landing in front of their SEO-deprived eyes. 6. Sponsor events/mixers Instead of traveling by plane to go talk SEO, why not host a local meet-up for businesses to hear about how SEO can help them succeed. You can either go formal and have a panel talking local SEO, or you could have material they can take with them. These local mixers can help attract qualified leads and build your reputation as a local SEO expert. How do you get people to come? Give away free consultations, or pick up the bar tab for an hour. Never underestimate the power of an open bar. _The SEOmoz meetup in Sofia, where we made tons of great new friends_ 5. Create free tools I can't take the credit for this idea, but I had to get it up on the list. Lots of great consultants and agencies have been doing this for years. If you have free tools that people will love, offer them up as a way to drive traffic to your site. By offering SEO-related tools, you attract a relevant audience, collect information you can use to follow-up with, and leave people with a positive sentiment. People love free stuff! It's a great way to get people both comfortable, and acquainted with your personal brand. _Virante's collection of free SEO tools brings them highly relevant traffic and industry credibility_ 4. Email blast Much like #9 you would think this approach would be obvious, but oftentimes us SEOs forget about some marketing basics. When you are looking to add to your client base why not email friends, family, past colleagues, etc. and let them know you are taking on new clients. Make sure you list out what you specialize in so they can easily pass the email onto people that might be interested. If you are really looking to get leads, add in a free consult or audit, and make the deal impossible to ignore. Personal referrals are incredibly powerful. _ Take note of that email address - it's a handy one to have :-) _ 3. Publish case studies I know you all just collectively rolled your eyes when you read this one, because you are right, case studies involve a lot of work. You have to nail down a thesis, put together a test, collect data, and then report the results in a digestible manner. Yuck. But you know what? Case studies are compelling for just that reason. They are a thorough example of just how effective your services can be for the person reading the case study. Potential clients want to read about a similar company and the success SEO brought them. If you couple that case study with a contact form they can fill out for more information, you are sitting pretty. Trust me. _Location 3 Media's excellent Local SEO Guide is a great example_ 2. Learn a niche This may seem counterintuitive, because how can you open up the flood gates for more clients if you limit yourself to one niche, but people considering SEO want to see a consultant with relevant experience. Remember, SEO is still a bit confusing to most companies. They don't understand best practices, they still believe that this SEO-stuff is a bit magical. If you have a few past clients in one industry, why not build out that portfolio and market yourself as such. What is your niche? Sometimes by taking on any client, you actually cannibalize your chances of owning a type of client. 1. Get active in new forums Did I just use the word \"forum?\" Yeah I did. I don't necessarily mean the forums of yesteryear (although a lot of those are still great places to network) instead I mean the new age forums. There are so many sites out there to help you establish yourself as an expert in a certain field. I mean sites like Quora, LinkedIn Answers, FormSpring and Facebook Questions.There are dozens of niche Q&A sites popping up. Don't underestimate the power of marketing yourself an SEO authority to these growing audiences. _Sharing your knowledge across the web can result in positive client karma_ So there you have it. Hopefully I've given you some great ideas to get started with. The key with all of this is to remember that you need to be marketing your services not just to people that get SEO, but go beyond that circle. Wander into the less Internet-savvy group, and help them understand the value of SEO. In doing so, you will help them see the value in you, and more importantly, in hiring you. I'd love to hear your suggestions for things I may have forgotten. How have you all grown your client base? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Ways to Get More SEO Clients"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Ways to Get More SEO Clients"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}