{
  "url": "https://moz.com/blog/11-ways-local-businesses-can-get-links",
  "slug": "11-ways-local-businesses-can-get-links",
  "title": "11 Ways for Local Businesses to Get Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Follow Casey Meraz as he covers 11 ways for local businesses to earn valuable, non-spammy links to help you build the authority of your site.",
  "content": "11 Ways for Local Businesses to Get Links Link Building | Local SEO By: Casey Meraz March 24, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Meraz March 24, 2015 11 Ways for Local Businesses to Get Links Link Building | Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let's face it: Local link building is hard. Even if you have the budget and resources needed to earn or build links it will take time. Having a strong link profile is essential to your website's success in search engines. If you're new to link building and want to develop a more in-depth understanding, check out this great resource from MOZ on link building here. In this guide we will look at 11 practical ways you can start earning links for your local business, which will make an impact on your bottom line today. Who should care about local link building? When I talk about local link building I don't mean that these links are for local businesses exclusively. If you're trying to boost the authority of your website, one good way is to get links from locally relevant sources. This guide is for all types of businesses who want to increase their site's link authority. Since local business types vary from fast food restaurants, to ski rental shops, to law firms, and everything in-between, the tactics below are applicable across the spectrum. About these links Some of these links are harder to get than others. While it's easy to start with the low hanging fruit, you should put a plan together to go after the harder ones. These are the links your competitors won't get because they're just too darn lazy. This is how real businesses set themselves apart in the customer's eyes and the search engine's eyes and build a brand that's worth remembering. Aim for quality over quantity and don't settle for crummy links.How do you define a good link? I recently read an article by Eric Enge from Stonetemple that summed up what type of links you should be looking for pretty nicely. In this article he mentioned three key points to help define the type of links you're looking for. They were: Links that will drive direct referral traffic Links that build visibility with your target audience for your brand Links that build your reputation The link building methods I'll be covering today will achieve at least one of the goals each. I always think it's important to \"think outside of the link\" and the above three points make that practical. In addition to getting the link for an SEO benefit, will it actually drive relevant traffic? If so, that's a great link to chase. The same goes for links built that place you in front of your target audience and links that build your reputation. Keeping this in mind, lets build some links!#1 Create controversy and get in the news Creating a controversial story may seem hard at first glance, but it reminds me of this quote from Peter Marshall \"If you don't stand for something you will fall for anything.\" If your clients don't have any controversy or a cause to believe in, then they aren't real people. You can't agree with 100% of the people 100% of the time and you just have to find out what that is. Some companies like Spirit Airlines seem to do this quite often, but the little guys can do this too with minimal investment.Using this method you can get links from places like: The Wall Street Journal, The Denver Post and other local newspapers, Lexis NexisActual case study We were recently working with an attorney who was looking to earn links at a decent scale. We proposed a scholarship contest. While scholarship links from .edus are cool, we like The Wall Street Journal and high authority news site links even more. After speaking with this client, who is a DUI attorney, we discussed how everybody talks about how destructive driving drunk is, but rarely do people admit to the habit. From this idea, we came up with the concept of a Scholarship for Colorado students who admit to drinking and driving. After the scholarship information was published on the site, we reached out to our local newspaper, The Denver Post, and informed them of the scholarship. From here, they went on to interview our client and write an article on the topic titled \"Scholarship for Colorado students who admit to drinking and driving\" that links to the scholarship page. Once the Denver Post article was published, it was easy to get other major publications to cover the story, including The Wall Street Journal: How you can do this Step 1: Develop an idea that strikes a chord with people. Think about issues that are universally familiar and tend to be polarizing in some way. Step 2: Develop the on-page asset needed to support it. In this case we opted for the scholarship. Step 3: Once the asset is created, pitch it to a local newspaper. Step 4: If the story is picked up by a newspaper you can then pitch it to other major publications like The Wall Street Journal. Many websites have contact forms and areas to submit a tip. Something simple like \"Hey I thought you guys might find this funny\" with a link to the news publication article will do the trick since it adds credibility. Step 5: Share it on social media with groups that might be interested in the topic. Step 6: Consider paying for some exposure on Outbrain to widen the audience. PRO tip: Don't skimp on the content, graphics, or any step in this process. This will be fruitful if done right but will fall flat on your face if you try to take shortcuts. #2 Easily get contest nomination links Almost every city whether big or small has some type of local business awards. The awards might be run by a small local newspaper with a website, the chamber of commerce, or even another organization. In addition to these \"Best Of\" type awards, there are also awards based on age like Top 40 Under 40 or by type of business including Best Restaurant or Best Law Firm. The trick is to find the opportunities that are a good fit for your business and get listed. Sometimes you have to win to get mentioned and other times you just need to get nominated. Get links from places like: Chamber of commerce, news publications, and major publications if you're good enough :) Getting a link from the Chamber of Commerce like the example above is very relevant as it only serves businesses within that city. It's also a plus for informed local shoppers. How you can do it The best way to find these potentially lucrative links is to do a Google Search. You need to start by coming up with a list of potential sources. Since these are generally city or state specific, it's a good idea to use one of these search strings: Here are some ideas to get the wheels turning in your brain: \"Nominate a business\"+\"STATE NAME\" (Example: \"Nominate a business\"+\"Colorado\") \"City Name\"+\"Nominate a business\" (Example: \"Los Angeles\"+\"Nominate a business\") \"best of STATE or CITY\"+\"nominate\" (Example: \"best of Colorado\"+\"nominate\") \"best BUSINESS TYPE\"+\"nominate\"+\"city\" (Example: \"best restaurant\"+\"nominate\"+\"denver\") \"AGE under AGE\"+\"GEO MODIFIER\" (Example: \"30 under 30\"+\"Denver\") \"nominate\"+\"young entrepreneur\" (Example: \"nominate\"+\"young entrepreneur) Once you have curated a list of awards you want to try to apply for you can then send your pitch to each of these websites directly. Typically they have nomination forms that you would fill out or a certain procedure. If you can't find out how, don't be afraid to ask!#3 Get eco-friendly links Is your business green? Does it operate according to low energy standards or are you at least on track to be green? Why not help out the environment and get a link out of it as well? Now while you probably won't show up on Newsweek's America's Greenest Companies 2014 for doing this, there are a lot of offline benefits to being green as well. I already mentioned saving the environment, but did you realize there are eco-friendly shoppers? Some shoppers do the majority of their business with companies that are eco-friendly and I suspect this will just continue to soar.Get links from places like: Mostly business directories and local news organizations who promote green businesses. How you can do it With this industry there are some low hanging fruits, but just like all link building, you should be smart about your approach. While it might be tempting to go out and get a link on a directory, I would personally spend time scrutinizing it to make sure it's a strong website that's human-edited and controlled. If you don't find it reputable, nobody else will (including Google). That's why it's best to focus on local opportunities such as your local newspaper or community directory. Make sure to familiarize yourself with the Green Terminology here. Once you have a good idea of what you're looking for, you can conduct some easy searches such as the ones below to find directories. Again, please be sure to scrutinize them. Search for directories by using search phrases like: Eco-friendly business directory Green business directories #4 Sponsor a meetup group While of course we're talking about links here, I always like to see the other side of a link and the actual benefit it will give you. Did you know you can sponsor meetup groups and get a link as well as get in front of your potential customers? Meetup.com is a powerhouse website that connects like minded groups of people together through events they call meetups. If you have a good grasp of your target audience and you know where they hang out, you can get in front of them more easily. For example, let's say that you're a bike store. Would it make sense to sponsor a local meetup biking club? Yes! How you can do it Sponsoring a meetup group does require the group owner to accept your sponsorship and terms. Your goal however is to get your business name, logo, discount, and link in the ad as shown in the example. If you're ambitious and a local store you could ask to have your NAP displayed as well for Local SEO purposes. Step 1: Start by determining what type of groups might appeal to your audience. I have included some tricky examples below: Attorneys - Maybe sponsoring a cycling- or driving-based meetup with the safety approach Doctors - Sponsor a healthy living meetup Airsoft or Paintball Store - Sponsor a singles group by offering an event Construction - Sponsor a charity group or a new homeowners' group That's enough to get the wheels turning. Write these ideas down and proceed to the next step. Step 2: Turn to Google to make your search easier! Use the search strings below to only search the meetup.com website with the keywords you're looking for: site:meetup.com state+keyword or site:meetup.com city+keyword Step 3: Click through the results and find a meetup group that seems to fit the bill. Step 4: Show up to the next scheduled local meetup group. Network. Meet the group owner and see if they're seeking sponsorship's. Step 5: Negotiate and get your site up! #5 Host a community event If you want to do event link building check out my local event link building post here or Kane Jamison's event link post here. While those posts go more into how you can really promote an event and build some awesome local links, I want to talk specifically about how you can get listed on your city's website by hosting a community event. The thing I like most about events is that you get to give back to your community and help people. Not even a link feels as good as that. The only real requirements for this one is that you host an event where the entire community is invited and get a blessing from the town. In the example below you can see how a church in my town of Parker, Colorado was able to get a link by hosting an Easter Egg Hunt. So not only are they getting exposure from people in their town (their target audience), they're getting the link and mentions here too. If the event was hosted at your office or business location, then you can get the added superior benefit of your NAP listed on their website! If it's a county-wide event, you can get listed on the county website and if the event is public safety you might be able to get the Fire Department and Police Departments on board as well. Plus this can come with the added benefit of news coverage. Get links from places like: Your city's website and major community news sourcesHow you can do it The first thing you need to do is figure out what type of event you want to host. Depending on the size of your town and the size of the event, it can be a big deal. I'm a bit of a event fanatic so for me it comes easy. Don't be afraid to start small though as long as you're creating and providing a productive resource for your community. Some potential ideas include: Trash Pickup Day - Host a trash pickup day where the meeting place is your business or you sponsor the bags. Toy Drop off for Needy Kids - Host a toy drive or drop off for kids in need. Seminar - Host a seminar in your area of expertise that will be the most beneficial to residents. If you like this idea then also try starting a meetup group (see #4 above). Step 1: Figure out the event type. Step 2: Get the town on board with the idea and schedule a date at least 60 days out. Step 3: Create the details page on your website with all pertinent event details. Step 4: Make sure it goes up on the town's website with your company event page linked. Step 5: Promote the heck out of it using the event promotion guide here. Pro tip 1: Invite local press to your event to cover it. Be sure to meet and greet them and get to know them. More on this later. Pro tip 2: Invite the local Boy Scouts or other community organizations as well. If their name is attached to the event, you might get more exposure and more link opportunities. #6 Sponsor or donate to a local club or organization Sponsorship links can be a slippery slope, but there's also a place for them. Over the years I have given back to a number of causes I support and have been an active member in charities and nonprofit organizations. Chances are you or someone you know is a part of one right now. There are a lot of clubs in almost any community. Have you ever heard of the Rotary Club, Kiwanis, Lions Club, etc. These are commonly found in many communities and they typically have state, district, or chapter websites. Below is a quick example I pulled from the Los Angeles Rotary Club sponsors webpage: But don't stop there. While the major clubs are popular, there are also a lot of other potential sponsorship causes and organizations. This is commonly touched on so I'm not going to go into too much detail, but here are some easy search stings you can use to find some opportunities. \"city inurl:sponsors\" (Example: Los Angeles inurl:sponsors) \"city inurl:sponsor\" (Example: Los Angeles inurl:sponsor) \"city intitle:sponsors\" (Example: Los Angeles intitle:sponsors) keyword donations (Example: Safety donations) After you have explored these opportunities simply reach out to the organizers and see what type of commitment they're looking for. Pro tip: Don't be afraid to promote your sponsorship. If you're giving to a good cause, let the community know! #7 Student, teacher, and alumni discounts If you've done link building research you may have heard of the university discount link building where you can offer a discount to the students and faculty of a university. That has a place and it might be a good place for local links if you have a university nearby. But did you realize there are other student discount opportunities as well? Typically when I look for opportunities locally I open my eyes a little wider and look for other opportunities like: K-12 Schools. These can be goldmines and aren't really talked about much. Organization discounts. Organizations have students too. Take the Colorado Symphony for example. Alumni discounts. Sometimes these organizations also offer alumni listings for free. Get links from places like: Organizations, schools, K-12 schools, educational websitesHow you can do it This is another scenario where we will turn to Google and seek opportunities: site:.org \"student discounts\" - Looks for organizations that offer student discounts site:.org \"high school\"+\"student Discount\" - Checks for offers available to high school students site:.edu \"staff discounts\" - Searches .edu domains for staff discounts (colleges and universities) site:.edu \"student discounts\" - Searches .edu domains for student discounts (colleges and universities) Pro tip: Don't be afraid to add geo modifiers. Remember that anything in \"\" will search exactly so plurals should be searched separately. #8 Create and promote a local resource So you want to send good local link signals and showcase you're the expert of a local area? What better way than to create a community resource page on your website? Not only will it attract potential links with the proper marketing, it's also going to show that you're the expert in your area. The good thing about creating a local resource is that you or the local operator running that location probably already has a good idea about the city in general. Even if they're not the most familiar with the area, some research can solve that. Get links from places like: Hotels, travel websites, news organizationsHow you can do it Start by coming up with a list of ideas. Locally-based ideas can vary greatly. Here are a few to helps the mice turn the wheel: Best of Local Guides - Best restaurants in the city or county, top bars, top microbreweries (I like beer, OK), top city attractions, top things for singles, top things for families, a perfect day trip for families, etc. Local Calendar Creation - Create a local calendar of popular events by topic. High school football calendars, movie premiere dates, HOA meetings, and more. Once you have the idea, you can move onto the creation of the asset. Notice my use of the word asset. If I'm going to spend the time to create this piece, I want to make sure it's a linkable asset. That means that it should be substantial and also look great. If the content is weak, you're going to get a weak appeal. Once you have built your guide, the real key is promoting it and getting the exposure you need. Make sure to share it with relevant audiences such as Facebook and Google Plus groups. If there are town groups such as \"You know you grew up in CITY, when...\" those might be a good place to promote your resource. Figure out where your community members hang out and post it there. Sometimes even city or town run pages will be willing to post or promote your piece. This is just another reason why you need to create a quality piece of content and not just do the bare minimum. #9 Get manufacturer and wholesaler links This is an easy one that is often overlooked by small businesses. If you operate a retail business or sell a product that somebody else manufactures, then you have a link opportunity. Many product manufacturers want to show their customers where to buy their products. This might be a store locator or it could just be an authorized reseller list. Either way you need to take advantage of it. This is an opportunity that even local businesses can take advantage of quickly. One of the reasons we have extensive client intake forms is to address this issue. A lot of times clients will say that they're listed without actually knowing. It's best to find out for yourself by getting a complete list of all manufacturers they represent. If they have a website you can get a link. Get links from places like: Larger manufacturing companiesHow you can do it Even small stores might represent products from 100+ different manufacturers. Even if they don't buy manufacturer direct they can still get a link from the manufacturer just by asking. Step 1: Create a list of all of the brands the client carries and whether they buy direct or from a wholesaler. Step 2: Visit each manufacturer and distributor website. Find out if they have a store locator or somewhere where they list where you can buy their products. Step 3: Reach out to those that do from a company email address including all pertinent information (include NAP!) and the link to your website or store location. Step 4: For those who don't list this information, outreach to them and ask them if they are willing to set it up. After all it will only help you both sell more products. Pro tip: Some websites will only display your Name, Address, Phone Number. But if they don't link to you don't be afraid to ask. A lot of times they can make the change and add your link. #10 Build relationships with local influencers If you want to earn links that will really set you apart from the rest of the herd, you need to start thinking about building actual relationships with influencers. Finding influencers and getting connected can be hard; you have to be real while doing it. These people can range from your local competition, to politicians, to journalists. Finding and connecting with them requires some work, but it's worth the payoff. Get links from places like: Niche publications, your competition's website, local news media, government websitesHow you can do it The reality is, while some of this research and networking can be done online, at some point, you're going to have to get out of your office and interact with real humans! For our example, let's look at how we might go about forming a relationship with a member of the local media. First off you will want to find a list of press associations in your area. This might be city based or state based. The easiest way to look for these is just to search for them in Google by typing in your state name + press association or press organization. Once you have the list of the organization(s) you want to work with, check out their membership fees but more importantly their events and conferences. These are the real goldmines. Many of these organizations have an annual conference or event that you can attend. This is where you can usually expect to meet the people with the most connections. It's important to speak with them in person, exchange contact information, and express your willingness to contribute. If you have an intriguing idea for a specific writer, for example, someone who always writes about tech news, you may be able to pitch a problem you see in your industry that exposes consumers. Your job is to figure out what interests them and offer to help in any way. #11 Leverage business relationships In many cases small businesses may already have complementary businesses that might be willing to give a link to your website. In fact, it might make sense from a referral standpoint too. If you use or refer your business to another type of business this is a great opportunity. Get links from places like: Other business websites How you can do this Getting these opportunities are as easy as curating the list and doing the outreach. Here are some examples for different business types: Attorneys can get links from: Process servers, investigators, and other services they refer business to Mortgage Brokers can link to recommended realtors and vice-versa Doctors can get links from schools (emergency clinic references), insurance companies, and other doctors. Another way to go about this is to approach like-minded companies that offer services you don't and you don't plan on offering. For example if you're a greeting card store you might be able to get links from gift stores.Conclusion Although good link building takes time, thought, and a good amount of effort, it's easy enough that anyone can do it. With so many different options and ways you can earn links, this is just a small sample that you can use to start gaining new ones today. Please feel free to share your favorite link building tips. The more the better! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "11 Ways for Local Businesses to Get Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "11 Ways for Local Businesses to Get Links"
    },
    {
      "level": "H2",
      "text": "Who should care about local link building?"
    },
    {
      "level": "H2",
      "text": "About these links"
    },
    {
      "level": "H2",
      "text": "How do you define a good link?"
    },
    {
      "level": "H2",
      "text": "#1 Create controversy and get in the news"
    },
    {
      "level": "H3",
      "text": "Using this method you can get links from places like:"
    },
    {
      "level": "H3",
      "text": "Actual case study"
    },
    {
      "level": "H3",
      "text": "How you can do this"
    },
    {
      "level": "H2",
      "text": "#2 Easily get contest nomination links"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#3 Get eco-friendly links"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#4 Sponsor a meetup group"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#5 Host a community event"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#6 Sponsor or donate to a local club or organization"
    },
    {
      "level": "H2",
      "text": "#7 Student, teacher, and alumni discounts"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#8 Create and promote a local resource"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#9 Get manufacturer and wholesaler links"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#10 Build relationships with local influencers"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do it"
    },
    {
      "level": "H2",
      "text": "#11 Leverage business relationships"
    },
    {
      "level": "H3",
      "text": "Get links from places like:"
    },
    {
      "level": "H3",
      "text": "How you can do this"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Meraz\n          \n            Casey Meraz\n          \n            Casey Meraz"
}