{
  "url": "https://moz.com/blog/12-common-reasons-reconsideration-requests-fail",
  "slug": "12-common-reasons-reconsideration-requests-fail",
  "title": "12 Common Reasons Reconsideration Requests Fail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting a Google penalty lifted can be an arduous, painful process, even for the most skilled SEOs and webmasters. However, some of the most common pitfalls are easy to avoid.",
  "content": "12 Common Reasons Reconsideration Requests Fail Link Building | Advanced SEO By: Modestos Siotos January 7, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Modestos Siotos January 7, 2015 12 Common Reasons Reconsideration Requests Fail Link Building | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There are several reasons a reconsideration request might fail. But some of the most common mistakes site owners and inexperienced SEOs make when trying to lift a link-related Google penalty are entirely avoidable. Here’s a list of the top 12 most common mistakes made when submitting reconsideration requests, and how you can prevent them.1. Insufficient link data This is one of the most common reasons why reconsideration requests fail. This mistake is readily evident each time a reconsideration request gets rejected and the example URLs provided by Google are unknown to the webmaster. Relying only on Webmaster Tools data isn’t enough, as Google has repeatedly said. You need to combine data from as many different sources as possible. A good starting point is to collate backlink data, at the very least: Google Webmaster Tools (both latest and sample links) Bing Webmaster Tools Majestic SEO (Fresh Index) Ahrefs Open Site Explorer If you use any toxic link-detection services (e.g., Linkrisk and Link Detox), then you need to take a few precautions to ensure the following: They are 100% transparent about their backlink data sources They have imported all backlink data You can upload your own backlink data (e.g., Webmaster Tools) without any limitationsIf you work on large websites that have tons of backlinks, most of these automated services are very likely used to process just a fraction of the links, unless you pay for one of their premium packages. If you have direct access to the above data sources, it's worthwhile to download all backlink data, then manually upload it into your tool of choice for processing. This is the only way to have full visibility over the backlink data that has to be analyzed and reviewed later. Starting with an incomplete data set at this early (yet crucial) stage could seriously hinder the outcome of your reconsideration request.2. Missing vital legacy information The more you know about a site’s history and past activities, the better. You need to find out (a) which pages were targeted in the past as part of link building campaigns, (b) which keywords were the primary focus and (c) the link building tactics that were scaled (or abused) most frequently. Knowing enough about a site's past activities, before it was penalized, can help you home in on the actual causes of the penalty. Also, collect as much information as possible from the site owners.3. Misjudgement Misreading your current situation can lead to wrong decisions. One common mistake is to treat the example URLs provided by Google as gospel and try to identify only links with the same patterns. Google provides a very small number of examples of unnatural links. Often, these examples are the most obvious and straightforward ones. However, you should look beyond these examples to fully address the issues and take the necessary actions against all types of unnatural links. Google is very clear on the matter: “Please correct or remove all inorganic links, not limited to the samples provided above.” Another common area of bad judgement is the inability to correctly identify unnatural links. This is a skill that requires years of experience in link auditing, as well as link building. Removing the wrong links won't lift the penalty, and may also result in further ranking drops and loss of traffic. You must remove the right links.4. Blind reliance on tools There are numerous unnatural link-detection tools available on the market, and over the years I've had the chance to try out most (if not all) of them. Because (and without any exception) I’ve found them all very ineffective and inaccurate, I do not rely on any such tools for my day-to-day work. In some cases, a lot of the reported \"high risk\" links were 100% natural links, and in others, numerous toxic links were completely missed. If you have to manually review all the links to discover the unnatural ones, ensuring you don't accidentally remove any natural ones, it makes no sense to pay for tools. If you solely rely on automated tools to identify the unnatural links, you will need a miracle for your reconsideration request to be successful. The only tool you really need is a powerful backlink crawler that can accurately report the current link status of each URL you have collected. You should then manually review all currently active links and decide which ones to remove. I could write an entire book on the numerous flaws and bugs I have come across each time I've tried some of the most popular link auditing tools. A lot of these issues can be detrimental to the outcome of the reconsideration request. I have seen many reconsiderations request fail because of this. If Google cannot algorithmically identify all unnatural links and must operate entire teams of humans to review the sites (and their links), you shouldn't trust a $99/month service to identify the unnatural links. If you have an in-depth understanding of Google's link schemes, you can build your own process to prioritize which links are more likely to be unnatural, as I described in this post (see sections 7 & 8). In an ideal world, you should manually review every single link pointing to your site. Where this isn’t possible (e.g., when dealing with an enormous numbers of links or resources are unavailable), you should at least focus on the links that have the more \"unnatural\" signals and manually review them.5. Not looking beyond direct links When trying to lift a link-related penalty, you need to look into all the links that may be pointing to your site directly or indirectly. Such checks include reviewing all links pointing to other sites that have been redirected to your site, legacy URLs with external inbound links that have been internally redirected owned, and third-party sites that include cross-domain canonicals to your site. For sites that used to buy and redirect domains in order increase their rankings, the quickest solution is to get rid of the redirects. Both Majestic SEO and Ahrefs report redirects, but some manual digging usually reveals a lot more. 6. Not looking beyond the first link All major link intelligence tools, including Majestic SEO, Ahrefs and Open Site Explorer, report only the first link pointing to a given site when crawling a page. This means that, if you overly rely on automated tools to identify links with commercial keywords, the vast majority of them will only take into consideration the first link they discover on a page. If a page on the web links just once to your site, this is not big deal. But if there are multiple links, the tools will miss all but the first one. For example, if a page has five different links pointing to your site, and the first one includes a branded anchor text, these tools will just report the first link. Most of the link-auditing tools will in turn evaluate the link as \"natural\" and completely miss the other four links, some of which may contain manipulative anchor text. The more links that get missed this way the more likely your reconsideration request will fail.7. Going too thin Many SEOs and webmasters (still) feel uncomfortable with the idea of losing links. They cannot accept the idea of links that once helped their rankings are now being devalued, and must be removed. There is no point trying to save \"authoritative\", unnatural links out of fear of losing rankings. If the main objective is to lift the penalty, then all unnatural links need to be removed. Often, in the first reconsideration request, SEOs and site owners tend to go too thin, and in the subsequent attempts start cutting deeper. If you are already aware of the unnatural links pointing to your site, try to get rid of them from the very beginning. I have seen examples of unnatural links provided by Google on PR 9/DA 98 sites. Metrics do not matter when it comes to lifting a penalty. If a link is manipulative, it has to go. In any case, Google’s decision won’t be based only on the number of links that have been removed. Most important in the search giant's eyes are the quality of links still pointing to your site. If the remaining links are largely of low quality, the reconsideration request will almost certainly fail. 8. Insufficient effort to remove links Google wants to see a \"good faith\" effort to get as many links removed as possible. The higher the percentage of unnatural links removed, the better. Some agencies and SEO consultants tend to rely too much on the use of the disavow tool. However, this isn't a panacea, and should be used as a last resort for removing those links that are impossible to remove—after exhausting all possibilities to physically remove them via the time-consuming (yet necessary) outreach route. Google is very clear on this: Even if you're unable to remove all of the links that need to be removed, you must be able to demonstrate that you've made several attempts to have them removed, which can have a favorable impact on the outcome of the reconsideration request. Yes, in some cases it might be possible to have a penalty lifted simply by disavowing instead of removing the links, but these cases are rare and this strategy may backfire in the future. When I reached out to ex-googler Fili Wiese's for some advice on the value of removing the toxic links (instead of just disavowing them), his response was very straightforward: 9. Ineffective outreach Simply identifying the unnatural links won't get the penalty lifted unless a decent percentage of the links have been successfully removed. The more communication channels you try, the more likely it is that you reach the webmaster and get the links removed. Sending the same email hundreds or thousands of times is highly unlikely to result in a decent response rate. Trying to remove a link from a directory is very different from trying to get rid of a link appearing in a press release, so you should take a more targeted approach with a well-crafted, personalized email. Link removal request emails must be honest and to the point, or else they'll be ignored. Tracking the emails will also help in figuring out which messages have been read, which webmasters might be worth contacting again, or alert you of the need to try an alternative means of contacting webmasters. Creativity, too, can play a big part in the link removal process. For example, it might be necessary to use social media to reach the right contact. Again, don't trust automated emails or contact form harvesters. In some cases, these applications will pull in any email address they find on the crawled page (without any guarantee of who the information belongs to). In others, they will completely miss masked email addresses or those appearing in images. If you really want to see that the links are removed, outreach should be carried out by experienced outreach specialists. Unfortunately, there aren't any shortcuts to effective outreach.10. Quality issues and human errors All sorts of human errors can occur when filing a reconsideration request. The most common errors include submitting files that do not exist, files that do not open, files that contain incomplete data, and files that take too long to load. You need to triple-check that the files you are including in your reconsideration request are read-only, and that anyone with the URL can fully access them. Poor grammar and language is also bad practice, as it may be interpreted as \"poor effort.\" You should definitely get the reconsideration request proofread by a couple of people to be sure it is flawless. A poorly written reconsideration request can significantly hinder your overall efforts. Quality issues can also occur with the disavow file submission. Disavowing at the URL level isn't recommended because the link(s) you want to get rid of are often accessible to search engines via several URLs you may be unaware of. Therefore, it is strongly recommended that you disavow at the domain or sub-domain level.11. Insufficient evidence How does Google know you have done everything you claim in your reconsideration request? Because you have to prove each claim is valid, you need to document every single action you take, from sent emails and submitted forms, to social media nudges and phone calls. The more information you share with Google in your reconsideration request, the better. This is the exact wording from Google: “ ...we will also need to see good-faith efforts to remove a large portion of inorganic links from the web wherever possible.”12. Bad communication How you communicate your link cleanup efforts is as essential as the work you are expected to carry out. Not only do you need to explain the steps you've taken to address the issues, but you also need to share supportive information and detailed evidence. The reconsideration request is the only chance you have to communicate to Google which issues you have identified, and what you've done to address them. Being honest and transparent is vital for the success of the reconsideration request. There is absolutely no point using the space in a reconsideration request to argue with Google. Some of the unnatural links examples they share may not always be useful (e.g., URLs that include nofollow links, removed links, or even no links at all). But taking the argumentative approach veritably guarantees your request will be denied.Cropped from photo by Keith Allison, licensed under Creative Commons.Conclusion Getting a Google penalty lifted requires a good understanding of why you have been penalized, a flawless process and a great deal of hands-on work. Performing link audits for the purpose of lifting a penalty can be very challenging, and should only be carried out by experienced consultants. If you are not 100% sure you can take all the required actions, seek out expert help rather than looking for inexpensive (and ineffective) automated solutions. Otherwise, you will almost certainly end up wasting weeks or months of your precious time, and in the end, see your request denied. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "12 Common Reasons Reconsideration Requests Fail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "12 Common Reasons Reconsideration Requests Fail"
    },
    {
      "level": "H2",
      "text": "1. Insufficient link data"
    },
    {
      "level": "H2",
      "text": "2. Missing vital legacy information"
    },
    {
      "level": "H2",
      "text": "3. Misjudgement"
    },
    {
      "level": "H2",
      "text": "4. Blind reliance on tools"
    },
    {
      "level": "H2",
      "text": "5. Not looking beyond direct links"
    },
    {
      "level": "H2",
      "text": "6. Not looking beyond the first link"
    },
    {
      "level": "H2",
      "text": "7. Going too thin"
    },
    {
      "level": "H2",
      "text": "8. Insufficient effort to remove links"
    },
    {
      "level": "H2",
      "text": "9. Ineffective outreach"
    },
    {
      "level": "H2",
      "text": "10. Quality issues and human errors"
    },
    {
      "level": "H2",
      "text": "11. Insufficient evidence"
    },
    {
      "level": "H2",
      "text": "12. Bad communication"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Modestos Siotos\n          \n            Modestos Siotos\n          \n            Modestos Siotos"
}