{
  "url": "https://moz.com/blog/12-popular-browser-toolbars-reviewed-the-worthwhile-and-the-worthless",
  "slug": "12-popular-browser-toolbars-reviewed-the-worthwhile-and-the-worthless",
  "title": "14 Popular Browser Toolbars Reviewed - The Worthwhile and the Worthless - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight I wanted to look at one of the least-discussed, but most popular set of tools on the web - the browser toolbar. Although toolbars have been around since the mid-1990's, their most dominant era (from the late '90's-early 2000's) could be interpreted as being. I'm not convinced.\nObviously,…",
  "content": "14 Popular Browser Toolbars Reviewed - The Worthwhile and the Worthless SEO Tools By: Rand Fishkin January 18, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 18, 2008 14 Popular Browser Toolbars Reviewed - The Worthwhile and the Worthless SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight I wanted to look at one of the least-discussed, but most popular set of tools on the web - the browser toolbar. Although toolbars have been around since the mid-1990's, their most dominant era (from the late '90's-early 2000's) has been interpreted as a sign of the toolbar's demise. But rumors of the toolbar's death are, in my opinion, premature. While they may not have the penetration rates they once did, the number of toolbars on the market and the resurgence of open-source and non-search-based toolbars is breathing new life into the old (at least by web standards) medium. Obviously, web developers and Internet marketers of all stripes are still heavily invested in toolbar usage, particularly with the development of independent toolbars for Firefox. But, that doesn't necessarily mean we should ignore the rest. Below, I've given a rough overview of the most popular toolbars on the web and their features; I've also given my personal opinions about the value of the plugins for both regular users and Internet professionals: The Google Toolbar - http://toolbar.google.com _ _ Features: Search bar with suggestions & history Links to news and other vertical search options at Google Ability to save pages to Google favorites PageRank indicator (optional at install) Pop-up blocker Spell check for forms (and auto-correction features) Autofill for forms (to automatically insert common personal information) Send-to feature (used to email, post to Google's Blogger platform, or send an SMS with a URL) Search highlighting of referral keywords Optional features also include the ability to use translate, vote on pages (unclear what Google does with this data), and add other vertical search and custom buttons Value to Ordinary Users: Medium I'm guessing the Google toolbar was much more valuable to the average user before the advent of built-in-browser search bars, but it still has some redeeming qualities. Certainly the popup blocker (though already built in to most modern browsers), spell check, auto-fill in for forms, and translation functions are engaging. The ability to highlight search phrases may be useful to some. Value to Web Professionals: Low Simple - the Google PageRank data can be an interesting signal if you know how to interpret it properly (and ignore it when necessary). However, with Firefox toolbars offering the same data alongside far more valuable features, it's unlikely to garner much interest from serious marketers or developers. The Yahoo! Toolbar - http://toolbar.yahoo.com _ _ Features: Search bar with suggestions & vertical search options Yahoo! Bookmarking Connection to Yahoo! Mail & My Yahoo! Direct Links to Yahoo! Answers & Yahoo! Games Anti-spy optional plugin Value to Ordinary Users: Low For those users who are heavy devotees of Yahoo!'s other services, the toolbar provides some fair value. For the majority, however, the features simply don't deliver. Yahoo! could almost certainly be more creative and innovative with the options in the toolbar, but it's barely changed since the late '90's. Plugins to Yahoo! properties like Del.icio.us, Upcoming, & Flickr aren't here, even in basic link format, and with no website or URL rating system (like Google's PageRank), it seems Yahoo! in content to let the toolbar stagnate. Value to Web Professionals: Low It's unlikely that any developer or web marketer is going to use the Yahoo! toolbar, unless they're heavily tied in to Yahoo!'s other services like Mail, My Yahoo!, Answers, etc. Even in this latter case, the buttons on the toolbar are little more than links, so a bookmark sidebar is probably more convenient. The only truly interesting piece of data is the search suggest information, but that can be found through Yahoo! search as well. I'm disappointed also to see no options for web marketers that would give a more plug-and-play data experience with Yahoo! Site Explorer - that's a big missed opportunity, IMO. The Microsoft Live Search Toolbar - http://live.toolbar.com _ _ Features: Search bar with suggestions and vertical search options (including some external properties) Direct news links to MSNBC sources Link to gallery for additional buttons and options Direct links to MSN portal content Search term highlighting and snapshot highlighting Maps links for addresses on a page Hotmail/Microsoft/Outlook Email link and sending options Windows Live Spaces blog/publish options Direct links to Live Messenger Value to Ordinary Users: Medium If you're a heavy user of Microsoft's online offerings, the Live toolbar offers a bit more than Yahoo! and interacts quite well with the browser and web pages. I was impressed not only with the aesthetic fit (and low impact on the browser itself), but the relative usability of the various buttons (which could simply be personal preference). Once again, however, the primary features of the toolbar interact primarily with Microsoft products and Microsoft properties on the web. There's nothing revolutionary here, nor is there anything one can't live without. Value to Web Professionals: Low The toolbar is nearly useless to web professionals, who are very unlikely to be consumers of a majority of Microsoft's online offerings and services (with the possible exception of their popular email). Disappointingly, there's no interfacing with Live.com's webmaster tools or data, either. The Ask.com Toolbar - http://toolbar.ask.com _ _ Features: Search bar (no suggest tools, though) Search term highlighting News search & news links Resize content Weather link Pop-up blocker Maps links Shopping links Links to \"MyStuff\" at Ask.com Additional buttons available with customization Value to Ordinary Users: Medium This might actually be my favorite of the search toolbars if it only had a strong search suggest function. I think that for ordinary users (I'm envisioning people like my father and grandparents), the links are relevant, useful, and functional. I'm a big fan of the resize button in particular, and the direct link to weather, maps, and news, though available in other toolbars (weather can be added as a custom button in Google, Yahoo!, and Live), is a nice feature. Ask's web interface for the toolbar is also the best designed of the bunch, with a better user experience than even Google's (at least from a simplicity perspective). Value to Web Professionals: Low As with Live, there's virtually nothing here that would interest developers or marketers. Interfacing with Bloglines, webmaster commands, or offering Page Rank-like data (after all, what does Ask realistically have to lose) would certainly make it more appealing. The AOL Toolbar - http://toolbar.aol.com _ _ _ Features: Search bar with vertical search options Direct links to AOL mail, Instant Messenger (AIM), AOL Games, & weather MapQuest address and directions plug-and-play feature Customizable buttons links My Favorite - the Surfometer! Value to Ordinary Users: Medium I went in expecting to be disappointed and was pleasantly surprised. If you're an AOL user, the toolbar is probably a very good fit (tying in AIM & AOL mail directly), and the interface with MapQuest, weather, news, and other links is solid, too. Surprisingly, there's a ton of button options and an easy-to-use gallery for setting them up. Of course, my favorite part is the built-in \"Surfometer,\" which monitors your web page views over time and reports them to you - even offering ranks as your surfing grows. Honestly, if they added the ability to compare yourself against other surfers and charted your visit habits by the sites and verticals you browse, I think I'd be in love, but then again, I'm a total geek :) Value to Web Professionals: Low If, like me, you really like the idea of the Surfometer, Google's desktop software actually does a better job. There's nothing else here that would particularly appeal to web pros, though the ease of customization options might make it slightly more attractive than some of the others. The Alexa Toolbar - http://toolbar.alexa.com _ _ Features: Search options with the major engines (and Alexa's internal search) Info bar on sites visited (as shown above - note that the information for SEOmoz is now 3 years old) Traffic rank and trend data (as indicated by the number and arrow direction) Related sites list Popup manager Direct links to Amazon & Archive.org Print button Value to Ordinary Users: Low The Alexa toolbar is designed to be a competitive information tool, and as such, offers virtually no functionality, other than the ability to get (highly inaccurate) website popularity data and contact information (which is also spurious) for the sites a user visits. It's too bad, because the value of Alexa's data lies in the number of people they can get to adopt their toolbar. The more ordinary and \"average\" those users are, the better Alexa's data will be, yet they really fail to serve this market effectively. Value to Web Professionals: Medium to High It's not for everyone, but for most web professionals, using the Alexa toolbar (and feeding data back to them through your usage) is valuable. This is true simply because very little usage of a website on a regular basis by just a few Alexa toolbar users is enough to propel its rankings. There are enough uninformed decision makers at businesses, ratings services, investment funds, and competitive firms who still trust Alexa data to make it worthwhile to game the system. In addition, the related sites data and site info can be useful for competitive intelligence (so long as they're taken with a relative grain of salt). The Compete.com Toolbar - http://tools.compete.com _ _ Features: Search options with major engines Direct links to Compete and MyCompete panel Trust rating Competitive data on the website(s) being browsed Pop-up of traffic profile for sites Direct link to any \"deals\" available on the site Value to Ordinary Users: Low to Medium The most compelling part of the Compete toolbar for ordinary users are the twofold offer of a highlighted \"deals\" button if special offers are available on the site (which worked well for me on sites like Amazon & Gap) and the \"trust\" stamp. It's probably not enough to get thousands of regular surfers flocking, but it's better than what Alexa's offering by a long shot. Value to Web Professionals: Medium to High Compete's data isn't fantastic, but in some cases it's a good deal better than Alexa (in others, it's just as bad or worse). However, since Compete's fast becoming a darling in the tech and media startup world, influencing the rankings even a little (and seeing what the competition is up to) isn't a bad choice. If Compete took the additional step that Alexa takes and listed related sites, it might be a bit more valuable, and certainly as their data pool grows, it's possible they'll improve in usefulness. The NetCraft Toolbar - http://toolbar.netcraft.com _ _ Features: Ability to report phishing sites Trust/risk rating metric Domain and business investigation links Competitive data (age, rank, site info, etc.) Direct links to Netcraft pages and services Value to Ordinary Users: Low to Medium Although the toolbar does offer some information designed to protect consumers, the phishing notification appears limited to financial sites. I visited a few domains that carry some nasty malware, pop-unders, etc., and they had high trust ratings from Netcraft. The ability to report phishing might be valuable, but unless you're consistently under the threat, Netcraft's probably not that useful and the lack of a built-in search bar seriously hampers it (though since Firefox and IE both have them now, it's not as important). Value to Web Professionals: Low to Medium The competitive intelligence data from Netcraft isn't terrific, but it's not completely useless. More valuable than the ranks and numbers are the links to investigate host data and site information. The StumbleUpon Toolbar - http://www.stumbleupon.com _ _ Features: Click \"Stumble\" to be taken to a random webpage that others have liked Choose verticals (images, videos, topics) to stumble exclusively through these Thumb up/down - share your opinion of a page with other stumblers Tag, review, and read reviews of pages Stumble through a single website (in case you want to find all the cool stuff on NPR or YouTube) Value to Ordinary Users: Medium to High StumbleUpon is some of the most fun you can have on the web, and the process of discovery, ability to rate, and possibility of finding amazing new stuff is irresistible. It could just be the curious cat in me, but everyone I've ever shown StumbleUpon to loves it. From concept to execution, it's one of the best applications around. No surprise, then, that SU has built an audience of 4+ million users and is one of the top traffic drivers for many social sites, blogs, and news domains. Value to Web Professionals: High If you're a marketer, developer, or designer, using StumbleUpon to submit your best content and to see what your peers have produced is essential. The traffic SU sends and the ability to get in front of some very savvy, potentially target-demographic eyeballs makes it a must-have. Search Status for Firefox Toolbar - http://www.quirk.biz/searchstatus/ _ _ Features: Actively displays PageRank & Alexa Rank in graphical format Shows Compete data (in the newer version) Enables highlighting of nofollow links Direct links to link reports, archive.org, whois, and other search reporting data (indexing & links) Pops up meta tags, robots.txt, and keyword density & repetition information Highlights keywords Value to Ordinary Users: Low Unless you know how to use the tools in the plugin, it's virtually useless. Average web surfers aren't going to find SearchStatus, and they won't be inclined to use it - there's simply no value. Value to Web Professionals: High Anyone in SEO, design, development, or website creation can benefit tremendously from this plugin. Not only are the Alexa, Compete, & PageRank data handy (though not always particularly useful), the quick links and nofollow highlighting are essential. You'll save yourself a considerable amount of time with this toolbar (note - it's only compatible on Firefox and leverages GreaseMonkey - there's no IE version). Microsoft Developer Toolbar - http://www.microsoft.com/downloads/details.aspx?familyid=e59c3964-672d-4511-bb3e-2d5e1db91038&displaylang=en _ _ Features: View & modify HTML elements on the fly Enable/disable code and images Inspect CSS properties Validate & cache code & pages Value to Ordinary Users: Low For 99% of the web surfing population, the toolbar carries no value whatsoever. If you aren't designing, developing or testing web pages, the toolbar's usefulness approaches zero. Value to Web Professionals: Low to High While there are some clever uses for the toolbar for marketers, particularly those who are familiar with HTML and CSS and who want to investigate or compare usage, the majority of this group probably won't get much value out of this toolbar. However, for developers (and designers and testers), the value is particularly high - IE often presents some difficult issues for CSS compatability, so having a toolbar like this in IE to examine tags and properties is essential. Web Developer Toolbar for Firefox - http://chrispederick.com/work/web-developer/ Features: View & modify HTML elements on the fly Enable/disable code and images Inspect CSS properties & disable/edit Make comments/notes on web pages (for later retrieval/viewing) DOM inspector Validate & cache code & pages Direct links to Speed Reports View/delete cookie & session information And numerous other developer-specific features Value to Ordinary Users: Low As with the Microsoft developer toolbar, almost none. Virtually no ordinary user will have any idea what to do with it. Value to Web Professionals: Low to High For web marketers, the value is somewhat limited (though, if you're HTML and CSS savvy, it can be an interesting tool for examining code and page structure). For developers, however, it's one of the perennial favorites - the full featured toolbar gives coders and designers access to an impressively wide array of features that makes examining, code-checking, and competitive dev intelligence a breeze. The toolbar was clearly designed with efficient building and editing in mind and it shows. Groowe Search Toolbar - http://groowe.com/ Features: Search multiple engines and vertical sources Get the Toolbar Functionality from Google, Yahoo!, Live, & Ask by rotating through Set preferences & add custom buttons & sources Value to Ordinary Users: Medium to High If you're a power searcher or simply want to have multiple toolbars without the massive visual space consumption, Groowe is a solid choice. There's a lot to like here, but you need to be someone who'll actually use the features, which many ordinary users might not. Still, of the search-focused toolbars, Groowe is certainly a standout. Value to Web Professionals: Low to High Depending on what you're doing as a marketer or developer, Groowe could be a boon or simply a replica of some features you've already got. The toolbar has a lot to offer, but again, it's going to be personal choice & habits that make it valuable. My feeling is that marketers, particularly search marketers, will find more value than developers, who probably don't need the extra search abilities on demand. Whew! We're all though. Well, except for the big finale - and what you've all been waiting for - one of the ugliest screenshots in history: _ _ Oh My God, It's Hideous! _ My questions would be: Which are your favorites? What would you want to see in an ideal toolbar (that no one currently offers)? Do you have privacy concerns about toolbar data (as with nearly all of the toolbars above, with just a couple extensions) sending data back to the issuing company (though many allow you to turn that partially or completely off)? p.s. Technically, this is only a smattering of the more popular toolbars on the web - there are hundreds, if not thousands of others for everything from Dogpile to Wikipedia to Web2.0/Social Media toolbars. UPDATE: At the request of some of the comments, I've added both Groowe and the Web Developer for Firefox to the list. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "14 Popular Browser Toolbars Reviewed - The Worthwhile and the Worthless"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "14 Popular Browser Toolbars Reviewed - The Worthwhile and the Worthless"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}