{
  "url": "https://moz.com/blog/13-ideas-for-interesting-engaging-and-just-plain-awesome-tweets-for-business",
  "slug": "13-ideas-for-interesting-engaging-and-just-plain-awesome-tweets-for-business",
  "title": "13 Ideas for Interesting, Engaging, and Just Plain Awesome Tweets for Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Using Twitter for business can be a lot of fun – but this doesn’t mean it’s always easy. Figuring out what to Tweet can be mind boggling, and it can be easy to fall into the trap of just Retweeting what other people are saying. Thankfully, if you think before you Tweet, it doesn’t have to be this…",
  "content": "13 Ideas for Interesting, Engaging, and Just Plain Awesome Tweets for Business Social Media By: AmyFowler50 November 30, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: AmyFowler50 November 30, 2012 13 Ideas for Interesting, Engaging, and Just Plain Awesome Tweets for Business Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Using Twitter for business can be a lot of fun – but this doesn’t mean it’s always easy. Figuring out what to Tweet can be mind boggling, and it can be easy to fall into the trap of just Retweeting what other people are saying. Thankfully, if you think before you Tweet, it doesn’t have to be this way. Before You Get Started: Before you go too crazy with your Tweets, make sure to think about, and create yourself an identity. What do you want to pop into peoples’ heads when they think of your Twitter feed? Are you going to be random and fun like Innocent? Informative and interesting like The Travel Channel? Or will you focus on securing customer loyalty with competitions and offers like Starbucks? Before you decide, think carefully about your brand and your target audience. You want your Tweets to reflect the ethos of your brand, in a way that won’t alienate your audience. Once you know who you want to be on Twitter and how you want to engage your audience, it’s time for the fun stuff – the Tweeting! Ask a Question: Yes I know; this is pretty obvious. You’re probably already doing it. You didn’t need me to tell you that a question makes a good Tweet. But – what are you asking and how are you asking it? Asking the right questions in the right way is the key to being engaging and encouraging engagement. Firstly, be brief. Both in the way you ask the question, and the sort of response you command. No one wants to spend ages analysing your question to figure out what the heck you’re getting at. In fact, not only will they not want to, but they just won’t bother. They also won’t want to spend ages coming up with an answer. Questions that require a one or two word answer are generally your best bet. Remember, this is Twitter. There’s almost always going to be a Tweet just around the corner that’s more interesting/funny/engaging than yours. You only have a second or two to capture someone’s interest. And, we only have 140 characters to play with, so this isn’t the time to be asking for essay answers. Secondly, remember the W’s – the what’s, where’s and why’s. What’s your favourite flavour of ice cream? Where was your first kiss? Why are there so many rules for asking a simple question? Retweet: Okay, despite my criticism of this (but then, you don’t only retweet, do you?), we love retweeting. It’s quick, easy, and requires almost no creative thinking on your part. You’ll also probably make somebody, somewhere, very happy. And it’s nice to make people happy. Start an Original Hashtag: Hashtags don’t have to be boring, and they don’t have to just be about your brand. Earlier this year hotel chain Best Western decided to adopt the use of the hashtag #cheerup. This was a great way to show that the brand cares without making the classic social-media-schoolboy-error of simultaneously saying, ‘LOOK AT US! AREN’T WE GREAT!” Getting your brand associated with and recognised for a cool and unusual hashtag is a fantastic way of creating a real social media buzz around your brand. Once you’ve chosen your hashtag, get it seen by subtly dropping it into Tweets at suitable moments. Don’t go overboard, or you might bore people before the tag really gets a chance to gain momentum. Look at the World Around You: And comment on it. Try to be funny though – it definitely helps. Some of my favourite Tweeters do just this. Take a look at the tweets of Sarah Linney, who always has an intelligent way of putting a comedic spin on the weird, wonderful and just plain annoying things in life. Andrew Nattan is definitely worth a look too. Okay, I realise these are personal rather than business Twitter accounts, but there’s no reason why this tactic can’t be used in the ‘corporate’ world of Twitter. It’ll help give your brand an identity, and make you look friendly and approachable. One tip though: when you’re Tweeting about the world around you, try to make sure that most people will be able to relate to the Tweet. You need to be social, and talking about something that only you find funny and/or can relate to, isn’t very sociable. Answer a Question: Needless to say, if a customer asks a question, you should answer it. However, if someone you follow asks something interesting that you can answer, take the time to respond. This is a great way to get noticed by someone you admire that you might be following, but isn’t following you back yet. There’s also potential for you to increase your following – if that person Tweets you back to say thanks, some of their followers will see it and if you’re lucky, they might decide to start following you. Offer Hints and Tips: Ideally tips related to your business – over time, this should help you to gain some momentum as an ‘authority’ and a go-to figure for your industry. Tweet a Link to a Video: This works even better if you’ve written and directed your blockbuster too. Make sure your video is either very informative or very entertaining. Ideally it should be both. The Travel Channel are masters at creating videos that tick both boxes, and they put an interesting spin on their media with videos such as ‘Tornado Safety Tips’ and ‘Avoid Blood-Sucking Beasts’ along with more obvious travel topics such as ‘Lost Luggage’ and advice on what to do when your flight gets cancelled. Or a Picture: Even though, thanks to the nature of the beast, images on Twitter aren’t half as effective as those on Facebook, a good image can still be worth Tweeting. Just make sure you include an enticing description of your picture – remember that people won’t be able to see the image while they browse Twitter, so you need to give them a very good reason to click on your link. Share a Joke: The more original, the better. However, if you can’t think of anything new, sharing an old classic can work too. There’s a great list here compiled of the ‘top 50 jokes’. My favourite: \"I said to the Gym instructor \"Can you teach me to do the splits?\" He said, \"How flexible are you?\" I said, \"I can't make Tuesdays\". Show Your Wisdom: We all need a little bit of inspiration sometimes, so sharing something thought-provoking not only makes for a great tweet but has a high chance of being retweeted too. Don’t believe that people like being inspired? Perhaps you’ll believe the 400,000+ followers of this Twitter account. Ask for Opinions: Something like; “Stuck for ideas for the office Christmas party – does anyone have a good one?” Or, “Big debate in the office: Domino’s or Pizza Hut. Help us out – which is your favourite?” If you can structure your question in a way that looks as if you genuinely need help, rather than like you’re just asking a question for the sake of it, then even better. Acknowledge Your Followers: Thank someone, wish somebody a happy birthday, announce a favourite follower, or give out some follow Fridays (#ff - top tip: might help if it’s Friday). Share Your Company News: Okay, this one’s so far down the list because while you should use Twitter to tell people what’s going on in your company, you shouldn’t go on, and on, about yourself. The only possibility of you getting away with this is if you’re a massive brand. But even then, you risk alienating your customer base if you don’t do something more interesting with your Tweets that tell people what your super amazing company is up to now. Written by Amy Fowler, an online marketing executive at UK based agency, Boom Online Marketing, and author of many posts on social media marketing including ’14 Awesome Ideas for Super Awesome Business Facebook Posts’ (are we seeing a pattern?) and ‘Five Ways You Will Lose Your Likes’. Want to know more? Don’t be shy! You can follow Amy on Twitter or, if you’ve not given up on Google just yet, add her to your Google Plus Circles. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "13 Ideas for Interesting, Engaging, and Just Plain Awesome Tweets for Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "13 Ideas for Interesting, Engaging, and Just Plain Awesome Tweets for Business"
    },
    {
      "level": "H2",
      "text": "Before You Get Started:"
    },
    {
      "level": "H2",
      "text": "Ask a Question:"
    },
    {
      "level": "H2",
      "text": "Retweet:"
    },
    {
      "level": "H2",
      "text": "Start an Original Hashtag:"
    },
    {
      "level": "H2",
      "text": "Look at the World Around You:"
    },
    {
      "level": "H2",
      "text": "Answer a Question:"
    },
    {
      "level": "H2",
      "text": "Offer Hints and Tips:"
    },
    {
      "level": "H2",
      "text": "Tweet a Link to a Video:"
    },
    {
      "level": "H2",
      "text": "Or a Picture:"
    },
    {
      "level": "H2",
      "text": "Share a Joke:"
    },
    {
      "level": "H2",
      "text": "Show Your Wisdom:"
    },
    {
      "level": "H2",
      "text": "Ask for Opinions:"
    },
    {
      "level": "H2",
      "text": "Share Your Company News:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "AmyFowler50\n          \n            AmyFowler50"
}