{
  "url": "https://moz.com/blog/13-questions-and-answers-about-google-site-speed-and-seo",
  "slug": "13-questions-and-answers-about-google-site-speed-and-seo",
  "title": "13 Questions (and Answers) About Google, Site Speed, and SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's been two years since Google announced that page speed is a factor in its search ranking, and one of the most-asked questions I still receive is: How exactly do they do it? The second-most-asked question I hear is: How much do I need to care about this?",
  "content": "13 Questions (and Answers) About Google, Site Speed, and SEO On-page SEO By: Joshua Bixby June 18, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Joshua Bixby June 18, 2012 13 Questions (and Answers) About Google, Site Speed, and SEO On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It's been two years since Google announced that page speed is a factor in its search ranking, and one of the most-asked questions I still receive is: How exactly do they do it? The second-most-asked question I hear is: How much do I need to care about this? No surprise, Google plays this card close to its enormous vest, so for the past two years I've done a fair bit of digging to get the answers. My company, Strangeloop Networks, has worked closely with folks at Google on a few projects, so I've fact-checked these to the best of my abilities with both Google employees and outside sources, but if you have new or contradictory information, let me know. 1. Does the Google search bot track page load time? A lot of people assume that Googlebot measures page load, but in fact, no, the bot has nothing to do with measuring speed. 2. Does Google use synthetic tests or real end user monitoring (RUM) to gather its data about page speed? I've heard speculation that Google uses tools like Page Speed to score sites' performance, but this isn't the case. Google uses real end-user monitoring (RUM) to check site speed. This is the right thing to do. They’re measuring from users’ actual web browsers and from real bandwidths — no simulations. 3. So how does Google gather real-world performance data? Google crowdsources page measurement, and the process is actually kind of nifty. If you use the Google toolbar with \"PageRank checking\" activated, then the toolbar measures the load time of every page you visit and sends the results back to the mothership. The results are then aggregated and used to determine real-world speed for each page. 4. What browsers does the Google toolbar use? The toolbar functionality is, as you would expect, already embedded in Chrome. The Google toolbar is also available as an add-on for Internet Explorer 6+. It used to be available for Firefox 2-4, but Google recently discontinued Firefox support, which has led to speculation that they have another plan for capturing this data from Firefox browsers; however, no other details have emerged. 5. What exactly does the Google toolbar measure? It measures \"onload time\": the time it takes for all page resources to render in the browser -- from resources you can see, such as text and images, to those you can't see, such as third-party analytics. (Geek definition: \"onload time\" is also known as \"document complete time\" or \"load time\".) There's a big caveat here: While onload time is an important measuring stick for performance, it needs to be taken with a grain of salt, because it isn't an indicator of when a page begins to be interactive. A page with a load time of 10 seconds can be almost fully interactive within 3 to 5 seconds. That's because onload time can be inflated by third-party content, such as the aforementioned third-party analytics, which users can't even see. Lesson learned: Even if your pages feel fast to you and your users, if they take a long time to get to onload, then according to Google they're slow. 6. What pages does Google measure? Google measure every page visited by users on your site. 7. What? Even pages I’ve marked as non-crawlable? That's right. Because the Google toolbar grabs all user-generated data via each participating user's browser, it allows Google to measure pages your users use, not what you have told Google is crawlable. 8. What if my page is personalized and has very different content for authenticated users, but the same URL? The Google toolbar makes no distinction between personalized content if the URL remains the same. All results are averaged together to determine the final score. 9. Does Google use its Google Analytics Site Speed feature to calculate load times into its search algorithm? Last year, Google added a new feature to Google Analytics that measures and reports real-world page speed to Analytics users who turn that feature on. Site Speed lets site owners know which pages are fastest and slowest, how page load time varies geographically, and how fast pages load for different browsers. You would think that all this data would be useful for factoring page speed into search ranking, but based on their silence on the subject, Google doesn't use any of the data collected in Google Analytics for this purpose. In my opinion they should, as it would allow them to sample more modern browsers. 10. Will preloading content on a page hurt my ranking? \"Preloading\" is a fantastic front-end optimization technique that we use in our FEO solutions at Strangeloop. It lets us constantly track and analyze how visitors use a site. Then, using this information, it predicts what pages people are most likely to visit next and then pushes page resources to the visitor's browser so they're waiting on standby before the visitor even clicks. Preloading is great because it gives the illusion of nigh-instantaneous page load, but site owners often ask me if it's a trick that Google will reject and possibly even penalize them for. The short answer is no. As I've mentioned above, Google's score is based on the onload time measurement. Preloading doesn't cheat the system. It simply improves your onload time. 11. Will deferring page resources help my rankings? \"Deferral\" is another excellent optimization technique. It allows you to defer non-essential page resources -- such as third-party scripts -- so that they load after the onload event. Deferral is an honest technique in Google's books. Anything that helps a page improve its onload time will improve that page's score. 12. Will having pages start render faster help my rankings? \"Start render time\" is different from \"onload time\". As its name suggests, \"start render\" indicates when content begins to display in the user's browser. While it can be measured, start render doesn't indicate whether the first content to populate the browser is useful or simply ads and widgets. Having said that, start render time is still a useful measurement because, over time, it gives good insight into the performance health of a page. This is neither here nor there, because, as I've already mentioned, Google doesn't factor it into its results, instead focusing exclusively on onload time. In my opinion, it would be great to augment Google's search algorithm with some way to benefit pages that start loading faster. 13. How much should I care about page speed? These answer the \"How do they do it?\" question. It's tougher to answer the \"How much should I care?\" question. I've read arguments that making pages faster did little to nothing to improve search ranking, and I've read case studies from companies that say they've made their pages faster and grown organic traffic anywhere between 20 and 40 percent. In my world, if you really care about SEO, you need to care about how fast your pages load. Speed may not be the most important ranking factor, but it's a factor nonetheless. As long as Google's search algorithm remains a mystery, you'll never know what type of optimization tipped your site from page 3 to page 1. For some sites, faster pages could be that tipping point. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "13 Questions (and Answers) About Google, Site Speed, and SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "13 Questions (and Answers) About Google, Site Speed, and SEO"
    },
    {
      "level": "H2",
      "text": "1. Does the Google search bot track page load time?"
    },
    {
      "level": "H2",
      "text": "2. Does Google use synthetic tests or real end user monitoring (RUM) to gather its data about page speed?"
    },
    {
      "level": "H2",
      "text": "3. So how does Google gather real-world performance data?"
    },
    {
      "level": "H2",
      "text": "4. What browsers does the Google toolbar use?"
    },
    {
      "level": "H2",
      "text": "5. What exactly does the Google toolbar measure?"
    },
    {
      "level": "H2",
      "text": "6. What pages does Google measure?"
    },
    {
      "level": "H2",
      "text": "7. What? Even pages I’ve marked as non-crawlable?"
    },
    {
      "level": "H2",
      "text": "8. What if my page is personalized and has very different content for authenticated users, but the same URL?"
    },
    {
      "level": "H2",
      "text": "9. Does Google use its Google Analytics Site Speed feature to calculate load times into its search algorithm?"
    },
    {
      "level": "H2",
      "text": "10. Will preloading content on a page hurt my ranking?"
    },
    {
      "level": "H2",
      "text": "11. Will deferring page resources help my rankings?"
    },
    {
      "level": "H2",
      "text": "12. Will having pages start render faster help my rankings?"
    },
    {
      "level": "H2",
      "text": "13. How much should I care about page speed?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joshua Bixby\n          \n            Joshua Bixby\n          \n            Joshua Bixby"
}