{
  "url": "https://moz.com/blog/19-seo-where-did-this-all-start",
  "slug": "19-seo-where-did-this-all-start",
  "title": "$19 SEO - Where did this all Start? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I noticed via my tracking this week that 15 people have found the SEOmoz blog by typing in $19 SEO at Google. I have to assume it's folks who've heard the pun and are curious about how this long running joke began, so I figured I'd provide an explanation (I've got another, cooler reason for…",
  "content": "$19 SEO - Where did this all Start? Public Relations By: Rand Fishkin January 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 26, 2006 $19 SEO - Where did this all Start? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I noticed via my tracking this week that 15 people have found the SEOmoz blog by typing in $19 SEO at Google. I have to assume it's folks who've heard the pun and are curious about how this long running joke began, so I figured I'd provide an explanation (I've got another, cooler reason for bringing it up, but we'll save that for later on). The $19 joke began in this old thread at SEOChat. Here's the gist of it: New User:Hi I'm new! I am wondering what I should charge for SEO??? Can anyone tell me?? Randfish:$19. That is the best possible amount to charge for SEO. Lots of Other Members:What?? Why $19?? Randfish:Sorry for that, I couldn't resist. Your pricing should be based on 3 things - your cost (which is to say how much you could be earning with your time if it were put towards another endeavor), your specialization (in this case, SEO, which is a relatively focused field, but not one in which it is exceptionally difficult to find willing help), and the demand for your services (if you are new to the field, you must neccessarily charge less than those who have a reputation and can therefore charge more).Best of luck! Cygnus:No one understands jokes anymore. Well, this little running tidbit made its way around the web. Note the 400+ references at forums and blogs across the SEO industry. In fact, we joked about it so much, it keeps coming up in comments, posts, threads and general industry banter. Well, Matt and I were trying to come up with something to pour our hearts and minds into for 3 months (in our 20% time) and decided that providing SEO service for $19 really was a noble goal. Thus, in just a few short weeks, we'll be introducing the SEOmoz TRA Tool (a cheesy acronym for Total Rankings Analysis). I can't reveal everything about it yet, but needless to say, you're going to get a lot of very cool data about your rankings, your competitors, your links and some onsite details (canonicalization issues, keyword usage, targeting, etc). We're pretty excited to be rolling out this system, and before we start charging $19, we'll be sending out some free trial codes to run it to SEOmoz blog readers. If you want to give it a test run when we put it in \"beta\", we'll be running a blog post in a few weeks and let folks leave comments if they want to receieve it. For now, if you've got any fantastic ideas for things you'd like TRA to analyze, drop them below. We're making some final adjustments and would love a few novel ideas to add value. Matt's gonna kill me, but here's a sneak peek, anyway: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "$19 SEO - Where did this all Start?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "$19 SEO - Where did this all Start?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}