{
  "url": "https://moz.com/blog/1993-canadian-report-on-the-internet",
  "slug": "1993-canadian-report-on-the-internet",
  "title": "1993 Canadian Report on \"The Internet\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Up here in the great white north, we have a national news agency called the Canadian Broadcasting Corporation or CBC for short.  Love or hate our national broadcaster, they certainly have some great archives.  I came across this 6 minute video clip and laughed my hockey playing butt off.  I am…",
  "content": "1993 Canadian Report on \"The Internet\" Moz News By: Adam Green July 13, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Adam Green July 13, 2007 1993 Canadian Report on \"The Internet\" Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. http://www.youtube.com/watch?v=1n4fDgmrF3o Up here in the great white north, we have a national news agency called the Canadian Broadcasting Corporation or CBC for short. Love or hate our national broadcaster, they certainly have some great archives. I came across this 6 minute video clip and laughed my hockey playing butt off. I am aware that this may be running the risk of being labelled a \"shallow blog post\" (full respect given to A.N.Onym and your last YouMoz post) but hopefully it will give you a good chuckle before your weekend. No, it doesn't really add much to the great SEO, PPC and general Internet Marketing discussion that we all know and love... but sometimes I have to laugh at how far our little \"Internet\" has come along. Some highlights from this news post: 1. The ominous rotating 286 from the stock video archives. 2. Peter Mansbridge's sweet looking brown suit 3. The way Peter Mansbridge says \"The Internet\" 4. Accessing the internet costs $200/year. 5. Computers have grown from being adding machines and type writers to \"tools of the human spirit\" 6. The explanation of \"emoticons\"... just tilt your head, you will get it. Things that are lacking in this video: 1. Somehow the reporter forgot to mention that \"the internet\" is a series of tubes. Enjoy, I know I did. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "1993 Canadian Report on \"The Internet\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "1993 Canadian Report on \"The Internet\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Green\n          \n            Adam Green\n          \n            Adam Green"
}