{
  "url": "https://moz.com/blog/2-become-1-merging-two-domains-made-us-an-seo-killing",
  "slug": "2-become-1-merging-two-domains-made-us-an-seo-killing",
  "title": "When 2 Become 1: How Merging Two Domains Made Us an SEO Killing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A story of recovery, despondency, occasional despair, and a pretty big gamble that paid off. This post details the why, the how, and the what of the things you might be able to gain from merging two significant domains into one unified site.",
  "content": "When 2 Become 1: How Merging Two Domains Made Us an SEO Killing Technical SEO W By: WPMU DEV December 30, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! W By: WPMU DEV December 30, 2013 When 2 Become 1: How Merging Two Domains Made Us an SEO Killing Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This is a story of recovery, despondency, occasional despair, and a pretty big gamble that paid off. It's the why, the how, and the what of the things you might be able to gain from merging two significant domains into one unified site. Regular Moz readers should recall WPMU.org from our fairly dramatic Penguin story from 2012 (tl;dr: the Penguin hit us hard, but then we recovered. It was pretty scary). But all ended remarkably well. After our initial recovery, things went from good to, well, better: Weekly organic traffic at WPMU.org took a nasty slug, and made a solid recovery. Parties all round at Incsub HQ. Hell yeah. Let's go hire a bunch of new writers, let's go wild, let's double this next year, etc. I imagine you can guess what happened next... Dear Search Lords, Why Hast Thou Forsaken Us So? Now, usually I'd be the first to see that and say something along the lines of, \"well guys, you're clearly doing it wrong.\" And in fact that's exactly what I thought, pretty much from day one, so we got bloody busy. Specifically, we: Hired some absolutely awesome and highly qualified new writers who took our standards up an absolute ton; Spent ages working out quality and style guidelines for copy and media, and followed them like subeditors who had tucked into wayyy too many cans of V; Brought in the best guest writers and paid them the best rates in a systematised editorial process; Dramatically increased our social and email presence and published stuff that generated it's own awesome links; Tried every on-site SEO tactic we could, killed duplicate content, limited and focused our categories and tags, and essentially gave Google everything that she wanted: really quality, fresh, and engaging content. And yet it was all for naught, we were, to put it mildly, in a hole. Going nowhere fast. We'd tried everything, pulled every string and ticked every box, we were doing stuff better than ever, but still we were failing. So, we figured, let's do something dramatic. Let's kill WPMU.org and merge it with her sister site WPMU DEV. This is where I get to insert the video, right? :) Awesome. Happy now. Moving on. Why on earth would you kill such a well-known site? It's a good question, and it's not one we arrived at lightly. Essentially though we were ready to take the punt for a bunch of different reasons, not the least of which being that seven months of declining organic results are enough to make anyone more risk-friendly than averse. But, more specifically: Latent penguin / penalty Issues Let's face it, clearly Google had some pretty serious issues with us, and just because we recovered so well from Penguin, that didn't mean we went off their radar, or the strategies we'd been employing (all white-hat, incidentally) weren't falling close to the boundary line. There was every reason to believe that a hex of some sort had been placed on wpmu.org. It was a monkey we just couldn't shift, and to stretch the metaphor a little, those kinda monkeys aren't in the trees, they're clinging firmly to you day after day. I always knew I'd get to use this image in a post one day We had to shake the chimpguin! Dilution to concentration, juice-wise Back in the day, I set up WPMU.org as an \"independent\" site, the main business being WPMU DEV (at the extraordinarily bad, and still bad, premium.wpmudev.org domain). Same, but different, kinda, look. It's complicated. And it has been that, we take no affiliate revenue, have no editorial agenda as regards any company outside of us and aim to give fair, balanced and decent coverage to all things WordPress. We're really trying to be the same as the Moz blog, for WordPress. But let's face it, it's WPMU DEV's blog, and more to the point, we were generating organic links and engagement with a site that wasn't our main business, while at the same time trying to do the same with WPMU DEV. It was a little nuts; both sites had thousands of unique domains linking to them, so they were both moderately powerful. Why on earth didn't we just merge them together, and have one super-powerful site rather than two middling-to-strong ones. Brand, brand, brand And last, but certainly not least, there's the small matter of Google and our brand... and if there's a primary lesson in this piece, this could well be it. Put simply, a search for 'wpmu' or 'wpmu.org' rendered a very different group of results to one for 'wpmu dev': Somebody's got the SEO right for one of these grabs... I wonder what the impact of all those high-quality and fresh posts could be along with the WPMU DEV brand? Hmmmmm. Technical time: merging two domains into one It's actually remarkably straightforward, here's how you go about it: First up, download and print this Moz infographic, and keep it by you at all times. Second, fire up Asana; this will be fabulously useful if you are on your own and even more so if there are a bunch of you. If there are a bunch of you, sit very close, or jump into a hangout, and (here we go)... Decide on the new URL. We moved wpmu.org to /blog/ on premium.wpmudev.org, so it was pretty easy to transfer our staging. (Oh yeah: Get a staging server too, or just set things up with a modified hosts file.) Dynamically (or manually, yawn) 301 everything, here's your complete guide to redirection Go through your dbase and theme files and replace every link via find and replace. (I.e. replace \"wpmu.org\" with \"premium.wpmudev.org/blog\".) Test the heck out of it. Give yourself at least a few hours to try pretty much every page (and make some user personas, too). Use Open Site Explorer to find the major links to your site, and email whoever wrote the articles or manages the site, asking them to change their links to the new site. Test some more. Go tell Google using Webmaster Tools (and Bing if you have some extra time). ;) Keep a good eye on things, and also run a Moz Analytics campaign on the new setup to pick up Crawl Diagnostics. Ask everyone you know to look at the new setup and find issues (they will). Fix them. Sit back and wait to see how well it works. So, how was it for us? I was expecting that we'd take a hit. Before the move I'd said that up to a 30% hit would be manageable; we could build back from that, and it was to be expected by the dilution of link juice coming from 301s. Anything more would be a big problem, but we'd battle through. Here's how it actually went: Before and after organic shots On the Monday before we picked up 10,371 organic visits. On the Monday following, 14,627. On the Tuesday prior, 10,458, and after, 14,546. The two days taken together were almost exactly 40% up. Not. Bad. :) However, we did note that there was no significant change in organic visits for non /blog/* results at WPMU DEV, in fact over the two days (mostly Tuesday) we saw a slight decline of around ~1000 visits (around 2.5% of the overall traffic, but around a 6% variation in the original WPMU DEV traffic), which might indicate that the whole \"concentrating juice on one domain\" theory might not be the right one. In conclusion From this experience we've learnt a bunch of stuff, which I'm going to try to summarize in three main areas. You can move and not lose, so move away A well-managed and carefully executed move from one domain to another, or in this case from one domain onto another, can clearly work well. This is super-important, because honestly, when I brought this up with most people prior to this venture they were very very dubious as to whether this could be pulled off without some serious collateral. When Google says that you can retain your ranking, it's true, you can. And then some. This may be a successful tactic to escape domain toxicity The lack of any positive organic bump in the root domain we moved to as /blog/ could indicate that the success of this domain move was not due to the amalgamation of link juice between the two sites, but could in fact be due to the content having escaped some negative/toxic algo penalties that wpmu.org had accrued as a root domain. However, Google is not stupid. You would expect that they would happily pass along the bad with the good on a 301, and it's often recommended you don't redirect (another thing that was making me nervous). Branding could be the single most important factor You don't need to be a multinational; having a relatively established brand like WPMU DEV is enough. Sure, we're no Moz, let alone a Pfizer, but it could be that moving content from a well-established site (but not brand) to our more-established position is literally worth a 40% bump. If so, the importance of building and managing a brand alongside your content strategies could well be top of your agenda. At least that's my takeaway... what's yours? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When 2 Become 1: How Merging Two Domains Made Us an SEO Killing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When 2 Become 1: How Merging Two Domains Made Us an SEO Killing"
    },
    {
      "level": "H2",
      "text": "Why on earth would you kill such a well-known site?"
    },
    {
      "level": "H3",
      "text": "Latent penguin / penalty Issues"
    },
    {
      "level": "H3",
      "text": "Dilution to concentration, juice-wise"
    },
    {
      "level": "H3",
      "text": "Brand, brand, brand"
    },
    {
      "level": "H2",
      "text": "Technical time: merging two domains into one"
    },
    {
      "level": "H2",
      "text": "So, how was it for us?"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H3",
      "text": "You can move and not lose, so move away"
    },
    {
      "level": "H3",
      "text": "This may be a successful tactic to escape domain toxicity"
    },
    {
      "level": "H3",
      "text": "Branding could be the single most important factor"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "WPMU DEV\n          \n            WPMU DEV\n          \n            WPMU DEV"
}