{
  "url": "https://moz.com/blog/20-minutes-to-mention-paid-links-ses-london-day-1-part-1",
  "slug": "20-minutes-to-mention-paid-links-ses-london-day-1-part-1",
  "title": "20 Minutes to Mention Paid Links: SES London Day 1, Part 1 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm attending the first day of SES London as an unofficial SEOmoz correspondent. Rather than providing a live-blogging \"he said; she said\" commentary Rand has asked me to provide overviews & analytic commentary; I'll certainly do my best, but if I end up talking about what I had for my lunch you'll…",
  "content": "20 Minutes to Mention Paid Links: SES London Day 1, Part 1 SEO Events C By: Ciaran Norris February 19, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris February 19, 2008 20 Minutes to Mention Paid Links: SES London Day 1, Part 1 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm attending the first day of SES London as an unofficial SEOmoz correspondent. Rather than providing a live-blogging \"he said; she said\" commentary, Rand has asked me to provide overviews & an analytic commentary. I'll certainly do my best, but if I end up talking about what I had for my lunch you'll know that Rand got the wrong guy for the job. The day got off to an interesting start when the registration people were unable to find my details. It turned out that this was because I was in their systems as Ciaran Norria, which makes me sound like a Columbian drug baron, but hey - it got me in, so I'll work with it. Session 1: Organic Listings Forum The first session of the day is the Organic Listings Forum, where attendees can chuck questions at a panel of experts. These include Dave Naylor, who does his normal act of playing the professional Northerner, which allows him to slightly hide his obvious intelligence & expertise behind a smokescreen of bluster, and Ralph Tegtmeier (aka Fantomaster), who, despite looking like the Unabomber's long lost brother, has a mind as sharp as a razor blade. What's interesting, and boring at the same time, is how the same sort of questions that come up at every one of these sessions come up again: Should multi-national clients use local TLDs? Yep. Do links need to be from authoritative sources? Yes, but it also depends. Can Dave Naylor rank for anything he wants? It seems as if that's the case. Is Google using research/espionage to uncover link-buying? Wouldn't you? What this means, other than that SES, SMX, & the other conferences all seem to have a healthy business model, is that despite the fact that most of this information is freely available on the web, people don't seem to fully believe it unless a real-live person confirms it. Having said that, I learned at least one thing, which is the link exploring tool offered by Majestic12.co.uk - let's hope that's not all that visitors get for their ticket price. One of the topics that was bound to crop up, and did, was that of links and whether or not to buy them. It's an interesting discussion and, unsurprisingly, generates a lot of heated opinions (of which Dave Naylor's comparison of paid links warnings to those warning of lung cancer on cigarette packets is particularly memorable). However, there isn't, as indeed there can't be, any real resolution to the discussion. We may not like Google's policy on this, but it seems unlikely that we're going to change it. As Steve Johnston, one of the other panelists, says: It's Google's policy - do with it what you will. Session 2: Mobile Local Search If vertical search has been the \"it's coming soon, honest\" topic of most search events over the last couple of years, I feel that mobile will take that position through 2008 (and if it doesn't, you're probably at the wrong event). The panel chair sets up the session by talking about how developments in products and systems (think iPhone and Android) make it almost inevitable that mobile search, and specifically mobile local search, will boom in the near future. My heart drops as the initial presentations are essentially supplier creds and what should be an absolutely fascinating subject threatens to be overwhelmed by sales pitches. Whilst the technologies that are likely to power mobile search are undoubtedly fascinating, personally I'm more interested in what these technologies actually mean, in terms of the way they are likely to impact on consumer behaviours and trends. Instead I hear the word 'solutions' bandied about at regular intervals. Luckily the discussion that follows proves to be much more interesting. One of things that comes out is the type of searches people are making on their mobiles. There are no massive surprises, showing that people tend to search for things they need right at the time that they're searching (taxis, restaurants, etc). What the data does do (even though it dates back to December 2006) is highlight the fact that if your business covers any of these areas, you need to be thinking about mobile search now. One speaker, Alexandre Gaschard of EDA, aims to spike the mobile Kool-Aid - hardly surprising when the business model he represents (directory assistance) threatens to be made redundant if mobile search truly takes off. He argues that the talk of the death of DA, and the explosion of mobile search, is in need of a reality check. He states that users aren't interested in the speed that mobile search offers (I'd disagree), that the UI of mobiles is still a long way off (fair enough, but that's changing very quickly), and that it's still easier to find someone's number using a DA service than search. I can accept parts of all these arguments, but when the fact that it's illegal to type on a mobile when driving in Holland (as it is in the UK) is used as a reason as to why mobile search won't take off, I wonder whether the DA business might not need a reality check as well. Surely if it's illegal to type, it's also illegal to dial? \"Ahh, but you can use voice dialing\" would, I imagine, be the response. But as we've said in the past, voice recognition systems could also push mobile search to a new level. And arguments that it's limited by the fact that mobile operators won't subsidise handsets capable of utilising the mobile internet highlights the fact that none of the speakers are from the UK; my phone (Nokia N73) was a free gift from my operator, I get unlimited data for a relatively small amount, and I really don't think I'm in the minority. I've written about this over at e-consultancy so I won't go over it all again here: suffice to say that it may not happen overnight, but the revolution is definitely happening. Ciaran is the SEO & Social Media Director of London based online marketing agency Altogether Digital. He loves a good conference and would be happy to speak at any you might be organising. Postscript from Rebecca: Part II of Ciarán's coverage of SES London, Analytics and the Future of Search, is currently up on YOUmoz. I didn't want to overwhelm the main blog with SES coverage. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "20 Minutes to Mention Paid Links: SES London Day 1, Part 1"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "20 Minutes to Mention Paid Links: SES London Day 1, Part 1"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}