{
  "url": "https://moz.com/blog/2009-a-good-year-for-one-person-thanks-to-seomoz",
  "slug": "2009-a-good-year-for-one-person-thanks-to-seomoz",
  "title": "2009 a Good Year for One Person Thanks to SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Well before 2009 my head was awash with misleading information reading SEO. I was reading PDF after PDF about SEO techniques and just thought to myself, \"Will these PDFs actually come in handy and be useful?\" 2009 came and I can now say no, except for one. This set came from SEOmoz.org. After…",
  "content": "2009 a Good Year for One Person Thanks to SEOmoz Public Relations O By: Oliver Bayes-Shelton March 11, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! O By: Oliver Bayes-Shelton March 11, 2009 2009 a Good Year for One Person Thanks to SEOmoz Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Well before 2009 my head was awash with misleading information reading SEO. I was reading PDF after PDF about SEO techniques and just thought to myself, \"Will these PDFs actually come in handy and be useful?\" 2009 came and I can now say no, except for one. This set came from SEOmoz.org. After reading all the articles on this great website, I built my own website, and this is my story. I have always had great knowledge of CSS and HTML but nothing about SEO. It has been a somewhat mysterious skill which I have also wanted to pick up. So I went about reading the articles on SEOmoz every day until I knew them like I knew the back of my hand. I then built my own site, which is www.seoandsmo.com. I followed the advice of getting a keyword-rich domain, which has proved to be most lucrative and the best $20 I have spent yet. I have locked myself in my room and started coding with the SEOmoz articles by hand and kept reading. I made unique data for each page, which was fun at times but very stressful. I then began to read many SEO blogs and picked up writing styles. I wrote my content to read as an SEO guide and then told the reader why they need to hire me. I did a whole load more SEO stuff and waited for 3 weeks. After that, I typed in 4 keyword strings and hey, presto! I rank 1st 3 times on page 1 and a few times on other pages. I would just like to say thank you to every one at SEOmoz for proving my thoughts. This site is the best portal for SEO and the PRO membership is well worth the money. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2009 a Good Year for One Person Thanks to SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2009 a Good Year for One Person Thanks to SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oliver Bayes-Shelton\n          \n            Oliver Bayes-Shelton"
}