{
  "url": "https://moz.com/blog/2010-seo-industry-survey",
  "slug": "2010-seo-industry-survey",
  "title": "Take the 2010 SEO Industry Survey; Your Peers Need You! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am very excited to announce that we have just put the finishing touches on our second SEO Industry Survey!  We ran our first industry survey in 2008, and learned and shared a lot about the SEO community. This survey follows up on a lot of questions we asked last time, but includes a greater focus…",
  "content": "Take the 2010 SEO Industry Survey; Your Peers Need You! Public Relations By: Rand Fishkin April 22, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 22, 2010 Take the 2010 SEO Industry Survey; Your Peers Need You! Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm very excited to announce that we have just put the finishing touches on our second, biennial SEO Industry Survey! We ran our first industry survey in 2008, and learned and shared a lot about the SEO community. This survey follows up on a lot of questions we asked last time, but includes a greater focus on other areas of organic search marketing as well. With this survey we hope to find out and share with the world: Who are the people in the SEO community? How do they learn about SEO and sharpen their skills? How are companies embracing search marketing? Which tools and tactics do people in the industry use to support their SEO and social media efforts? The survey only takes about 10 minutes, and we will again share the results once we've had time to work through the data. Prizes! As an added incentive, we are offering some cool prizes for people who completethe survey, including one 32G iPad! We are also giving away 3 Flip Mino HD Cameras and 10 people will win thier pick of brand new SEOmoz gear. [Obligitory legal disclaimer: Void where prohibited. See our official rules for all the details.] We will announce the winners of the sweepstakes by June 4th. Follow us on Twitter to stay up-to-date. A Look Back It will be interesting to see what has changed in the search marketing industry in the past two years. In fact, let's take a look at a few examples from the survey taken in 2008! Way back in 2008, people thought that Yahoo! was more likely to challenge Google than Microsoft. Nice guess, but, obviously we know now that's not accurate. Ask, Baidu, and Wikia all battled for third place in people's opinion. Check out this data about the use of nofollow. Since SMX Advanced last year when Matt Cutt's told us that nofollow no longer worked the way we thought for PageRank sculpting, I wonder if these numbers have changed? Share the Survey! The survey ends May 21, 2010 (about a month) so tell your friends in the industry about it. The more people that take the survey, the more interesting and valid the results we can share. Tweet it Share it on Facebook Partners Many thanks to our friends who are helping to promote the survey over the next month. It's important to get a broad audience from across the industry. Be sure to check them out: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Take the 2010 SEO Industry Survey; Your Peers Need You!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Take the 2010 SEO Industry Survey; Your Peers Need You!"
    },
    {
      "level": "H2",
      "text": "Prizes!"
    },
    {
      "level": "H2",
      "text": "A Look Back"
    },
    {
      "level": "H2",
      "text": "Share the Survey!"
    },
    {
      "level": "H2",
      "text": "Partners"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}