{
  "url": "https://moz.com/blog/2014-annual-report",
  "slug": "2014-annual-report",
  "title": "Moz's 2014 Annual Report - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The results are in, and 2014 showed significant improvement over 2013 for Moz. Check out our financials, community statistics, and more in this annual report card from our previous year.",
  "content": "Moz's 2014 Annual Report Moz News By: Sarah Bird April 22, 2015 Table of Contents Copied! By: Sarah Bird April 22, 2015 Moz's 2014 Annual Report Moz News Moz has a tradition of sharing its financials (check out 2012 and 2013 for funzies). It's an important part of TAGFEE.Why do we do it? Moz gets its strength from the community of marketers and entrepreneurs that support it. We celebrated 10 years of our community last October. In some ways, the purpose of this report is to give you an inside look into our company. It's one of many lenses that tell the story of Moz.Yep. I know. It's April. I'm not proud. Better late than never, right?I had a very long and extensive version of this post planned, something closer to last year's extravaganza. I finally had to admit to myself that I was letting the perfect become the enemy of the good (or at least the done). There was no way I could capture an entire year's worth of ups and downs—along with supporting data—in a single blog post.Without further ado, here's the meat-and-potatoes 2014 Year In Review (and here's an infographic with more statistics for your viewing pleasure!):Moz ended 2014 with $31.3 million in revenue. About $30 million was recurring revenue (mostly from subscriptions to Moz Pro and the API).Here's a breakdown of all our major revenue sources:Compared to previous years, 2014 was a much slower growth year. We knew very early that it was going to be a tough year because we started Q1 with negative growth. We worked very hard and successfully shifted the momentum back to increasingly positive quarterly growth rates. I'm proud of what we've accomplished so far. We still have a long ways to go to meet our potential, but we're on the path.In subscription businesses, If you start the year with negative or even slow growth it is very hard to have meaningful annual growth. All things being equal, you're better off having a bad quarter in Q4 than Q1. If you get a new customer in Q1, you usually earn revenue from that customer all year. If you get a new customer in Q4, it will barely make a dent in that year, although it should set you up nicely for the following year.We exited 2014 on a good flight path, which bodes well for 2015. We slammed right into some nasty billing system challenges in Q1 2015, but still managed to grow revenue 6.5%. Mad props to the team for shifting momentum last year and for digging into the billing system challenges we're experiencing now.We were very successful in becoming more efficient and managing costs in 2014. Our Cost of Revenue (COR), the cost of producing what we sell, fell by 30% to $8.2 million. These savings drove our gross profit margin up from 63% in 2013 to 74%.Our operating profit increased by 30%. Here's a breakdown of our major expenses (both operating expenses and COR):Total operating expenses (which don't include COR) clocked in at about $29.9 million this year.The efficiency gains positively impacted EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) by pushing it up 50% year over year. In 2013, EBITDA was -$4.5 million. We improved it to -$2.1 million in 2014. We're a VC-backed startup, so this was a planned loss.One of the most dramatic indicators of our improved efficiency in 2014 is the substantial decline in our consumption of cash.In 2014, we spent $1.5 million in cash. This was a planned burn, and is actually very impressive for a startup. In fact, we are intentionally increasing our burn, so we don't expect EBITDA and cash burn to look as good in 2015! Hopefully, though, you will see that revenue growth rate increase.Let's check in on some other Moz KPIs:At the end of 2014, we reported a little over 27,000 Pro users. When billing system issues hit in Q1 2015, we discovered some weird under- and over-reporting, so the number of subscribers was adjusted down by about ~450 after we scrubbed a bunch of inactive accounts out of the database. We expect accounts to stabilize and be more reliable now that we've fixed those issues.We launched Moz Local about a year ago. I'm amazed and thrilled that we were able to end the year managing 27,000 locations for a range of customers. We just recently took our baby steps into the UK, and we've got a bunch of great additional features planned. What an incredible launch year!We published over 300 posts combined on the Moz Blog and YouMoz. Nearly 20,000 people left comments. Well done, team!Our content and social efforts are paying off with a 26% year-over-year increase in organic search traffic.We continue to see good growth across many of our off-site communities, too:The team grew to 149 people last year. We're at ~37% women, which is nowhere near where I want it to be. We have a long way to go before the team reflects the diversity of the communities around us.Our paid, paid vacation perk is very popular with Mozzers, and why wouldn't it be? Everyone gets $3,000/year to use toward their vacations. In 2014, we spent over $420,000 to help our Mozzers take a break and get connected with matters most.Also, we're hiring! You'll have my undying gratitude if you send me your best software engineers. Help us, help you. ;) Last, but certainly not least, Mozzers continue to be generous (the 'G' in TAGFEE) and donate to the charities of their choice. In 2014, Mozzers donated $48k, and Moz added another $72k to increase the impact of their gifts. Combining those two figures, we donated $120k to causes our team members are passionate about. That's an average of $805 per employee!Mozzers are optimists with initiative. I think that's why they are so generous with their time and money to folks in need. They believe the world can be a better place if we act to change it.That's a wrap on 2014! A year with many ups and downs. Fortunately, Mozzers don't quit when things get hard. They embrace TAGFEE and lean into the challenge.Revenue is growing again. We're still operating very efficiently, and TAGFEE is strong. We're heads-down executing on some big projects that customers have been clamoring for. Thank you for sticking with us, and for inspiring us to make marketing better every day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz's 2014 Annual Report"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz's 2014 Annual Report"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}