{
  "url": "https://moz.com/blog/2015-online-marketing-industry-survey",
  "slug": "2015-online-marketing-industry-survey",
  "title": "​The 2015 Online Marketing Industry Survey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After sifting through more than 3,600 responses, we've painted a picture of the online marketing industry in 2015. Here's what we found.",
  "content": "​The 2015 Online Marketing Industry Survey Marketing Industry | Moz News By: Dr. Peter J. Meyers July 28, 2015 Table of Contents Copied! By: Dr. Peter J. Meyers July 28, 2015 ​The 2015 Online Marketing Industry Survey Marketing Industry | Moz News It's been another wild year in search marketing. Mobilegeddon crushed our Twitter streams, but not our dreams, and Matt Cutts stepped out of the spotlight to make way for an uncertain Google future. Pandas and Penguins continue to torment us, but most days, like anyone else, we were just trying to get the job done and earn a living. This year, over 3,600 brave souls, each one more intelligent and good-looking than the last, completed our survey. While the last survey was technically \"2014\", we collected data for it in late 2013, so the 2015 survey reflects about 18 months of industry changes. A few highlights Let's dig in. Almost half (49%) of our 2015 respondents involved in search marketing were in-house marketers. In-house teams still tend to be small – 71% of our in-house marketers reported only 1-3 people in their company being involved in search marketing at least quarter-time. These teams do have substantial influence, though, with 86% reporting that they were involved in purchasing decisions. Agency search marketers reported larger teams and more diverse responsibilities. More than one-third (36%) of agency marketers in our survey reported working with more than 20 clients in the previous year. Agencies covered a wide range of services, with the top 5 being: More than four-fifths (81%) of agency respondents reported providing both SEO and SEM services for clients. Please note that respondents could select more than one service/tool/etc., so the charts in this post will not add up to 100%. The vast majority of respondents (85%) reported being directly involved with content marketing, which was on par with 2014. Nearly two-thirds (66%) of agency content marketers reported \"Content for SEO purposes\" as their top activity, although \"Building Content Strategy\" came in a solid second at 44% of respondents. Top tools Where do we get such wonderful toys? We marketers love our tools, so let's take a look at the Top 10 tools across a range of categories. Please note that this survey was conducted here on Moz, and our audience certainly has a pro-Moz slant. Up first, here are the Top 10 SEO tools in our survey: Just like last time, Google Webmaster Tools (now \"Search Console\") leads the way. Moz Pro and Majestic slipped a little bit, and Firebug fell out of the Top 10. The core players remained fairly stable. Here are the Top 10 Content tools in our survey: Even with its uncertain future, Google Alerts continues to be widely used. There are a lot of newcomers to the content tools world, so year-over-year comparisons are tricky. Expect even more players in this market in the coming year. Following are our respondents' Top 10 analytics tools: For an industry that complains about Google so much, we sure do seem to love their stuff. Google Analytics dominates, crushing the enterprise players, at least in the mid-market. KISSmetrics gained solid ground (from the #10 spot last time), while home-brewed tools slipped a bit. CrazyEgg and WordPress Stats remain very popular since our last survey. Finally, here are the Top 10 social tools used by our respondents: Facebook Insights and Hootsuite retained the top spots from last year, but newcomer Twitter Analytics rocketed into the #3 position. LinkedIn Insights emerged as a strong contender, too. Overall usage of all social tools increased. Tweetdeck held the #6 spot in 2014, with 19% usage, but dropped to #10 this year, even bumping up slightly to 20%. Of course, digging into social tools naturally begs the question of which social networks are at the top of our lists. The Top 6 are unchanged since our last survey, and it's clear that the barriers to entry to compete with the big social networks are only getting higher. Instagram doubled its usage (from 11% of respondents last time), but this still wasn't enough to overtake Pinterest. Reddit and Quora saw steady growth, and StumbleUpon slipped out of the Top 10. Top activities So, what exactly do we do with these tools and all of our time? Across all online marketers in our survey, the Top 5 activities were: For in-house marketers, \"Site Audits\" dropped to the #6 position and \"Brand Strategy\" jumped up to the #3 spot. Naturally, in-house marketers have more resources to focus on strategy. For agencies and consultants, \"Site Audits\" bumped up to #2, and \"Managing People\" pushed down social media to take the #5 position. Larger agency teams require more traditional people wrangling. Here's a much more detailed breakdown of how we spend our time in 2015: In terms of overall demand for services, the Top 5 winners (calculated by % reporting increase - % reporting decrease were): Demand for CRO is growing at a steady clip, but analytics still leads the way. Both \"Content Creation\" (#2) and \"Content Curation\" (#6) showed solid demand increases. Some categories reported both gains and losses – 30% of respondents reported increased demand for \"Link Building\", while 20% reported decreased demand. Similarly, 20% reported increased demand for \"Link Removal\", while almost as many (17%) reported decreased demand. This may be a result of overall demand shifts, or it may represent more specialization by agencies and consultants. What's in store for 2016? It's clear that our job as online marketers is becoming more diverse, more challenging, and more strategic. We have to have a command of a wide array of tools and tactics, and that's not going to slow down any time soon. On the bright side, companies are more aware of what we do, and they're more willing to spend the money to have it done. Our evolution has barely begun as an industry, and you can expect more changes and growth in the coming year. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "​The 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "​The 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H2",
      "text": "A few highlights"
    },
    {
      "level": "H2",
      "text": "Top tools"
    },
    {
      "level": "H2",
      "text": "Top activities"
    },
    {
      "level": "H2",
      "text": "What's in store for 2016?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}