{
  "url": "https://moz.com/blog/2019-mozcon-videos",
  "slug": "2019-mozcon-videos",
  "title": "Get the Bingeable & Shareable MozCon 2019 Video Bundle! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "MozCon 2019 is over, but the experience lives on in the video bundle. Get access to all 27 presentations from this year’s event for you and your team.",
  "content": "Get the Bingeable & Shareable MozCon 2019 Video Bundle! Advanced SEO | Moz News | SEO Events By: Felicia Crawford October 30, 2019 Table of Contents Copied! By: Felicia Crawford October 30, 2019 Get the Bingeable & Shareable MozCon 2019 Video Bundle! Advanced SEO | Moz News | SEO Events MozCon 2019 was an absolute blast. There were endless snacks. There were Roger hugs. There were networking opportunities and Birds of a Feather tables and search epiphanies galore. And there were a ton of folks in our community who watched it all unfold from the perspective of a Twitter hashtag — fun to follow along with, but not quite the same impact as seeing the talks unfold in real-time. If you're still wishing you could've joined us in Seattle this past July, you’ll be happy to know that you can recreate the MozCon experience from the comfort of your home or office (or your home office, but hopefully not your office-home — seriously, Karen, the quarterly reports will still be there in the morning!). Yep, you got it: the MozCon 2019 Video Bundle is available for your purchasing and viewing pleasure! Get the MozCon 2019 video bundle Tell me about the video bundle! For those of you who attended in-person, good news: you've already got access! The video bundle is always included in the price of your MozCon ticket, so you can relive your three jam-packed days of learning as many times as you want — and if you aren't too bummed that they already made you share your MozCon swag with them, be sure to share the vids with your team! For the rest of us, the video bundle lets us enjoy the presentations at our own pace. It's condensed MozCon-caliber information in a neat, on-demand package that you can — have we mentioned this? — share with your team. Seriously, we think they'll like it. We were humbled to host some of the very brightest minds in SEO and digital marketing on our stage. With topics ranging from content marketing to technical SEO, PPC to local SEO, and just about everything in between, there are presentations to inspire just about any role in marketing (and your web dev just might be interested in a few talks, too). What's covered in the videos: The Golden Age of Search, Sarah BirdWeb Search 2019: The Essential Data Marketers Need, Rand FishkinHuman > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents, Ruth Burr ReedyImproved Reporting & Analytics Within Google Tools, Dana DiTomasoLocal Market Analytics: The Challenges and Opportunities, Rob BucciKeywords Aren't Enough: How to Uncover Content Ideas Worth Chasing, Ross SimmondsHow to Supercharge Link Building with a Digital PR Newsroom, Shannon McGuirkFrom Zero to Local Ranking Hero, Darren ShawEsse Quam Videri: When Faking it is Harder than Making It, Russ JonesBuilding a Discoverability Powerhouse: Lessons From Merging an Organic, Paid, & Content Practice, Heather PhysiocBrand Is King: How to Rule in the New Era of Local Search, Mary BowlingMaking Memories: Creating Content People Remember, Casie Gillette20 Years in Search & I Don't Trust My Gut or Google, Wil ReynoldsSuper-Practical Tips for Improving Your Site's E-A-T, Marie HaynesFixing the Indexability Challenge: A Data-Based Framework, Areej AbuAliWhat Voice Means for Search Marketers: Top Findings from the 2019 Report, Christi OlsonRedefining Technical SEO, Paul ShapiroHow Many Words Is a Question Worth?, Dr. Peter J. MeyersFraggles, Mobile-First Indexing, & the SERP of the Future, Cindy KrumKiller E-commerce CRO and UX Wins Using A SEO Crawler, Luke CarthyContent, Rankings, and Lead Generation: A Breakdown of the 1% Content Strategy, Andy CrestodinaRunning Your Own SEO Tests: Why It Matters & How to Do It Right, Rob OusbeyDark Helmet's Guide to Local Domination with Google Posts and Q&A, Greg GiffordHow to Audit for Inclusive Content, Emily Triplett LentzImage & Visual Search Optimization Opportunities, Joelle IrvineFactors that Affect the Local Algorithm that Don't Impact Organic, Joy HawkinsFeatured Snippets: Essentials to Know & How to Target, Britney Muller What you’ll get: For just $299, you'll get all of the MozCon education and inspiration with none of the air travel or traffic. The bundle includes: 27 full-length presentation videos chock full of leading SEO innovations, thought leadership, and tips & tricksInstant downloads and streaming to your computer, tablet, or mobile deviceDownloadable slide decks for all presentations If we could include a download of a Top Pot doughnut and some piping hot Starbucks, we would in a heartbeat. Alas, they don't have the technology for that... yet. Free preview - Running Your Own SEO Tests: Why It Matters & How to Do It Right by Rob Ousbey Speaking of doughnuts, we wouldn't expect you to buy a dozen sweet treats without taking a little taste first to see if you like 'em. It's important to know that your doughnuts are both delicious, shareable, and relevant to your everyday work as an SEO — almost exactly like the MozCon video bundle. And just like the feeling of warmth and goodwill you receive when you come back to the office with a fragrant baker's dozen, your teammates will thank you when you've got twenty-seven highly actionable talks to share with them — presentations that'll hone your skills and level up your understanding of modern SEO and digital marketing. That's why we've released a talk we're super proud of as your free preview of all the juicy goodness you can look forward to in the video bundle: Running Your Own SEO Tests: Why It Matters & How to Do It Right, presented by our very own Rob Ousbey. Google's algorithms have undergone significant changes in recent years. Traditional ranking signals don't hold the same sway they used to, and they're being usurped by factors like UX and brand that are becoming more important than ever before. What's an SEO to do? The answer lies in testing. Sharing original data and results from clients, Rob highlights the necessity of testing, learning, and iterating your work, from traditional UX testing to weighing the impact of technical SEO changes, tweaking on-page elements, and changing up content on key pages. Actionable processes and real-world results abound in this thoughtful presentation on why you should be testing SEO changes, how and where to run them, and what kinds of tests you ought to consider for your circumstances. Gather the team, grab some snacks, and get ready to binge these presentations Netflix-Original-Series-style. Get the MozCon 2019 video bundle Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get the Bingeable & Shareable MozCon 2019 Video Bundle!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get the Bingeable & Shareable MozCon 2019 Video Bundle!"
    },
    {
      "level": "H2",
      "text": "Tell me about the video bundle!"
    },
    {
      "level": "H3",
      "text": "What's covered in the videos:"
    },
    {
      "level": "H3",
      "text": "What you’ll get:"
    },
    {
      "level": "H2",
      "text": "Free preview - Running Your Own SEO Tests: Why It Matters & How to Do It Right by Rob Ousbey"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}