{
  "url": "https://moz.com/blog/2019-local-seo-industry-survey",
  "slug": "2019-local-seo-industry-survey",
  "title": "Take the 2019 Local Search Marketing Industry Survey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's almost 2020 (where does the time go?) and we're back with our second annual Local Search Marketing industry survey! If you market a local business, lend us your thoughts and be entered to win a Visa gift card.",
  "content": "Take the 2019 Local Search Marketing Industry Survey Local SEO By: Miriam Ellis October 28, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis October 28, 2019 Take the 2019 Local Search Marketing Industry Survey Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We couldn’t do it without you! In 2018, over 1,400 marketers responded to our State of Local SEO industry survey. We all learned so much from your responses about the day-to-day realities of marketing local businesses. This year, we can do even better because your answers will give us all valuable comparative data to analyze, YoY. Who can take the survey? Anyone who markets local businesses in any way is eagerly invited. Whether you market a single location, work for an agency with some local business clients, or are an in-house SEO for a brand with thousands of locations, we would love your participation! Whether you do just a little local search marketing or a lot, are a novice or an adept, your insights have value. What is the survey about? Unlike a typical local ranking factors poll, The Local Search Marketing Industry Survey digs deep into marketers’ experiences with tactics, challenges, clients, Google, and the working environment. For example, we learned last year that: 90% of respondents felt Google’s emphasis on proximity was detrimental to SERP quality62% felt there aren’t enough quality local search marketing training materials available60% lacked a comprehensive review management strategy49% felt utilization of Google Business Profile features were impacting local rank35% had no link building strategy in place17% of enterprises had no in-house SEO staff With your help, we’ll see what’s changed and what hasn’t. There are fresh questions, too, which we hope will uncover new stories to spark new strategies for local brands and their marketers. There will be four lucky winners! Everyone is a winner with access to the data we’ll be sharing from this large survey. But we’d like to offer a little extra thank-you for your time and knowledge. Every respondent who completes the full survey will be automatically entered for a chance to win one of four $50 Visa gift cards. Winners will be selected at random, and we hope they will use these gift cards to shop someplace local and awesome this holiday season! Take the survey Look forward to seeing the results in early 2020, when we compile them into our State of Local SEO 2020 Industry Report. Curious about last year's insights? Check them out here, and thank you for participating! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Take the 2019 Local Search Marketing Industry Survey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Take the 2019 Local Search Marketing Industry Survey"
    },
    {
      "level": "H2",
      "text": "Who can take the survey?"
    },
    {
      "level": "H2",
      "text": "What is the survey about?"
    },
    {
      "level": "H2",
      "text": "There will be four lucky winners!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}