{
  "url": "https://moz.com/blog/2019-study-on-link-ranking",
  "slug": "2019-study-on-link-ranking",
  "title": "Links as a Google Ranking Factor: A 2019 Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Using Moz's Link Explorer, Stone Temple conducted a study to see how much links really matter as a ranking factor.",
  "content": "Links as a Google Ranking Factor: A 2019 Study Link Building By: Eric Enge April 10, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge April 10, 2019 Links as a Google Ranking Factor: A 2019 Study Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Do Links Still Matter? For the fourth year running, Stone Temple (now a part of Perficient Digital) conducted a study on how much links matter as a ranking factor. We did that using Moz's Link Explorer and in this year's study, we looked at the largest data set yet — 27,000 queries. Our study used quadratic mean calculations on the Spearman correlations across all 27K tested queries. Not sure what that means? You can learn more about the study methodology here. The major study components included: Total number of links to the ranking pagesMoz DA of the links to the ranking pagesMoz PA of the links to the ranking pages Slicing these calculations into several sub-categories: Informational vs. commercial queriesMedical vs. Financial vs. Technology vs. All Other queries We were also able to evaluate just how much the Moz link index had grown for a subset of the queries because we have used the same data on 16K of the 27K queries for three years running (this year's study looked at 9K more queries, but 16K of the queries were in common). In fact, let's start with that data: That's pretty significant growth! Congrats to Moz on that improvement. Brief commentary on correlations Correlation studies attempt to measure whether or not two factors are related to one another in any way. We use correlation studies to help us understand whether or not one factor potentially causes the other It's important to understand that correlation does not prove causation; it simply suggests that it does. The example I like to share is that there is a strong correlation between the consumption of ice cream and drowning. That does not mean that one causes the other. In fact, the causal factor here is intuitively obvious — hot weather. People eat more ice cream and people do more swimming when it's hot outside. But, in the case of links, we also have the fact that Google tells us that links still matter. If that's not enough for you, Google still penalizes sites for questionable link-building practices. This is not an area they would invest in unless links matter. So how do correlation scores work? A correlation score scale runs from -1 to 1. A score of 1 means a perfect correlation between two items. So if we have two variables (x and y), whenever x increases in value, so does y. A score of -1 means the exact opposite: whenever x increases in value, y decreases in value. A score of 0 means there is no perceivable relationship whatsoever. When x increases in value, y is equally likely to increase or decrease in value. Search is a complex environment to evaluate. Google claims to use over 200 ranking factors. Therefore, it's quite unlikely that any one factor will be dominant. High scores are not likely to happen at all and correlation scores of 0.2 or higher already start to suggest (but not prove) the existence of a relationship. Core study results Time to dive in! First, let's take a look at the global view across all 27K queries: This correlation score comes in at a solid 0.293 score. Considering the complexity of the Google algorithm's 200+ ranking factors, having one single factor come in at a correlation score that high indicates a strong level of correlation. Next, let's take a look at the correlation to Moz DA and Moz PA: Both DA and PA show strong correlations; in fact, more so than the total number of links to the ranking page. This is interesting because it does suggest that at some level, the authority of the linking site and the linking page both matter. By the way, in the four years that we've conducted this study, this is the first time that the DA and PA scores have been a stronger indicator of ranking potential than the pure link count. More broadly, from a link-building strategy perspective, this provides support for the notion that getting links from more authoritative sites is how you should focus that strategy. Finally, let's take a look at how commercial and informational queries differ: Now that's interesting — informational queries show a materially higher level of correlation than commercial ones. From an interpretative perspective, that does not necessarily mean that they matter less. It may just mean that commercial pages get fewer links, so Google has to depend more heavily on other signals. But should those commercial pages happen to draw links for some reason, the impact of the links may still be as high. Summary The data still shows a strong correlation between links and rankings. Google's public statements and its actions (in implementing penalties) also tell the same story. In short, links still matter. But we also see a clear indication that the nature and the quality of those links matter too! Want more information? Check out Tom Capper's 2021 case study. Tell us what you think — do links matter as a ranking factor? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Links as a Google Ranking Factor: A 2019 Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Links as a Google Ranking Factor: A 2019 Study"
    },
    {
      "level": "H3",
      "text": "Brief commentary on correlations"
    },
    {
      "level": "H3",
      "text": "Core study results"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}