{
  "url": "https://moz.com/blog/2020-google-search-survey",
  "slug": "2020-google-search-survey",
  "title": "2020 Google Search Survey: How Much Do Users Trust Their Search Results? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a result of Google’s dedication to combating misinformation and fake news, we could reasonably expect searchers to agree that Google has improved in its ability to surface credible and trusted content. But does the average searcher actually feel that way? Path Interactive conducted a survey to…",
  "content": "2020 Google Search Survey: How Much Do Users Trust Their Search Results? Search Engines By: Lily Ray March 2, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lily Ray March 2, 2020 2020 Google Search Survey: How Much Do Users Trust Their Search Results? Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While Google’s mission has always been to surface high-quality content, over the past few years the company has worked especially hard to ensure that its search results are also consistently accurate, credible, and trustworthy. Reducing false and misleading information has been a top priority for Google since concerns over misinformation surfaced during the 2016 US presidential election. The search giant is investing huge sums of money and brain power into organizing the ever-increasing amounts of content on the web in a way that prioritizes accuracy and credibility. In a 30-page whitepaper published last year, Google delineates specifically how it fights against bad actors and misinformation across Google Search, News, Youtube, Ads, and other Google products. In this whitepaper, Google explains how Knowledge Panels — a common organic search feature — are part of its initiative to show “context and diversity of perspectives to form their own views.” With Knowledge Panel results, Google provides answers to queries with content displayed directly in its organic search results (often without including a link to a corresponding organic result), potentially eliminating the need for users to click through to a website to find an answer to their query. While this feature benefits users by answering their questions even more quickly, it brings with it the danger of providing quick answers that might be misleading or incorrect. Another feature with this issue is Featured Snippets, where Google pulls website content directly into the search results. Google maintains specific policies for Featured Snippets, prohibiting the display of content that is sexually explicit, hateful, violent, dangerous, or in violation of expert consensus on civic, medical, scientific, or historical topics. However, this doesn’t mean the content included in Featured Snippets is always entirely accurate. According to data pulled by Dr. Pete Meyers, based on a sample set of 10,000 keywords, Google has increased the frequency with which it displays Featured Snippets as part of the search results. In the beginning of 2018, Google displayed Featured Snippets in approximately 12% of search results; in early 2020, that number hovers around 16%. Google has also rolled out several core algorithm updates in the past two years, with the stated goal of “delivering on [their] mission to present relevant and authoritative content to searchers.” What makes these recent algorithm updates particularly interesting is how much E-A-T (expertise, authoritativeness, and trustworthiness) appears to be playing a role in website performance, particularly for YMYL (your money, your life) websites. As a result of Google’s dedication to combating misinformation and fake news, we could reasonably expect searchers to agree that Google has improved in its ability to surface credible and trusted content. But does the average searcher actually feel that way? At Path Interactive, we conducted a survey to find out how users feel about the information they encounter in Google’s organic results. About our survey respondents and methodology Out of 1,100 respondents, 70% of live in the United States, 21% in India, and 5% in Europe. 63% of respondents are between the ages of 18 and 35, and 17% are over the age of 46. All respondent data is self-reported. For all questions involving specific search results or types of SERP features, respondents were provided with screenshots of those features. For questions related to levels of trustworthiness or the extent to which the respondent agreed with the statement, respondents were presented with answers on a scale of 1-5. Our findings Trustworthiness in the medical, political, financial, and legal categories Given how much fluctuation we’ve seen in the YMYL category of Google with recent algorithm updates, we thought it would be interesting to ask respondents how much they trust the medical, political, financial, and legal information they find on Google. We started by asking respondents about the extent to which they have made important financial, legal, or medical decisions based on information they found in organic search. The majority (51%) of respondents indicated that they “very frequently” or “often” make important life decisions based on Google information, while 39% make important legal decisions, and 46% make important medical decisions. Only 10-13% of respondents indicated that they never make these types of important life decisions based on the information they’ve found on Google. Medical searches As it relates to medical searches, 72% of users agree or strongly agree that Google has improved at showing accurate medical results over time. Breaking down these responses by age, a few interesting patterns emerge: The youngest searchers (ages 18-25) are 94% more likely than the oldest searchers (65+) to strongly believe that Google’s medical results have improved over time.75% of the youngest searchers (ages 18-25) agree or strongly agree that Google has improved in showing accurate medical searches over time, whereas only 54% of the oldest searchers (65+) feel the same way.Searchers ages 46-64 are the most likely to disagree that Google’s medical results are improving over time. Next, we wanted to know if Google’s emphasis on surfacing medical content from trusted medical publications — such as WebMD and the Mayo Clinic — is resonating with its users. One outcome of recent core algorithm updates is that Google’s algorithms appear to be deprioritizing content that contradicts scientific and medical consensus (consistently described as a negative quality indicator throughout their Search Quality Guidelines). The majority (66%) of respondents agree that it is very important to them that Google surfaces content from highly trusted medical websites. However, 14% indicated they would rather not see these results, and another 14% indicated they’d rather see more diverse results, such as content from natural medicine websites. These numbers suggest that more than a quarter of respondents may be unsatisfied with Google’s current health initiatives aimed at surfacing medical content from a set of acclaimed partners who support the scientific consensus. We asked survey respondents about Symptom Cards, in which information related to medical symptoms or specific medical conditions is surfaced directly within the search results. Examples of Symptom Cards. Source: https://blog.google/products/search/im-feeling-yucky-searching-for-symptoms/ Our question aimed to gather how much searchers felt the content within Symptom Cards can be trusted. The vast majority (76%) of respondents indicated they trust or strongly trust the content within Symptom Cards. When looking at the responses by age, younger searchers once again reveal that they are much more likely than older searchers to strongly trust the medical content found within Google. In fact, the youngest bracket of searchers (ages 18-25) are 138% more likely than the oldest searchers (65+) to strongly trust the medical content found in Symptom Cards. News and political searches The majority of respondents (61%) agree or strongly agree that Google has improved at showing high-quality, trustworthy news and political content over time. Only 13% disagree or strongly disagree with this statement. Breaking the same question down by age reveals interesting trends: The majority (67%) of the youngest searchers (ages 18-25) agree that the quality of Google’s news and political content has improved over time, whereas the majority (61%) of the oldest age group (65+) only somewhat agrees or disagrees.The youngest searchers (ages 18-25) are 250% more likely than the oldest searchers to strongly agree that the quality of news and political content on Google is improving over time. Misinformation Given Google’s emphasis on combating misinformation in its search results, we also wanted to ask respondents about the extent to which they feel they still encounter dangerous or highly untrustworthy information on Google. Interestingly, the vast majority of respondents (70%) feel that they have encountered misinformation on Google at least sometimes, although 29% indicate they rarely or never see misinformation in the results. Segmenting the responses by age groups reveals a clear pattern that the older the searcher, the more likely they are to indicate that they have seen misinformation in Google’s search results. In fact, the oldest searchers (65+) are 138% more likely than the youngest searchers (18-25) to say they’ve encountered misinformation on Google either often or very frequently. Throughout the responses to all questions related to YMYL topics such as health, politics, and news, a consistent pattern emerged that the youngest searchers appear to have more trust in the content Google displays for these queries, and that older searchers are more skeptical. This aligns with our findings from a similar survey we conducted last year, which found that younger searchers were more likely to take much of the content displayed directly in the SERP at face value, whereas older searchers were more likely to browse deeper into the organic results to find answers to their queries. This information is alarming, especially given another question we posed asking about the extent to which searchers believe the information they find on Google influences their political opinions and outlook on the world. The question revealed some interesting trends related to the oldest searchers: according to the results, the oldest searchers (65+) are 450% more likely than the youngest searchers to strongly disagree that information they find on Google influences their worldview. However, the oldest searchers are also most likely to agree with this statement; 11% of respondents ages 65+ strongly agree that Google information influences their worldview. On both ends of the spectrum, the oldest searchers appear to hold stronger opinions about the extent to which Google influences their political opinions and outlook than respondents from other age brackets. Featured Snippets and the Knowledge Graph We also wanted to understand the extent to which respondents found the content contained within Featured Snippets to be trustworthy, and to segment those responses by age brackets. As with the other scale-based questions, respondents were asked to indicate how much they trusted these features on a scale of 1-5 (Likert scale). According to the results, the youngest searchers (ages 18-25) are 100% more likely than the oldest searchers (ages 65+) to find the content within Featured Snippets to be very trustworthy. This aligns with a similar discovery we found in our survey from last year: “The youngest searchers (13–18) are 220 percent more likely than the oldest searchers (70–100) to consider their question answered without clicking on the snippet (or any) result.” For Knowledge Graph results, the results are less conclusive when segmented by age. 95% of respondents across all age groups find the Knowledge Panel results to be at least “trustworthy.” Conclusion: Young users trust search results more than older users In general, the majority of survey respondents appear to trust the information they find on Google — both in terms of the results themselves, as well as the content they find within SERP features such as the Knowledge Panel and Featured Snippets. However, there still appears to be a small subset of searchers who are dissatisfied with Google’s results. This subset consists of mostly older searchers who appear to be more skeptical about taking Google’s information at face value, especially for YMYL queries. Across almost all survey questions, there is a clear pattern that the youngest searchers tend to trust the information they find on Google more so than the older respondents. This aligns with a similar survey we conducted last year, which indicated that younger searchers were more likely to accept the content in Featured Snippets and Knowledge Panels without needing to click on additional results on Google. It is unclear whether younger searchers trust information from Google more because the information itself has improved, or because they are generally more trusting of information they find online. These results may also be due to older searchers not having grown up with the ability to rely on internet search engines to answer their questions. Either way, the results raise an interesting question about the future of information online: will searchers become less skeptical of online information over time? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2020 Google Search Survey: How Much Do Users Trust Their Search Results?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2020 Google Search Survey: How Much Do Users Trust Their Search Results?"
    },
    {
      "level": "H2",
      "text": "About our survey respondents and methodology"
    },
    {
      "level": "H2",
      "text": "Our findings"
    },
    {
      "level": "H3",
      "text": "Trustworthiness in the medical, political, financial, and legal categories"
    },
    {
      "level": "H3",
      "text": "Medical searches"
    },
    {
      "level": "H3",
      "text": "News and political searches"
    },
    {
      "level": "H3",
      "text": "Misinformation"
    },
    {
      "level": "H2",
      "text": "Featured Snippets and the Knowledge Graph"
    },
    {
      "level": "H2",
      "text": "Conclusion: Young users trust search results more than older users"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lily Ray\n          \n            Lily Ray\n          \n            Lily Ray"
}