{
  "url": "https://moz.com/blog/2022-local-seo-holiday-success",
  "slug": "2022-local-seo-holiday-success",
  "title": "2022 Local SEO Holiday Success: Essential Comforts in Leaner Times - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "2022 Local SEO Holiday Success: Essential Comforts in Leaner Times Local SEO By: Miriam Ellis October 24, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis October 24, 2022 2022 Local SEO Holiday Success: Essential Comforts in Leaner Times Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: Stanley Zimny I like nothing better than using this annual local SEO holiday column as a greeting card with messages of good cheer, great strategy, and healthy profit penned inside. With economists caroling “austere” and “scary” in their predictions for 2022’s 4th quarter shopping season, however, it’s not easy to be jolly. Doomsayers’ dirges have their point, but we’re in this together, and here’s my own ditty for courage, set to the chorus of Jingle Bells: Local foot traffic is Up now 20% News is good in the neighborhood If basics are your bent Big brands (particularly those that trade in the trends of electronics) are not expecting a banner year for people buying new TVs or surveillance technology. Yet, if what your local business offers is help with basic needs and modest comforts, 2022’s holiday sales can be decent, if not a phenomenal spree. Let’s look at a solid strategy for stocking what folks want and communicating that you’re here to serve. Food, warmth, wellness, and deals Image credit: Michael Li “Heat or eat” is the troubling slogan I’m hearing in multiple countries where economics have been allowed to create an artificial scarcity of energy resources on the back of a quite legitimate shortage of labor due to the pandemic. Until we all have our own nearby solar, wind and water power, we’ll continue to face fossil fuel-foolery that will eat up our paychecks and leave many in the cold this winter. All of us non-wealthy folk are feeling the pinch. We’ll be looking at the circle of our loved ones and deciding that instead of giving our favorite nephew electronics this winter, we will either pay part of his heating bill or knit him a very warm scarf. A story I read recently in the Los Angeles Times sums this moment up well: a seller who previously dealt in luxury cosmetic gift baskets has altered his inventory to offer snack boxes. It makes sense in a time in which shoppers will be looking for ways to ensure that their friends and family have the necessary calories – not the curlicues – of life. This same vendor has also changed his marketing agency’s slogan from “we grow sales” to “we deliver peace of mind”. 2022 is the year to take a very close look at how much of your winter inventory and strategy can be rejigged to focus on food, warmth, wellness, and deals. Get a sense of the shopping season ahead from these eight points: 1. People are longing for health and strength Fitness and gym membership sales are up as much as 20% as people try to become healthier to weather the extreme vagaries of recent modern life; gift cards that support wellness could do well. 2. Having enough to eat has become a major priority The US food index increased 11.4% over the past year, with prices on some foods increasing by as much as 38%, meaning that gifts of food may be about as big of a luxury as many of your customers can afford to give this year. Could the brand you’re marketing partner with a local food producer for a selection of edible gifts? 3. Any source of warmth is cherished Meanwhile, with utility bills off the charts around the world, items on lists like this one of how to stay warm without turning on the heater could make utilitarian items like layered clothing, warmer socks, thick hats, flannel robes, microwavable heat packs, hot water bottles, hot drinks, and soups attractive gifts for caring holiday shoppers. Skew your stock towards thoughtful essentials to be where your customers are this year. 4. Wise young folk are serious about de-consumption It’s no accident that younger people are responding to the climate instability and energy catastrophe being created by the fossil fuel industry with the caring decision to reduce consumption. 50% of younger shoppers expect to buy more secondhand items as we close out the year. Assess whether re-stored, recycled, and thrift items could make up part of your inventory. 5. Reduced staff necessitates cutbacks and creativity A challenge for local businesses in 2022 is the pattern we’ve been in since the pandemic began: labor shortages. If some staff are sick and others have quit to seek employment elsewhere, hours of operation may need to be cut. In that event, consider whether an after-hours kiosk outside the place of business could assist. If it’s honor-system based, you’ll need to trust that your community will pay for what they take. It could help you make a few additional sales in this extra challenging season. 6. Early shopping helps spread out purchases Another trend that’s being widely-reported is of more than 1 in 10 customers shopping earlier this year. That’s a small percentage, of course, but it’s important to know that some of your customers could be trying to spread out their holiday purchases across the paychecks of multiple months, due to financial insecurity. This means that in-store and online features of holiday products could be helpful to some as early as the beginning of the 4th quarter. 7. Insecurity sometimes leads to splurging I don’t have a statistic for this one, but I’m seeing talk around social media of some shoppers splurging in 2022 because they don’t know if they’ll be able to in 2023. I’m also noticing credit card offers ramping up. Anyone who grew up in the plastic-finance-fueled 80s can see the possibility of people spending what they don’t have as a way to comfort themselves and their loved ones, meaning some indulgent gifts may still sell well. I wouldn’t bet the house on this, though; it was noted that basic necessities were among the top sellers of the recent “Prime” day over at Amazon, with people buying diapers, toothpaste, and lunchboxes. 8. Deals are more welcome than any time in recent years Finally, due to inflation and fears of recession, the majority of people are eager for deals and coupons, and local retailers may actually be in a good position to offer them this year. In 2021, one of the most significant challenges for nearly all businesses was shortages resulting from a very broken supply chain. While this issue persists in 2022, vendors in many industries are reporting a glut of inventory they need to move. In response, they are lowering prices and promoting coupons to catch the attention of shoppers who will be using the Internet over the next few months to find the best offers in town. And that brings us to our strategic marketing checklist. The Holiday Local Search Marketing Checklist Image credit: Naotake Murayama With your mindfully-curated inventory in place, you’re ready to serve up your offering to your community, and you have an absolute feast of options at your fingertips for getting the word out. Consider all of the following methodologies for promoting your local business this holiday shopping season: ✅ Website Now is the time to be sure your website is offering maximum information in abundance: Update hours of operation to reflect holiday hours.Double check that store location info is correct in every place it is listed on the site, including headers/footers/side bars, contact pages, location landing pages, and about pages.Highlight every possible contact methodology, including phone, text, chat, forms, messaging, social and email.Highlight all fulfillment options, including in-store, buy-online-pick-up-in-store, curbside, home delivery, and shipping.Don’t buy the hype that COVID is “over”; feature your safest protocols and requirements to serve the maximum number of people in your community, including elders and the immune compromised.Audit all product landing pages to be sure that they are discoverable via site search and/or menu navigation and that shopping cart functionality is as simple as possible; to avoid cart abandonment, be up front about shipping/handling charges.Create sitewide or page-specific banners for your best deals of the season (coupons, free shipping, discounts, etc.) as customers will be looking for the least expensive options more than usual this year.Feature first and third-party reviews on key pages of the site (location or product landing pages) to let the public do the selling for you.Highlight when items that need to be custom made or shipped must be ordered to reach recipients before a specified holiday date.Highlight the greenest practices and most important community initiatives in which your local business is participating. Even in hard times, there is a growing trend of people shopping their values. Be sure to publicize if a percentage of your profits support local institutions like food banks, heat for elders, and other worthy causes.Consider creating an essentials guide section of the website to showcase inventory that meets the goals of providing warmth, nourishment, and comfort. Depending on your industry, consider creating a re-stored/recycled guide, too, for younger shoppers. ✅ Google Business Profile and other local business listings Full-featured listings will be the online doorway to your offline business, with Google Business Profiles driving as much as 70%-80% of leads: Be sure fundamental contact information, holiday hours of operation, and branding are accurate across all business listings. Messy and time-consuming? Check out Moz Local for help across the board.Retroactively respond to any reviews that have been ignored in Q3 and make a schedule for daily checks of incoming reviews over the next few months. Respond with empathetic solutions to cited problems and grow your reputation for customer service excellence. Do not incentivize requests for customers to remove negative reviews.Integrate Pointy into your point-of-sales system if your inventory is made up of common, branded products, and be present in Google’s shopping platform which customers could be using this year like never before to compare prices. Remember that 2022 is the year in which Google confirmed that in-store product availability is a local visibility factor.Photograph key lines of your inventory as well as the exterior and interior of your store, and upload these images to your listings. Don’t have time to do it all? Get started by photographing stock that meets the food-warmth-wellness-deals criteria. Add your holiday-focused products to the Products section of your Google Business Profile.Throughout the holiday shopping season, publish a variety of Google Posts featuring your inventory and special deals. Pre-populate the Q&A section of your Google Business Profile with holiday-specific questions and answers such as “are you open on New Year’s Eve?” or “do you have candy canes?”Speaking of Q&A, Google Messaging now allows you to enter ten questions for providing automated answers. If you have messaging turned on, this is a great opportunity to respond promptly to common queries about your holiday offerings, even when short-staffed. Nice to know that this feature can also include links to pages of your website for more information.Video content just keeps getting more popular. Make a short holiday offers video and publish it to your listings.Be sure listing menus reflect holiday-related services and inventory. Look at the attribute section of your Google Business Profile, and add as many relevant signals (like Black-owned or wheelchair accessible) as possible.Google has confoundingly removed COVID safety information from their listings just in time for the holiday flu season. If you know health and safety are a priority for your customers, consider adding your sanitary measures to the business description or Posts.Google Business Profiles tend to steal the show, but in 2022, I would also recommend keeping a special eye on your listings on Nextdoor and Facebook. ✅ Social Special thanks to my teammate, Senior Learning and Development Specialist Meghan Pahinui, for these timely and trending social media tips: Regularly share hours of operation on social platforms whether you’re offering special holiday hours or not. Share information about gift cards or gift certificates you offer along with how to purchase them.Share any information about sales, specials, or promotions you’re running in-store.Feature visual buying guides on platforms like Instagram or Twitter. For example, “gifts for dad” or “gifts for college students” which feature products you know are popular among those demographics.Create product spotlights on TikTok. Ask employees what they would purchase as a gift or what their favorite menu item is in a short video. Create “behind the scenes” videos for TikTok and Instagram which feature how a product is made or how your business prepares for the holidays.Create a hashtag and post it near checkout or on bag inserts encouraging customers to share their purchases. Be sure to include that their posts may be featured on your own social media accounts as UGC.Tweet to your followers asking them to share their recent purchases or meals. Be sure to interact with the posts and engage in conversation with your community.Create fun photo-ops in stores with backdrops or merchandise displays. Place a sign near these photo-ops encouraging people to share their photos on social media to generate buzz and foot traffic for others wanting to participate. Be sure you’re following along online, as well, so you can engage with the posts.Tweet to your followers asking what they are excited about for the holiday season and then reply with recommendations from your business. For example, someone may say they are excited to visit family and friends to which you may recommend travel accessories, games to play in a group, or gift cards they can purchase for those they are visiting.✅ Real world Small business owners are the backbone of the US economy. You are essential and heroic for keeping communities supplied over the past few years of extraordinary challenge, and your real-world efforts deserve recognition and huge praise. Here are a few activities that could bring more attention and customers your way. Nov 26, 2022 is American Express Small Business Saturday. In 2021, shopping during this annual event reached an all-time high of $23.3 billion. If you’ve never participated in this tradition before, this is a great year to get started. If a Buy Local association doesn’t exist yet in your town, contact the American Independent Business Association to ask about how to start one, and take part in the growing Shop Indie Local movement. Send business to your peers and turn to them for support in trying times.If your town or county still has a local newspaper, reach out to reporters there with your business story, including tips for holiday shoppers who need help celebrating on a budget. Never undersell the expertise you’ve earned when it comes to serving the public in good times and bad.Popup shops are on the rise. In the big biz world, Target is hosting FAO Schwarz and Macy’s is hosting Toys R Us. Consider whether giving space in your storefront to local artisans, crafters, and food makers might bring in more customers this year who, once on the premises, could shop you both. Alternatively, if your town has a holiday pop-up street or district, your local business might participate with curated inventory that tends to do best at these events. A related trend is food and drink establishments styling themselves holiday pop-ups around town to offer unique experiences.Your voice as a business owner matters in speeding up our transition to affordable, sustainable energy. Coordinate with other local business owners in your community to let local officials know you are done with the instability of the fossil fuel economy and all the problems it is creating for your business and want your city to transition now. Then, team up with other towns in your state and take your lobby to the state level. Finally, remember that economists like all those I’ve linked to today, and marketing commentators like myself, are just regular people without any special powers over the future you are writing for your business. Predictions matter, but local business owners possess a hardihood and greatness that defies odds, again, and again, and again. I want to close with the story of Yvon Choiunard, who set up a blacksmith’s shop in his parents’ chicken coop to forge pitons for mountain climbers, which he sold for $1.50 each in 1950s money. He wanted to work at a job he was excited about and that would let him and his staff go surfing when the waves were right. This holiday season, the 83-year-old Chouinard is giving away all the shares of his $3 billion company, Patagonia, to a climate action trust, declaring, “Earth is now our only shareholder.” It’s the kind of story only a small business owner would be daring enough to write, and as we close out 2022 with eyes open and fingers crossed, I am wishing you Chouinardian grit, innovation, vision, and success. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2022 Local SEO Holiday Success: Essential Comforts in Leaner Times"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2022 Local SEO Holiday Success: Essential Comforts in Leaner Times"
    },
    {
      "level": "H2",
      "text": "Food, warmth, wellness, and deals"
    },
    {
      "level": "H3",
      "text": "1. People are longing for health and strength"
    },
    {
      "level": "H3",
      "text": "2. Having enough to eat has become a major priority"
    },
    {
      "level": "H3",
      "text": "3. Any source of warmth is cherished"
    },
    {
      "level": "H3",
      "text": "4. Wise young folk are serious about de-consumption"
    },
    {
      "level": "H3",
      "text": "5. Reduced staff necessitates cutbacks and creativity"
    },
    {
      "level": "H3",
      "text": "6. Early shopping helps spread out purchases"
    },
    {
      "level": "H3",
      "text": "7. Insecurity sometimes leads to splurging"
    },
    {
      "level": "H3",
      "text": "8. Deals are more welcome than any time in recent years"
    },
    {
      "level": "H2",
      "text": "The Holiday Local Search Marketing Checklist"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}