{
  "url": "https://moz.com/blog/2022-local-seo-success",
  "slug": "2022-local-seo-success",
  "title": "2022 Local SEO Success: The Year of Everywhere - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let’s set you up for success with seven local SEO precepts for the year ahead, some expert commentary, and many signs of good things to come!",
  "content": "2022 Local SEO Success: The Year of Everywhere Local SEO By: Miriam Ellis January 4, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis January 4, 2022 2022 Local SEO Success: The Year of Everywhere Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “Everywhere!” is going to be the ebullient byword for approaching a brand new year of local search marketing with gusto. In 2022, the opportunity is there for local businesses to be everywhere customers are looking at a time when they are particularly open to change, whether that’s exploring new companies, testing new brands, or trying new modes of communication. Public health, and its direct impacts on local businesses, will remain unpredictable. However, what’s as sure a bet as you’ll find anywhere these days is that if the companies you market can be found and liked by customers, you can significantly expand the number of neighbors you get to serve with care, compassion, and a commitment to making this a very good year for brick-and-mortar shops and SABs. Let’s set you up for success with seven local SEO precepts for the year ahead, some expert commentary, and many signs of good things to come! 1. Converse with customers everywhere, with extra kindness “What the world needs now, is love, sweet love.” At that next meeting in which you are training staff who directly interact with your customers and clients, spend a minute listening to Ms. Warwick’s classic to get rooted in your deepest humanity and make a pact to bring these powerful feelings into every communication you have with the people you serve. We’re all going through so much these days, and even a few extra words of kindness can make the friendliest impression on a customer who could be sorely in need of being treated with respect and consideration. The great news is that 2022 will offer the local brands you market a feast of options to make meaningful connections. To set the table, you should consider establishing all of the following mediums that make sense for the business and its customers: In-personCurbside messagingHome delivery messagingText messagingDirect Messaging, including Google MessagingLive ChatEmailReview responsesReview requestsPhoneOn-hold phone messagingTelemeetingsWebsite formsSurveysSocial media exchangesPost-transactional landing page messagingCall-to-action text All of these can be managed with honoring language that conveys your appreciation of your customers. Don’t forget that the plain-old copy on websites is meant to be the start of a conversation, too. One of the best local search marketing agency tips I heard in 2021 came from Near Media co-founder Mike Blumenthal who suggests checking out Riverside.fm because it solves the age-old dilemma of having clients who are great at talking about their industry expertise, but have difficulties writing about it. With this remarkable video recording service, you can efficiently record this type of client and then use the results to create both video and text content. Brilliant! I’ll paraphrase Leadferno CEO Aaron Weiche in saying, “If you want to sell everywhere, you must converse everywhere,” and I can’t think of a better way to sum up how important it will be to talk well with your local community in 2022. 2. Look everywhere for supply chain gaps I was heartened when 2021 began with half a million new businesses starting up, but I also felt an uneasiness about the system undergirding retail: the global and consolidated national supply chain. Did it happen to you that when you couldn’t get name brand hand sanitizer in 2020, your need was fulfilled by a local distillery? Did it happen to you that you found a regional flour mill to put bread on your table, or someone on Etsy to sew you a cloth mask? The pandemic exposes the results of the race-to-the-bottom economics which began around the time I was born; large US companies decided to outsource manufacture to whatever region offered the cheapest labor. Now, after watching even Amazon flounder to deliver goods to shoppers due to global supply chain chaos, some American economists are calling on the nation to reshore manufacturing. There has never been another moment in my own lifetime so filled with opportunity for any entrepreneur who can step up locally, regionally, or nationally to fill supply chain gaps and provide reliable production of essential goods. That local Etsy sewist can make t-shirts that don’t rip apart after a year of wear, in keeping the emerging philosophy of buy less/use longer. That potter downtown can replace your imported dishes when they break. That olive oil, pasta, masa harina, peanut butter, and soy milk can be grown and produced from start to finish in the US, too, rather than imported at a carbon cost that’s become too high. Pre-pandemic business models that may have passed their shelf life can be retooled by entrepreneurs who know how to produce essential goods or organize others with these skills, and your marketing savvy may be best employed in building yourself a niche in the local supply chain right now, when it is so clearly needed. 3. Build back green everywhere you can Much as I support the concept of reshoring, I feel serious qualms about it, too, because it triggers in my brain the spectre of rising smokestacks, just when we are in critical need of new, sustainable production methodologies. If 2021 was the year that you, your staff and your customers found life, business and norms completely disrupted by heatwaves, wildfires and floods, you know in your bones that we’ve reached the end of the fossil fuel road. It’s simply not sustainable to create a new national or local supply chain with the old energy sources that brought us Climate Change, nor can we, in good conscience, continue the practice of using poorer nations or the poorest parts of our own nations as the toxic dumping grounds of industry. I often encounter the attitude that individuals can’t do anything to make a difference on climate and I’ve personally experienced this melancholy, but local businesses can collectively meet the 71% increase in searches for sustainable goods with a nearby supply chain which significantly reduces the 1 billion+ tons of carbon emitted by long-distance shipping. The closer to home we grow, make and sell goods, the better. Meanwhile, there are a range of other green practices available to nearly all local businesses and no shortage of ideas for greener startups. Make 2022 the year your local business drafts a climate action-based policy and publicizes it on your website, your Google Business Profile via posts and description, your social feeds, your video media, and via local news. 92% of customers say they feel more trust in businesses that are environmentally and socially conscious; it’s a win for everyone to make your company that kind of business. 4. Make your website key to customers shopping everywhere Google wants to be the “transaction layer of the Internet” and, right now, it’s free for the local businesses you market to facilitate virtual window shopping by adding products to your Google Business Profile and, in the US, to get your products featured in Google Shopping via the Merchant Center. The trouble with Google, though, is that everything they offer you for free is something they can put a price tag on at any time, and renting your customers back from Google for any purchase is never going to be as strong a position for a company as owning those sales outright. With the pandemic’s acceleration of e-commerce (a 39% increase happened this time last year) and local delivery (here to stay), it’s now a basic business investment to build shopping carts into local business websites. If you can, choose a strong product like Shopify that will distribute your inventory feeds to multiple channels for customers who are now shopping everywhere, including social sites like Instagram and Meta/Facebook. However, while you are greeting customers with multi-platform shopping options, my advice is to make your website the central hub of all this activity, as much as you possibly can, most particularly for repeat transactions. Don’t let any third party offer an easier shopping experience, better support, or more information than your own website does. Make the user experience so good that one-off customers who found you elsewhere come directly to your site for their second purchase. 5. Look for good organic SEO teachers everywhere to strengthen your website With links and on-page SEO consistently making up about one-third of the perceived factors that drive local pack rankings, 2022 is the year in which local business owners and their marketers should prioritize the acquisition of organic SEO education. Chances are, you already have your local SEO education well in hand, but to provide the kind of discoverable, usable experience that will bring people to your site and keep them coming back, organic SEO has become a must-have. It supports your local rankings and multiple stages of your customers’ journeys. As with our own local SEO industry, the organic SEO industry is polluted with information that isn’t actually accurate or helpful. You need resources that act as good teachers. Here is my list of five free organic SEO learning assets here at Moz that are respected for their usefulness, simplicity and depth: The Beginner’s Guide to SEOThe One-Hour Guide to SEO video seriesThe Beginner’s Guide to Link BuildingHow to Rank in Google master checklistThe Web Developer’s SEO Cheat Sheet Everyone learns best in their own way; socially follow generous organic SEO practitioners whose communications make the most sense to you and whose tips you find yield results. Two of my own favorite SEO teachers here at Moz are Dr. Peter J. Meyers and Tom Capper, and I tugged at their elbows to give me their predictions of the year ahead in organic SEO. Pete says: \"Google is signaling their intent louder and louder these days, and that leaves us with a pretty boring answer about the future: \"Expect more of the same.\" Google will continue to push the limits of what \"organic\" means and experiment aggressively with changes to keep ad dollars flowing. Passage indexing caused a lot of confusion in 2021, but I believe it's part of a broader push to repurpose content on the web. Combine that push with advances in NLP and the recent increase in title rewrites and the bottom line is that we will have less control of what appears in SERPs in 2022. This is going to require increasing awareness of how these changes impact CTR and search engagement and a renewed focus on controlling what we're able to control (and measuring the rest). Pay close attention to core updates if post-pandemic consumer behavior shifts — including a return to brick-and-mortar commerce — as these may require manual intervention by Google in ML systems. If 2020-2021 taught us anything, it's that the world still drives Google more than Google drives the world.\" Tom says: \"Title rewrites, continuous scroll, indented results... the back half of 2021 has shown that Google does not consider the SERP to be at all sacred. There's a willingness to change and experiment, even when (as with the title rewrites) the changes feel half-baked or amateurish. We should be ready for more of the same in 2022, especially with Google's talk of its MUM technology powering new and more complex result types. SEOs need to be open-minded and adaptable - sure, complain that these results are harder to measure and target than what went before, but make sure you're trying to win at the new game while you reminisce about the old one. At the same time, we should expect to see an increased harshness of Page Experience as a ranking factor, with Google quietly ramping up from the extremely conservative, slightly botched launch.\" It’s a lot to absorb, but you can do it with good study habits over the next twelve months, and the comforting thought that even the best organic SEOs are continually learning. 6. Look at reviews everywhere for business intelligence more than rankings For as long as online local business reviews have existed, the majority of industry discussion has been about how the ratings, number and text of reviews may impact local search engine rankings. It’s an important topic, but preoccupation with it can: Overlook that reviews are a primary vehicle for responsive customer service, just like SMS or emailContribute to business owners being the primary drivers of review fraud, buying fake positive reviews for their own brands and creating the reality in which nearly 11% of Google’s review base is fake, according to a landmark 2021 report by Greg Sterling. Obscure that reviews are a free ongoing source of direct consumer feedback which depicts the health of a local business and its major quality control issues, as in this important Near Media/GatherUp study demonstrating how inventory issues at Walmart correlated with a rise in consumer complaints being published as online reviews. Make 2022 the year your reputation and reviews strategy focuses less on sheer numbers or ratings of reviews, and more on auditing and analyzing the sentiment within the overall review corpus. Moz Local customers will have the advantage of their dashboard pulling in reviews from multiple sources for basic sentiment analysis, highlighting trends in what customers are praising or blaming as the new year moves forward. Repeat mentions of topics like employee rudeness, long wait times, disappointment in products, incorrect citation information, communications barriers, or accessibility issues signal the need for structural fixes that could directly impact profitability, with all the mystery taken out of the matter by consumer candor. Needless to say, 2022 should also be the year that any serious company bans the purchase of fraudulent reviews. A business will learn nothing useful about its performance from singing its own praises. 7. Look for silver linings everywhere and share them with your community It can be a valiant act to fully face difficulties while choosing hope in hard times. If you make this choice in 2022, your honest yet optimistic communications can be of real service to your community. Here are three silver linings that could be coming our way in the year ahead: New treatments for COVID-19 could come to the local rescue While the pandemic didn’t alter the behavior of some groups, and other groups have been experimenting with their comfort zones in returning to activities outside the home, McKinsey has done a good job tracking the continued caution being exercised by about half of Americans. If 2022 realizes the rumored promise of a medication like Monulpiravir or Paxlovid, it will be the single most impactful difference between the new year and the last two. At the start of the pandemic, Kaiser estimated that about ⅓ of US adults risked serious outcomes if infected, due to their age and medical conditions. I can’t think of a more hopeful image than vaccinations and new COVID-19 treatments potentially enabling 90 million people to greet the world again in greater security. Monopoly losses could be local business gains Have you noticed that antitrust has become daily news and that even a short list of some of the recent investigations concerning monopoly is indicative of a shift in regulatory activity? There are two sources of potential good in this for small businesses. One, if governing bodies are willing to directly take on monopolies like Amazon and Walmart, it could directly create a fairer marketplace for local businesses. Two, and this is the aspect that interests me most, local businesses have the opportunity to ride the customer wave of anti-bigness that appears to be gathering momentum. In this changing environment, being proud of being small can be speak to the aspirations of shoppers whom surveys indicate would be more committed to shopping locally as a result of the pandemic once it eases (82%), do so because they want to keep their money in the community (57%), and choose to shop nearby because of the unique product selection (61%). This will not be an easy road, particularly in the US, but I see hope in a shopping public that wants small-batch over mass-produced, is becoming educated about the detriment of monopoly on local economies, and that has a built-in feeling of loyalty to small businesses. Regulated tech can support small businesses instead of undermining them Check out Squarespace’s “everything to sell anything” suite and sign up to attend a virtual event hosted by the American Independent Business Alliance this year. Then take a moment to appreciate the wonder of just how simple it is becoming for any entrepreneur with a great local business idea to market their offering with immense sophistication while finding nearby support in a Buy Local association. It’s never been easier to build a good, optimized website, shoot amazing photos and videos, get a shopping cart as facile as the big brands have, huddle with business peers for solidarity, and take all the other marketing steps that lead up to finally getting to talk 1:1 with a customer. That’s the point I hope we never lose sight of in local search marketing : everything we do is meant to connect people and increase the quality of life in local communities. If governments will do their job to protect economic and human diversity, we can do ours of making our towns and cities really fine places to live with accessible goods and services for everybody. That’s the hope I’ll be taking into 2022, everywhere I go in the industry, and it’s an optimism I hope you feel and can share with all your clients and customers in the new year ahead! Image credits: Ianqui Doodle, Detroit Derek Photography, KJBax, and Celeste Lindell. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2022 Local SEO Success: The Year of Everywhere"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2022 Local SEO Success: The Year of Everywhere"
    },
    {
      "level": "H2",
      "text": "1. Converse with customers everywhere, with extra kindness"
    },
    {
      "level": "H2",
      "text": "2. Look everywhere for supply chain gaps"
    },
    {
      "level": "H2",
      "text": "3. Build back green everywhere you can"
    },
    {
      "level": "H2",
      "text": "4. Make your website key to customers shopping everywhere"
    },
    {
      "level": "H2",
      "text": "5. Look for good organic SEO teachers everywhere to strengthen your website"
    },
    {
      "level": "H2",
      "text": "6. Look at reviews everywhere for business intelligence more than rankings"
    },
    {
      "level": "H2",
      "text": "7. Look for silver linings everywhere and share them with your community"
    },
    {
      "level": "H3",
      "text": "New treatments for COVID-19 could come to the local rescue"
    },
    {
      "level": "H3",
      "text": "Monopoly losses could be local business gains"
    },
    {
      "level": "H3",
      "text": "Regulated tech can support small businesses instead of undermining them"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}