{
  "url": "https://moz.com/blog/2023-local-seo-success",
  "slug": "2023-local-seo-success",
  "title": "2023 Local SEO Success: Human Power in a Year of Change - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As we ring in 2023, Miriam shares insights from industry professionals that show why the developments we’ve seen over the past few months indicate greater change ahead — driven by Google’s attitude toward and handling of local and general search philosophy.",
  "content": "2023 Local SEO Success: Human Power in a Year of Change Local SEO By: Miriam Ellis January 4, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis January 4, 2023 2023 Local SEO Success: Human Power in a Year of Change Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. 2023 will be a run-up to the Olympics for the world’s top athletes who will be competing in a variety of events to prove themselves ready to represent their countries in the Paris Games, and I have a strong hunch that the coming months will be a strenuous exercise in fortitude for local business owners and their marketers, as well. Having weathered the extraordinary events that occurred in local search in the second half of 2022 – most particularly the deprecation of the historic Google Business Profile Manager Dashboard and a slew of business-impacting bugs – it’s my prediction that 2023 is going to be a year of notable change for the millions of local brands for whom Google’s local search interfaces have become integral to discovery, communications, and sales. Meanwhile, ChatGPT is stirring up the whole SEO industry, with many wondering how long a shadow AI will cast over work and life. It’s my gut feeling that the developments we’ve seen over the past few months presage greater change ahead driven by Google’s attitude toward and handling of local and general search philosophy. Let’s prepare ourselves by getting an outlook on organic SEO (which bounds our local world) from Moz’s own Tom Capper and Dr. Peter J. Meyers. Then, let’s gather local wisdom from thoughtful industry commentators including Amanda Jordan, Ben Fisher, David Mihm, Garrett Sussman, Greg Sterling, and Mike Blumenthal. Finally, I’ll offer 3 areas of local search marketing I recommend focusing on in 2023. Citius, Altius, Fortius Image credit: St Dennis Band Educating the mind without educating the heart is no education at all.” ― Aristotle We come running into the arena of 2023 carrying, as always, the bright torch of human intelligence, but this year, our steps are a little dogged; AI is on everyone’s mind. On our road to Paris, we can reflect on the Olympic motto that was first introduced in that city in the 1924 games: Swifter, Higher, Stronger. As a species, we are always hoping for improvements in ourselves and society. But, it was Aristotle who said that the mark of an educated mind was to be able to entertain a thought without accepting it, and right now, many of my SEO colleagues are questioning whether the rise of artificial intelligence and a life so ordered by machines is, in fact, anyone’s idea of a smart move. Simply said, just because people can do something, it doesn’t mean that they should. I asked my fellow Subject Matter Experts here at Moz what is on their minds in organic SEO for the new year, and their answers help shed a particular light by which we can better see the larger stadium in which all businesses are competing. From Tom Capper: The big SEO topic in the tail end of 2022 has been AI content - both ChatGPT and before that Google’s Helpful Content update bringing this topic to the front of people’s minds. Said update now looks rather prescient, with a new wave of increasingly coherent bot-written content surely to follow. Expect this to be a major battleground for Google in 2023. As I am writing this in the first week of December 2022, there is already an update to Google’s “Helpful Content system” rolling out - and that brings me to the other big change we’ll see more of. Ranking system updates. This is likely more of a terminology change than a practice change from Google, but I’d still expect it to somewhat shake up how SEOs think about and contextualise these updates — in my opinion, a shake-up that is long overdue. Lastly, a carry over from my predictions for 2022 — I predicted an increasingly volatile SERP feature landscape, and I think that prediction has aged well. But it still stands. Again, as I write this, Google has just rolled out continuous scroll desktop SERPs in the US, and numerous feature changes in the last few weeks. There is nothing sacred here, from Google’s perspective, and with increasing threat from dissimilar competitors like Apple or AI assistants, they may feel like slightly less gradual change is justified.” From Dr. Pete Meyers: Echoing Tom, because it's so important that I'm forced to agree with Tom, expect a flood of low-quality, machine-generated content in 2023 and a corresponding pushback from Google. Whether this will be part of the Helpful Content system updates or something entirely new remains to be seen, but creating Machine Learning content that doesn't look like ML content will likely (and sadly) become a new obsession of some corners of the SEO industry. This trend may force Google to re-evaluate E-A-T and/or more clearly define how they measure Expertise, Authority, and Trust, in order to encourage positive best practices. Google is aggressively experimenting with product listings, including the large-format product \"grid\" that seems to blur the lines between free and paid product listings. As Google seeks to compete with Amazon and other product searches (including an increasing amount of purchases driven by social platforms like TikTok), expect these lines to blur even more. Some competitive product search results are going to be unrecognizable from a traditional, organic SEO perspective. My riskiest prediction — Expect Google to re-evaluate Featured Snippets, especially given quality concerns, both around trustworthiness of content (including disinformation) and the impact of low-value ML content. We've already seen snippets being pulled from a chunk of competitive queries in 2022, and I suspect Google may substantially re-invent the Featured Snippet or set a higher bar on when and how often they're displayed.” In sum, Tom and Pete are expecting volatility in the SERPs, including SERP features like local packs, which Moz has been tracking a decrease in the visibility of for some months. Both SMEs are looking closely at the disruption of AI and how it may impact search and searchers. Local SEOs may well be feeling like they’ve already experienced quite enough change in recent times with the loss of the dashboard for managing Google listings and an onslaught of bugs, but when I asked my peers to look ahead, many of them predict significant challenges yet to come for local businesses and their marketers. From Mike Blumenthal: “I would say that while a lot of levers are being pulled getting the Search Interface (NMX) off the ground, it was a change that was totally unnecessary and brought with it both bugs and an attitude of total apathy towards the multi user/agency dashboard. The other big, hardly reported on changes were the move to AI first moderation of reviews AND images, introducing GPB behaviors that are perceived as totally illogical by the small business community.If the intention of the NMX was to simplify and engage, why layer on totally obtuse moderation decisions for reviews and images while providing no clear guidance as to what was happening and how to deal with it?” From David Mihm: “What Google is doing in Local is officially anyone’s guess at this point.Regardless of the level of internal resources devoted to Google Business Profiles as a product (which clearly fell off a cliff beginning in late 2021), the current NMX/skeleton dashboard version of GBP lacks a coherent vision and a poor (any?) understanding of user needs and pain points. Not to mention myriad functional bugs including 404 errors when trying to upload photos, inability to save store codes on newly-created locations, and inability to deny (or even confirm, in many cases!) user-suggested edits.As usual, there seems to be no institutional knowledge of Google’s long history of internal failures and weak spots in its Local product or Maps data, or anyone with power making a strong case for the centrality of GBP in the marketing ecosystem — even for large multi-location brands which are spending millions of dollars annually on Ads.It feels to me as if Google’s “strategy,” such as it is, is to simply ignore SMBs as a meaningful source of data for Maps and Universal results, and to force multi-location brands to work with a partner like Yext/Uberall/etc. for a real product interface. Given that Big Tech is cutting headcount and investment across the board, I can’t imagine the situation will change for the better in 2023.” From Amanda Jordan: “I expect to continue to see pretty drastic changes for local for at least the next couple of years. I think local has been under the radar for Google for awhile and COVID has really brought Google’s shortcomings for local to light. Now they are correcting the experience for SMBs who may have been neglecting SEO until they depended on it during COVID and were overwhelmed by GBP management. I think we’re going to see Google testing a lot of changes for local in SERPs. Local mobile SERPs will be one of the most interesting places to watch next year.” Meanwhile, Greg Sterling offers a candid theory on why some of the local changes may be taking place: “Google recognizes local content and maps remain critical for its users, especially mobile users. But the company is disappointed by the number of SMBs engaging with GBP, and GMB before it. Hence the move from the app to the web. In many ways Google has been less successful monetizing small businesses than Facebook, which doesn't have a consumer-facing local product. GBP isn't the onramp to ads Google had hoped. I believe, internally, there are now reduced expectations and support for local on the B2B side. NMX comes out of this larger context.” I find all of the above comments to be probable, realistic, and insightful, but I also want to be sure to mention that there isn’t a complete consensus on trends. At least one respected colleague, Ben Fisher, has a more comforting view that we may already have weathered the biggest changes: “The big stuff is behind us for now I think. Mainly the name change and in-Search experience.The in-Search experience was planned for a long time and Google in their infinite wisdom decided it was the best route to go based on data. I think that with the rollout of this new in-Search experience that new 'bugs' and aggressive 'features' will come to pass.Next year I think we are going to see ongoing tweaks. I would predict that the review filtering will probably get worse as we have seen with reviews leaking on a daily basis. Also it took over three months for reinstatements to go back to a normal timeframe. Next year I think we can expect this to go haywire again. It feels like it happens yearly.One thing I think is certain: Google looks to fix problems at scale and all but ignores the little guy, and in some cases can cause horrible consequences to non-guilty merchants. That being said, one other thing is constant, they will do their best to 'fix' the issue.” Finally, Garrett Sussman’s take on the impact of MUM should not be missed: “In 2022, Local SEO has felt the impact of Google’s MUM algorithm more than anyone. A local search on a mobile device is sliced and diced by various contextual query refinements:• Places• ‘Find places through photos’• Google Explore• DealsThey’re all showing up and influencing every single local result. It forces local business owners to improve their content on their own site, build out their listings on review sites, and earn mentions in local media.You can’t only focus on your Google Business Profile. But when people do search for your business specifically, you need to provide as much information as possible, because people expect it:• You need your office hours to be accurate• You need fresh and positive reviews• You need photos of your businessIt’s never been more important for a local business owner to have a digital presence on Google.” Taken altogether, there is a high level of dissatisfaction with Google’s handling of local as we throw the discus into 2023, and there is a definite sense that there will be bug and feature hurdles all along our lane. Our expert commentary depicts Google local search in a marked state of flux. I personally find it counterintuitive that Google is shortchanging local right now, given that local data is the biggest ace the search titan has up its sleeve in its contest with Amazon. Whatever their motives, It’s not great news for our industry, but it’s vital to be real about the present state of local so that we can cut our coat to suit our cloth. Even amid volatility, good strategy is absolutely still possible. Harnessing the human power of local in 2023 Image credit: Memories of Days Gone By “Be kind, for everyone you meet is fighting a hard battle.” ― Socrates When I consider the level of concern currently being expressed in the SEO industry over the rise of disinformation that may ensue as a result of inventions like ChatGPT, the pitfalls of programmatic moderation of key local content like reviews and images, and the failure of Google to adequately support the millions of local brands they represent on their platform, I think we have to dig deep into human resources to counterbalance the shortcomings of machines. Here are my top three recommendations for a smart local business strategy for 2023. 1. Shortcut the path to a real human in every way you can I see signs everywhere that people are at a tipping point of fatigue over being “handled” by robots. Multi-step phone trees and long hold times are truly wearing. Chat functions that never result in human contact feel cold and impersonal. Websites that hinder rather than assist customer journeys are no-win on both sides of transactions. In 2023, achieve the least possible distance between customers and live customer service with the following methodologies: 69% of surveyed American consumers prefer talking to a live person by phone for customer support. The majority list their top pain points as being long hold times, disconnects, and having to start over again with each phone agent so that issues take too long to get resolved. If short staffing is causing long hold times at your business, implement call-back technology so that the customer can go about their life while waiting to hear from a live person, and be sure that every public-facing staff member is well-trained in your products, services and policies so that a customer has to talk to the fewest possible people in your organization to get answers to their questions. 46% of customers believe businesses use chatbots to prevent them from reaching a live person and 60% would rather wait for a live person than talk to a bot. However, if you are using chatbots as after-hours support, it can be a useful tool. Just be sure your interface clearly identifies that it is automated, covers FAQs so that answers are provided in a pinch, and then capture customer contact information so that a human engagement can begin as quickly as possible following the chat.If you’re using livechat, know that over ½ of customers expect a response within minutes. Applications like this must be staffed just as you would staff your phones to avoid customers feeling ignored and abandoning the brand.44.5% of customers aged 35-54 say that texting is their preferred method of communicating with businesses and the previously-cited Leadferno study found that about ⅓ of people expect a response within a day when they text a company. Given the difference in expected response times, texting may be a better option for brands with minimal staff, so that customers aren’t being lost to unfulfilled expectations.Email remains a key channel for customer support, but one survey found that 62% of companies don’t respond to email-based customer service requests, 90% don’t send an email confirming that the question has been received, and just 20% of businesses are able to provide a complete answer on the first reply. These are startling statistics that speak to the need to staff your inbox so that customers are receiving prompt, well-informed emails to every inquiry.Finally, one of the greatest challenges of the past few years has been short staffing for local businesses due to the ongoing pandemic. Wherever doors are open, customers still want to be greeted and assisted by well-trained staff, but the realities of a labor shortage, COVID, and Long COVID mean businesses and customers need to lean more heavily on additional, non-human resources such as the answering of FAQs on in-store and storefront signage, company websites, and local business listings. We’ll examine these points next. 2. Let good tools come to your rescue in tough times Regardless of what AI fans may say, there is no replacement for the human relationships that are the basis of doing business locally. That being said, when external conditions cause staffing shortages, it’s time to consider the long history of humans’ ingenious use of tools to aid labor. Like the sea otter and the heron, we can select props to make it easier to achieve our goals, and in 2023, local business owners should ensure that customers are being served even when a staff member isn’t immediately available. Focus on these areas: The New Merchant Experience that replaced the former Google Business Profile dashboard in 2022 was widely judged to be a usability fiasco, particularly for multi-location brands. Restore ease of management by using software like Moz Local to regain the quiet, dedicated workspace you need to manage your listing on Google and on the most prevalent local business listing platforms, all in one place.Be sure the listings you’ve created are fully filled out with accurate information so that customers get fast answers to common questions about your location, contact info, hours, services, products, and policies. Add your products, take more photos this year, and set yourself up to begin filming aspects of your business. Google has finally started featuring local business videos and I would recommend filming 30 second videos in which a friendly person from your company answers your top FAQs. 96% of your customers read reviews and 60% of review writers expect a response from your business within 2-or-less days. Make this the year you envision reviews as a two-way conversation, charged with the knowledge that when your responses resolve complaints, 63% of reviewers will update their negative review and 62% will give your business a second chance. Make 2023 your most communicative year yet by studying The Impact of Local Business Reviews on Consumer Behavior. But, do be careful how you are asking for reviews this year, given recent research from Mike Blumenthal on the startling causes of reviews being filtered out by Google. Broaden your communications channels. Try an after-hours text hotline if you’ve never had one before. Experiment with video-based support, live chat, and callbacks. Make 2023 the year you emphatically decide whether channels like TikTok or Instagram are a good fit for your customers and brand. The easier it is for people to discover and reach your business, the better. 3. Faced with facelessness, buck trends Why is it that Patagonia’s founder declared Earth its only shareholder? Why is it that when everyone was saying that bricks-and-mortar was dead and all sales would be happening via e-commerce, Warby Parker began doubling down on physical storefronts so that people lacking prescriptions could get an on-site eye exam? Why, despite looming recession, has someone opened a successful restaurant for dogs in San Francisco, betting that people will splurge on their animal friends even if they are budgeting for themselves? These scenarios aren’t just about fighting the tide and daring to be different – they’re about daring to be human and to understand what people care about, need, and love. The people behind ideas like these really took time to understand the realities of a society longing to fight Climate Change, needing accessible vision care, and wanting to have low spirits raised by doing something special for a cherished pet. Having a real face (and a real heart behind it) in an increasingly automated, impersonalized world could be the thing that sets your local business apart in 2023. In some executives’ strange dreams, human value is measured in the mass consumption of products, and now, of AI-driven content. Local business owners know better, from lived experience. In this new year, embrace the narrative of your business being operated by real people who serve real neighbors in real ways, with personality and charm that can’t be replaced by bots. This won’t be an easy race, but it’s worth running, whatever the odds. In wishing you success in the local business year ahead, I’d like to close with the words of Wilma Rudolph, who overcame infantile paralysis caused by polio and went on to become an Olympic champion: “Never underestimate the power of dreams and the influence of the human spirit. We are all the same in this notion: The potential for greatness lives within each of us.” Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "2023 Local SEO Success: Human Power in a Year of Change"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "2023 Local SEO Success: Human Power in a Year of Change"
    },
    {
      "level": "H2",
      "text": "Citius, Altius, Fortius"
    },
    {
      "level": "H2",
      "text": "Harnessing the human power of local in 2023"
    },
    {
      "level": "H3",
      "text": "1. Shortcut the path to a real human in every way you can"
    },
    {
      "level": "H3",
      "text": "2. Let good tools come to your rescue in tough times"
    },
    {
      "level": "H3",
      "text": "3. Faced with facelessness, buck trends"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}