{
  "url": "https://moz.com/blog/25-ethical-tips-that-will-skyrocket-your-search-engine-rankings",
  "slug": "25-ethical-tips-that-will-skyrocket-your-search-engine-rankings",
  "title": "25 Ethical Tips That Will Skyrocket Your Search Engine Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "These days, it's hard to find legitimate content that will really help your SEO campaign reach its potential. Most of the time, the content you can find really doesn't help you or is just explained badly.\n\nSo today, I will be giving you 25 tips that used effectively, will skyrocket your search…",
  "content": "25 Ethical Tips That Will Skyrocket Your Search Engine Rankings Content Marketing T By: trafficke.com June 30, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! T By: trafficke.com June 30, 2010 25 Ethical Tips That Will Skyrocket Your Search Engine Rankings Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. These days, it's hard to find legitimate content that will really help your SEO campaign reach its potential. Most of the time, the content you can find really doesn't help you or is just explained badly. So today, I will be giving you 25 tips that used effectively, will skyrocket your search engine rankings. These tips don't fail to focus on every aspect of ethical and organic SEO. Search engine optimization is a wondrous thing. There are so many good ways out there to boost your search engine rankings that it is often difficult to keep track. Therefore, it's important to know which methods are the most powerful in order to get good search engine rankings, often with little effort. Avoiding the rest saves time and could end up saving you from a Google penalty. And without further ado, let's begin our list with a little thinking: Think about what you're offering - With search engine optimization you must always keep in mind what a visitor gets/can get from your website. Whether it's reading free blog content or the opportunity to buy a product, make sure there is a reason why people should come and visit your website, and always remember it. This will help you focus your SEO content on the keywords that matter. Think about what people are looking for - A bit of an extension from the last tip, it's very important that during keyword research, you should know what people are looking for. What you're offering and what potential ad-clickers/subscribers/customers are looking for is rarely the exact same. However, you can make it that some of your main keywords are what people are actually searching for. This works great with longtail keywords, even after Google's May Day update. For example, if your a car dealer, because people looking for a car might search \"affordable safe cars\", make that one of your keywords, even if some of your cars are expensive. Internal linking is key - How can you rank high in search engines without too many external links? Although most webmasters, even those involved in internet marketing and SEO don't know it, internal links are just as important as incoming links from external websites. Learn more about internal linking. Use anchor text - Any kind of link can be made more beneficial to your website by using anchor text. Anchor text is your actual link text. What does anchor text tell search engines? What keywords you want to rank high for. \"Click Here\" isn't exactly a great link anchor text. Learn more about using anchor text effectively: How To Target Keywords Using Links. Your page titles aren't supposed to be focused on users. - They are supposed to be focused on delivering your important keywords to search engines while still making sense to ordinary visitors. For example, a great page title would be \"25 Search Engine Optimization Tips\" and not \"25 Tips That Will Skyrocket Your Search Engine Rankings\". Although the second title has more words, the first one puts a lot more focus on the biggest keyword: \"Search Engine Optimization Tips\". So titles are for search engines. Where do you focus on pulling on readers? Your post titles. (If this wan't obvious, your post titles don't have to be and shouldn't be the same as your page titles.) Your post titles should contain keywords, too. - Although, as said before, the page title is the place to focus on SEO, your post titles shouldn't be left alone completely. Make sure your post titles have your most important post keywords, while still attracting visitors. Don't use dirty URLs - URLs are another opportunity to tell search engines what your page is about, and if you have a dirty permalink structure, URLs are just a missed opportunity. But know that they don't have to be. With a little help from Wordpress, you can get yourself some awesome URLs, which will be explained more in the next tip. Use keyword-rich URLs - Building upon Tip #7, it is essential to go beyond using clean URLs. For example, http://yourblog.com/post-123/ may be a clean URL, but it isn't a keyword-rich one. http://yourblog.com/post-name-123/ is a good URL and just http://yourblog.com/post-name/ is even better. To be concise, within your URLs, you should use your main page keywords while still making the URL short and memorable. Use root URLs for important pages - A root URL is the URL of a page that is located at the root folder of a website. For example, http://yourblog.com/about.php is a root URL and http://yourblog.com/about/index.php isn't. Important pages should have root URLs because a root URL signals to search engines that a page is important and should get some extra power. However, overdoing this causes a loss in its effectiveness. (Effectively) Use a navigation bar. - Your navigation bar is a great way to tell search engines what pages of your site are the most important. Because the navigation bar is ranked high by the VIPS search engine ranking technique, which ranks how important certain parts of a page are, links from the navigation bar have a very high priority and transfer a lot of link juice. So in order to effectively use your navigation bar, simply link to pages that you feel are important. Again, overdoing it reduces the power of this technique. Don't be afraid to fill your footer up with content - Your footer is a great place to link to relevant content. For example, as a blogger, you might want to put \"Recent Posts\" and \"Categories\" lists on your footer using plugins. This interlinks your webpages and ensures that no blog post is left behind. :) Write blog posts teeming with keywords - It has always been important to use keywords in your content. But this is especially true if you're a blogger, because as a blogger, you have the opportunity to write thousands of words teeming with keywords and publish it on your website. Non-bloggers, however, don't have this chance. Most bloggers, even business bloggers, don't keep SEO in mind when writing posts. While you should always focus on your actual writing, the best tip I can give you on writing keyw0rd-rich blog posts is that whenever you are in your Wordpress Admin Panel dreaming up a new post for your blog, keep search engine optimization in your head. Make sure search engines don't think your website is two websites - This is a huge mistake in the on-page search engine optimization of most websites. Because most webmasters don't properly indicate that their \"www\" URLs are the same as their \"non-www\" URLs, search engines have reason to believe that their site is split in two parts and half of its content can be copy-and-paste found somewhere else on the site, potentially causing a duplicate content penalty. In addition, your search engine ranking power can potentially be cut in half. To fix this, learn how to redirect your non-www URLs to your www URLs or vice-versa using a 301 permanent redirect. A good tutorial for doing this can be found here: http://www.stepforth.com/resources/web-marketing-knowledgebase/non-www-redirect/. This can also be done using the Redirection plugin for Wordpress. Link to non-indexed content - Unless you manually submit URLs to search engines, (which I do not recommend due to potentially long waiting times and quite frankly, manual submission is a waste of time) it might be true that not all of your content was indexed by the major search engines. So how do you fix this without wasting valuable time with manual submission (for every single page of content you write)? Simply work on linking to non-indexed content. Think about it. How do the search engines naturally crawl the internet even without any submitted URLs? They find links, follow them, and index the linked page. The more powerful the links are, the faster search engines will pick them up and index your content. So by linking to your content consistently and efficiently, you have a good game plan for getting your website indexed in its entirety. Links from external websites aren't even necessary for this process. By linking to your content from other pages on your website, you're helping it get indexed faster - and besides, as a content writer, this shouldn't be hard for you. Just be sure to link to other posts and pages often in your content and you'll be completely indexed in no time. Hint: Don't waste time doing this for archive pages and tag pages, they are unimportant and you should probably add a \"noindex\" tag to those pages anyway to avoid a duplicate content penalty because those pages do nothing but repeat your already-indexed content. Long hint, huh? :) Make it easy for visitors to share - Most serious bloggers implement sharing plugins into their blogs. But most of the time, the usual sharing plugin isn't enough. My favorite, and in my opinion, the most powerful sharing plugin available for any blogging platform is the Topsy Retweet Button. An older alternative is the Tweetmeme Button. Both of these plugins allow readers to retweet in just 2 clicks. You can also use the officialFacebook Share Plugin for Wordpress to allow readers to easily share your posts to their friends. Links from Twitter and Facebook are nofollow, so they have no direct SEO benefit. However, they do have a huge indirect one. New readers from these social networks are a lot more likely to link to and share your content than regular visitors. But that's just indirect SEO using Twitter and Facebook - so what can you do to increase direct linking to your content? Reward linkers - You love links pointing at your content. But so do other bloggers! A great way to reward linkers is giving them a linkback. Luckily, by default, Wordpress does this for you - pingbacks. Pingbacks are acknowledgments of incoming links in the form of linkbacks. Some bloggers believe that pingbacks are only a way for spammers to get links to their own content quickly and easily. All they have to do is link to a blog post of yours, and they get a link from it. I strongly disagree with this idea. Linkbacks are a medium for connections between you and other bloggers, but more importantly, they convince other potentially important bloggers to link to you. Write quality blog comments - Blog comments have a bad rep in the blogging community. Why? Because of the spam bloggers have to deal with every day. But your blog comments don't have to be like this. Blog commenting has the potential to give links that are just as powerful as links from guest posting. By writing quality blog comments on dofollow blogs, you're giving yourself powerful links that are within quality content. My biggest tip for blog commenting is to add to the discussion. Whether it's to agree or disagree, all blog comments should add to both blog posts and previous comments. Give your content a wider audience - One of the best ways to spread your content and your website is to give it a wider audience. Many bloggers are under the impression that the only way to do this is if you're already a highly influential content writer. This is not the case at all with guest posting. Guest posting puts your content and your backlinks on important pages, not only increasing your website traffic but your search engine rankings as well. This post is a guest post. Giving your content to other bloggers in your niche may seem like helping your competitors, which in the long-run, it actually is, but as the writer, you're the one who benefits the most from a guest post. Avoid JavaScript links - Google has only begun reading JavaScript and has said many times in the past that you should avoid JavaScript links. Often, they will not be indexed properly and your links may just turn up to mean nothing in the watchful eyes of search engines. This may hurt your internal linking and could lead to many of your pages not being indexed in search engines. Keep your website fresh - Why do search engines love blogs? Because they are a reliable source of fresh quality content. It's essential, especially as a blogger, to keep your website and its content fresh and updated. One of my all-time favorite resources available on the web right now is only what it is in my eyes because it is updated frequently. But again, keeping your website fresh doesn't just keep visitors coming back for more. With fresh content coming in often, search engines will place more authority on your domain (therefore increasing your search engine rankings) and decide to index your website faster. Your website can always be improved, and so can your copywriting levels. Just remember that although guest posting is powerful, Google has said that your own website should always come first when it comes to your content writing. Tell search engines what your images are about - \"A picture is worth a thousand words.\" Not to search engines - with today's technology, no search engine can index the content present in images. But there still is a way to tell search engines what your pictures are all about. ALT text. \"alt\" is an attribute you may give your images, like this: <img src=\"tree.png\" alt=\"Tree\" /> Your ALT text should tell search engines what a normal visitor would see when looking at your image. You should try to place a keyword or two in your ALT text. Doing this tells search engines what your site's pages in general are about. For the best results make sure every single image on your website is paired with some keyword-rich ALT text. Submit a sitemap - A sitemap is like a guide that search engines can use to index your website. Without it, some of your content may not even get the opportunity to be indexed. In other words, it's important to correctly create and submit a sitemap because it tells search engines about pages that they might not otherwise discover. This holds especially true with blogging. As a blogger, so much valuable content is available for search engine spiders to index, but they won't get to it without a sitemap guiding them. A great Wordpress plugin that I personally use in the automatic creation and even submission of sitemaps is the Google XML Sitemaps plugin. If you use another plugin, you can submit your generated sitemaps and feeds (as sitemaps) to Google Webmaster Tools. Use Google Webmaster Tools - You'd be surprised about how useful Google's webmaster resources are. They have a complete minisite for webmasters and the questions they have, but more importantly, they have made available their webmaster tools. From Google Webmaster Tools, you may submit sitemaps, edit crawling setting for your website, remove sitelinks, change your URL, play around with even more site configuration settings, check some stats about your rankings including links and important keywords that Google has picked up, deal with crawling problems, test your website as Googlebot, and even track site performance. Now there's a reason to use your Google account to get started. Blog comment - But not for the obvious reason - building backlinks. Nope, not even for building connections with other bloggers. Why should you comment on other blogs? For the reasons above, but what else? Actually I'm not even talking about blog commenting. I mean the reason why you should browse blogs and maybe comment on them along the way is that if that they are SEO blogs, by reading and commenting, you are educating yourself in SEO. You may find yourself jumping the ranks because of the new things you learned from visiting blogs and taking a good read. Give visitors a reason to link and share - My final tip of the day. Linkbaiting is important and it is definitely the most organic and natural way to build popularity to your content. So how do you linkbait or \"sharebait\" as I like to call it? As a blogger, just provide content that makes your readers want to share. Just write from the heart and share your experiences with your readers. When I see an article that deserves it, I don't fail to retweet and link to it. Well, I think I've given you enough to read today, so I won't bother writing a \"Bonus\" like you'd probably expect. Instead, I'm leaving it to you. Share your SEO tips and experiences through comments! Oh yeah, and be sure to retweet. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "25 Ethical Tips That Will Skyrocket Your Search Engine Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "25 Ethical Tips That Will Skyrocket Your Search Engine Rankings"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "trafficke.com\n          \n            trafficke.com"
}