{
  "url": "https://moz.com/blog/3-concepts-copy-that-converts",
  "slug": "3-concepts-copy-that-converts",
  "title": "Is Your Writing Readable? 3 Concepts to Master for Copy That Converts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Chunking, word recognition, and universal design are the cornerstones of readable copy. Are you writing in a way your audience can easily understand? In this post, Isla McKetta doles out the top insights from her research into readability and its utter importance.",
  "content": "Is Your Writing Readable? 3 Concepts to Master for Copy That Converts Content Marketing | User Experience (UX) | SEO Copywriting By: Isla McKetta May 25, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Isla McKetta May 25, 2016 Is Your Writing Readable? 3 Concepts to Master for Copy That Converts Content Marketing | User Experience (UX) | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 9 minutes] You know you're supposed to write scannable copy. But do you know why? On the average Web page, users have time to read at most 28% of the words during an average visit; 20% is more likely. – Jakob Nielsen Nope, it's not just that. Although the tiny fraction of attention readers have for your content is always important to keep in mind. But instead of another \"write for the F-pattern reader\" article, let's dig into the psychological underpinnings of how readers process information. You'll learn ways to make your content more memorable and how not to disenfranchise any audience members who struggle with legibility, however unintentional. Don't worry; you don't have to immerse yourself in academic theories for the next three weeks. I've waded through those dusty tomes for you, and I'm here to report back on how readability actually works. I'll also suggest some implications for your content. This'll get a little wonky at times, but I hope you'll learn something from my research. I know I did. These are the concepts I'll cover and where they fall on the legibility, readability, and comprehension spectrum: Chunking (readability) Word recognition (comprehension) Universal design (legibility) 1. Chunking (readability) In the field of user-experience design, ‘chunking’ usually refers to breaking up content into small, distinct units of information (or ‘chunks’), as opposed to presenting an undifferentiated mess of atomic information items. – Kate Meyer Chunking was first identified by George A. Miller in \"The Magical Number Seven, Plus or Minus Two: Some Limits on Our Capacity for Processing Information.\" While the article focuses on how many items we can hold in our memory, Miller goes on to suggest that we can remember more items if that information is properly separated out for us. For example, this string of numbers (even though it only contains eight digits): is harder to understand or remember than this unforgettable number: Those slashes help us parse the numbers into shorter (and more recognizable) units, which makes it easier to understand and remember the information. The span of immediate memory impose severe limitations on the amount of information that we are able to receive, process, and remember. By organizing the stimulus input simultaneously into several dimensions and successively into a sequence of chunks, we manage to break (or at least stretch) this informational bottleneck. – George A. Miller So when you're dividing up your web content with headers, images, bulleted lists, and short paragraphs, consider how those chunks of information are working for you. A listicle of the 100 greatest things about summer might be a lot more memorable if you subdivide that list with headers every 5–9 items. Likewise, if you write single-line-paragraph after single-line paragraph, your reader might get lost on the screen and miss something important. Instead, improve the readability of your content by varying the length of those paragraphs every so often. 2. Word recognition (comprehension) That wasn't too painful, was it? This next concept, an area of research into psycholinguistics called the \"cohort model,\" is a little harder to wade through, but since it speaks to our ability to comprehend information, I'm going to do my best to model that. First, though, you might be thinking \"psycho....what?\" That's exactly the point. We're going to look at some incomprehensible content and then delve into how that affects readers. Then we'll consider how we can convey whatever information we need to and still keep people reading. Faced with a paragraph like this: The cohort model relies on a number of concepts in the theory of lexical retrieval. The lexicon is the store of words in a person's mind; it contains a person's vocabulary and is similar to a mental dictionary. A lexical entry is all the information about a word and the lexical storage is the way the items are stored for peak retrieval. Lexical access is the way that an individual accesses the information in the mental lexicon. A word's cohort is composed of all the lexical items that share an initial sequence of phonemes, and is the set of words activated by the initial phonemes of the word. – Wikipedia All but the most dedicated linguistics nerd would be lost inside that mouthful of incomprehensible information. I know I was. Not only were the concepts foreign, but I hadn't seen a lot of those words since college. So let me try to capture the gist: The cohort model looks at the way we connect a spoken (or in the case of web content, written) word with meaning. The potential meanings for a word start out broad, based on the initial sound/letter. As we see or hear more of the word, the potential meanings narrow down until we can choose which word we are seeing or hearing. We read so quickly that it's difficult to even recognize how our own reading happens. It's easier to think about a word we don't encounter every day like \"psycholinguistics.\" The cohort model suggests our brains first pull out a list of words that start with \"psy\" and begin to narrow down what word we might be looking at: As we read further into the word so that our brains have processed \"psycho,\" the options narrow: Note that although \"psycho\" could have been one of the words we initially thought of, by this point in our attempt to comprehend this word, we've likely also taken in the fact that the word is well over five letters. As we process letters and sounds in reading \"psycholinguistics,\" most of us will find that this is an unfamiliar word — that it does not match up to any word already in our lexicon — and so our brains look for alternate ways to comprehend its meaning. In this case, we'd likely break it down into the most familiar component parts: \"psycho\" and \"linguistics.\" We might still not fully comprehend the word, but we have two possible meanings: 1. something related to both psychology and linguistics, or 2. the linguistics of a psychopath. One of these is more likely than the other... So why do you care? Stop words In this case, it's easy to see how using unfamiliar terminology (or overly jargon-y terms like \"terminology\" when I mean \"words\") slows the reader down. Using these kinds of stop words might even stop a reader entirely and lead them to close your tab and move on to the next site. (Editor's note: Skip Spoerke astutely pointed out in the comments that the phrase \"stop words\" generally refers to tiny words that are filtered out in processing. Here we use it to mean words that actually stop your reading. Consider how that ambiguous meaning affects your comprehension.) Ambiguity Ambiguous words, or those with more than one meaning, might be expected to cause difficulties in lexical processing. – Treiman et al. That's just another way of saying that you can slow a reader down by using words that have more than one meaning. Even very short words can be ambiguous. Context clues do help with comprehension, but if your goal is to convert a reader to a customer, there's no reason to make them think harder than they have to about your copy. So unless you have the linguistic command of a poet and are slowing readers down on purpose, think carefully about possible misunderstandings when you use ambiguous words. Multiple meanings Processing a polysemous word in one of its senses can make it harder to subsequently comprehend the word in another of its senses. – Treiman et al. \"Polysemous\" simply means \"having multiple meanings\" and it can contribute to the ambiguity we just discussed. But the point here is that if you first use a polysemous word like \"bank\" in one context, you should carefully consider whether and how to use that word again. Because we all want to be able to bank on our bank, but sometimes customers would rather throw it over a bank. Have trouble moving from one meaning to the next in that last sentence? Me too, and I wrote it. 3. Universal design (legibility) Legibility can feel like the one aspect of intelligibility that we writers have the least control over (at least on the web). It's rare for us to get asked what font to use or how the color of our text should contrast with the background. But legibility is important to accessibility. To borrow the universal design principle from architecture, if we design our sites (and our content) to be legible by all, we're removing potential blockers for all readers. Felicia, the tireless editor of the Moz Blog, is in talks with our UX crew about making our blog more accessible overall. Having worked at an organization that loved the look of light blue links against grey (and tiny) text, it's something I wish more sites thought about. I'm only picking on AIA Seattle because I was party to some of the website redesign discussions there where members mentioned this very issue. Not only is there very little contrast in color between the links and text, but the links in the left nav are gray while those on the rest of the page are blue. I'd show you their redesigned page, but now you have to hover over text to even see if it's a link. Instead, take a quick look at the page for the national AIA: Writers can help! As Laura Lippay wrote last week for the Moz Blog, by creating and implementing effective title tags, we can improve navigation for people with vision, memory, and mobility impairments. Properly structured headings, something we're using for readability anyway, also help with navigation. Having recently had a baby, I'm finally starting to empathize with readers who are sleep-deprived, having trouble seeing, reading in a second (or third) language, or in a screaming rush. Not to mention people who are dyslexic, grew up in crappy school districts, or are naturally much more gifted in some other area of life than reading. I hope these investigations into readability, comprehension, and legibility can help you create better copy. Your audience is counting on you. And by creating easily intelligible content, you just might keep them around long enough to convert. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Your Writing Readable? 3 Concepts to Master for Copy That Converts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Your Writing Readable? 3 Concepts to Master for Copy That Converts"
    },
    {
      "level": "H2",
      "text": "1. Chunking (readability)"
    },
    {
      "level": "H2",
      "text": "2. Word recognition (comprehension)"
    },
    {
      "level": "H3",
      "text": "Stop words"
    },
    {
      "level": "H3",
      "text": "Ambiguity"
    },
    {
      "level": "H3",
      "text": "Multiple meanings"
    },
    {
      "level": "H2",
      "text": "3. Universal design (legibility)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Isla McKetta\n          \n            Isla McKetta\n          \n            Isla McKetta"
}