{
  "url": "https://moz.com/blog/3-not-so-seo-friendly-trends",
  "slug": "3-not-so-seo-friendly-trends",
  "title": "3 Not-So-SEO-Friendly Trends to Watch Out For - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The constant refrain of \"SEO is dead!\" gets old pretty quickly, but there are some real and present threats to the industry we should be aware of. Daniel Marks describes the trends in question and gives some advice on how to prepare for the uncertain future.",
  "content": "3 Not-So-SEO-Friendly Trends to Watch Out For SEO Basics | Marketing Industry | Advanced SEO By: Daniel Marks February 7, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daniel Marks February 7, 2017 3 Not-So-SEO-Friendly Trends to Watch Out For SEO Basics | Marketing Industry | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It seems like every couple months (weeks?) there’s a new post predicting the end of SEO: But rather than proclaiming that SEO is already dead (it’s not), let’s look at 3 ways in which the SEO industry might eventually die and ways in which SEOs can prepare themselves. 1. New ads Google is constantly experimenting with new ad formats that actually provide a better user experience than organic results. The better the ads, the less traffic that will be captured by organic listings. What are some examples of when PPC ads provide a better UX than organic results? Finding service providers in select cities: Google has rolled out home service ads to a few markets as a way of making it easier to find various contractors. Even sites with incredible local SEO will have a hard time competing with the convenience of these ads, not to mention the extremely valuable endorsement by Google. More info: Google Home Services Ads Launch In AdWords Express Researching cars: This is a relatively simple example of Google providing a bunch of relevant information directly in the SERPs with a simple interface that will, inevitably, come at the expense of people clicking through to organic listings about car reviews, details, dealerships, etc. I suspect that Google will continue rolling out these rich, informational interfaces to high-value verticals such as credit cards, mortgages, legal services, and so on. More info: Google launches its giant mobile search ads for automakers in the US Finding flights: It’s hard to imagine such a prominent, compelling interface not sucking up a decent amount of organic clicks. Google Flights has also likely contributed to the fact that Google earns twice as much travel-related revenue as Expedia. App discovery This is one of the most ambitious ad interfaces that Google offers — you can literally play apps directly within Google! No need to download the app or click through to a site. It’s incredible. Image source SEO hasn’t traditionally been a huge driver of app discovery, so app streaming for games specifically might not be that disruptive to SEOs, but you can imagine this functionality being rolled out for all sorts of purposes. For example, instead of building functionality similar to Google Flights, maybe Google could simply send you to the Kayak app interface within search results and piggyback off the improved user experience of apps dedicated to one specific purpose. More info: Google Adds NEW Interactive Ad Format Targeting Gamers Searching for products As interesting as the previous examples were, the most dangerous Google ad products for most SEOs would likely be the different ones related to product discovery. Product Listing Ads (PLAs), for example, offer a fairly basic interface relative to the previously mentioned examples, but this simplicity makes them very dangerous because it makes them so easy to scale. Google doesn’t need to build a bespoke solution for different verticals or sets of queries. It’s not hard to imagine a future where product queries on Google simply return a large set of product cards with the option to buy directly within the Google interface. The pieces are already there with PLAs and the limited rollout of the ability to buy directly on Google through select websites. All it would take is Google expanding the number of product cards and the number of sites that offer direct checkout through Google. The implications of a shift like this are hard to overestimate. These product-related ad interfaces include: Product Listing Ads (PLAs): Showcase shopping ads: More info: Google rolling out major change to PLAs for broad product queries, among other Shopping updates Buying directly on Google: More info: Winning the shopping micro-moments There are other examples of rich ad interfaces (please share some below, as it’s always interesting to see more!) and Google has many reasons to continue rolling them out as far and wide as possible: To attract more clicks: The more compelling the ad, the more people will click on it, the more money Google will make As a response to ad blockers: Entice users to whitelist Google because their ads are actually a better user experience than organic results Simply a better UX: Finding a handyman through the new format is easier than navigating the organic results, which makes people happy, which makes Google happy What can SEOs do about it? Stay aware of these new ad formats to make sure you’re experimenting with those that are relevant to your business Avoid competing on SERPs that are overtaken by interactive ads Find ways to differentiate your on-site experience from what Google is offering Best-case scenario: Ad-blocking continues to grow and these rich ads remain on a small percentage of overall queries because they’re difficult to scale. 2. New search interfaces What happens when people no longer find what they’re looking for by typing in a Google search and clicking through to a result? Some of these alternative interfaces include: Voice search It’s difficult to rank for a search query that is heavily personalized and has only one result: Non-Google \"search engines\" There are a lot of sites that arguably offer a better search experience for a specific type of query: Wikipedia – Informational queries Yelp – Local business queries Amazon – Transactional queries Will people shift more and more of their searches to sites that offer a search experience tailor-made to one specific type of query? \"Pre-search,\" such as Google Now Google Now effectively tries to give you information you’re interested in before ever having to type in a query: You can imagine quite a few verticals that could be disrupted by improvements to pre-search: Flights: We know you tend to fly home for the holidays. Instead of searching for \"flights to Vancouver,\" we’ll surface some holiday flight deals for you in November. Entertainment: You don’t need to search for a specific movie or play. We’ll surface tickets to events we predict you’ll be interested in before you ever type in a query. Food: We know you’re walking around at dinnertime and there happens to be an Indian food restaurant nearby which we predict you’d like — let’s send you a notification about it. Products: We know you tend to buy Jordan shoes. Let’s show you the latest Jordan release before you ever need to look for it. Using chatbots Perhaps conversational commerce will actually take off and people will start finding products/information by using chatbots: Image source More examples here: 11 Examples of Conversational Commerce and Chatbots in 2016 Shrinking SERPs This has been well-covered, but Google continues to aggressively enrich organic results such that the mythical “ten blue links” SERP only makes up about 3% of searches: The expansion of ads above the fold for some queries hasn’t helped, either. It’s hard to capture organic clicks on a SERP that looks like this (cut off): These changes are especially impactful on mobile devices which already have limited screen real estate as is. What can SEOs do about it? Optimize for whatever “search engine” your users are on. You’ll need to understand where your audience is searching for information that might be relevant to your business and then optimize for the platform they’re on. Use structured data. The easier your site is to understand, the more future-proof it’ll be. Avoid competing on SERPs that are overrun by rich interfaces. Best-case scenario: These new interfaces consume a relatively small percentage of overall searches. They might continue to cover more and more informational queries (“when is Mother's day 2017?”), and personal ones (“set an alarm for 7am”), but transactional queries (“new Jordan shoes”) remain on conventional screens because ultimately, finding products through voice search or a chatbot might not be the most enjoyable experience: 1/ Conversational commerce is unproven, even in Asia. If texting takes more time than clicking a button on a webview, why is it better?— Connie Chan (@conniechan) April 1, 2016 3. New Google? Google could potentially become so good at understanding websites that you don't need to worry about SEO. Good user experience could become 100% indistinguishable from good SEO. Want to use asynchronous JavaScript to render your global nav? Go for it! Want to hide content behind a sign-in wall? No problem! Want to launch your site internationally without hreflang tags? Who cares! Google doesn’t really want to reward a site because it knows what rel=canonical is; it wants to reward it because it satisfied a user's intent. Therefore, Google is inherently working to make SEOs obsolete; maybe one day they’ll succeed. What can SEOs do about it? Broaden your skillset and make sure you’re providing value beyond simply optimizing a website for Google. Best-case scenario: Google will always need the help of SEOs to understand the Internet. Despite these threats, I think it’s very unlikely that SEO disappears as a discipline anytime soon. I have yet to run into a site that doesn't have large SEO opportunities to capture, given the right projects. I also believe the best-case scenario for each threat is actually the most likely scenario. That being said, it can still be helpful to think through future threats to the SEO industry. Can you think of any others? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "3 Not-So-SEO-Friendly Trends to Watch Out For"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "3 Not-So-SEO-Friendly Trends to Watch Out For"
    },
    {
      "level": "H2",
      "text": "1. New ads"
    },
    {
      "level": "H3",
      "text": "Finding service providers in select cities:"
    },
    {
      "level": "H3",
      "text": "Researching cars:"
    },
    {
      "level": "H3",
      "text": "Finding flights:"
    },
    {
      "level": "H3",
      "text": "App discovery"
    },
    {
      "level": "H3",
      "text": "Searching for products"
    },
    {
      "level": "H3",
      "text": "What can SEOs do about it?"
    },
    {
      "level": "H4",
      "text": "Best-case scenario:"
    },
    {
      "level": "H2",
      "text": "2. New search interfaces"
    },
    {
      "level": "H3",
      "text": "Voice search"
    },
    {
      "level": "H3",
      "text": "Non-Google \"search engines\""
    },
    {
      "level": "H3",
      "text": "\"Pre-search,\" such as Google Now"
    },
    {
      "level": "H3",
      "text": "Using chatbots"
    },
    {
      "level": "H3",
      "text": "Shrinking SERPs"
    },
    {
      "level": "H3",
      "text": "What can SEOs do about it?"
    },
    {
      "level": "H4",
      "text": "Best-case scenario:"
    },
    {
      "level": "H2",
      "text": "3. New Google?"
    },
    {
      "level": "H3",
      "text": "What can SEOs do about it?"
    },
    {
      "level": "H4",
      "text": "Best-case scenario:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Marks\n          \n            Daniel Marks\n          \n            Daniel Marks"
}