{
  "url": "https://moz.com/blog/3-search-marketing-tools-worth-a-look",
  "slug": "3-search-marketing-tools-worth-a-look",
  "title": "3 Search Marketing Tools Worth a Look - Refined Ads, WordButler & Advanced Web Ranking - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the last couple weeks, I've seen some very cool new (and older, but \"new to me\") tools in the search marketing field that I think are worthy of testing to see if they make a good fit for your organization. I know I don't cover 3rd party tools as much as I should, so to make up, I've got 3 in a…",
  "content": "3 Search Marketing Tools Worth a Look - Refined Ads, WordButler & Advanced Web Ranking SEO Tools By: Rand Fishkin July 8, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 8, 2008 3 Search Marketing Tools Worth a Look - Refined Ads, WordButler & Advanced Web Ranking SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the last couple weeks, I've seen some very cool new (and older, but \"new to me\") tools in the search marketing field that I think are worthy of testing to see if they make a good fit for your organization. I know I don't cover 3rd party tools as much as I should, so to make up, I've got 3 in a row. The first, Refined Ads from Thomas Bindl's Refined Labs, is a game-changer in the PPC management space. The goals behind the project were to save PPC marketers time and energy through a more intuitive, more robust interface that took the pain out of the often tedious PPC management process. I'll walk through a few of the screenshots Thomas sent over to help illustrate: An integrated keyword discovery and search volume estimator tool (using the AdWords API) lets you use the same software to select that you do to manage. When adding keywords, this spiffy interface lets you select the keyword match type on the fly. The report data tabs are completely customizable, so you can choose which metrics you want to see and order the results by virtually anything. With some tracking code embedded, you can see the statistics from your efforts right in the software - no need to load up your analytics software or run to Google/Yahoo! to get the data. For special instructions or to make transitioning between multiple parties easier, Refined even has a custom note adding ability. Now, obviously, I'm not a PPC expert, but I know Thomas is, and he's been working on this since I visited his new operation in Munich last spring. The buzz I've heard is that this is a top notch tool - the only information I don't have is on pricing. You'll have to talk to Refined to get that :) Next up is a new tool from the gang at MindValleyLabs, one of my favorite blogs on the web (and one of the few where I actually read every post top to bottom). The product is \"WordButler\" and it aims to compete in the space filled by other 3rd party keyword research tools like Wordtracker & KeywordDiscovery. There's three things you can do with WordButler. The first is keyword list creation: It's not a bad system, but it would be great to have the terms/phrases they list as keyword phrases sortable in some type of popularity order. The copy and export functions are pretty solid, though. Next up is keyword traffic estimation: This is my favorite of the features it offers, since it not only predicts CPC, but traffic on each of the engines. Unfortunately, as with all keyword tools, when I plugged in traffic for terms and phrases I'm familiar with, the estimated clicks (I'm assuming it's for all SERPs) didn't match up very well. It's accurate in relative terms, but like the others, can be pretty wrong when it comes to precise numbers. Finally, WordButler has a keyword suggestion system: The keyword I used was \"solar energy,\" and in fact, when I tried phrases like \"alternative energy\" or even just \"energy\" I got a lot of \"cheap flights\" and \"cheap hotels\" suggestions. I think this is an area in need of refinement, but I suspect they'll get better over time :) As a special treat for SEOmoz blog readers, MindValley Labs is offering all readers the ability to download a free trial of the software here - http://www.wordbutler.com/products/promo/blogreaders. The trial lasts 7 days, after which it's $147 per year or $20 a month. Last up in the tools review, we've got Advanced Web Ranking, a rank tracking system from Caphyon. I don't actually know anyone there - this was just a tool I stumbled across that kept getting positive mentions in the blogosphere. The goal of AWR is to help you track rankings at the search engines for specific terms and phrases. As you probably know, Google in particular frowns on this practice because they don't like automated rank checking. On a personal level, I'm actually opposed to rank checking as well, though for entirely different reasons. I don't like to watch rankings primarily because they're a terrible metric for progress when compared to your web analytics (which report actual search traffic visit numbers). I'll go into a few reasons I'm so fundamentally against rank tracking: Rank tracking is inherently inaccurate: Rankings fluctuate hour-to-hour, never mind day to day. Universal search inclusion has made standard rank checking pointless on queries that include vertical results. Different data centers show different results. Personalization means that many searchers aren't seeing what you're seeing. Geo-targeting happens even at the state and city level now, meaning that for tons of searches, you're getting different ranking information than what other searchers see. Your rankings don't actually tell you anything substantive: If you were #3 yesterday and you're #5 today, what action are you going to take? Other than being interesting, it does nothing for you. If your rankings rise 3 or 4 positions, the same is true - it's nearly impossible to reverse what you did right and be sure. Once again, visitor analytics are a far better tool to judge. Exception - I do like knowing what page I'm ranking on Getting page-level rankings (e.g., page 1 for \"seo tools,\" page 2 for \"seo,\" etc) is great because I can use that to find low-hanging fruit and put a little extra effort into getting onto page 1. It would be great, technically, to see results grouped by 5 (top 5, 5-10, 10-15, etc.), but that's a level of detail you can't get from analytics, and with rank checking so inaccurate (see above), it's not worth it, IMO. All that said, SEOmoz will probably be building some sort of rank tracking tool in the future, just because the demand is so high (but I'll continue to rail against it even after that). Ok, rant over. Let's look at the tool: The overview is pretty solid, showing the websites you're tracking, the keywords being followed, and the ups and downs of rankings. I'm not sure why they include Alexa, though! The \"Current Rank\" report shows the list of websites and their relative positions for a given term/phrase. You've also got the date function at the top, which, while nice, would actually be better to show in the columns (IMO). The column view for rankings is good because then you can compare long term progress over time, rather than just one day vs. another. This report tries to mimic the SERPs themselves with historical rankings changes you can see. It would be great to see an aggregated data function for this, but as is, it's serviceable. All in all, the Advanced Web Ranking toolset is a solid effort into rank tracking software, but it's nothing game changing. I think there's still a lot of opportunity to build a great tool in this space, but I'm ever mindful of the rank tracking issues I talked about above and Google's public distaste and public statements about tools like Web Position Gold. Hopefully you've enjoyed peeking inside some of the latest tools for making SEO/M easier. Feedback is certanly welcome, not just by me, but, I presume, by the tool's creators as well. If you've got some alternates to these that you want to bring up, feel free to do so (and to link) in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "3 Search Marketing Tools Worth a Look - Refined Ads, WordButler & Advanced Web Ranking"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "3 Search Marketing Tools Worth a Look - Refined Ads, WordButler & Advanced Web Ranking"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}