{
  "url": "https://moz.com/blog/3-tactics-for-hyperlocal-keywords-whiteboard-friday",
  "slug": "3-tactics-for-hyperlocal-keywords-whiteboard-friday",
  "title": "3 Tactics for Hyperlocal Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Reaching the perfect audience is priceless, but hyperlocal keyword research is frustrating. In this Whiteboard Friday, Rand shares how to find powerful, laser-focused keywords to bring you *exactly* the customers you're looking for.",
  "content": "3 Tactics for Hyperlocal Keywords Whiteboard Friday | Local SEO | Keyword Research By: Rand Fishkin February 24, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 24, 2017 3 Tactics for Hyperlocal Keywords Whiteboard Friday | Local SEO | Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Trying to target a small, specific region with your keywords can prove frustrating. While reaching a high-intent local audience is incredibly valuable, without volume data to inform your keyword research, you'll find yourself hitting a wall. In this Whiteboard Friday, Rand shares how to uncover powerful, laser-focused keywords that will reach exactly the right people. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about hyperlocal keyword research. Now, this is a big challenge, not only for hyperlocal-focused businesses, but also for all kinds of websites that are trying to target very small regions, and many of them, with their keyword research and keyword targeting, on-page optimization. The problem:So the problem tends to be that most keyword research tools, and this includes things like the Google AdWords Tool, it includes Moz's Keyword Explorer, or KeywordTool.io, or Übersuggest, or anybody you want to use, most of them are relying on volume data. So what happens is when you see a bunch of keyword suggestions, you type in \"Sequim,\" for example, Sequim is a tiny town on Washington's peninsula, so across the Puget Sound from where we are here in Seattle. Sequim has a population of like 6,500 people or something like that, so very tiny. So most searches related to Sequim have no volume data in any of these tools. As a result, you don't see a lot of information about: How can I target these keywords? What are the right ones to go after? You don't know whether a keyword has zero searches a month, or whether it has four searches a month, and those four searchers are exactly who you want to get in front of, and this is really problematic. There are three solutions that we've seen professional SEOs use and that some of us here at Moz use and the Moz Local team uses, and these can be real handy for you. Solution 1: Use keyword data for larger, similar regionsSo the first one is to basically replicate the data by using keyword information that comes from similar regions nearby. So let's say, okay, here we are in Sequim, Washington, population 6,669. But Port Angeles is only a few miles away. I think maybe a couple dozen miles away. But its population is more like 20,000. So we've got four or five times the keyword volume for most searches probably. This is going to include some outlying areas. So now we can start to get data. Not everything is going to be zero searches per month, and we can probably backtrack that to figure out what Sequim's data is going to be like. The same thing goes for Ruidoso versus Santa Fe. Ruidoso, almost 8,000. But Santa Fe's population is almost 10 times larger at 70,000. Or Stowe, Vermont, 4,300, tiny, little town. Burlington is nearby, 10 times bigger at 42,000. Great. So now I can take these numbers and I can intuit what the relative volumes are, because the people of Burlington are probably similar in their search patterns to the people of Stowe. There are going to be a few differences, but for most types of local searches this will work. Solution 2: Let Google autosuggest helpThe second one, Google autosuggest can be really helpful here. So Google Suggest does not care if there's one search a month or one search in the last year, versus zero searched in the last year. They'll still show you something. Well, zero searched in the last year, they won't show you anything. But for example, when I search for \"Sequim day,\" I can intuit here, because of the ordering that Google Suggest shows me, that \"Sequim day spa\" is more popular than \"day care.\" Sequim, by the way, sounds like a lovely place to live if you are someone who enjoys few children and lots of spa time, apparently. Then, \"day hikes.\" So this technique doesn't just work with Google itself. It'll also work with Bing, with Google Maps, and with YouTube. Another suggestion on this one, you will see different results if you use a mobile device versus a desktop device. So you might want to change it up and try your mobile device. That can give you some different results. Solution 3: Use lexical or related SERP suggestionsAll right. Third tactic here, last one, you can use sort of two styles of keyword research. One is called lexical, which is basically the semantic relationships between words and phrases. The other one is related SERP suggestions, which is where a keyword research tool — Moz Keyword Explorer does this, SEMrush is very popular for this, and there are a few others — and they will basically show you search terms the links that came up, the search results that came up for \"Sequim day care\" also came up in searches for these terms and phrases. So these are like SERPs for which your SERP also ranked. You can see, when I searched for \"Sequim day care,\" I did this in Keyword Explorer, because I happen to have a Moz Keyword Explorer subscription. It's very nice of Moz to give me that. You can see that I used two kinds of suggestions. One are related to keywords with similar results, so that's the related SERPs. The other one was based on closely related topics, like the semantic, lexical thing. \"Sequim day care\" has given me great stuff like \"Banbury School Nursery,\" a nearby town, \"secondary schools in Banbury,\" \"Horton Day Nursery,\" which is a nursery that's actually near there, \"Port Angeles childcare,\" \"children's nursery.\" So now I'm getting a bunch of keyword suggestions that can potentially be relevant and lead me down a path. When I look at closely related topics, I can see things like closely related topics. By the way, what I did is I actually removed the term \"Sequim,\" because that was showing me a lot of things that are particular to that region. But if I search for \"day care,\" I can see lots of closely related topics, like day care center, childcare, school care, special needs children, preschool programs, and afterschool programs. So now I can take all of these and apply the name of the town and get these hyperlocal results. This is frustrating still. You don't have nearly the data that you have for much more popular search terms. But this is a good way to start building that keyword list, targeting, experimenting, and testing out the on-page work that you're going to need to do to rank for these terms. Then, you'll start to see your traffic grow from these. Hyperlocal may be small, but it can be powerful, it can be very targeted, and it can bring you exactly the customers you're looking for. So good luck with your targeting out there, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "3 Tactics for Hyperlocal Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "3 Tactics for Hyperlocal Keywords"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The problem:"
    },
    {
      "level": "H2",
      "text": "Solution 1: Use keyword data for larger, similar regions"
    },
    {
      "level": "H2",
      "text": "Solution 2: Let Google autosuggest help"
    },
    {
      "level": "H2",
      "text": "Solution 3: Use lexical or related SERP suggestions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}