{
  "url": "https://moz.com/blog/30-search-secrets-revealed-amazing-people-met-incredible-sites-seen-at-smx-sydney",
  "slug": "30-search-secrets-revealed-amazing-people-met-incredible-sites-seen-at-smx-sydney",
  "title": "Search Secrets Revealed, Amazing People Met, & Incredible Sites Seen at SMX Sydney - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As SMX Sydney wound to a close on the north bank of Sydney harbor, I stood with new friends and old, eating shrimp off the barbie (no, really), drinking beer and staring at the incredible view of the Sydney Opera House & the Harbor Bridge. Was this the best conference I've ever attended? Quite…",
  "content": "Search Secrets Revealed, Amazing People Met, & Incredible Sites Seen at SMX Sydney SEO Events By: Rand Fishkin April 12, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 12, 2008 Search Secrets Revealed, Amazing People Met, & Incredible Sites Seen at SMX Sydney SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As SMX Sydney wound to a close on the north bank of Sydney harbor, I stood with new friends and old, eating shrimp off the barbie (no, really), drinking beer ,and staring at the incredible view of the Sydney Opera House & the Harbor Bridge. Was this the best conference I've ever attended? Quite possibly, yes (and that's saying a lot). The unbelievable view from the SMX Sydney \"Under the Bridge\" BBQ Top SEO/M Related Things I Learned at SMX Sydney According to Marissa Mayer, this whole Yahoo! trying Google ads is actually Google testing Yahoo!, not the other way around. This brings a whole new perspective to the Microsoft/Yahoo! acquisition. Yahoo! offers URL simplification (I feel really dumb that I didn't know about this, since I've been clamoring for it for years) and, sadly, according to Adam Lasnik, Google says they don't think webmasters really want it. Even in Australia, savvy newspapers and offline media portals are building social media marketing and promotion positions to help get their content in front of linkerati. I was shocked by the level of sophistication, which, in some instances, exceeds that of their American counterparts. Note the 4,000+ Digg entries for newspaper The Age. Google's doing an eensy weensy bit of evil with their policy on \"search inside.\" During our final panel, an audience member asked how their site could opt out of search inside, to which Adam Lasnik responded that Webmaster Tools and Google did not have a way to let folks opt out. However, his counterpart from the AdSense team, Frederick Vallaeys, noted that if you're a large advertiser, you can contact your AdWords representative, who can help get you on the removal list. Apparently, this is how companies like eBay and Amazon had their \"search inside\" features turned off. As I mentioned through Twitter, Kalena Jordan's Search Engine College offers course credit to students in the US, which is the first I've heard of university level credit for SEO training - bravo! Social Media is big in Australia - there's a Digg clone, Confer, popular blogs (like Lifehacker Australia), social media divisions inside many of the major publications, including The Age and the Sydney Morning Herald, and heavy use of LinkedIn for business networking. Social networking as a whole is exploding down under. Search market share in Australia - Google ~80%, Yahoo! ~10%, Microsoft ~10%. The Australian media world is a bit worried about the potential Microsoft/Yahoo! deal. Both MSN & Yahoo! have media relationships with large portals - Channel 7 for Yahoo! and Channel 9 for MSN. The media landscape could be vastly different with a combined Yahoo!/MSN. Twitter can drive huge traffic. Danny noted to me during our visit that he can Twitter and get 500+ visits in a few minutes to a post. Referring traffic to SEOmoz from Twitter has been rising - it was in the top 20 domain referrers last week. So much for ignoring the power of Twitter. High broadband speed in Australia is tough to find - ADSL is still the most popular connection speed. Viral video on the web is an incredibly inexpensive, powerful branding tool. I intend to write an entire post about this topic, as Ciaran's presentation and case studies on the subject were fascinating. His agency achieved 5million+ of views for an ad that cost a fraction of a traditional TV spot. Check out Do The Test - no wonder it was so successful; even I want to email that around. A couple awesome, secret things that I really wish I could talk about, but sadly can't... People Met During SMX Sydney (in no specific order): Lucas Ng & his colleauge Mark Vazzo from Fairfax Digital. I still think Lucas is one of the sharpest minds in SEO, and hope that he'll contribute to SEOmoz again in the near future :) Frank Grasso from eChannel - whose brilliant long tail keyword research software crawls and analyzes sites for terms to bid on (his background was first in SEO, but he moved to PPC when he saw the more scalable opportunity). Tania Zanetti from Sensis - their booth's unlimited quantities of Krispy Kreme donuts kept us going throughout the show. Tim McDonald from Found Agency, who had a great presentation on PPC tactics Aidan Beanland from Yahoo!7 - Aidan's one of Yahoo!'s biggest SEO success stories, having helped optimize dozens of properties for Yahoo! (working in conjunction with Laura Lippay) worldwide and in Australia. Michael Motherwell - his ISOS blog was one of my favorites for years, and I've always loved seeing him on Cre8asite forums, too. Kalena Jordan, Chris Dimmock, Philip Shaw, Peter Newsome, Jason West, and many, many more... If only I had time to name them all. A Photo Essay of Our Trip: Sydney is almost certainly one of the most beautiful cities in the world. Clean, vibrant, architecturally stunning, and surrounded by water, it's hard not be amazed by a visit. To help share, I thought it would be fun to compile a roundup of some photos from the trip: The first night of the conference, we visited Acquos restaurant near the Olympic Swimming Pool (where Jane's been many times before). From left to right, Rand, Mystery Guest, Ani Babian from Microsoft Live Search, and Jane. Jacqui Jones from Netconcepts interviewed me on the boardwalk along Luna Park. I'll link to that video as soon as it's up. Danny Sullivan and I had a short meeting on the pier - Luna Park, a functioning amusement park, is pictured in the background. Jane gets interviewed by the Netconcepts team - she's keeping the topics a secret, so even I have to wait to find out what she said (crossing fingers no SEOmoz secrets were revealed). The crystal ballroom was the largest of the presentation areas for the conference. Above is a shot of one of our final panels, a site review of domains like Seek.com.au and DiscoverTasmania.com. From Left to Right: Frederick Vallaeys, Guy Wayland, Adam Lasnik, Michael Motherwell, Gord Hotchkiss, Ani Babian, Rand Fishkin, Ciaran Norris, Jane Copland, & Danny Sullivan. And yes, I did manage to Rickroll SMX Sydney with a little help from the A/V team :) Gord Hotckiss on Manly Beach - just a 30 minute ferry ride from downtown. Jane, Ciaran, Allison & Barry Smyth, Rand, & Mystery Guest in front of the Opera House on our final night in town. For shame Flightcentre - cloaking with user agents is so 1990's :) Why SMX Sydney was, quite possibly, the best conference I've attended: Location - Luna Park is just across Sydney Harbor from the Opera House, with tremendous views of the city and quick access by ferry to downtown and Circular Quay. People - Not only are folks friendly, they're also polite, great note takers and endlessly interested in the topic. There's a lot of companies here clearly making their way through competitive SEO. Content - It's not extremely rare that I walk away from a conference learning something new, but I was impressed that in 2 days, the show went from the basics to the advanced without anyone appearing to skip a beat. Speakers - The presenters were universally interested and focused on the audience, their material, and in providing the best content possible. Jane & I both put in significant effort on our presentations (I even created a whole new deck on link building), and from what I saw, the other speakers did as well. Good booths/expo hall - the expo hall was not only packed (every slot was filled), it had several cocktail and lunch events that made for a lot of value and chatting with those who had a booth. I was impressed with the level of interaction between all of the attendees with the sponsors - I think it really added something to the show, which can be tough to achieve. Great use of technology - Every seat had a handheld voting device that was used at the beginning of every session to do live audience polls far more scientifically and accurately than raising hands. The devices also doubled as microphones, so when an attendee wanted to ask a question, they could speak into their device and be heard by all. Finally, you could text in questions to the panelists with the devices during the sessions, which worked brilliantly, not only for getting good questions answered, but also for heckling anonymously and invisibly (to everyone but the panelists) :) Am I coming back next year? Absolutely. Congrats to Barry Smyth - this was an incredible show by every measure. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Secrets Revealed, Amazing People Met, & Incredible Sites Seen at SMX Sydney"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Search Secrets Revealed, Amazing People Met, & Incredible Sites Seen at SMX Sydney"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}