{
  "url": "https://moz.com/blog/301-redirection-rules-for-seo",
  "slug": "301-redirection-rules-for-seo",
  "title": "301 Redirects for SEO: Google Removes the Penalty - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, Google blew our minds when they said 3xx redirects no longer lose PageRank. Cyrus is here to give you the low-down on what this means for SEO.",
  "content": "301 Redirects for SEO: Google Removes the Penalty Technical SEO | Search Engines | SEO Basics By: Cyrus Shepard August 1, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard August 1, 2016 301 Redirects for SEO: Google Removes the Penalty Technical SEO | Search Engines | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Is it time to rewrite the SEO playbooks? For what seems like forever, SEOs have operated by a set of best practices that dictate how to best handle redirection of URLs. (This is the practice of pointing one URL to another. If you need a quick refresher, here’s a handy guide on HTTP status codes.) These tried and true old-school rules included: 301 redirects result in around a 15% loss of PageRank. Matt Cutts confirmed this in 2013 when he explained that a 301 loses the exact same amount of PageRank as a link from one page to another.302s don’t pass PageRank. By definition, 302s are temporary. So it makes sense for search engines to treat them different.HTTPS migrations lose PageRank. This is because they typically involve lots of 301 redirects. These represent big concerns for anyone who wants to change a URL, deal with an expired product page, or move an entire website. The risk of losing traffic can mean that making no change at all becomes the lesser of two evils. Many SEOs have delayed site migrations, kept their URLs ugly, and have put off switching to HTTPS because of all the downsides of switching. The New Rules of 3xx Redirection Perhaps because of the downsides of redirection — especially with HTTPS — Google has worked to chip away at these axioms over the past several months. In February, Google’s John Mueller announced that no PageRank is lost for 301 or 302 redirects from HTTP to HTTPS. This was largely seen as an effort by Google to increase webmaster adoption of HTTPS.Google’s Gary Illyes told the SEO world that Google doesn’t care which redirection method you use, be it 301, 302, or 307. He explained Google will figure it out and they all pass PageRank.Most recently, Gary Illyes cryptically announced on Twitter that 3xx (shorthand for all 300) redirects no longer lose PageRank at all. 30x redirects don't lose PageRank anymore.— Gary Illyes (@methode) July 26, 2016 Let’s cover some myths and misconceptions by answering common questions about redirection. Q: Can I now 301 redirect everything without risk of losing traffic? A: No All redirects carry risk. While it’s super awesome that Google is no longer “penalizing” 301 redirects through loss of PageRank, keep in mind that PageRank is only one signal out of hundreds that Google uses to rank pages. Ideally, if you 301 redirect a page to an exact copy of that page, and the only thing that changes is the URL, then in theory you may expect no traffic loss with these new guidelines. That said, the more moving parts you introduce, the more things start to get hairy. Don’t expect your redirects to non-relevant pages to carry much, if any, weight. Redirecting your popular Taylor Swift fan page to your affiliate marketing page selling protein powder is likely dead in the water. In fact, Glenn Gabe recently uncovered evidence that Google treats redirects to irrelevant pages as soft 404s. In other words, it's a redirect that loses both link equity and relevance. See: How to Completely Ruin (or Save) Your Website With Redirects Q: Is it perfectly safe to use 302 for everything instead of 301s? A: Again, no A while back we heard that the reason Google started treating 302 (temporary) redirects like 301s (permanent) is that so many websites were implementing the wrong type (302s when they meant 301s), that it caused havoc on how Google ranked pages. The problem is that while we now know that Google passes PageRank though 302s, we still have a few issues. Namely: We don’t know if 301s and 302s are equal in every way. In the past, we’ve seen 302s eventually pass PageRank, but only after considerable time has passed. In contrast to 301s that pass link signals fairly quickly, we don’t yet know how 302s are handled in this manner.302 is a web standard, and Google isn’t the only player on the block. 302s are meant to indicate a temporary redirect, and it’s quite possible that other search engines (Baidu, Bing, DuckDuckGo) and social services (Facebook, Twitter, etc) treat 302s differently than Google. Rand Fishkin summed it up nicely. On Google's announcement that \"30xs pass pagerank\" -- be wary. Test. Don't assume. Pagerank isn't the only or most important ranking signal.— Rand Fishkin (@randfish) July 26, 2016 Google's made announcements like this before that later showed to work differently in the real world. Pays to be a skeptic in our field.— Rand Fishkin (@randfish) July 26, 2016 Moz Domain Authority Checker Enter any domain, and we’ll show you the Domain Authority, Page Authority, ranking keywords, and more. Try for free Q: If I migrate my site to HTTPS, will I keep all my traffic? A: Maybe Here’s the thing about HTTPS migrations: they’re complicated. A little backstory. Google wants the entire web to switch to HTTPS. To this end, they announced a small rankings boost to encourage sites to make the switch. The problem was that a lot of webmasters weren’t willing to trade a tiny rankings boost for the 15% loss in link equity they would experience by 301 redirecting their entire site. This appears to be the reason Google made the switch to 301s not losing PageRank. Even without PageRank issues, HTTPS migrations can be incredibly complicated, as Wired discovered to their dismay earlier this year. It’s been over a year since we migrated Moz.com, and we’re glad we did, but there were lots of moving parts in play and the potential for lots of things to go wrong. So as with any big project, be aware of the risks as well as the rewards. Case study: Does it work? Unknowingly, I had the chance to test Google’s new 3xx PageRank rules when migrating a small site a few months ago. (While we don’t know when Google made the change, it appears it’s been in place for awhile now.) This particular migration not only moved to HTTPS, but to an entirely new domain as well. Other than the URLs, every other aspect of the site remained exactly the same: page titles, content, images, everything. That made it the perfect test. Going in, I fully expected to see a drop in traffic due to the 15% loss in PageRank. Below in the image, you can see what actually happened to my traffic. Instead of a decline as expected, traffic actually saw a boost after the migration. Mind. Blown. This could possibly be from the small boost that Google gives HTTPS sites, though we can’t be certain. Certainly this one small case isn't enough to prove decisively how 301s and HTTPS migrations work, but it's a positive sign in the right direction. The New Best Practices While it’s too early to write the definitive new best practices, there are a few salient points to keep in mind about Google’s change to how PageRank passes through 3xx redirects. All redirects carry a degree of SEO risk.While 3xx redirects preserve PageRank, 301s remain the preferred method of choice for permanent redirects. (It is unknown if search engines treat all redirects equally)Keep in mind that PageRank — and other link equity signals — are only a portion of the factors used by Google in ranking web pages.Beyond PageRank, all other rules about redirection remain. If you redirect to a non-relevant page, or buy a website in order to redirect 1,000 pages to your homepage, you likely won’t see much of a boost.The best redirect is where every other element stays the same, as much as possible, except for the URL.Successful migrations to HTTPS are now less prone to lose PageRank, but there are many other crawling and indexing issues that may negatively impact traffic+rankings.Changing URLs for SEO purposes, including...Removing multiple query parametersImproving directory/subfolder structureIncluding keywords in the URLMaking URLs human-readable… is less risky now that 3xx redirects preserve PageRank. That said, always proceed with caution when redirecting. When in doubt, see Best Practice #1. Happy redirecting! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "301 Redirects for SEO: Google Removes the Penalty"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "301 Redirects for SEO: Google Removes the Penalty"
    },
    {
      "level": "H2",
      "text": "The New Rules of 3xx Redirection"
    },
    {
      "level": "H3",
      "text": "Q: Can I now 301 redirect everything without risk of losing traffic?"
    },
    {
      "level": "H3",
      "text": "A: No"
    },
    {
      "level": "H3",
      "text": "Q: Is it perfectly safe to use 302 for everything instead of 301s?"
    },
    {
      "level": "H3",
      "text": "A: Again, no"
    },
    {
      "level": "H2",
      "text": "Moz Domain Authority Checker"
    },
    {
      "level": "H3",
      "text": "Q: If I migrate my site to HTTPS, will I keep all my traffic?"
    },
    {
      "level": "H3",
      "text": "A: Maybe"
    },
    {
      "level": "H2",
      "text": "Case study: Does it work?"
    },
    {
      "level": "H2",
      "text": "The New Best Practices"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}