{
  "url": "https://moz.com/blog/33-link-building-questions-answered",
  "slug": "33-link-building-questions-answered",
  "title": "33 Link Building Questions Answered [Interview] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When it comes to link building idea generation, the sky's the limit! In today's post, Rhea Drysdale offers her tips for best practices and a philosophical approach to link building that will help bring your ideas to life.",
  "content": "33 Link Building Questions Answered Link Building By: Rhea Drysdale April 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rhea Drysdale April 4, 2013 33 Link Building Questions Answered Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This is a follow-up post to my Link Smarter, Not Harder Mozinar from last week. There was a great turnout and more than fifty questions asked. Thank you for joining! During my Mozinar, we walked through a sample link building idea generation process. The point was to demonstrate that link development is only limited by our creativity and resources. While building a backlink to a credit card site may seem impossible, we must remember that we put a man on the moon, which means coming up with new link building methods for the credit card industry is achievable. When reading through the audience Q&A questions from the Mozinar, I noticed a lot of folks who were still looking for a silver bullet for link building and SEO. This is when my brain got clogged with what I can only describe as an overwhelming pit of sadness. I recognize that SEOmoz is arguably the most recognizable publisher/tool provider in the SEO industry, which means the majority of PRO users range from beginners to seasoned experts. However, being new to the industry (or simply wanting to not listen to it) is no excuse for misinformation, the spread of spammy practices, and poor quality SEO services. So, I hemmed and hawed about what to do. Should I take this opportunity to hammer the point of my Mozinar into everyone’s consciousness? Ultimately, I decided that it wasn’t fair to the majority of readers, so I took a different approach. This post is an opportunity to expound on some areas of the Mozinar, but more often than not, just general best practices and my philosophical approach to link building. I hope there’s value in here for everyone reading, and feel free to debate my points in the comments or hit me up on Twitter. Link building and SEO tools Tools mentioned during the presentation and Q&A: Search Metrics STAT Search Analytics Fresh Web Explorer Majestic SEO Open Site Explorer MozCast Screaming Frog (I may not have mentioned this, but should have. It rounds out our list of a few, highly used tools, which was another point of the Mozinar: you don’t need a huge toolset to accomplish big things with link building!) Sponsored blogs Image above taken from the Mozinar. Missing the context? Go watch it! I worked hard on that thing. 1. How does Google know if one blog is a sponsored blog vs guest blog? We only do guest blogs, because we don't want to buy links, but many blogs these days ask for money. Sponsored blogs are like advertorials in magazines and should be labeled as such. If someone received compensation for their review/content, this should be disclosed and, according to Google, all outbound links to the purchasing domain should be nofollowed. By comparison, a guest post doesn’t include compensation; it should be based on the merits and relevance of the content, a relationship with the guest poster, or some other qualitative (versus monetary) factor. In other words, I think it’s important that you fully understand FTC and Google Webmaster Guidelines when submitting content through sponsored or guest posts. 2. What do you think about sponsored blogs (sponsored links) vs guest blogs (unpaid links)? Does Google punish you for \"link buying\"? Yes. Google will punish sites that are caught selling links, buying links, or paid links agencies/service providers. Manual action usually occurs when it's done on a substantial scale. Of course, Matt Cutts posted the following today, which might help clear up some confusion about punishment by association (hat tip to Barry over at SERoundtable for sharing this): 3. Why is a mom's blog post about a product a threat to get you penalized, etc., if there is no mention of a sponsorship? If there isn’t a sponsored post, the blogger wasn’t paid for the product review, and they weren’t compensated in another form then there shouldn’t be a risk. We often cite mom blogs simply because of the large quantity of them that exist purely for giveaways and sponsored posts. This is also a community that’s heavily solicited by companies and link builders, so they’re more likely to knowingly or not link to questionable sources. Guest posts 4. How does Google see backlinks from guest posts? 5. Do you think guest blogs will be ignored by Google in the future as they are often fairly thin content-wise? I'll answer both questions here. No, I don’t see guest posts as a whole being devalued by Google. The Whitehouse.gov accepts guest posts and so does every craptastic exact-match Blogspot. Google isn’t going to devalue content from the Whitehouse, just like they won’t devalue Blogspot, which also hosts incredibly authoritative communities and blogs like Google’s own Google Webmaster Central blog. Basically, we create spam websites, but that doesn’t mean Google devalues websites. The responsibility lies with search engines to develop an algorithm that determines qualitative sites vs spam. The same is now true of individual content on those sites and if my blog is hosting guest posts from payday loan, online college degree, and shoe retailer sites, it’s probably not a great blog. If the blog hosts guest posts only from wedding planners, bridal stores, and party favor sites, it’s probably still very valuable to that industry. Agency life 6. What's been your biggest hurdle getting things done from an agency side? Any examples from an in-house's perspective? Biggest agency hurdle: Let’s actually go with my top two: Technical restrictions (often an internal dev team that’s overloaded, poor CMS, or the site is in a code freeze) Approval process (difficult to get content or methods past strict legal teams/brand guidelines) Biggest in-house hurdle: Politics! It’s tough to get your work prioritized, especially when another department has the ear of so-and-so. At least, that how I felt when I was in-house. There were a lot more political moves than data-driven. That doesn’t mean all organizations function this way; the best companies lose the drama/egos and focus on the data. That’s how everything should be. 7. How long is your typical link building campaign? When can clients start seeing results? Do you ask clients to make a quarterly or annual commitment or other time frame? We typically need 6-12 months to demonstrate strong results for our clients. We start to see results in 2-3 months, but structure monthly link building retainers for long-term investment in brand development. With that said, no one is trapped in a contract. We have fairly generous cancellation policies, because if it isn’t working or something drastic changes within your organization, it’s important that you/we do what’s right. 8. I work with a client that does not create dynamic content (blog, articles, etc.). Each page of their site is about a product or technology behind a product. How else can I help build links without the ability to create fresh/unique content on a regular basis? How are these products being used? By who? Like we discussed in the Mozinar, look at those audiences to identify potential partnerships, testimonials, case studies, product reviews, etc. If the company is purely promotional, you could arrange interviews for the founder(s), have them speak locally/nationally, or invest in an online customer service platform for the products that builds up product-specific content and long-tail queries. Those are just a few ideas off of the top of my head, but look to how they’re marketing the business and where and you will find ideas even if you’re unable to place content on the domain itself. 9. What would you advise an SEO do when they are working in a really competitive and traditionally heavily-spammed niche, and they see all of their client's competitors are ranking consistently by using black hat tactics? Take the squeaky clean path and keep your fingers crossed that Google will smack them? Yes. It isn’t worth your energy to focus on the competition to the detriment of your own marketing. Trust me, I’ve been there, done that. Just keep moving forward with your business and your approach. While the competitors are busy filing for reconsideration requests, you’ll be ahead of the game. If you’re focused on your mission and make a mistake, you’ll already be so far ahead of everyone else that you can recover from it. It’s part of the theory of OODA loops, which is probably loosely related, but I love to talk about OODA loops. It's also important to manage expectations. We work with clients every day who are champions in their business. They're having to continually and tirelessly communicate the message that low-risk, high-quality link building will protect their brand and build the business. It's important to reset the expectation that link quantity and anchor text isn't the metric to measure, but link quality and your own internal performance metrics like conversions and qualified traffic are what truly matter. 10. What is best practice for linking to your own website from a client's site? (Footer links) Linking to your client's sites isn't something I do, but I know other reputable SEOs who will do this. It's tough; in any other industry, it makes sense to list your clients. In SEO, I feel like Google looks closer at client sites when they're affiliated with known SEOs, and more importantly, so do your competitors. I don't want to make it that easy. If you want to know what our clients are doing, do your homework - we did! Broken link building 11. Is broken link building still effective? Is broken link building with other relevant websites in your industry still effective? Yes. However, I think this is a practice that is relied on too heavily. When done as a primary form of link development, I think the bigger issue is why you’ve hit a creative wall and don’t have other methods in rotation. Is this because of a lack of resources, internal/client approval, new ideas, etc.? Do broken link building, but don’t put all your eggs in this basket, because you aren’t investing the development of your brand at all. Outreach 12. Do you think outreach is the future of link building? Should SEOs spend more time in this area? Yes. It’s also the past and present of link building just like content is king, has been, and always will be. This is almost like saying, “Will communicating a message to someone be the best way to market your brand?” YES! Outreach is fundamentally about establishing a relationship with someone. The method and tools you take to achieve that may be different from season to season, but this will never go away. 13. How do you contact bloggers with no contact information? If you’ve already looked up their domain information and still can’t locate a contact, then I would turn to social media. Do they have a Twitter profile? Are they active on LinkedIn? Do they accept comments? Keep in mind that they’ve limited their contact information for a reason. You’ll have to work hard to build up a relationship. Question whether you have the time and budget to invest in tracking them down, especially if they don’t want to be found. 14. Do you put time into considering the negative possibilities you want to avoid? E.g. how to be careful not to \"earn\" links from bad places Yep! We have a lot of internal training and gut checking with our team on sites that don’t meet our quality standards. Those standards sometimes change for different clients and industries, but we have a lot of red flags that we avoid. I would develop your own internal list based on past experiences and industry-specific knowledge. Link targeting 15. Should the links go to the home page or interior pages? If interior, how many words of text should the interior pages have on average? 16. For a business with a few very specific products, is it a good idea to build links to each product's subpage, or should links always go to the main domain? I'll answer both questions here. I'm all for link diversity when it comes to backlinks to the domain. You should have links to the homepage, the product pages, the categories, your about us page, etc. Think of it from the perspective of a consumer. If they're mentioning a product online, they might link to the homepage, but they're more likely to link to the product page if they have direct experience with it; it's much more natural. When doing outreach for our clients we try not to dictate the location of the backlink, because it's more natural that they select what makes the most sense for their community. Also worth noting: do the products expire? If the products aren’t going anywhere, then invest in building links to them. If it’s a product that expires or gets discontinued seasonally, then you’ll have a lot of redirects to deal with and lost value, so building links to the homepage and categories makes more sense. This doesn’t sound like your specific situation, though. 17. Do links to specific product subpages on a site have as much power as links to the main domain? Where the link points don't drive \"power,\" it's the link pointing to the site that drives that power and the content of the page it's pointing to, as well as its history and other backlinks. You'll often find that certain pages of a site that are internal can quickly overpower a homepage if there hasn't been much link building or brand promotion to the homepage, but a product or article gets really popular. So, the links are what determines the power of a page, not the location of the page itself. However, the majority of backlinks to a site do point to the homepage, which is why 99% of the time the homepage is the most powerful page. But, this truly is a \"correlation isn't causation\" lesson. 18. What are your thoughts on the link disavow tool? The link disavow tool is a last resort. It's a tool that helps you communicate with the search engines after all of your other efforts to remove a backlink have failed. In the past, when working on a site that had a history of paid links, we'd have to try to do the cleanup and then tell Google what percent we were able to get fixed. That meant a number of the links never got removed, but Google would hopefully devalue those if they hadn't already. Now, Google is making it clear that this responsibility rests with the webmaster to fully clear the offending backlinks through their manual efforts and then as a last resort, through the disavow tool. The tool shouldn't be used to just \"get rid of\" any backlink that looks questionable. It should really be used only when you have a clear problem that has been communicated to you by the search engines and you need to address a particular domain or page of that domain. 19. How important is the ratio between followed and nofollowed links? Honestly, I don't believe there's a threshold here, but too much of one or the other probably looks unnatural. Regardless, I don't believe that the search engines use this as an algorithm factor. Simply think of it in terms of diversity and brand factors. If you only have followed links, this means you've never posted a blog comment, been featured on a news site or more established directories, received a link from Wikipedia or other high-quality article sites, etc. That wouldn't be very natural and I'd see it as a sign that the site is overly optimized. I very rarely look at this ratio myself. 20. What would you recommend as the best strategy for a licensee of a brand with multiple licensees targeting the same keywords/keyphrases and sources for backlinks? This sounds like a situation affiliates and resellers run into all the time. It's a tough because you're competing against yourselves. Without knowing more detail, I would look for a unique perspective with the licensees. There has to be something unique if this business model even exists. Is it location, industry, customer service - find what makes you unique from the rest and emphasize that. Sometimes you'll have to invent the point of difference (POD), but inventing great customer service is the perfect way to do this! Want inspiration? It’s going to sound crazy, but watch “Bar Rescue” on Spike. I love how Jon Taffer takes an overly saturated market (bars) and always finds something special for each owner that will bring in customers. It just takes creativity and research, it doesn’t matter that the product is the same! Algorithm updates and penalties *Picture credit: Search Metrics 21. How can you tell if your site has been hit in a negative way by some of the changes Google has made? Check out the SMX West 2013 Google Dance recap over at Virante. Marcus Tober and Mitul Gandhi both went into great tactics on finding and assessing whether you might have been affected by an algorithm update. Internal link building 22. You talked a lot about inbound link building, but is there a good formula for how many internal links you use and the placement of the links? 23. What about internal links? Are keyword-targeted links ok, or do you still need to be concerned about anchor text diversity there? 24. I am wondering how Google sees internal linking of the content? Does it make any difference if it is over optimized? These three questions could be their own blog post, but my hands are thankful that John Doherty already did a great write-up that addresses many of these internal linking questions on the SEOmoz blog. Press releases 25. In your opinion, are press releases a great way to build SEO? How does your company charge? No. I hate press releases for SEO. They’re over-saturated, and it’s rare that a press release attracts any press attention. Let me clarify: I’m speaking to press release distribution services (not the press release itself). I think that press releases as a public relations tool are incredibly important, but you should have a list of media outlets that you’re personally sending these to. Many of the distribution and wire services have been gamed so heavily that they’re virtually worthless and the press release will get buried after a few days of freshness in the SERPs. On the second question, from my philosophy on press releases, you can probably tell that we don’t charge for this specific service, but we will work with clients to optimize strategic press releases and PR campaigns. We love coordinating with qualified PR teams! What you won't find is Outspoken Media listed on a directory of SEO companies by a press release distribution site in their footer. That's probably a good sign that you should run far, far away. Social bookmarking and directories 26. Are traditional link building methods such as social bookmarks and directories no longer effective? What is your take on this? 27. Besides themed guest posting, does social bookmarking still help vary your link profile? I'll answer both questions here. There are still a lot of active social bookmarking sites that range from generic to special interests. Many have nofollowed backlinks at this point, but some remain followed. My recommendation isn’t to find those followed social bookmarking sites and spam them, but to recognize that if the community is active, you’re spreading your visibility and reach and that’s a good thing. This will often result in the discovery of your content that may lead to a backlink. Personally, I don’t encourage my team to go after social bookmarks as a backlink for client work because we’re being held to a higher standard for link quality. Unless we know that link has the potential to get picked up by the community, seeding it through social channels doesn’t make a lot of sense. When it comes to directories, these are still effective, but yes, they’re over-saturated. This means that your competitors will probably be able to easily acquire the same backlinks and the directory may have been devalued for linking out to an unusually high number of questionable domains. There are still many great directories out there though, especially industry-specific directories, so don’t throw the baby out with the bathwater. When I talk to my team I look at directories in this way: Get good web directories. Get good social media and blog directories. Get good local directories. Directories are still a great way to find reputable websites, social profiles, blogs, and local business listings. Not being included in them is just silly and a bad business practice. You should determine your own metrics for assigning value and authority to the directories. I’m probably more picky than most would be! Redirects 28. Scenario: site A has loads of backlinks and is 301 redirected to site B. If site A has been penalized by Google's updates, does the penalty get carried over? What solutions can we consider to implement? Does the penalty get carried over… honestly, there isn’t a straight answer for this. I’ve seen and read accounts of both situations: a penalty gets passed and it doesn’t. It often appears to be a matter of severity. I’d also be worried about the quantity of redirects (e.g. redirecting a network of several dozen penalized domains wouldn’t be a good idea). Doing a test with one would be less of an issue. Test it, but try to test with a domain that isn’t your bread and butter. What I’d personally try to do: get site A unpenalized and then redirect it. Or reclaim the backlinks from site A and have those instead point to site B through outreach efforts. 29. Is it ok to buy lots of domains and do a 301 redirect to your main one? See above! Be careful about what you purchase. I’ve seen companies invest millions into a domain just to have it turn out penalized from the prior webmaster’s questionable practices. You don’t want to wind up in that situation and have the penalty get passed. Also, simply buying up domains and redirecting them can be effective, but quantity can become a concern. I’d focus the budget on building up your brand and I know that sounds terribly naïve, but it’s worth more than the time, budget, and risk associated with just buying up domains. Other questions 30. How do we do a backlink audit? Is it by using Fresh Web Explorer, or something else? The backlink audit is something I first mentioned in this post on, “Does Your Board of Directors Get SEO?,” but I didn’t go into the actual process. We usually start Google Webmaster Tools, the client’s analytics solution, Majestic SEO/Open Site Explorer, and a crawler like Screaming Frog. Most important: Excel. You don’t need a whole lot more than that! 31. Any resources for link building noobs that are a must read? Check out: Chapter 7 of the SEOmoz Beginner’s Guide to SEO Link building archives on sites like the SEOmoz blog Link Building Strategies by Point Blank SEO 32. I live a couple of blocks from the Brownes & Co. and passed Tabatha when they were filming that show. Brown's finally closed. That woman was awful wasn't she? I referenced the Online Reputation Management Case Study post during the Mozinar, and yes, it's \"reality TV\" but it's difficult to make some appear that clueless about their business without plenty of material to work with! 33. Recently we had a duplicate content because someone create a fake website and he paste some of our information. I didn't saw anything until that one of my friend tell me this. Except Google Webmaster Tool Which tools or websites can I use for find this duplicate content? My favorite tools: http://www.copyscape.com/, http://www.plagium.com/, Google itself, and now Fresh Web Explorer from SEOmoz. There were a number of questions I didn’t tackle from the Mozinar that were too off-topic, but I’ll try to reach out personally to you with an answer if we haven’t already emailed back and forth. Thank you again for everyone who listened in and I hope the Q&A provides some insight as well as healthy debate! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "33 Link Building Questions Answered"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "33 Link Building Questions Answered"
    },
    {
      "level": "H2",
      "text": "Link building and SEO tools"
    },
    {
      "level": "H2",
      "text": "Sponsored blogs"
    },
    {
      "level": "H2",
      "text": "Guest posts"
    },
    {
      "level": "H2",
      "text": "Agency life"
    },
    {
      "level": "H2",
      "text": "Broken link building"
    },
    {
      "level": "H2",
      "text": "Outreach"
    },
    {
      "level": "H2",
      "text": "Link targeting"
    },
    {
      "level": "H2",
      "text": "Algorithm updates and penalties"
    },
    {
      "level": "H2",
      "text": "Internal link building"
    },
    {
      "level": "H2",
      "text": "Press releases"
    },
    {
      "level": "H2",
      "text": "Social bookmarking and directories"
    },
    {
      "level": "H2",
      "text": "Redirects"
    },
    {
      "level": "H2",
      "text": "Other questions"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rhea Drysdale\n          \n            Rhea Drysdale"
}