{
  "url": "https://moz.com/blog/34-questions-you-should-ask-before-hiring-an-agency",
  "slug": "34-questions-you-should-ask-before-hiring-an-agency",
  "title": "34 Questions You Should Ask Before Hiring an SEO Agency - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Finding and selecting the right agency to help your brand can be a make-or-break decision.",
  "content": "34 Questions You Should Ask Before Hiring an SEO Agency By: Gillon Hunter October 10, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gillon Hunter October 10, 2016 34 Questions You Should Ask Before Hiring an SEO Agency This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Finding the right SEO agency is a part-time job in and of itself. Choosing the right one could be the best thing you ever do for your company. Selecting the wrong one could be the biggest business mistake you ever make. Why? Because the potential damage caused to your online presence as a result of bad/poor-quality SEO could have an indefinite adverse effect on your online assets. There are so many SEO agency options to consider. On top of that, if you haven't been studying inbound marketing for several years, chances are you don't truly know a good SEO agency or freelancer from a poor one.\"If you think it's expensive to hire a professional, wait until you hire an amateur,\" goes the old saw.Here are some essential questions you need to ask potential SEO agencies and why. Gathering this information will help you separate the wheat from the chaff when it comes to finding high-quality search engine optimization services.Can you itemize the services you intend to provide as part of the strategy?If your potential SEO agency is reluctant to enumerate the work they intend to carry out, be wary. Poor SEO companies/freelancers have a tendency to hide the truth about what they are doing for the cash you're paying them. A good agency will be completely transparent with you and not be scared to list the services they intend to provide as part of the strategy.Services provided could and should evolve over the course of your contract. So bear that in mind when asking these questions. For example, I wouldn’t expect the services provided during month one to be the same as the services provided in month six. Don't be afraid to ask for quantities in hours or the number of assets they will provide each month based on the strategy they are proposing to you. Service questions you should ask:What are the exact services, and quantities of each, you plan to deliver monthly as part of the strategy? How many hours can we expect per month for each service? What technical aspects of the website will you be auditing and fixing? How many pages of the website will you optimize initially? How many pages of the website will you optimize on an ongoing basis each month? How many new landing pages will you create per month? How many internal and external articles will you provide per month? How many backlinks can we expect per month? How much time is dedicated to campaign analysis and reporting?Don’t be surprised if the agency comes back to you and says something like: “this is what we will provide from months one to three, but the services we provide from month four onwards are subject to change based on what we discover in the initial start-up phase.” That would be a good answer, and it would show the agency is all about finding the right strategy for your business and adapting the offering as things evolve. The services they provide should be based on research and data, not on gut feeling.How will you optimize our content?It's the buzziest buzz phrase of the last few years: \"Content is king.\"As much as I'm sick of hearing it (and saying it), content really is important. When choosing an SEO agency, make sure they are going to enhance your content and find out how.Content questions you should ask: Will you create new copy or work with our existing content? How do you optimize content and why is it important? Will you be creating new landing pages as part of the contract?How do you go about link building?External inbound backlinks are one of the most important parts of any online marketing effort. Without good links pointing to your website you'll find it hard to rank higher than your competitors. However, not every link is a good backlink. If you choose the wrong SEO agency, and they build spammy links which don't adhere to Google's guidelines, you risk the website being penalized and you may never achieve your goals. Link building questions you should ask:What kind of links will you be building and how? How many new links can we expect per month? Bear it mind it’s impossible to give an exact answer for this. Expect an estimate. Do you have a database of relevant placement opportunities? What do you know about Google Penguin and what makes a quality backlink?Will you be implementing technical changes?Before you commit to an SEO contract, make sure you know who is responsible for each task. Some agencies/freelancers are vague with their proposals which can result in a shock further down the line when you need to hire a developer to implement the changes they recommend. Find out who's doing what and if they'll require external help. Can I meet the team assigned to my project?Most SEO agencies will send in their best team to win new clients. After all, they want to make a good impression. There's nothing wrong with that, but chances are you're not going to have the agency CEO and technical SEO specialist handling all of the work. Ask if you can meet with the person responsible for your project and, ideally, any other team members involved. You want to know you're in safe hands and that your contract won't be handed to an intern. Do you currently work with any of our competitors?Who does the SEO agency currently have on their books? Having other clients in your industry can be a good thing as it may mean the agency knows what works/doesn't work in that industry, and they have a good network of resources for your industry. However, bear in mind, if the agency is working for your competitors, the competitors may be paying more than you and getting more services each month than you are being proposed. Find out the details. What do you know about our industry?If you're an online travel company, for example, you want an SEO agency who has at least some experience in the travel industry. They don't need to specialize in travel; they need to specialize in SEO and have a good knowledge of what works well in travel plus the right kind of writers and networks to be able to create and place good content relevant to your industry. If the SEO agency does have other clients in your industry, chances are they are going to have a good network of partnerships and assets which will be beneficial to your company too. Ask them about this and try to get some examples of digital assets they have created and placed for similar clients in the past. Industry questions you should ask: Do you have a network of resources relevant to our industry? Do your writers have experience in our industry and can we see writing examples? How much time is needed from our in-house team?This question is a big one. Time and time again, I've seen CEOs or marketing directors get one or two months into an SEO contract and then say, \"Hey, I'm spending way too much time on this. I thought you were going to do it all?\"Ultimately, it comes down to how happy you are to make the agency autonomous, allowing them to make changes without you signing off. If you are happy to do that, you won't need to commit much of your time at all. However, if you want to sign everything off, which is advisable at least in the early stages while you build up trust, you will need to commit a little bit of time to get involved. It's worth gauging how much the agency plans to send you each month to sign off, then you can work out how many hours you'll need to set aside. Other than sign-off from you, you'll want to know if the SEO agency is going to depend on any of your in-house team members. Do they need to tap into your content writers, designers, or developers? Pop the question now, avoid being shocked later on. How often will we be having meetings?Some agencies will do a weekly catchup call. Others may speak with you once per month. Some may just get on with it and ping you an email/report on an ad hoc basis. You can guide them on this and explain how much you would like to be kept in the loop. It's a good idea to have them use the likes of DaPulse or Asana. With these tools, the agency can map out all of the tasks and then give you access so you can see what's going on. That way, you'll need fewer meetings and still get full transparency on work in progress.What sort of ranking increases can we expect?The million dollar question which, sadly for you, has no direct answer. Everyone wants to know where the website will be ranking for specific keyword phrases and by when. But the truth is, that's an impossible question to answer for many reasons. In a nutshell, consider that no one has control over the organic search positionings but Google. It depends on so many external factors like competition levels, where the searcher is located, their previous search history, daily/weekly/monthly fluctuations, and algorithm changes.Also, bear in mind that good rankings do not mean good traffic. The reason you should ask this question is more to see what sort of response you'll get. While a good SEO company will explain the above points (and more) in detail, and give you an idea of what to expect over a certain period based on their experience and know-how, no reputable SEO company will guarantee rankings. Can we see some case studies?Sleek proposals and sales patter alone can leave potential clients thinking they've found the right partner to work with, but would you employ a member of staff without getting references and doing some background checks? Before you make your final commitment, it's a good idea to see some case studies and even see if you're able to chat with other clients the SEO agency has worked with. Hearing testimonials from the horse's mouth will help you develop a more informed opinion. How will you analyze campaigns and report on them?You'll want to know exactly what's been done each month, how successful the campaign has been, and where you stand regarding rankings, traffic, and conversions. You can guide the SEO agency on how deep you want your reports. For example, you may want a simple, high-level report for the CEO and board members and a more in-depth, technical report for the marketing director. Campaign analysis questions you should ask: How often will you be sending reports? What software do you use for reporting? When you get new campaign data, how do you action tasks based on the findings? Is there a out clause?Make sure there is an out clause in your contract. Thirty days notice is a good starting place. Once you find the right agency, you should give them at least six to nine months (and ideally more) before making any rash decisions. Results take time. But you still need an out clause for peace of mind and accountability. ConclusionThe key with this entire process is to be thorough. You don't want to choose a black hat agency who'll end up landing you in the red. With the questions above in hand, you can feel confident you're asking a potential agency partner all of the right questions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "34 Questions You Should Ask Before Hiring an SEO Agency"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "34 Questions You Should Ask Before Hiring an SEO Agency"
    },
    {
      "level": "H2",
      "text": "Can you itemize the services you intend to provide as part of the strategy?"
    },
    {
      "level": "H2",
      "text": "How will you optimize our content?"
    },
    {
      "level": "H2",
      "text": "How do you go about link building?"
    },
    {
      "level": "H2",
      "text": "Will you be implementing technical changes?"
    },
    {
      "level": "H2",
      "text": "Can I meet the team assigned to my project?"
    },
    {
      "level": "H2",
      "text": "Do you currently work with any of our competitors?"
    },
    {
      "level": "H2",
      "text": "What do you know about our industry?"
    },
    {
      "level": "H2",
      "text": "How much time is needed from our in-house team?"
    },
    {
      "level": "H2",
      "text": "How often will we be having meetings?"
    },
    {
      "level": "H2",
      "text": "What sort of ranking increases can we expect?"
    },
    {
      "level": "H2",
      "text": "Can we see some case studies?"
    },
    {
      "level": "H2",
      "text": "How will you analyze campaigns and report on them?"
    },
    {
      "level": "H2",
      "text": "Is there a out clause?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gillon Hunter\n          \n            Gillon Hunter"
}