{
  "url": "https://moz.com/blog/35-percent-of-local-keywords-have-local-pack-ads",
  "slug": "35-percent-of-local-keywords-have-local-pack-ads",
  "title": "New Research: 35% of Competitive Local Keywords Have Local Pack Ads - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You may have noticed more ads in local packs. Across 11,000 searches (110 keywords X 100 cities), we were surprised to find ads in 35% of local packs, with as high as 64% in some verticals.",
  "content": "New Research: 35% of Competitive Local Keywords Have Local Pack Ads Local SEO | Paid Search Marketing (PPC) By: Dr. Peter J. Meyers February 13, 2018 Table of Contents Copied! By: Dr. Peter J. Meyers February 13, 2018 New Research: 35% of Competitive Local Keywords Have Local Pack Ads Local SEO | Paid Search Marketing (PPC) Over the past year, you may have spotted a new kind of Google ad on a local search. It looks something like this one (on a search for \"oil change\" from my Pixel phone in the Chicago suburbs): These ads seem to appear primarily on mobile results, with some limited testing on desktop results. We've heard rumors about local pack ads as far back as 2016, but very few details. How prevalent are these ads, and how seriously should you be taking them? 11,000 SERPs: Quick summaryFor this study, we decided to look at 110 keywords (in 11 categories) across 100 major US cities. We purposely focused on competitive keywords in large cities, assuming, based on our observations as searchers, that the prevalence rate for these ads was still pretty low. The 11 categories were as follows: Apparel Automotive Consumer Goods Finance Fitness Hospitality Insurance Legal Medical Services (Home) Services (Other) We purposely selected terms that were likely to have local pack results and looked for the presence of local packs and local pack ads. We collected these searches as a mobile user with a Samsung Galaxy 7 (a middle-ground choice between iOS and a \"pure\" Google phone). Why 11 categories? Confession time – it was originally 10, and then I had the good sense to ask Darren Shaw about the list and realized I had completely left out insurance keywords. Thanks, Darren. Finding #1: I was very wrongI'll be honest – I expected, from casual observations and the lack of chatter in the search community, that we'd see fewer than 5% of local packs with ads, and maybe even numbers in the 1% range. Across our data set, roughly 35% of SERPs with local packs had ads. Across industry categories, the prevalence of pack ads ranged wildly, from 10% to 64%: For the 110 individual keyword phrases in our study, the presence of local ads ranged from 0% to 96%. Here are the keywords with >=90% local pack ad prevalence:\"car insurance\" (90%)\"auto glass shop\" (91%)\"bankruptcy lawyer\" (91%)\"storage\" (92%)\"oil change\" (95%)\"mattress sale\" (95%)\"personal injury attorney\" (96%)There was no discernible correlation between the presence of pack ads and city size. Since our study was limited to the top 100 US cities by population, though, this may simply be due to a restricted data range. Finding #2: One is the magic numberEvery local pack with ads in our study had one and only one ad. This ad appeared in addition to regular pack listings. In our data set, 99.7% of local packs had three regular/organic listings, and the rest had two listings (which can happen with or without ads). Finding #3: Pack ads land on GoogleDespite their appearance, local packs ads are more like regular local pack results than AdWords ads, in that they're linked directly to a local panel (a rich Google result). On my Pixel phone, the Jiffy Lube ad at the beginning of this post links to this result: This is not an anomaly: 100% of the 3,768 local pack ads in our study linked back to Google. This follows a long trend of local pack results linking back to Google entities, including the gradual disappearance of the \"Website\" link in the local pack. Conclusion: It's time to get seriousIf you're in a competitive local vertical, it's time to take local pack ads seriously. Your visitors are probably seeing them more often than you realize. Currently, local pack ads are an extension of AdWords, and require you to set up location extensions.It's also more important than ever to get your Google My Business listing in order and make sure that all of your information is up to date. It may be frustrating to lose the direct click to your website, but a strong local business panel can drive phone calls, foot traffic, and provide valuable information to potential customers.Like every Google change, we ultimately have to put aside whether we like or dislike it and make the tough choices. With more than one-third of local packs across the competitive keywords in our data set showing ads, it's time to get your head out of the sand and get serious. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Research: 35% of Competitive Local Keywords Have Local Pack Ads"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Research: 35% of Competitive Local Keywords Have Local Pack Ads"
    },
    {
      "level": "H2",
      "text": "11,000 SERPs: Quick summary"
    },
    {
      "level": "H2",
      "text": "Finding #1: I was very wrong"
    },
    {
      "level": "H3",
      "text": "Across our data set, roughly 35% of SERPs with local packs had ads."
    },
    {
      "level": "H2",
      "text": "Finding #2: One is the magic number"
    },
    {
      "level": "H2",
      "text": "Finding #3: Pack ads land on Google"
    },
    {
      "level": "H2",
      "text": "Conclusion: It's time to get serious"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}