{
  "url": "https://moz.com/blog/36-authoritative-outreach-tips-for-digital-pr-specialists",
  "slug": "36-authoritative-outreach-tips-for-digital-pr-specialists",
  "title": "36 Authoritative Outreach Tips for Digital PR Specialists - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes the qualities of a digital PR specialist don’t seem to differ much from those of a skilled stalker. In this post, Cosette Jarrett offers a comprehensive list of ideas and tools you can use to help suss out contact info and create pitches tailor-made for their recipients.",
  "content": "36 Authoritative Outreach Tips for Digital PR Specialists Link Building | Public Relations By: Cosette Jarrett May 11, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cosette Jarrett May 11, 2016 36 Authoritative Outreach Tips for Digital PR Specialists Link Building | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 12 minutes] Whether you’ve been in the digital PR biz for years, or you’re a recent grad starting your first job, you stand to benefit from a few tips for building and maintaining valuable relationships with influencers at target publications. That’s why I’ve teamed up with my digital PR team at Clearlink to compile a list of our favorite outreach tactics. Finding an email address1. Share prospect lists via BuzzStreamBuzzStream allows you to share prospect lists with fellow digital PR specialists to view one another’s notes on specific publications and their staff. You can use this tool to see which email templates have worked for your coworkers in the past and which contacts they’ve found that you haven’t. Knowing the history of communication between that publication and your colleagues is essential. 2. Use Rapportive to narrow down your guessesCan’t find an email? Rapportive might be your answer. This Gmail plugin helps you pull up email addresses for your target editors and journalists, based on guesses you enter into the “recipient” line of a new email. You can make up to five guesses at a time. When you find a winner, you’ll see the full name and image connected to the recipient’s LinkedIn profile pop up to the right of your screen. 3. Use Twitter to search for email addressesIf Rapportive turns up dry, try taking your search to Twitter. Simply search your target’s full name plus the word “email” to see if they’ve tweeted it back to others who have requested it before. For example, to find mine you could search “Cosette Jarrett email” to see if it turns up. 4. Check annual reports If you’re looking for the contact info of higher-ups at a company or publication, annual reports could be a great place to look. Search Google for the reports, then scroll to the bottom to see if they’ve included contact info. 5. Search for your target on YouTube Some journalists and bloggers have YouTube channels where they publish additional work. My team has found contact info in the “about” pages for our targets' YouTube channels. 6. Use the Datanyze Insider Chrome extension This Chrome extension helps you find the right email address for a given journalist in a process that is a bit simpler than Rapportive’s process. Once you’ve signed up and downloaded the extension, you can highlight the names of your target journalists, editors, and bloggers to get their name in the proper email address format for their publication. In my example below, I highlighted my own name and right-clicked to run it through Datanyze for this publication. Although I don’t have a Tech.co email address, it did pull up the correct email format for staff at the publication. 7. Check their Facebook profile’s \"about\" section Often, companies will provide their email address in the “about” section of their profile pages. If the email listed is not for the department you’re trying to reach, ask them to put you in touch with your desired contact. 8. Check LinkedIn LinkedIn is a fantastic place to look for contact info for journalists and editors. Once you’ve found the person you’re looking for using a search like “Editor in Chief at CNET,” click to view his or her profile. Even if you’re not connected, it is possible that they’ve listed their email publicly under the “Contact Info” tab below the profile picture. 9. Check the Google+ page \"about\" section Another place to look for the proper email for your target is his or her Google+ page. If they have an email address listed, it will be under the “about” section next to “posts.\" If it’s not there, look at all of the publications he or she has contributed to (also on this page) and try to find an email address at each of those sites under their author bio. 10. Run the email address though MailTester To test an email address to make sure it’s still active, you can run it through MailTester. This will give you a green result if the email is in use, and a red result if it’s not. The example below shows a correct match. Personalizing your pitch11. Check your target’s Twitter feedGeneric pitches don’t work anymore. If you want to build relationships at your target publications, you have to get personal. A great way to do this is to check the Twitter feeds of the journalists/editors you plan to pitch. What’s important to them? What have they written recently? How could you tie these things into your pitch to let them know you’ve done your research? 12. Search for a personal websiteAnother great way to get to know the person you plan to pitch is to check out his or her personal website. This will likely come up when you search their name on Google, but it’s also commonly listed on their Twitter profile. Their website will help you answer questions such as: \"What are they interested in?\" \"What topics do they like to write about?\" \"What makes them tick?\" You might also find solid contact info on their personal site, too.13. Scope out PinterestIf you’re looking for a blogger’s interests to personalize your pitch, perhaps one of the best places to look outside of their blog is their Pinterest board. Scope out their boards to see if you share any common interests that you could bring up in your pitch. 14. Google a writer's bylineAnother important part of getting to know the person you’re pitching is researching what they like to write about. When you search a target journalist or blogger’s byline, you can see where they’ve written outside of their current place of employment. Maybe you’ve written for some of the same publications and could bring that up in your introduction. Perhaps you could learn more about their writing beat based on what they’ve written elsewhere. 15. Identify alma mater alumniRun a LinkedIn search to find others who graduated from your college or university. Start by searching your target publication’s name in the search bar, then scroll down to find the spot to filter by school on the left side of the results. Chances are, you’ll find at least a few who work at your target publications. Discussing your shared alma mater could help you break the ice before your “ask.” 16. Find current internsI've used LinkedIn/Twitter/Facebook to find people who interned for a target company/blog network, and then I emailed them to ask for advice on how best to pitch current editors. 17. Look for portfolio profilesMany journalists have portfolio profiles on sites like clippings.me. They will often post their favorite/best performing articles there. This can be a good indicator of what type of pitches they will like and what issues are important to them. 18. Reach out to bloggers where they’re most comfortableFor a lot of home and family bloggers, Pinterest is home. Think about how you can establish genuine connections through their posts. Once you’ve introduced yourself by interacting with their boards, reach out from your personal account with an “ask” that’s tailored to the blogger’s beat and interests. 19. Match your tone to your targetCheck out your target’s tweets and articles. How do they write? Casually? Formally? Match your tone to the journalist’s most frequently used tone to make your pitch more appealing. 20. Pay attention to time zonesIt’s important to keep time zones in mind before you send your pitch. Find out what city the journalist or editor lives in and adjust your sending time accordingly. In most cases, Twitter, Facebook, and LinkedIn can help you find the correct city of residence. Try not to pitch before or after they start or end their workday. Building valuable relationships21. Make sure a journalist is still employed at your target publicationBefore you spend your time investing in a relationship with a journalist at a major publication, it’s worthwhile to make sure he or she is still writing there. You can run a site search to find their most recent article to figure this out. For example, below I’ve searched my own name on a publication I regularly write for to find my most recent article. 22. Conduct an Instagram searchAt the very least, the person on the receiving end of your pitch wants to know you’re not a robot. If you’ve got an appropriate Instagram, try finding your target reporters and editors there. Follow them for a bit and like the pictures you actually find interesting and fun. This will help you introduce yourself in a unique way, so your pitch isn’t completely cold when you send it later. 23. Ask questions in the comments below a target’s most recent article A great way to show that you’re genuinely interested in a reporter or blogger’s work is to comment on their recent articles, ask questions, and share your opinions. 24. Reach out via Facebook Once again, the person on the receiving end of your pitch wants to know that you are, in fact, a human. Sometimes reaching out via Facebook can help you establish this. Reaching out via Messenger is a great idea if you can’t track down a proper email address. 25. Connect on LinkedIn Perhaps one of the best ways to build a relationship with a journalist or editor is to send a connection request on LinkedIn. This keeps things professional and allows them to check out your writing credentials. 26. Form a Twitter bond A great way to start engaging with a journalist before you pitch is to attempt to spark a Twitter bond. Find common interests and strike up Twitter conversations from their recent tweets that interest you. Don’t simply tweet generic comments or a link to your most recent project, though. They already get a lot of that. Be real and treat them like a friend, rather than a potential business opportunity.27. Check Twitter hashtags for influencers Go through Twitter hashtags to find influencers within your area of expertise. For example, I work with tech brands, so I was active in the #CES feed throughout the event. Find posts that are meaningful to you, and engage with those who published them. You'll learn more about your industry while making valuable connections. 28. Use HARO in reverse The best way to get something is to give first. For your next article, seek expert advice from others in your industry on HARO. Once you’ve got a few responses, keep the relationship going beyond the piece’s publication date. Most respondents are PR people who will offer additional opportunities for coverage and even story ideas later. 29. Plan an \"accidental\" run-in Check out your target journalists’ social media feeds (especially Twitter) to find out which events they’re attending next. Plan to attend the same events — not only to learn more about your industry, but to plan a potential opportunity to meet your target journalists in person. Guaranteeing success following initial outreach 30. Always follow up! Always! If you feel insecure about following up after a person or publication has not responded to your email, don’t. Follow-up is an essential component in any successful outreach plan. You’d be surprised at how many publications really did miss your first email or forgot to respond. 31. Follow up on HARO opportunities, too HARO is a fantastic tool for landing brand mentions and quality links. You should be following up after every initial pitch. Find the personal email of a journalist you recently pitched and send a quick follow-up to make sure the pitch you sent via HARO made it to his or her inbox. 32. Use Yesware for email tracking The sad truth is that most of the outreach emails you send will yield little to no response. Although none of us can completely control whether or not the editor or journalist on the other end will respond, Yesware email tracking can at least tell us if and when our emails were opened. This helps with timing follow-up emails and lets you know if the potential problem was the subject line or the pitch itself. 33. Use BuzzStream tracking for mass outreach This is similar to Yesware tracking. However, it allows you to track the emails you send via BuzzStream. This is a great new feature that allows you to track the mass outreach you conduct through BuzzStream as you would track the smaller outreach efforts you send through your email account. 34. Use Boomerang to schedule follow-ups Boomerang facilitates your outreach game by allowing you to schedule follow-ups for contacts who haven’t responded. This helps you get the first touch communication you need for effective outreach. 35. Don’t stop at one locationMost large publications have multiple offices — one in New York, one in London, one in Australia, etc. If Australia doesn’t answer, contact London. If London doesn’t answer, pitch New York. Lexi Mills (a.k.a. the Outreach Goddess) said she once did this with a large publication. After being denied by the first office, she contacted another. The second office she pitched ended up running her story. Even better? The story was wildly successful! 36. Maintain your relationshipsAfter you’ve taken the time to build a valuable relationship with an editor, journalist, PR specialist, or blogger, it’s important to stay in touch. If you’ve connected with them via your social channels, continue to engage with them on a regular basis. Maybe even send a quick email to give kudos when you come across an awesome post of theirs. Being a person who is genuinely interested in their work (even after they’ve done what you wanted them to) shows that you are a solid go-to for future projects. These tried-and-true tips have helped my team drum up killer links and brand mentions on sites for various well-known publications like Mashable, Elle Décor, Fast Company, Huffington Post, USA Today, and Daily Mail. Hopefully these tips will help you establish solid digital press coverage for your client or brand, as well. As one final closing tip, I recommend you continue to learn all that you can from industry influencers to keep up as the field continues to evolve and present new challenges. One of the best ways to do this is to follow digital PR/content marketing innovators like Lexi Mills, Ross Hudgens, and Larry Kim. What are some outreach tips your team has used successfully? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "36 Authoritative Outreach Tips for Digital PR Specialists"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "36 Authoritative Outreach Tips for Digital PR Specialists"
    },
    {
      "level": "H2",
      "text": "Finding an email address"
    },
    {
      "level": "H3",
      "text": "1. Share prospect lists via BuzzStream"
    },
    {
      "level": "H3",
      "text": "2. Use Rapportive to narrow down your guesses"
    },
    {
      "level": "H3",
      "text": "3. Use Twitter to search for email addresses"
    },
    {
      "level": "H3",
      "text": "4. Check annual reports"
    },
    {
      "level": "H3",
      "text": "5. Search for your target on YouTube"
    },
    {
      "level": "H3",
      "text": "6. Use the Datanyze Insider Chrome extension"
    },
    {
      "level": "H3",
      "text": "7. Check their Facebook profile’s \"about\" section"
    },
    {
      "level": "H3",
      "text": "8. Check LinkedIn"
    },
    {
      "level": "H3",
      "text": "9. Check the Google+ page \"about\" section"
    },
    {
      "level": "H3",
      "text": "10. Run the email address though MailTester"
    },
    {
      "level": "H2",
      "text": "Personalizing your pitch"
    },
    {
      "level": "H3",
      "text": "11. Check your target’s Twitter feed"
    },
    {
      "level": "H3",
      "text": "12. Search for a personal website"
    },
    {
      "level": "H3",
      "text": "13. Scope out Pinterest"
    },
    {
      "level": "H3",
      "text": "14. Google a writer's byline"
    },
    {
      "level": "H3",
      "text": "15. Identify alma mater alumni"
    },
    {
      "level": "H3",
      "text": "16. Find current interns"
    },
    {
      "level": "H3",
      "text": "17. Look for portfolio profiles"
    },
    {
      "level": "H3",
      "text": "18. Reach out to bloggers where they’re most comfortable"
    },
    {
      "level": "H3",
      "text": "19. Match your tone to your target"
    },
    {
      "level": "H3",
      "text": "20. Pay attention to time zones"
    },
    {
      "level": "H2",
      "text": "Building valuable relationships"
    },
    {
      "level": "H3",
      "text": "21. Make sure a journalist is still employed at your target publication"
    },
    {
      "level": "H3",
      "text": "22. Conduct an Instagram search"
    },
    {
      "level": "H3",
      "text": "23. Ask questions in the comments below a target’s most recent article"
    },
    {
      "level": "H3",
      "text": "24. Reach out via Facebook"
    },
    {
      "level": "H3",
      "text": "25. Connect on LinkedIn"
    },
    {
      "level": "H3",
      "text": "26. Form a Twitter bond"
    },
    {
      "level": "H3",
      "text": "27. Check Twitter hashtags for influencers"
    },
    {
      "level": "H3",
      "text": "28. Use HARO in reverse"
    },
    {
      "level": "H3",
      "text": "29. Plan an \"accidental\" run-in"
    },
    {
      "level": "H2",
      "text": "Guaranteeing success following initial outreach"
    },
    {
      "level": "H3",
      "text": "30. Always follow up! Always!"
    },
    {
      "level": "H3",
      "text": "31. Follow up on HARO opportunities, too"
    },
    {
      "level": "H3",
      "text": "32. Use Yesware for email tracking"
    },
    {
      "level": "H3",
      "text": "33. Use BuzzStream tracking for mass outreach"
    },
    {
      "level": "H3",
      "text": "34. Use Boomerang to schedule follow-ups"
    },
    {
      "level": "H3",
      "text": "35. Don’t stop at one location"
    },
    {
      "level": "H3",
      "text": "36. Maintain your relationships"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cosette Jarrett\n          \n            Cosette Jarrett\n          \n            Cosette Jarrett"
}