{
  "url": "https://moz.com/blog/37-takeaways-from-seomoz-master-class-in-bulgaria",
  "slug": "37-takeaways-from-seomoz-master-class-in-bulgaria",
  "title": "37 Takeaways from SEOmoz Master Class in Bulgaria - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What better opportunity for my first YOUmoz post than to recap the most significant SEO event to date in Bulgaria--the SEOmoz Master Class at the Webit Conference in Sofia last Friday.\n\nBulgaria’s top SEOs settled in--mildly skeptical yet very eager to listen to and...",
  "content": "37 Takeaways from SEOmoz Master Class in Bulgaria SEO Events P By: Paris Childress November 2, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Paris Childress November 2, 2010 37 Takeaways from SEOmoz Master Class in Bulgaria SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. What better opportunity for my first YOUmoz post than to recap the most significant SEO event to date in Bulgaria--the SEOmoz Master Class at the Webit Conference in Sofia last Friday. Bulgaria’s top SEOs settled in--mildly skeptical yet very eager to listen to and challenge the SEO ambassador they’d seen on countless Whiteboard Fridays. Rand was ready, though, and he delivered. In the 3-hour marathon session (broken up by a brief 10-minute break), we drank SEO from the fire-hose. No important topic was left uncovered. So, to the takeaways already... On ranking correlation data 1. Correlation does not equal causation, but ignore it at your own peril. Data convinces clients & stakeholders better than opinions and anecdotal evidence. 2. Short, exact match keyword domains are best, if you can snag them. If not, go for hyphenated keyword domains as your next best option. 3. Differentiation opportunity for alt image tags--these had surprisingly higher correlation than other more popular on-page factors, like the over-optimized page title (I sense low-hanging fruit). 4. .gov & .edu domains... perhaps a bit overrated on authority, however they do tend to host quality sites. Overall, TLD’s don’t correlate especially well. 5. Number of linking root domains correlates even better than exact keyword match domain! News to me. 6. Metrics for predicting a site’s collective ability to rank pages, i.e. domain authority, are still not as reliable as page-level metrics. On Google Instant 7. It does NOT mark the death of SEO or the long-tail. Google Suggest trained people to read ahead a long time ago. Case closed. On site architecture and related on-page conundrums 8. Map your site structure before doing keyword research (I suggest using an actual mind mapping tool for this); this forces you think like a user before thinking like an SEO. 9. Editorial categorization beats user-defined categorization (e.g. user tags), which can get complex & messy as it grows. 10. Workaround for minimizing click depth and elevating deep pages: link to a custom sitemap in your nav menu. 11. Buttons are more clickable than links. Mail Chimp’s homepage demonstrates this well. No surprise, really, yet so many big sites still not getting it. 12. Rel canonical tag works like a 301 redirect. 13. What to do when spammers scrape and republish your content: Use absolute urls in source code--lazy scrapers may inadvertently link back to you Report it to DMCA Do NOT attempt to block bots (or allow select few) in your robots.txt file--bots change names. 14. Suspect incomplete indexation? Don’t trust ‘site:command’ on any of the engines, it’s flaky DO trust organic search visits to pages, shown in Google Analytics (GA) Track site sections separately in GA to better isolate trouble areas Syndicate content Create RSS feeds for the content you care most about getting indexed Tweet those pages! 15. Got a search-based site not accessible to crawlers? Create static category landing pages for popular keyword queries. 16. Thin content pages? Try: User-generated content (UGC) -- this is what makes an Amazon product page truly unique. Outsource writing assignments to Upworkcopywriters If you don’t care about them, keep them out of the index (meta no-index) to help your better pages get more easily found 17. Workaround faceted navigation (e.g. list re-sorting) by: Using rel canonical tag Use AJAX to reload page content Offer faceted navigation only to logged-in users (if possible) On Twitter’s cannibalization of the link graph & how to get more links, tweets, whatever 18. People who linked in the past Tweet today... links to viral content--when compared to a few years ago--are down; replaced by tweets. 19. Backtype, which captures all social sharing done on a page, helps complete the real picture of editorial endorsement. 20. Embeddable infographics--turn data into visually-appealing graphics... more low-hanging fruit that can reward well-optimized creativity. 21. Badge re-publishing works best when recipients have worked hard to earn them. 22. Be the first to write about trending topics on Twitter. Traffic may be short-lived, but replicate it over and over for sustainability. 23. Bundle tweets into weekly round-up blog posts (Wordpress plugin Twitter Tools does this automatically). 24. Create an award. 25. Create citation-worthy content, where sharing requires a link to the source (e.g. heavy drinkers outlive non-drinkers). 26. Find and target content niches where content supply is low relative to high demand. 27. Lots of sites still ‘do-follow’ links. Don’t overdue it, but... 28. Get links from friends, family, customers, vendors. Ask politely for a link in every email (duh). Wouldn’t you link to a good customer or vendor if asked? 29. Don’t ignore Twitter’s potential to send direct traffic; use Twitaholic to ID people who can send you real traffic. On making Google Analytics (GA) actionable 30. Ask upfront: (i) Why am I measuring this? (ii) What would I do if the results were different? 31. Measure number of visits per search engine over time, taking into account engines’ market shares. (e.g. does more traffic from Bing mean improved rankings or Bing’s growing market share?) 32. Measure unique pages and unique keywords receiving search referral traffic. 33. Monitor number of visits sent from search over time for top keywords. This may help flag drops in rankings. 34. Compare conversion rates of first time vs. returning visitors. Expect to see higher conversion rates for returning visitors. 35. Focus on boosting keywords currently ranking on page 2 results. Just a few more links, or on-page optimization, will likely bump you to page 1, which will mean lots more traffic. 36. GA gives you 20 goals--use ‘em! Create micro conversions for things like time spent on site, newsletter sign-ups, shares, tweets, etc. Do your best to assign unique values to these actions. 37. Fix GA’s latent last-click attribution bias (meaning the last click before the conversion gets the credit) by (at least) also measuring the first touch point. Here are instructions for setting up first touch tracking in GA. Again, hats off to Rand! Lots of folks clearly learned lots of great info that they’re already applying today. And keep an eye on the SEO talent in Bulgaria. It can make people happy enough to do handstands! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "37 Takeaways from SEOmoz Master Class in Bulgaria"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "37 Takeaways from SEOmoz Master Class in Bulgaria"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paris Childress\n          \n            Paris Childress\n          \n            Paris Childress"
}