{
  "url": "https://moz.com/blog/4-conversations-that-dont-involve-rank-reports-whiteboard-friday",
  "slug": "4-conversations-that-dont-involve-rank-reports-whiteboard-friday",
  "title": "4 Conversations That Don't Involve Rank Reports - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the controversy over the value of keyword rankings, many marketers are looking for other ways to report their progress. In today's Whiteboard Friday, Dana DiTomaso shows us several conversations that show results without even mentioning rank reports.",
  "content": "4 Conversations That Don't Involve Rank Reports Whiteboard Friday By: Dana DiTomaso November 8, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso November 8, 2013 4 Conversations That Don't Involve Rank Reports Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With personalization and (not provided) keywords, there's been plenty of debate in recent months over the value of keyword rankings in today's world of marketing. It's important to remember, though, that there are many ways of showing success without even mentioning keyword rankings. In today's Whiteboard Friday, Dana DiTomaso tells us about a few important conversations we can have regardless of our (or our clients') opinions on rank reports. For reference, here's a still of this week's whiteboard: Video transcription Howdy Moz fans. I'm not Rand today. I'm Dana DiTomaso from Kick Point, and I presented at MozCon about next-level local SEO tactics. One of the things that I talked about and one of the things people asked me about, I said, this was a little throwaway comment, \"Don't have conversations with your clients that end in rank reports, because it ends up in a bad conversation, and it focuses on the wrong kind of metric.\" People at the party afterwards said to me, \"That's nice, Dana, but seriously we have clients, and they want rank reports. So what are we supposed to do?\" So today I am doing a Whiteboard Friday on conversations with clients that don't end in a rank report, because I feel like this is a really important way for our industry to move. It's a really important conversation you need to learn how to have, and if you come armed with all this stuff, when you go meet with a client, eventually when you get to the end and you drag them through this process, they're going to love you forever. I promise. I promise. If it doesn't work, then I will send you Smarties, which are delicious chocolate treats from Canada. I promise, just e-mail me. So we're going to start with things that we talk to clients about when we start working with them. The first thing is I say to them, \"How much new business do you want?\" Before they say to me, \"Oh, I'm not showing up in the map, or I'm not ranking for these phrases,\" I say, \"How much new business can your company take in, say, the next month?\" These are actually real numbers from one of our real clients. So this isn't me just making up some crap. So they said to me, \"I can take 200 new customers.\" It's a service-based business. So they really do have an upper ceiling on how much new business they can take before they run out of people and they have to hire again. Okay, so 200. Now I say, \"So how many calls and people walking in,\" and it's a medical industry. It's not a lot of people who walk in, but they mostly get phone calls. How many new calls do they get now? They said, \"Well, we track.\" They're good at tracking. If your client isn't good at tracking, then get them good at tracking. Then they say, \"Okay, we got a 148 calls now.\" So I know that from the number of people who sign up with them, I say, \"How many people who call actually make an appointment?\" They say, \"Well, it's about 80%.\" Okay, so that means that you have 118 new leads. Okay, so you have 118 new leads that you get, and they look in their numbers and they say, \"Yeah, that seems about right. That seems cool.\" So then I take a look at their website visits for the previous month, for the previous time period, unique, not all visitors, just unique visitors, and I say, \"This is how many you unique visitors you got. It was 3,904. So that means that you have about a 3% conversion rate from the number of people who go to your website to the number of people who sign up for your stuff.\" So now we have a number that we can work with. Then I say, \"Okay, so if you want to hit 200 pieces of new business, that means that you have to get 250 calls or walk-ins\"—perhaps another business, not this one—\"which means that you need to get 6,700 visits to your website.\" So this is when we say, \"Based on the amount of budget that you'd like to give with us, we don't recommend that you're going to hit this number in this first month.\" So then we can figure out a plan with them and say, \"Okay, so next month we're going to start with PPC. We're going to do some AdWords, because that's going to convert really well for you, and you really want to get new business in right away. So let's do some AdWords.\" Then the next month, we're working on the map stuff in the meantime, and then we can create a plan for them on when we think we're going to hit these 6,700 visits, when we think that number's going to happen. Then they know how many months to expect of return. Then we can also find out from them, \"How much is each one of these 118 people worth to you? How much are you willing to spend per lead to get those people in the door?\" Then you can also take the math and break that out and determine your ROI for your business. So if you charge them a certain amount each month, which is how we do it, it's a monthly retainer type project, then we know the exact ROI and the exact cost per lead. So we can say to the client, \"Hey, we're actually making you money.\" Then they just keep paying the bills because we're actually making them money. We're not costing them any money. The second part of this is what you report on. So how do you get to these 6,700 visits? We break out all of our reports into five channels. We say how much organic traffic you got, how much paid, how much referral, how much social, how much direct. We show them just the unique visitor counts, and then we try to break down the conversions, although not every website has strong conversions. Sometimes we can't say, \"Okay, you got X number of calls via social.\" We don't necessarily know that. If we have call tracking set up, we can tell some of that. But it's not foolproof, obviously, like maybe somebody came via your Facebook page, and then they bookmarked the site, and then they called later. So of course it's only going to reflect as a social visit, but whatever. So that's why these raw numbers are so important. You can't track everything, but you can try to track most of the things. The other part of social, specifically, actually is a lot of really small businesses say, \"Yeah, this social thing, I don't understand. It's boring, it's stupid, and only kids are on Facebook. My clients aren't on Facebook, and I don't need social.\" So we start reporting on social, and there's a really nice piece of regex that you can use to break out your social visits. Do not include them in the referral traffic. Make sure to break them out as their own separate channel. Make sure that when you report on social, if you're getting a lot of social visits, just tell them about it and say, \"Hey, I know you're not doing anything on social right now, but you're getting a lot of social traffic.\" Or maybe if they're a home builder, for example, maybe they're getting Pinterest traffic, or from House.com, which is new house new social network. You say to them, \"I know you're not on any of these places, but people are already coming to your website from it, and they're converting. So maybe we can put some effort in. Just imagine the amount of business that you would get.\" You say, \"It would be this much extra each month for us to help you with your social strategies.\" This is a good business development tip for you. Then the last thing that pulls all of this together, and this is another throwaway in my presentation, a lot of people say, \"Well, advertising agencies, how do I work with these people?\" Part of it is just helping them be better at their job and helping them show that what they're doing is actually making money. So you don't want to go into a client and say, \"That advertising company you're paying all that money to, that stuff is crap. Forget them. You've got to go with this SEO stuff instead.\" Then you make enemies instead of making friends. So what we do is we say, \"Tell us about all the advertising you're doing right now, all your print ads, all your radio. Who is doing it? How are you tracking it?\" They'll say, \"Well, we have a print ad in the local newspaper, and we do a radio ad on this radio station, which is right in with our demographic.\" 'I'll say, \"That's great. What I would like to do is I would like to put some call tracking around that, so when you have the ad, and this is, 'We're awesome, you should call us, visit our awesomecompany.com, or call number,'\" instead it would say, \"Visit our awesomecompany.com/radio station name, or this magical call tracking number.\" So people do call from radio. I know they're usually in their car, totally breaking the law that you're not supposed to use your cell phones. But they do call. If they visit the website, set up a landing page. It doesn't have to be like a crazy PPC landing page, where you rip out the navigation and everything else. Just a landing page that says, \"Hey, radio station listener.\" In our hometown we have Sonic, so if it's like our awesomecompany.com/sonic, that's like a new alternative rock station. So if they visit Sonic, then we know the type of listener who's coming, and then we can write the content in a way that makes sense to that listener. We know how the DJs are on that radio station, so we can match the tone of the content to match the tone of the person who probably came because they heard the ad on Sonic. We know you're not listening to classical. You're listening to Pearl Jam. So we know the kind of music that you like, what type of person that you are, and we can write that content for you. It says basically, \"Howdy, Sonic listener, here's the stuff that we think you should know in order to call. Here's the information you want to arm yourself with. Hey, give us a call, or fill out this form.\" There's your conversion tactic there. So we can see how many visits we got to that web page. Then what you do is you talk to your radio rep or your media buyer, or whoever else the client is working with, and you say, \"Can I get the media blocking chart?\" This tells you when the ad is running. If it's from the radio station, for example, they can tell you after it's been done or what hours it was played in. So maybe they decided to only run the ad from 4:00 p.m. to 10:00 p.m., for example. Then in that case, you can take a look at your analytics on an hourly basis and compare: Did we get more direct and organic visits—this is typically the two that radio converts to—during those times? You can't tell with a direct visit if they didn't go to that fancy URL, if they just typed in the main URL, or if they organically typed in the name of your client and then went to the site. So maybe it's a brand new visit. More likely it's just not provided for this particular client, where these numbers in the example, they're actually up to 50% of not provided now, and I think it's just a lot of cell phone visits. So we take a look at these metrics. We compare it to the hours in their media blocking chart, and then we know approximately how much benefit they're receiving as a result of radio. Then you look good, because you're able to take an offline piece of advertising and turn it into an online metric, that is a conversion metric for the client, and the radio station looks great, because, \"Hey, look at this, now we actually know how much benefit you're getting from radio, which is a really difficult thing.\" Then because the radio station likes you, radio station reps are actually super friendly. You should make friends with them. They usually have like free swags and stuff and tickets to things. But the other thing is that they work with a lot of small businesses who first turn to radio. They're not calling you, they're calling the radio station because they think radio works, and for some clients it does. It really depends. But that radio rep will say, \"Hey, do you have a website? We want to mention your website in the ad.\" The company will say, \"No, I don't know about this web thing.\" The radio station will say, \"I'm working with this amazing company, and they have done this great tracking for one of our other clients, and look at what they've done, and look at the stuff they can report on.\" They'll say, \"That's amazing. I clearly need to spend all my money on these services, except for the money we're going to spend on radio.\" Then you get new business out of it. Somebody asked on the last day, \"How do you get a seat at the table with the advertisers?\" It's by playing nice with them. It's by saying to them, \"Look, I know that you can't do this level of tracking with the offline advertising to the actual leads, but I bet you can, and I'm going to teach you how. But I'm also going to show everything and how it relates to the client, all the pieces and how it all comes together.\" Then when you, as the business, as your consultant, when you report on this, that turns into this complete marketing reporting for the client, and they love this. They get really excited about it. Like when I give a client a report and I say, \"Look at this, your cost per lead went down two bucks,\" that's really exciting for a client.\" They think, \"Wow, this company is making even more money for me. What would happen if I gave them more money? Then what happens when I refer my friends to them to make more business?\" It's a way to make a rapport that turns into a business building tactic for you. I hope you find this helpful. Again, if you didn't, e-mail me and I'll give you some Smarties. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Conversations That Don't Involve Rank Reports"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Conversations That Don't Involve Rank Reports"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}