{
  "url": "https://moz.com/blog/4-graphics-to-help-illustrate-onpage-optimization",
  "slug": "4-graphics-to-help-illustrate-onpage-optimization",
  "title": "4 Graphics to Help Illustrate On-Page SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For many SEO professionals, on-page optimization is back to basics. But sadly, there seem to be a lot of us who still make some very basic mistakes. In this post, I'll try to add on to my previous writing on perfecting on-page optimization by sharing some visuals that can hopefully help to hammer…",
  "content": "4 Graphics to Help Illustrate On-Page SEO On-page SEO By: Rand Fishkin November 8, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 8, 2011 4 Graphics to Help Illustrate On-Page SEO On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For many SEO professionals, on-page optimization is back to basics. But sadly, there seem to be a lot of us who still make some very basic mistakes. In this post, I'll try to add on to my previous writing on perfecting on-page optimization by sharing some visuals that can hopefully help to hammer key points of the practice home. #1: The Value of Optimization and the Danger of Overdoing It I generally abide by the 80/20 rule when it comes to keyword use. 80% of the value to be had comes from 20% of the effort. Nail the title, the headline and make sure the phrase is on the page (and the page is actually on the subject of the keyword) and you've done your job. The additional impact on rankings to be gained from perfectly calculating the number of repetitions or ensuring every paragraph fits into the \"theme\" of the keyword and document is likely to be a waste of time better spent on other priorities. That's what this graph tries to illustrate: Nothing in the on-page world is going to provide exceptional ranking influence, but getting perfect is often only marginally better than just nailing the title and headline. If you're spending a ton of bandwidth on the last 80% of work (providing 20% of value), I might re-consider your to-do list. #2: On-Page SEO is More than Keywords When I first got into SEO in the early 2000's, the search engines seemed to have a fairly naive algorithm for content analysis, which led to SEOs adopting equally naive tactics for on-page optimization. Years later, these tendencies, sadly, still persist. Yes, it's essential to effectively target your keywords in your page titles, headlines (or early in the body copy), URLs, etc. But content analysis has become far more sophisticated with engines \"reading\" pages almost the way humans do and pattern-matching good content, design, layout and usability. There may even be some elements of on-page analysis that look at the authenticity and passion of the written word (or something that approximates it). In the graphics below, I've tried to illustrate this: I'm not suggesting one shouldn't optimize for keywords or that using terms and phrases that stay relevant and on-topic won't help. I'm merely noting that optimizing for the experience real, human users have and the value they derive from your work can produce outsized returns to simple, classic on-page optimization. #3: How Search Engines Can Measure a Page's Value This one's less of an illustration and more of a text-based diagram. I wanted to help explain all the signals Google can measure from their many sources of information, and how this can potentially affect SEO: Google's tremendous reach across the Internet, measuring nearly everything and every way people interact with web pages brings with it powerful data. That data is likely used to improve the quality of search results by helping the stuff that appears authentic, editorial and high quality to rise up while the junk falls to the bottom (at least when the data+algorithms work properly). For on-page optimization, this means we can't merely focus on keyword targeting. We need truly great content. #4: Consolidation vs. Multi-Page Targeting The question of whether to target two keyword terms/phrases on the same page or build individual pages for each seems to be a consistent struggle for SEOs. I field a question like this almost every week, and in 9/10 cases, the following flowchart would provide the right answer: It's not complex - and that's the beauty. When targeting similar phrases or phrases that can work together and target the same intent for most users, a single page should suffice. When the phrases cannot logically work together in a title/headline or when the intents don't have a high likelihood for overlap, it's time to build different pages and target the keywords separately. Feel free to use these in your presentations, websites and internal/client documents (though a source credit is much appreciated). And best of luck with your keyword targeting + on-page efforts! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Graphics to Help Illustrate On-Page SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Graphics to Help Illustrate On-Page SEO"
    },
    {
      "level": "H2",
      "text": "#1: The Value of Optimization and the Danger of Overdoing It"
    },
    {
      "level": "H2",
      "text": "#2: On-Page SEO is More than Keywords"
    },
    {
      "level": "H2",
      "text": "#3: How Search Engines Can Measure a Page's Value"
    },
    {
      "level": "H2",
      "text": "#4: Consolidation vs. Multi-Page Targeting"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}