{
  "url": "https://moz.com/blog/4-powerful-cro-tips",
  "slug": "4-powerful-cro-tips",
  "title": "4 Powerful CRO Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How much effort do you put in humanizing your business and building its credibility? You must have gone to flashy websites which sell their products /services in a very organized manner, provide excellent navigation and usability but which still fail to convert.  Why they fail? This is because they…",
  "content": "4 Powerful CRO Tips Marketing Psychology By: Himanshu Sharma September 20, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Himanshu Sharma September 20, 2010 4 Powerful CRO Tips Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. How much effort do you put into humanizing your business and building its credibility? You must have gone to flashy websites which sell their products /services in a very organized manner, provide excellent navigation and usability but which still fail to convert. Why do they fail? This is because they fail to win your trust. No amount of A/B testing or multivariate testing is going to work, if your website/business has credibility issues. Following are few tips to build credibility and get repeated conversions:Show that you are as real as real can be You can easily make your prospects doubt your credibility once you decide not to provide your complete physical address (which should include your street address, contact person name and phone number, fax number and e-mail address) and detailed information about your business. Many businesses provide only an online inquiry form on their ‘Contact Us’ page, which is the same as not providing any physical address. It means they don’t want their prospects to locate them. It means they are hiding something. Maybe they are not genuine. Maybe the whole business is just a scam. This is what your prospects will think about you. Similarly, if you don’t provide complete information about your business and you are primarily into selling services, then you may sound like a fake business. Clearly describe your business model - how you operate, why you operate, what is in it for you and how your prospect will benefit from your service. You must have very solid reasons to demand money especially when you need your prospects’ services. This is particularly true in the case of websites which offers ‘work from home’ jobs. Publish your team and store (if it exists) photos on your website. This is another way of showing that real people are behind your business. Clearly specify your store/office location through Google maps. Do Instant communication to get instant sales Say a prospect visits your website, liked what he saw and now wants to make a purchase. But first he wants answers to certain questions and that too instantly. All your website provides is an e-mail address or contact form for contact purposes. No phone, no IM (Instant Messaging) or call back facility. Now, the prospect doesn’t have time and patience to write a long mail to you and then wait for a few days or even a few hours. He wants his answers immediately. So he goes to your competitor’s site. Your competitor’s website provides answers to his questions instantly through its 24 hour toll free numbers and live chat support. Your prospect becomes your competitor’s client. You spent hundreds and thousands of dollars on web design and usability and still your competitor was able to take away your business just through his phone number. Your competitor may not have a better web site than yours but he was smart enough to understand the importance of instant communication. A phone number is not only a means of instant communication but it also provides a human touch to your online business. Prospects feel that real people are running your business and it is not just another scam site. Build credibility in your contents Follow the AIDA communication model while developing the content of your website. Write descriptions that sell your products. Put your heart and soul into developing content for your product pages. Following is a checklist to ensure the credibility of your products: Complete Description of the Product (including its features, benefits and how it is better than the others). 3-4 Coloured close-up photos of the product Video Demo of your product Powerful Case Studies Product Ratings, Customers' Feedback (both +ve & -ve) Clearly specified product price, range, availability (in stock, out of stock) and product condition (new or old) Secure Connection for online monetary transactions (SSL secure connection, 128/256 bit SSL certificate) Use of well known Payment Gateway (Pay Pal, CC Avenue etc) Clearly Specified: Payment Modes, currency accepted, Shipping Services, Item Location (the location from where the item will be shipped), Shipping Location (the location to where the item will be shipped), Shipping Cost (cost to ship an item), Insurance Cost (cost to Insure an item) and Handling Time (time required to ship an item once the payment is received). Clearly specified policies regarding: Payment, Shipping, Insurance, Warranty, Replacement, Refund, Cancellation, Privacy and Terms & Conditions of Sales. Show you Care Always try to go beyond your clients’ expectations when providing customer support .This applies not only to you but to all your team members, especially customer care professionals. They must have complete knowledge of the products and services you sell and must be able to handle any query related to payment, shipping, insurance, warranty, replacement, refund and cancellation of a product/service. A business can’t win the trust of its clients by providing incorrect information about a product or by showing ignorance. Often a sales representative is clueless about certain features of a particular product and he either provides incorrect information or passes the client to someone else. All these actions damage the credibility of the business and prevent getting repeat clients. Therefore it is very important that you anticipate the type of questions a customer might ask well in advance and include them in your training program and on your FAQ page. Encourage your clients to give feedbacks and record them to later streamline your business operations. Always handle call backs, emails and commitments with a sense of urgency. This shows how much sincere and dedicated you are in resolving your client’s query. Don't forget that basic courtesy strenghtens users engagement. You should always under-commit and over-deliver. It should not be the other way. For e.g. If you know it will take at least 5 hours to deliver your client’s shipment, then promise him a handling time of say 7 hrs. Even if you are late by 2 hours, you are still delivering the shipment on time. Make only those commitments that you can keep. At last, don’t forget the 80/20 principal - i.e. 80% of business comes through existing clients and only 20% through new clients. So focus on client retention. It is more profitable to spend marketing and sales efforts to retain existing clients than to acquire new clients if you already have a large client base. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Powerful CRO Tips"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Powerful CRO Tips"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Himanshu Sharma\n          \n            Himanshu Sharma\n          \n            Himanshu Sharma"
}