{
  "url": "https://moz.com/blog/4-step-plan-construct-your-own-keyword-url-map",
  "slug": "4-step-plan-construct-your-own-keyword-url-map",
  "title": "How to Find, Organize, and Strategically Apply Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Walk through the process of creating a dynamic keyword-to-URL map from scratch. If you’re an SEO or content creator and don’t have a dynamic, regularly referenced keyword map, this post is for you.",
  "content": "How to Find, Organize, and Strategically Apply Keywords Keyword Research | SEO Basics By: Carson Ward November 2, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Carson Ward November 2, 2016 How to Find, Organize, and Strategically Apply Keywords Keyword Research | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Knowing how to find and effectively use keywords is probably the most important skill for an effective search marketer. Smart keyword planning and tracking should also heavily inform content planning and strategy. Unfortunately, most keyword research is done on the fly as a new page is created. Rather than helping marketers find new opportunities and plan strategically, keywords are usually found and applied to existing posts and in-flight projects. If you’re an SEO or content creator and don’t have a living, regularly referenced keyword map, this post is for you. We won’t discuss how to optimize existing pages. There are lots of well-done technical SEO posts around if the optimization process is new to you. But if the concept of a keyword plan is new to you, this post should walk you through the process completely. If you’re experienced, you’ll probably pick up at least one new trick or application for keywords. If you’d like to follow along with a keyword research template I’ve created, feel free to make a copy of this Google doc. You’ll see images of it throughout the post that might make more sense if you open it up. Finding and selecting keywords Obviously the first step to using keywords is finding what people search for. While thorough and hopefully helpful, there’s nothing shocking or ground-breaking in this first section. The real magic is in how you use your keywords. Step 1: Build the “Big List” Your goal in this first phase of keyword research is to gather every keyword that your business would want to appear for. You won’t achieve that goal, but set your sights high. Think outside the structure of your current site. Look beyond keywords you currently rank for and knowingly compete for. Moz Keyword Explorer Moz’s Keyword Explorer is a great tool, and I’m not just saying that because of Moz’s resident hypnotist. I must have missed its launch somehow, yet it’s quickly become my first stop for collecting lots of keywords quickly. The grouping function is great for finding head terms, and the sub-terms will be useful later on in either optimizing terms on existing pages or finding related pages worth creating. Here I'm using the Moz keyword tool and excluding very low-volume keyword terms that I know I'll be ignoring. Throughout this post I’m using our site, HighSpeedInternet.com, as an example. Put in your known head terms and export them all using the “Export CSV” function. I’m impressed by the speed of the tool, and often use volume filters to avoid exporting terms I won’t actually use. That might sound small, but many tools force large exports prior to any estimation of search volume. Once you’re done gathering and exporting, you can remove duplicates and sort using Excel or a (slightly clumsier) Google Sheets script. SearchMetrics SearchMetrics is good for those who aren’t sure which keywords they want to rank for. We’ll need to input competitors’ sites to find keywords. For those who don’t know who competitors are, there’s a handy tool that shows likely candidates under “SEO research > Competitors.” SimilarWeb (not shown) is also helpful in checking for competitors. If your site is new, simply plug in some of the queries you’d like to rank for and look those sites up. Once you’ve discovered some competitors, throw them into SearchMetrics and head over to the “Rankings” section under “SEO Research” and click “Long Tail.” If this were a competitor’s site, I’d see a list of keywords they rank for and the potential traffic. Other tools SEMrush has a tool that can find keywords with search volume by site or related terms. One of the better all-in-one tools for keyword research. UberSuggest spits out tons of related terms. It’s no longer a favorite, as many have found suggestions to be irrelevant or low-volume terms. KeywordTool.io is a good complement to a more full-featured tool. It’s reliably better than most tools at finding mid-tail terms that others don’t find. Google Keyword Planner offers free suggestions. One major downside is that your competitors will probably be using the tool the same way you do, resulting in lots of competition for the more narrow set of terms that Google suggests. Still, it would be fine to use this tool and nothing else if your tools budget is low. There’s an almost unlimited number of keyword tools, but you really only need one or two. The more thorough your Big List process is, the more work you’ll save yourself later on. It’s usually worth it to spend a day or two gathering lots of keywords for a site you’ll be working on regularly. Step 2: Get keyword volume Use Excel’s handy function or a Google Sheets script to remove duplicate keywords. For most of us the next step is to import/paste sets of keywords into the Google Keyword Planner, export the volume, and repeat. There’s a limit to how many keywords Google will allow you to run at one time, so pre-filtering bad keywords might be a good idea. For example, I often pull out competitors’ branded terms. Work-around for “low-volume” accounts (+extra precision) Google recently continued its creeping war against those who use Google products for free by returning ranges in the keyword planner for low-spending accounts. These ranges (as in the image below) are so broad they’re essentially useless for anything but pre-filtering. To get around this limit, you can just click the nice “Add to plan” button on any one of your terms. If you’re only curious about volume for a few keywords, you can just click the “Add to plan” button for multiple terms. It’s easier to paste them in the next step for larger lists. Once you’ve added at least one keyword, click the “Review plan” button. Now you’re on a new page where you’ll need to be careful about avoiding the “Save to account” buttons unless you actually want to start bidding. Click “Add keywords” to paste your terms in, then save it to a new ad group. Now click the ad group. You’ll see a large table that’s mostly blank. Fill in a $999 bid and set the range to monthly. I also like to try different match types, but I typically use exact-match. So why is this cool? Impression count is more accurate, and not rounded like in the regular tool. You can set custom date ranges if you want a more accurate figure for forecasting purposes. You can play with match type again (which is something Google took away from the standard planner interface). It works for free accounts. At the end of Step 2, you should have a simple two-column list. Step 3: Filter keywords Notice I said we should filter keywords — not delete them. You’ll generally want to break keywords into three groups: 1.) Priority terms: Keywords you want to rank for immediately. A good priority term has the following attributes: Related to current and near-future business Implies a question you can answer well about a product you sell, OR implies a need you can fulfill High-enough volume to be worth the investment 2.) Secondary terms: We’ll want to go after these some day, but not before we have our priority keywords locked in with query-responsive, well-optimized pages. Secondary terms usually have the following traits: Doesn’t have buying intent, but has healthy volume and relates to what your site does Implies a question you don’t have the expertise to answer Low-volume terms that might convert 3.) Other terms: You might lay out some tertiary keywords (i.e those where you plan to expand the business), but you can generally stop there and label any others as keywords to “ignore for now.” You’ll usually want to note why you are or are not pursuing a term so you don’t have to re-evaluate it every time you look for new keywords. Step three’s endpoint just adds a few columns: Using keywords effectively Now that you’ve gathered keywords it’s time to figure out how to use them. Your ultimate goals are to 1) find new opportunities on existing pages, and 2) find keywords for which you don’t have a good landing page so that you can create or suggest a useful new piece of content. Before we can do either, we’ll need to map the keywords to pages on your site. Step 4: Map priority keywords Just like you needed human judgment to determine priority keywords, you’ll need to use good judgment to map them to pages. You can skip the judgment steps and still come out with a final product, but it will ultimately be far less useful. Besides, this is why we have jobs that machines won’t be taking over for a while. Scrape Google First, scrape Google for your keywords and current ranking. Google frowns on rank tracking and SERP scraping, but consider it fair game for all the content they scrape and save. If you don’t want to scrape SERPs you can manually map each page, but it’s nice for larger sites to check yes/no rather than thinking through a list of potential pages every time. There are tons of tools and services for this. AWR is probably the most common choice, as this is a one-time deal. You could also write a simple script with proxies or find a freelancer on one of a dozen sites. Moz Pro’s campaigns work up to your keyword limit, but the Moz tool is far better at helping after you’ve mapped keywords. Mapping new & existing URLs Once you have each keyword’s page and current rank, you’ll want to quickly check that the page matches the query. How does this page help the user? (Don’t confuse this with what the user does next.) Would the ideal version of that page do what you’d want if you typed this keyword into Google? Would a page about this keyword or set of keywords only serve the query better? You don’t want to create new pages for every tiny keyword variation, but we do want to make sure the page feels tailored to the user question. You’re trying to close the gap between what people want from Google and what your site does, so it shouldn’t be surprising if the questions you ask yourself feel UX-heavy. After asking these questions a few hundred times it’ll become second nature. You won’t rank at all for some terms, so you’ll have to either manually select a page or create a new one. For some pages (especially those 50+), Google will just be plain wrong and you’ll have to re-map them. The hardest choice is often whether an existing page could be optimized to be a better fit, or if a new URL is more appropriate. As a general rule, anything that would augment an existing page’s core purpose can be added, but anything that would detract or confuse the core purpose should be placed elsewhere. Don’t worry if it’s not immediately clear what the core purpose of the page is. Part of the value in this process is refining page purpose with keywords. If you have a page in the top 5 or 10, it’s usually best to assume optimizing the page is a better path than creating a new page. If you have sets of conflicting keywords (meaning optimizing for both confuses the page) ranking on the same URL, you can generally choose the higher-value terms and then link to a new page about the second set. For example, if we had a page appearing for “internet providers by zip code” and “satellite internet providers,” these would be considered conflicting. Trying to talk about satellite Internet (which is available almost everywhere) and zip code-specific Internet at the same time would be confusing. We’d create a new page for satellite Internet, delete the existing satellite Internet content, and link to the new page from the ranking URL. Building new pages If you’ve identified new pages that have opportunity, well done! Ensure that the amount of effort is worth the reward, and utilize the opportunities in your production process. Keyword research done well comes with a built-in business case. If you can show keyword volume and argue for keyword intent, you only have to make some assumptions on click, call, or purchase rates to put a potential dollar figure on the project. Once you’ve mapped keywords to a new page, you should also have scope settled at a high level. Knowing what questions you’re trying to answer and what the page should do gives everyone the information they need to contribute and determine the best way to build it. Optimizing existing pages Improving existing pages is usually easier and less time-intensive, but don’t simply optimize page titles and call it a day. Actually look at the page and determine whether it’s a good fit for what you’d want to see if you were the one Googling. Also consider the competition and aim to be better. There will be a larger list of existing terms ranking below the top spot where optimization and improvement need to be prioritized. Here are a couple examples of prioritization helpers: Keyword opportunity: Find a click-through study, estimate the traffic you’re getting in your current position, and estimate how much traffic you’d get from the top spot. Consider both keywords and pages. Competitive opportunity: Combine the opportunity above with competition metrics (e.g. PA/DA in the SERPs). Crawl your pages to get titles and content, break the keyword into its individual words, and see how many of the words appear. Use these figures as guides, and be smart about competition. It’s easy for analytical people to get too deep into a spreadsheet. Make sure you’re looking at your website and that of your competition, rather than making decisions on a pet formula alone. A word to skeptical content strategists/marketers I understand if you think this looks like a post for SEOs. Content that comes from highly searched keywords tends to be evergreen, but the result of writing keyword-targeting content is rarely something your visitors will rush to share. It’s very rarely inspiring, timely, fun, or otherwise sexy. Keep some things in mind, though: Depending on who you believe, organic traffic on average is 2–4x average referral traffic across the web. Don’t sell yourself short with a content strategy that only reaches half of your potential audience. You don’t have to create content the way everyone else has. In fact, please don’t! See a bunch of dull articles ranking for the term? Maybe make it an interactive tool. Write something that’s not dull. Answer the question better than anyone else has. You’ll drive more sales creating good content for boring searches than you will creating viral posts that get shared and linked to. Combine keyword hunting with shareable content for a truly business-changing organic/inbound strategy. You don’t need an SEO’s permission to create useful content for things Google explicitly tells you your potential fans and customers are looking for. Incorporating a keyword strategy into a comprehensive content strategy almost feels like cheating. Getting started: A spreadsheet template If all of this sounds a bit overwhelming, I’ve created a template in Google docs that you can begin using. Just choose “File > Make a copy,” read through the comments, and start entering in your own data once you feel comfortable. Get your keyword mapping template The Google doc does a lot of the boring stuff for you, like calculating keyword opportunity, title optimization (if you put in page titles), and organizing your keyword map by page and keyword with opportunity, volume, and more. When it’s time to automate There are tools for doing much of what this spreadsheet does. The right tool will be worth the money as long as you keep some things in mind before you dive in and start paying: It’s wise to know what you want a tool to do before buying it. Use the keyword mapping template, experiment with what you actually want and use regularly, and then you can start looking for tools to help you map keywords and optimize pages. Avoid tool clutter by using them deliberately. Most tools will try to map keywords to pages, but none can reliably tell you when or how you should create new content. If you’re never actually looking at keywords with human judgment and asking, “Am I answering that query?”, then you’re probably over-relying on the tool. For Moz Pro members, plugging in some keywords and playing around is a great place to start. Play around until you’re comfortable with rank tracking and page mapping, then look at some optimization suggestions. It’s now even better when combined with the keyword tool. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Find, Organize, and Strategically Apply Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Find, Organize, and Strategically Apply Keywords"
    },
    {
      "level": "H2",
      "text": "Finding and selecting keywords"
    },
    {
      "level": "H3",
      "text": "Step 1: Build the “Big List”"
    },
    {
      "level": "H4",
      "text": "Moz Keyword Explorer"
    },
    {
      "level": "H4",
      "text": "SearchMetrics"
    },
    {
      "level": "H4",
      "text": "Other tools"
    },
    {
      "level": "H3",
      "text": "Step 2: Get keyword volume"
    },
    {
      "level": "H4",
      "text": "Work-around for “low-volume” accounts (+extra precision)"
    },
    {
      "level": "H3",
      "text": "Step 3: Filter keywords"
    },
    {
      "level": "H2",
      "text": "Using keywords effectively"
    },
    {
      "level": "H3",
      "text": "Step 4: Map priority keywords"
    },
    {
      "level": "H4",
      "text": "Scrape Google"
    },
    {
      "level": "H4",
      "text": "Mapping new & existing URLs"
    },
    {
      "level": "H4",
      "text": "Building new pages"
    },
    {
      "level": "H4",
      "text": "Optimizing existing pages"
    },
    {
      "level": "H2",
      "text": "A word to skeptical content strategists/marketers"
    },
    {
      "level": "H2",
      "text": "Getting started: A spreadsheet template"
    },
    {
      "level": "H3",
      "text": "Get your keyword mapping template"
    },
    {
      "level": "H2",
      "text": "When it’s time to automate"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carson Ward\n          \n            Carson Ward\n          \n            Carson Ward"
}