{
  "url": "https://moz.com/blog/4-things-that-are-wrong-with-the-4-hour-workweek",
  "slug": "4-things-that-are-wrong-with-the-4-hour-workweek",
  "title": "4 Things That Are Wrong With the 4 Hour Workweek - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was anxious to read The 4-Hour Workweek by Timothy Ferriss.  I had picked it up while waiting in line at my local Kinkos because something on the dust jacket caught my attention.  I thought it would be kind of a \"Getting Things Done\" for the Internet Marketing set and once I got the book home, I…",
  "content": "4 Things That Are Wrong With the 4 Hour Workweek Marketing Industry V By: Vinny Goldsmith November 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! V By: Vinny Goldsmith November 21, 2007 4 Things That Are Wrong With the 4 Hour Workweek Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was anxious to read The 4-Hour Workweek by Timothy Ferriss. I had picked it up while waiting in line at my local Kinkos because something on the dust jacket caught my attention. I thought it would be kind of a \"Getting Things Done\" for the Internet Marketing set and once I got the book home, I couldn't wait to read it. Anticipation, unfortunately, turned into disappointment and eye-rolling. Let's get the disclaimer out of the way: doing even a cursory search of Timothy Ferris reveals there is a lot of skepticism about his claims in both his accomplishments (champion cage fighter, Guinness Book record holder in Tango, etc.) and his lifestyle. Having said that, I'm not one to throw out the baby with the bathwater. So I was willing to give this author the benefit of the doubt and I approached the book with an open mind. But that was only going to get him so far. Introduction For those of you who haven't heard of this book, it’s a guide to \"escaping the 9-5 life, living anywhere and joining the newly rich.\" And even though the title says \"The 4-Hour Workweek,\" I was hoping it meant something different. I'm not one of those people who hate their job. I'm the kind of guy that gets antsy to do something productive on the second day of a three-day trip to Cabo. I have no idea what I would do with myself if I ever retired or only worked 4 hours a week. I do want to say the book as a whole does have some value. For instance, in the best chapter of the book, titled \"Outsourcing Life,\" he says essentially this: \"Never do a task yourself that you can delegate. Never delegate a task that you can automate. And never automate a task that you can eliminate all together.\" You can read volumes of management and business books, and you'd be hard-pressed to find more concise and complete advice on streamlining a business. At the end of each chapter there are also little exercises you can do to get out of your comfort zone. And even though I never do them, I like it when books have these (actionable content is good content). And for us internet types, there is also a nice little chapter on testing out different business ideas by investing a small amount in Adwords and analyzing the results. But it is probably below the scope of what most of us do on a daily basis. I also like his whole premise of taking \"mini-retirements\" - a fancy word for extended vacations or sabbaticals. (Ferriss tends to invent new names or monikers for things that already have perfectly good names. I think there might be an SEO strategy in this - but that will have to be a different YOUmoz post.) So, now let’s talk about what is wrong with the book. 1) Don't sell people on what you haven't sold Ferriss apparently made his fortunes by selling muscle and brain supplements (ingestibles) via mail order. He uses an assortment of virtual assistants and drop shippers to handle all of this and supposedly checks his e-mail only once a week. Everything runs as smoothly as possible and he's living the life of the newly rich (wealthy beyond measure, mobile lifestyle, and a portable/passive income). This is all fine and good and certainly something worth striving for. So, what advice would he give if you were to ask him what kind of business you should go into? Informational products. We all know this euphemism as e-books. I’m not opposed to e-products as a group. I think the right kind - professionally done - can be a real value. But to me this is like asking some guy who has made millions in the stock market where you should invest your money, and he tells you to go put all your money in real estate. There are too many differences between the two for anyone to think one is exchangeable with the other. In the case of ingestibles versus e-books, one is a recurring consumable (if it works) and the other is something someone buys one time only (whether it works or not), so the revenue model and customer acquisition costs will be different. (Unless he goes the SEOmoz route with subscription based premium content – but Ferriss doesn’t touch on this.) Oh, and where does he suggest you get the content for this e-book? “Repurpose content that is in the public domain and not subject to copyright protection, such as government documents or material that predates modern copyright law.” How is THAT for a value added service? 2) How NOT to become an expert On what amounts to not even two full pages of the book, Ferriss prescribes “How to Become a Top Expert in 4 Weeks.” His advice is basically this: join 2 or 3 related trade organizations, read the 3 top-selling books in your chosen field, give one or two free seminars at a local college or Fortune 500 company, offer to write free articles for a trade journal and get yourself on Profnet (a meeting place for journalists and experts). You’ll need this expertise of course to sell the “informational products” that he suggests you sell, and to me it is exactly this kind of quick and dirty mentality that breeds so many snake-oil salesmen on and off the internet. To me, if you want to be an expert, you need a little bit more. Like maybe some demonstrable results where you’ve actually done or improved something for somebody. But that’s just me. 3) Selective ignorance is still ignorance There is a very brief chapter in the beginning of the book where Ferris explains how he has so much free time: he pays attention to nothing. He doesn’t keep up on the news, politics, gossip, and only a little bit of industry happenings (two magazines a month max read for only a total of one hour). He claims to only read e-mail for one day a week for one hour exactly. And how does he compensate for all this? He talks to his friends and relatives a lot. For instance, when the elections roll around, who will he vote for? He’ll ask some of his more informed friends who they are voting for and why. I’m all for a low-information diet, as he calls it. I think all of us could follow Rand’s lead and trim the fat from our RSS readers and Internet bookmarks, but there’s a low-information diet and there’s information anorexia. Ferris is clearly in the latter category, and I’m not sure you can claim to be an expert without being tapped in to your various spheres of influence and the information they provide. 4) Where is the SEO? His whole book is built around the premise that you are going to drive traffic to a website, sell a product, and make lots of money. He even shows a diagram of how traffic is driven to your website by online and offline advertising – but he doesn’t once mention search engines or optimization thereof. Maybe he should add one or two more information sources to his low-information diet. The Takeway My advice is two-fold: One, if you're after this kind of lifestyle, your time is better spent reading pretty much anything on Tropical SEO (for some real motivation, I like to glance at his Class of 2006 post). Two, if you're talking to a prospective client and they have this book on their desk, you now know they'll be in need of some good SEO advice. Other YOUmoz stuff you should read: A Brief History of SEO - Feedthebot uses Bill the Cat to bring us all up to date. 5 Ideas to Kick-Start Your Marketing Ideas... or Anything Else - Identity gives a good primer on thinking out of the box. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Things That Are Wrong With the 4 Hour Workweek"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Things That Are Wrong With the 4 Hour Workweek"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith"
}