{
  "url": "https://moz.com/blog/40-important-local-search-questions-answered",
  "slug": "40-important-local-search-questions-answered",
  "title": "40 Important Local Search Questions Answered - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local has officially grown up, and it's becoming a major force to be reckoned with. I received a ton of questions from my Mozinar about where local is headed, and I decided to dive deep into the answers. Make yourself a cup of coffee and dig in to 40 local search questions answered in detail!",
  "content": "40 Important Local Search Questions Answered Local SEO M By: Mike Ramsey January 31, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Mike Ramsey January 31, 2013 40 Important Local Search Questions Answered Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Disclaimer: This post is a follow-up to the recent Mozinar \"Be Where Local is Going\" by Mike Ramsey. You can check out the full recorded Mozinar here! Local has officially grown up. It's arrived and has become a major force to be reckoned with because of things like this... Yext getting a $270 million valuation Ed Parsons from Google stating that 1 in 3 searches are about a place David Mihm's GetListed.org getting acquired by SEOmoz The Google Venice Update that localized organic search results Recently, companies that have ignored local found themselves apologizing for how they behaved in the good ol' days, and are trying to learn as much as possible to catch up. We have seen a HUGE growing interest in the Local University Conference Series over this past year (especially our advanced conferences, like the one coming up in Baltimore) and it seems like all of the major SEO hubs have really started to embrace local with more vigor and passion than in times past. With that in mind, Moz asked if I would do a Mozinar on the topic of local. I was amazed at the audience response that came from it. I received over 80 questions asked throughout the Mozinar and around 30 emails with longer-winded questions after the fact. That is when I realized that even though local has arrived, it's still a mess. There are a ton questions and confusing aspects of local search, and I thought the best way that I could help would simply be to create a post answering as many questions as I could until my carpel tunnel kicks in and I couldn't type anymore. So here it goes. The questions are organized by topics within local. If you have more questions, please feel free to post them in the comments below and I (or hopefully some of the other local search peeps) can answer them for you. Remember, the only foolish question is the one that doesn't get asked. Here are the sections: Local Strategy and Tactics Reviews Citations/Directories Links Onsite Optimization Google+ Local Warning: I don't recommend reading this all in one sitting. It's over 6,000 words. Try to digest it one section at a time. Local Strategy and Tactics 1. Any suggestions to take advantage of local search for multiple states rather than cities? In some cases, states will show map results. This changes constantly, though, so I wouldn't count on it, or even focus on ranking in maps for a state search. Instead, think of it from an organic perspective. What would people want to see based a search phrase like \"Salt lake City Plummer\" compared to \"Utah Plummer\"? Here are a couple thoughts: Testimonials would be different. I want the Utah Plummer to show me testimonials for a ton of cities in that State. Multiple office locations on a state page (found on your website) would be useful in understanding how big the company is and if they can truly service state wide. As for the Google+ local page, when they rank for a state, it still represents a single physical address in a single city. Because of this, you would want to add that you service statewide in your business description area. You can also set a service area on your google+ listing that would show a state wide reach. Show state certifications compared to city Chamber of Commerce trust symbols. 2. If you are a local company with one location that services people at their home, how do you rank for all the cities in your area? You don’t rank in the maps section. Google will generally only let you rank in the city your address is located. There are exceptions, so don’t plan on being one. You can build out content on your website to rank organically for the other cities (where you don’t have an address) and in a lot of cases today, if your organic page has stronger singles than the listings found in the map results you can actually rank above the maps like this. You can also get a real address in the cities that you want to rank in. Fake address and UPS boxes have been popular for some businesses to use, but they carry a huge risk. My advice is to play it safe and go with real locations where you can conduct face to face business, or try to rank organically. 3. Where in G+ were you saying to add links to help you rank twice (in blend and organic)? Once you list a URL with your Google+ local listing, that URL (home page or local landing page) will not rank both in maps and organically. In the Mozinar, I explained that if you are a single-business location, use your home page as the URL on the Google+ local listing and then build a sub page for the service (explaining it further) so that both could potentially rank. This works way better for long-tail terms or custom Google Places category choices. Outcome looks something like this: (Ehline ranks with his home page in maps, and a sub page on Torrance Personal Injury Lawyer.) 4. What is the best way for a retail store to rank in a city that they aren't located in? Organically, as you can't in maps. However, you need to ask yourself why you would want to do this. It's really not best for the searcher. If I am looking for \"Burley Idaho shoes,\" would I really want to see a list of \"Twin Falls shoe stores\"? Google will always be fighting you on this and trying to ensure you don’t rank. So, you could open a new location to rank in maps, or use paid ads and possibly even an article that says something like, \"Burley shoe stores suck and here's why, come to Twin Falls for awesome shoes.\" However, my advice is to stay local. 5. Do you know if optimizing for local negatively affects online national organic search results, if you have both a local presence and national online eCommerce site? It doesn't. Mainly because, if done properly, you would have pages that represent your national search ranking ambitions and you would have completely different pages for local stores. Take Walmart, for instance. They need to rank with local store information, but also want to be able to show up for product or category searches for eCommerce. They have a location finder that leads to individual pages that provide store hours, local coupons, and directions. Here is my local Walmart page. The thing that they do well (and I see this is a future must) is being able to show your local store inventory while browsing products. I have worked with brands that have a decentralized approach to local. The eCommerce team does everything they can to ensure that no one goes to the location to buy anything because they are rewarded for eCommerce sales, not store sales. This is wrong. You shouldn't care if a customer buys something online or in a store front as long as the item is purchased. Give customers the choice, and you will always win. This is also the best way to compete against Amazon, in my opinion. They can't (yet) get me an item within an hour of my decision to purchase it. 6. Why in your opinion do you find different Google + Local search rankings for keyword phrases with words ordered differently for example \"Atlanta handyman\" vs. \"handyman Atlanta\" and then without geographical modifiers? I've got clients where these ranking very greatly. This is just my opinion, but I think each word in a query carries a certain weight based off positioning, regional vs global data, or a bazillion other factors that Google could take into account. A website would have a different relevance score for all three of the examples you showed above. Maybe one site is well optimized for Seattle and partly optimized for Pizza. They rank better on \"Seattle pizza\" than \"pizza Seattle\" because the weight is on the first word searched. If just \"pizza\" is typed, Seattle wasn't in the search query, and Google determines there is local intent, then they might use a precise location of the search compared to the exact center of Seattle. This would change the results yet again. 7. I've had a couple of clients who don't live in the city but live in a rural area outside of the city. They are a service business and had a UPS address with a suite # they recently got booted from maps and Google + local. Any work around for businesses outside the service area to show up? No. I hate this about Google Maps, actually. When you're a service business, I don’t see the importance of your location compared to the location you service. But, for the time being, the best advice I can give is if it means that much to your business, get a legitimate address in the city service area. Pay rent on a building you can meet clients at and answer the phone at. Then you are on Google’s nice list. It's not fun being on the naughty side. 8. Due to the constant algorithm changes, is it now more cost effective for local companies to use PPC campaign versus trying to rank locally? I would say no, in most cases. It completely depends on your business model and industry and the currently level of competition. Google just launched Adwords Express+ and this will drive everyone’s cost even higher over time in local ads. So, if you have a solid organic strategy in place compared to churn and burn, I think your organic side exponentially grows where as the only way to grow PPC is to spend more. The key is to stop looking at rankings as the purpose of your SEO work and just expect it as an outcome of good outreach. If you do a guest post, it's not just a link; it could be reaching a community of potential customers that aren't searching for you yet, but will become a brand search later. Referral traffic goes up, you get some great links, and the outcome is better long-term rankings. But the point was to reach the audience on the site and the link is just a bonus. When done properly in a local market, this approach will be the trump card. 9. I wonder how I should handle the listings for a local business with two physical places in the same city? Google is fine with every physical location having a listing. So, if you have two locations in a city or 100 locations in a city, you can have a listing for each. The key is ensuring that whatever page you point searchers to on your site gives a unique experience with the content you provide. Talk about directions to the location, points of interest next to each location, and reviews for the specific location. I run across results like this often (Jack In The Box ranks twice): Reviews 10. Have any strategies to get lost Google+ local reviews come back to a local business that changed its location? There have been so many issues with reviews since Google+ Local was rolled out, I decided to make this Comigraphic. Really, if the reviews being lost aren’t spam, then it comes down to the way business information is stored in Google's system. Your business Name, Address, and Phone number make up your online identity to Google. When one of these things changes then what can happen is Google starts thinking that there are two identities and sometimes your data (reviews or citations) will be stored with the wrong identity. Here is Google's advice on moving: If a business no longer exists at a location, you can mark it as closed or moved on Google Maps. Follow these steps to have the listing moderated: Find the closed or moved business on Google Maps. Use the Report a problem link from the Google Maps result. Select Place is permanently closed option. If the place has moved to a new location, give us the new location’s information in the comment box. If your business has moved and you manage the business’s new location, you should add the new location as a separate listing in your Places dashboard. Word is that if you move, you lose your reviews. There is a discussion on Linda's forum on this very subject where a couple of Googlers dropped in. In the example that is mentioned in the forum, the old business listing shows the old reviews and says it has moved locations and shows (and links) to the new address. The reviews have transferred so they exist on both listings as well. Hopefully this means that following Google's advice will help you keep your reviews, but sometimes the same path leads to different outcomes in the Googleverse. My best advice is never change your name, never move your address, never change your phone number. 11. Why can't you offer customers something to write a review? Because Google said so in their guidelines. :-) Yelp says the same thing, as well. I think the reason is they feel the review would be biased if you were given any form of a reward for leaving it. They don't want solicited reviews. 12. What is the best way to handle bad reviews on sites like PissedConsumer.com and RipoffReport.com that are ranking on the first page when they are completely spammy and not legit? Here is a very interesting article on the subject with a few different options. If you don’t think you can get it down through a legal fight, you can try to bury it by basically creating 10-20 properties for your brand that can rank above the bad information pushing it off of page one, and even two. But the report will always be there. Facebook, LinkedIn, Twitter, and Wordpress pages for your brand are really easy to use as part of this list. The idea is to own the entire page with listings you control on your brand name searches. 13. On the topic of reviews, would you say \"one a week\" is a good system to avoid waves? How many is too many a week? I don’t know if there is an exact number of reviews per week that Google would or wouldn't look at. The key is to make the review process part of your point of sale. This way, you will naturally get reviews. At one review a week, you would have 52 reviews in a year, and I see VERY few industries that have 50+ reviews in total on a listing. What you want to avoid is going six months without reviews and then in a single day getting like 10-15 reviews. That is extremely unnatural unless you are in business for one day a year. In that case, if you will pay me lots, I will come and work for you for that one day. The hardest part about the review process is that you need to get reviews from accounts that have review history. If you have a customer who creates their Google+ profile simply to leave your company one review, I can almost guarantee that it will get filtered. In the Mozinar, I talk about how to find people with active review accounts. 14. Can you get existing reviews (on Yelp, Yahoo, Zagat, etc.) to appear on your new +Local page? Or can you only link to those reviews? Google no longer shows the reviews from other providers in their review count and list. But there was a Google patent that basically said that they could look at other review sites and the amount of reviews as a ranking factor. I have learned something over the years with Google: just because they don't show it, doesn't mean it wont matter. Get reviews from other sites like Yelp, Yahoo, and Zagat if you customers use those sites and it will help you get business. Google might have a big market share, but they don't have all of it. 15. You said review stations are not allowed. What’s the difference with you asking for a review on your website then? Isn't that the same? The different is the location that the review is uploaded from. A review station will basically have a static spot. A single IP. So, it looks as if someone is sitting in a office creating review accounts and posting a fake review from it. I personally think review stations are a great idea, but Google doesn't. Though I think I am kinda a big deal, I am afraid that in this case, they win. 16. In the car industry, there have been many complaints to the Google+ local team about reviews not showing up on their local pages. Have you seen any of these issues happening or any insight of these \"bugs\" happening? They are not bugs. Google felt that in the car dealer market, most, if not all, the reviews on Google+ local were spammy. So those reviews are filtered. Mike Blumenthal said the following on his blog about it: \"I can’t share with you the specifics of why Google thinks that most car dealership reviews are spammy. The details of the conversation were under NDA. I assume though that they have looked at a lot and have solid grounds for their understanding of the situation. The ones that I have looked appear to be guilty of either the misuse of on-site terminals to gather reviews or the use of third parties to post feedback cards as reviews.\" Citations/Directories 17. Are citation directories likely to get hit by an algo? How are they different from other directories? I do think that some citation directories have been hit by a Panda update. Most business information is copied info. This is why you are seeing less and less directories ranking on local search terms. What separates a good local directory from a bad one? Local, unique content. What is the best way for a directory to get this content? User generated reviews. I think this is why Yelp does well in the search results still. Also, to be fair, local directories weren't made for spamming links. They were made for providing websites and users with business information and listings. They run moderation in many cases (phone verification or post card verification). So, even on a bad day, you couldn't group them in the same category as a directory of websites that was strictly for getting a link. I do think that the local directory business is in a tight spot, though. Google has basically declared themselves the \"ultimate directory\" and the one directory to rule them all and all are subjected unto them. Unless you can pull a Yelp and get a deal with Apple Maps, or pull a Zagat and get purchased by Google, how can you possibly stay relevant? It is time for local directories to reinvent themselves. 18. I've heard citation submission be compared to manual link building of the past. Do you think businesses that submit information to directories will be hit by an algorithm in the future? If they spam the listings, yes. Here is an excellent write up by Bill Slawski on a patent that was granted to Google on how they might determine \"spam citations.\" The main thing Google would look for is a business name with search keywords stuffed in it, or categories with location keywords being used. So, if you are creating/claiming local listings correctly and keep your NAP information accurate and consistent, then I don’t think you need to worry. On the other hand, if you are filling out your listings like this...worry: Business Name - Keyword Keyword Location Category one: Location Dentist Category two: Dentist in Location Category three: Best Dentist in Location Category four: Local dentist in Location 19. What do you think about the Localeze, Infogroup, Axciom, and Yext-like services? I think that they serve a great purpose, which is to scale local information across many different directories. For a business that has 100's or 1000's of locations, I don’t see a very feasible way to do this otherwise. The problem with all the services is that they are supplying data to partner sites that they do not control. So, lets say you have changed your phone number multiple times over the years. Or maybe you changed addresses. Paying these companies might get a new version of the address submitted, but it wont take care of the bigger issue, which is bad business information still left on directories. Also, while the basic business data is sent to the partners this doesn't mean that every listing looks pretty and has pictures listed withe full profiles filled out. You get the basic data listed. Generally speaking, if you can claim and fix listings by hand, I would recommend that approach. If you don't have the time or money to do that, then using the data aggregators is a solid option. In some cases, the combination of both would be the perfect option. In your major markets, do as much hand claiming as possible and automate the rest. 20. How do you deal with call tracking in regards to NAP? This is one of the most frequently asked questions in local search. I get seriously upset at Google for how they handle this. The short answer is you can't do call tracking with your listings. If you put different numbers on different directories, than you send mixed signals to Google. Their answer is you can use call tracking on their paid products. Since Google+ local is free, I don’t think they are going to come up with a solution. All it would take is for Google to create another field called \"preferred number\" that you could fill out on your listing and it would display that number even though they would have record of your local number. It would also allow them to find any place online with the preferred number listed and attribute it correctly. In my opinion, Google is holding back the industry and crippling other directories by not allowing for call tracking. But they have every right to do it. That's the worst part. So what do I do? I keep the number consistent for NAP and I use an image on the website with a big number that is being tracked. That way, Google doesn't index the number. The issue is this will only be used by the people on your website and not the business listings. Links 21. In terms of links, do you need to build links to your Google + business page, Yelp page, etc., or is linking building primarily targeted to the website itself? People link to things that are awesome. At least they should. So links to directory pages don't make a ton of sense in a \"perfect world\" and probably don't represent a reason to rank a business higher than another business as most of these links would be built by the business owner and not earned. Now that Google+ pages have a social layer to them, it makes since that they could get links, get mentioned, etc. I don’t think it will necessarily help you rank higher in map results, but it will make your actual Google+ listing rank higher on your brand name. Same with Yelp, though; I think the only reason a Yelp listing should be linked to is as a way to say \"check out our Yelp listing for reviews.\" The type of links that help your map listing rank higher are ones that point at your website. 22. Can you please offer a range of local backlinks that should be applied to a local business to stay under the radar, but be aggressive enough to move up in the SERPs? Loaded question. Let me first talk about \"staying under the radar.\" I used to have this mentality when it came to link building, especially in local, as it's so freaking hard to get real links in this space. When you can get to the point that the links you build have nothing to do with ranking on Google, you will sleep better, succeed more, and be able to take down your Matt Cutts dartboard. Here's why: link building for increasing page rank is against Google's guidelines. They will continue to interpret that statement unfairly, and with major bias and small businesses will fall on the wrong side of that list forever. So do these things for links and you will be fine. 1. Quality Guest Posts (try to get em locally) - I built Nifty Marketing through guest posts. I started writing on my blog, and no one came to read it. So I started writing on Search Engine Journal and I didn't do it to get a link; I wanted to get recognized in the local space. I wanted people to know who I was. That lead to speaking events, stories on Search Engine Land, and mentions + posts on the SEOmoz blog. I can tell you I got more business off of the things I wrote or said speaking than I ever did off my rankings (and we have had a lot of good spots). Rankings are a by-product of building your brand. I used to hate that idea, but now I get it. It took me from a no name SEO in Burley, Idaho to a faculty member of Local U, and a speaker at SMX Advanced, West, East, Pubcon, Searchfest, and many other places. All of this came from outreach. If I would have only been focused on the rankings from my links, I would have missed the cream. I would have focused on building fake authority and \"flying under the radar\" (which is how I started before I knew better and even got a fancy link penalty for it). So now, I focus on clients that allow us to do cool things. Write cool content, and try to get them recognized for it. It's expensive, slow, and not easy, but it's always worth it. 2. Citations - These are links. Most directories allow for a naked URL to show. Most importantly, people search for businesses on directories. If you fill them out and do a proper job of it, then you will look better than your competitors. You will stand out, you will have reviews on your listing and it will get indexed and the link will count for your business and it will help. 3. Microsites - Not dirty copied content microsites that just switch out a location name. I'm talking unique sites that serve a purpose like this one. The point of this site isn't to link back to a main site. The point of the site is to share and gather testimonials for this business. Having it on its own URL makes finding and sharing the site offline easy. 4. Local Newspapers - I own a small town weekly newspaper that is delivered to 18,000 homes and has around 35,000 readers. I need good local content. If a business comes to us with an awesome idea, I find room. That is a big potential audience. It's a print paper, but there is an online version. It is single-handedly one of the best links that you could get in a town like mine. 5. Social links - Check out this Facebook page for Abrey Adams. She's a local photographer in my small town of 10,000. She has 11,000 real fans on Facebook. She gets referral business all day long. She runs Facebook competitions, she posts EVERYTHING, and she's really good at photography and Photoshop. Screw ranking on Burley and Idaho Photographer (even though she ranks in the top spots). Her business is coming from the buzz of her local brand. If she only worried about people finding her on search in my town, she would have to close up shop. If you focus on the above, you wont fly under the radar. You will fly way above it and not even care. 23. Is the time it takes to build up a local microsite to a respectable level worth it? If the microsite is only for the purpose of the link, then no, it's not worth the time. If the site serves a purpose for the brand and brings visibility, then yes. Onsite Optimization 24. Can you suggest a good NAP (correct?) maker site? Here is the best schema site for coding your address and here is a great article on how to do it. For even more fields, you can check out the actual local business section on schema.org 25. Should the (website) testimonials be on a \"testimonials\" page, or along the sidebar? Do they need to be unique from the testimonials given on the Google+ Local page and other local sources? I think that testimonials can be on both the sidebar and a full page. It doesn't make since to have more than one or two testimonials on a sidebar or a landing page, but having a massive page of testimonials can speak for your service quality. When it comes to the content of the testimonials, if you copy them from Google+ local, Yelp, or other directories, this is duplicate content. It might keep a page from ranking on (your brand name + reviews), but I doubt you would trip a Panda filter with it. There was a bit of a fiasco that happened at LocalU advanced this year in New York when Joel Headley mentioned that duplicated reviews could be removed from Google+. He wasn't able to give any specifics, but I think it is worth reading. 26. Do you recommend creating landing page for both Service by City (meaning a landing page for every city and service)? Yes. We created a local landing page infographic that has a good breakdown of the information to include on a local landing page. When it comes to services pages, I would also recommend building them out on a per location bases if you can do it with quality unique content. For example, let's say you are a pest control company that offers bed bug treatments. You already have local landing pages for each of your offices that shows your address. If you build out a bed bug page for each market, you could add local testimonials and talk about the places around the city that have been having bed bug problems. You can link to local news sources talking about the problem and you can give localized advice on your pricing and service. This is a better experience for the user than an overall bed bug page for all your locations. Very few people are doing this, and it's a great way to capitalize on long tail search. 27. Hi, you briefly mentioned KML, on Google’s help page they say this is no longer supported. Are you still using this and how? Yes. Geo sitemaps stopped being supported, but you can still create a kml file and link to it from your xml and html sitemap. Also, you can upload it as a sitemap in google webmaster tools following these directions. Here is a site that helps you create a kml file. 28. Can we touch on what to do with NAPs for clients who have multiple office locations? I generally like to have a \"locations\" tab in the main navigation that would go to a page like this: Then, you can have the addresses as links that point to your local landing page. Both address (on the location page and on the local landing page) should be coded in schema. This method works great up to around 100 locations. If you have more locations than that, you should consider a store finder and build your local directory with a state folder so your URL structure would be mysite.com/locations/california/los-angeles. Google+ Local 29. Does having your full name displayed on Google+ turn you off from leaving an online review? Yes... and no. I get why Google wants full names to be displayed. It keeps people honest. For instance, I know most of the business owners in my town on a first name basis. If I review them, I better be willing to stand by it because I see them around town. People won't say a lot of really harsh things because of it. But does that actually represent the experience? Hard to tell. Then there are the situations like DUI Lawyers where you just can't plan on getting reviews period. Who would really leave a review with their full name? Could you imagine... \"I was caught drunk driving and got away with it. This guy rocks. BOOM!\" It was a stand Google made. I respect them, but I think it puts some industries in a tough spot and it doesn't work as well for small towns. 30. How do you connect a business google places listing or transfer that information to a Google+ business listing? This post from David Mihm is the best post on the claiming process I know of. 31. Some of our clients operate out of their home, and do not want to use their physical address. Suggestions on G+ pages? I hate this whole end of Google+ local and hiding addresses. Here is a piece I did when the feature first came out. Hiding address was a guaranteed way to sink a listing. That changed. Around a year later, Miriam wrote this piece explaining that if you are a service based business and check the box that says you service customers at their location, then you need to hide your address or your listing could get suspended. Now, if you have your address hidden and service customers at their location, then Google+ local is not a product you can use. There is a sticky post by Jade (Googler) that says: \"The upgraded (merged) local Google+ pages are not currently supporting service area businesses. Please continue to manage it via Google Places for Business and hide your address as necessary, detailed in the quality guidelines.\" 32. How do you approach Google+ pages for a local business with multiple websites that are for different services? For example, a lawyer with both a DUI site and a bankrupcy site. Should each site have its own Google+ local page (as some suggest) or just one Local Plus page, which then would not link to one site? You can't create more than one listing in Google Places +local social pages for different services. So basically, a one site approach. This is only for maps. Organically, it wouldn't matter. 33. We have verified our two locations with Google, but our locations are still \"under review\" for the last six weeks. Any tips you can offer on how to get out of the sandbox? This is a link to a Google Troubleshooter for verifying listings. In a move that completely shocked the local SEO world, Google is now offering phone support on verification issues. My guess is that a monetization strategy in local will follow soon. In the meantime, if you have issues with verification, follow the steps on the link and you will get fixed up. 34. I work for a company that has multiple businesses from one location. Will Google see us being spammy if we have the Google+ local pointing to the same location for those businesses? This is a question that I have heard a lot of mixed responses on. But fact of the matter is the \"real world\" works this way. I ran two businesses that were separate LLCs from a single location for two years. You can use the same address for both listings. Here are a couple of things to keep in mind, though: If the businesses are in the same industry, just with different names, it generally will get flagged as spam. You do run the risk of the listings having information merge and reviews possibly crossing onto the wrong listing (worst case scenario). 35. If my page was created as a brand page, should I and how can I switch it to a places page? You can't, according to Google. Hopefully they change this at some point. 36. With Google+, what does a company use as an account login to Google+ if they have multiple locations and businesses and don't want to sign in as a person? Hopefully you had a company email you were using with Google Places, use that same email for creating your +local social page. One of the benefits on the new platform that is being rolled out is that it will support multiple admins. The feature exists and can be viewed by going to Google+ and looking for the Pages tab on the left sidebar. Here is a screenshot: 37. If a company that serves multiple states wants to set up a Google+ page, should they set up a local business or a company/organization page? If you have multiple locations, you will need a local business page to link it to your map listing. Google is literally in the middle of rolling out dashboard features this week, and I am telling EVERYONE to not claim their +local page until we know what the new system will look like for multi-location businesses. So far, there seems to be a dashboard where you can view all of your locations at once, but no word exists on how a +brand page update might be reflected on your +local page. So, hold tight. 38. If I rank well in Google local results, would you suggest converting to G+ or waiting until they get things sorted out (dashboard/integration)? I loved my grandpa. He started Ramsey Heating Electric over 50 years ago and recently passed away. I lived with him through most of high school and he taught me the value of hard work. One thing that he constantly would say was this: \"If it ain't broke... don’t fix it.\" That is good advice, and I would adhere to it if I were you. Wait until the dust settles to upgrade. 39. How would you do local optimization for a business located inside another business? This is directly from Google Places Quality Guidelines: \"Some businesses may be located within a mall or a container store, which is a store that contains another business. If your business is within a container store or mall, and you'd like to include this information in your listing, specify the container store in parentheses in the business name field. For example, Starbucks (inside Safeway).\" 40. If you could give one piece of advice when it comes to your Google+ Local Page, what would it be? Diversify. Don't rely on Google+ local for all your business. Your listing will have issues, it wont always rank, reviews will disappear, bad things will happen. If your local strategy is simply \"get my listing to rank,\" you will fail. I know that is harsh, but I am tired of taking phone calls from businesses who are \"on the verge of closing because they rely on Google for 90% of their business and their listing disappeared last week.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "40 Important Local Search Questions Answered"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "40 Important Local Search Questions Answered"
    },
    {
      "level": "H2",
      "text": "Local Strategy and Tactics"
    },
    {
      "level": "H2",
      "text": "Reviews"
    },
    {
      "level": "H2",
      "text": "Citations/Directories"
    },
    {
      "level": "H2",
      "text": "Links"
    },
    {
      "level": "H2",
      "text": "Onsite Optimization"
    },
    {
      "level": "H2",
      "text": "Google+ Local"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Ramsey\n          \n            Mike Ramsey\n          \n            Mike Ramsey"
}