{
  "url": "https://moz.com/blog/5-actionable-analytics-reports-for-internal-site-search",
  "slug": "5-actionable-analytics-reports-for-internal-site-search",
  "title": "5 Actionable Analytics Reports for Internal Site Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By mining your internal site search data, you can likely uncover some nuggets that'll greatly improve your website's user experience and conversions.",
  "content": "5 Actionable Analytics Reports for Internal Site Search Content Marketing | SEO Analytics | Advanced SEO By: Ryan Stewart July 1, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ryan Stewart July 1, 2015 5 Actionable Analytics Reports for Internal Site Search Content Marketing | SEO Analytics | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was furious when keyword data disappeared from Google Analytics (GA). I mean, how could I possibly optimize a website without keyword data?!?! It didn't take me long to realize I was overreacting. In fact, I quickly realized how trivial keyword data was. Search engines are pretty damn good at what they do. If you properly optimize your content, people will find it with the keywords you intended. (You should set up an SEO dashboard in GA to verify your results.) The truly valuable keywords are the ones visitors use within your site. When mined correctly, internal terms uncover how and why users engage with content. These insights provide clear direction to improve content, SEO, and the user journey (resulting in increased conversions, leads, and sales). In this post, I'll cover three things: How to set up internal search reporting in GA How to access and analyze five internal search reports in GA Two client case studies using internal search data Prepping your analytics account Before I get into the details, make sure you have the following set up in your GA account: Exclude internal traffic (filter). You wouldn’t believe how many organizations don’t do this. This simple filter makes all the difference when it comes to data quality. Make sure your website is excluding all internal traffic (step-by-step directions: how to set up internal filters in GA.) Goals, events and conversions. In order to discover user intent, we need to be able to segment reports by conversions. Make sure that your website has clearly defined key performance indicators (KPIs) that are represented by goals in GA (step by step directions: how to set up goals in GA.) Supplemental reading: How to set up Google Analytics on your website Setting up GA site search reporting Standard GA implementation doesn’t have internal search reporting configured. In order to get the data, we need to input some information into GA manually. Follow these steps to get it up and running: Navigate to the “Admin” tab Click “View Settings” Go to the bottom, where you’ll find “Site Search Settings” Click the button so that its setting is “On” In order to complete the tracking, you’ll need to locate your site’s query parameter. In a new browser tab, open your website In your website's internal search bar, type the word \"seo\" and click \"search\" You will be redirected to your website's internal search landing page Look at the URL on the landing page (see screenshot below) You will see your search term, along with these characters: \"?\", \"random letter\", and \"=\" The letter before the equal sign (\"=\") is your website’s query parameter Enter this value into the appropriate box in GA Click save EXAMPLE Search query: seoLanding URL: http://webris.org/?s=seo Parameter : ?s=seoWhat to enter in GA: s GA will not post-date searches. In other words, searches that took place before you set up reporting won't populate. You will only get data from searches occur going forward.For this reason, you'll need to wait about 30 days after setting up site search tracking in GA before analyzing the site search data. Otherwise, you won't have sufficient data to conduct meaningful analysis.Analyzing the site search data To access your site search data, navigate to Behavior > Behavior Flow > Site Search in GA. There are five reports under Site Search: Overview Usage Search Terms Pages Any/All Reports (Segments) Report #1: Overview How to get there: Behavior > Behavior Flow > Site Search > Overview What the report tells us: Lists the high-level metrics related to your site’s internal search Potential insights: Visits With Site Search, % Search Exits, and % Search Refinements: When looked at together, these metrics can tell you a lot about how visitors are finding content. If all three numbers are high, it likely means users can’t find what they‘re looking for. Time after Search and Average Search Depth: Conversely, if these two metrics are high, it probably means users find a lot of value in your site search. Overview (graph): Pay close attention to spikes and surges in internal searches. Were you running campaigns during this time? Use traffic segments to dig into causation. Report #2: Usage How to get there: Behavior > Behavior Flow > Site Search > Usage What the report tells us: User journeys that used site search vs. those who didn’t Potential insights: Pages/Session, Average Session Duration: If the pages viewed and session duration is higher with visitors using site search, this indicates your website has the right content (i.e., users are finding the content they are searching for). Keep a close eye on these metrics and test widgets, sidebars and \"suggested article\" plugins to help you figure out how to improve navigation. Goal Completions: These are important metrics. Plain and simple, this tells us whether or not site search helps drive goal completions. If so, you may want to consider making your site search more prominent, or make it stand out with specific calls to action. Secondary dimension: You can add a number of dimensions to this report to get deeper insight. I like to add \"Medium\"—it gives you a breakdown of each traffic medium, segmented by Visits With Site Search and Visits Without Site Search. Report #3: Search terms How to get there: Behavior > Behavior Flow > Site Search > Search Terms What the report tells us: Lists the most used search terms with corresponding engagement metrics Potential Insight : Look at each engagement metric for discrepancies between search terms. If one search term has an abnormally high % Search Exits or % of Search Refinements, then you most likely don’t have content those visitors are looking for. Look at the complete list of terms—are these included in your PPC and SEO keyword targeting strategies? If not, they should be. These are the terms your visitors expect to see on your site. Add traffic channel segments to see which channel drives the most internal searches. These terms should match up with your PPC and SEO strategies. If a visitor is using site search to refine what they’re looking for, it could mean that they didn’t find your site from the right landing page. Report #4: Pages How to get there: Behavior > Behavior Flow > Site Search > Pages What the report tells us: The pages users made their queries on Potential insights: Overall: Looking at the overall picture of the data will show you where users are having problems finding content. Take a closer look at how your top pages are structured—can users find what they need? Secondary dimension: I like to layer on the “Previous Page Path” dimension. This helps create a greater context for the problems users are have navigating your site. Report #5: Segments How to get there: Behavior > Behavior Flow > Site Search > Any/All Reports What the report tells us: Segments add additional depth and value. I often use the following segments to drive more insights:Mobile traffic: Segmenting by mobile allows you to see visitors are using site search more from mobile. This can yield insights into mobile design and layout. Converters or Made a purchase: Is site search driving conversions or adding roadblocks? Organic traffic: What percentage of users that find your website through search engines need to refine their searches? The internal keyword searches are the keywords that users are really looking for when they find your site. Returning users: Returning users are loyal—they enjoy your content enough to return for more. Use the internal search data to find out what content you need to best serve them. Case Studies: Driving action from internal search The internal site search reports described above are high-level. Sometimes it takes seeing them in action to understand how to truly apply them. As such, I've included two case studies that show exactly how I've used internal search data to drive meaningful action. Case study #1Site: Pop culture publisher (online only)Marketing channels: SEO, social, and content Problem: The site drives traffic from five to eight daily blog updates about niche pop culture celebrities In November, traffic stagnated, and then started to decline Research: The site thrives by creating content about niche celebrities, the ones few other sites write about. This gave them the monopoly on both the SERPs and avid social media fans Digging in further, I found social traffic was steadily declining, while organic was remaining nearly the same, month-over-month A full-scale content analysis was completed, finding that more and more content was being created about the same niche celebrities. This was causing diminishing returns on social and organic traffic. The site suffered from content exhaustion: Writers were covering the same topics over and over. In order to build traffic, they needed to scale efforts horizontally by creating content around new niche celebrities. Solution: I consulted the Search Terms report (Behavior > Behavior Flow > Site Search > Search Terms) to see what visitors were looking for on the site By adding a filter for \"no-results\", I could see what content visitors were searching for on the site that turned up no results I dumped this list into Excel, and had the writers create new content based on the search terms in the report Results: After launch of the strategy, the site saw amazing results: 201.05% increase in month-over-month traffic 210.99% increase in month-over-month pageviews 3.30% increase in pages per session 3.15% increase in session duration 4.75% decrease in bounce rate Up and to the right! Case study #2 Site: Online travel siteMarketing channels: SEO, PPC, email, social, content, display, TV, radio, and print Problem: Large spike in month-over-month internal searches on client's site, with poor metrics for actions following internal searches Both the search volume and search rate had nearly doubled (35,457 to 65,032; and 4.37% to 8.56%, respectively) month-over-month Research: Digging in, I found traffic on-site increased by 40,000 month-over-month; when segmented, I found the increase was strictly organic traffic Consulted GA Landing Pages report with Organic Segment to find which pages the increase in traffic was going to (Behavior > Site Content > Landing Pages > Organic Segment) This showed that 100% of the increase in month-over-month traffic went to the home page This was out of the ordinary, as 80% of organic traffic generally goes deep into the site, not to the home page Next, I consulted the Google Webmaster Tools (GWT, recently rebranded as Google Search Console) Search Analytics report to see what keywords were driving the increase (GWT > Search Traffic > Search Analytics) GWT analysis showed the increase came from queries consisting of branded keywords + \"giveaway\" (e.g., client giveaway promotion and client giveaway) Solution: I reported the findings to the client, and found out they'd been running a series of offline ads promoting a giveaway in attempts to generate email leads Note: Large organizations often have employees, agencies, contractors, and consultants running for multiple efforts. It's not uncommon for efforts to operate in silos. The giveaway was set up on a landing page that was difficult to find unless typed in directly (e.g., clientsite.com/giveaway) I recommended that the client include a call-to-action on the home page that linked to the giveaway Results: Sessions with search decreased by nearly 10% Results after search increased by 6.45% Search depth increased by 9.01% Most importantly, users were able to find the giveaway. Email leads increased by 245%! ClosingWhen mined properly, internal search data will give you the information you need to greatly improve your web content, design, and search engine optimization efforts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Actionable Analytics Reports for Internal Site Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Actionable Analytics Reports for Internal Site Search"
    },
    {
      "level": "H2",
      "text": "Prepping your analytics account"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Setting up GA site search reporting"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Analyzing the site search data"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Report #1: Overview"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Report #2: Usage"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Report #3: Search terms"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Report #4: Pages"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Report #5: Segments"
    },
    {
      "level": "H2",
      "text": "Case Studies: Driving action from internal search"
    },
    {
      "level": "H3",
      "text": "Case study #1"
    },
    {
      "level": "H3",
      "text": "Case study #2"
    },
    {
      "level": "H2",
      "text": "Closing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan Stewart\n          \n            Ryan Stewart\n          \n            Ryan Stewart"
}