{
  "url": "https://moz.com/blog/5-actionable-metrics-to-track-on-your-marketing-dashboard",
  "slug": "5-actionable-metrics-to-track-on-your-marketing-dashboard",
  "title": "5 Actionable Metrics To Track On Your Marketing Dashboard - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The problem with Analytics is that there is too much data and most people don’t even know how to get started. Staring blankly at your visitor count may be interesting, but it’s not much use unless you can actually take action on it. One great way to reduce your procrastination and ensure that you…",
  "content": "5 Actionable Metrics To Track On Your Marketing Dashboard SEO Analytics By: Clive Patterson November 6, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Clive Patterson November 6, 2013 5 Actionable Metrics To Track On Your Marketing Dashboard SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Pretty much every business uses Analytics these days, and if you don’t you certainly need to, so go and get it set up right now and then come back! Ready? Ok let’s get started then shall we? The problem with Analytics is that there is too much data and most people don’t even know how to get started. Staring blankly at your visitor count may be interesting, but it’s not much use unless you can actually take action on it. One great way to reduce your procrastination and ensure that you actually use Analytics effectively is to set up a marketing dashboard. Side Note – What’s A Dashboard? There are a few different ways to set up a dashboard, one option is to use Excel or even code it yourself if you know a bit of HTML & PHP, but for those who like an easy life there are various online platforms that allow you to set up a dashboard without having to worry about API integration and such like. A dashboard is a great way to get a quick glance at your most important metrics without getting buried under a pile of TMI – because let’s face it, who has time to trawl through Analytics every morning? But to make the best use of your time you need to know which metrics actually matter, how to track them and what to actually do with that information. Here are a few guidelines then! Browser Types Designing a website will always be a compromise because having an all singing all dancing site that does too much might put off some users or even make your site hard to use. So it can be helpful to get an insight into who your users are and what technology they use. Analytics gives you a whole range of user data to consider. This data isn’t always helpful, but looking at it before a site redesign is a good idea. Example: How many of your users are on mobile devices? If it is a lot, you will have more incentive to make your website mobile responsive. If a lot of your users have relatively small screens you shouldn’t make your design too wide either. You can’t please everyone, but try to design for your biggest visitor segments. Why on a dashboard? This matters most when you are undergoing a rebuild of your site, but these metrics can change over time too, so it is worth including a spot on your dash to track any trends. If you see a steady rise in the number of mobile users, you can use that to prepare for future redesigns. Bounce Rates If a user arrives at your site and then leaves without taking further action, that is a bounce, and it’s generally considered a bad thing. The lower your bounce rates the better. Of course, actual bounce rates depend on your site and your niche; there is no ‘good’ bounce rate to aim for. But you can use this information to compare areas of your site, or track overall performance. There are a few ways to use it. Example: If you write a blog and you notice that one blog post has a higher bounce rate than other posts, try to re-work and improve that post. You can also use bounce rate to compare the quality of different traffic sources (hint: spend more time on the higher quality sources of traffic). Why on a dashboard? This is another metric that can change over time. Hopefully you will see it improving over time but if you see it gradually or suddenly get worse, you need to look into that. It is a good idea to display it as a line graph so that you can visualize trends. If your bounce rate goes down, check your traffic sources – has one source dropped or increased? If your marketing has resulted in a higher volume of lower quality traffic you may want to reconsider how you are spending your marketing efforts. If nothing obvious has changed, a higher bounce rate could mean that your content is becoming less relevant, in this case you should prepare for the possibility of your rankings dropping too – consider doing some research around your main key phrases and update your content if necessary. Exit Rates You can look at all of the pages on your site and sort them by Exit rate, this lets you see at a glance which pages of your site are responsible for most of your ‘exits’ – people leaving your site. Try to avoid making judgements on low volume pages. You can filter your results so that you only see your top most popular pages and then sort by exit rate to see which of your popular pages are losing you traffic. Example: You might find that one of your category pages is losing you more visitors that other categories. This could indicate that when visitors arrive on that category they are not finding what they are looking for. This could be a sign that you have a poor product selection or that you need to add more products to that category. Why on a dashboard? Again, exit rates are similar to bounce rates in that you can track how they change over time. Hopefully you will constantly be trying to improve your critical pages, so you might expect to see a decrease in overall exit rates. One good practice for ecommerce sites is to have a dashboard widget showing exit rates on your checkout pages – you can even split them by traffic source – so that if there is a sudden increase in exits you can remedy any problems quickly before they hurt your sales too much. Traffic Sources If you review your Analytics one day and find that your traffic has spiked, whilst that is great news, what can you actually do about it? Well looking at your traffic sources is a good start. You can narrow your date range down to when the traffic spike happened and then look at traffic sources to find out where the traffic came from. Example: If a big site linked to you, find them and thank them, and try to get more links from similar sites in the future. If the traffic came from a big user Re-Tweeting you, try to engage them in conversation or figure out what you did right and do it again. Why on a dashboard? Most people will have some sort of widget to show overall traffic on their dashboard, but if your traffic from one source increases as traffic from another source decreases, you might never notice. Having a chart showing different traffic sources can make it much easier to spot any changes. One good idea; is to have a line chart showing total traffic as well as traffic from key sources directly above or below a chart showing bounce rates and exit rates. You might well notice that certain changes in traffic impact the quality of your customers and hence your conversion rates. Conversions Tracking your conversions is important, but not many users even know how to do it. Start by setting up goals in Analytics and assigning a value to each type of conversion if you can. Conversion tracking has the potential to supersede many other types of tracking because if a traffic source converts into revenue that might be all that matters. And if a traffic source is not converting you need to figure out why. Example: You might find that a source of traffic produces a low bounce rate and a high time on site, but a poor conversion rate. In other words, your visitors find your site helpful, but they are not buying anything. You may need to ask yourself whether the product you are offering is relevant to your target audience. Why on a dashboard? Hopefully it’s pretty obvious why you would want to track your conversion rates. Again, it is a great idea to show these on a chart below your general traffic stats because you might notice important patterns that otherwise you might not have considered – what if your Twitter traffic spikes and then a week later your conversion rate spikes? As a marketer, it is your job to notice these trends and investigate whether there could be a link. Remember that not all changes will have an immediate impact on traffic or conversions, so being able to visualize the data side-by-side matters. Of course, conversion rates often correlate strongly to bounce and exit rates, so having that data side by side may be helpful for diagnostic purposes too. Until you see and understand the patterns, you just don’t know! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Actionable Metrics To Track On Your Marketing Dashboard"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Actionable Metrics To Track On Your Marketing Dashboard"
    },
    {
      "level": "H2",
      "text": "Browser Types"
    },
    {
      "level": "H2",
      "text": "Bounce Rates"
    },
    {
      "level": "H2",
      "text": "Traffic Sources"
    },
    {
      "level": "H3",
      "text": "Conversions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Clive Patterson\n          \n            Clive Patterson\n          \n            Clive Patterson"
}