{
  "url": "https://moz.com/blog/5-bloggers-from-sphinn-and-youmoz-that-you-must-rss",
  "slug": "5-bloggers-from-sphinn-and-youmoz-that-you-must-rss",
  "title": "5 Bloggers From Sphinn and YOUmoz That You MUST RSS - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Youmoz and Sphinn are some of the best social networking communities in search marketing today. From participating in these two communities and reading a lot, I've discovered a few excellent bloggers. All of you who want to succeed at search marketing need to add their blogs to your feed readers.…",
  "content": "5 Bloggers From Sphinn and YOUmoz That You MUST RSS Content Marketing By: Gabriel Goldenberg November 27, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg November 27, 2007 5 Bloggers From Sphinn and YOUmoz That You MUST RSS Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. YOUmoz and Sphinn are some of the best social networking communities in search marketing today. From participating in these two communities and reading a lot, I've discovered a few excellent bloggers. All of you who want to succeed at search marketing need to add their blogs to your feed readers. The bloggers are, in no particular order, Hamlet Batista, Maki aka Dosh Doh, Igor Mordkovich, Ciaran, and Will Critchlow. Hamlet Batista - Hamlet is a Dominican search marketer with many years' experience in the field, including some in the hyper-competitive world of Viagra. Someone else had recommended him in the comments of a post here on YOUmoz (edit: looks like the comment was on a post of mine, heh :D), but at the time I thought it was just a big fuss over nothing. Turns out he's full of these intelligent comments, not to mention some seriously powerful tactics and mathematics. Consider his simple, easy-to-follow method for testing viral marketing ideas. Got a piece of linkbait? Put it through there and you should be able to immediately improve it! How about this downright gorgeous tactic for keyword research? Without a doubt, it's the best I've ever seen, and I am the bookworm-SEO after all. It was so hard for me to even share that link, but it's only fair, imho, since Hamlet is sharing it. So, enough procrastination: Subscribe to Hamlet's RSS feed. Great blogger, that Hamlet Batista! Maki aka DoshDosh - I discovered Maki through Sphinn, by seeing his anime icon plastered all over Sphinn's front page. (Here's a hint: if you want something to work on Sphinn, get Maki to submit it!) I've been blogging for nearly two years now (this December), and Maki is the first person I've seen to give a coherent explanation for why commenting and linking out matter. Sure, I'd read about commenting on other blogs. But until I got myself involved here on YOUmoz it was meaningless to me. My networking was done by email and focused on SEO (hey, at least Marketing Sherpa thought I had something worthwhile to say on networking [PDF]). Turns out comments and linking are a lot more productive! He shares another beauty in his post, The Secret to Building a Popular Blog. He's a great writer, so I'll just quote him: \"If you want to build a large readership or be regarded as an authority on any topic, you need to develop a core group of supporters. This is important because these people allow your content to spiral outwards beyond your existing readership.\" Maki is, imho, the #1 social media marketer on the web. Consider these stats: he routinely gets 50 - 70 comments on his posts. He's sold 4/6 125x125 ad blocks in his inventory, for what I'm sure is good money (yet to request a rate card). From his advertising page: More than 200,000 pageviews a month Among the Top 100 biggest blogs in the world (According to Technorati) Top 10 on the Technorati Most Favorited Blog List Alexa Rank of 7,477 (as of 15th July, 2007) 6,000+ RSS Feed subscribers But the real kicker is this statistic: Dosh Dosh as a blog is only 6 months old! Right, so go get fed Maki's RSS words of wisdom. Dosh Dosh is awesome. Igor Mordkovich - There's so much I could say about Igor, but I think the first is that the fellow is one of the most underappreciated bloggers around - and there are plenty not getting their fair share of attention, in my humble opinion. For one thing, the man is what we call in French un polymath (I don't know how that translates). Here he is talking about email newsletter marketing, then he's got a piece on combining offline marketing with online marketing, there's a list of 12 places to promote yourself locally...the man can do it all! Another point that I like about Igor's blog is the template/theme. I think that your blog template is probably one of the single greatest contributors to success or failure, and I think very highly of at least two of Igor's design items (his blog's still new to me; I'm sure there are other smart design points, too). He's got his call-to-action and lead generation form right on the homepage, above the fold. I'll be damned if that doesn't convert well. In developing my site over the summer I opted for a similar thing, though in truth I got the idea from SEO Inc (who also have their call-to-action better positioned for conversion, where heatmap studies and Adsense pros are concerned). There's a featured section at the top of his blog where he shows off his best material with more space and ahead of other blog content. Not all blog content is worthy of top attention, yet with chronological formats, that's what happened. Igor's got a workaround. On the other hand, I'm not a fan of Igor's branding. For one thing, it's questionable what his brand colours are - you need to actually look for them. For another, the favicon is cheap-looking and belies the great quality of his site. Contrast that with SEO Inc, who have the orange and grey theme constant. There was a search firm with a little green nut icon that was repeated throughout their site's subheaders - yet more great branding. But the brown and red isn't obvious or repetitive enough at BizMord. That small critique aside, I encourage everyone to subscribe to Igor's feed! Ciarán Norris - Ciarán is the SEO and social media dude at internet marketing agency Altogether Digital. This \"married 30-something English man,\" as he describes himself, is another very astute social media marketer. I, for one, greatly enjoyed what he shared with us regarding his viral marketing presentation at SMX London. It was informative, it taught me something new (as opposed to only repeating the \"write about Apple and/or make it funny because Diggers are young white males...\" tip, which has been done to death), and it was well-written to boot! He follows this up with a well-written post on how he and his agency blogged and got in the news. The post discusses how he piggy-backed on a story involving social media site Bebo's OpenMedia project. Unfortunately, the mainstream media didn't credit his site (the mainstream media messing up comes as a shock to you all, I'm sure). Finally, for those of you that still think Yahoo matters, he's got a piece on Yahoo's new search results that bears closer examination. Interestingly, the golden triangle heatmap may be done in with these new results, though I think it will remain true for non-search/directory sites. Might I recommend the AD RSS feed? It's the only moblog in the group and well worth it for the larger view of marketing it presents that many of us in search don't always get. (I'd have the RSS above the fold, by the way, guys, unless the action you're most concerned about is people clicking your tags.) Will Critchlow - Will's a top 10 YOUmozzer that I've frequently noticed commenting here. While his Reputation Monitor service is an indirect competitor (I'm offering search engine reputation management; see this guest-post guide to SERM, for starters), I think he and Distilled are doing such a great job he deserves the keyword rich anchor and link. Besides, I don't think one link will make a difference to whether I succeed - big enough pie for both of us, imho. So, on to Will's blog. One post I particularly enjoyed and commend him for taking the initiative on was breaking the first interview with Hamlet Batista. There are many more to come, I'm sure (Hamlet, consider this a request). While some of the probability maths were over my head --I only did one linear algebra class and one research methods class, both over a year and a half ago--this post on when to quit your PPC is original. Plus, I really like the handy table relating your standard conversion rate to the number of clicks you need before you can tell whether the campaign is a winner or not. Still on the topic of PPC and confirming something I'd read in other places, Will shares with us some info on MSN converting better than Google. Ok, so the info comes from MSN. Still, it's an interesting look at the travel trade. (By the way, Will, do you have much experience in travel? My dad organizes dental continuing education conferences on cruise ships and I'd like to help him out...any advice would be great.) The rest of the post gets past the fluff and shares some excellent tips on organizing adCenter campaigns including some top info on demographics. (Aside @ readers: Do you think Microsoft's recent purchase of a stake in Facebook is a prelude to them gaining demographic info for adCenter? The Hotmail demographics were ridiculed for being inaccurate, but Facebook... almost everyone I know shares their real interests/persona on that site.) As I mentioned above... Will's a top 10 YOUmozzer - but I'm coming for him :p! Kwyjibo, Mystery Guest, and Hamlet just bit my dust :D. If you've got any interest in reputation monitoring or PPC, I highly recommend you subscribe to Will/Distilled's RSS feed. There are plenty of other names I should mention, but if I take any longer to write this I may just go nuts. So, without disrespect, I'm just going to link to the following folks' blogs and suggest you check out what they're doing. Sean Maguire aka Seanmag - Mr. Value-added comments himself is brains behind 360 Sell, a Sales and Marketing Consulting group. There's no blog, though he has posted here at YOUmoz. I'm looking forward to some regular contributions, Sean! A power blog-networker if ever there was one. Vin Goldsmith aka Vingold - You gotta love the comments. Right up there with Sean's! He writes about \"something you likely don't care about\" (paraphrasing him), unless you think he's a cool dude (like I do), not to mention a great person to have in your network. @ Rebecca: Personal blogs are awesome - research for linkbait is 10 times easier! Tom Critchlow aka Tom_C - Will's brother's another great YOUmozzer. Solid comments and solid posts. More points for Distilled. Kimber - She's less noticeable, but I find her comments concise and incisive. Tough to be appreciated when your comments aren't long, attention grabbing items (cough Seanstyle cough :) ), but she does it well. It just so happens she's an Adwords qualified pro and works at the big 'ol of Masterlink (do you guys do linkbait? ;) ). Both eCopt (i.e. eCommerce Optimization)and Rishil deserve props too. Rishil, I can't wait to see that post on your brand keywords! Also, special mention to Michael Dorausch, a solid networker and chiropractor who Sphinns a lot, and Floppy aka Mack Hankins. Rishil, I can't wait to see that post on your brand keywords! There you have it - some great YOUmozzers and Sphinners who deserve your attention! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Bloggers From Sphinn and YOUmoz That You MUST RSS"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Bloggers From Sphinn and YOUmoz That You MUST RSS"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}