{
  "url": "https://moz.com/blog/5-content-marketing-tips-for-healthcare",
  "slug": "5-content-marketing-tips-for-healthcare",
  "title": "5 Content Marketing Tips for Healthcare Brands - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Privacy concerns shouldn't keep your healthcare company from diving into content marketing. The benefits far outweigh any potential pitfalls.",
  "content": "5 Content Marketing Tips for Healthcare Brands Content Marketing | Marketing Industry By: Pyxl Marketing September 3, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pyxl Marketing September 3, 2015 5 Content Marketing Tips for Healthcare Brands Content Marketing | Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Creating and promoting content that gives life to your healthcare organization can be difficult due to the stringent compliance requirements that HIPAA (the Health Insurance Portability and Accountability Act) and other regulations impose. Across other industries, it is common to see customer testimonials, reviews and case studies featured in marketing materials. Additionally, other industries can market to a variety of different people, across many different platforms. However, protection of patient data and identity can prevent healthcare organizations from doing the same.So, are you wondering where to begin when writing and promoting content that doesn’t violate compliance laws? Luckily, there is a variety of content you can create, as well as marketing activities you can execute that will allow you to comply with all necessary regulations while still getting your organization’s name out there. We’ve gathered five tips you can follow to do just that.1. Tell your storyNo matter what your organization does—whether you’re a large hospital network, smaller medical office, medical device manufacturer, or insurance company—conveying your story and purpose to your potential patients or customers can go a long way.Why was your organization founded? Who are you as a group? As individuals? What are your values? How do you help people? Answering these questions is a good place to start. Additionally, inspire confidence and trust in your patients and/or customers by sharing how you keep their information secure. Showing that your organization is unique and will also protect confidential information is a great way to draw in potential patients and customers. It ultimately gives them a reason to choose you over your competition. 2. Humanize your organizationGiving your organization a “face” (i.e., a more human feel) can make it more attractive to potential patients and customers. From the outside, you want to be viewed as a personable group of people whose main goal is to help others, not as a giant corporation that only cares about getting patients in the door to increase revenue and profit.Showing that there are real faces and personalities behind your organization can be done in a variety of ways. Think about your digital presence. Does your website feature pictures or videos of your employees, nurses, or doctors? If not, showing visuals of the folks on staff is a good place to start. Let’s say your organization is a large hospital that specializes in cardiovascular care. On the page of your website that discusses the cardiovascular unit, feature a short video that introduces one of the head physicians, during which he or she talks about the high-quality care patients receive, and the success they’ve had with various procedures they’ve performed.3. Answer common questionsConduct research to gain insight into questions frequently asked by your potential patients and customers. Learning what questions or concerns your potential audience has can help drive your content creation, which will allow you to consistently serve up relevant, educational, and helpful content that your audience wants to see. For example, if your medical office specializes in dermatology, your potential patients are likely searching for things like “How to get rid of acne?” and “What does skin cancer look like?” on Google and other search engines. Consider creating content—such as blog posts, short eBooks, and checklists—that addresses questions like these. This can also help your organic search ranking, which in turn will help your office get found. (Did you know 77 percent of people looking for health information on the Internet began their last session on a search engine?) You could title a blog post “How to Get Rid of Acne” and give six at-home tips to try, while inserting a call-to-action (CTA) at the end of the blog post. Similarly, you could create a checklist titled “What Does Skin Cancer Look Like?” with associated pictures and descriptions, urging potential patients via a CTA to schedule an appointment for a checkup if they noticing something unusual on their skin.4. Develop a presence on social mediaDid you know 41 percent of patients say social media would affect their choice of a specific doctor, hospital, or medical facility? If you’re not active on social media, you’re missing out on interacting frequently with a large portion of your audience. Social platforms such as Facebook, Twitter, LinkedIn, and YouTube give your organization the opportunity to publish content daily. Doing so can drive awareness for your organization and keep it top of mind with your potential patients and customers. Don’t forget to share a variety of content, including helpful tips and news from within your industry, as well as content your organization has created.Additionally, maintaining an active presence on social media will allow you to see what your audience is saying about your brand. Maybe they’re posting questions for you? If so, make sure you’re answering them. Maybe they’re posting complaints about your emergency room’s wait time? Address the issues head-on. As you develop your presence on social media, your patients may be posting on your wall, tweeting at you or sharing your posts with their friends. Ensure your social media activity complies with all HIPAA regulations and that the information you post doesn’t share confidential patient information.5. Keep mobile in mindThe number of people who own a mobile device and use it to access the Internet continues to increase. In fact, Americans spend 60 percent of their digital media time using their mobile devices (smartphones and tablets.) You might be thinking that this group is a younger bunch; but, interestingly enough, 74 percent of Internet users ages 55+ now use mobile devices, too.First thing’s first: Is your website mobile-friendly? If not, this should be the first improvement you tackle. Due to Google’s new algorithm update, websites that aren’t responsive are now penalized in organic search results. Responsive website design (RWD) provides an optimal experience for users viewing and interacting with the site across a variety of devices—from desktop and laptop computers—to smartphones and tablets. Responsive displays a website's navigation and content in an easily read and consumed fashion, and eliminates the need for the user to resize, rotate, pinch, zoom, and scroll for ages to get the full experience the website should provide. Second, think about how your website’s content is displayed on mobile. With less space than on desktop, it’s crucial to make sure your most important content is easily found. Is your organization an urgent care center or emergency clinic? Your phone number (or nurse’s hotline) and location should be visible in a prominent place on the page. Additionally, think about long chunks of content that might be present across your site, such as on your blog. Consider creating a mobile-friendly format that shows a list of recent blog posts, short snippets of each, and a link to \"Read more.\" When it comes to mobile, the less scrolling, the better.Content marketing can be intimidating, but it doesn’t have to be. You may not be able to use customer testimonials or stories in your marketing efforts; however, there are many other ways to tell the story of your healthcare organization. Armed with these five tips, you can start better communicating your brand in the highly regulated and competitive healthcare industry. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Content Marketing Tips for Healthcare Brands"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Content Marketing Tips for Healthcare Brands"
    },
    {
      "level": "H2",
      "text": "1. Tell your story"
    },
    {
      "level": "H2",
      "text": "2. Humanize your organization"
    },
    {
      "level": "H2",
      "text": "3. Answer common questions"
    },
    {
      "level": "H2",
      "text": "4. Develop a presence on social media"
    },
    {
      "level": "H2",
      "text": "5. Keep mobile in mind"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pyxl Marketing\n          \n            Pyxl Marketing"
}