{
  "url": "https://moz.com/blog/5-creative-ecommerce-processes-worth-imitating",
  "slug": "5-creative-ecommerce-processes-worth-imitating",
  "title": "5 Creative E-Commerce Processes Worth Imitating - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been watching Mystery Guest shop online a bit over the weekend (while drinking beer and observing manly NFL games) and I was surprised to see so many \"web 2.0\" features on the e-commerce sites she browsed. More interesting still were how the numerous breaks from convention appeared to enhance,…",
  "content": "5 Creative E-Commerce Processes Worth Imitating Design By: Rand Fishkin October 9, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 9, 2006 5 Creative E-Commerce Processes Worth Imitating Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been watching Mystery Guest shop online a bit over the weekend (while drinking beer and observing manly NFL games) and I was surprised to see so many \"web 2.0\" features on the e-commerce sites she browsed. More interesting still were how the numerous breaks from convention appeared to enhance, rather than detract, from the buying experience. Traditionally, I think of convention as the star of conversion rate success, and while I'm not suggesting we throw that practice out the window, I think there are some new trends worth experimenting with. The AJAX Overlay Gap.com's overlay of a product detail The clever part about Gap's (and Banana Republic's) overlay of a product detail page is that it allows users to browse more deeply into the catalog of products while remaining less committed than a full page change. This fits flawlessly with the model e-commerce should provide - an unobtrusive, in-depth look that gives the user complete control. You can get more details, see sizes and even \"add to cart\" right from the overlay. The Color Selector 'Etsy.com's Color Picker Shopping by color might seem a tad unneccessary to your average tech geek, but based on my small sample size, it appears to be a big hit with young women. Mystery Guest also loves the color selector at Michael Star's website, which lets you choose a color, then see all of the styles available in that hue. The appeal here is flexibility; the shopper can choose to browse by more than just a single categorical structure. This feature means that shoppers who organize their wardrobes or purchases by alternative taxonomies need not be locked into a single method of selection. The Customizable Product Puma.com's Mongolian Shoe BBQ I personally found Puma's example to be challenging to use, despite the clever concept. The idea, however, relies on the long tail of e-commerce, combined with the reliable psychological desire of humans to feel special and unique. Admittedly, despite the tough UI, I'm considering designing my own custom SEOmoz Pumas. Several sites go even further with this concept, allowing users to not only create, but share their products (the most well-known of these is Metacafe). If you've ever wanted an army of creative, passionate customers doing all the work of designing, marketing and selling for you, this is your chance. The Product Blog Flypaper - Bluefly's Product Blog If others can blog about your products, why not jump into the fray yourself. Several companies have had successful product blogs, but Bluefly's makes for a perfect example. It's not always centered around the product offerings and it offers fashionista readers a taste of the haute couture world. The real value here is only achieved when you can blog about your products in a way that doesn't make you sound like a shill - a tough task. Oftentimes, the key to winning them over is to find a blogger who's got the passion and blogging chops to make for an entertaining, engaging read. The product blog can extend to podcasts and videocasting, too, as illustrated by another of Mystery Guest's frequent online pitstops, FredFlare. The Embedded Testimonial PixelGirlShop's In-Depth Testimonials While it's the least \"web 2.0\" of the features, I've seen only a few online shops craete the detailed testimonials you can find at PixelGirlShop. There's two impressive elements at work here. First, the testimonials have real people, with real passion for the products - a visitor can actually see the level of commitment in the photos. Second, the descriptions ingenuously blend the products into the description using links. I won't go so far as to suggest that every one of these techniques is right for every e-commerce site on the web, but I would suggest that those of you who build and run stores throw some analytics onto your projects and start testing. Perhaps convention and creativity can co-exist harmoniously (and help make the web a better place to buy). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Creative E-Commerce Processes Worth Imitating"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Creative E-Commerce Processes Worth Imitating"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}