{
  "url": "https://moz.com/blog/5-fashion-hacks-for-the-modern-male-marketer-whiteboard-friday#comment-291591",
  "slug": "5-fashion-hacks-for-the-modern-male-marketer-whiteboard-friday",
  "title": "5 Fashion Hacks for the Modern Male Marketer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the holiday weekend, we take a break from all things online to focus on a different kind of marketing altogether. Rand shows us a few essential pieces of male fashion knowledge that'll make the gentlemen in our audience stand out from the crowd.",
  "content": "5 Fashion Hacks for the Modern Male Marketer Whiteboard Friday By: Rand Fishkin July 4, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 4, 2014 5 Fashion Hacks for the Modern Male Marketer Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Happy 4th of July! We're off observing our Independence Day, so we decided to celebrate with a non-SEO Whiteboard Friday. From the undeniable class of a full windsor to the (all too common) mistake of letting our underwear become accidental outerwear, today's modern marketers are prone to some very easily solveable fashion faux-pas. On this Independence Day, we take a quick break from discussing the online world and bring you a whiteboard video on the lighter side. Enjoy! For reference, here's a still of this week's whiteboard! Video Transcription Rand: Howdy gang, and welcome to a very special Whiteboard video on men's fashion. Well, so it turns out of all things that, in addition to my deep, deep passion around search and social media and content marketing and all things inbound, I'm also particularly passionate about what guys wear. I hope that I can be helpful in upgrading some of the things that we all wear, because as an industry, occasionally I will go to a conference or an event or someone's office and see things that make me scratch my head and wonder whether women or men, who might be interested in these men, also scratch their head. Hence, for you today, I have five fashion hacks for the modern male marketer. The first one is don't let your underwear become accidental outerwear. So I'm obviously wearing underwear. I'm not going to show you, sorry, or maybe a good thing. But I'm also wearing underwear underneath this shirt, which you can see here. This is an undershirt. It's underwear. Now, it turns out that not all men are, let's say, cognizant or fantastic at hiding their underwear. Let me show you what I'm talking about. Ta-da! Look at this brand new undershirt that I am now wearing and which tragically is on display for the whole world to see because I'm wearing a button-up shirt, but I'm not, of course, going to button it all the way to the top. So you're seeing my underwear. Unintentionally my underwear has become outerwear. I just find this, well, not optimized, and as you know, I love optimization. Unintentionally, my underwear has become outerwear. I just find this, well, not optimized. Now let me show you. There is an actual exception to this underwear/outwear rule, and I've asked our head of Big Data, Martin York . . . Martin, would you join me here for a second? So Martin has very wisely, wonderfully worn a ring-collar shirt with a button up. But look, it's a T-shirt. It is not underwear. His underwear is not on display. His T-shirt is on display. This is a totally acceptable way to wear a ring-collar shirt with a button-up shirt and leave the button undone and show it off. No problem at all from a fashion standpoint. The problem is when you do what I'm doing here. Don't be like me. Wear a V-neck. Thanks Martin. Another fantastic thing about having an open collared shirt and wearing an undershirt, like a V-neck underneath it, is when I get home, I don't actually need to wash this. I can just put it right back on my hanger in my closet, and then I throw the undershirt in the wash. Undershirts are easy to wash. They're also very inexpensive. If something happens to the undershirt, no problem. It might get a little sweaty during the day, especially filming so many videos. My second point here, so a lot of times I talk to guys about shoes and footwear, because I'll compliment a guy on what he's wearing. I think it's really cool. I'm obviously deep into footwear, right? I have my yellow Pumas, and I have all sorts of other shoes, and my footwear is just something I'm very passionate about. I love when I get compliments about my shoes, and so I like getting new ones. But I've noticed that many gentlemen have a big challenge around this, which is breaking in those new shoes, and I completely get where you're coming from. So I'm wearing today a pair of new shoes. I just recently got these. I think I've worn them only once or twice before, and not even the whole day, and they're still breaking in, like they're not quite comfortable yet. A lot of guys I talk to say, \"Gosh, I hate when I buy new shoes, because I have to break them in. They take time. That's why I have only my old pair of shoes, or I only wear athletic shoes,\" or these kinds of things. That's sad, because there's a lot of cool things you can do with footwear. But there's a trick for breaking in shoes that makes it way more comfortable. It's totally stolen from hikers. Let me show you what I'm talking about. So watch. I'm not just wearing one pair of socks. I'm wearing two pairs of socks. So I've got this white sock underneath here, which it's a fine sock. No one's going to see it, because it's shorter than the shoe. But then I'm actually wearing a little slip on sock over it, and the reason is I'm breaking in these shoes. Wearing a second pair of socks over them, yeah it uses up an extra pair of socks, but man it's way more comfortable, very easy to break in new shoes. I wear this a couple of days, three days in a row, and this shoe will feel like an old worn pair, which is just awesome. Slides right over and slides right in. Now if I do it right, no one's the wiser. Number three on my list, it turns out that a lot of men's shirt makers these days are doing some really cool things with kind of fashion details and hidden fashion details. They don't have to be completely hidden. So one of my favorite things is when I buy a shirt, I look inside and I see, \"Wow that's really cool,\" they've got kind of an off color cuff, like the cuff is a different shade, and the inside of the shirt material is a different shade than the outside. I almost want to show that off in some way. But the only time you can do it is when you're putting on the shirt or taking off the shirt, unless you roll up your sleeves in a very clever way. Let me show you what I'm talking about. All right. Now depending on how OCD you want to be, you can make it look even better than I have here in this short amount of time with no mirror. But you can see what's happened is I've taken the cuff, rolled it up, so that now the exterior of the cuff is actually inside, and the interior is shown off, at least the top of it is shown off. I love that sort of mismatched, interior exposer, showing off the detail of the shirt. It's just a fun way. The other thing I love about this is, unlike traditional ways of rolling up your cuffs where it often falls down, these don't fall. I've worn it on stage like this, this particular shirt in fact, on stage with the cuffs rolled up, and it doesn't fall off, even if I'm doing my wild hand gesticulating while I'm speaking. So I really appreciate that, and I think it's super cool that you can try this out. Number four, details aren't just details. In fact, details are a lot of times what makes men's fashion really fun, really enjoyable, really shareable. So I like to do some fun stuff with all kinds of things, my eyeglasses that I wear. I'm wearing contacts right now. Obviously, this ludicrous mustache, which is a whole other story, but playing around with hairstyles. I actually really enjoy messing around with watches. I've got this one from ZIIIRO that I love. You've probably seen me wear a couple of other ones on Whiteboard Friday. I have this belt. It's actually a kid's belt. I know that's weird, but it's kind of fun. It's got like these dinosaurs eating toast, like making toast and then eating toast, and then stealing it from each other kind of print on there. A belt is a very hidden thing, like you rarely, rarely see it, especially because so few men tuck in their shirts anymore, which, God forbid, please don't tuck in your shirts, especially not T-shirts. Just don't do it. It's not allowed. I should bring in a gentleman from our engineering team to maybe show that off. God forbid, please don't tuck in your shirts. Especially not T-shirts. Just don't do it. It's not allowed. But in any case, other kinds of details can be really cool too. So one of the things that I love and that has been taking off in popularity in men's fashion is socks and shoe matching. So these are some old sneakers that I've got, which you can see have purple flowers on the side there. So I grabbed some purple polka dot socks that kind of match the color patterns in there, a few of the flowers, and it just makes for fun. It's something that might catch your eye as you're walking by. Details, details. I'll show you another one. On the topic of undershirts and underwear, it is absolutely appropriate to wear this ring-collar undershirt when I am putting on a suit. I plan to have a tie here. I definitely don't want an undershirt that's going to be V-neck that will show off like a little kind of weird patch of skin underneath the shirt, especially if I'm going to be outdoors, for example, for a wedding or at work or something like that. Now here in the U.S. it's spring, which means formal events are coming up, a lot of weddings, Bat and Bar Mitzvahs, all kinds of stuff. It also means that a lot of gentlemen are about to make the critical mistake that you see me making right now. Let's imagine that I'm at a formal event, not at work. I probably wouldn't wear a three piece suit to work, or everybody here would think I was crazy. But what's going on? What am I missing? What am I doing wrong? It's my necktie. Look at this shabby tie. Can you see? There you go. Look this knot is called a four-in-hand knot, and a four-in- hand is a very, very simple to tie, tie. But it is not a formal necktie knot. Let me show you how a formal necktie knot looks. I'm going to start with a half Windsor, and I do the full Windsor as well. [Cut to new scene.] Here we have the half Windsor. This is what I call the minimum acceptable bar of necktie knot formality for a wedding or another formal occasion. Now let's take a look at the full Windsor, which looks even nicer in some ways. [Cut.] Here we have the full Windsor. The full Windsor, as you can see, has this lovely sort of balance to it on both sides. It's very even. It looks like I'm going to some sort of formal British state affair. English state affair? I don't know. The Queen will be there. She probably won't. In any case, what I urge you to do gentlemen is if you're going to a formal event that demands formal wear, please bring with you a formal knot. If you're going to a formal event that demands formal wear, please bring with you a formal knot. Now I'd very much like to thank my colleague Wes. Wes is one of our lead engineers on Moz Local, and Wes has done me the kind favor of committing a horrible fashion crime. He's tucked in his T-shirt. Wes, would you repair that mistake? Wes: Sure thing. Rand: Oh my gosh, looking so much better. Please gentlemen, don't tuck. Look, it's fantastic. It doesn't need to go in there. You don't need to show that to people. Thank you, Wes, I appreciate it. Wes: Oh, you're welcome. Rand: One of my favorite trends in men's fashion, by the way, is the return of the bow tie. Now I think it looks ridiculous with 99% of outfits, but with a full suit, a three piece, or a tuxedo, a bow tie can make a great accoutrement, and it's actually a little more fun to put on and fun to wear. It can make your outfit a little . . . well go better with a mustache anyway. Don't cheat by the way. They are challenging to tie, but they're also a lot of fun. These things with the little clip, I don't know what this is. This is like the black hat of bow ties. Don't do it, people. These things with the little clip ... this is like the black hat of bow ties. Don't do it, people. All right, everyone. I have really enjoyed having a little bit of fun, talking some men's fashion with you guys. I'm sure there are going to be some great comments, and if you have questions about this stuff, I'm happy to answer it. I'm not an expert. This is not my field. I just like to have fun in here, and I really enjoy giving a hard time to the guys in my life who happen to tuck in their shirts or wear clip-on bow ties or mismatch their socks. So when you see me at a conference, be sure and say hi and give me a hard time about whatever I'm wearing, because I need it and I deserve it. Thanks everyone. We'll see you again next time. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Fashion Hacks for the Modern Male Marketer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Fashion Hacks for the Modern Male Marketer"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H4",
      "text": "Unintentionally, my underwear has become outerwear. \r\nI just find this, well, not optimized."
    },
    {
      "level": "H4",
      "text": "God forbid, please don't tuck in your shirts. Especially not T-shirts.\r\nJust don't do it. It's not allowed."
    },
    {
      "level": "H4",
      "text": "If you're going to a formal event that demands formal wear, \r\nplease bring with you a formal knot."
    },
    {
      "level": "H4",
      "text": "These things with the little clip ... this is like the black hat of bow ties.\r\nDon't do it, people."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}