{
  "url": "https://moz.com/blog/5-facebook-marketing-resources-you-didnt-know-about",
  "slug": "5-facebook-marketing-resources-you-didnt-know-about",
  "title": "5 Facebook Marketing Resources You Didn't Know About - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Facebook advertising is here to stay, and marketers are spending more time and money on their platform than ever before. Joanna Lord discusses five of Facebook's best-kept secret resources to help marketers get the most out of their Facebook experience.",
  "content": "5 Facebook Marketing Resources You Didn't Know About Social Media By: Joanna Lord October 9, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord October 9, 2012 5 Facebook Marketing Resources You Didn't Know About Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few years ago, many of us were skeptical about how Facebook was going to get marketers to spend a significant amount of time and money on their platform, which is clearly not the case these days. One thing I'm sure of now is that Facebook advertising is here to stay. According to the State of Inbound report HubSpot put out this year, \"42% of marketers say Facebook is critical or important to their business.\" That percentage has gone up 75% from where it was just a few years ago. Talk about up and to the right! With all that pickup, one would expect Facebook to have some resources out there to help us market our companies more effectively on Facebook. Never fear, for these resources exist! Unfortunately, they are somewhat hidden. Here are five pages and resources worth exploring if you are looking to drive traffic and sales through Facebook. Facebook Marketing Page Say what? Yup. Believe it or not, Facebook runs a page (with over 2 million likes, by the way) that they manage actively to help marketers use Facebook more effectively. They often post about webinars they are holding for marketers, answer specific questions posted to their wall, and spotlight valuable statistics that could help you make the case in-house to dedicate more resources to Facebook. Facebook Advertising Page For those of you looking to try your hand at Facebook ads, you might find there aren't a ton of resources out there to help you get set up and running smoothly. Luckily for us, Facebook has been investing in their help documentation. In this section, they outline how things work, show off some success stories, and answer top questions. You can also find some contact information for those nagging questions you can’t quite figure out. Facebook Business Page This might be one of the least known resources that Facebook has put together. Instead of just focusing on how you can set up an ad and spend money with Facebook, they have worked to put together information on how you can get the most out of Facebook as a business. The page covers the basics like building a page and conversation etiquette, but it also gives tips on how to engage your audience and influence friends. Facebook Studio This is by far my favorite of all the resources Facebook has put together for marketers. Here you will find a gallery of creative Facebook campaigns, explore award-winning campaigns, a directory agencies experience in Facebook marketing campaigns, and more. Facebook Studio Edge This is a brand new resource for those looking to take Facebook campaign creation in house. Recently released, Facebook Studio Edge is an online course that walks a user through critical knowledge pieces like measurement, research, resources, and tools to help with Facebook marketing. You can request beta entry and get started today. I’m super excited to see them operationalize this learning curve a bit with the facebook studio edge series. Whoa, that's a ton of good stuff! We were fortunate enough to host Facebook in the office a few weeks ago, and we were really impressed (but mainly surprised!) to hear about all of these great resources. As more of our time and budget shifts to Facebook, be sure to lean on the resources above to help steer you in the right direction. Perhaps one of the best advantages of investing in Facebook is that they are home to a community of others trying to do the same thing. Connect with other community members on the pages above, and see how you can help each other succeed. Best of luck to you all! If I missed any other Facebook marketing resources (they don't have to be hosted on Facebook like the list above) feel free to leave them in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Facebook Marketing Resources You Didn't Know About"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Facebook Marketing Resources You Didn't Know About"
    },
    {
      "level": "H3",
      "text": "Facebook Marketing Page"
    },
    {
      "level": "H3",
      "text": "Facebook Advertising Page"
    },
    {
      "level": "H3",
      "text": "Facebook Business Page"
    },
    {
      "level": "H3",
      "text": "Facebook Studio"
    },
    {
      "level": "H3",
      "text": "Facebook Studio Edge"
    },
    {
      "level": "H3",
      "text": "Whoa, that's a ton of good stuff!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}