{
  "url": "https://moz.com/blog/5-google-business-profile-tweaks",
  "slug": "5-google-business-profile-tweaks",
  "title": "5 Google Business Profile Tweaks To Improve Foot Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Leverage these 5 Google Business Profile tips to increase your client's foot traffic.",
  "content": "5 Google Business Profile Tweaks To Improve Foot Traffic Local SEO | Search Engines | Branding By: Miriam Ellis March 19, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 19, 2019 5 Google Business Profile Tweaks To Improve Foot Traffic Local SEO | Search Engines | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Your agency recommends all kinds of useful tactics to help improve the local SEO for your local business clients, but how many of those techniques are leveraging Google Business Profile (GBP) to attract as many walk-ins as possible? Today, I’m sharing five GBP tweaks worthy of implementation to help turn digital traffic into foot traffic. I've ordered them from easiest to hardest, but as you'll see, even the more difficult ones aren’t actually very daunting — all the more reason to try them out! 1) Answer Google Q&A quickly (they might be leads) Difficulty level: Easy If you have automotive industry clients, chances you’re familiar with Greg Gifford from DealerOn. At a recent local search conference, Greg shared that 40 percent of the Google Q&A questions his clients receive are actually leads. 40 percent! Here's what that looks like in Google's Q&A: It looks like Coast Nissan has a customer who is ready to walk through the door if they receive an answer. But as you can see, the question has gone unanswered. Note, too, that four people have thumbed the question up, which signifies a shared interest in a potential answer, but it’s still not making it onto the radar of this particular dealership. Nearly all verticals could have overlooked leads sitting in their GBPs — from questions about dietary options at a restaurant, to whether a retailer stocks a product, to queries about ADA compliance or available parking. Every ask represents a possible lead, and in a competitive retail landscape, who can afford to ignore such an opportunity? The easiest way for Google My Business (GMB) listing owners and managers to get notified of new questions is via the Google Maps App, as notifications are not yet part of the main GMB dashboard. This will help you catch questions as they arise. The faster your client responds to incoming queries, the better their chances of winning the foot traffic. 2) Post about your proximity to nearby major attractions Difficulty level: Easy Imagine someone has just spent the morning at a museum, a landmark, park, or theatre. After exploring, perhaps they want to go to lunch, go apparel shopping, find a gas station, or a bookstore near them. A well-positioned Google Post, like the one below, can guide them right to your client’s door: This could become an especially strong draw for foot traffic if Google expands its experiment of showing Posts’ snippets not just in the Business Profile and Local Finder, but within local packs: Posting is so easy — there’s no reason not to give it a try. Need help getting your client started? Here’s Google’s intro and here’s an interview I did last year with Joel Headley on using Google Posts to boost bookings and conversions. 3) Turn GBPs into storefronts Difficulty level: Easy for retailers With a little help from SWIS and Pointy, your retail clients’ GBPs can become the storefront window that beckons in highly-converting foot traffic. Your client’s \"See What’s In Store inventory\" appears within the Business Profile, letting customers know the business has the exact merchandise they’re looking for: Pointy is Google’s launch partner for this game-changing GBP feature. I recently interviewed CEO Mark Cummins regarding the ultra-simple Pointy device which makes it a snap for nearly all retailers to instantly bring their inventory online — without the fuss of traditional e-commerce systems and at a truly nominal cost. I’ll reiterate my prediction that SWIS is the “next big thing” in local, and when last I spoke with Mark, one percent of all US retailers had already adopted his product. Encourage your retail clients to sign up and give them an amazing competitive edge on driving foot traffic! 4) Make your profile pic a selfie hotspot Difficulty level: Medium (feasible for many storefronts) When a client has a physical premise (and community ordinances permit it), an exterior mural can turn through traffic into foot traffic — it also helps to convert Instagram selfie-takers into customers. As I mentioned in a recent blog post, a modest investment in this strategy could appeal to the 43–58 percent of survey respondents who are swayed to shop in locations that are visually appealing. If a large outdoor mural isn’t possible, there’s plenty of inspiration for smaller indoor murals, here. Once the client has made the investment in providing a cultural experience for the community, they can try experimenting with getting the artwork placed as the cover photo on their GBP — anyone looking at a set of competitors in a given area will see this appealing, extra reason to choose their business over others. Mark my words, local search marketers: We are on the verge of seeing Americans reject the constricted label of “consumer” in a quest for a more holistic view of themselves as whole persons. Local businesses that integrate art, culture, and community life into their business models will be well-placed to answer what, in my view, is a growing desire for authentic human experiences. As a local search marketer, myself, this is a topic I plan to explore further this year. 5) Putting time on your side Difficulty level: Medium (feasible for willing clients) Here’s a pet peeve of mine: businesses that serve working people but are only open 9–5. How can your client’s foot traffic achieve optimum levels if their doors are only open when everybody is at work? So, here’s the task: Do a quick audit of the hours posted on the GBPs of your client’s direct competitors. For example, I found three craft shops in one small city with these hours: Guess which competitor is getting all of the business after 6 PM every day of the week, when most people are off work and able to shop? Now, it may well be that some of your smaller clients are already working as many hours as they can, but have they explored whether their hours are actually ideal for their customers’ needs and whether any time slots aren’t being filled in the community by their competitors? What if, instead of operating under the traditional 9–5, your client switched to 11–7, since no other competitor in town is open after 5 PM? It’s the same number of hours and your client would benefit from getting all the foot traffic of the 9–5-ers. Alternatively, instead of closing on Saturdays, the business closed on Mondays — perhaps this is the slowest of their weekdays? Being open on the weekend could mean that the average worker can now access said business and become a customer. It will take some openness to change, but if a business agrees to implementation, don’t forget to update the GMB hours and push out the new hours to the major citation platforms via a service like Moz Local. Your turn to add your best GMB moves I hope you’ll take some of these simple GBP tips to an upcoming client meeting. And if they decide to forge ahead with your tips, be sure to monitor the outcomes! How great if a simple audit of hours turned into a foot traffic win for your client? In the meantime, if you have any favorite techniques, hacks, or easy GMB wins to share with our community, I’d love to read your comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Google Business Profile Tweaks To Improve Foot Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Google Business Profile Tweaks To Improve Foot Traffic"
    },
    {
      "level": "H2",
      "text": "1) Answer Google Q&A quickly (they might be leads)"
    },
    {
      "level": "H3",
      "text": "Difficulty level: Easy"
    },
    {
      "level": "H2",
      "text": "2) Post about your proximity to nearby major attractions"
    },
    {
      "level": "H3",
      "text": "Difficulty level: Easy"
    },
    {
      "level": "H2",
      "text": "3) Turn GBPs into storefronts"
    },
    {
      "level": "H3",
      "text": "Difficulty level: Easy for retailers"
    },
    {
      "level": "H2",
      "text": "4) Make your profile pic a selfie hotspot"
    },
    {
      "level": "H3",
      "text": "Difficulty level: Medium (feasible for many storefronts)"
    },
    {
      "level": "H2",
      "text": "5) Putting time on your side"
    },
    {
      "level": "H3",
      "text": "Difficulty level: Medium (feasible for willing clients)"
    },
    {
      "level": "H2",
      "text": "Your turn to add your best GMB moves"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}