{
  "url": "https://moz.com/blog/5-simple-google-analytics-tips-you-should-be-using",
  "slug": "5-simple-google-analytics-tips-you-should-be-using",
  "title": "5 Simple Google Analytics Tips You Should Be Using for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, a few of us from SEOmoz attended WebShare’s Seminar for Success for Google Analytics and Google Website Optimizer training. All of us who attended have a decent grasp on GA but really wanted to get some advanced information and gain a better understanding of GA’s potential. Plus,…",
  "content": "5 Simple Google Analytics Tips You Should Be Using SEO Analytics By: Jennifer Sable Lopez May 18, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez May 18, 2010 5 Simple Google Analytics Tips You Should Be Using SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, a few of us from SEOmoz attended WebShare’s Seminar for Success for Google Analytics and Google Website Optimizer training. All of us who attended have a decent grasp on GA but really wanted to get some advanced information and gain a better understanding of GA’s potential. Plus, actually getting trained on something is always helpful, even if you feel you know it well! During the first day, which was an introduction to Google Analytics and user training, I quickly realized that there were a number of tips and tactics that I had NO IDEA about previously. I felt a little silly that I didn’t know that some of these things even existed in GA and got to thinking… if I didn’t know you could use these great tactics, maybe others don’t either. Following are the tips that I’ll be using in Google Analytics from here on out. You may already be using some of these, but hopefully you’ll find a helpful nugget of information in here. 1. Date Range Made Easy This actually made me the giddiest of all the features. It’s so simple, yet also so subtle that I had never noticed it before! When you use the date range drop down selection, you can select a month or a week easily by simply clicking on the week or month. WHAT?! I know, that’s what I said. Month Selection Week Selection 2. Overview Comparison Reports This is another one, that I feel a bit silly I didn’t know previously! But if you do a comparison with the past month (or whatever date range you choose), it will show you all the data in the overview. My favorite part is that it will calculate the difference for you and give you a quick overview of the comparison. Pretty dang cool! Plus if you take that information and export it to PDF it's super easy to send it on to anyone or set up a scheduled email (see below). 3. Regular Expressions FTW Coming from the dev world, I’ve used regular expressions in the past for many things. I was really excited to learn more about using regular expressions when performing searches, setting up filters, and all other things. Here are a list of the regular expressions you can use. Don't laugh if you've been using these for years, some of us are excited over here! Wildcards . = match any single character * = match – or more of previous + = match 1 or more previous ? = match 0 or 1 of previous | = logical OR Anchors ^ must occur at the beginning - ^/order\\.php = everything that starts with /order.php $ must occur at end Grouping () create match on an item – grand(ma|pa) – (.*) = match any chars [] create match on one ofe list of items Escaping \\ escapes any special character - OK I actually giggled out loud in the training because the trainer, David Booth, said \"When in doubt, escape it out” [see! hehehehe] This regular expression allowed me to search for all guides within the /article section of the site 4. Show More Rows If you have a large site, I’m sure you’ve come across the issue of trying to export all your data but you can only download 500 rows at a time! That can be super annoying if you’re trying to pull data when you have 10,000+ rows you need to get into one spreadsheet. This little trick can save you hours of time Just add this to the end of the URL: “&limit=”. Then when you export it to CSV (this is the only option it works with), you’ll get the full number you’ve added in the limit. The view on the page will still only show 500 (or whatever it’s set to) but the actual download will have everything you need. There are limitations with the number of rows you can get in Excel but it’s more of a problem with Excel 2005 and earlier. Normally you can only select 500 rows at a time. But add \"&limit=#\" in the URL Then Select Export to CSV And voila! You have all your data A few notes about this feature that came from the comments: 1. You have to use the &limit feature before the # in the URL for it to work and 2. The max you can get using this is 50,000 (Tom Critchlow recommends looking at Excellent Analytics, an excel plugin to get more). 5. Schedule a Report to be Emailed I’ve actually seen this used previously and was on the receiving end of these reports, but honestly hadn’t thought about how we could use them on SEOmoz until now. These are extremely useful for reports you send often (daily/weekly/monthly) and/or reports you send to users who don’t have access to GA. Also use the “add to existing” feature so you can send multiple reports to one person rather than 2 separate emails. Another nice feature is that the date range you set up is sticky, so if the report was set up to show the last 30 days, the next email sent out automatically will also pull the last 30 days. Mhmmm woot! I personally plan on testing this out starting in June with YOUmoz posts. So if you get a YOUmoz post published in June, watch for a follow up email from me with your post analytics. :) Bonus Tips! Here are a couple additional tips I couldn't leave out. They're not specific to GA, but work nicely with it! Search based keyword tool – http://www.google.com/sktool Rand has talked about this in the past and I’ve used it as well, but I didn’t totally understand the potential! The part I didn’t realize was that if you log in, you’ll get customized suggestions based on your site and your Adwords account. I’ve gone in and used the tool previously but didn’t realize that by being logged in, and having all your accounts hooked together, that you’d actually see data based on your account. This is probably a bit “duh” on my end, but still in case you didn’t know… well now you do. :) Google URL builder! Setting up a campaign is much easier than I realized! There’s actually a simple tool that helps you easily create the campaign URLs. Just fill out this form, and it pops out the URL for you to use in your campaign. Pretty nifty! There you have it! Some cool tips I learned in the Seminar for Success. We learned quite a bit and Danny is going to have another post probably next week with some more advanced tactics. If you’re interested in taking these classes as well, here’s the upcoming schedule. Washington, DC May 19-21, 2010 Phoenix, AZ June 9-11, 2010 Chicago, IL June 23-25, 2010 Berkeley, CA July 28-30, 2010 Los Angeles, CA Aug 18-20, 2010 San Diego, CA Sep 1-3, 2010 Salt Lake City, UT Sep 15-17, 2010 Vancouver, BC Oct 6-8, 2010 Atlanta, GA Oct 27-29, 2010 Orlando, FL Nov 3-5, 2010 Washington, DC Dec 8-10, 2010 I’d love to hear about any other tips or tricks like these that you use. If you're looking for more advanced GA tactics, tomorrow Casey Henry will be posting about using Event Tracking to monitor Calls to Action. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Simple Google Analytics Tips You Should Be Using"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Simple Google Analytics Tips You Should Be Using"
    },
    {
      "level": "H2",
      "text": "1. Date Range Made Easy"
    },
    {
      "level": "H2",
      "text": "2. Overview Comparison Reports"
    },
    {
      "level": "H2",
      "text": "3. Regular Expressions FTW"
    },
    {
      "level": "H2",
      "text": "4. Show More Rows"
    },
    {
      "level": "H2",
      "text": "5. Schedule a Report to be Emailed"
    },
    {
      "level": "H2",
      "text": "Bonus Tips!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}