{
  "url": "https://moz.com/blog/5-steps-to-use-competitive-research-as-a-foundation-for-a-successful-content-marketing-strategy",
  "slug": "5-steps-to-use-competitive-research-as-a-foundation-for-a-successful-content-marketing-strategy",
  "title": "5 Steps to use Competitive Research as a Foundation for a Successful Content Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Instead of flying blind, it’s important to perform competitive research in order to search for patterns and commonalities in your industry.  This information should give you the hard evidence necessary to create an effective online marketing strategy.",
  "content": "5 Steps to use Competitive Research as a Foundation for a Successful Content Marketing Strategy Competitive Research By: Marcela De Vivo February 27, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Marcela De Vivo February 27, 2013 5 Steps to use Competitive Research as a Foundation for a Successful Content Marketing Strategy Competitive Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Most of us make educated guesses about how to create successful SEO strategies. From choosing the best keywords to building the appropriate quantity and quality of links, we evaluate the data and try to emulate sites that are ranking well. Yet there are so many questions left unanswered. Do social signals really have a significant impact on a site’s rankings? Can highly relevant new domains rank quickly? Should you register an Exact Match Domain or has Google thwarted that advantage? Instead of flying blind, it’s important to perform competitive research in order to search for patterns and commonalities in your industry. This information should give you the hard evidence necessary to create an effective online marketing strategy. 1. Create a Keyword Evaluation Study Start by using keyword tools to identify a variety of keywords. In my sample study, I decided to research a variety of terms, including informational & transactional queries. My goal was to find a mix of highly competitive Head Terms, long-tail questions, specific product names, and a few local queries to test. Examples Include: search engine marketing adirondack chairs weight loss how do artists generate ideas and inspiration what is the healthiest way to lose weight what are some tasty recipes for juicing dog training techniques sightseeing tours in hollywood how to use pinterest for marketing parking games jarrow coconut oil bankruptcy lawyer Foscam FI8910W Pan & Tilt IP/Network Camera InStep Quick N EZ Double Bicycle Trailer Panasonic Men's 4-Blade Shaver I ran each keyword through Adwords to ascertain the Competition, Global Monthly Searches, and Local Monthly Searches. This would give me an idea of the traffic and competition available for each of these terms. 2. Run the sites ranking through a link analysis tool Data you can aggregate for each resulting page can include: Backlinks to the page Backlinks to the Domain Unique C Class Backlinks to the Domain Mozrank PR Alexa Rating Moz Page Authority Moz Domain Authority Domain Age Pages Indexed in Google # of Retweets FB likes Reddits StumbleUpon Pinterest Pins Links from Dmoz Link Velocity Ratio Link Velocity for a 4 month, 6 month, 12 month and 24 month period I got the top 20 results for each keyword directly from Google using a proxy to avoid personalization and geolocation. 3. Start labeling and working with the data I started my analysis by labeling each query as Informational, Navigational, or Transactional. Then, I classified each of the top 20 results based on their nature: Informational, Niche, Exact Match Domain, Brand, Social Media. Finally, I added the total number of each of the above and performed calculations for average, median, and standard deviation of each of the parameters. I classified sites as follows: Informational Sites: Sites that are primarily focused on sharing information, including sites like Wikipedia, About.com, WebMD, Newspaper sites, Examiner.com, and other such sites. Niche Sites: Sites that focus on a specific subject where all of the pages on the site revolve around this specific category. Examples would be SEOmoz for online marketing, ThisOldHouse for Home Improvement, and Glamour.com for beauty. Transactional Sites: Sites that sell a product and provide both product pages and informational pages designed to sell that product. Brand Sites: Mega retailers with a massive online and offline presence. These include Amazon, Walmart, BestBuy, HomeDepot, etc. Social Media Sites: These include results from pages on Facebook, Twitter, and other User Generated Content sites like Squidoo and Ehow. 4. Analyze the data Once you’ve labeled all of your sites, start looking for percentages and trends. In my study, I found the following: Total Keywords Analyzed: 117 Total Number of URLs Analyzed: 2242 Average Domain Age: 10.5 years Average Moz Domain Authority: 67.99 Average Moz Page Authority: 46.33 Average G+1s: 31.17 Total # of Brand Domains: 379 (16.9%) Total # of Niche Domains: 1237 (55.1%) Total # of Exact Match Domains: 83 (3.7%) Total # of Social Media Domains: 179 (7.9%) Total # of Informational Domains: 339 (15.1%) 5. Create a list of observations At this stage, all of the data is at your fingertips. You can now start going through all of the results to identify trends/patterns. Below I will share some of the observations that I made from my own study: A. The type of query had an impact on the types of sites that ranked. Informational queries generally triggered a high number of niche sites in the results. Navigational and Transactional queries had many large brands in the SERPs, where applicable. Let me define these terms: Informational searching involves looking for a specific fact or topic Navigational searching seeks to locate a specific web site Transactional searching looks for information related to buying a particular product or service For example, “search engine marketing” had 16 Niche sites in the top 20, with only 2 brand results, 1 informational and 1 EMD. Transactional Queries had many brand sites ranking in the top 10. Google’s Authority Pages algorithm explains why and how so many of these brands show up. “Adirondack Chairs” had 12 brands in the top 20, with niche sites only showing up in the 2nd page. Keywords where large retailers don’t have pages dedicated to those products had a large number of niche sites in the results. “Wooden playsets” has 4 large brands ranking in the top 10, but the other 6 results were niche sites such as backyardadventures.com. As link building and content marketing becomes more resource-intensive, many people may multiple sites will have some hard choices to make. Should you consolidate your websites into just one large, non-focused site? Or should you continue to promote niche-specific sites? Performing a similar study for keywords related to your niche, both informational, transactional, and long tail, will help you make the a decision relevant to your industry. Based on the data for this study, I believe that to gain an edge for transactional queries over large retailers you need to have high quality niche specific sites. B. Luck (and Google) Favors Big Brands I quickly noticed the prominence of Mega Brands, such as Amazon, Walmart, BestBuy, and Home Depot, in the rankings. Close to 17% of the results from my study were from large retail brands. Google’s emphasis on domain authority has created a favorable situation for large, popular brands. If these large retail sites offer the product or have pages with the relevant data, even with low page authority, pages from those mega sites rank well. Search for “Birthstone Necklace” and 9 out of the top 10 results are from large, authority domains. Even detailed product queries where the large brands sell the product online will trigger results largely skewed towards brands. For example: Panasonic Men's 4-Blade Shaver had 12 out of the top 20 rankings from large Brand sites such as Amazon, Ebay, Target.com, and Frys.com. Transactional queries where brands did not have dedicated pages showed a higher number of niche site rankings. An example is for detailed product names that aren’t sold by large retailers. www.authoritysafes.com is an example, ranking # 1 for V-Line 51653-SA. Of interest, this site ranks above Amazon and even the manufacturer due to better on-page SEO. C. Size may not matter, but Age does In my study, over 70% of sites ranking in the top 20 have domains that are older than 2 years. The overall average domain set for the data set was 10.6 years old. Yes, in a data set of over 2200 domains, the average age was over 10. To me, this is a clear indication that domain age DOES matter. For more competitive queries, the average age is higher than long tail informational terms. Do new domains rank? On the rare occasion where I saw newer domains ranking, there were two other factors typically affecting the results: The link velocity trend was VERY high compared to the query set, and/or it was an EMD with a high Link velocity trend. For example, the youngest domain in the “Vespa Scooters” data set was 3 years and 6 months. In comparison, for the term “Make Money Online” 3 out of the top 10 domains were between 1 and 2 years old. The commonality between these domains included a high number of pages indexed in Google, high social media engagement, and high link velocity trends. This data gave me critical information for creating an SEO strategy. When creating a strategy for new sites, here are some options that I will consider: Give clients adequate expectations. I have to explain to them they can expect an extended time frame before they start ranking well for Head Terms. For very specific long tail terms, target authority web 2.0 sites to share content. To generate some additional traffic and visitors, I plan on creating pages in old, established domains such as Squidoo or Hubspot and build a very high number of links and traffic. Yes, you still have to promote your lenses and blog posts, but the authority of the domains gives you some leeway in the types, quantity, and link velocity of your link building. By choosing the right keywords to target, I have been able to build rankings and traffic within days of creating pages on these sites. Write guest posts with your target keyword in the title/URL and submit it to an old, established, highly authoritative site. That page has a high possibility of ranking, and then sending referral traffic to your own site. Register an exact match domain and build a high volume of quality links. Run a giveaway and promote it to high quality sites. If you pay people to promote your giveaway or remove your product, you can give them the title to use in their blog post. Of course this title would include your target keyword, which will in turn help you rank for those long tail terms. D. EMDs still have an edge I noticed that the EMD Filter did not completely eliminate the potential for sites to rank. EMDs still have an advantage as the average number of inbound links is much lower, but they still had to have a volume of links to compete. Ranking with EMDs isn’t dead - you just don’t get a free pass. You have to build links to your EMD and at least bring it to the lower threshold of the keyword averages. Examples of sites ranking with EMDs are www.adirondackchairs.com with 507 unique C class links and www.thebestadirondackchair.com with 501 C class links. The other 8 sites in the top 10 had a minimum of 6000 inbound links from unique c classes. The Domain Authority was 42 and 44 respectively, whereas the next lowest site in the set had a Domain Authority of 75. The keyword “Feng Shui Jewelry” has www.fengshuijewelrystore.com ranking # 7, with only 10 unique c class links and a DA of 20. The rest of the sites in the top 10 had at least 200 unique c class links. As you can see if you register an EMD and build links, you definitely would have an edge to rank for the target term. E. High Link Velocity Trends I came across many sites ranking in the top 10 with a low number of total unique links, but with a very high link velocity trend. In the image below, compare the link velocity trends for the sites in the top 10. The LVT for the 2nd URL is 510. Despite the fact that the domain is new and has fewer links compared to other sites in the top 10, the LVT propelled it to the top. Another site ranking well due to high LVT is www.jacobymeyersbankruptcy.com for “bankruptcy lawyers”, with an LVT of 278 and domain age of 8 months. The LVT for the sites in the top 10 are -86, -55, -4, 134, 278, -64, 7, 7, -50, -27. It’s also worth noting that this site has a very high number of social votes, with close to 200 Google +1s. www.debt-consolidation.co ranks 11 for “debt consolidation”, a very very competitive term. It is only 4 months old and has 348 unique c class links. Domain Authority is 54, with a SERP average of 77.65 The LVT is 650, as compared to the other domains above it which have negative LVTs. F. Do Social Votes affect rankings? Using competitive research, you can ask questions about the impact of various signals on your SERPs. So many people talk about the power of social signals, so I figured this study would offer me an opportunity to come up with some answers. The data was all over the map for this one. Some queries had sites ranking with large number of social votes as well as 0 social votes. There are simply no conclusive trends, which to me is an indicator that this is not yet a strong ranking signal. For example, www.oltarsh.com ranks #7 for immigration lawyers with a very small number of social votes. Other sites in the top 10 include www.lawyers.com, www.aila.org and www.avvo.com with very large numbers of social votes. There were results that made me think twice about whether G +1s might in fact have an effect in the rankings. For example, www.dollarsincome.com ranks #9 for “make money online” and has 3477 +1s. The average Domain Authority was lower that other sites in the SERPs, as well as the number of unique C class links. The site www.babyauthority.com ranks high for “glenna jean crib bedding”, and has more social votes than other sites in the top 10. www.spoonful.com ranks #1 for halloween costume ideas for boys. There are other sites with much higher inbound links and domain authority. Could +1s have pushed these sites in to the top 10? Finally, www.womenshealthmag.co is close to 2 years old and ranks for “cleansing diet”. The LVT, Domain Authority, Dom Pop, Alexa, and other factors are similar to the average. The other sites in the top 10 are at least 6 years old. How is this “newish” site ranking? It has one of the highest numbers of +1s in the SERP. This would require further testing and exploration but based on the data I will be focusing on improving my site’s presence in Google plus and seeking those coveted +1 votes. My TakeAways: Very detailed and thorough competitive analysis is essential for keyword selection. This is common knowledge among SEOs, but this has to be taken to the next level. Is the query Transactional or Informational? Of the top results, how many are Niche, Brand, EMD, Transactional, or Informational sites? Based on these percentages, does your site have a genuine chance of ranking? A transactional keyword may look great in your keyword tool, but if the top 10 is dominated by highly authoritative brands with domain authority of over 80, there’s little chance for your smaller site to rank for that term. The type of query affects the results. Informational queries will see a large number of informational sites ranking, while Transactional queries will have brand and niche sites dominating the top 10. If you want to target informational queries, use informational or social media sites as a ranking medium, not a transactional site. Niche sites have an advantage in both Informational and Transactional queries. For transactional queries, the spots that are left over after brand sites tend to be allotted to niche sites with high inbound links and authority. If you have a new site, build links like crazy to push your LVT above and beyond others in your industry. Make sure these are high quality links and that you vary your anchor text, including brand and non-specific terms to avoid penalties from filters like Penguin. EMDs can still rank well when combined with high LVT. Domain Age plays a HUGE factor in rankings. If possible, buy old, established domains that have aged links. Even though the evidence is not conclusive, building +1s cannot hurt and may help. Why not focus on the Google Plus platform to rack up those +1s? What Social Media sites should occupy your social media efforts? Out of the 2242 results, 170 were Social Media sites (7.9%). Out of those 170, Youtube occupied 27.6% of the Social Medial URLs. Blogspot followed with 8.8%, then Squidoo with 7%. Wordpress, Wikihow, Yahoo Voices, Quora, Facebook, Hubpages, Ehow and Pinterest all had under 5%. Your social media efforts should reflect the percentages found in your specific SERPs. Acknowledge Flaws in your Competitive Research It’s impossible to make adequate comparisons without having the full extent of the data that Google has at their disposal. My study relied on a minuscule data sample, but enough for me to see some obvious commonalities that inform my decisions for actionable plans and strategies. In this study I did not take into consideration other scores such as on-page SEO for the term, click-through rate, time before the visitor returned to the SERPs, etc. Other Factors to Consider With this in mind, trying to determine why a site ranks above others when they have similar metrics is very difficult. Were sites downgraded or upgraded by human raters? Perhaps a site has all of the right metrics but the CTR is very low, making it rank below other less authoritative sites? Could a site's ranking be tempered by the Rank-Modifying Filter? We can simply look at the data and extrapolate conclusions, followed by tests to see if your hypothesis proves accurate. Knowing these flaws in competitive research, you can still analyze the data and create marketing strategies that reflect trends in your SERPs. If you would like me to run your keywords through the same tools and incorporate terms into this research, don’t hesitate to reach out to me. My goal is to keep growing this study so that with additional data we may have more conclusive results and evidence.If you would like to look at the report or would like to share other hypothesis or observations, please contact me! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Steps to use Competitive Research as a Foundation for a Successful Content Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Steps to use Competitive Research as a Foundation for a Successful Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "1. Create a Keyword Evaluation Study"
    },
    {
      "level": "H2",
      "text": "2. Run the sites ranking through a link analysis tool"
    },
    {
      "level": "H2",
      "text": "3. Start labeling and working with the data"
    },
    {
      "level": "H2",
      "text": "4. Analyze the data"
    },
    {
      "level": "H2",
      "text": "5. Create a list of observations"
    },
    {
      "level": "H2",
      "text": "A. The type of query had an impact on the types of sites that ranked."
    },
    {
      "level": "H2",
      "text": "B. Luck (and Google) Favors Big Brands"
    },
    {
      "level": "H2",
      "text": "C. Size may not matter, but Age does"
    },
    {
      "level": "H2",
      "text": "D. EMDs still have an edge"
    },
    {
      "level": "H2",
      "text": "E. High Link Velocity Trends"
    },
    {
      "level": "H2",
      "text": "F. Do Social Votes affect rankings?"
    },
    {
      "level": "H2",
      "text": "My TakeAways:"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marcela De Vivo\n          \n            Marcela De Vivo\n          \n            Marcela De Vivo"
}