{
  "url": "https://moz.com/blog/5-steps-to-bootstrapping-your-pr-efforts",
  "slug": "5-steps-to-bootstrapping-your-pr-efforts",
  "title": "5 Steps To Bootstrapping Your PR Efforts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Public relations is just one of those things. It's something that every company knows they should do, but only see two ways of making it happen -- hire an expensive PR firm or cross their fingers and hope for the best. The latter is, well, not really much of a PR strategy. There is a third option,…",
  "content": "5 Steps To Bootstrapping Your PR Efforts Public Relations By: Andrew Dumont January 30, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Andrew Dumont January 30, 2012 5 Steps To Bootstrapping Your PR Efforts Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Public relations is just one of those things. It's something that every company knows they should do, but only see two ways of making it happen -- hire an expensive PR firm or cross their fingers and hope for the best. The latter is, well, not really much of a PR strategy. There is a third option, however. Bootstrapping. I've written in the past about how to bootstrap your PR efforts, but never really dug into the nitty gritty. It's a time intensive process, but if you're up for the challenge, getting coverage in some of the top outlets in the world is possible, and even likely. I've tried many methods, failed many times, and ultimately boiled it down to this process. Here it is, Moz family. Step 1 - The Mirror Check The first step is what I like to call the mirror check, something that gets glossed over far too often. You need to put yourself in the mind of a writer. People don't want to read shit stories, and writers don't want to write them; it's a simple relationship. Before you dig into the rest of the process, make sure you've got a story that you'd be interested in reading. Honestly. If you can't look yourself in the mirror and say that you would love to read what you're pitching, hold off. Save your time, and more importantly, everyone else's. Step 2 - Building Your Publication List Once you've got a solid story, it's time to start building your list of publications. I've found it helpful to break it into larger categories, such as tech blogs, mainstream media, local press, niché publications and so on. That'll give you a good outline to begin digging into the specific publications you're looking to reach out to. It's important to note that PR isn't a numbers game, as many think. It's a quality and relevance game, not a shotgun spray. To determine relevance, you really need to engulf yourself in the content of the publication -- read at least 5 articles. Without reading the content, you aren't able to truly understand the writing style and typical news they cover. Once you've done this, add only the publications that would be interested in your story, and omit those that wouldn't. It'll save you time when we get to the next step. Step 3 - Finding the Right Contact This is so important that it deserves its own step. Again, it's all about relevance, even more so when you're looking for the right person to pitch your story to. What's the sweet spot for one writer, may be completely irrelevant to another. If you pitch the wrong one, well, you blew your shot. You've got to dig deep on this step. Here's the info that my list usually contains: The first three fields are fairly self explanatory, then we get into the meat of it. The \"relevance point\" refers to the overlap with the writer's past work. A good way of finding the right person to pitch your story to, is to go to the publication and search for relevant content. For example, if I'm looking pitch an article on company culture, the best way to find the right person is to search the publication for the term \"Company Culture\". Crazy, I know. This will bring up a great list of past content that you can dig through to find the writer that normally covers the type of story you're pitching. Once you've got the right person, the real investigative work starts happening. Depending on the publication, when you click the author's name, you're usually taken to a page with their contact info, bio, social profiles and the like. If you're not as lucky, you'll have to resort to a good ol' Google search (or Bing search :) to find what you're looking for. For each author, I like to make sure I've got at least their Twitter handle, Linkedin profile, Facebook profile and personal site (if they have one). What this allows you to do, is not only track down an email address in most cases, but it also allows you to gain a good understanding of their personality. Make note of things they like, what they've done recently, where they're located -- it's all publicly available, and goes a long way in making you stand out. Like anyone else, writers appreciate when you take the time to do it right. Drop these hints of deep research in your pitch. Finally, if you aren't able to track down their email address, use tools like Rapportive to help in guessing the right contact address. If it clicks and data appears, you've got the right email address. Step 4 - Crafting Your Pitch and Subject Line A lot of people mess up on the pitch, the eventual email that gets sent off. They get wordy, dance around the purpose of the email, attach a press release and ultimately fail miserably. Like this kid. The pitch needs to show relevance, be compelling and maintain brevity. To provide an example, here's a pitch that I've used in the past: Subject: Introducing Leatherbound, An eBook Search Engine Built in 48-Hours Hope you’re well, *editor name.* Wanted to pass this along for a potential post on *publication name,* as I thought it was a good fit after your post on climbing eBook sales. The Pitch - We’ve been knee-deep in code for the past 48 hours during Rails Rumble, a worldwide developer competition. The result, a beautiful web app called Leatherbound that makes the search for eBooks simple, powerful, and efficient. The Problem - The reading experience on Kindle, iBook and Nook apps are nearly identical, yet it’s extremely tedious to find the book you’re looking for, at the price you want for each platform. Sometimes the book is cheaper on Kindle, other times iBookstore doesn’t have what you’re looking for, but Nook does. That’s where Leatherbound comes into play. The site is dead simple, as it should be. Enter any book title or author and Leatherbound pulls book results on the iBookstore, Kindle and Nook in a single click, along with price, availability, description, etc. Here’s a good example of the site at work -- not bad for 48 hours of work, if I do say so myself. ; ) Feel free to reach out if you need more info or want to chat, thought it’d be an awesome post for you guys. Cheers, @AndrewDumont There's a few subtleties to highlight here. First, you've really got to take advantage of the subject line, craft it as if you were writing the article yourself -- turn the mirror your way. Pull the core \"hooks\" from your pitch and blend them together for your subject. Make it count, it's a make or break piece. Next, you've got to keep it brief and call out the important parts. I usually like to clearly call out (in bold) the problem that the product is solving, the pitch, and a quick way to see what you're pitching in action. With the number of emails that a writer gets each day, you've got a second or two to grab their attention, this tells them exactly where to look for the info they need. Finally, I try and add a little personality to it that matches up well with the personality of the writer (as I learn from their social profiles) -- no one wants to cover dull. Have fun with it, and allow them to find more info on you with your signature. Step 5 - Let it Rip Or, you could make it rain. Whichever you prefer. This is the culmination of all the work you've put in. Obviously, you can't always time your news in the case of product launches and breaking news, but I've found that Sunday evening is a great time to put it out there. Most folks are lazy, and they aren't willing to put in the time on a Sunday, this leaves a nice window for your pitch and a Monday release date in most cases. It's not a necessity, but it may give you the best odds. Also, this sounds obvious, but make sure you're ready for responses to your pitch. If the writer is interested, you'll hear back and they'll want more info. Respect their time and get back to them as soon as you can. The rest is out of your hands. Some General Don'ts Before we wrap this up, I want to go over some general don'ts with PR. By no means is this list comprehensive, but it'll steer you away from the big screw-ups. Avoid the Embargo - Generally speaking, writers don't like embargoes. It's a liability and a pain in the ass that many would like to avoid. Send your news out when it's ready and available for consumption. Lose the Press Release - In my mind, the press release is dead. They're bloated, impersonal and a thing of the past. If you just want links on Yahoo! news, sure, go for it. It's not going to give you the coverage that's really valuable, though. At the very least, make sure not to attach a press release to your pitch. Do it for me, please. Don't Double Pitch - Don't send the same pitch to multiple people at the same publication. It shows that you're just firing off as many emails as you can, and it's a sure way to get you ignored. Skip the General Address - Most publications recommend that you send to a generic email address like news@publication.com, it's the catch-all for poor pitches. People that don't want to see success usually go this route, it's the easy way to spray the shotgun, but it rarely yields results. Use it as your last option, but not the default. Put Down the Phone - This may be unconventional for most folks that do PR, but I believe that we live in a digital age, where phones are a secondary thing. Sure, if there's interest, hop on a call by all means. But don't do your pitching via a phone call. It catches folks off guard, and makes the encounter confrontational, with only a few seconds to tell them what they want to hear. Don't Suck - Most importantly, don't suck. Be a good person, not someone that's just on the hunt for links. Provide the writer with value, help them do their job and be awesome. It's amazing what good intent can do. Conclusion Executing on a PR push is time intensive, and demanding of finesse. It's why PR firms demand upwards of $15,000/month, with no guarantee on output. I'm not a public relations pro. By no means is this the end all be all of PR processes, but it's what I've found to be successful in landing press -- earning coverage in Wired, The Wall Street Journal, TechCrunch, Fast Company, Mashable and many more. That said, what worked for me, may not work for all. As with everything in tech, iterate, iterate, iterate. If you run across any specific questions as you're working through it, feel free to drop them in the comments or just shoot me a line, I'm always happy to help. Go forth! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Steps To Bootstrapping Your PR Efforts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Steps To Bootstrapping Your PR Efforts"
    },
    {
      "level": "H2",
      "text": "Step 1 - The Mirror Check"
    },
    {
      "level": "H2",
      "text": "Step 2 - Building Your Publication List"
    },
    {
      "level": "H2",
      "text": "Step 3 - Finding the Right Contact"
    },
    {
      "level": "H2",
      "text": "Step 4 - Crafting Your Pitch and Subject Line"
    },
    {
      "level": "H2",
      "text": "Step 5 - Let it Rip"
    },
    {
      "level": "H2",
      "text": "Some General Don'ts"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andrew Dumont\n          \n            Andrew Dumont"
}