{
  "url": "https://moz.com/blog/5-tactics-to-improve-your-community-balance",
  "slug": "5-tactics-to-improve-your-community-balance",
  "title": "5 Tactics to Improve Your Community Balance - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With more than 100 million Americans contributing content online this year, websites are doing anything they can to attract users to contribute to their site. With the notable exception of search engines, all major websites are depending on the community to drive their growth. Imagine YouTube…",
  "content": "5 Tactics to Improve Your Community Balance Social Media T By: Thomas Høgenhaven May 10, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Thomas Høgenhaven May 10, 2011 5 Tactics to Improve Your Community Balance Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With more than 100 million Americans contributing content online this year, websites are doing anything they can to attract users to contribute to their site. With the notable exception of search engines, all major websites are depending on the community to drive their growth. Imagine YouTube without user uploads; Facebook without photos and updates or Wikipedia without users writing/editing articles. There are so many advantages of fostering and nurturing a community:Lots of (almost) free contentDirect feedbackHigher conversion ratesHigher rankingsIn addition to all that, this community-driven strategy also scales extremely well. It is a clear win-win situation that has us all looking for new ways to grow our online communities.Consequently, companies invest many resources in community building. But it’s hard to get right – just ask Google about this (Google is now making social efforts a top priority and staff bonuses dependent on it). The hard thing about online communities is that attaining critical mass is not enough – you have to maintain it over time. Getting users to participate over a long period of time is the key to success. you want users to spend less time with their family and friends, and more time contributing to your community for free, you better make sure the users are motivated. Extrinsic vs. intrinsic motivation Luckily we don’t have to guess what motivate users. Decades of research in social psychology give great insights into how we can motivate users to contribute content over a long period of time. A key distinction is between extrinsic and intrinsic motivation.Intrinsic motivation is about the joy of performing something. People are likely to be motivated if an involvement in an online community helps them reach a personal goal, if they improve their skills or if they simply are having fun. This is why people have hobbies and spend their evenings and weekends learning Ruby on Rails. For intrinsic motivation to kick in, the person must feel it’s his decision to perform a certain task. Autonomy is key. Extrinsic motivation means that a user is driven to perform a task because it leads to something else such as rewards and benefits. This kind of motivation usually relies on tangible rewards. Classic examples of this include salary and performance bonus.But there are many methods to reward users with tangible rewards, and several are already being applied online: Mechanical Turk rewards turkers with money for solving tasks; SEOmoz offers community members one month free software when compiling 200 mozpoints in one month; BettingExpert offers prizes and merchandise for points, and Threadless offers money for winning designs and slogans. The web is full of examples of rewarding desired behavior with tangible rewards. The effects of tangible rewards (and why it's not sufficient) Giving tangible rewards seems like a great way to increase desired behavior, right? Increasing the rewards will increase the desired behavior. But it is not as easy as it sounds. The challenge is that extrinsic rewards potentially erode intrinsic motivation. For example, people often have hobbies to improve their abilities. But when someone is paid to do a hobby, it’s no longer a hobby. The person no longer does the tasks to improve his skills, and does no longer have the autonomy to perform the task exactly as he wants to. Due to this, the users are likely to stop contributing as soon as they don’t get rewards for it. Or even worse, they’ll lose interests in the rewards and then have no motivation to continue. In other words, extrinsic rewards can give a short-term boost in motivation to participate, but is not enough to provide long time loyalty. Thus, there is a need to strike a healthy balance between extrinsic and intrinsic motivation. Besides being more sustainable, intrinsic motivation is a lot cheaper than having to pay users for everything. 5 Tactics for Increasing Intrinsic Motivation in Your Community Now that we know balance is crucial, I thought I would throw out some ways you can help nurture this balance. It is worth noting that there does not exist a strict borderline between intrinsic and extrinsic motivations, as tactics often affect both. The aim of the following tactics is to help communities rely less on “hard” extrinsic rewards such as money, and more on “softer” forms of motivation. 1. Commitment Have your users make a commitment to perform the desired actions. If you run a patient network, ask the user how many questions the user thinks he’ll answer a month. If you run an ecommerce site, ask the user if he’d “ever consider helping other users by rating a product he has purchased“. If you do, this will make the user motivated to honor the commitment. Threadless used this practice embedded in their design rating. When giving a design top rating, you can mark that “I’d buy it” either as a t-shirt or a print. 2. Social comparisons It’s human nature to better understand where we stand compared to our competition. Allowing users to compare their abilities and opinions to others is a powerful drive for many people. Especially when comparing to similar others. One often seen implementation of this is leaderboards.But this is not the only possibly implementation: You can send out emails in which users’ effort is compared to the median score of the community and/or similar others (e.g. other users who signed up at the same time). A recent study on MovieLens found that “after receiving behavioral information about the median user's total number of movie ratings, users below the median demonstrate a 530 percent increase in the number of monthly movie ratings, while those above the median decrease their ratings by 62 percent”. This indicates it would be highly effective to email the users below the median, but not those above. 3. Social learning When users are new in a community, they often don’t know what to do. Highlighting desired behavior of successful users will make it easy for users to see what they should do. This is what Facebook does when showing that your friends are connecting to new people. You can do the same by prominently highlighting desired action whenever existing users perform these actions. For example, Flickr wants users to upload, tag and geotag pictures. On the home page, the number of uploads, tags and geotags are highlighted. As a new (or existing user), you know which action will contribute to the community Alternatively, ask employees to engage actively in the community and serve as role models for the community members. E.g. rate products yourself, post comments to blog posts, ask questions in the Q&A etc. 4. Praise Despite the (flawed) assumption that people are always driven by self-interest, most people actually like to help each other. An obvious way to facilitate praise is to let users express gratitude easily and give each other rewards can help motivation. On the SEOmoz Q&A Forum a questioner can mark an answer as “Good Answer”. But humans are not the only ones who can give praise: so can your website. Although the effect of getting praise from a human is bigger than getting praise by a “machine”, the praise still has an effect. For example, the Mailchimp monkey is letting users know when an email has been sent out. But it could also praise users for creating a new list, sending out newsletters etc. Don’t have a fancy mascot like Mailchimp? Don’t worry. You can just do like Tumblr: say that your user is great! It’s simple, but it works. 5. Mastery One of the key components of intrinsic motivation is mastery. It is often hard to know if you are on the right way to mastery, so help is needed. A good way to do this is to let the user get a sense of his progress. An effective way to do this is by letting the user compare current performance to past performance. This practice is being applied on Casey's mozpoints.com – a microsite that collects historical data on the thumbs up / thumbs down received on SEOmoz. There are obviously many different ways to motivate people to participate online. There can be derived many different tactics from social psychology literature than those mentioned here (See for example Rand's Illustrated Guide to Cialdini's Science of Influence and Persuasion). But these can hopefully be a beginning in striking a better balance between extrinsic and intrinsic motivation. Thinking of attending a conference anytime soon? You should definitely check out the Distilled Pro Seminar in Boston 16th/17th May and the SEOmoz Mozcon in Seattle July 27th - 29th. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Tactics to Improve Your Community Balance"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Tactics to Improve Your Community Balance"
    },
    {
      "level": "H2",
      "text": "Extrinsic vs. intrinsic motivation"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "The effects of tangible rewards (and why it's not sufficient)"
    },
    {
      "level": "H2",
      "text": "5 Tactics for Increasing Intrinsic Motivation in Your Community"
    },
    {
      "level": "H3",
      "text": "1. Commitment"
    },
    {
      "level": "H3",
      "text": "2. Social comparisons"
    },
    {
      "level": "H3",
      "text": "3. Social learning"
    },
    {
      "level": "H3",
      "text": "4. Praise"
    },
    {
      "level": "H3",
      "text": "5. Mastery"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Thomas Høgenhaven\n          \n            Thomas Høgenhaven\n          \n            Thomas Høgenhaven"
}