{
  "url": "https://moz.com/blog/5-tips-for-seo-businesses",
  "slug": "5-tips-for-seo-businesses",
  "title": "5 Tips for SEO Businesses - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Todd has some good references on operating your SEO business and I thought, in the spirit of teamwork, I'd address the same topic today with some recommendations of my own. Below is my own list of suggestions, based on experience (in both failure and success):\n\nDon't Underestimate your Value...",
  "content": "5 Tips for SEO Businesses Public Relations By: Rand Fishkin November 7, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 7, 2005 5 Tips for SEO Businesses Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Todd has some good references on operating your SEO business and I thought, in the spirit of teamwork, I'd address the same topic today with some recommendations of my own. Below is my own list of suggestions, based on experience (in both failure and success): Don't Underestimate your ValueTodd notes how hard it can be to tell a client that you charge $50/hour for your services. For a competent SEO, whose skills and knowledge can quickly help a site achieve significantly more traffic, this figure is dreadfully low. Recognize first that knowledge is your primary asset in SEO - don't cheapen it. The ROI achieved by implementation of solid SEO advice is exceptionally high - both you and your clients should recognize this and be aware that hiring a $50/hour consultant who claims to know how to optimize a site will, more often than not, turn out badly._ Be Aware of Your New Client ChannelsSEOmoz gets much of its consulting business through attending SES conferences, posting on the SEO forums and word of mouth. You should have a clear idea of where your potential clients are coming from and focus on spending time developing and building those channels. Make sure you're never too busy to continue to be visible to new business._ Invest in Your AppearanceIn Todd's post, he mentions suits and ties. I take that a step further. A well-tailored suit, a beautiful dress shirt and a robust, distinct wardrobe and style shows far more than sartorial taste; it shows that you give respect to those who meet you. I have always found that people who value themselves and the impression they wish to give will dress accordingly. You don't have to go to Barney's; stores like Nordstrom, Banana Republic and Club Monaco (in malls nationwide), can provide a solid foundation in dress shirts and slacks. If you are getting a suit - make it a good one. I personally have far more respect for a well dressed man or woman who lacks a suit, rather than one who's just been to the Men's Warehouse for a $200 suit. A cheap suit stands out like a whale in a school of minnows._ Reach out over the PhoneIf you're not comfortable conducting business over the phone, you're not ready to conduct business. I recognize that programmers and the technically apt are often those who prefer indirect contact. However, when you take the step towards running your own business, you have an obligation to have a phone number on your site and the ability to listen, advise and speak intelligently to your clients. Especially in a business where we often never meet our clients face-to-face, voice contact builds relationships - and it is in relationships that real value is built in business._ Don't Sell Yourself - Make Yourself AvailablePromotion and in-your-face marketing may work for cheap beer and skin firming products, but in business consulting, having a busy firm that can make room for the right kind of client is far more valuable than having a hungry firm, desperate for new clients. At SEOmoz, this came to us naturally, as our existing clients take up 90% of our schedule. Do the same with your own business - invest in projects to create your own sites and content or partner with colleagues or friends at first, and the clients will flow more naturally. I'll try to offer some more tips in the near future, but alas, I have more posts this morning that need publishing (and plenty of real work to get to as well). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Tips for SEO Businesses"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Tips for SEO Businesses"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}