{
  "url": "https://moz.com/blog/5-unique-ways-to-find-blog-post-ideas-for-even-the-most-painfully-boring-industries",
  "slug": "5-unique-ways-to-find-blog-post-ideas-for-even-the-most-painfully-boring-industries",
  "title": "5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's no fun coming up with blog ideas in those boring industries outside of SEO and marketing. You know what I mean, the 'real' world of forklifts, car dealerships, garden furniture and bedding. Even when coming up with new content for your own blog, in your own specialty niche, sometimes it can be…",
  "content": "5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries Blogging By: Joe Davies June 25, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Joe Davies June 25, 2013 5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It's no fun coming up with blog ideas in those boring industries outside of SEO and marketing. You know what I mean, the 'real' world of forklifts, car dealerships, garden furniture and bedding. Even when coming up with new content for your own blog, in your own specialty niche, sometimes it can be a bit tough. With our blog writing service, every day we are faced with coming up with 10-20 blog post ideas for clients in a number of diverse industries. Sometimes the industries are quite nice and easy, like Mobile phones or SEO, but more often than not we are coming up for blog post ideas for companies in industries that are not as ‘interesting’. No offence intended. In this post I hope to share with you how we tackle this problem when we are brainstorming content ideas, so you too can always come up with blog post ideas on a whim, even on those really uninspiring rainy days (we get a hell of a lot of rain in the UK). 1. Magazines When we are doing a weekly shop for the office, we always have magazines on the checklist. Yep. Milk. Biscuits. Teabags. Coffee. Sugar. Water. Magazines... We buy all kinds of magazines, from gossip magazines, arts and crafts, gardening, technology, mens and cooking. Why? Because we’re interested in the latest gossip? Well, yeah, but the main reason is much more professional: Magazine topics and headlines are brilliant for blog inspiration. Is this saying we just plagiarise the magazine and use their ideas? No... of course not. But they do spark off some great ideas of what we can talk about in our blog posts, and it lets us know the kind of stuff the people in that particular industry want to read. For example, let’s say we have a client who sells garden furniture. Now, I’m not going to brainstorm ideas exclusively about ‘garden furniture’... how boring would that be? The breadth of the industry should be covered to make an interesting blog. Because it’s a garden industry client, I have decided to pick up the gardening mag and have a flick through that. Take this article I have stumbled across below. ‘Really fast growers!’ which is basically about the fastest growing plants...interesting. So now it has sparked me off on some interesting blog post ideas such as: Magazine credit: http://www.amateurgardening.com/ “The 7 Fastest Growing Plants For Your Garden\" In A Hurry? Check Out These Fast Growing Plants & Flowers. Fast Plants: Plants That Grow At An Extraordinary Speed With some research I can find enough information and data sources to come up with an amazing blog post, that will not only interest the gardening community, but will be educating as well. This is great for the brand, because even if they only sell ‘garden furniture’, they are getting brand awareness through their generous education. 2. Word Association Games Sometimes a great way to come up with content ideas is to start doing some word association. I used to play word association games when camping as a kid, and I’m sure it’s something my parents used to play with me to keep me occupied on long car journeys. Little did I know I would be using the very same methodology for blog post ideas! Now, a great way to do this is with other members of your team, where basically one of you starts with the ‘root word’. This could be the industry you or your client is in. Then, the next person says something related to that root word. So it might go a little like this: SEO, Link Building, Marketing, Advertising, Copywriting, Writing, ...and so forth. You need to be careful you don’t get too far away from your root word, but by getting ‘out the box’ in terms of content ideas, you can explore some similar and complementary areas to your clients root sector. You see, I started with SEO, but ended up on copywriting and writing. This is definitely something SEO’s could be interested in. For example I could conjure up a post idea like... “Copywriting 101 For SEO’s” “An SEO’s guide to creative writing” With something like the above I could explore these topics further and maybe come up with some more appetising titles but you get the idea. If you don’t have any teammates, or friends you can play this word association game with, you could do this yourself with a bit of pen and paper. This looks a little like a mindmap, or notes from a brainstorming session, which I suppose work kind of the same way, but what we’re doing here is emulating the word association game on paper. As you can see, I’ve started with my seed word ‘gardening’, as my imaginary client sells ‘garden furniture’. So I’ve gone and put some related words around my seed, then added some further words where I can. When you’ve got a few words on your page you can start to conjure up some blog post ideas. You’ll see I’ve scribbled a few on the page. From plants I’ve got a couple of branches coming off: “Largest Plants” and “Strange Plants”... so I could start plotting out a blog post like: “The World’s Largest Plants” or “The Strangest Plants Ever Found [Weird]” So instead of writing boring posts on my garden furniture clients site about ‘How To Assemble Your garden Furniture’ or ‘The Top 10 Garden Furniture Arrangements’, I’ve got out the box a bit... because people buying garden furniture aren’t interested in garden furniture... they’re interested in Gardening. 3. Borrow Some “Interestingness” From Other Industries We briefly covered this in one of our blog posts earlier in the year. Sometimes you just can’t get much “interestingness” from yours or your clients industry, so the best thing to do is borrow some interestingness from another industry. What do I mean by this? Well, let’s go with gardening again... The industry is gardening and you have exhausted all avenues of that topic for blog posts, now what? Try using another industry like Technology, Apps, Software, Celebs or Gadgets to spark some more blog post ideas. “Gardening Technology in 2013” “Top 5 iPhone Apps For Beginner Gardeners” “Manage Your Garden From Your PC: Gardening Software” “Celebrity Gardens: How Does Yours Match Up?” “5 Low Priced Gardening Gadgets That Will Save You Tons Of Time” As you can see I’ve come up with a number of ideas their just by cross referencing another industry. Try this with your industry or one of your ‘boring’ clients, and see how many new and cool blog post ideas you can conjure up! 4. Use “Flipboard” Flipboard is a great way to come up with blog post ideas because 1, it gets you away from the desk (it is only available on tablets and mobile devices) and 2, it’s really intuitive to use, flipping through articles on a given topic can really do great things to ignite the brain! It’s available on both the iTunes store and the play store and is completely free. It’s kind of like an RSS reader, but instead it works based on topics you give it, and you can build your own boards. I use it at least once a day to digest some startup, marketing and SEO stories, yeah I made my own board for that! For the purpose of blog post ideas, what we are interested in here is the search function. Using your seed topic of your industry, once the app is installed on your device, you can do a search, and find all the latest stories from all over the web about that given topic. Above you can see a screenshot of my iPhone doing a search for gardening on the Flipboard. After doing this search I’ll be able to see lots of gardening stories from across the web for gardening. This is great to spark ideas. My favourite way to use Flipboard is away from the desk on an iPad because as John Le Carre once said, “A desk is a dangerous place from which to view the world”. It gives your head some space and you can really just start enjoying some of the topics going round on the web about the particular industry you’re looking to get post ideas for. As you can see on the picture above there are some great ideas there on Flipboard for iPad, just from a simple search... I recommend you try it out. 5. Spammy Traffic Sharing “Curator” Sites I don’t know the correct term for these sites, but I sometimes stumble across them when I get lost in the web. I bet you’ve come across a few yourself. They are basically sites about socially interesting topics like celebrities, strange unbelievable things, far out crazy stuff... you know the type of sites I mean. Sometimes they just curate a story, and it sends you off to another site. They do a lot of traffic sharing, and make money from ads. I’m not 100% sure of their model, but this is what I’m guessing. I can’t help but stay and look around at the amazing titles they come up with. I have even bookmarked a few of the sites to go back and get inspiration for some ideas. Now, these sites won’t help you with coming up with the actual content for the posts, but they will give you some great title ideas. The guys that make these sites and title ideas are pretty clever. They know what makes people click, and click, and click.. It’s kind of what they have to be good at to make their ads pay. Website credit: http://www.zergnet.com/ As you can see from this site here (I don’t want to link to them from Moz, but will provide some ways to find them at the end of the post) there are some great post title ideas. “Beyonce Morphs Into A Frightening Alien Monster” “All the PS4 Specs You Need to Know” You could ‘borrow’ the format of these titles for your own blogs... maybe not the Beyonce monster one... but what a title!? Sure, the actual content of these articles are not exactly what they promise, most of the time they are really disappointing, but you can’t knock the titles! Here’s another site... “10 Most Shocking & Disturbing Celebrity Couples” “25 Movie Scenes You Won’t Believe Were Unscripted” These guys know what makes people click. Get inspired by the format of these posts and use it for your own blog ideas. Some Useful Links Thanks for reading this post, if you got this far, I guess you must have found it useful and interesting, and that really makes me smile :) I've got a few links to share with you now, to help you further on your blog post inspiration quest: Flipboard Content Strategy Generator tool V2 by SEOGadget Find the spammy curator sites that use great titles (Google search 1) Find the spammy curator sites that use great titles (Google search 2) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries"
    },
    {
      "level": "H2",
      "text": "1. Magazines"
    },
    {
      "level": "H2",
      "text": "2. Word Association Games"
    },
    {
      "level": "H2",
      "text": "3. Borrow Some “Interestingness” From Other Industries"
    },
    {
      "level": "H2",
      "text": "4. Use “Flipboard”"
    },
    {
      "level": "H2",
      "text": "5. Spammy Traffic Sharing “Curator” Sites"
    },
    {
      "level": "H2",
      "text": "Some Useful Links"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joe Davies\n          \n            Joe Davies\n          \n            Joe Davies"
}