{
  "url": "https://moz.com/blog/5-warning-signs-of-a-bad-seo-client",
  "slug": "5-warning-signs-of-a-bad-seo-client",
  "title": "5 Warning Signs of a Bad SEO Client - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I just walked away from a lot of money. After two months of research, proposals, and negotiations I turned down a deal that would have brought my freelance income to a new level. But I would have been miserable. My prospective client had no shortage of funds. There was nothing shady about their…",
  "content": "5 Warning Signs of a Bad SEO Client SEO Consulting By: Josh Sturgeon June 15, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Josh Sturgeon June 15, 2011 5 Warning Signs of a Bad SEO Client SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I just walked away from a lot of money. After two months of research, proposals, and negotiations I turned down a deal that would have brought my freelance income to a new level. But I would have been miserable. My prospective client had no shortage of funds. There was nothing shady about their business. I just didn't want to deal with them. I used to say \"yes\" to everything. I took on any client that would sign on the dotted line. In my zealousness to build a business, I neglected to find the \"right\" clients and settled for anyone who would cut a check. This led to sleepless nights, wasted time, and poor results. In my opinion, a successful business deal isn't just getting paid. Success is when both parties (client and consultant) can agree on realistic goals; once those goals are met, both are satisfied with the results. You are the professional. You know what will work and what won't work. If you give the client whatever they ask for, it's not going to help their business in the end. Learn how to balance input from the client about their industry and business goals with a reasonable plan of action that you produce. Value your time...and the client's. In my recent experience, I made the mistake of conducting keyword research and competitive analysis for free. I did this as an act of good faith, since there was a lot of business on the table. But without any skin in the game, the prospective client was indecisive and nit-picky over just about everything. TAKEAWAY: If you are in negotiations and want to sweeten the deal, charge for your research upfront. If the client signs, then you can credit a percentage of that fee towards the first month of their bill. Treat it like a deposit. Essentially, my prospective client wanted me to act as an SEO machine, where he remained firmly at the controls. He wanted a puppet that he could manipulate based on tips he's read online (but never actually implemented). Not a road I wanted to take. In spite of this lost opportunity (or avoided disaster depending on how you see it), I have come away with a short list of red flags, which I'm hoping will protect you from getting involved with clients who will waste your time and energy. Seriously, sometimes the paycheck really isn't worth the blood, sweat and tears you will invest. 5 Warning Signs of a Bad SEO Client: They name-drop books, blogs, and other SEO-related materials in nearly every conversation. They insist on web design gimmicks that detract from the user experience. They demand results on an unrealistic time table. They protest your rates on the basis that there are, \"tons of SEO software options available on ClickBank for $97\". They ask for keyword research and then override your findings with their \"sense\" of what their firm should rank for. Looking forward to hearing your additions to this list!p.s. from Rand: This post got a lot of positive reactions, and has some great comments, too, so we're sending it to the main blog. I can empathize here myself, having run a barely-scraping-by consulting business for the first 6 years of my career (1999-2005). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Warning Signs of a Bad SEO Client"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Warning Signs of a Bad SEO Client"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Josh Sturgeon\n          \n            Josh Sturgeon\n          \n            Josh Sturgeon"
}