{
  "url": "https://moz.com/blog/5-ways-to-get-your-client-to-like-you",
  "slug": "5-ways-to-get-your-client-to-like-you",
  "title": "5 Ways to Get Your Client to Like You (and get bigger budgets along the way) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Building a solid foundation and gaining \"likeability\" with your clients can sometimes be the difference between a failed or successful project. Check out these five tips to help boost client relationships and build partnerships that will last a lifetime.",
  "content": "5 Ways to Get Your Client to Like You (and get bigger budgets along the way) SEO Consulting J By: Julianne Staino November 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Julianne Staino November 5, 2012 5 Ways to Get Your Client to Like You (and get bigger budgets along the way) SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Do your clients like you? We’d all like to say “yes,” but have a think for a minute. Do they really, honestly and truly, like you as an SEO and as a person? Although thinking about your \"likeability\" factor may bring back good or bad memories from high school, it is something that can greatly affect your work relationships and the success of a project. Some of you may be thinking that it shouldn’t matter, and that your work will speak for itself. I'm here to tell you that a mindset like that will get you tossed whether it’s in a month or a year of working together. Don’t believe me? Story time: While working as a consultant, I’ve been a part of meetings where, when a potential client is asked why they’re coming to us even with their metrics up and to the right, they’ve responded with a simple, “We just want to see what else is out there.” This indifferent statement threw me for a loop. How could a company not be happy and satisfied with “success?” Then it hit me: no matter how hard you work, if your clients don’t like you, really and truly like you, you’re gone. But don’t get discouraged yet! Not all successful projects (or even failed projects) are a lost cause. There are some simple project management skills and tasks that can get your clients to like you more and keep you around for a longer period of time. Let’s get the love fest started: 1. Hit the ground running The beginning of any project can be an exciting, yet rocky time. First impressions matter, so don’t ruin yours by dropping the ball. I often like to start my projects by delivering a “Quick Wins” piece in the first few days. This piece aims to identify issues on the site that will take minimal resources to fix and will have a big impact. Don’t worry about making this an involved piece that takes a lot of time to complete. The point should be to show your new client that they made the right decision by bringing you in, and to keep them busy for a week or two! Why they’ll love you: You get stuff done quickly. You’ve already identified big opportunities. Confirmation they made a good decision by bringing you on. 2. Pre-deliver and collaborate If you do not currently pre-deliver some of your work and collaborate with your client, you are doing it wrong. Why would you want to spend an exorbitant amount of time and energy on a piece of work that your client will later tear to shreds if it’s not what they were looking for, or isn’t plausible for them to implement? Save yourselves a huge headache and take the guesswork out of it early. By emailing your point of contact along the way, you’ll get many opportunities for feedback. Additionally, by pre-delivering, you can ask the client if there is anything they’ve been trying to get buy-in for or pushed through. If so, include it! (If it makes sense and it’s a good idea, that is. By helping your point of contact get something pushed through, you’ll most definitely gain some loyalty points.) Why they’ll love you: They’ll feel included in the process. You delivered pertinent recommendations and confirmed what a great idea it was to bring you in. You helped get one of their objectives pushed through quickly. 3. Call your client Don’t let Carly Rae Jepsen tell you otherwise. There’s no maybes about it, call your client. The ghost of SEO past, Tom Critchlow, taught me early on that communication solves all problems, and he is 100% right. The simple act of picking up the phone and calling a client unannounced has resulted in some of the most rewarding and insightful calls I've experienced. Unscheduled calls can give you and your point of contact a chance to just talk. No agenda. No one else interrupting. You can speak freely, and sometimes you’ll even get your client to open up about their own frustrations, ambitions, etc. These impromptu sessions can turn into a great bonding sessions for you and your client. Why they’ll love you: Calling them out of scheduled time shows you care. You share the same project pains, so you can work together to find a resolution. 4. Visit your client and take them out for beers This little project management, get-my-client-to-love-me-tip is a bit more involved, but has a big effect. Not being able to meet your client face-to-face is a strange thing if you think about it. You simply become a voice on the other side of the phone. If you really want to win over your client and get them to like you, schedule a trip to visit them or tie it in with conference traveling, vacationing, etc. Meeting your client and looking them in the eyes can work wonders. While you’re there, you should most definitely take some sound advice from Paddy Moogan and take your client for a drink. Nothing says, “Hey, I’m a great person even outside of work,” than taking your client for a beer. Similar to calling them unscheduled, you’ll most likely get a new perspective on some issues they are dealing with and get to know them outside of just work. Why they’ll love you: Visiting them in person shows commitment. You’re fun! You have a life outside of work so show them a little more of who you really are (you may even have things in common!). They’ll have a face to put to a name and have more of a connection to you. 5. Do work they haven’t asked for This last bit may have people be thinking, “Why would I voluntarily do work for free?” Well, if you really want to go above and beyond for your client, then you’re gonna have to throw the dog a bone and do some extra work. Whether it’s completing an extra competitor analysis or outreaching to a blogger who forgot to put in a link, you’re showing your client that it’s not just what’s in the contract that matters. It’s truly seeing them succeed that counts. Additionally, this is a great opportunity for you to show them a bigger project vision. If your project is set up for a smaller engagement, you can naturally up-sell your client and get them excited about what else you can do achieve together. Why they’ll love you: You did “free” work. You took some initiative for the betterment of the client. You’ll open their eyes to bigger opportunities. Will my clients like me? That’s the goal! But, in all seriousness, the sign of a good consultant is someone who can build strong relationships and deliver quality work. Often times we forget the former by getting to bogged down in work. SEO is easy. Consulting is hard. Remember to come up for air and say hi to your client, because, who knows, it could save your project if the timing is right. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Ways to Get Your Client to Like You (and get bigger budgets along the way)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Ways to Get Your Client to Like You (and get bigger budgets along the way)"
    },
    {
      "level": "H2",
      "text": "1. Hit the ground running"
    },
    {
      "level": "H2",
      "text": "2. Pre-deliver and collaborate"
    },
    {
      "level": "H2",
      "text": "3. Call your client"
    },
    {
      "level": "H2",
      "text": "4. Visit your client and take them out for beers"
    },
    {
      "level": "H2",
      "text": "5. Do work they haven’t asked for"
    },
    {
      "level": "H2",
      "text": "Will my clients like me?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Julianne Staino\n          \n            Julianne Staino"
}