{
  "url": "https://moz.com/blog/5-ways-to-spend-2000-on-seo",
  "slug": "5-ways-to-spend-2000-on-seo",
  "title": "5 Ways to Spend $2000 on SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mike's conversation on push vs. pull SEO continues at Clickz today. He's specifically seeking input on how Mom & Pop sized businesses can utlilize the services of SEO with a very limi...",
  "content": "5 Ways to Spend $2000 on SEO Public Relations By: Rand Fishkin January 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 23, 2006 5 Ways to Spend $2000 on SEO Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Mike's conversation on push vs. pull SEO continues at Clickz today. He's specifically seeking input on how Mom & Pop sized businesses can utlilize the services of SEO with a very limited budget. I thought that, being responsible for some of this heated debate, I'd open up with a few options for the budget minded business seeking SEO. First off, before pursuing any of the solutions below, I'd read the beginner's guide to SEO, this list of search engine ranking factors and join the Cre8asite forums. I suggest these steps to almost everyone I talk to or email nowadays. Once you've undergone those, here are some options you can use your $2000 on: The Ultra-Low-Budget Option Buy Steve Krug's \"Don't Make Me Think\" - $23.10 Buy Aaron Wall's \"SEO Book\" - $79.00 Buy an old copy of Dreamweaver ~ $81.00 Build and Promote yourself - Free in $$, Expensive in Time The Link Lover's Option Buy a month of service from Andy Hagans ~ $1000 Get Greg Jarboe to send out a one-shot Press Release ~ $700 Get a Yahoo! Directory Listing - $299 Consulting Options Get a Site Review & Link Recommendation Report from Barry Welford Alan K'Necht David Wallace Simply implement the suggestions :) The Slightly over $2000 Options Scottie Claiborne's Site Review - $3000 Debra Mastaler's Custom Link Building - $2500 Patrick Gavin's Link Building Services ~ $2000 The \"Link Bait\" Option Get one GREAT idea for a tool, service, resource or page - bounce it off some folks in the forums (or privately through email to an SEO you trust) Hire a developer who can help you build it - my choice is to use Craigslist - post with a budget of $2000 SEO doesn't have to be expensive and while having a budget certainly makes the task easier, I'm sure that the readers here will come up with even more options. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Ways to Spend $2000 on SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Ways to Spend $2000 on SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}