{
  "url": "https://moz.com/blog/5-ways-to-prove-to-the-client-that-the-traffic-will-come",
  "slug": "5-ways-to-prove-to-the-client-that-the-traffic-will-come",
  "title": "5 Ways to Prove to the Client that the Traffic Will Come - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "White-hat tactics are more important than ever, but any good SEO knows they take time. Here are five techniques to convince impatient clients that your hard work will eventually pay off.",
  "content": "5 Ways to Prove to the Client that the Traffic Will Come Marketing Industry By: James Harrison August 5, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: James Harrison August 5, 2013 5 Ways to Prove to the Client that the Traffic Will Come Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post is dedicated to those hard-working white-hat SEOs helping websites obtain top search engine rankings the right way. Sometimes we have to remind the client that slow and steady wins the race. However, the majority of the time the client doesn't want to hear that, especially if they are paying for SEO services month after month. Yes, SEO is an investment; however, showing them that they are investing in your services and skills requires a little more than just performing SEO services. Due to the search share click distribution, the client can’t really expect major increases in traffic until they reach the first page of the SERPs. Sometimes they can see instant increases in traffic via long-tailed terms after completion of thorough on-page optimization. But, for the most part we have to educate them so that they will be patient. Remember, they hired you because they are not experts in SEO, it’s important to teach them the benefits as well as the slow process of organic SEO. Below are five things you can do to help your client rest assured that you are doing an effective job, and with time, traffic will come. #1 – Rankings reports and keyword improvements This is kind of a given, because traditionally all we could do is show the client that we helped them go from the 100th position to 50th position. That almost never reflects more traffic, but it does show improvement. It also shows effort, and if you get two consistent upward movements, you can show that there’s a trend in their favor. Another keyword improvement you can show them is total keywords bringing traffic to their website in Google Analytics. If you go to Sources > Search > Organic, then scroll down to bottom right, you can see how many total keywords have brought traffic to their site in the current date range. If you change the date range to a range pre-SEO work and that number is smaller than the most recent, you can say that you are increasing their overall visibility. So, if you can show improvement in rankings and that they are getting more organic traffic via more keywords on the SERPs; you are showing them that they are making progress. For most clients, this is enough. #2 – Working logs Every once in a while, a client may want some updates on how the SEO is going because they aren't seeing an increase in traffic or conversions. In other words, they want to know what you have been doing. I recommend recording all work you've done for the client regardless of the complexity and time it took. Create events in Google Analytics or your SEO tool software. These are easy ways to document your work while showing correlations with traffic. Another way I've satisfied my clients is having something like BaseCamp or a time tracker that they can sign in to and see what has been accomplished. Behind the scenes, we know things are going good and we know that we are doing work to get those rankings up, however the client doesn't. Anything you can do to allow the client to check on what you've done for them, whenever they want, can sometimes prevent emails or phones calls questioning your efforts. #3 – Summary reports and updates Sometimes, emailing the client or getting on the phone with them weekly or bimonthly is all they need. When you reach out to the client before they reach out to you, you are squashing embers before the fire starts. It shows them that you are proactive and more importantly that you haven’t forgot about them. Emailing or calling them just to let them know that you've accomplished something or that you were thinking about them while working on their account can go a long way. I believe this is arguably the most important thing you can do to build long term relationships with your clients. It can be something as simple as \"Hey, I just wanted to let you know that we wrote up some content, emailed a few webmasters and been working on your rankings. Just an FYI, give you more details in the monthly report.\" This communication can make a client’s day and maintain their trust for you and your services. #4 – Other metrics to report Assuming that you are doing your job, you can report other metrics to the client if rankings and traffic have not kicked in yet. Metrics such as total links contacted out of total link goals, total tweets, fans, +1s, shares, pages per site visited, site bounce rate, conversion rate, total live links, subscribers, etc. Anything that will show them that the website is doing better than when you started. However, in order to provide these types of stats, you have to create a benchmark to show how where they are now is better than where they started. #5 – Resources vouching that SEO takes time In the case that the client is still skeptical and the results are not yet able to prove your work, the best thing you can do is show them that even the authorities such as Search Engine Watch, Moz, Search Engine Journal, Google, etc., all confirmed that rankings don't happen overnight. Perhaps you can do a better job educating them about the fact that it’s a campaign to catch up with the competition; that the competitors who are ranking high have performed a long list of tasks over years to get to where they are, and you are emulating them in the most efficient way possible. So... ...there you have it, five ways to let the clients know that you are doing what needs to be done in order to obtain top rankings. Just don’t forget that the client may still need to trust that the tasks you are accomplishing actually works. So you may have to prove to them that your strategies have helped other clients, or that you are doing what the algorithm, case studies and the competition proves needs to be done. I hope this helps my fellow white-hat SEOs performing legit services keep good relationships with their clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Ways to Prove to the Client that the Traffic Will Come"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Ways to Prove to the Client that the Traffic Will Come"
    },
    {
      "level": "H3",
      "text": "#1 – Rankings reports and keyword improvements"
    },
    {
      "level": "H3",
      "text": "#2 – Working logs"
    },
    {
      "level": "H3",
      "text": "#3 – Summary reports and updates"
    },
    {
      "level": "H3",
      "text": "#4 – Other metrics to report"
    },
    {
      "level": "H3",
      "text": "#5 – Resources vouching that SEO takes time"
    },
    {
      "level": "H3",
      "text": "So..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Harrison\n          \n            James Harrison\n          \n            James Harrison"
}