{
  "url": "https://moz.com/blog/50-perfect-gifts-for-webophiles-bloggers-internet-marketers",
  "slug": "50-perfect-gifts-for-webophiles-bloggers-internet-marketers",
  "title": "50 Perfect Gifts for Webophiles, Bloggers, & Internet Marketers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With Cyber Monday just wrapping up, it's time to start for all of us procrastinators to get to work finding the perfect gifts for the geeks in our lives. Luckily, Mystery Guest and I have been doing some browsing around this year, and figured we'd share our favorites from around the web. Frankly,…",
  "content": "50 Perfect Gifts for Webophiles, Bloggers, & Internet Marketers Moz News By: Rand Fishkin November 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 27, 2007 50 Perfect Gifts for Webophiles, Bloggers, & Internet Marketers Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With Cyber Monday just wrapping up, it's time for all of us procrastinators to get to work finding the perfect gifts for the geeks in our lives. Luckily, Mystery Guest and I have been doing some serious browsing this year, and figured we'd share our favorites from around the web. Frankly, I've been really disappointed with the standard geek gift guides from places like Engadget, Wired, and Amazon, so we just had to make our own. Unlike those mainstays, there's a lot of variety here - not just the standard Wii and iTouch crap. No. We've actually scoured the four corners of the web to come up with some really creative, innovative gifts that aren't on everyone else's must-buy list. If you want to be a champ and stand out from the crowd, this should really help. The other great part - most of this stuff is under the $50 mark, so no need to get super-splurgy if you're still paying off your AdWords account :) 1. The Tokidoki Mozzarella Moofia Gang Leader Everyone needs some desktop toys, and this is probably TokiDoki's best execution on a concept. $29.95 2. The Plastica Bento Box For those of us who have to eat lunch at the office for days in a row, a fancy Korean-style bento box is just the ticket. $38.00 3. The Monty Python Cow Catapult Deluxe Set In my experience, programmers, designers, & SEOs in particular are in love with Monty Python's Holy Grail. This toy is subtle, yet effective :) $30.00 4. Bookmarks Made from Recycled Circuit Boards Even if you're not into recycling, using old circuit boards to mark your place is hip. $8.00 5. Hard Drive Desk Clock Yes, it's very geeky, but it's also a nice reminder that time runs out on all hard drives....so for goodness sake, back up your files! $29.99 6. H-Racer and Hydrogen Station How cool is it that this toy actually runs on water? Very, very cool. $99.95 7. The Sun Jar If you're anything like those of us at SEOmoz, you desperately need more sunlight in your life. Seriously, in Seattle tonight, it was dark by 4:20pm. Practically intolerable. $44.00 8. Koffski Junior Gun-Shaped Wallet Yes, it's very expensive, and it will probably get you into huge trouble with airport security. However, it's probably worth it to look like a mob bodyguard everywhere you go. $265.00 9. Dosh Compartment Wallet I know, I know, two wallets in a row. This design was just too cool to pass up, though, and the price is much more affordable. $60.00 10. Demotivator Calendars Yeah, they've been around for years, but they're still a great gift to give. I've seen at least 3 people receive these and everyone loves 'em to death. Somehow, the irony never fades. $16-$110 (depending on size & framing) 11. Silicone Travel Bottles These handy little buggers are regulation size to go in carry-on, so store the sundry liquid of your choice and breeze on through security in true geek style. $20.00 12. The Onion's Gotcha Gift Boxes Fake gifts are hilarious... Just make sure you get them something else, too. $17.99 13. Shark Attack Silver Necklace We had to include some sort of jewelry, but this one's overboard (oh, the puns). Shark attack necklace = surefire conversation starter. $30.00 14. Personalized Sharpie Pen Since you can create your own message on the pen, this becomes a really cool gift. We think \"Do not attempt to write on this lettering\" makes for a nice gag. $12.00+ 15. Dart Shaped Coat Hooks What's great here is that the darts appear to simply be embedded in the wall, but unlike the set at that bar you got thrown out of in Memphis, they're supposed to be. $34.00 16. Grabbing Hand Shaped Wall Mounted Hook Kinda eerie, right? I think this would go best in a place where you'd least expect it, like at knee level in the kitchen. Or maybe just at the entryway, where envious guests will stare in horror as you grab your jacket off the \"hook.\" $76.00 17. Offering Hand Shaped Wall Mounted Shelf/Hook If you're not into creepy hands emerging from the wall to grab things, how about creepy hands emerging from the wall to offer things? $76.00 18. Sleek LCD Bathroom Scale & Pedometer Seriously - no judgment calls here. I just know how much web workers like to stay in shape :) $84.99 19. Voodoo Human Modeled Knife Holder Voodoo dolls are cool, but this one's useful and re-usable. That, and it's your chance to stab someone several times a day with no repercussions. $69.99 20. Credit Card Bottle Opener Bottles stand no chance against what's in your wallet. The slickness of this move is guaranteed to have people saying \"wow, you're really geeky, huh?\" as they break their teeth or belt buckle. $26.00 21. MOMA Georgio Fedon Business Card Case Truly stylish, and quite useful, particularly when traveling to Asia on business, where etiquette demands the respect of business cards. $24.00 22. NPR Map I've noticed that a lot of people in the field of web search are huge NPR fans. This map is a little less useful than humorous, but still a great gag gift for the NPR junkie. $7.50 23. Magnetic Desk Dots Possibly one of the coolest and most multi-functional desk accessories around that's still mostly a toy. I can imagine spending hours of phone consultation time playing with these guys. $19.95 24. Star Wars Princess Leia T-Shirt We needed a few female-specific items, and Mystery Guest thinks this t-shirt from Delia's is a must-have. Strong in the force she is. $24.50 25. Solar Laptop Battery Charger Spendy, but handy. The case actually will replenish your laptop battery using sunlight. It takes a while, but hey, what else are you doing during Burning Man, right? $236-$390 26. iPod/Multi-Device Solar Charger You may only need to charge an iPod, in which case, this little guy is considerably more portable. $99.95 27. SuperGirl Undie Set Mystery Guest often complains that most of the novelty underwear for women is in the form of a thong, rendering it virtually unwearable to most women. This set offers a far more usable cut and it's made from 100% awesome :) $37.95 28. Shmaltz Jewbilation Brew We needed to throw in some Hanukkah specific items and this He-Brew fits the bill nicely. Sarcastic, ironic, and utterly perfect for Red Sea Pedestrians like me. Prices Vary 29. MOMA Store Sky Umbrella I've loved this umbrella ever since I first saw it. The feeling of being out on a sunny day is actually quite effective for lifting those dreary winter moods. $48.00 30. Cranium Poindexter Character If he looks geeky, that's because he is. Now go check out the profession he claims - awesome, right? $4.95 (full disclosure, MG is employed at Cranium) 31. LEGO Star Wars Millennium Falcon The Millennium Falcon in all its glory. Plus, you get to build it... Hold together baby. $369.99 32. Flight of the Conchords Mug Some of the web's most popular viral videos this year came from the Conchords. Celebrate accordingly. $9.99 33. Homer Simpson and Spider Pig Action Figure Set If you saw the Simpsons movie, you know how hard it is to get that spider pig song out of your head. Now, you can make it equally hard on everyone who stumbles across this flawless homage to the genius that is Homer. $15.95 34. Finnish Dart Set Yes, it's simple, and that's what makes it great. No complex, weird, British scoring rules, just simple, straightforward, Finnish darts. $48.00 35. Lunar Excursion Module with Stand I pretty much want one of these right now. Seriously, how cool is it to have a lunar module on your desk? $109.99 36. MOMA USB 2.0 4-Port Hub More USB goodness, but this one's actually really useful, particularly if you have lots of connections on a laptop with only one port. The nifty swiveling design is just bonus. $25.00 37. iRobot Programmable Scuba Washing Robot The cool part is, it doesn't just clean up after you, it's also entirely programmable. $499.99 38. Generation 1 Optimus Prime Re-Issue with Trailer So. Damn. Cool. This one's actually even better than the one I have, because it comes with the full trailer. $199.99 39. Alessi Parq Document Tray Set If you've got to have paper in your office, at least store it stylishly. These desk trays are probably as cool as it gets in the world of filing 1.0. $39.00 40. Handheld 20 Questions Game It's way, way smarter than you think. $19.95 41. Bluetooth Laser Virtual Keyboard This is typical geek present fodder, but it's also amazingly cool, so onto the list it goes. $179.99 42. USB Doomsday Device Launch Button Honestly, I'm not sure how much longer I can hold out before I need one of these. $49.99 43. Staple-Free Stapler If you're as afraid of getting your fingers stapled as I am, you'll want this bad boy. Inexpensive, and fun to use. $8.00 44. MS Sidewinder Mouse Microsoft still makes some pretty awesome mice, and this one's near the top of the list. Whip it out at a conference with your laptop and enjoy the benefits of envious stares. $70.65 45. Ninja Domo USB Drive This is the coolest USB drive we found on the web. It's especially awesome for link ninjas, and thus, I expect that Jim Boykin will have to buy one for each of his crew :) $49.95 46. Laptop Cool Feet Why wouldn't you use these? $12.95 47. Marshmallow Blaster Guns If there's something more fun than a food fight with a roastable treat, sign me up. $17-$25.00 48. Black Bar Anonymity Sunglasses Ever been in a photo you wish didn't find its way to Flickr. Welcome to Solutionsville, population: you. $10.00 49. Paul Smith Designed Laptop Bag This is quite possibly the most stylish laptop bag I've seen. It's almost too good looking. $175.00 50. Make Your Own Plush Monster Technically, they're on back order, but the concept here is amazing. You can design virtually anything, send in a drawing and FAO Schwartz will make it real. If your kids have ever sketched something amazing, here's your chance to bring it to life - very creative stuff. $249.00 Now it's your turn - find some crazy cool gadgetry, toys, or gifts you'd like to share? Please throw them in the comments and feel free to link (and yes, self-promotion is OK, so long as it's relevant) :) p.s. Oh my... This post took nearly 4 hours to write, grab photos, and find links. It's now 3:55am... Doh! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "50 Perfect Gifts for Webophiles, Bloggers, & Internet Marketers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "50 Perfect Gifts for Webophiles, Bloggers, & Internet Marketers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}