{
  "url": "https://moz.com/blog/50-things-i-love-about-search-conferences",
  "slug": "50-things-i-love-about-search-conferences",
  "title": "50 Things I Love About Search Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To help keep the balance, I'll shine some light on some of my favorite things about search conferences:\n\n    Presenting - It's exciting to be on stage, sharing ideas and being a thought leader. There's an undeniable allure to it, and while I take it as a serious responsibility, I admit that I have…",
  "content": "50 Things I Love About Search Conferences SEO Events By: Rand Fishkin August 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 17, 2007 50 Things I Love About Search Conferences SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. To help keep the balance, I'll shine some light on some of my favorite things about search conferences: Presenting - It's exciting to be on stage, sharing ideas and being a thought leader. There's an undeniable allure to it, and while I take it as a serious responsibility, I admit that I have a real passion for it, too. Meeting New People - Very smart, talented, entrepreneurial and well-connected folks show up at search conferences - thousands of them. Seeing Old Friends - Since there's at least a half dozen conferences I'm at each year, they're very practically a place to see friends from all over the world that I'd never have the opporuntity to know were it not for the group environment. Expensing Travel - It's a beautiful thing. Expensing Meals - mmm... free food (kind of). Learning New Techniques - Every conference I go to, I come away with tactics I'd never heard of before. Hearing About New Companies - Competitors expose themselves, new potential partners reveal themselves and new ideas you'd never think could work come out at conferences. Search Engine Announcements - I can virtually guarantee that 2 of the 3 major search engines (and probably all 3) will announce big news next week. After-Hours Parties - You'd have a hard time beating the search industry for after-hours get togethers, both public and private. Wearing Yellow Shoes - I never put them on at home. Losing Weight - I almost never eat more than 6-700 calories a day at conferences, so Mystery Guest always loves it when I come back after a week and I've lost those extraneous 5 pounds. Blogging on the Road - it's so much more dynamic and engaging when you get instant feedback and direct access to people. Hotel Mints - That and having your room cleaned for you. Seeing a New City - OK, so downtown San Jose is a bit boring, but I've been to London, China, Munich, Toronto, New York and many more Free Stuff - SWAG may not be everyone's cup of tea, but I always try to bring back something for my coworkers who couldn't attend. Drama - WHen it's on stage, it's terrific to see two sides attack and defend - I think that's when the most specific and relevant tips are exposed. Nametags - Since I suck at remembering names, I love seeing nametags around people's necks. Black Hats - They rarely come out online (at least in the places where I hang out), but they're all over the conference world. Burying the Hatchet - If you've had an online disagreement, chances are that 5 minutes in person will smooth it over. New Research - Someone always comes out with some new research showing click fraud is X% or Google is susceptible to this kind of spam or Yahoo! local contains 80% businesses started by ex-Microsoftees, etc. An Official Party Coordinator - Oh, wait... Drinking - Responsibly, of course. Wrestling - With which parties to attend, I mean. Not this kind. Comics - from Boowrecka, yeah :) New Tools - from SEOmoz (oh wait, was I supposed to keep that secret?) OK - Your job is to fill up the other 25 in the comments... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "50 Things I Love About Search Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "50 Things I Love About Search Conferences"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}