{
  "url": "https://moz.com/blog/525600-metrics-how-do-you-measure-measure-a-link",
  "slug": "525600-metrics-how-do-you-measure-measure-a-link",
  "title": "525,600 Metrics - How Do You Measure; Measure a Link? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If this doesn't win me cheesiest title of the year (or at least the blogging Tonies), I don't know what I'll do. Seriously, though, I've noticed that a lot of people have questions about how to measure the quality and veracity of a link. Why? To answer questions like - \"How much should I pay for…",
  "content": "525,600 Metrics - How Do You Measure; Measure a Link? Link Building By: Rand Fishkin May 31, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 31, 2007 525,600 Metrics - How Do You Measure; Measure a Link? Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. ...in PageRank, in Link Love, in Rankings for Keywords? If this doesn't win me cheesiest title of the year (or at least a Tony award), I don't know what I'll do. Seriously, though, I've noticed that a lot of people have questions about how to measure the quality and veracity of a link. Why? To answer questions like - \"How much should I pay for this link?\" or \"Why is my competitor ranking so well?\" or even \"Which links should I target in a campaign?\" Well, today's your lucky day. The following are the ways I measure links, and while they're not entirely comprehensive, they'll certainly give you a degree of detail far beyond what you probably need. I'll start with the most important elements and work my way down. Most Important Elements to Determing a Link's Value: Where does the linking page rank for the term/phrase you want to rank for? If the page is ranking #1 at Google for \"sliced bread\" and you want to be #1 at Google for \"sliced bread,\" guess what? That's the #1 most valuable link you can get. Keep going down the list to about position 25-30 and you're still getting solid gold in link value. Where does the linking page rank for 1-2 important, competitive terms in its title tag? This will give you a very solid idea about how much overall link juice and respect the search engines are giving the page. It's also a good way to identify the global link value that could be provided. Where does content on the linking domain generally rank for competitive terms in its pages' respective title tags? As above, we're trying to ID just how positively the engines view pages on the domain. If the pages generally rank in the top 20 results, we can rest assured that search engines think the domain's value is pretty darn high, and that links from that domain will pass significant value. Does the linking site carry any brokered sets of links? I don't worry about the occassional paid link or advertising link, but if I see that every page on a domain has links from a major link broker on it, I seriously worry that the site may lose its ability to pass link juice. This really applies to any type of low quality, manipulative linking. If you can see it, chances are, Google might see it someday, too. What is the relevance of the linking page/site to your target page? Answering this question require you to think critically about the visitors to both the potential linking page and the domain. If the relationship of subject matter is high, the link will provide more semantic and topic specific value. Elements of Secondary Value for Links: Links to High Ranking Competitors Although this isn't always an indication of direct value, it can be a good signal. Your competitors are obviously ranking based on the strength of their links, so researching those sources can provide insight into where they derive that value. Page Strength SEOmoz's own, in-house metrics compilation certainly isn't foolproof, and I advise you to ignore the number it spits out, but the data returned is convenient and certainly valuable. If there's a lot of links from Wikipedia and DMOZ and the site has high PageRank, lots of inbound links and blog links, there's clearly some value to getting a link. Just make sure you judge based on the data, not the numerical score - 4.5/10 doesn't mean much to professional SEOs. PageRank of Domain Yeah, I know it's weird that a PR hater like myself would call this out, but it really is something I examine. I look mostly at the domain to make sure it's not penalized and to see the overall link juice. A 6/10 domain clearly has some link love and respect, a 2/10 or a grey bar, can be a good red flag and seeing a 0/10 tells you that the domain is either new or completely invisble. Inlinks to Page (via Yahoo!) In a reversal of my look at the PR for the domain, with links, I'm looking at that specific page. I want to know if the domain links in to this individual page heavily, or if its practically an orphan. I want to see if its a page that other sites reference - both of which can help illuminate potential value. Inlinks to Domain via Technorati (or Google Blog Search) The Technorati and Google Blog Search link data can to show trends - if a site is picking up lots of new links over the past few months, it might be a much better candidate than PR or other link data might indicate. Less Important Elements of Link Valuation: Inlinks to Domain (via Yahoo!) They're not completely useless, but since the number often takes into account lots of links from a single domain, it can be misleading. Alexa Ranking Practically pointless in every way - Alexa data is skewed, inaccurate & really doesn't matter when grabbing a link. PageRank of Page Since so many newer pages are 0, and so many valuable pages may only be a 1-3, it seems unwise to get caught up in the PR of the specific page - better to look at the domain and the attention it gives your page. Listing in DMOZ I don't know why people consider this, but it is a metric some folks claim to use. We measure in the PageStrength tool only as a way to consider legitimacy and longevity, but honestly it's not particularly valuable when considering a link. Number of External Links on the Page Unless there are 150+ outbound links and you're worried that Googlebot doesn't spider them all, it's a very antiquated concern to worry about the individual amount of PageRank that will be passed by any given link. You're getting anchor text and trust value and all of the other positive factors a link providers, so don't sweat a crowd too much. I'd be interested to hear if you have other metrics to consider when weighing the purchase of a link. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "525,600 Metrics - How Do You Measure; Measure a Link?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "525,600 Metrics - How Do You Measure; Measure a Link?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}