{
  "url": "https://moz.com/blog/6-changes-every-seo-should-make-before-the-over-optimization-penalty-hits-whiteboard-friday",
  "slug": "6-changes-every-seo-should-make-before-the-over-optimization-penalty-hits-whiteboard-friday",
  "title": "6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Having overly optimized web pages could soon get your websites in some hot water with Google and their search results. It has recently been announced that Google will start to penalize websites that engage in over-optimization practices.\n\n\tIn this week's Whiteboard Friday, we will be covering some…",
  "content": "6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits Whiteboard Friday By: Rand Fishkin April 19, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 19, 2012 6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Having overly optimized web pages could soon get your websites in some hot water with Google and their search results. It has recently been announced that Google will start to penalize websites that engage in over-optimization practices. In this week's Whiteboard Friday, we will be covering some changes that you should be making to your SEO practices in order to avoid this type of penalization. We hope you enjoy and don't forget to leave comments below! Happy Friday Everyone! Video Transcription Howdy SEOmoz fans. Welcome to another addition of Whiteboard Friday. This week we've been hearing a lot of chatter in the SEO blogosphere and on Twitter and on the forums about this new potential Google penalty that's coming down the line around over-optimization. Now, one of Google's representatives mentioned at a conference, South by Southwest, down in Austin, Texas, about a month ago actually, that Google would be looking into penalizing over-optimized websites and folks who have engaged in over-the-top SEO. There's been a lot of speculation around when that's coming out, whether that's coming out. There are a few things happening, actually, this week and last night about, \"Hey is this already something we're seeing?\" Seer Interactive, right, Wil Reynolds' fantastic SEO company out of Philadelphia had this penalty, and people were wondering whether that was related to this. Not really sure. But before this penalty hits, for goodness sake, SEO folks, let's make these changes to our websites because we could be in real trouble if we don't impact these things beforehand. I think these are some of the most likely candidates to be hit by Google's over-optimization penalty, some of the most likely patterns they're going to try and match against in this upcoming change. So let's talk through them. Number one, your titles need to be authentic. They need to sound real. They need to sound like a human being wrote them that was not intending necessarily simply to rank for phrase after phrase. I'll give you a good example. Bad: web design services, web design firm space brand name, whatever your brand name is, web design. What does it sound like? It sounds like all you're trying to do is rank for keywords, not show off your brand name, especially if this is your home page or those kinds of things. You're repeating keywords three times. Web design is in this title three times. Think about whether a normal human being would read that title and think, oh yeah, that sounds legitimate. No, they'd think to themselves there's something fishy here, something spammy, something's wrong, something manipulative. Try instead, probably equally effective, if not more, brand name web design Portland Spiffiest Design Services. Now look, I've got the word \"design services,\" which you wanted to get in here. I've got the city where you are that you're trying to target, got brand name web design, right, sort of branding myself as the product and the keyword. Much, much better. Try and look through your sites and see if this is a potential issue. I've seen tons of sites where SEO folks have just gone overboard again and again. Don't get me wrong. I used to do this too. One of the crappiest things about this is, even if your rank, your click through rates go down. So you can rank in position two or three and be getting less than the people below you, because people don't think that these are legitimate titles and they perceive them to be manipulative, especially if you're targeting more higher end, savvy or sophisticated technology customers. Number two, manipulative internal links. I see this a lot on side bars, inside of content, where people have taken all of the instances of a particular word or repeated it throughout the side bar or in the footer, those kinds of things, and are pointing with exact match anchors to the same page over and over again. Now, we all know as SEOs that the first anchor text link counts and only one on the page is going to pass that value. Linking repeatedly to the same page with the same anchor is not helpful for SEO, and it makes our sites look really spammy and manipulative and questionable to someone who's browsing it. Why would we want to hurt our conversion rates like this, and why would we want to point out to the engines that, hey, over here, I'm trying to manipulate you? What are you thinking? This is crazy. Instead, go with logical, useful, change it up when you're linking to pages, maybe a couple of times, in some spaces. You have a blog post and it mentions a page on your site that you want people to actually go to and that you think is useful in context. Great, link over there. Fine, use the anchor text. Maybe use a modified version of the anchor text, a little longer, a little shorter, a little more natural sounding, and you're going to get these same results, but you're going to do it in a much more effective way. You're not going to be at risk of whatever is happening with this over-optimization penalty. Number three, cruddy, link filled footers. I see this all the time still. You're just having a bunch of exact anchor links down in here that no one would actually really click and that come in lists. I often see them in light gray on light gray so that it's not particularly easy to read. Use your footer wisely. Use your footer to link to the things that people expect to find in the footer. If you really need to get anchor text on pages, find natural ways to put it in the real menu at the top, in the content itself. Don't be trying to mess around and throw footer links site wide, across things. This 2002, man. We're ten years later. It's like at least a decade past that. Number four, text content blocks built primarily for the engines. You know how sometimes you get to a page and there's good content, usable stuff, an image, a call to action, and then weirdly there's this block of junk. It's this block of blah, blah, keyword, keyword, blah, blah, blah, keyword, keyword, blah, blah, blah. Why is that there? Why does that exist? Does that really work? Does that really trick the engines? Yeah, it tricks them into thinking that they should penalize you. Get that out of there. Rewrite that stuff, man. Seriously, this is going to cost you far more than it's going to help you. If you've got those spammy blocks of text in your pages, that have no purpose other than to get your keywords or some keyword into the text, and it's not actually helping anyone, it's not a good call to action, it's not helping your conversion rate, it will actually drive people away from you. Why are you trying to rank if not to get people to do good things on your site, and like your brand, and appreciate you and come back again and again, and tell their friends, and share it socially, and link to you? Don't be putting this stuff in here. This is dangerous for all of those reasons, and super dangerous given this over-optimization penalty that's potentially coming down the line. Number five, back links from penalty likely sources. So this is one of the toughest ones because it's really hard to control if you've already gotten links from these places. But you can see with those 700,000 Google webmaster tools, pings that they sent everybody that said, hey, it looks like you've done some manipulative linking, and that kind of thing. Be really careful for all of these, link networks, anything that says private link network, or I have a link network and I'll place your site on it, or building up a network of sites that you then interlink to one and other. Come on. There are so many better ways to get links. You're putting a lot of time and effort and energy into building all of that stuff. You can do so many authentic things with that time. This is time terribly spent. Comment spam, especially those that are sent though automated software blasts, so you think of your XRumer or your SENuke, the article marking robot, or whatever, that's going to submit your site to tons of places or find open holes in the web where they can leave comments and link spam and that kind of stuff. Forum signature links, this is actually one where I suspect it's one of the places where Google really gets to know, hey, this guy clearly is a manipulative, black hat/gray hat SEO, because look, they're pointing to the same site where we found all the link spam from forum signatures, particularly on webmaster sorts of boards. That clearly indicates that's their site and their trying to rain for it, and all that kind of stuff. They've got a long profile, and they keep linking to all these things from their forum signatures. Just be very cautious about this. I'm not saying don't link to it, but maybe don't use your exact match anchor text or try to make it more of a branding play, try and make it more authentic feeling. Certainly participating in communities is a great thing. Just watch that. Reciprocal lists, right, people are emailing each other back and forth and saying, \"Hey, I'll put you on my list of links. You put me on yours. Oh, and we'll do it 20 times and we'll form this big reciprocal circus that's going to get all of us penalized.\" How great is that? Article marking sites, I've talked about article marketing in the past. Generally when you see, hey, we're an article marketing site and we can help you rank higher, and submit your content to us and we'll link out, and the same is true for SEO focused directories, anytime you see a site that is essentially extolling the virtues of participating there, or contributing there, as being primarily related to the link and the anchor text and the page rank you're going to get, you can bet your sweet hiney that Google does not want to count that. That's exactly what they're trying to prevent, and I'd worry, whether it's this penalty or a penalty that Google makes in the future, that this is the kind of stuff that gets hit. Last one, number six, large amounts of pages that are targeting very similar, kind of modified versions of keywords and keyword intents, with only slight variations, slight variation being the key here. So think: used cars Seattle, used autos Seattle, pre-owned cars Seattle. Why are those three different pages? It sort of feels like keywordy, SEO-y, spam, right, and then there are pointing exact match anchors at all of these. This is the same page. You can target all three of these keywords very nicely on one page that's called Used and Pre-owned Cars/Autos in Seattle. Right, one page, good, you've got it. You've combined all of the things. You want to have that great user experience there. You don't want to have to build that three times. You're not trying to build a bunch of spammy anchor texts to each one that's pointing from each of the different ones. The used cars Seattle page has a link to the used auto Seattle's, it's sort of like, \"What?\" From a user perspective, \"Why is that there? What is the difference between a car and an automobile exactly? I don't understand why these two exist.\" This kind of thing is something where I think it's a very clear pattern match that the engines can detect. Looks like they did some research and then just built a page for everything, and then they pointed links at all of them. Its manipulative, right. This is the kind of thing, also, that will get you in trouble. So, one, one, two, three, four, five, six. Six things you should change, and even though I'm not the Count from Sesame Street, you should still pay careful attention to these, because I'm super nervous that when this penalty going to come out, there are just going to be so many webmasters and SEOs who are doing this kind of stuff, and I don't know which one Google's going to hit on this time and what they might hit on in the future. But I just want you to be okay. I want your sites to do well, and this is such bad stuff for user experience too. So please avoid it. Be careful. Good luck to you, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}