{
  "url": "https://moz.com/blog/6-lessons-learned-on-facebook-advertising",
  "slug": "6-lessons-learned-on-facebook-advertising",
  "title": "6 lessons learned on Facebook advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Facebook advertising is getting more and more interesting to advertisers, because 1. it is one of the most used social networks, 2. the ads can be really targeted and 3. its cheap (or it can be cheap if you know how to use it). After I ran a couple of advertising campaigns, I would like to share a…",
  "content": "6 lessons learned on Facebook advertising Online Advertising P By: Peter Mesarec June 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Peter Mesarec June 29, 2009 6 lessons learned on Facebook advertising Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Facebook advertising is getting more and more interesting to advertisers for a few reasons. It is one of the most used social networks, the ads can be really targeted and its cheap (or it can be cheap if you know how to use it). After I ran a couple of advertising campaigns, I would like to share a couple of lessons I learned about it. Use a picture. The Click Through Rate gets much bigger, if you use a picture, probably because people like to watch pictures on Facebook. But on the other hand, you don't want the CTR to be too big, so don't use a generic picture, that is not connected to the item your selling. The picture should not look like one you would publish in your profile, because people see it as a profile change, and click on it without any real interest. People just like to browse around Facebook, and you don't want to pay for that. Test (I know, not really a new lesson). Test the max bid you are willing to pay. Start small, probably with the smallest number that is proposed by Facebook. You can get a LOT of clicks for only $0.05. But it differs from group to group and from country to country, so watch your ad carefully and if you don't get enough exposure, raise the bid. Add a call to action. Tell your users what you expect from them after they click. “Sign up” or “Buy”, it should be in your ad, because people really like just to click around, and this are not people that you would like to pay to get them to your website. Don't play around with your ads in the morning (morning for me means morning in the CET time zone). Even if you change only one letter or adjust something small, the ad needs to be reviewed by the Facebook team. And it only happened to me in the late afternoon, that means I needed to wait half a day to get my ad showing again. I'm sorry, but a lot of the targeting options don't work in a lot of countries. Keywords, town, school and other categories just didn't work for me in Slovenia (Europe). But still, its more than others can offer. Facebook tells you, if they have a big campaign that will influence your ads. That means if some one else bought a lot of clicks for a day, and your ads just won't show as much, Facebook sends you a message not to change your settings, because it will all get better a day later. And it does. At the end of the day, of all the different advertising options I've tried, Facebook gave me the best results. You should think about your goals of the campaign first, think about where the clicks are going to take the user; on your website or on a Facebook page and start. As mentioned, you can start small and build the campaign, so you can use it, if you are a small Internet shop, or a big, known website. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 lessons learned on Facebook advertising"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 lessons learned on Facebook advertising"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Peter Mesarec\n          \n            Peter Mesarec\n          \n            Peter Mesarec"
}