{
  "url": "https://moz.com/blog/6-mistakes-to-avoid-when-setting-up-and-using-google-analytics",
  "slug": "6-mistakes-to-avoid-when-setting-up-and-using-google-analytics",
  "title": "6 Mistakes to Avoid When Setting up and Using Google Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you getting the most out of your Google Analytics data? If not, isn't it time you changed that?",
  "content": "6 Mistakes to Avoid When Setting up and Using Google Analytics SEO Analytics | SEO Tools | SEO Basics By: Katy De Leon June 28, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Katy De Leon June 28, 2016 6 Mistakes to Avoid When Setting up and Using Google Analytics SEO Analytics | SEO Tools | SEO Basics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Since its launch in 2005, Google Analytics has been one of the most important tools that marketers have had at their disposal. If you want to understand what’s happening on your website and why, there’s really no better solution. That’s because although it was originally just a tool for measuring website traffic, over the years it has evolved into a highly sophisticated web analytics service. Ask anyone who uses it, and they’ll tell you that it’s capable of serving up an astonishing level of detail about — and insights into — virtually every aspect of your website’s performance. While you don’t have to be an analytics guru to start learning about your website, to get the most out Google Analytics and ensure that your data is accurate, you do have to know what you’re doing. That means getting the basics right when setting up and using your account. Below, I’ve compiled a list of six mistakes that I see people make all of the time when doing this. Once you’re aware of them, and you know what to do about them (I’ve provided links to step-by-step instructions for resolving each), you’ll be well on your way to becoming a Google Analytics pro. 1. Forgetting to filter out internal session dataIt turns out that your prospects and customers aren’t the only ones visiting your website. You and your colleagues are, too. While it’s great that Bob from accounting just checked out your team’s latest blog post, the fact is that internal activity can really skew your data. At large organizations, in particular, all that activity can easily translate into hundreds or even thousands of views per month, giving you a distorted view of your website’s performance. That’s why it’s important to set up a filter to remove internal session data from your results. Only then will you be able to get an accurate look at the what’s really happening on your site. Follow these step-by-step instructions to exclude internal traffic from your Google Analytics view: Log into Google Analytics > Click \"Admin\" > Click \"All Filters\" Select \"+ Add Filter\" Name your filter. (Something like “Exclude Internal Traffic” would work well.) Choose \"Predefined\" from the filter type options. Select \"Exclude\" > \"Traffic from the IP addresses\" > \"That are equal to\" Insert your IP address. (Click here to learn how to add multiple IP addresses.) Select the \"Google Analytics Views\" to apply the filter to. (We suggest applying it all views.) Click \"Save\" 2. Not using UTM parameters correctlyAn urchin tracking module (UTM) parameter is a marker that you can add to URLs for tracking purposes to help you can see where traffic is coming from. For example, imagine running a campaign where you’re directing people to the same landing page using using a variety of online ads. If you used one standard URL, you would have no way of knowing if one of the ads was more effective than another. By adding a UTM parameter, however, you can differentiate the URLs associated with the ads, allowing you to isolate how each is performing individually.The trick with UTM parameters is that you need to know when and how to use them. For example, some Google Analytics users make the mistake of using them on internal links within their own site, which can cause major problems when you’re trying to analyze your own data. Other people don’t use them at all, which can make it look like they’re getting all of their traffic direct, even when that’s not actually the case. Plus, if you’re not using UTM parameters, you’ll be missing out on getting deeper insights into which channels are driving traffic and goal completions for your marketing campaigns. Setting up links with a UTM parameters is easy. Check out these steps to get started: Click here and bookmark the page Use the URL builder form to generate your tracked URL Expert tip: you’ll want to use the same campaign name for all URLs associated with a single marketing campaign (campaign names are case sensitive - be careful!) http://imgur.com/VtEwHrhSee the fruits of your UTM labors by selecting \"Acquisitions\" > \"Campaigns\" > \"All Campaigns\" in your Google Analytics view http://imgur.com/ehzMD9YCampaigns that have had website activity will show in this list. Click on the campaign name to dive deeper into which sources/mediums are driving the most traffic and conversions on your site. 3. Failing to set up goal trackingYour website serves many purposes. It’s a tool for informing your target audience, generating leads, creating engagement, and ultimately making a sale. The thing is, if you’re only using Google Analytics to track your top line goals (say, completing a sale), you’re missing out on lots of other ways that people are interacting with your website. To better understand how prospects and customers are engaging with your site, set up goals for things like newsletter signups, contact us form submissions, and white paper downloads. Doing so will give you a much richer view of what’s happening on your site and how your target audience is progressing down the purchasing path. To get the 411 on setting up goals, follow these steps: Log into Google Analytics > Click \"Admin\" > Check to ensure the right view is selected in the right column > Click \"Goals\" Select \"+ New Goal\" Google Analytics also has a set of pre-configured goals that might make sense for your business. If not, simply select the radio button for \"Custom.\" Name your goal and select the \"Type.\" For example, if you would like to track conversions on a website form, select \"Destination\" as the type and input the thank you page that visitors are redirected to after completing the form. This will allow you to capture all successful form completions. 4. Not filtering out spam trafficReferral spam is a huge problem. Not only does it put unnecessary strain on your server and slow your site down, it can also throw off all of your data by sending tons of meaningless traffic to your website. Even if you’ve taken steps to block spammers, it’s still important to filter out any spam traffic so that it doesn’t corrupt your data.We’ve done extensive research on the best way to approach filtering out referral spam in Google Analytics. The best solution we’ve found is applying the segment “Segment to Eliminate Spam Referrals” by Analytics Edge. A detailed step by step on how to apply the custom segment is below. Navigate to your Google Analytics view > Click \"+ Add Segment\" Click \"Import from gallery > Search for \"Segment to Eliminate Spam Referrals\" > Click \"Import\" You’ll have the option to apply the segment to all views or a specific view. Select the desired view(s) and click \"Create\" Insert your hostname (website URL) into the filter > Click \"Save\" 5. Not segmenting your dataIf you’re only looking at top-level Google Analytics data, you’re missing out on one of the main reasons for analyzing your data in the first place: segmentation. Website traffic can be broken down into various segments based on many factors, including demographic, behavioral, and geographic.By isolating data for specific segments, you can derive much more meaningful insights than when you simply look at your data in aggregate.I recommend playing around with the predefined segments that come standard with your Google Analytics account and, once you’re comfortable with that, creating your own custom segments based on your unique business needs.Here are the steps you need to follow to set up a custom segment in Google Analytics: Similar to how you added your spam filter, navigate to your Google Analytics View and Click \"+ Add Segment\" Select \"+ New Segment\" Google Analytics provides some intuitive segments for users to take advantage of including demographic, technology, and behavior To learn more about advanced custom segments, check out this post. 6. Overlooking the Google Analytics Solutions GalleryIf getting the most out of Google Analytics seems daunting, it doesn’t have to be. The Google Analytics Solutions Gallery gives you access to fantastic custom reports, segments, and dashboards created by some of the top experts in the Google Analytics community. That means that rather than reinvent the wheel, all you have to do is browse through the solutions gallery and import whatever best meets your needs.Dig into Google Analytics. You won't regret it. Google Analytics is a powerful tool that can deliver meaningful insights about your website. Like anything, it takes some getting used to; but once you’re up and running, you’ll be amazed by how much information you’ll have at your fingertips. By avoiding the mistakes outlined in this post, you’ll be well-placed to ensure you’re collecting accurate data and getting the most out of this amazing service. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Mistakes to Avoid When Setting up and Using Google Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Mistakes to Avoid When Setting up and Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "1. Forgetting to filter out internal session data"
    },
    {
      "level": "H2",
      "text": "2. Not using UTM parameters correctly"
    },
    {
      "level": "H2",
      "text": "3. Failing to set up goal tracking"
    },
    {
      "level": "H2",
      "text": "4. Not filtering out spam traffic"
    },
    {
      "level": "H2",
      "text": "5. Not segmenting your data"
    },
    {
      "level": "H2",
      "text": "6. Overlooking the Google Analytics Solutions Gallery"
    },
    {
      "level": "H2",
      "text": "Dig into Google Analytics. You won't regret it."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Katy De Leon\n          \n            Katy De Leon\n          \n            Katy De Leon"
}