{
  "url": "https://moz.com/blog/6-reasons-why-qa-sites-can-boost-your-seo-in-2011-despite-googles-farmer-update-12160",
  "slug": "6-reasons-why-qa-sites-can-boost-your-seo-in-2011-despite-googles-farmer-update-12160",
  "title": "6 Reasons Why Q&A Sites Can Boost Your SEO in 2011 (Despite Google's Farmer Update) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A lot of SEO predictions for 2011 were published in the end of 2010, while not many marketers mentioned the increasing popularity of Q&A sites.  I think that it could be a great opportunity to exploit this new rising  phenomenon for our marketing efforts while it's still fresh.\nWhy shouldn't you…",
  "content": "6 Reasons Why Q&A Sites Can Boost Your SEO in 2011 (Despite Google's Farmer Update) Advanced SEO By: Pavel Israelsky March 15, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Pavel Israelsky March 15, 2011 6 Reasons Why Q&A Sites Can Boost Your SEO in 2011 (Despite Google's Farmer Update) Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A lot of SEO predictions for 2011 were published in the end of 2010, while not many marketers mentioned the increasing popularity of Q&A sites. I think that it could be a great opportunity to exploit this new rising phenomenon for our marketing efforts while it's still fresh. Why shouldn't you worry about Google's Content farm update? I'm pretty sure that you're already familiarized with the Google's recent farmer update, and might think that Q&A sites are useless now. But if you take a closer look, there are a bunch of quality Q&A sites that did not suffer at all and can still be used for your marketing efforts. It's important to use only these kinds of sites as part of the following techniques, to get the most value for your efforts. I believe that Google (and other search engines) should try and fit their offering to users according to changes on the web, so completely ignoring a rising concept such as Q&A platforms will be like shooting themselves in the foot. What's a Q&A site and how does it work? Before diving into the endless marketing opportunities of this concept, it's important to understand what a Q&A site is and how exactly it works. The simplest definition can be found in Wikipedia: \"A Q&A website is a website where the site creators use the images of pop culture icons to answer input from the site's visitors, usually in question/answer format.\" While this definition mainly refers to the traditional type of Q&A sites, the whole concept refers to the following four groups: This table highlights the main purpose and value of each group, and we will see how we can use each group in a different way. The following article will mainly concentrate on the potential of the first two groups – social and standard Q&A sites. Also, the examples for each group include only general websites and not niche oriented (which are of course useful for the following techniques). Now that we have clearer picture of the different kinds of Q&A sites, let's see the top seven reasons to use them, in order to improve our online acquisition efforts. 1. Recent Trend: people google more questions than generic keywords It doesn't necessarily mean that the search volume of generic keywords is higher. But we can clearly see that there's an extreme increase in the search volume of question quarries, while at the same time a slight decrease in the search volume of generic primary keywords. The most interesting fact of this phenomenon is that it happens with keywords from the same topic. To visualize this data, I chose some competitive generic keywords and related questions for those keywords. Than compared with Google KW Tool the difference between their search volumes in 2010. For example, here's a comparison between the search volume of both generic and questions quarries for iphone keywords (it's \"exact\" search): 2. QA sites have become much more popular in the last year Another evidence for this phenomenon, can be found in the fact that the traffic to QA and \"how to\" sites has been dramatically on the rise in the last year. Using Compete comparison, we can see the yearly change among some of these sites (unique visitors): This is a very interesting trend, which can tell us a lot about the evolution of our search habits. What does it say about our web search psychology? How will this change impact the search engine's relevancy algorithm? While the content farm update \"erased\" some of these sites, there will probably be new alternatives that will take their place (the next point can explain why). 3. Q&A pages ranked high in search results It seems that pages from QA sites rank pretty well in organic search results. These pages are highly on-page optimized for the main keywords, well engaged by the users and are continuously updated by users. Here are some reasons why these pages might rank high: Search results variety – For each query, Google tends to offer different kinds of websites and content in the organic results, in order to diverse it's offering for users. So for example, if we will search \"Michael Jackson\", the search results will include links to different kinds of websites and content: Wikipedia, videos, music sites, magazine/news sites etc. Therefore, we can think of QA sites as an independent group of content, which might be ranked high for many queries. Frequently updated content - people always love to share their knowledge by answering questions related to their area of expertise. Whether in forums, professional communities or QA sites. People will always add new comments/answers to such pages. And if new content is frequently generated – you can be sure that Google will be there to index it and prioritize it over \"dead\" pages. Another aspect that definitely contributes to the richness of the content is user engagement. Things like commenting, scoring and voting make these pages very valuable for users. Well on-page optimization – most of these pages include various elements, which are an essential part of the on-page optimization factors (e.g. title, meta description, related tags and text). First of all, each one of these elements includes the main keywords of the specific question. Also, the internal linking structure supports the optimization level (e.g. \"related questions\" in each question page, \"Recent answers\" in user's profile, recent questions in main categories etc). For instance, take a look at a question page from Pro Webmasters: Knowing that, you can simply search for the most relevant questions related to your keywords and start dropping useful answers. Of course in addition to your answers, you can place links within the text in a relevant context. This way, you can drive some really targeted traffic and increase your backlinks profile. It's better to start with QA pages that are already ranked high in SERPs, since they already have existing and relevant traffic. After dominating the 1st result page for your related terms, it's time to expand your sources by searching within the QA sites themselves. You can use Questionhub to save a lot of time. Questionhub is a giant aggregator that gathers questions from various QA sites around the web. Using Questionhub, you can find a lot of relevant Q&A pages in which you can leave answers and links to your site. 4. Great opportunity to diversify your backlinks profile It's always recommended to include links from various kinds of websites in your backlinks profile, and not to concentrate just on one type (e.g. blogs, forums, news sites, social bookmarks/networks, static sites etc...). Basically there are two main reasons why you should get links from various sources: Your campaign will look more natural – if all your links come from blogs for example, it definitely won't look natural. More likely to be flagged by Google. It's much more natural that people will link from various spots rather than only one type of sites. Chances to gain more trust - Barry Schwartz referred to a video, in which Matt Cutts talked about the value of links from different segments of sites. In this video, Matt does seem to imply that Google is valuing links differently according to the type of the site. If you expect to find some dofollow links with anchor text, you might be disappointed. But it doesn't matter as they will still be counted by Google (you can see them clearly in your webmaster tools account). And in any case, like I said before, it's a great opportunity to diverse your backlinks profile. 5. Pages that people prefer linking to Let's say you wrote some really nice piece of content about car insurance for your blog. Since you want to make it useful for your users, you will link from it to external sources in a relevant context. But which pages will you probably link to? Will you link to some pages from commercial/corporation websites, or to some Q&A or \"how to\" pages? Let's assume for example that both options have the same relevancy to your content, and both deal with a narrow topic that you can't find on Wikipedia. I'm pretty sure that you will choose the 2nd option in such case. Why do people prefer to link to such sources? Psychology – The action of linking from our site to a corporate or commercial website may be interpreted as an act of solitude or identification between us and that said company. This might make us rule it out in at point blank, sub consciously. Therefore, there are high chances that Q&A pages will gain natural links. Value – referring to Q&A and \"how to\" pages is much more valuable for users. Imagine yourself reading an interesting article and suddenly bumping into a link – wouldn't you prefer that it takes you to a neutral source that can assist you and teach you something new (or will expand existing knowledge)? Easy to find – as I wrote before, Q&A and \"how to\" pages are ranked well in SERPs because of their high level of on-page optimization. The most common thing to do if we want to find the appropriate source to link to - is to search for it. If I want to link from a paragraph that deals with cooking thanksgiving turkey for example, I might search for \"how to cook a turkey\" and will probably get results from Q&A and \"how to\" sites. Build your own Q&A asset and gain natural links The best way to benefit from this behavior and attract links, is to establish your own Q&A property. This kind of asset can be built on a separate domain or on a subdomain/subfolder in your existing domain. There are a lot of free open source solutions for building such platforms, just choose one (it's pretty ironic that I naturally found the Q&A site which I'm linking to right now, using the same technique I've described in the previous paragraph J). After establishing the platform, you should think about a keyword strategy that will assist you in focusing your content. It's better to have a targeted Q&A section with questions related to specific and narrow topics, rather than general ones. So for example if you have a hotel - website, focus your content only on this field by covering all related long tails. If all questions will be related to a specific topic, it will encourage users to use your platform because they will treat it as an authority source to get answers (will you prefer to ask about hotels in a dedicated or general source?). It will also encourage expert users to leave answers (ego?), especially if they have a business or a website in the hotel industry that they wish to promote. Now that we know which keywords we should focus on, it's time to fill them with some initial questions/answers and spread the word. Here's a quick action items list that will assist you with this mission: Publish about 10-20 initial questions that will include your main keywords. You can check in other popular Q&A sites what are the most common questions being asked, and imitate them. Also, it's highly recommended to concentrate on questions with low-middle competition in SERPs (only in the beginning of the process). A practical way to verify that, is to use the intitle:\"your question\" search operator in Google (more search operators that can help with narrowing your query). Leave detailed answers to these questions. But don't do it at once, use a couple of hours interval so it will look more natural. If you want it to look even more natural, you can use different identities instead. Drive traffic to your new section using social media (retweet new questions, share on facebook, email all your friends, link from your homepage, ask for reviews in forums etc). If it will bring value, I'm sure that shortly after launch, users will start asking and answering questions. And if the source will become an authority of a sort – links will soon follow. 6. Targeted traffic = better conversion Imagine that you are a blackjack enthusiast, and next month you're traveling to Las Vegas for a vacation. Since this will be your first visit to Vegas, it's reasonable that you will search questions like \"Which casino has the best blackjack game in Las Vegas\". Chances are you will hit a Quora result: In this page you will find some very informative answers from anonymous users, who describe various casinos in Vegas and even provide some blackjack tactics. In fact, this answer is so informative and insightful, that you just can't ignore it. I bet you also won't ignore the single link within the content, which refers to a blackjack strategy page: Now when you click on the link, chances are high that you will also click on the affiliate banner in this blackjack website and the rest is history. Let's see how the funnel of this process looks like: You can use this technique for both link building efforts and traffic generation. But if you are looking only for SEO benefits, you should concentrate mainly on getting such links. While these kinds of links may be worthless in terms of link juice as they are not followed, but they do have an alternative added value: Traffic – if you leave such detailed answers with links in more than one question, it can bring you some really nice and targeted traffic. Conversion – if the traffic is targeted to your niche, there are high chances that those users could become customers. Link from a Q&A site – although in certain cases they are not followed, they are still counted in the overall backlinks calculation. And like I've mentioned before – it's a great way to diverse your backlinks profile. What is your experience with Q&A sites? The techniques shared in this article can improve your SEO campaign, especially in a competitive niche. If all your competitors are doing pretty much the same – this is a great chance to be prominent and bring something different to the table. Have you been using Q&A sites as part of your SEO tactics? How exactly? Or are you completely sure that these tactics don't have any value? Your thoughts are more than welcome. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Reasons Why Q&A Sites Can Boost Your SEO in 2011 (Despite Google's Farmer Update)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Reasons Why Q&A Sites Can Boost Your SEO in 2011 (Despite Google's Farmer Update)"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pavel Israelsky\n          \n            Pavel Israelsky\n          \n            Pavel Israelsky"
}