{
  "url": "https://moz.com/blog/6-technical-seo-strategy-tips-better-traffic-rankings-site-architecture",
  "slug": "6-technical-seo-strategy-tips-better-traffic-rankings-site-architecture",
  "title": "6 Technical SEO Strategy Tips for Better Traffic and Rankings [Site Architecture] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you think about it, search engines are more or less constantly driving us SEO people to keep our technical SEO strategy in a state of near constant refinement. Here are a few ideas (6, to be exact) based on issues I’ve encountered in QA or on our recent client work that I hope will provide a…",
  "content": "6 Technical SEO Strategy Tips for Better Traffic and Rankings [Site Architecture] Technical SEO By: Richard Baxter October 5, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Richard Baxter October 5, 2010 6 Technical SEO Strategy Tips for Better Traffic and Rankings [Site Architecture] Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you think about it, search engines are more or less constantly driving us SEO people to keep our technical SEO strategy in a state of constant refinement. This “evolution” of the marketing environment we thrive in is a great thing, it challenges us to come up with new ways to improve our traffic generating capabilities, user experience and the overall agility of our websites. Here are a few ideas (6, to be exact) based on issues I’ve encountered in QA or on our recent client work that I hope will provide a little food for thought the next time you’re planning SEO enhancements to your site. 1) Leverage UGC (review content) beyond the product page UGC is brilliant, particularly on product, content thin or affiliate sites. Making it easy for users to leave a review is powerful stuff, but are you making the most of your precious user generated comments? Consider this scenario. So many users leave product reviews on your pages that you decide to limit the number of reviews visible for that product. You could cherry pick some UGC for category listings pages, adding to the uniqueness of those otherwise content-thin pages too. 2) Use “other users found this document for” I know Tom loves this trick, and rightly so. You can turn insightful recent searches data into valuable on-page uniqueness. Internal search and external referrals are great, but how about extending the process to make it easy for users to evaluate, extend, tag or remove terms they feel are irrelevant to the page? 3) Consider delivering search engine friendly URLs in your internal site search results I know how “out there” this might initially sound, but why settle for search engine unfriendly URLs on your internal site search pages? I have seen lots of examples of links being awarded to unfriendly, internal site search URLS. Why do we spend so much time carefully crafting our external URLs, only to completely forget our internal search URLs? A little extra development work to apply a meaningful pattern to your search result page URLs today could lead to the construction of an entirely new content type down the line. Look at how folks are linking to these search query pages (where instead of a URL rewrite, this site is using breadcrumbs to make their ranking page URL appear more friendly) 4) Microformats are really gaining traction – be creative with them What we’ve found with Microformats is that webmasters tend to apply the markup to web pages hosting the content, but that’s where they stop. Imagine you have a website that sells tickets. Do you add hCalendar to your event page and walk away? No! You can nest other Microformats such as hProduct and hReview, and syndicate your formatted data to other internal pages, snippets on your homepage and category pages. Any mention of an event, a link to a product or a review snippet should use the appropriate mark-up, consistently across your website. 5) Work hard to resolve errors and improve site speed Think about how Google have placed site performance at the top of their agenda. I genuinely believe that a site riddled with performance issues and errors is tolerated less today by search engines than ever before. Websites with platform issues can raise serious problems for SEO, users, conversion and repeat visits. Fortunately, there are plenty of tools (including SEOmoz Pro, IIS Toolkit, Pingdom Tools and Webmaster Tools from Bing and Google) to help you identify and tackle these issues head on. Go and set aside some performance maintenance time, if you haven’t done for a while. 6) Watch your homepage title in Google’s SERPs Google can be pretty aggressive when it comes to choosing the most appropriate text to appear in your title snippets. Sometimes, you might disagree with Google's choice! Our tests so far indicate that the NOODP meta tag (used to prevent Google using the DMOZ description from displaying in your SERPS) can prevent Google from doing this, even if you have no DMOZ listing. From this; To this: That “penny drop” moment when a new technical SEO strategy idea presents itself has to be my favourite part of SEO work. I'm glad that technical strategy has to evolve as search engines develop. I really can't see a time in the near future when that will change. If you’d like to hear more tips, I’ll be speaking at next week’s A4Uexpo in London on exactly this topic. If you’re there, be sure to drop by and say hello. My buddy Dave Naylor will be introducing me (I have no idea what he’s going to say) and hopefully there’s going to be some time to do a preview of the session over on his blog soon. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Technical SEO Strategy Tips for Better Traffic and Rankings [Site Architecture]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Technical SEO Strategy Tips for Better Traffic and Rankings [Site Architecture]"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}