{
  "url": "https://moz.com/blog/6-ways-to-use-fresh-links-whiteboard-friday#comment-214141",
  "slug": "6-ways-to-use-fresh-links-whiteboard-friday",
  "title": "6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're giving marketers a fresh, incredibly recent way to keep tracks of their mentions and links with Fresh Web Explorer. In today's Whiteboard Friday, Rand discusses how to improve your marketing through fresh links and mentions, and how you can use Fresh Web Explorer to achieve better results.",
  "content": "6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts Whiteboard Friday By: Rand Fishkin March 8, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 8, 2013 6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, we announced the release of our newest tool, Fresh Web Explorer. We're so excited to give marketers incredibly recent data in a tool to keep track of their mentions and links in a scalable way. In today's Whiteboard Friday, Rand walks us through improving our marketing through fresh links and mentions, and he explains how you can use Fresh Web Explorer to achieve the best results. Excited about Fresh Web Explorer? Have questions you'd like answered? Leave your thoughts in the comments below! Video Transcription \"Howdy SEOmoz fans, and welcome to another edition of Whiteboard Friday. This week, as you may know, we've been very excited to release Fresh Web Explorer. It's one of our latest tools. We've been working on it for a long time. A lot of work and effort goes into that project. Huge congrats and thank you to Dan Lecocq and Tamara Hubble and to the entire team who has been working on that project. Kelsey and Carin and everyone. So I wanted to take some time and talk through the value that marketers can get from Fresh Web Explorer and not just from Fresh Web Explorer, because I realize it's one in a set of tools, but also from things like doing regular Google 24 hour searches to look for brand mentions and links, using other tools like Radian6 or an uberVU, which is inside empowering, Raven Tools fresh links and fresh mentions section. You can do a lot of these things with any of those tools. I'm going to focus on Fresh Web Explorer for this part, but you can extrapolate out some ways to use this stuff in other tools too. So number one, one of the most obvious ones is trying to find opportunities for your brand, for your site to get coverage and press, and that often will lead to links that can help with SEO, lead to co-occurrence citations of your brand name next to industry terms, which can help with SEO, could help with local for those of you who are doing local and have local businesses mentioned. It certainly can help with branding and brand growth, and a lot of times helps with direct traffic too. So, when I perform a search inside Fresh Web Explorer, I'm getting a list of the URLs and the domains that they're on, along with a feed authority score, and I can see then that I can get all sorts of information. I can plug in my competitors and see links, who's pointing to my competitor's sites. Perhaps those are opportunities for me to get a press mention or a link. I can see links to industry sites. So, for example, it may not be a competitor, but anyone who's doing coverage in my space is probably interesting for me to potentially reach out to build a relationship with. Mentions of industry terms. If I find, you know whatever it is, print magazines that are on the web, or blogs, or forums, or news sites, feeds that are coming from places that are indicative of, wow, they're talking about a lot of things that are relevant to my industry, relevant to my brand and to what our company's doing, that's probably an opportunity for a potential press mention. Mentions of competitors brands. If a press outlet is covering, or a blog or whoever, is covering one of your competitors, chances are good that you have an opportunity to get coverage from that source as well, particularly if they try to be editorially balanced. Mentions of industry brands. It could be that you're in an industry that, and you're not necessarily competitive with someone, but you want to find those people who are relevant to your brand. So for example, for us this could include things like a brand like Gnip or a brand like HubSpot. We're not competitive with these brands, SEOmoz is not. But they are industry brands and places who cover Gnip and HubSpot may indeed cover Moz as well. Number two, I can find some content opportunities, opportunities to create content based on what I'm discovering from Fresh Web Explorer. So I plugged in \"HTC One,\" the new phone from HTC, and I'm looking at maybe I can curate and aggregate some of the best of the content that's been produced around the HTC One. I can aggregate reviews, get really interesting information about what's coming out about the phone. I might even be able to discover information to share with my audience. So, for example, we focus on SEO topics and on local topics. If we expect the HTC One to be big and we want to cover several different phones and how that's affecting the mobile search space, we can look at their default search providers, what sorts of things they do in terms of voice search versus web search, whether they have special contracts and deals with any providers to be tracking that data and who that might be going to, all those kinds of things, and we can relate it back to what we're doing in our industry. You can also Fresh Web Explorer to find the best time to share this type of information. So, for example, the HTC One comes out and maybe you're working for a mobile review site and you're like, \"Oh, you know what? This has already been covered to death. Let's do something else this week, or let's cover some other stuff. Maybe we'll hit up the HTC One.\" Or, \"Boy, you know what? This is just starting to get hot. Now is a great time to share. We can get on Techmeme and get the link from there. We can be mentioned in some of the other press coverages. We still have a chance, a shot to cover this new technology, new trend early on in its life cycle.\" Number three, we can track fresh brand and link growth versus our competitors. So a lot of the time one of the things that marketers are asking themselves, especially in the inbound field is, \"How am I doing against my competition?\" So I might be Fitbit, which is a Foundry cousin of ours. They're also funded by Foundry Group. They compete with the Nike FuelBand, and they might be curious about who's getting more press this week. We released a new version of the Fitbit, or we're about to, or whatever it is, and let's see how we're doing against the Nike FuelBand. Then when we have our press release, our launch, let's see how that compares to the coverage we're getting. Where are they getting covered that we are not getting covered? Where are we getting coverage where they are not? We can then use things like the CSV Export feature, which is in the top right-hand corner of the Fresh Web Explorer, and we can look at CSV Export to do things like, \"Oh, I want to filter out these types of sites. Or I only want a report on the high feed authority sites versus the low feed authority one. So I want to see only the places where my coverage is high.\" A note on feed authority though. Be very careful here because remember that a great page on a great site might be discovered through a low quality feed. It could be that a relatively junky feed is linking to some high quality stuff. We'll discover it and report on the feed authority of the source where we discovered it. So you may want to try using metrics like page authority and domain authority to figure out where are you being mentioned and is that a high quality site, not just feed authority. All right. Number four. Find fresh sources that link to or mention two or more of your competitors, but don't mention you. Now, this has been a classic tool. We've had a tool in our library at Moz, which is similar to SEO Book's HubFinder. Ours is called the Link Intersect tool, and what you can do here is you can plug in something like some ice cream brands and see how it writes. So \"Full Tilt\" and \"Molly Moons\" ice cream, and I actually want to put quotes around those brand names so that I can get mentions every time someone mentions the Moon and the name Molly that would pop in there, that wouldn't be ideal, minus D'Ambrosio, which is the best Seattle ice cream shop obviously. It's a gelateria. It's fantastic. Side note, it's possible that maybe owned by my cousin-in-law, but shh, let's not tell anybody. Okay, and then if I'm Marco over at D'Ambrosio Gelato, I can see where are Full Tilt and Molly Moons getting mentioned that aren't mentioning me. If it's, \"Hey, there was an article in The Stranger about ice cream and they didn't cover us.\" And, \"Hey the Capitol Hill blog didn't cover us.\" Maybe they don't know that we also have a Capitol Hill location. We should get in there and talk to those folks. We should mention, maybe leave a comment, maybe just tweet at the author of the post, whatever it is and tell them, \"Hey, next time you cover ice cream, you should also write about us.\" Number five. Compare sources coverage. So this is actually a bit of a teaser, and I apologize for that. So the operator site colon will not be available at lunch. So when you're watching this video, you probably can't use the site colon operator to see different sources and to run a search like the CRO site colon SEOmoz. However, it will be coming soon. When it is, you'll be able to compare, hey is SEOmoz or is HubSpot more active in covering the CRO topic? Are there different sources out there that maybe don't have coverage of a topic and I could go and pitch them for a guest post? I could find those content opportunities. I could know if a topic is saturated or if it hasn't been covered enough. Maybe I find sites or blogs that might be interested in covering a topic that I would like them to write about. I can see who's covered and who hasn't using this site colon operator to figure out the source and the level of coverage that they might have or not. The last one, number six, is really about reporting. Fresh Web Explorer is going to show you these great sort of trends about how is a particular term or phrase or link doing, links to a site, mentions of a brand name, mentions of a phrase or an industry term, whatever it is. So I can plug in things like my brand, SD, which is our link operator for just seeing links to anything on the sub-domain. I can plug in my sub-domain, and then I can see, here's how that's gone over the past 7 days or 30 days. I can screen shot that and put it in a report. I can download using the export functionality. I can download the CSV and then filter or scrub. A lot of times, for example, PR companies, companies that help you with your press will do this type of work. They'll assemble this kind of reporting. In fact, at Moz we use a firm called Barokas here in Seattle. Every week they send us a report of here are all the places that you were mentioned, and here are places that mentioned industry terms and that kind of stuff, which is really nice, but you're oftentimes paying a lot of money to get that reporting. You can actually do that yourself if you don't have a PR company that you're already using for this type of work. Of course, if you are a PR company, this might be an option for you to do that type of reporting. These six, they are only scratching the surface of what you can do with Fresh Web Explorer, and I don't doubt that I haven't thought of hundreds of uses yet for the data that's inside Fresh Web Explorer. I really look forward to seeing some cool creative uses from you guys out there, and I hope that you are enjoying the product. If you would like, please give us feedback. I know the team would love to hear from you on this, and they're constantly working and iterating and updating and adding in things like the site colon operator. So very cool. Thank you very much, and we will join you again next week for another edition of Whiteboard Friday. Take care.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}