{
  "url": "https://moz.com/blog/60-reasons-why-web-hosts-suck-2030",
  "slug": "60-reasons-why-web-hosts-suck-2030",
  "title": "60 reasons why web hosts suck! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With our combined experience over the years, we have seen the best and worst of web hosting companies.  Here’s a light hearted but rather jaded list of reasons web hosts who are not rockyfied! 1. Calling into customer support and waiting on hold for 40 minutes and the hold music is Ma...",
  "content": "60 reasons why web hosts suck! Moz News S By: seoteam-19551 April 1, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: seoteam-19551 April 1, 2007 60 reasons why web hosts suck! Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. With our combined experience over the years, we have seen the best and worst of web hosting companies. Here’s a light hearted but rather jaded list of reasons web hosts who are not rockyfied! 1. Calling into customer support and waiting on hold for 40 minutes and the hold music is Marilyn Manson! 2. You ask for RoR (Ruby on Rails) and the tech on the phone assures you he can provide that and yells “RWAAAAR” 3. Your hosting company just got bought out by a web hosting company you just transferred away from. 4. They claim to be a member of the BBB but later you find out their BBB is The Birmingham Bizarre Bazaar (quality fetish suppliers). 5. You call in tech support and a gentleman with an Indian accent says “Sir is your computer plugged in?” ...and you’re a woman 6. You sign up for domain privacy and later do a WHOIS and see your credit card information and SS number. “I was told I would get domain privacy!” “Miss, we thought you requested domain piracy” ...and you’re a man. 7. You ask the tech if he has a TOS and he says yes. You later find out he meant Totally Offensive Smells and your site has been suspended unexpectedly, you have no leg to stand on, and the tech’s response is “Oh, THAT TOS!” 8. The same tech who told you he has backups on your pre sales call turns out to be a wannabe singer and his “backups” are his 12 year old twin sisters who “doowop” when he busts a move in the bathroom. 9. You ask him how big his file size limit is and he responds, “That’s kinda personal...but what I can tell you is I leave the ladies smiling.” 10. The same tech (let’s call him Hubert since there’s a whole theme happening here) answers yes to your questions regarding shared server offerings. You later find out that Hubert is a very giving and generous guy and he “shares” your server space, bandwidth allocation, and resources with all the clients hosting on the same server as you…along with your personal information and email address! 11. When you ask Hubert how long they have been in business his response of 15 years reassures you that they are a legit and solid company. When you phone in to challenge this as their whois says 2006 he replies “Ohhhh, I thought we were talking DOG years!” 12. When your server goes down right before a big marketing campaign goes out. 13. Calling into support to ask a question and the rep cannot find your account because somehow it got deleted. OOPS! 14. Your host asks you to verify your account by repeating your password over the phone. Every time you say it, you hear a stifled giggle and they say “I’m sorry sir can you please repeat that?” Your password is IamTheBe$tLOVER 15. Your web host has automated support. After 23 minutes of keying in your SS number, last 6 digits of your credit card and your domain name (37 characters) you finally speak with a real person who requests the SAME information AGAIN! 16. After canceling your hosting account you are continually getting billed but now for 2 dedicated servers instead of your $100 a year hosting account. 17. After 36 straight hours of working on your new site's web design and meticulously putting every image in its place, you find out that your server crashed and there is no backup. NOOOOOOO!!! 18. Getting a deal on your first year and then having to renew at a more expensive price. 19. You have never been on the internet before and you decide to buy a hosting account and setup an email account through them. Within 20 minutes you already have spam!!!!! 20. Your host experiences power failure and they have no backup generators! 21. When you call your hosting company and ask why your servers went down, they respond with “No they didn’t. It must be a propagation issue or something with your ISP.” 22. You call support because your site is down and they say “We are going through an upgrade.” That works once, but when it happens every week sporadically during the middle of the day and they keep saying “It’s an update to help better serve you,” it SUUUUCKS!!!! 23. Your hosting company has a problem with spam and the filter is up so high that no mail is getting through, but when you are in a meeting and check your mail all there is in your inbox is porn spam and everyone is looking at you like you’re a sicko. 24. Every time you go to your website it’s down, but when other people go to it, it’s fine. Sometimes you will sit your friend down at his computer and you at yours and you phone conference each other to see if it comes up, and it does for him but not for you. You decide to go to his house and he to yours and see if it’s just your home computer but wherever you go your website will not be displayed. SUCKYVOODOONESS!!! 25. You call your web host support team because something is wrong with your site and they tell you that a widget 2.0 socket 5 cloud storm hit their data center and that’s why a page got deleted. IDIOT SUCKFEST!! 26. After many attempts of being patient with your web hosting customer support tech's inability to fix any problem, you get frustrated and a little upset. Later that day you find the following things wrong with your site: Your real estate site is unexpectedly not selling real estate anymore. You are selling liquor stores now. You just put up a very professional picture of yourself on your site and the next thing you know someone photo shopped your photo with a mustache, a black eye, and teeth missing. 27. When you bought your website and domain name through a sales rep at your first hosting company, the hosting company used the CEO’s name to register your domain name. Now you want to leave but they own your domain name. TRICKY WEB HOSTY!!! 28. You bought a hosting account through a template hosting agency because you don’t know html and their backend admin area looks cool. After you purchase this you find out that they don’t support their templates! 29. You are talking to smooth salesman Timmy over at a hosting company and he promises you 4 add-ons, forum management, bulletin management, free email marketing, and a $200 Google Adwords credit. After you sign up for their premier account for 5 grand a year, you notice that the freebies are not included in your package. You call back for Timmy but no one knows who Timmy is and a “Timmy” has not worked for them EVER! 30. You do not have log files! 31. Your log files are never accurate. 32. You started a lead generation site where people fill out forms for products/servers/newsletters, and in return you get their email addresses. Someone decides to give your site a virus and take over your mailing list and your web host cannot do anything about it. 33. Your built in traffic stats never work. 34. Your built in traffic stats are always off. 35. You purchase a large hosting account with a lot of extras, but when you need small things done you are nickeled and dimed 'til you are broke. 36. Your hosting company charges you to park domains. 37. You buy a hosting account with a ton of space but cannot put up multiple sites on it. 38. The only way you can put up multiple sites on your account is via your .htaccess file, but you have no freaking clue how to do that and your web host does not support that. GREAT that’s awesome good work!!!! 39. You actually love your hosting company because it’s a smaller no name company but the service is great. You tell all of your 5 friends to join and they do and their servers are overloaded. 40. You sign up for a web host by doing a Google search, and after you sign up you call their support line but find out they are a foreign hosting company in Germany and all their support techs speak German. Foreign SUCKY!!! 41. You sign up with your web host but you only get 1 MYSQL database. 42. Your web hosting company is in charge of sending you notification on domain name expiration but you never get yours. Your domain expires. 43. A cyber squatter picked up your domain name and is holding it hostage. You find out it’s the guy from your web hosting company's support team who you previously screamed at and called a stupid moron. 44. You utilize a free web hosting service but they place ads all over your page. 45. Your hosting company has backup servers but they are in the same geographical location, so when the power goes off the original servers go down AND the back ups go down. 46. Your hosting company cannot automate its billing and invoices, and it's all done by hand. Sadly, the accounts guy was recently paralyzed in a freak server accident and types by blowing into a straw. 47. Your web host goes “down” for 24 hour periods at a time. 48. Your user control panel consists of 2 options: On and Off! 49. You forgot to check “(web hosting name here) sucks” in Google before you bought your hosting account, and to your surprise there was over 1,000,000 pages indexed for that “company sucks.” 50. They offer SSH on shared servers and your site is constantly OWNED by 12 year old hackers. 51. They advertise domains for under $2 but when you complete the purchase your charge says $98? 52. You request support and they advise you that support costs extra! 53. You request a CPanel them change and they escalate your request to a System Admin! 54. They don’t tell the truth. They claim a lot of services that when you host with them, you find out they don’t offer. Like bandwidth, they’ll claim to provide x amount of bandwidth, then you find out they have a daily cap for using it and when you multiply the daily cap x 30 or 31, it is about 1/2 the size of the bandwidth they claim to provide monthly. 55. Canceling - they’ll claim they let you cancel anytime within the contract, but it turns out you can’t ever get a refund (you have to write a letter in your own blood to prove you are who you say you are, then send it to their office in Nome, Alaska that reads mail only once a year during the famous dog sled race). Of course, when you complain about these points, they point you to their TOS where it spells out the whole Nome and dog sled stuff, although it doesn’t mention the writing the letter in your own blood (the person on the phone just made that up to be funny). 56. When immediately after you sign up with them, they offer this great deal on more space/bandwidth/whatever…but you can’t get it because you are already a customer. 57. EVERYTHING is an extra charge, and you feel like you are getting nickle/dimed to death. 58. You get treated like you just won the “Imbecile of the Year” award. (Even if you do deserve that award, being treated that way is not nice.) 59. They pretend to help but can’t speak English….only geekspeak. And they refuse to repeat or explain any further. 60. They don’t have a community forum!!! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "60 reasons why web hosts suck!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "60 reasons why web hosts suck!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "seoteam-19551\n          \n            seoteam-19551"
}