{
  "url": "https://moz.com/blog/7-common-myths-about-search-engine-optimisation",
  "slug": "7-common-myths-about-search-engine-optimisation",
  "title": "7 Common Myths about Search Engine Optimisation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO is not for me because our site doesn’t get many visitors or transactions The statement alone answers why you need search engine optimisation, and you would be amazed with the amount of people who see this as valid reason for NOT implementing a search engine marketing campaign.  The reason that…",
  "content": "7 Common Myths about Search Engine Optimisation Online Advertising P By: Prodo February 14, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Prodo February 14, 2007 7 Common Myths about Search Engine Optimisation Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. SEO is not for me because our site doesn’t get many visitors or transactions The statement alone answers why you need search engine optimisation, and you would be amazed with the amount of people who see this as valid reason for NOT implementing a search engine marketing campaign. The reason that people are claiming this is a valid reason is there afraid of what they do not understand, and are unaware of the possibilities of search engine optimisation. Customers do not use search engines in our market Another common myth used once again by SEO uneducated individuals. With over 70% off all Internet users using a search engine during their time spent browsing the Internet no company can claim there is not a catchment for their market online. The best example is groceries: who would have though 5 years ago that people would be buying all their groceries online? SEO is IT, not marketing There appears to be an ongoing trend with these excuses for companies not wanting search engine optimisation. Another popular excuse is that SEO is IT and not marketing, or even business. Why would a car retailer want to get involved with complicated IT techniques when they can leave it up the IT people to deal with? SEO started out as an IT technique that only needed the IT-based people to worry about it. However, in today’s modern world, multi-department projects are important and SEO falls into that description: multi-departmental. You do not need to pay monthly fees for SEO--it’s a one-off event Search Engine Optimisation is actually an ongoing process that takes many months and has to be constantly updated and ‘tweaked’ to keep the site high in the SERP’s. Search Engines regularly change their search algorithms and the SEO firms need to be constantly updating your site. The algorithm used by search engines is so in-depth, with over 100 different considerations; the days of just having meta keywords are long redundant. I have tried SEO before and it had no effect We find this is a very common excuse: companies have tried search engine marketing and feel that it was a waste of money, giving them little to no improvement in sales. (Although it is extremely possible they were patient with their previous SEO firm and the firm they used was incompetent.) However, the majority of companies fail to understand SEO is a long-time commitment which you cannot expect immediate increase to 1st position in the SERP’s within a week. A second possibility is that the previous company promised and guaranteed a lot and failed to withhold their promise, once again lending credence to the idea that SEO firms who guarantee immediate success either use tricks and try to cheat the search engines, potentially risking your search entry, or are outright lying to get your business. SEO is a long-term commitment SEO firms will use tricks and eventually just get us banned from search engines Leading on from the previous excuse, too many SEO firms are prepared to cheat the algorithm and risk being caught by search engines. No firm who guarantees immediate success (e.g. make a new site top of the search engine results page for a general term within a month) is being truthful, and they do risk getting you banned from search engines. However, if the SEO is completed correctly and within the guidelines, then the website will not get banned from the search engines. SEO firms do use tools and techniques to improve your positioning on the SERP which are completely within the guidelines of the search engines. SEO is an immeasurable source of marketing Search Engine Optimisation can be measured and comprehensive feedback reported. Although immediate results may not be noticeable in sales or queries, unlike pay-per-click advertising, search engine marketing can provide a lot of feedback, including in-depth knowledge on the users of your site and their trends. I hope this entry helps provided a few answers to general myths and reasons for worrying about search engine optimisation and marketing. Do you have any more myths or common mistakes/excuses regarding all things SEM? Please feel free to leave your comment on our Blog Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Common Myths about Search Engine Optimisation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Common Myths about Search Engine Optimisation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Prodo\n          \n            Prodo"
}