{
  "url": "https://moz.com/blog/7-essential-google-intelligence-custom-alerts-that-keep-me-sane",
  "slug": "7-essential-google-intelligence-custom-alerts-that-keep-me-sane",
  "title": "7 Essential Google Intelligence Custom Alerts That Keep Me Sane - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a data analyst tracking more than 300 websites, the numbers are simply stacked against me. It's hard to give each and every site meaningful attention. Thankfully, the vast majority of these sites don't require active analysis, but I still needed to devise some kind of system that would let me…",
  "content": "7 Essential Google Intelligence Custom Alerts That Keep Me Sane SEO Analytics By: Rebecca Lehmann March 18, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Lehmann March 18, 2011 7 Essential Google Intelligence Custom Alerts That Keep Me Sane SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As a data analyst tracking more than 300 websites, the numbers are simply stacked against me. It's hard to give each and every site meaningful attention. Thankfully, the vast majority of these sites don't require active analysis, but I still needed to devise some kind of system that would let me know when something was afoot. Enter Google Intelligence. One of the fabulous things about Intelligence is that it's a lot more flexible than mere Goal Tracking. Goal tracking has three rigid options and gives you no email love, but Intelligence will send you love notes on just about any condition you can imagine. In lieu of a personal assistant, this lovely little beta is the thing that turns me from a frazzled, overwhelmed lone analyst into an analytics superhero. Well, at least as far as my account managers are concerned anyway. If you're tracking more websites than a single human brain can handle and want to go from zero to hero, the custom alerts described here are a few of the essentials. The numbers and periods should all be adjusted to meet your site's unique needs. Significant Traffic Drop If your traffic drops by 50% from the previous month, you definitely want to know about it. I run it as a monthly alert since many of our sites are small enough that traffic is inconsistent from week to week, and with more than 300 clients to track the sheer volume of alerts would be overwhelming, but weekly or daily could easily be appropriate for larger, more consistent sites. Grab it Traffic Spikes Clients don't always run their entire marketing plans by you, but they'll be impressed when you notice that referrals from their local newspaper are suddenly up. We have one client who runs regular Groupons that take their traffic from a couple hundred visitors a day into the thousands. That's good to know, right? Another simply had published a help wanted ad that generated a lot of traffic from applicants who were researching the company. It's a good opportunity to show that you are paying attention and to engage in a little positive reinforcement (\"That ad brought you X extra conversions, great job, keep it up!\"). It can also be a way to spot trouble. If you use the multiple subdomain code, it is possible to cross-contaminate your sites' data if you're not careful. Such cross-contamination renders as a traffic increase. Yes, we learned that the hard way - and it was a GI alert that brought it to our attention. Grab it Significant Drop in Goal Completions A traffic drop alert isn't going to detect a drop in goal conversions if lack of traffic isn't the problem. This can be a great way to help diagnose broken submission forms, shopping carts, etc. As with the traffic drop alert above, I run this one monthly due to the nature of our clients' sites and to avoid getting overwhelmed with frivolous alerts. You should adjust frequency and percentages to suit your sites. (Note that this alert is built on an advanced segment which combines phone leads with goal completions.) Grab it Analytics has flatlined If nothing else on this list matters to you, grab this one. Most sites will want to run this as a daily alert. It operates on the same principle as the traffic drop alert, but takes the percentage to the extreme. If this one is triggered, it's very likely that something has broken your analytics code. Very handy when you have a lot of cooks in the kitchen and aren't necessarily informed when someone makes change to the site. Grab it Spike in Goal Completions If my goals spike, I want to know. It's not a calamitous event like when they bottom out, but hey, I want to know how it happened! I want to investigate that, and I want whatever caused it to still be fresh in everyone's memories so we can document it accurately and add it to the play book! Grab it Significant Drop in Google Referrals I have two words for you: Farmer Update. The folks at Enrichment Depot posted a \"self diagnostic kit\" that uses a custom report to check your site for collateral damage, but what if you could automate something that would tell you if you were suddenly negatively impacted by Google's latest shenanigans? This custom alert is based on the premise that if you suddenly drop out of the top Google pages, your Google referrals will also plummet. It starts with an advanced segment that includes only Google referrals, then looks for a 50% drop in visits from that segment. So the next time you wind up on the wrong side of an algo update, or if, heaven forbid, you're penalized out of the blue, Google Intelligence will let you know. Grab it Direct Traffic Bounce Rate Over 70% Sounds awfully obscure, right? But let me tell you, this is a good one. It was inspired by a client who called us in a panic because he thought someone was somehow spamming his site. All of a sudden, direct traffic was sky high and the bounce rate went nuclear - not to mention that the big blue traffic line was skewed beyond all reality. A quick check of the service provider dimension quickly showed that the client himself was the source of all the trouble, and it became clear that somewhere in the setup process we had missed filtering out the client's IP address. He'd gotten the bright idea to set the company's URL as the home page of all the browsers in the office. Long story short, we figured that most people going directly to the site are doing so deliberately and aren't so likely to bounce out, so a high bounce rate could be used as a trigger for further investigation. In the first month we discovered four other clients whose IP filters also were missing, and if anyone else we may have missed gets the \"official homepage\" idea, we'll catch it early. Grab it What are your favorite custom alerts? Please share them in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Essential Google Intelligence Custom Alerts That Keep Me Sane"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Essential Google Intelligence Custom Alerts That Keep Me Sane"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Lehmann\n          \n            Rebecca Lehmann\n          \n            Rebecca Lehmann"
}