{
  "url": "https://moz.com/blog/7-key-ways-to-optimize-facebook-fan-page-seo",
  "slug": "7-key-ways-to-optimize-facebook-fan-page-seo",
  "title": "7 Key Ways to Optimize Facebook Fan Page SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The \"Social Media for the SEO Mind\" Mozinar was a great way to learn about SEO-optimization for social engagement on websites and fan pages. In today's post, Nathan Latka answers your Q&A questions and gives a few more amazing tips on optimizing your Facebook fan page for SEO.",
  "content": "7 Key Ways to Optimize Facebook Fan Page SEO (along with Mozinar Q&A) Social Media By: Nathan Latka December 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Nathan Latka December 5, 2012 7 Key Ways to Optimize Facebook Fan Page SEO (along with Mozinar Q&A) Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There are a lot of rumors going around about the proper ways to optimize your Facebook fan page SEO. Some people suggest using keywords in the filenames of your uploads, and others say you need to have every URL you own linked to your fan page. If you're anything like me, you don't particularly have time to sit around and search for a tip here and a tip there, only to find out weeks later that it did you no good. This post provides a few more tips on optimizing your Facebook page for SEO right now, and answers your Q&A questions from my Mozinar with Rand. Enjoy! 7 Ways to optimize your Facebook fan page SEO right now 1. Choose the best name for your Facebook fan page This may sound like a no-brainer. However, it's the most basic step when it comes to optimizing your brand on Facebook, and is also the most important. There is always the temptation to stuff your fan page name with tons of keywords, like \"Bob's Bakery - Muffins, Bagels, Cookies, Breads - Catering & Events.\" In actuality, having a name like this can hurt your viral growth rate inside Facebook. If you appear too spammy, your fans will be less likely to engage with your page, let alone share posts and updates with their friends. In fact, people can even hide your updates from their news feed - imagine the horror! Don't be too generic either, though. Facebook's intent behind fan pages is that they represent real businesses, brands, personalities, etc. By choosing something too generic, like Travel, Sports, Fishing, etc., you run the risk of Facebook shutting down your ability to post updates and reach out to new fans. Quick Tip: The first word in your fan page title is given the most weight (importance) by Google. 2. Create a custom fan page vanity URL After your fan page has 25 Likes, Facebook gives your you the ability to create a unique URL (or usernames as Facebook calls them) for the page. Because URLs are heavily weighted by search engines, it is vital that your fan page URL reflects an aspect of your business. If, by some misalignment in the stars, you find that another fan page has claimed your business' name already, make sure to include what your business is about in the URL. You can check out some different username options Facebook offers before selecting your one for your fan page. 3. Use keywords in strategic locations on your fan page Just like traditional websites, keyword optimization is the most fundamental form of on-site SEO. The most important pieces to pay attention to are the About section, Mission, and Company Description, since these areas are actually pulled from your fan page as SEO elements. Here is an example of how a search engine would index your page: SEO Title = Your fan page name Meta Description = Fan page name + the About section of your page H1 = Your fan page name To optimize your page for local searches, it is very important to include your Address, City, State, and Zip. For product-related searches, the Company Overview, Mission, and Products fields should be filled in with your appropriate information. Quick Tip: Just like your website's meta data, you may want to consider using a brief, 140- character description for your fan page so your whole message displays in the search engine's snippet. 4. Include your phone number and address As surprising as it sounds, there are a good amount of businesses out there that don't include this type of info on their fan page. As a majority of your sales may be from online traffic, it can appear to be not quite so important for you to include. But remember, indexing your brand for local search results is crucial to growing your Facebook fan page. In addition, Google places higher importance on pages with specific information like your business's phone number and address. So, pages that include this type of data can effectively increase your brand's overall SEO. 5. Backlink to your fan page on existing channels The more inbound links to your page, the more authoritative your page is according to Google, and you will be ranked higher. That is why it is very important to bloggers when they have their content linked to from other websites, blogs, etc. This same principle applies to your Facebook fan page. So, where it is appropriate, include a link to your fan page from your other digital channels, like your website, blog, and Twitter profile. 6. Optimize Facebook fan page status updates When posting updates to your Facebook wall, remember that the first 18 characters of a Facebook post serve as the meta description. So, take advantage of the option when Facebook prompts you to \"Write something...\" since that text will be considered the SEO title for that update. Including direct links to your small business website in your updates is also a good practice to follow. Quick Tip: Just like your fan page's name, Google places a higher importance on the first word of your update, so you may want to consider making that a keyword. 7. SEO for Facebook Notes Facebook Notes is something that is very under-utilized. When used appropriately, Facebook Notes can provide your fan page with an effective way at increasing your overall SEO. The SEO elements pulled in from Facebook Notes are: SEO Title = the title of your note Meta data = Your fan page name wrote a note titled, your note's title Facebook Notes gives your page the ability to create multiple \"pages\" underneath the main fan page. Notes are also a good way to expand on special offers or events that your business is hosting and have them indexed in search engines. Bottom line for Facebook fan page SEO Don't forget that the overarching objective of Facebook SEO is adding to the value of your overall brand. It is important to pay attention to the comparison between raw traffic and engagement level. While using the methods above can help boost your SERP ranking, the most crucial part is that it coincides with an awesome product and incredible engagement to grow your following. Your Mozinar questions answered #mozinar Tweets: Q: What companies do you recommend for social media software regarding community building (Hootsuite vs SocialSprout, etc)? (@franciscocmeza) A: Hootsuite is a very powerful tool for connecting with your Twitter and Facebook audiences. It is very easy to maintain a content schedule as Hootsuite provides you the ability to schedule social media posts. They also have a great analytics tracker and URL shortener. Mozinar viewer questions: Q: What tools do you suggest for doing competitor/keyword/site analysis? (Michael Cirillo) A: Great question. A lot of people might say Alexa.com, but I think there are some more in-depth tools available to you. Some good ones to look into are: Doubleclick Adplanner - A highly accurate tool from Google Doubleclick that is based on Google’s own data on site popularity. SEO Digger - A free tool that will tell you which keyword phrases different websites are ranking for. Compete - A very robust web analytics service, with free and paid versions. Another option (but usually second to the options above) is to look at the domain appraisal statistics (google \"domain appraisal\" for a list of free tools such as Estibot). These tools have various metrics that they feel bring a monetary value to your domain. We all like having something of value, right? I like tools that talk about page load time as well, which has bearing on SEO, but is often overlooked. Q: What about keyword stuffing penalties? (Mark Hultgren) A: Your site could be removed entirely from Google's index if you're penalized for keyword stuffing. Stick to your top six keywords at most. The better you curate your content, the better it will rank. Also, keep in mind that content located three paragraphs into your post won't rank well on your page unless it directly supports the thesis (typically the first 140 characters) of your page. Q: In reality, most Facebook pages appear page 2+ on Google. Is this a sign that Google is getting ready to give preference to G+ pages? (Marcus Lee) A: Yes, and you are smart to make the connection. Many SEO companies ignore G+ because there is nothing they can do (backlinks, internal links, external links, sitemap, meta-content, etc.) that can increase your G+ SEO. This number is strictly enhanced by users sharing, which means it actually represents a fan-base that is theoretically more organic. Google already gives preference to domains and links shared via G+, or so I have found in my experience. Q: Are there people having much success with using the iFrame strategy? (Jay Donaldson) A: The iFrame is an incredibly powerful tool. If you already have an online ordering page, it takes seconds to pull that in directly to your fan page. Check out this example of a fan page that uses the iFrame widget very well. Q: Is it recommended to keep the URL that you are linking visible, as opposed to deleting it after it has downloaded? I usually delete it so that the post gets more visually appealing. (Micheline Bourque) A: It isn’t important to keep the actual URL when it comes to SEO purposes, since your post will serve as the meta data for the link you shared. Deleting the full URL also helps out your viral growth rate by making your post a little prettier, and share-friendly. Q: I've had only 18 likes for about a month now, and I post engaging content all the time. What advice would you give for getting that boost in reach without Facebook ads? (Nick Hiley) A: Good question, and you are not alone here. The best starting point is to get your current customers onto your fan page. If you have a physical location, use some in-store signage to promote your page (and offer discount for liking the page). I really enjoy using this free resource for making your own signs. Another thing you can do is to include the link to your page in appropriate places. Your website, Twitter bio, and email signature are all places that the link could potentially go. In addition, when you post updates, use a specific call-to-action to share your content, as shares help your viral growth rate more than likes or comments. Q: How about using Facebook ads for commercial intent? I've heard it's more for social relationships. (Kareem Rombley) A: The important thing to understand here is why people use Facebook. We like to share silly pictures, interesting information, and personal events. Some businesses can fit into this platform very well, like photographers, restaurants, gluten-free muffin shops, non-profits, etc. These businesses can all play a part in our daily lives. The use of a fan page also should serve a specific goal for your business, whether it is lead nurturing, information sharing, sales conversions, or something more. Q: How many characters show from the About Section from the main Facebook page? (Emily Fearnley) A: About 155 characters will display on your Facebook Fan Page without users having to click the “About:” button. Q: I work for a marketing agency. Should our Facebook page be categorized as a \"Local Business\" or \"Companies & Organizations\"? Pros and cons? Does it matter? (Julie Barbee) A: The Company, Organization, or Institution category is best if customers don’t frequent your physical location, or if you hold events at varying places. A Local Business category is best if your agency deals with any locally owned business in your area. It will optimize the search results for those business owners and managers in your area looking for your marketing expertise. Well, there you have it, folks! Thanks for reading, and don't forget to leave a comment to share your thoughts with us. Have you used any of these SEO tips before? Did they work for you? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Key Ways to Optimize Facebook Fan Page SEO (along with Mozinar Q&A)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Key Ways to Optimize Facebook Fan Page SEO (along with Mozinar Q&A)"
    },
    {
      "level": "H2",
      "text": "7 Ways to optimize your Facebook fan page SEO right now"
    },
    {
      "level": "H2",
      "text": "Bottom line for Facebook fan page SEO"
    },
    {
      "level": "H2",
      "text": "Your Mozinar questions answered"
    },
    {
      "level": "H2",
      "text": "#mozinar Tweets:"
    },
    {
      "level": "H3",
      "text": "Mozinar viewer questions:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nathan Latka\n          \n            Nathan Latka\n          \n            Nathan Latka"
}