{
  "url": "https://moz.com/blog/7-lessons-learned-from-running-a-seo-agency-14225",
  "slug": "7-lessons-learned-from-running-a-seo-agency-14225",
  "title": "7 Lessons Learned Running an SEO Agency - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My first real company was an SEO agency. I was only 17 years old when I started it and I had no clue what I was doing. The only thing I knew was there was a business to be made from SEO because companies spent millions of dollars on pay-per-click advertising.\n\nI was fortunate enough to get my…",
  "content": "7 Lessons Learned Running an SEO Agency Advanced SEO By: Neil Patel October 18, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Neil Patel October 18, 2011 7 Lessons Learned Running an SEO Agency Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My first real company was an SEO agency. I was only 17 years old when I started it and I had no clue what I was doing. The only thing I knew was there was a business to be made from SEO because companies spent millions of dollars on pay-per-click advertising. I was fortunate enough to get my agency $10,000 to $20,000 a month in revenue within a year, but scaling the company to millions of dollars a year was a much harder challenge. Luckily I was able to get there as soon as I figured out how to close big SEO contracts that were in the million dollar range. If you want to create a big SEO agency that’s printing cash, it’s still possible. All you have to do is learn from my mistakes. Here’s what I learned over the years: #1: Run Your Agency Like a Businessman When you think about big SEO agencies who come to mind? Probably companies like Distilled and Blueglass, right? Although they are great agencies, they aren’t that big when you compare their revenue to companies like iProspect or 360i. Do you know why? It isn’t because companies like iProspect and 360i are better SEO agencies, rather it’s because they understand business and sales very well. When I first started out I would pitch companies on SEO by telling them how much more traffic I could get them and how high I could get them to rank on Google. I would also end the pitch with how much it would cost. Although that approach works, it’s not as easy as you may think. Can you guess why? Well the person who signs off on a six- or seven-figure contract doesn’t care about rankings, they care about revenue AND profit instead. It took me a few years to learn this, but once I did my minimum SEO engagement started at $240,000 a year and it went up to $1,200,000 a year. I was able to get large contracts because I changed the message of my pitch. Instead of pitching rankings, I would first figure out how much traffic a company was currently getting from search engines and their conversion rate. I would then take that data and multiply it with their average order size to get an understanding of how much revenue the company was making from organic search. From there I would break down how much more traffic I could get the company from: conservative, normal and aggressive estimates. I would break down the methods I would use, and give them a time range in which they could see these results. I would also share how much more revenue they would see on a quarterly basis from my efforts. Using their average revenue per customer number and their conversion rate percentage I was able to provide estimates on how much additional income I can bring to their business. Once I figured out that magic formula it wasn’t hard to tell a company that I wanted $300,000 per quarter because I was going to make them an additional $3,000,000 in quarterly revenue. When you’re pitching to companies, don’t make the mistake I did of pitching rankings, instead discuss the revenue and profit impact you are going to bring to the table. #2: It’s Harder to Get clients than to Keep Them One mistake I made with my agency is that I spent more time acquiring customers than trying to keep them. Instead I should have spent 75% of my time keeping clients and 25% of my time trying to acquire more. The better results you provide, the more clients you are going to get from word of mouth. Instead of just focusing on getting new customers, make sure you are satisfying your customers. You can do this by weekly calls, monthly reports, and sometimes even in-person meetings. But the best way you can make sure your customers are happy is to survey them. One consulting company who does a great job of this is Conversion Rate Experts. After every call, they send you a survey that contains questions like this: What were the three top highlights of the call? What is the one thing that you think will benefit you most from this call? What were the three worst aspects of the call? (Remember, we love blunt, honest feedback – we invest loads of time and money gathering it – and reacting to it). How could we have improved the call? If you notice, they don’t ask questions like “are you happy?” Rather they ask questions that will help them improve the service they are providing. Take a page out of Conversion Rate Experts book and ask your customers specific questions that will help you service them better. #3: Never Stop Building your Brand One of the reasons my agency took off was because I had a big brand in the SEO sector. During my peak I spoke at over 50 conferences a year, I blogged about SEO three times a week, and I constantly did free work for popular bloggers. In exchange they put my company's logo in the footer or sidebar of their blog. I didn’t stop there… I also started to spend $10,000 to $20,000 a month for advertising. I bought a banner on any major SEO sites that would sell it to me. Through all of these efforts business was flourishing and we were getting bombarded with requests from new companies. But after a while I got tired of blogging and traveling to conferences, so I slowed it down. Within a six-month period I noticed that incoming requests from potential clients were dying down as my agency stopped putting an emphasis on growing our brand. At this point we were focusing our time on satisfying clients instead of acquiring new customers. Like I mentioned earlier, focus 75% of your efforts on keeping your customers happy and 25% of your efforts on acquiring new customers. It’s all about finding the perfect balance instead of spending too much time on one or the other. #4: Keep Your Overhead Low One of the wisest things I did when I first started out was that I kept my overhead low. By running the agency in my parents' home for the first few years I didn’t have to pay rent and my mom could tell me who came into work and who didn’t because I was still in school at the time. However, as the company started to scale into the low six figures each month, I started to spend money a bit more lavishly. From staying in fancier hotels when traveling to having useless gadgets for employees to be entertained, I started to spend money like it was water. Luckily for me, my business partner started to see this and he helped me cut back on expenses, as this was very important when the recession hit. When it rains it pours. Losing one client will turn into two, and that can turn into three. So if you don’t keep your overhead low, you’ll have to start laying off employees… this is the last thing you want to do! Ideally your profit margins should be around 50% if not higher. It’s hard to do this when your revenue is below six figures a month, but none-the-less your profit margins should never be below 20%. Save your money for a rainy day because no matter how good of an SEO you are, there will be rough times. #5: Don’t Get Too Greedy As I got better at selling I stopped taking clients that could only afford to pay me $5000 a month. I had a strict rule: if you couldn’t pay me at least $20,000 a month on a one-year retainer, I wouldn’t take you on as a client. I was stupid! If taking on a client for $10,000 a month is highly profitable, you should sign them. By the time I learned that, it was a bit too late and once the recession hit the clients I lost tended to be the higher paying ones. Don’t get too greedy! Take on clients as long as they are profitable. Although they may not be paying you what you want, you can always upsell them later on. #6: Have Ironclad Contracts… that Automatically Renew As a consultant, when companies see the great work you are doing for them, they get happy. But as time goes on, they get used to the results and may start taking your work for granted. Fast-forward a year and your contract comes up for renewal. Clients tend to take for granted the good results you provided as they feel they were deserved because they paid you for them. And to a large extent they’re right. You won’t always get renewals, even if you provided excellent work. To avoid this, you need to start creating smarter contracts that benefit both you and the customer. Before starting an engagement, have clear goals set in place and in the contract you can state that if you hit those goals, the contract automatically renews for an extra year. It’s really easy to get clients to agree to this because mentally they’re thinking that if you provide results they’ll pay you all day long. However, once you start the engagement they may not feel this way, as they’ll tend to get used to the results and want more. So make sure you have an auto-renewal clause in your contract before you start any work. #7: Pick a Niche and Dominate It If I could turn back time, I wouldn’t create a SEO agency for just any type of online company. Instead I would have created a SEO agency that focused on startups as I have a lot of connections in Silicon Valley. If you create a SEO agency that helps out any type of company, you’ll be stuck competing with all of the seasoned SEO companies, which is tough. If you focus on one type of client, you can knock your numbers out of the ballpark. A good example of this is an agency called Single Grain. They only do SEO for companies located in San Francisco, California, and more particularly they do SEO for venture-backed startups. By having such a targeted niche they are able to get a lot of deal flow from VCs. Like I said, if I could rewind the clock, I would have done this, as I knew most of the big venture funds. It would have been easy for me get access to all of their portfolio companies. Focus on one niche as it will make your networking and marketing expenditures cheaper and much more effective. For example, if you targeted a geographic region like San Francisco you could do very well. There are a lot of big companies that are located in the Bay Area. Conclusion Don’t make the same mistakes I made when I ran a SEO agency. Learn from my mistakes and the chances that you’ll succeed are very high (assuming you can provide results). There’s still a lot of room in the SEO world, so if you don’t have an agency, it’s not too late to create one. If you do have one, constantly work on improving your company. Do you have any tips on how people can improve their SEO agencies? About the author: Neil Patel is the co-founder of KISSmetrics, an analytics provider that helps companies make better business decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Lessons Learned Running an SEO Agency"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Lessons Learned Running an SEO Agency"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neil Patel\n          \n            Neil Patel\n          \n            Neil Patel"
}