{
  "url": "https://moz.com/blog/7-reasons-why-you-should-not-use-google-analytics",
  "slug": "7-reasons-why-you-should-not-use-google-analytics",
  "title": "7 Reasons Why You Should NOT Use Google Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "1. StatisticsAll these statistics! Traffic, time on the site, bounce rate, oh my! Whatever happened to keeping it to just plain old \"hits\"? Plus, who possibly has the time to go through all of these measurements?...",
  "content": "7 Reasons Why You Should NOT Use Google Analytics SEO Analytics By: flyte new media July 22, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: flyte new media July 22, 2009 7 Reasons Why You Should NOT Use Google Analytics SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. 1. Statistics All these statistics! Traffic, time on the site, bounce rate, oh my! Whatever happened to keeping it to just plain old \"hits\"? Plus, who possibly has the time to go through all of these measurements?! Which leads to the fact that Google Analytics... 2. May Cause Addiction And yet they don't ever actually warn you of this. No Surgeon General's warning about the harm to women who are pregnant or may become pregnant. But from what I hear, you can easily be sucked into the abyss that is Google Analytics and suffer from a metrics-obsessed sickness. 3. Keywords and other so-called Traffic Sources Why would I possibly want to know where my traffic is coming from? I come from the school of surprise: I'd rather guess at my keywords, then hope and pray that they're actually working. Same with link building - I give it my best shot and just cross my fingers that someone will link to me. 4. Giving Big G too much information. Google sees everything you see. Think about that...they know everything. Do you really want to be responsible for giving them that kind of power? Supposedly that's the trade off for the fact that... 5. It's free. Ever heard you get what you pay for? Well...free says it all. I'm headed over right now to start researching some of those high priced Analytics programs that don't give me nearly as much applicable information. 6. It's impossibly difficult to set up, with an even more impossible interface Inserting the code? You'd need a top-notch developer for that kind of work. Plus...have you seen the likes of some of these other Analytics programs; how can GA compete? With paid analytics, I love the fact that I get to drill down far too deep to get entirely inaccurate \"hits\" and other impossible-to-explain measurements, with not a graph in sight. Sign me up. 7. Keep track of conversions What good could this possibly do me? I keep track of conversions by how many sales I make, how many newsletter signups I get, and RSS subscriptions I have. What...can I actually track where those people came from and what they did? That'd be a hoot... So if you know what's good for you, stay away people. Stay far far away. Go sign up for the most bogus Analytic system you can find, pay too much, spend too much time trying to figure out what \"hits\" means, and when you've pulled out all your hair, head back over to Google. The reality is...they really do know what's up. Addition from Jen Lopez: Fun post! Here are a few additional posts about Google Analytics we've had over the years: Don't Waste Your Money with Other Analytics Tools, Come to Google... Advanced Google Analytics - Zero Visits and Search Page Referrer New Features in Google AdWords & Google Analytics Another Look at Tracking Universal Search with Google Analytics Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Reasons Why You Should NOT Use Google Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Reasons Why You Should NOT Use Google Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "flyte new media\n          \n            flyte new media\n          \n            flyte new media"
}