{
  "url": "https://moz.com/blog/7-tips-for-surviving-pubcon",
  "slug": "7-tips-for-surviving-pubcon",
  "title": "7 Tips for Surviving PubCon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO conferences can be amazing opportunities for education and networking, but to get the most out of them, you have to survive until the end. If your average SEO conference is an endurance event, then PubCon is the Iron Man – 3 full days of sessions, followed by sponsored parties, followed by…",
  "content": "7 Tips for Surviving PubCon SEO Events By: Dr. Peter J. Meyers October 27, 2009 Table of Contents Copied! By: Dr. Peter J. Meyers October 27, 2009 7 Tips for Surviving PubCon SEO Events Conferences can be amazing opportunities for education and networking, but to get the most out of them, you have to make it to the end. If your average SEO conference is an endurance event, then PubCon is the Iron Man – 3 full days of sessions, sponsored parties, being dragged around Vegas by crazy people, topped off by a full afternoon of even more drinking (just in case you somehow managed to forget where the “pub” in PubCon came from). This year marks my 3rd PubCon, so I thought I’d offer some tips for getting the most out of your experience without ending up looking like this guy. 1. Plan Your Sessions Even before you leave for a conference, take some time to plan. Time flies onsite, and by Day 3, you’ll barely remember your name, let alone what the difference is between \"Track A1 - Social Media\" and \"Track A2 - Media in Society\". The Murphy's Law of conferences is that the 4 sessions you most want to see will all be in the same time slot. If a session just isn't cutting it for you, don't be afraid to get up and go somewhere else, unless you were foolish enough to sit in the front row. Pro Tip: If you do change sessions, please open and close doors quietly. It would be a shame if you were beaten to death with a laptop at your first conference. 2. Round Up A Posse What's the difference between you and an A-list SEO celebrity? Celebrities are constantly surrounded by their posses. You can gain instant celebrity by pre-building your entourage – get on Twitter and arrange to meet some folks for dinner the night before the conference starts. Then, follow those people around, each taking turns being the center of attention. People will automatically assume that you must be famous. 3. Stay Hydrated Like any endurance event, you have to remember to stay hydrated. If you see a free bottle of water, grab it, even if you’re not thirsty. The vending machines at the Las Vegas Convention Center do take credit cards, which may seem convenient, but you'll feel differently when you get home and your wife asks you why there are 7 pages of $3 charges on your Visa bill. Pro Tip: The IRS does not consider $600 worth of Pepsi to be a legitimate write-off. 4. Bring A Sweater Running a large event is grueling work, so it's no surprise that many conference organizers grew up in the Himalayas. Being near-Yetis, these otherwise helpful organizers labor under the assumption that everyone is comfortable at a balmy 50° Fahrenheit. By Day 2 of any conference, no matter how manly you think you are, you'll be begging to borrow the nearest hot-pink cardigan. Do yourself a fashion favor and bring your own sweater or dress in layers. 5. Buy a Power Adapter Laptops outnumber outlets by a ratio of 99:1 at any SEO conference, and even though you love your iPhone, let’s face it – it has the battery life of a crack-addicted drumming monkey. If you bring a portable power adapter, you'll not only be able to share outlets, but you’ll be a hero to anyone who comes along with a dying battery. Pro Tip: Save your last remaining plug for a celebrity – you never know when Matt Cutts may need to plug in his Android phone. 6. Know The Controversies SEOs love controversy, so try to have a few in your pocket for when you need a conversation-starter. Start with something easy and work your way up. Here are a few to get you going, from least to most controversial: \"What do you think of the new nofollow rules?\" \"I think Flash is just as SEO-friendly as HTML.\" \"Did you hear that Rand Fishkin eats puppies?\" Of course, you never know what side of a controversy any given person will be on – when in doubt, use these handy, pre-packaged phrases to keep the conversation going: \"Dude, that sucks\" \"Seriously, I know\" \"You should totally ask [insert expert] about that\" 7. Know When to Nap No amount of Red Bull can keep you awake for 4 days straight, and sooner or later you may need to sneak a cat nap. There are some comfy chairs in Vegas, but there's also a lot of competition, and napping on slot machine stools gets expensive fast. If you find yourself falling asleep during a session, just bury your head face-first into your iPhone or Blackberry. People will naturally assume that you're fanatically Twittering. 8. Bonus Tip! That's right – 8 tips for the price of 7, because that's just the way I roll. Pay attention, because this one is important. Whoever wrote the motto \"What happens in Vegas, stays in Vegas\" clearly doesn't work in our industry and has never heard of this thing called the internet. Of course, from a marketing standpoint, \"What happens in Vegas will probably be photographed on a cell phone, Tweeted, Re-tweeted, posted on Facebook, and tagged for the entire world to see\" doesn't really have much of a ring to it. Don't Forget to Say \"Hi\" This isn't really a tip, but if you're a Moz community member, don't be shy about introducing yourself. SEOmoz is also going to be hosting a special event you won't want to miss (more details coming very soon). Hope to see you there! (Las Vegas sign photo licensed from iStockPhoto.com) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Tips for Surviving PubCon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Tips for Surviving PubCon"
    },
    {
      "level": "H3",
      "text": "1. Plan Your Sessions"
    },
    {
      "level": "H3",
      "text": "2. Round Up A Posse"
    },
    {
      "level": "H3",
      "text": "3. Stay Hydrated"
    },
    {
      "level": "H3",
      "text": "4. Bring A Sweater"
    },
    {
      "level": "H3",
      "text": "5. Buy a Power Adapter"
    },
    {
      "level": "H3",
      "text": "6. Know The Controversies"
    },
    {
      "level": "H3",
      "text": "7. Know When to Nap"
    },
    {
      "level": "H3",
      "text": "8. Bonus Tip!"
    },
    {
      "level": "H3",
      "text": "Don't Forget to Say \"Hi\""
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}