{
  "url": "https://moz.com/blog/75-content-starters-for-any-industry",
  "slug": "75-content-starters-for-any-industry",
  "title": "75 Content Starters for Any Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Suffering from blank page anxiety? Before you go on the hunt for inspiration all over the Internet and elsewhere, turn to the resources around you. Realize that you can create exceptional content with what you already have at hand.",
  "content": "75 Content Starters for Any Industry Content Marketing By: Amanda Blau February 6, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Blau February 6, 2014 75 Content Starters for Any Industry Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Suffering from blank-page anxiety? Before you go on the hunt for inspiration all over the Internet and elsewhere, turn to the resources around you and realize that you can create exceptional content with what you already have at hand. Thinking of content topics doesn't have to be such a long and grueling undertaking. Use the following starting points the next time you need an idea. Individual achievement Talk about a transition to a new role and how you had to adapt your skills to succeed. Think of lessons you learned the hard way and share with those who are just starting out. Describe your thought process for approaching different tasks in a way that will help others be better organized or prepared. Write about a mentor figure or a brand you admire. Explain why this person or company has excelled, and how others may be able to follow a similar path. Share your action plan for the future. Give people a sneak peak of what's to come and talk through the steps you'll take to accomplish your goals. Shining example: Rand's announcement of his changing role at Moz Tools Create a video tutorial that walks people through how to use a tool for a specific task. Review a new or lesser-known tool that you believe more people should use. Present creative, alternate ways of using a tool, including plugins and combinations that make using multiple tools together advantageous. If there's an in-house tool that you use, put together a case study of why it's better than some of the commercial tools that other brands use. Perform the same task with a few different tools. Note which one is most cost effective, easiest to use, saved you the most time, etc. Shining example: KISSmetrics' Google Analytics Dashboard Secrets Lists Compile resources for different subjects and skill levels. Gather content that shows the best examples of what people should be striving for. Rank your favorite tools, blogs, ads, etc. Give reasons why someone should or should not follow a certain tactic or strategy. Curate useful content and put together \"best of\" lists. Shining example: Point Blank SEO's Complete List of Link Building Strategies Internal resources Ask the sales team what their most common roadblocks are. What content can you put together that will aid them in illustrating the solution? Sit in on meetings in different departments. Take what you've observed about their communication styles and workflow and turn it into content about processes such as effective ways to brainstorm or overcoming internal objections. Find out what questions your account managers get asked most frequently. Put together a blog post or other resource that lays out the answers. Request that every department share their biggest accomplishments on a monthly or quarterly basis. Select at least one to develop a case study. Get to know your coworkers. Find out more about their backgrounds, their daily routines, and future aspirations. You can highlight employees in a video or blog series introducing your team, or better yet, you can learn a new way of thinking or working that you can write about. Shining example: Fi's interactive Sony Case Study Industry Find an opinion piece that people in your space are discussing. Back it up with new research or make a case for the other side of the argument. Explain the steps that your company is taking in response to a new policy affecting your industry. Introduce a new technique or strategy you're using. Detail why this could work better than industry techniques that are becoming stale. Comment on a trend you see emerging and why or why not it should continue. Share tips and best practices. Shining example: Copyblogger's How to Write the In-Depth Articles that Google Loves How-to Have each person on your team write down a five step process that takes them through a daily task start to finish. This can be used for an email campaign or a blog or video series. Ask your leadership team for pointers on how they've developed the business and how they keep it running smoothly. What skills would be helpful for your customers to have so that they could better understand your product/service or use it more easily? Teach them. Write down the steps you took in a successful campaign. Layout this process so that it can be repeated. Interview several experts on the same topic, asking each how he or she accomplishes a certain goal. Shining example: Wistia's Intro to Video SEO Company culture Get involved in your community and volunteer. Talk about what you're doing and why it's important to you. Ask coworkers to each share one benefit of working at the company that they've never experienced at another job. Have someone from the leadership team discuss the company's core values and why they are integral to the brand. Congratulate new hires and talk about why they're great fits for the team. Let interns shadow an employee for a day and write about what a day in the life of someone in this role entails. Shining example: Buffer's transparent look at their salary formula Educational series Teach a skill or illustrate how to use a tool or software. Put together a set of lessons that will take someone through an entire plan or strategy. Summarize long articles or eBooks into short snippets, highlighting the actionable takeaways. Create quizzes and interactive lessons and then post a walkthrough of how to arrive at the correct answer. Host a workshop or lunch and learn for your team internally, and film it or have someone create a summary. Shining example: Field Museum's The Brain Scoop Events As soon as the list of speakers comes out for a big event in your industry, select a few who are covering topics in which your audience is interested and reach out to see if they will do an interview or guest post for your site. Scan the live tweets and recaps of conferences you weren't able to attend. Find common themes and determine the hot button issues that emerged. Contribute your unique perspective on these subjects on your blog. If someone from your company speaks at an event, have him write a bonus blog post that expands on something in his presentation. Make sure he posts his slide deck on SlideShare and links to the blog post in it. Put together a list of all the conferences, meetups, and networking nights in your area. Rank them, talk about why people should attend, compile basic information like cost and dates… make this a robust, go-to resource. Go above and beyond the traditional recap of what you learned. After a set time period of putting those lessons into practice, demonstrate the use of your new skill set with a mini case study of your results. Shining example: aimClear's measurement of #NMX speakers Research A/B test everything you do for your internal marketing. Write up the results and draw conclusions that can lead to best practices. Create a survey about the tools and tactics people in your industry are using and which they find most effective. Analyze market research about consumer behavior relative to your audience and present a study. Find a popular study done in the past few years and update it with new research and fresh insights. Walk your audience through the research and measurement process at your company. Shining example: ESPN teaming up with Medium to ask people about the World Cup Theories Write about why you believe a certain trend has emerged and what this means for the future. Give advice for a hypothetical client or user. Relay the possible causes for results that you've seen in your analytics data. Make a prediction about how a new policy or technology will impact how you do business in the future. If there was one aspect of your role you could add or takeaway to make your job easier, what would it be and how would it make you more productive? Make a case for it. Shining example: Distilled's Don't Silo Me, Bro: Integrating Content Strategy Across Disciplines Higher-level overviews Create a resource with the definitions of basic industry terms. Give a periodic update on the state of your industry. Take content filled with technical terminology and industry jargon and simplify it to a beginner's version. Use an analogy to clarify and simplify a subject that would be otherwise difficult to explain to someone outside of your field. Illustrate how the different teams and departments in your company work together cohesively in a basic framework. Shining example: Edelman's Sponsored Content: An Ethical Framework Promotional Host a contest and give away a new product, tickets to an event, or a free consultation. Highlight employees who have been nominated for or received awards and let people know why they deserved that honor. Share customer testimonials. Remind your audience about the details of your Twitter chat and prompt them to help generate questions for the discussion. Enumerate new features of your product or service. Shining example: SMX's \"Biggest Search Geek\" Contest Seasonal On Valentine's Day, reveal yourself as a not-so-secret admirer of one or more brands. Let them know why you enjoy their content and how you strive to emulate a certain aspect of their business. Give a shout out to some of your best employees for Labor Day. For Thanksgiving, personally thank some of your biggest brand fans. During the holidays, send small physical gifts to people in your audience or even industry peers and then write a blog post or make a video saying what you're sending and why. Discuss your New Year goals and how the changes you plan on making will a better experience for your audience. Shining example: Shopify's 8 New Year's Resolutions Every Ecommerce Entrepreneur Should Make Out of the box Respond to email feedback (positive or negative) through a blog post or video. Write a satire piece about a recurring problem in your industry. Dig through old posts and republish with updates. Explain why your thoughts and recommendations have changed over time. Do some pro bono work and turn it into content about your capabilities. Make over your \"About Us\" section, spruce up your 404 page, or whatever else seems lackluster on your site, and then feature it in a special before and after content unveiling. Shining example: Business Casual Copywriting's \"Dead Page\" Your turn Whether or not you decide to use these exact ideas, I hope I've given you some directions to explore. Think hard, collaborate with smart team members, and make these your own. Brainstorming should start broad before the content manager or editor-in-chief narrows down ideas based on marketing goals, target personas, and availability of resources. For a more in-depth look at that process, check out the eBook I created for iAcquire, Content Strategy for Digital Marketers: A Six Week Guide to Creating, Promoting, & Measuring Great Content. You want to make sure you have the right structure in place because as we all know probably too well, good ideas don't always pan out the way we hope for when they're not part of a well-crafted strategy. No matter which post topics you choose, remember to infuse these ideas with personality, data, and insights that only you and your brand can offer. Publishing content that provides value no one else can is what truly leads to the traffic, social shares, and links you crave. If you've had success with ideas like this in the past or if you have plans to try out something new, I'd love to hear about it in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "75 Content Starters for Any Industry"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "75 Content Starters for Any Industry"
    },
    {
      "level": "H2",
      "text": "Individual achievement"
    },
    {
      "level": "H2",
      "text": "Tools"
    },
    {
      "level": "H2",
      "text": "Lists"
    },
    {
      "level": "H2",
      "text": "Internal resources"
    },
    {
      "level": "H2",
      "text": "Industry"
    },
    {
      "level": "H2",
      "text": "How-to"
    },
    {
      "level": "H2",
      "text": "Company culture"
    },
    {
      "level": "H2",
      "text": "Educational series"
    },
    {
      "level": "H2",
      "text": "Events"
    },
    {
      "level": "H2",
      "text": "Research"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Theories"
    },
    {
      "level": "H2",
      "text": "Higher-level overviews"
    },
    {
      "level": "H2",
      "text": "Promotional"
    },
    {
      "level": "H2",
      "text": "Seasonal"
    },
    {
      "level": "H2",
      "text": "Out of the box"
    },
    {
      "level": "H2",
      "text": "Your turn"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Amanda Blau\n          \n            Amanda Blau"
}