{
  "url": "https://moz.com/blog/8-copy-editing-tricks-to-make-you-look-professional-whiteboard-friday",
  "slug": "8-copy-editing-tricks-to-make-you-look-professional-whiteboard-friday",
  "title": "8 Copy Editing Tricks to Make You Look Professional - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Editing your own writing is the worst part of writing, no matter your profession. In today's Whiteboard Friday, our very own Community Attachè shares her tips for turning the arduous process of editing into something beautiful.",
  "content": "8 Copy Editing Tricks to Make You Look Professional Whiteboard Friday By: Erica McGillivray December 21, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray December 21, 2012 8 Copy Editing Tricks to Make You Look Professional Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Top secret: editing your own writing is the worst part of writing. We all hate it, whether we label ourselves writers, SEOs, Doctor Who fans, and/or magical princesses. Stepping back from your own writing to give it polish is hard. Typos, badly constructed paragraphs, awkward phrases, or just general poor writing jump out when someone else writes it. But moi? I would never do that. And neither would you. However, reality is that today no matter our titles, most of us are required to write, and we need editing help. I hope you'll be able to find some tips to help you in what can sometimes be an arduous process. But maybe you'll find a little love, a little magic, and transform your writing into something beautiful. P.S. Advanced grammar students: go forth with the diagramming of sentences. \"I really do not know that anything has ever been more exciting than diagramming sentences.\" -- Gertrude Stein Video Transcription \"Howdy SEOmoz fans. It's Whiteboard Friday. I'm Erica, and I'm the Community Attachè here at SEOmoz. Today we're going to talk about copy editing and things you can do to make yourself look more professional. I realize many of you, we started out as SEOs. A couple of years ago, in the industry, it was like keyword research. Where am I ranking? The most copy you ever wrote was like a meta description, maybe a product description. But today, the world of SEO, as we know, is drastically changing. We're doing all sorts of copywriting these days. Content marketing is huge. You've got guest blogging. We're all over, and a lot of you are really frustrated because you're like, \"Man, I wish my writing was better. I wish I had a writer on my staff to help me out.\" But sometimes you are that person who is doing a little bit of everything. I've totally been there. So today we're just going to talk about how to make your copy editing magical and make you look a little more professional. People will be like, \"Wow, I knew you were an amazing SEO. I didn't know what a great writer you were too.\" So these are some little handy-dandy tricks I try to remember any time I am writing. So the first thing you want to do is you want to identify your why. Why are you writing this piece? What are you trying to accomplish by going out there and talking about it? Like when I sat down to outline my Whiteboard Friday, I said, \"I have this knowledge about copy editing. I want to share it with SEOmoz's audience because I know you'll find it valuable, especially if you're going to write a YouMoz or something. So if you can focus really on your piece and figure out that why it is so important with you, that's really going to make sure that your piece, that your writing comes together. If you're writing about kittens or unicorns or if you're writing a serious piece about using Google Analytics, importing into Excel, and doing all the crazy, amazing SEO things I know all of you know how to do. So the second thing that you want to focus on is finding your voice. Every writer writes a little bit differently, just as every person is a little different. As you continue to write and continue to practice, there will be certain words you use. There will be certain ways you phrase things that really identify who you are. One of the funnest things I like to play with is using styles or voices from other people. So, for instance, I've totally written a blog post as Rand, and it was kind of funny. Can I sound like Rand? Where can I go? Or I used to - and now Ashley our content specialist has taken this over - write the SEOmoz newsletter. One time I wrote as Roger, but as Captain Kirk doing a little captain's log. So you can have a lot of fun with your voice and your style. Don't be afraid to be a little kooky. Give it a little personality. Show who you are. Show what you're interested in. The third tip, which is going more, once you've written your piece, you're kind of pulling back into the finer editing stage. Read your work aloud. Just do it. Sit there and go slowly. If you have to print it out, do it old school, and just read every word you've written. When I was a kid, I had this problem where I would always skip over the little words like the, a and. My teachers would just paper full of red. Like what happened? I finally broke that habit when I went to college, and I started printing out my essays and reading them slowly aloud. I'm sure my dorm mate was like super thrilled to hear my essays about ancient Celtic languages, for instance. But it will so much improve your writing, because you'll notice things. You'll read it and you'll like, \"Wow, this doesn't make any sense. What was I even thinking?\" It helps with some of those more embarrassing typos or confusion if your sentences are getting really long and complicated, especially as you're diving into more advanced topics. So my fourth tip is put your writing aside. I'm sure many of you have suffered from writer's block or just frustrations when you get to the editing part. You just don't want to let it go. Writers often call this killing your babies, which is kind of vulgar maybe. But we get really attached to what we've written, and we can't always see how to edit it and how to bring it back in and really refine our piece. Maybe you start a draft and you set it aside and maybe you come back to it tomorrow. Maybe you come back to it six months to a year from now. You never know when it's . . . if it's something you love and it's something you're passionate about, maybe you can't push it. But sometimes maybe it's just that 24 hours, because I realize a lot of you are also out there writing things that are super time sensitive that you have to get out right away, which brings me to the next point. Ask a friend to edit. If you're doing something really time sensitive, this is extremely helpful. If your friend has any editing experience, it's even better. You never know what crazy typos you're going to send out into the world or what crazy communication flubs, or maybe your piece just needed like five paragraphs cut out of it. Having someone you trust and someone who you can respect their opinion goes even further. You definitely don't want to do things like I've done where I was sending out an email about fly fishing clothing and in the subject line I put, \"Flying fishing clothing sale today\" or something like that. It just really helps you from making that mistake and then going, \"Oh, what did I do? Oh no.\" Friends can also be great at telling you what's good about your writing and encouraging, bringing those themes out. I just wrote an essay about Dr. Who. My editor came back to me, and she was like, \"You know, you've been doing too much recapping. Cut this, cut this, cut this.\" I was kind of sitting there like, oh my gosh, wilting flower. I don't want to kill my babies. But what my editor was great about was she said, \"You know, I really love what you're doing here and here and here. Let's bring that out.\" So at the end of the day, I had to do a super bunch of editing, but it helped me to know what the best things were out of that piece too. So criticism is both a negative and a positive. Getting a little more into the technical, a lot of you out there are like, \"How can I be better with my grammar?\" I get a lot of questions from people at SEOmoz about grammar things, like, \"Should I put a comma here? What the hay. Where do I go? How can I improve my grammar stuff?\" The first thing, which I suggest, is looking at what's called active versus passive voice. Active means exactly what you all know the word means. Active means that you're out and about. Your language is springy versus passive it's just kind of in the corner. It's like the wallflower at the party. You don't really care. So, for instance, if you had the sentence, \"The dog was jumping on the bed.\" Your dog is bad. Your dog is jumping on your bed. But it's just kind of boring. If you're like, \"The dog jumps on the bed,\" it's much more active. It tells you what the dog is doing. It brings that sentence to life. Often it's just a simple switch of moving what you're talking about at the end to the beginning. You can look up more about active versus passive voice online. It's known to be verbs are passive. The next thing you want to do is look at your sentence lengths. You want to vary them. A lot of people get really long winded when they're writing because they're trying to cram everything in. You get these super long sentences that are all the way to the ground. If you just step back and look and be like, \"Oh, I can put periods here. I can shorten it.\" You can have a short sentence and a long sentence. It's a little advanced, but it will make your writing much more snappy and sound like people actually converse. For those of you who are really, really advanced in your grammar, here's my last tip. Learn to diagram sentences. I'm sure my 7th and 8th grade English teachers are very happy that I'm recommending this to you. But if you really want to know grammar and if you really struggle with it, learn how to diagram sentences so you can identify the subject of your sentence, the verb of your sentence the object, and any sort of clauses or anything. Then you can figure out, if people come to you and say like, \"You always have run-on sentences, you always have incomplete sentences,\" these are the type of things that if you can identify the parts of the sentence, you can say, \"Oh, I know exactly why this sentence isn't working. Or I know why it's not communicating clearly to my audience.\" But that's just your advanced homework. So I hope that all of you will learn these magical tips and transform your writing. You can now go from just an ordinary SEO to something more magical.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Copy Editing Tricks to Make You Look Professional"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Copy Editing Tricks to Make You Look Professional"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}