{
  "url": "https://moz.com/blog/8-easy-wins-for-on-page-seo",
  "slug": "8-easy-wins-for-on-page-seo",
  "title": "8 Easy Wins for On-page SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes, in the midst of massive link-building and social media campaigns, we need an easy win. Here are a few simple on-page changes that can have real SEO impact.",
  "content": "8 Easy Wins for On-page SEO On-page SEO By: Dr. Peter J. Meyers April 19, 2011 Table of Contents Copied! By: Dr. Peter J. Meyers April 19, 2011 8 Easy Wins for On-page SEO On-page SEO Even the best advice is useless if you can’t put it into play. As a consultant who started his professional life as a coder, I always try to consider the effort and cost of implementing any changes I advise. Don’t get me wrong – some difficult changes have to be made, despite the pain. Usually, though, there are a few easy wins that won’t take days of development or thousands of dollars to put into play. I’m going to give you 8 fixes to on-page SEO problems that I see pop up regularly… “Easy” Isn’t Always Easy A quick disclaimer – what’s “easy” for one person or on one platform might not be so easy on another. Sitewide changes (TITLE tags, for example) can be tricky, but they’re generally a lot easier than a complete redesign or a switch to a new platform. One area I won’t mention in this list is improving your URLs. Although that can be a powerful tactic, I’m seeing too many people who want to make relatively minor changes to URLs for SEO purposes. Sitewide URL changes are risky and often difficult to do correctly – they aren’t worth it to go from “good” to “slightly better”. The changes I’m proposing here are generally low-risk. 1. Canonicalize Internal Duplicates While there may not be a duplicate content penalty (with a Capital “P”), there can be serious consequences to letting your indexed pages run wild, especially in a post-Panda world. Google often does a poor job of choosing the right version of a page, and low-authority sites can end up diluting your site's index and pushing out deeper, more important pages (like product pages). There are three common varieties of internal duplicates, in my experience: Duplicates caused by session variables and tracking parameters Duplicates caused by search sorts and filters Duplicates caused by alternate URL paths to the same page If search spiders see a new URL for the same content (whether that URL appears static or dynamic), they’ll see a new page. It’s important to canonicalize these pages. When the duplicates really are identical, using the canonical tag or a 301-redirect is often the best bet. In some cases, like search sorts or pagination, the situation can get more complicated. 2. Write Unique TITLE Tags The TITLE tag is still a powerful ranking factor, and it’s still far too often either abused or neglected. Pages that you want to rank need unique, descriptive, and keyword-targeted TITLE tags, plain and simple. You can easily track duplicate page TITLEs through the SEOmoz PRO Campaign Manager, including historical data: This data is available from multiple locations, including the Campaign Dashboard and “Crawl Diagnostics” tab. You can also track exact duplicates in Google Webmaster Tools. You can find it under “Diagnostics” > “HTML Suggestions”. The solution here is simple: write unique TITLE tags. If you have a huge site, there are plenty of ways to populate TITLE tags systematically from data. Writing some decent code is well worth it to fix this problem. 3. Write Unique META Descriptions While the META Description tag has little or no direct impact on ranking these days, it does have 2 important indirect impacts: It (usually) determines your search snippet and impacts click-through rate (CTR). It’s another uniqueness factor that makes pages look more valuable. Again, there are plenty of ways to generate META descriptions from data, including just using snippets of product descriptions. Try to make descriptions meaningful and attractive to visitors, not just pseudo-sentences loaded with keywords. 4. Shorten Your TITLE Tags Long TITLE tags tend to weaken the SEO impact of any given keyword, and can also turn off search visitors (who tend to skim results). The most common culprit I see is when someone adds their home-page TITLE to the end of every other page. Let’s say your home-page TITLE is: “The Best Bacon Since 1983 | Bob’s Bacon Barn” Then, for every product page, you have something like this: “50-pound Mega-sack of Bacon | The Best Bacon Since 1983 | Bob’s Bacon Barn” It may not look excessive, but you’re diluting the first few (and most important) keywords for the page, and you’re making every page on the site compete with your home-page unnecessarily. It’s fine to use your company name (or a shortened version, like “Bob’s Bacon”) at the end of all of your TITLE tags, but don’t repeat core keywords on a massive scale. I’ve seen this go to extreme, once you factor in long product names, categories, and sub-categories. 5. Re-order Your TITLE Tags On larger, e-commerce sites, it’s common to list category and sub-category information in TITLE tags. That’s fine up to a point, but I often see a configuration that looks something like this: “Bob’s Bacon | Bulk Products | Bacon Sacks | 50-pound Mega-sack of Bacon” Not only does every TITLE tag on the site end up looking very similar, but the most important and unique keywords for the page are pushed to the very back. This is an issue for search usability, too, as research has demonstrated that the first few words in a title or headline are the most critical (possibly as few as the first two). If you’ve got a structure like the one above, flip it around: “50-pound Mega-sack of Bacon | Bacon Sacks | Bulk Products | Bob’s Bacon” It’s a relatively easy change, and it’ll put the most important keywords up front, where they belong. It will very likely also increase your search CTR. 6. Add Direct Product Links On sites with 100s or 1000s of pages, a “flat” architecture isn’t possible or even desirable. So, you naturally end up taking a hierarchical approach where products are 3+ levels deep. I think that’s often fine, if the paths are clear to crawlers and visitors, but it can leave critical pages with very little ranking power. One solution is to pull some of your top sellers to the home-page and link directly – this effectively flattens the architecture and pours more link-juice where it’s needed. Don’t go overboard, but a “Featured Products” or “Top 10 Sellers” list on the home-page can really help boost important deep pages. 7. Re-write Internal Anchor Text I’m amazed how often I see internal links, even main navigation links, given cryptic, vague, or jargon-loaded labels. If you’re trying to rank your category page for “kid’s clothing”, don’t label the button “Apparel (K-12)” – it’s a bad signal to search engines, and it probably doesn’t make much sense to visitors. Your internal anchor text should reflect your keyword strategy, and your keyword strategy should reflect common usage. Use labels people understand and don’t be afraid to be specific. 8. Remove 10 Low-Value Links There’s an old adage in copywriting – say what you need to say in as few words as possible, and then, when you’re done, try to say it in half that many words. I think the same goes for internal linking. If most of your inbound links are coming to the home-page, then your site architecture is the single biggest factor in flowing link-juice to deeper pages. It’s natural to want to link to everything, but if you prioritize everything, you effectively prioritize nothing. Find 10 links on your home-page that are either low priority for search or that visitors never click on (a click-mapping tool like Crazy Egg is a great way to test this), and remove them. Focusing your remaining link-juice is an easy way to boost your most important pages. I’d love to hear any tips you may have for easy wins on-page. I’d also recommend Rand’s post on building a perfectly optimized page. While link-building is critical, fixing on-page issues is often a lot easier and can have an immediate impact, so it’s important not to ignore either front of the SEO battle. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Easy Wins for On-page SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Easy Wins for On-page SEO"
    },
    {
      "level": "H2",
      "text": "“Easy” Isn’t Always Easy"
    },
    {
      "level": "H2",
      "text": "1. Canonicalize Internal Duplicates"
    },
    {
      "level": "H2",
      "text": "2. Write Unique TITLE Tags"
    },
    {
      "level": "H2",
      "text": "3. Write Unique META Descriptions"
    },
    {
      "level": "H2",
      "text": "4. Shorten Your TITLE Tags"
    },
    {
      "level": "H2",
      "text": "5. Re-order Your TITLE Tags"
    },
    {
      "level": "H2",
      "text": "6. Add Direct Product Links"
    },
    {
      "level": "H2",
      "text": "7. Re-write Internal Anchor Text"
    },
    {
      "level": "H2",
      "text": "8. Remove 10 Low-Value Links"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}