{
  "url": "https://moz.com/blog/8-rules-for-exceptional-slide-presentations-whiteboard-friday",
  "slug": "8-rules-for-exceptional-slide-presentations-whiteboard-friday",
  "title": "8 Rules for Exceptional Slide Presentations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In last week's Whiteboard Friday, we talked about how you can leverage the power slide decks to boost your SEO. This week, we are going to be following up on that same theme with, 8 rules that you can use to make exceptional slide decks. Here you will...",
  "content": "8 Rules for Exceptional Slide Presentations Whiteboard Friday By: Rand Fishkin July 13, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 13, 2012 8 Rules for Exceptional Slide Presentations Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In last week's Whiteboard Friday, we talked about how you can leverage the power slide decks to boost your SEO. This week, we are going to be following up on that same theme with, 8 rules that you can use to make exceptional slide decks. Here you will find some of tips and tricks I have learned over my many years of creating slide presentations. Please share your own thoughts on developing the perfect slide presentation in the comments below. Happy Friday everyone! No Whiteboard Friday about creating slide presentations is complete without a slide presentation on creating slide presentations. Say that three times fast ;) The slide deck below is from last year, but has some other handy tips included. I wouldn't necessarily recommend taking all the advice included in the process section (waiting until the last minute, etc). This is merely how I do slides and presentations and may not work for everyone. Making Presentations Better View more presentations from Rand Fishkin Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we are following up from last week's discussion on slide decks and using slide decks on the Web, and talking about some ways to make your presentations better and higher quality. I've got a few suggestions for you here. In fact, I have eight specific rules for exceptional slide presentations. I give a lot of presentations all around the world, probably make virtually a slide deck every two or three weeks. So I've found a few things that work really well and then some things that can be frustrating that don't work as well. I'll walk you through them. Number one: Show, don't tell. Now, when you're giving a private presentation for your team, you're just passing on certain information and you're just using the slide deck format, it might be okay to have a title and a bunch of text in there. That's all right. But really when you're presenting on stage to a group of people, you're presenting on the Web, you're uploading something to SlideShare or DocStoc, whatever, putting it on your website, you want that to be visual. Take the items that you've got and turn them into visuals. You can craft visuals. You can find images. Whatever you need, you can make it into something visual, and that's a far better way to communicate with slides. If you're making a point, you should turn that point into an image, a graphic, something visual. Don't leave it as text on the page. Number two: Bullet points, they kill kittens. If you see this horrible looking gun that I've drawn and the dead kitty next to it, you monster, how could you kill a kitten by putting bullet points in your slide presentation? Let me tell you, the way to put an entire room to sleep while they're watching your presentation is to show them a slide that has a title and then three bullet points, or five or seven, and words after them. That is the kiss of death. You show me that slide, I know that there's a kitten in the room that just died. I'm worried about the kitten. I can't think about your presentation anymore. I'm sorry, you've lost me. Instead, transform that. Take that one slide, the title and the bullet points next to it, and turn it into these. Look at these. Here's a title, that same title, that same bullet point title, turned into a single slide with a visual. Another slide with another visual, another single slide with another visual. This kind of thing works tremendously well. You take those slides that have bullet points and you transform them into multiple slides so that you can talk through each point. It's a little more prep work, but I guarantee it will make for a much, much better presentation. Never ever, ever, ever do this, please. Number three: Just like anything great, when you make a presentation, you are crafting a narrative. It's particularly important when you're on stage in front of people. It's also important on the Web, when the visuals of the slide deck are trying to tell a story, that you have a narrative. A narrative means loss, a journey, a test, and a return. We learned this in what, middle school humanities class, my god. The idea behind this is essentially that there's something wrong with the world. When I craft a presentation, I'll talk about a presentation around inbound marketing, and I'll say the loss is that people are investing all of this time and energy into paid marketing channels while ignoring inbound marketing channels, when in fact the click distribution, you know most of the Web's traffic is to inbound marketing. People click on natural stuff that's shared on Twitter and Facebook. People click on the organic search results in Google. They click on email links. They direct nav to things. They click on ads, but in far less proportion to those things. That's a loss. The journey is how do I change this paradigm, and the test is making that change permanent, making that a part of my strategy, and then the return is the results that I can achieve. So you can see that narrative crafted throughout the presentation. It's this story that's being told. If you can build a story around the talk that you're giving, you're going to do very, very well. Number four: Target the content to these people, to the audience. Generally speaking, whenever you're presenting to an audience or if you're putting something up on your website, you know who those people are. You know who's visiting your site. You know who's going to be in the room when you present. Do me a favor, make sure that the content is properly targeted to them. That means a few different things. It means saying, \"What are they actually curious about?\" The things that that audience has curiosity about. It could be, when I speak to a room full of brand marketers, they're sort of curious about, \"What is this concept of inbound marketing? How do we earn that? What's SEO? Give me some of the specifics around it. What can it really do for my business?\" When I speak to a room of SEO practitioners, they're interested in, \"Hey, what are some specific tactics I can use, like if I share in Google+ in this particular way, or if I tweet in these ways, or if I put my titles in this format, or maybe if I'm using XML site maps, how can I make sure to get the most of my content index?\" Whatever it is, it's those specific things that speak to the right audience. I would be very cautious against being tactical with a strategic audience or being strategic with a tactical audience. I'll give you an example. If I'm speaking to a room full of SEO practitioners in the trenches and I tell them, \"SEO is amazing, and here's the click distribution, here's how much organic search gets, and here's ways to invest in SEO, here's who you should hire,\" they kind of go, \"I'm already that person. I already do that job. Why are you telling me this, Rand? Give me the specifics, give me the details, that's what I care about.\" Likewise, if I'm speaking to a room full of strategic folks . . . I actually did this. I was in Germany for a presentation speaking in, I think it was just outside of Munich, speaking to room full of what I thought were SEO practitioners and what turned out to be big brand VPs, marketers. They were sort of like, \"You know, I really don't care about testing the efficacy of one sharing format versus another one and this sort of thing. I'm thinking on this at a 30,000 foot level, and you're speaking to me like I'm the man on the ground.\" Oops, sorry, wrong audience. Finally, do ask yourself, \"What they already know?\" If they already know something, don't put it in the presentation. What you should try to aim for is this, that a minimum of 20% of the content that you present in any given slide deck is completely new to the audience members. The reason that it's 20% and not 100% is because some portion of your audience will know some pieces and some will know other pieces. That's okay. But try to have something where at least a fifth is new to everyone or to someone in that group. If you're speaking to a mix of folks, you want to find the things that they probably don't know about, identify some of that, present it in your slide. Number five: Format your slides intelligently. Intelligently meaning consistent, so I want consistency. If you're going to use a single format like the title is always in the upper left, the logo is always in the upper right, the URL or the explanatory text is always on the bottom, and the visuals in the middle, fantastic. Maybe you want to go left-aligned and you want to have the visual over here and then a title, logo . . . excellent. Use consistency. Use section breaks. What I mean by section breaks is this. You essentially want to have a slide format that looks like this normally for most of your content, and then maybe another slide that's simply a black background, and then it's got the text in the middle with the title. Obviously, that doesn't work. But you get the idea, right? Like, oh, look it's white text on a dark background. That means we're transitioning to a new section, and Rand's going to be talking about something new. Remember that your slide deck has to perform for two audiences. All of these tips are geared to doing a great job in front of your audience, but also doing a great job on the Web, where thousands and thousands more people can potentially be exposed to it. Maybe you're speaking to a room of 50 people, 100 people, 500, even 1,000 people. On the Web you might be speaking to an audience of 10,000, and they have no context. So your slides have to do all the work for them. Use tracking URLs. If you're interested in seeing what the click-through rate is when you share stuff and you have URLs down here that you're sending people to, instead of just using a straight URL, (a) you can use a shortened URL so you can fit more in there, so bitly/xyz, or you might be using that so that you can see what percent of people who went through my slideshow clicked on any specific given link in the slide. It's a great way to test and see what kind of traffic you're getting from there and then to be able to source identify it. Finally, have a memorable URL for the slide deck itself. Anytime I give a presentation, I'm always making sure that I have a specific name for that presentation, and then that name will go into the bitly URL. So it'll be like bitly/marketing2012, bitly/marketingforstartups. Then it's easy to remember and somebody can say it. Number six: Connect emotion to your slides. This means try to elicit responses that are going to be emotional. The emotional connection means that the memorability of your slides and of your presentation, and of you and your brand, is going to be much, much higher. If you don't connect that emotion and you're merely presenting things sort of, here's detail, here's logic, it's not going to work nearly as well. The four that I've found that work very well, for me at least, are humor, funny stuff. Quick tip on humor. I'm not a funny person by nature, so what I do with my slides is I will often make them ridiculous or ludicrous or make insider jokes on them through the images that I show. Let's say that I need to do a talk about a particular issue. I might show some funny image of a cat or of something that I found on Imgur, something I found via Reddit. I do this all the time. I'll just go to Reddit, I'll click on are funny. I'll go do a search with one of the keywords that I'm trying to present on that slide deck and do a site:quickmeme, or site:cheezburger, or site:imgur, and I'll find the images there. Other things that work well: amazement, for trying to show people, oh my gosh, this is an amazing response. For example, I like doing a slide presentation that sort of shows, you know, here's Google, here's the words that they said when they said, \"Hey, we don't use any Twitter data,\" and then here's Twitter data right inside of Google. And you go, \"Hey, wait a minute. It looks like . . . that's amazing. There's clearly a disconnect between what an organization said and what's actually being practiced.\" Drama, creating conflict, creating the us versus them, those kinds of things, certainly that works really well with a common enemy. So common enemy is oftentimes an institutional roadblock. Sometimes it's a way of thinking. Sometimes it's a bad habit from the past. Sometimes it's merely a tactic or a strategy that someone didn't know about. Forming that as a common enemy and then placing blame on that can work very well and can get the audience on your side emotionally. Number seven: When you're presenting, particularly to professionals, I can't say that this is going to work for inspirational types of speeches or other types, but for educational ones, particularly in any technology focus spheres, actionable is far better than interesting. Interesting is sort of, \"Oh, well that's new. I'm curious about that.\" Actionable is, \"Hey, that's something I can do. That's something that if I go back to my desk on the day after tomorrow or tomorrow, whenever I'm getting there, and I do this work, I will see results.\" That's what you're aiming for. Bias to the tips that will make your audience go running out of the room, like these four fine gentlemen who look a little more like zombies than runners, but that's okay. You want to send them running out of the room dying to implement the things that you suggested. That's going to work really well. Again that ties back to: Do you know who your audience is? And then the last one, leverage the power of multimedia. I see a ton of times when people will be really inspired or just love a talk that I've given, and a lot of it's not me. It's because at the end of my talk, or the beginning, or in the middle somewhere, I played a video that they just loved and they identified with, and oh my god, what an amazing video. I kind of go, \"What? How's that my work?\" I mean, it's great. I'll show a 2 or 3 minute video during a 30 minute presentation, 40 minute, 5 minute keynote, and it sticks with people. It has that memorability, and they go, \"Oh, wow, such a great presentation.\" They associate the work of others with you because you showed it to them. That's a wonderful thing to take advantage of. The Web has so much of this on Flickr, on YouTube, Imgur, and Quickmeme. I actually really like Bing image search. It just has a great format. You can do site colon stuff, so if you know that there's particular sites that have the types of data you want, for example a lot of marketing chart stuff, eMarketer is great, or MarketingCharts.com is great. You can pull in all that data. All right, everyone. I look forward to seeing some phenomenal slides from all of you. In fact, I haven't seen a YouMoz in a long time that had a slide deck embedded in it. I think that would be super cool, so maybe we'll see some of those. I will look forward to seeing you all again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Rules for Exceptional Slide Presentations"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Rules for Exceptional Slide Presentations"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}