{
  "url": "https://moz.com/blog/8-things-you-can-give-away-to-earn-links-mentions-whiteboard-friday",
  "slug": "8-things-you-can-give-away-to-earn-links-mentions-whiteboard-friday",
  "title": "8 Things You Can Give Away to Earn Links + Mentions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Happy Holidays Everyone! It's that time of year again and Rand gets into the giving spirit with this year's special edition of Whitebeard Friday. Presented here are 8 generous tips that will encourage you to get into the holiday spirit of giving yourself. Please enjoy and don't forget to leave your…",
  "content": "8 Things You Can Give Away to Earn Links + Mentions Whiteboard Friday By: Kenneth Martin December 22, 2011 Table of Contents Copied! By: Kenneth Martin December 22, 2011 8 Things You Can Give Away to Earn Links + Mentions Whiteboard Friday Happy Holidays Everyone! It's that time of year again and Rand gets into the giving spirit with this year's special edition of Whitebeard Friday. Presented here are 8 generous tips that will encourage you to get into the holiday spirit of giving yourself. Please enjoy and don't forget to leave your comments below! Video Transcription Ho, ho, ho. Welcome to this year's special edition of Whitebeard Friday. Merry Christmas. Happy Hanukah. Happy Holidays, whatever you celebrate. Festivus (the \"Airing of Grievances\"). Whatever you are celebrating this holiday season, I hope you're having a wonderful one. Welcome to the special edition of Whitebeard Friday. Every year I put on this ridiculous getup, and hopefully none of you who celebrate Christmas mind Jewish people like me wearing Santa Claus outfits. I apologize if I've offended anyone. But I have, you can see, drawn a Christmas tree with a Fesitvus pole in the middle and a Star of David. Huh, huh? A little cross-cultural segment there. All right. This week on Whitebeard Friday I am talking about, I was originally talking about 12, to emulate the 12 days of Christmas, but it wouldn't fit on the whiteboard. So we're doing eight, eight things you can do, you can give away, to earn links and mentions to help your marketing efforts. Obviously, Christmas, the season of giving away. Even when I was a kid, my parents celebrated Christmas. My parents with my whitebeard. I was very, very young. This was like the 17th century. We want to talk today about some of those great methods of things you can give away as part of the holiday season, the giving season, and earn back great things for your marketing. So, number one, your writing. This is a pretty obvious one, right? When you guest post for someone, when you guest comment, when you leave your written work or allow others to publish it, that earns you links back, links and references back. And I have a pro tip for each of these. So the pro tip here, make a search like this - you see this tiny writing here - \"guest author,\" guest plus author or write or blogger or contributor, if you use that plus the word \"blog\" or the word \"news\" or your keywords, you will find posts that contain this stuff. Another pro tip, use Google blog search and Google discussion search. Both of those are great at providing this kind of stuff. Number two, your videos. See, we're doing a video right now. Do you feel this wonderful video content? The pro tip here is use Wistia. I believe both Wistia and - people are walking by in the SEOmoz offices and think this looks hilarious - use Wistia or I believe Vimeo Pro also does this. When you put your videos up, if you'll notice the embed link for this video in particular, which I think maybe it's in the right-hand corner, that corner, that corner, one of the corners, the embed point will actually point back to your site, which is phenomenally great because it means when other people embed the video, you control the anchor text and the link of where it points back to. Number three, your product. Whatever it is that you sell, whatever it is that you make, whatever it is that you do, you could have a service, giving that away often earns you links and references in return. Pro tip, be careful of those direct giveaways. If you say, \"Hey, here's the product, I want a link back,\" that can get you into trouble. But if you instead use events, or charity, or sponsorship, or you give it away without a request and ask and people cover it, that's an organic and natural link, an editorial link. That can work for you. Number four, very similar, your time. Donate and dedicate your time, like me, Father Christmas by helping people out, donating what it is that you do best. If you are a marketer, that could be helping other people with your marketing. If you are a consultant, it could be doing consulting work. If you are helping people in business or you are an expert in a particular realm or product, helping those people do those things, accomplish those things. Finding people who you know have needs in that area and giving it away can help you earn good will, and then that brings links back to your site and references back to your site. A wonderful way to give and receive. Number five, this is something I hate when marketers don't do this. Give away your contact details. What I mean here is when you are participating out on the Web and you are hoping to earn links and references back, make your contact details public, make them easy to find, make sure that there's not a big challenge here. Make it clear you are open to contributing and helping and participating and that you hope that by doing these things you spread your brand. This will invite people to email you, to tweet at you, to link to you, to reference you when they are seeking contributors to these types of things. Contact details, by the way, also important to make sure that those are easily accessible and findable from your site and anywhere you do participate. Number six, your photos, your images, or your graphics. The pro tip here, have an images or photos section on your site if you can, especially if you have a large media library, and then make sure it is open to licensing in exchange for a link. You can use the creative comments licensing, you can create your own licensing, you can create little things that make it easy to embed any of your images or any of your graphics and earn that link back. By the way, another pro tip on this, if someone is using your images, or you suspect that they are, use Google's similar images link inside. Here, I'll show you right here. Let's say I have just done a search for an image, and I have clicked on that image. Now you're going to see the image here, and there is a little X, and then Google has a sidebar over here with some links after I have clicked it, and one of those is \"similar images.\" If you click on \"similar images,\" that will show you other images like this one, oftentimes, people who have taken your image but haven't given you credit. You can then reach out to them and be like, \"Hey, what's the deal?\" Does it look weird having Santa kind of give a . . . Number seven, your full feed, your full RSS feed. The pro tip here is, especially, this is important to not go partial feed but to go full feed when you're giving RSS because lots of people will republish that, lots of people will reference it, email it, subscribe, etc. Great for marketing. And pro tip, use absolute links. Don't use /blog whatever. Use www.mysite, the full link, because when it gets referenced on other sites, it will point back to you and that link will count and pass value. Number eight, last but not least, your data. Undoubtedly, if you're doing interesting things in the world of product, of marketing, of customer research, of embedding yourself in a community, you are collecting valuable, super cool data. A great way to do this is to first build a list of likely writers, people who you think would be interested in the data you're providing. This could be white paper kinds of data. It could be research and survey data. It might be data you've generated from all the users of your product or from whatever it is that you're collecting. And then reach out. Before you have it, reach out and ask if they want access. By doing that, you create this wonderful confirmation, because you said, \"Hey, Dear Writer, Do you want access to this cool data that we've got? Would you like to share? Would you be interested? Would your customers be interested? Would your readers be interested?\" A lot of the time they'll say, \"Yes, I would be interested. Please do share that with me.\" If you instead just reach out and say, \"Hey we have this cool data,\" you get a lot of ignores. But if you first reach out and say, \"Hey, Kenny, I know you write on the SEOmoz blog. Would you be potentially interested in some data about the social media marketing field?\" Kenny will be like, \"Hmm, yeah, that's sounds interesting. Send it over to me.\" Then you send it over and say, \"Hey, we'd love if you could at least tweet or share it, and if you blog about it, that'd be even better.\" This is a great way of making sure they get your data and then link to you. All right, everyone, I hope you've enjoyed this silly edition of Whitebeard Friday. It's been a fantastic year. Hope you have a great holiday, and we will see you again next week. Yes, even between Christmas and New Year's we're going to be doing Whiteboard Friday. See you next week for another edition. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Things You Can Give Away to Earn Links + Mentions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Things You Can Give Away to Earn Links + Mentions"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kenneth Martin\n          \n            Kenneth Martin"
}