{
  "url": "https://moz.com/blog/8-tips-to-get-domain-diversity-with-the-anchor-text-you-want",
  "slug": "8-tips-to-get-domain-diversity-with-the-anchor-text-you-want",
  "title": "8 Tips to Get Domain Diversity (with the anchor text you want) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As diligent Search Marketers know, it's quite a good idea to get links from strong/trusted sites pointing to yours and combine this with building a single link or two from a large number of smaller websites.",
  "content": "8 Tips to Get Domain Diversity (with the anchor text you want) Link Building By: Rob Ousbey June 8, 2009 Table of Contents Copied! By: Rob Ousbey June 8, 2009 8 Tips to Get Domain Diversity (with the anchor text you want) Link Building As diligent Search Marketers know, it's quite a good idea to get links from strong/trusted sites pointing to yours and combine this with building a single link or two from a large number of smaller websites. For some people, this second part can seem the most daunting - whilst there is a person you can talk to if you want a link on every page of timesonline.co.uk, there's nobody you can call or email to get a link from every small website or blog. The difficulty of building such links is compounded when you realise that this work should be done using anchor text of the term you want to rank for. Rand mentions domain diversity in this Whiteboad Friday post. Here's a quick primer for increasing the domain diversity of your backlink profile. 1 - Linkbait Build it, and they will come. And if it's good enough, they'll share it with other people by linking to it. This category includes any content created and published specifically to attract links. The various forms of linkbait cover perhaps the most popular techniques of getting a natural looking link from a wide number of sites that has been used in recent years. To make it extra useful, linkbait can work particularly well for targeting particular keywords - read more in the later points. For a detailed primer in the ways of the 'bait, you can't really do better than SEOmoz's Viral Marketing and Linkbait guide. 2 - Widgets Since badges & widgets don't fall under the description of linkbait used above, they can be considered quite distinctly. They exist to give value to the page they are embedded on. Links included within them typically take the form of a 'credit' that doesn't need to be followed by a user to enjoy the widget/badge - but the search engines' algorithms barely notice the difference. Create something cool (and cool doesn't necessarily need to be complicated) that people want to embed on their site, and you can watch the links roll in. This works particularly well for getting your branded terms in the anchor text. 3 - Press and Publicity Great PR (or, in fact, terrible PR) can bring links to a site, without you actually having to create any specific content for the campaign. Make sure that your press / publicity mentions an official website; if people hear about your company in the media and the story is interesting enough to share with others, then you've increased the chance that they'll link to your site at the same time. (Plus, each TV/radio/newspaper that covers your story may also link to you.) 4 - Affiliate Schemes There are a number of question marks over the existence, technical aspects and transparency of 'SEO friendly affiliate schemes'. However, a well thought-out scheme will benefit you as a retailer as well as your affiliates. Allowing the affiliates to link to you from a variety of their sites, as well as from other blogs, forums, etc., will contribute to increased domain diversity for each of your product pages. 5 - Customer / User Outreach Last year, Rand's very first headsmacking tip was to ask people who'd bought from you to link to you. You don't just need to be an e-commerce site to do this though. If you manage a forum or other site which people can register on, then drop them an email after their first post, for instance, with an invite to link to you. You may even consider asking your users for their website/homepage/blog when they first sign up, so that you can filter them and only email people with a website. (Or, with a little more work, only email people with DmT > 2.0 :D ) 6 - Have broad appeal You can avoid reducing the number of potential sites that can link to you by being appealing to as wide a range of people as possible. For example, if you're a blogger regularly writing about sewing, try dropping the odd post about knitting or other crafts just to help broaden your potential for sites interested in linking to you. Likewise, unnecessary NSFW content on your site is likely to reduce the propensity of other sites to link to you. (Of course, it might make others more likely to link, but there's a balance you have to figure out.) Getting the Anchor Text You Want A couple of head-smackers coming up, but use these tips wisely to build relevance for the terms you want. 7 - Keywords in the URL A significant proportion of links to any page will just use the page's URL as the anchor text, so make sure that the slug already includes the keywords. (If you're doing your on-page SEO properly, this should be a given.) Remember that if you're going to create a short link (e.g., for Twitter), this link will get republished in a variety of places, so use a service such as bit.ly that lets you include keywords in the short link. E.g., for the page http://www.example.com/products/shoes-and-clothes/trainers, you should probably try to use bit.ly/trainers 8 - Strong launch with good title When a strong account launches your linkbait on any social media site, it gives it the best chance of getting seen by more people. A well chosen title can also increase visibility of your content within that site, but it can be even more useful than that. When people link to your content, they may often use the title of the page. However, when linking to content they found through a social media site (such as your linkbait pieces) they often use the same text that was used on that site. (This makes sense; if it was a great, well crafted headline, people should want to use it too.) So, make sure your clever Digg/Reddit/etc headlines contain the keywords you're after. Finally, when I told my other half that I was going to write a blog post today about domain diversity, I asked her if she had any ideas how to get lots of people to link to your content. Her answer was \"Put a picture of a kitten on it.\" Well, it's worth a shot, I guess..... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Tips to Get Domain Diversity (with the anchor text you want)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Tips to Get Domain Diversity (with the anchor text you want)"
    },
    {
      "level": "H3",
      "text": "1 - Linkbait"
    },
    {
      "level": "H3",
      "text": "2 - Widgets"
    },
    {
      "level": "H3",
      "text": "3 - Press and Publicity"
    },
    {
      "level": "H3",
      "text": "4 - Affiliate Schemes"
    },
    {
      "level": "H3",
      "text": "5 - Customer / User Outreach"
    },
    {
      "level": "H3",
      "text": "6 - Have broad appeal"
    },
    {
      "level": "H2",
      "text": "Getting the Anchor Text You Want"
    },
    {
      "level": "H3",
      "text": "7 - Keywords in the URL"
    },
    {
      "level": "H3",
      "text": "8 - Strong launch with good title"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}