{
  "url": "https://moz.com/blog/9-most-common-local-seo-myths-dispelled",
  "slug": "9-most-common-local-seo-myths-dispelled",
  "title": "The 9 Most Common Local SEO Myths, Dispelled - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you taken any of these statements as truth? In this post, Google My Business Top Contributor Joy Hawkins shares and debunks the Local SEO myths she runs into most frequently.",
  "content": "The 9 Most Common Local SEO Myths, Dispelled Local SEO By: Joy Hawkins April 19, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joy Hawkins April 19, 2016 The 9 Most Common Local SEO Myths, Dispelled Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 7 minutes] I regularly hear things in the Local SEO world that many people believe, but which are completely false. I wanted to put some of these myths to rest by listing out the top 9 Local SEO myths that I run into most frequently. 1. Deleting your listing in Google My Business actually removes the listing from Google.Business owners will often question how they can get rid of duplicate listings on Google. One of the more common things people try is claiming the duplicate and then deleting it from the Google My Business Dashboard. When you go to delete a listing, you receive a scary message asking if you're sure you want to do this:The truth is, removing a listing from Google My Business (GMB) just makes the listing unverified. It still exists on Google Maps and will often still rank, provided you didn’t clear out all the categories/details before you deleted it. The only time you’d really want to delete a listing via GMB is if you no longer want to manage the listing.Google confirms this in their help center article: When you delete a local page, the corresponding listing will be unverified and you will no longer be able to manage it. Google may still retain business information from the page and may continue to show information about the business on Maps, Search, and other Google properties, including marking the business as permanently closed, moved, or open, depending on the information that’s known about the business. 2. Failure to claim your page means your business won’t rank anywhere. I’m sure most of you have received those annoying phone calls that say: “Your business is not currently verified and will vanish on Google unless you claim it now!” First of all, consider the authority of the people who are calling you. I can say with certainty they are not experts in this industry, or they wouldn’t resort to robo-calling to make sales. The Moz Local Search Ranking Factors does list verifying your listing as #13 for making an impact on ranking in the 3-pack, but this is often because business owners add more data to the listing when they verify it. If they left the listing exactly how it was before verifying, the verification “status” would not likely impact the ranking much at all. We often see unverified pages outranking verified ones in really competitive markets. 3. \"Professional/Practitioner\" listings on Google are considered duplicates and can be removed.Google often creates listings for the actual public-facing professionals in an office (lawyers, doctors, dentists, realtors, etc), and the owner of the practice usually wants them to disappear. Google will get rid of the listing for the professional in two different cases: a) The professional is not public-facing. Support staff, like hygienists or paralegals for example, don’t qualify for a listing and Google will remove them if they exist. b) The business only has one public-facing individual. For example, if you have a law firm with only one lawyer, Google considers this to be a “Solo Practitioner” and will merge the listing for the professional with the listing for the office. Their guidelines state to “create a single page, named using the following format: [brand/company]: [practitioner name].” In the case that the professional has left your office, you can have the listing marked as moved if the professional has retired or is no longer working in the industry. This will cause it to vanish from the search results, but it will still exist in Google’s back-end. If the professional has moved to a different company, you should have them claim the listing and update the address/phone number to list their new contact information. 4. Posting on G+ helps improve your ranking.Phil Rozek explains this best: “It’s nearly impossible for people to see your Google+ posts unless they search for your business by name. Google doesn’t include a link to your 'Plus' page in the local pack. Google doesn’t even call it a 'Plus' page anymore. Do you still believe being active on Google+ is a local ranking factor?” No, posting on G+ will not cause your ranking to skyrocket, despite what the Google My Business phone support team told you. 5. \"Maps SEO\" is something that can be effectively worked on separately from \"Organic SEO.\"I often get small business owners calling me saying something along the lines of this: \"Hey, Joy. I have an SEO company and they’re doing an awesome job with my site organically, but I don’t show up anywhere in the local pack. Can I hire you to do Google Maps optimization and have them do Organic SEO?\" My answer is, generally, no. “Maps Optimization” is not a thing that can be separated from organic. At Local U in Williamsburg, Mike Ramsey shared that 75% of ranking local listings also rank organically on the first page. The two are directly connected — a change that you make to your site can have a huge influence on where you rank locally. If you're a local business, it's in your better interests to have an SEO company that understands Google Maps and how the 3-pack works. At the company I work for, we've always made it a goal to get the business ranked both organically and locally, since it’s almost impossible to get in the 3-pack without a strong organic ranking and a website with strong local signals. 6. Google employees are the highest authority on which ranking signals you should pay attention to. Google employees are great; I love reading what they come out with and the insight they provide. However, as David Mihm pointed out at Local U, those employees have absolutely no incentive to divulge any top-secret tips for getting your website to rank well. Here are some recent examples of advice given from Google employees that should be ignored: Duplicate listings will fix themselves over time. Posting on Google+ will help your ranking (advice given from phone support reps). If you want to rank well in the 3-pack, just alter your business description. Instead of trusting this advice, I always suggest that people make sure what they're doing matches up with what the pros are saying in big surveys and case studies. 7. Setting a huge service area means you’ll rank in all kinds of additional towns.Google allows service-area businesses to set a radius around their business address to demonstrate how far they're willing to travel to the customer. People often set this radius really large because they believe it will help them rank in more towns. It doesn’t. You will still most likely only rank in the town you're using for your business address. 8. When your business relocates, you want to mark the listing for the old location as closed.The Google My Business & Google MapMaker rules don’t agree on this one. Anyone on the Google MapMaker side would tell a business to mark a listing as \"closed\" when they move. This will cause a business listing to have a big, ugly, red \"permanently closed\" label when anyone searches your business name. If your listing is verified through Google My Business, all you need to do is edit the address inside your dashboard when you move. If there's an unverified duplicate listing that exists at your old address, you want to make sure you get it marked as \"Moved.\" 9. Google displays whatever is listed in your GMB dashboard.Google gives business owners the ability to edit information on their listing by verifying it via Google My Business. However, whatever data the owner inputs is just one of many sources that Google will get information from. Google updates verified listings all the time by scraping data from the business website, inputs from edits made on Google Maps/MapMaker, and third-party data sources. A recent case I’ve seen is one where Google repeatedly updated an owner-verified listing with incorrect business hours due to not being able to properly read the business hours listed on their website. Were you surprised by any of those Local SEO myths? Are there others that you come across regularly? I’d love to hear about it, so please leave a comment! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 9 Most Common Local SEO Myths, Dispelled"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 9 Most Common Local SEO Myths, Dispelled"
    },
    {
      "level": "H2",
      "text": "1. Deleting your listing in Google My Business actually removes the listing from Google."
    },
    {
      "level": "H2",
      "text": "2. Failure to claim your page means your business won’t rank anywhere."
    },
    {
      "level": "H2",
      "text": "3. \"Professional/Practitioner\" listings on Google are considered duplicates and can be removed."
    },
    {
      "level": "H2",
      "text": "4. Posting on G+ helps improve your ranking."
    },
    {
      "level": "H2",
      "text": "5. \"Maps SEO\" is something that can be effectively worked on separately from \"Organic SEO.\""
    },
    {
      "level": "H2",
      "text": "6. Google employees are the highest authority on which ranking signals you should pay attention to."
    },
    {
      "level": "H2",
      "text": "7. Setting a huge service area means you’ll rank in all kinds of additional towns."
    },
    {
      "level": "H2",
      "text": "8. When your business relocates, you want to mark the listing for the old location as closed."
    },
    {
      "level": "H2",
      "text": "9. Google displays whatever is listed in your GMB dashboard."
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joy Hawkins\n          \n            Joy Hawkins\n          \n            Joy Hawkins"
}