{
  "url": "https://moz.com/blog/9-simple-tips-for-making-an-about-us-page-that-works-for-your-brand",
  "slug": "9-simple-tips-for-making-an-about-us-page-that-works-for-your-brand",
  "title": "9 Simple Tips For Making An About Us Page For Your Website - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "[About Us Page Best Practices] Your brand's About Us page is prime real estate for prospects looking to do business with the company. Reward visitors for their efforts by showcasing an engaging, insightful page.",
  "content": "9 Simple Tips For Making An About Us Page That Works For Your Brand Content Marketing | Conversion Rate Optimization (CRO) | SEO Copywriting By: Ben Austin March 15, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ben Austin March 15, 2015 9 Simple Tips For Making An About Us Page That Works For Your Brand Content Marketing | Conversion Rate Optimization (CRO) | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For too many online companies the About Us page is the elephant in the room, and often the most awkward thing to write. It's a shame because analytics often shows the page as one of the most frequented on any website. Imagine a ceremonial elephant adorned in his embellished head plate, raising you above your competitors. This could be your About Us page if you show it the care and attention it deserves. The good news is your about page doesn't require several hundred pounds of vegetation on a daily basis, nor is there any real need for expensive antique rhinestones. The bad news is crafting the perfect about page is easier said than done. Many find it difficult to strike the right balance between selling themselves to their customers and driving them away with a self-focused approach, which helps explain why the pages are so often neglected. At Absolute, we're looking to revamp our entire website over the coming months, and in particular we'll be focusing our attention on our about page. We recognize that our page is currently a little on the dull side and while we are researching the topic, I thought it would be great to share nine great, easily applicable techniques we picked up from some of our favorite About Us pages from around the web. Start by talking about your audience, not yourself Human nature dictates that we are, first and foremost, concerned with our own problems. While some of us may give to charity or volunteer in our spare time, when it comes to searching for products or services online, we're all about ourselves and what a brand can do for us. Blog Tyrant is a great example of a blog that is focused on its visitors. The first thing you see when you land on their about page is a video titled \"About Me and You.\" The text that follows is then split into two sections, \"About Me\" and \"About You (The Tyrant Troops).\" Image Source: www.blogtyrant.com If this frank, upfront style doesn't suit your company there are more subtle ways to become more customer-orientated. Dedicate your opening sentence(s) to your audience's challenges and objectives. Starting with the very reason they come to your site in the first place is a good way to demonstrate that you have their needs in mind. In our case, for example, it might be a good idea to acknowledge the difficulties marketing managers have in finding an agency that combines creativity with the essential technical skills, which can sometimes be overlooked. State the facts: If you're still finding it hard to strike a happy medium between highlighting your selling points and plain boasting, then simply present your readers with the facts. This could be anything from your client retention rate to the amount of new products you offer each month to the number of awards you've collected. No one can argue with raw figures. Let your customers do the talking When you are thinking of trying out a new hairdresser, dentist or even a fish and chip shop, you don't base your decision on what they say about themselves. You turn to those around you. By including a few glowing (and up-to-date) customer testimonials on your about page, you can create a hub of information. Be sure to include the customer or client's full name and any relevant details that could add credibility to your testimonials. Better still, include photos of your customers, if possible. It all helps to build trust in your brand. Include customer-focused awards and accreditations. Perhaps you were voted your area's favorite provider of security products in 2013, or maybe you are part of some authoritative bodies or organisations within your industry. Exploit the instinctive human need to seek reassurance from our peers. Include different forms of media Make your about page a feast for the eyes by considering the use of photos, timelines, videos or infographics. If people are going to seek and find your about page, it makes sense to capture their attention for as long as possible, and this is precisely what Moz does. Their timeline incorporates strong image and design while still providing visitors with the key information they need. Image Source: www.moz.com Photos don't necessarily need to be of each individual team member. Although individual head shots do help prospective customers visualize your company, head shots of management, photos of you in action at a fundraising event or even images from a work night out (preferably ones that aren't likely to spark legal action), can all add character to your brand. Videos are a great way of entertaining those with particularly short attention spans and can sum up the feeling of your company in a matter of seconds or minutes. If you don't have extensive time or resources in this area, Vine videos are a great way to add something different to your about page. Tell your story Even if your brand doesn't have an interesting story, you can still tell a story. Focus on the things that make you human. That's precisely what a client of ours, ITS, has done with their About Us page. Unfortunately it's not something we can take credit for personally, but it still embodies everything a great story should have. It starts at the beginning, documenting their modest founding, in 1981 as a 150 square foot shop, all the way to modern day, with plenty of photos along the way. It's great to see the quality of the photos changing through time, almost like a family scrapbook. Customer ratings and social icons make this page even stronger. Image Source; www.its.co.uk Don't be afraid of where you have come from. If, eight years ago, your headquarters happened to be your CEO's conservatory, celebrate it. The more that people can identify with you the more trust they'll place in your brand. We have become so desensitized to marketing that a company needs a personal touch to set it apart. You don't have to tell people everything. If you have been established for 80 years, people don't want to read a year-by-year account of everything that has happened in that time. Therefore, filter information accordingly, mentioning those key elements of human interest, but keep tales of new windows or a change of paper suppliers to yourself. Include your address and contact details Many people are still hesitant when it comes to parting with their money over the Internet and are thus keen to know you aren't simply looking to fleece them to make a bit of extra cash. If you don't want to disclose your full address, at least state your city or town. Potential customers are not so likely to get in touch if you're less than forthcoming about your location. After all, what else might you be holding back? Make certain your contact details are up to date. It sounds obvious, but having an out-of-date telephone number or email address could not only lose you a sale but might also send alarm bells ringing. Your contact details should also include social handles and skype details if applicable. Cut out the jargon Writing in acronym-infested jargon might make you feel clever at the time, but it's boring and it's cold. People won't remember you. What they really want when they land on your about page is to learn, in simple unambiguous terms, precisely what you do. Write conversationally. There is no best way to write. The style you adopt will depend on your company, but make an effort to write in a way that makes your content, and your site, feel accessible and friendly. The Adventurists site offers a great example of this. Their about page serve its intended purpose and is quite enjoyable to read. More to the point when they talk about \"mobile phones tagged with twattery about which restaurant serves the best mocha-latte-frappeshite\", you find yourself agreeing with them, even if their greater aim of getting youto cross the sub-continent in a three wheeled lawnmower powered tin isn't likely to happen anytime soon. Don't name your about page some obscure name like, Our Ethos, or The Journey. People are looking for an About Us page, so give them one. Come up with a name that is too vague and people may miss you completely. Ask for other peoples' opinions Don't be afraid to ask employees, friends, peers, even clients, what makes you stand out as a business. When you have worked somewhere for a long time, it is tough to see your brand the way customers might see it. An objective opinion can help. When you have decided on what makes you stand out, be sure to make this a focus. If your peer search becomes more like soul-searching because you find there is actually nothing different about your company, despair not. Don't try and force something that isn't there. Instead, turn it around and focus on what makes your audience unique. Make sure it reflects your company In our quest for the perfect about page, we came across some really extravagant examples. Some had really impressive videos, special features or high tech designs. All of those examples were extremely applaudable, but will only really work if this fits in with the rest of your website, your industry and your company as a whole. It's easy to lose sight of who you are in your mission to create the best page possible. Even if your website isn't overly visual, you can still include photos, just make sure they follow the same format as the rest of your website. If your site focuses on boxy shapes and bold colors, then keep this theme running throughout your images. Just as with your marketing, the key is to be succinct. Maintaining a consistent look and feel automatically gives your brand more authority. The same goes applies for tone. Remember, in today's multi-platform society, your website may not be someone's first interaction with you, with visitors often reading an article or coming across a tweet beforehand. In that sense, an about page is almost like a meeting point, an amalgamation of everything that makes your brand who you are. Test it! There is no magic formula for about pages. If there were, you probably wouldn't be 2,000 words into this blog. A good way to treat the process of creating such a page, then, is as a work in progress. Don't be afraid to make amendments. Spend a fair amount of time checking your analytics for traffic volumes, bounce rate and visit duration on the page. Tweak the odd sentence, add images, chop them out, introduce a video, etc, based on what the data tells you. Make sure the page is accessible across all devices. It makes no sense to spend all this time creating an amazing page that is only visible to a small percentage of your audience, which is roughly what will happen if you ignore mobile and tablet users. Whether you have responsive design or a dedicated mobile site, test the performance of the page continually. Of all the pages we looked at, our favorite is the one below, from Macmillan. Their About Us section is actually split into different pages, but the initial page makes use of video, explains briefly and simply what they do, includes contact details, testimonials and, most important, thanks people for their continued support. Those readers who then want to learn more, as undoubtedly many will, can do so via links directing them to images of the team, as well as facts, figures and corporate partnership details. It might not be as flashy or as up to date as some, but it's what best represents them and that's the point. Image Source: www.macmillan.org.uk Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "9 Simple Tips For Making An About Us Page That Works For Your Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "9 Simple Tips For Making An About Us Page That Works For Your Brand"
    },
    {
      "level": "H2",
      "text": "Start by talking about your audience, not yourself"
    },
    {
      "level": "H2",
      "text": "Let your customers do the talking"
    },
    {
      "level": "H2",
      "text": "Include different forms of media"
    },
    {
      "level": "H2",
      "text": "Tell your story"
    },
    {
      "level": "H2",
      "text": "Include your address and contact details"
    },
    {
      "level": "H2",
      "text": "Cut out the jargon"
    },
    {
      "level": "H2",
      "text": "Ask for other peoples' opinions"
    },
    {
      "level": "H2",
      "text": "Make sure it reflects your company"
    },
    {
      "level": "H2",
      "text": "Test it!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ben Austin\n          \n            Ben Austin\n          \n            Ben Austin"
}