{
  "url": "https://moz.com/blog/92-ways-to-get-and-maximize-press-coverage",
  "slug": "92-ways-to-get-and-maximize-press-coverage",
  "title": "92 Ways to Get (and Maximize) Press Coverage - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I love Ben Affleck's first scene in the movie \"Boiler Room.\" I always felt that the quote above perfectly relates to companies and press coverage. The ones who don’t get coverage will quickly dismiss it as useless and a waste of time and money to pursue, while the ones who regularly get coverage…",
  "content": "92 Ways to Get (and Maximize) Press Coverage Public Relations By: Chris Winfield February 27, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Chris Winfield February 27, 2012 92 Ways to Get (and Maximize) Press Coverage Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I love Ben Affleck's first scene in the movie \"Boiler Room.\" I always felt that the quote above perfectly relates to companies and press coverage. The ones who don’t get coverage will quickly dismiss it as useless and a waste of time and money to pursue, while the ones who regularly get coverage just smile and hope that you keep thinking that way... Over the last 12 years, I have been featured in hundreds of major newspapers, magazines, websites and blogs (everything ranging from the NY Times, USA Today and CNN to TechCrunch, Entrepreneur and so on), and I can tell you first-hand that it has helped me and my companies in an enormous way. It's brought me: Publicity (well duh, Chris!) Clients Partnerships Links Traffic Improved Employee Morale Credibility Money Even more importantly, I have helped hundreds of businesses and friends get coverage. In many cases, the coverage they received was the tipping point for their career or business. A couple of weeks ago, someone who I met at a conference and became a friend of mine told me: \"Incidentally, your advice on PR in the past has been invaluable with [their domain] - PR is our biggest source of traffic by miles.\" I had no idea this was the case. Their site has been extremely successful, and it got me thinking that I had never really laid everything out in one place. See, PR isn't the core of my business. I'm not a PR genius or even a PR flack. BlueGlass doesn't offer traditional PR services; we do it as part of an overall Internet marketing campaign. I've worked with a bunch of different PR people in my career. Some were amazing, some were terrible. I've done lots of things on my own (some were amazing and some were terrible). With all of that, I have learned a lot and I want to share it with you. So without further adieu, here are 91 ways/tips/thoughts/things that have helped me get and maximize press coverage over the last 12 years. This is the stuff that's worked for me and with a little bit of tenacity, I am positive it can work for you, as well! Know WHO You Are and WHAT You Want Determine your message by answering the following questions: * What’s different about you or your company? * What are you the expert of? * What makes you better than your competitors? * What’s your “Unique Selling Proposition” (USP)? Determine if you want national or local coverage (or both!). What can you use (beyond your company or expertise) to help you stand out? I’ve used my hair. This guy used yellow shoes. Create a list of everywhere you want to be covered: newspapers, sites, blogs, trade journals, etc. Build Your Media List Identify the reporters at each publication who write about the specific topic for which you want to be covered. Find their contact info. This will usually be included with their stories, but if it's not, search LinkedIn, Google, or on the publication’s site. If you’re still stuck, call the publication. Create a spreadsheet with all of the publications, corresponding reporters, and their contact info. Include a column for notes where you can keep track of preferred contact methods, pitching preferences, best time to contact, and any other relevant info you learn after you’ve gotten to know each reporter. Or, use a tool like Bulldog Reporter (pay as you go) or MEDIAtlas (yearly $$$ subscription). Research (And Then Research Some More) Read a reporter’s work before you reach out to him or her. Write down your thoughts on some of his or her recent stories. Is the reporter’s email at the end of his or her articles? This is a good sign they’re open to contact. Tip: Most journalists have (at least) two email addresses. One for the public (the catch-all) and one that they actually use. This is why your email subject line and the email itself are SO important. You have to be the ‘\"signal\" in all the ‘\"noise\" they have to get through. Do the reporters respond to comments on the site or blog that they write on? Do they respond only to certain types of comments or to all of them? Make notes of particular comments that they react most favorably to. Is he Mr. Twitter 2012? Is she a Google + Gal? Start following them to feel out their personalities and observe how responsive they are to other people online. Many of the list building services will tell you how the reporter likes to be contacted. Follow those directions. The Art of the Email Make contact with the reporter via email, telling them how much you enjoyed their latest piece and which parts you enjoyed the most. You’ll be shocked by how many reporters will respond to a quick congratulatory note. Tip: Don’t half-ass this step. If you didn’t really read it and aren’t familiar with their work at all, don’t do this. Follow best email marketing practices (especially with your subject line). Your subject line will most likely mean the difference between making contact with the journalist. Make it count. You’ll need to catch the reporter’s attention in an overflowing inbox. Keep the email short. Remove at least one sentence from whatever you wrote... NEVER include attachments. When they respond, tell them what you do and let them know you’d love to help with any stories they have coming up if they relate to what you do. Try to get quoted on timely topics. Once you’ve made initial contact, email them when breaking news happens and give your own unique perspective. Keep it short and sweet. Include a short bio (& a link to your longer one with a picture of you) in the message. This will save them from having to get more information from you if they’re on a tight deadline to get a story out. Stay on top of \"What’s Hot\" in your industry so that you can proactively pitch. Pitch yourself as an expert source or figure out a way to work your company into the pitch. There are a bunch of good sites that can help you with this: Google Trends or Trendistic to see what’s hot right now Google Alerts (free) or Giga Alert (small subscription fee but a bit more comprehensive) to monitor activity based on specific topics (i.e. “content marketing” or “Facebook advertising”). And for our industry: Hacker News and Pinboard’s Popular section help me to find stories that might not have hit the mainstream yet. It’s important to not forget to step outside of your bubble on a daily basis. Working the Phones If you’re not a phone person, you’ll need to learn how to muscle through it or at least “fake it until you make it.\" Some reporters prefer email communication, while others prefer the phone (especially if they’re in a hurry to gather a lot of information). Know what you’re talking about. I can’t stress the importance of this one enough. You won’t be able to look things up while you’re on the phone (at least, not discreetly). Prepare before any calls to ensure you really know the topic inside and out. Be energetic and positive. Tip: It might sound corny, but smiling while you’re on the phone automatically makes you sound friendlier. Being likeable can make a reporter more comfortable reaching out to you for help on future stories. If you had a choice between talking to a miserable person or a happy one (all things being equal), who would you choose? I thought so... Always tell the reporter something unusual or unexpected that will make you stick out and guarantee you end up in their story. We live in a 140-character, sound-bite driven world. Remember this... Be definitive. Have a clear opinion on the subject. This is going to help them get that quote they need. Growing Your Relationships A strong relationship with just one reporter can be invaluable. Treat each of these relationships like gold, and you can count on coverage for years. I have been in more than 30 stories in USA Today, mostly in the same reporter’s articles (and the others were from people he introduced me to at the paper). This one relationship that I cultivated was one of the most valuable assets early in my career. Be adaptable. Some opportunities may not be exactly what you’re after, but being flexible and able to accommodate a reporter’s story in spite of this (and still work your message in somehow!) will position you as a dependable source. Always go above and beyond. After a call or interview, send follow up info such as links, supporting materials, etc. Few things will make you stand out in a reporter’s mind more than making his or her job easier. Pitch ideas. As journalism moves into a purely online form, journalists are competing more than ever for original stories. Again, making a reporter’s work easier will make you stand out. Come up with story ideas for them in which you can also offer your expertise (and work your message in). Send a thank you note after an interview reminding the reporter you’re eager to help with anything in the future. Social media makes all of the above much easier and effective... Use LinkedIn Once you’ve established contact, add the reporters you’re targeting as connections on LinkedIn. Use the import tool to find reporters with whom you’ve already emailed back and forth. Always send a personalized message when adding a new contact. Make it original; don’t use the default greetings supplied by LinkedIn. ;Tip: DON’T select that you were colleagues at your company (this is the quickest way to make sure someone won’t add you as a connection - journalist or not). Understand how journalists use LinkedIn. Optimize your profile so you can be found by reporters looking for a source: use keywords in your title, summary, and throughout your past job descriptions. Be approachable. Make it clear in your summary you’re open to press contacts or mention publications you’ve appeared in. Include all of your contact information in your profile: phone numbers, email, social profiles, office location, etc. Make your profile public so you’ll show up in search results even if you’re not someone’s 2nd- or 3rd- degree connection. Additionally, a public profile allows non-connections to see your contact info. This allows direct access to contacting you without being in your network. Add your Skills & Expertise to your profile. These are easily searchable and are a quick way for reporters to find possible sources. Influencers can “rank” on the Skills & Expertise page. Some of the best ways to rank for a certain skill include joining (and participating in) groups around that skill and following related companies for that skill. Be active on LinkedIn Answers to position yourself as an expert on a given topic. Experts are featured on each topic’s Answers page. You can also display your Expert topics on your profile. Subscribe to the RSS feed for the Answers topics you want to become an “expert” in; this will save you from checking back for new questions. Customize your LinkedIn Today page. This news aggregator features the most popular content being shared on LinkedIn and Twitter, grouped by industry. It automatically shows you headlines based on your profession, but you can select which topics you want to see headlines from and even follow specific publications. By studying what’s popular on LinkedIn Today, you can get a good idea of which publications are highly shareable among certain professional crowds. Consider targeting some these publications if people in your company’s target industry are sharing from them often. Use Twitter Follow all of the reporters you’re targeting. Here’s a good list of journalists on Twitter. For help finding journalists on Twitter from a specific publication, use the Muckrack directory. Create a Twitter list of these reporters so you can easily keep up with them in a separate stream. Remember, lists can be made private, so only you can see them and the people listed don’t know they’re listed. Share their stuff. Don’t just hit the retweet button, but add a few words of your thoughts on their piece when you share a link to their story. This will help you stand out to really popular reporters who get hundreds of tweets. Attribute a reporter with an @mention anytime you share a link to his or her story. Don’t forget to make local connections. Use LocalTweeps to find reporters in your area. Track (and participate in) journalism-related hashtags. A few include: #journchat (weekly chat among journalists, Mondays at 8 p.m. EST), #haro (“help a reporter out,\" used by journalists looking for sources), and #ddj (data-driven journalism topics) Be there when a reporter needs help right away. Follow @profnet to see reporter needs based on deadline times, and @helpareporter specifies immediate needs by placing “URGHARO” at the beginning of tweets. Use Facebook Understand why journalists use Facebook: to share their stories, interact with their readers, curate content and find sources. Many journalists now allow you to subscribe to their Facebook updates, so their posts show up in your newsfeed without being their friend. Search the reporters you’re trying to connect with by name, and if they‘ve enabled the subscription option, subscribe to their posts. Interact with them and become visible by liking and commenting on their posts. When sharing a link to a story from a journalist you’re forming a relationship with, but you’re not yet Facebook friends, set these updates as public so anyone can see them. When a journalist views how many “shares” their story has, your post will be visible. “Like” the pages of the publications you’re targeting. If you can’t find a publication by searching directly on Facebook, their site will most definitely have a link to their page. Liking a page allows you to share content directly from the page. If a reporter doesn’t allow subscriptions like I mentioned above, this is the next best method for sharing their stories on Facebook. Using Facebook Ads, you can make your company visible to reporters. Facebook Ads can target users based on where they work (like a publication you’re trying to target!). In regards to the above, use these ads strictly for branding purposes and have them lead to more info about your company (a compelling landing page with recent news, press releases and media coverage is ideal). Make Them Come to You (Inbound Coverage) Create kick-ass content! Among many other reasons, extraordinary content can lead reporters TO you. There’s a big reason why content marketing is so hot right now (and always has been and will be). It's also one of the reasons why you constantly see people like Danny Sullivan show up in so many articles about search engines. Conduct market research on current trends in your industry. Publish the full results, but also consider making these into easily digestible forms, like a blog post of the most interesting findings. Also conduct surveys and opinion polls around hot (or emerging) topics in your industry. Publish your most compelling case studies. These can be used as examples by the press when reporting on your industry. Make all of the above into visual formats such as videos, infographics, kinectic typography. Because so many publications are online, they also need visual and/or interactive content to include in stories. Set up your Google authorship profile to appear as a credible source and help your content stand out in the SERPs. The Importance of Social Proof Add relevant social sharing buttons to your blog that also display the number of tweets, likes, shares, etc., a post has gotten (check out this post from Kristi Hines for more about displaying social proof). Enable comments on your blog, but also make participation easy to see by placing the number of comments at the top of each post. An added bonus of responding to all of your blog comments: it doubles the number of comments on each post. Create a “Featured In” section on your site listing some of the publications you’ve appeared in. List your most impressive past and upcoming speaking engagements on your site. An event inviting you to speak is proof you know your stuff. Actively grow your following on social networks. Your Twitter followers are by no means a direct reflection of your knowledge, but a down-to-the-wire reporter who needs an authority on a topic immediately may use this to help gauge your level of expertise. Do this by following other people, sharing great content and engaging in conversations daily. If you have a large number of email subscribers, put this number next to your sign-up section (this will also help to attract even more new subscribers!). What to Do Once You Get Coverage Share it on all of your social networks. Treat the article or post like it’s your own. Build links to it. Encourage sharing. Drive traffic to it! Include the link in your email newsletter and/or in your signature. Put it on your site. Start an “As Seen In” section... you’ll need it once you keep getting a ton of coverage! Let the reporter know you’ve been driving traffic to the story. If you contribute to the success of a piece, the reporter will be more willing to talk to you again. Most media websites have a most popular/most emailed/most shared/etc. widget on their site. Many also do round-up posts, email, Tweet, share on Facebook, etc. about the most popular stories of the day/week/month. If you help to promote your story and get in one of these spots, you will get the extra coverage. A. B. C. (Always Be Connecting) Actively introduce reporters, bloggers, and journalists to people who can help them out. Keep them up-to-date on the latest trends and things that you see happening. Don’t expect anything in return immediately. Seek out guest blogging opportunities in your industry. This not only helps build your authority and gains visibility for you and your company, but also presents a chance for link building. Most blogs will allow at least a branded link within your guest post or author bio. When you can’t actually help a reporter with a story (either you don’t have time or it’s completely outside of your expertise) refer them to someone who can. This saves the reporter time, and helps your friend. Win-win. Measure Results Start a spreadsheet with the link to the story and columns for key metrics like: social shares, links, referral traffic, and lead generation. Track metrics like social shares and comments. If the publications makes these number visible, this will be easy.... If they don't, you will need to track down the shares yourself. A basic search on Twitter with the link to the story will pull up all instances of shares, regardless of a link shortener being used. Plugging the URL into Topsy will show the number of tweets shared as well as the level of influence of those who shared. Keep track of the number of links to your coverage. Using something like Open Site Explorer is the easiest way to go about it, but you can also track these by setting up a Google Alert for “link:<the story URL>”. You can also count the number of times stories linking to your coverage were shared and commented on. Monitor your analytics for referral traffic. Note all instances of traffic from the original story and the sites that linked to the story. Pay attention to your organic traffic for searches leading to your site that relate to the topic discussed in your coverage. Use tools such as Topsy (free) Trackur ($), Sprout Social ($) or Radian6 ($$) to monitor buzz across the social web. Did you get a lot of new leads/sales after coverage? Many times, new customers will tell you themselves where they heard about you (keep track of this!). Also include a “how did you hear about us” option in your contact forms and allow space to include a source. KISSinsights is a great tool to help with this. At the end of the day, it comes down to tenacity and not being afraid to ask for something. Don't get caught up in thinking that you aren't worthy of press coverage or that a reporter doesn't want to hear from you. Just ask. The worst that someone can do is ignore you or say no. Simply by asking and actively pitching, you are ahead of the vast majority of your competitors. With that thought in mind, if you liked this post, would you mind thumbing it up and/or leaving a comment below? I want to know, what has worked for you? Where have you found success or hit roadblocks? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "92 Ways to Get (and Maximize) Press Coverage"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "92 Ways to Get (and Maximize) Press Coverage"
    },
    {
      "level": "H1",
      "text": "Know WHO You Are and WHAT You Want"
    },
    {
      "level": "H1",
      "text": "Build Your Media List"
    },
    {
      "level": "H1",
      "text": "Research (And Then Research Some More)"
    },
    {
      "level": "H1",
      "text": "The Art of the Email"
    },
    {
      "level": "H1",
      "text": "Working the Phones"
    },
    {
      "level": "H1",
      "text": "Growing Your Relationships"
    },
    {
      "level": "H1",
      "text": "Use LinkedIn"
    },
    {
      "level": "H1",
      "text": "Use Twitter"
    },
    {
      "level": "H1",
      "text": "Use Facebook"
    },
    {
      "level": "H1",
      "text": "Make Them Come to You (Inbound Coverage)"
    },
    {
      "level": "H1",
      "text": "The Importance of Social Proof"
    },
    {
      "level": "H1",
      "text": "What to Do Once You Get Coverage"
    },
    {
      "level": "H1",
      "text": "A. B. C. (Always Be Connecting)"
    },
    {
      "level": "H1",
      "text": "Measure Results"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Winfield\n          \n            Chris Winfield"
}