{
  "url": "https://moz.com/blog/99-ways-to-build-links-by-giving-stuff-away-and-improve-your-brand-too-14029",
  "slug": "99-ways-to-build-links-by-giving-stuff-away-and-improve-your-brand-too-14029",
  "title": "99 Ways to Build Links by Giving Stuff Away (and Improve Your Brand Too) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my last post I explained why free stuff is link building gold, and in this update I'm giving you 99 actionable ways to gain links by giving stuff away. By the end you'll have a ton of link building ideas, some of which I hope will be new to you. This is a springboard for new ideas, so I hope…",
  "content": "99 Ways to Build Links by Giving Stuff Away (and Improve Your Brand Too) Link Building M By: Mike Essex September 19, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Mike Essex September 19, 2011 99 Ways to Build Links by Giving Stuff Away (and Improve Your Brand Too) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In my last post I explained why free stuff is link building gold, and in this update I'm giving you 99 actionable ways to gain links by giving stuff away. By the end you'll have a ton of link building ideas, some of which I hope will be new to you. This is a springboard for new ideas, so I hope this 99 can become many more, so please leave your comments and help grow this list. These ideas come from methods I've seen customers use to get free stuff in researching the Free Stuff Everyday book, and also ideas we've used for clients at Koozai. In short there's nothing below that can't be sourced to the real world, so please give every idea a chance. These ideas focus on getting increased chatter about your brand online, with the logic that when people are talking about your brand they are likely linking to it as well. If you find there is a lot of brand chatter without any links, you can always use brand monitoring tools to track your mentions, and then followup to ask for a link. I've tried to make the list suit all styles, so you can either look at the nine titles and take it from there. Each bullet point has a short solution with a summary after the dash if you want more detail. Enjoy! Product Giveaways 1. Ask bloggers for reviews - Contact any relevant blogs in your niche and ask for a review. Send them the product and if they like it, you may get a link in return. 2. Provide products to gift bags - If you can provide your product at a key event as a freebie to the attendees there's a chance they'll then talk about the product online later. Think \"Oscar award bags\", but on a more manageable scale. 3. Let people test your product before release - Invite people to try your product and give them the finished item at the end of the process. Tell them how they made the product great. If people can see they made a difference they'll talk about it. 4. Host a focus group during product development - As above, but this occurs before the product has even been started. Ask past customers what you should do on a new product and then include what they say. You've given them an insight in to the product and they'll talk about it later. 5. Free pens / food / branded merchandise - Always have branded merchandise on you at all times. Whether it be something as small as a pen, or larger like a T-Shirt. Give them away whenever someone seems keen on your brand. They'll then see your brand frequently thanks to the merchandise, and it improves the chance of brand mentions. 6. Give products to photographers in return for awesome images - You get great shots of your product to use on photo sites, which let you link back. The photographers may also use these shots on their portfolio websites. 7. Build a website plugin and give it away - How many free Word Press themes have a sneaky link at the bottom? All the best ones do. So do the same thing and develop a branded plugin - this can be fun and brand specific too, it doesn't just have to be a tech tool. 8. Create a free version in a different format (e.g. Digital books) - Let people try the product in a format that is cheap for you to distribute. Give it to anyone who you feel may talk about it later. 9. Leak the product (but with a twist) - Codemasters had their game ArmA leaked, but they included code that meant the leaked game deteriorated in quality over time. It was a clever way to deter pirates, and got them loads of great press. 10. Let employees have time for personal projects - Lionhead games do this, and they reveal the best games at events. The media is then invited who write about their weird and wonderful games. 11. Provide a free app that compliments your brand - Although Koozai aren't a tools company we built one anyway. It's a free SEO analyser, and although we have no plans to build a paid version, it's a handy tool that people link to which makes our main site stronger. 12. Sell a micro / stripped down version of your product - Make it as easy as possible for people to sample the product. The cosmetics industry do this very effectively with sample versions. Get people trying it and talking about it. 13. Run an advert free website - For a website no adverts seems like a death sentence but it's the way Facebook started. No adverts until they had the right business model in place. Customers were attracted, linked were pointed, then they started worrying about money. 14. Stand in a busy town center giving stuff away - People like spontaneous freebies. So do something crazy like this. People will tweet about it and talk about it. Alert the media as well and you've got good coverage and links too. 15. Give your product to TV shows in your niche - Home makeover shows are great for this. Every product on these shows has been given by companies keen on media exposure. They give away the free product, it's featured on TV and that creates more brand chatter. 16. Offer a free trial - Let people try the product for a short time. People will then decide if they want to buy it at the end of the trial, and may then share their experiences online with others. 17. Surprise your friends with a freebie - Don't forget that friends and family can be asked to talk about your product. 18. Find superfans - Who are the people online that talk about your product a lot? Give them free products, or insights in to what you have coming up next. They'll relish the chance to work with you, and that can then be turned in to links. 19. Send products to industry experts - Who do you respect in your industry? Speak to them and give them exclusive access to your products. Ask them to share their thoughts on their blog. Give People Money 20. Vouchers - Create voucher codes and pass them to voucher websites. They will then link to your site with the code in place. 21. Hold a sale - Offer great prices and people will naturally spread these offers around. 22. Affiliate schemes - All Amazon affiliate links point directly to their website so pass on link value. The referrer makes money, you make a sale and get extra links. 23. Link to someone - Don't charge for a paid link. Instead give it away for free, in the hope that writing about others and linking to them will encourage more links in the future (think of it as link karma) 24. Pay people for giving you great content - The entire Squidoo business model is based on user generated content. But unlike other sites they pay users for great content that gets a lot of views. So users are incentivised to bring in extra traffic, which they do by link building and spreading the word. 25. Giveaway your product for a day - Ben & Jerry's hold a day every year where they give away free Ice Cream. They lose thousands on that day, but get loads of press and lots of links. 26. Create a pricing 'error' - Price a product incorrectly and it will attract a lot of attention from people passing it round (asking \"can it be true?\"). Do this for a short term error and you'll attract a lot of links quickly. But be nice, honour the price. 27. Pay for referrals - Groupon grew initially because they paid people for every referral who then made a purchase. They even gave people a URL they could use for this process. Which referrers then stuck on their personal sites, and Groupon got a link. 28. Give money back for people talking about your brand - In January Toyota offered $500 for anyone tweeting that they had bought a new Toyota. This was a clever campaign that attracted links from the media, and good brand exposure for Toyota. 29. Offer a money back guarantee - ASDA in the UK will give you money back if they aren't 10% cheaper than any other brand. It's a great scheme that is doing wonders for their press in the UK. Help Charity 30. Donate to charity - Giving money to charities not only has a feel good factor, but a lot of charities list their key donors on their websites with links back. 31. Do random acts of kindness - Give away your product to those who need it then tell these stories on your blog. 32. Do something unique - The Humble Bundle was an offer where games companies came together and let people pay any price they wanted for a set of games. You could also chose to donate to charity. It gave those games more exposure than they had on their own and was great PR for all involved. 33. Build charity in to your brand - TOM's Shoes give away a pair of shoes to the Third world for every pair you buy. It's a strategy that is at the heart of what they do and it resonates with customers who can't wait to tell other people about it. 34. Give products to charity auctions - If the list of auction lots is listed online then that's an instant link. You can also get links from PR coverage of the event, or the main charity website. 35. Give products to local hospitals - If the donation is big enough they may release a press release, or mention it on their website. 36. Double any money that employees raise for charity - Have a charitable cause in your company. If employees are doing things for charity it creates lots of opportunities for the local press to cover what they've done, or for the charities to mention the donations. Improve Your Community 37. Help other companies out - Tell them what you love about their product and offer to write about it for their blog in return for a link. 38. Give back to the local community - Fund a school, clean the streets for a day or start a neighborhood watch scheme. Do anything that helps the local community and let the local press know what you're doing so they'll write about it. 39. Train someone with an internship - Think like the Seth Godin MBA (where he offered people a free six month MBA sharing his knowledge in business). Take on someone in your business and train them up. Let them write about what they've learnt for your blog so it can be shared and linked to. 40. Give away awards to the community - Reward people in your community who deserve it. List the winners online for all to see 41. Help another local business out with a free service - Could another business benefit from having free access to your product? Give it them and ask them to write about it on their blog. 42. Make your product eco friendly - Giving something back to the environment by making eco friendly products, means the chance for PR in environmental blogs / magazines and other sources. 43. Pay for someone to learn - Ask a local school for someone who is a rising star but who can't afford tuition. Fund them in school, and offer them a job at the end of it. 44. Give away your expertise - Train people about your business and how to do well in your industry. People like to be taught, and will write about it later. 45. Help someone succeed with a crowd sourced project - Donate to a project relevant to your niche. Many sites list rewards for donors including links and other SEO perks. 46. Sponsor someone - Chris Barrett & Luke McCabe were sponsored through University simply by people giving them free stuff. They then got all the brands who gave them freebies a load of free exposure on national TV and online. 47. Help someone make their product free by paying for it - Sponsoring a project and getting your name on it is a good way to benefit by association. For example The Domino Project gives away its eBooks because they're funded for by corporations. The author gets their work in the market, and the company who donates gets exposure every time the book is read, and is included in Domino Project PR and links. 48. Build a forum for customers to talk - Giving customers a place to share their views, and maintaining it takes time and commitment. But it's also a good way to create a well linked to resource. People can then link to the forum if anyone needs help with a question elsewhere. 49. Allow comments on your blog - The free gift here is the time it takes to maintain this, but improving conversations on your own blog draws people back and gets them passing around useful information. 50. Hold a flashmob - Then give everyone who attends the flashmob, your product for free and make sure the press are aware of your event. 51. Take great site imagery and make it creative commons free - People love great imagery and if you can make your images available for all then it gives them something to share and link to. Hold Competitions 52. Create a unique product variant as a prize - People love someone different, so change your product in one simple way (such as a colour change) and offer it to the winner as a one off. 53. Give away a money can't buy prize - Offer a tour of your factory, or something cool from the office. Let people have a meeting with your MD or star in your next advert. Give them something they could never buy to help your competition spread. 54. Offer a free advertising spot on your site as a prize - Your site is a prime real estate. So why not let the winner have a spot on your site to do with as they wish? Skittles do this well with their Facebook page where they pick a fan of the week and immortalize them on the profile. 55. Challenge people - What is the one thing your product does well? Challenge customers to beat your product and offer a prize for the winner (e.g. break our safe). 56. Give the public what they want! - Let the public decide what you should cover next. For example Google Webmaster Tools videos are all based on user generated suggestions. 57. Ask people to sing a song about your product - Offer a prize to the most viewed video and host them on your website. People will then link to their video to get it more views, and you get extra traffic and links. 58. Request videos about your product - Ask people to film a fun video based around your product. Let them do whatever they want, and then host the best ones on your website. 59. Hold a competition to find your next employee - Compare the Market did this with an excellent mini site to find their new Social Media ambassador. The winner was whoever got the most votes, and votes were all done on the site itself. So to win you had to tweet and promote your page like mad. 60. Add your product as a prize on popular sites - Lady Gaga used Farmville to promote her new album with the chance for people to hear songs for free if they did well on the game. This would have worked better if the app was on her website, so any press hype would have pointed back to her. 61. Give someone your product to set a world record - The Oreos lick race is a challenge to lick Oreos the fastest. Oreos could help this work by giving away free biscuits to entrants to help them win the record. 62. Hold a competition on Twitter - Run a competition that people must tweet to enter. In the message that they must retweet include your URL so it gets lots of extra mentions on the social platform. 63. Giveaway products to Facebook fans - As above, but ask them to write a message on their Facebook wall with a link. 64. Let fans decide your next product - Prizes for the winners, as well as the chance to be immortalized on the finished product. Giveaway Your Knowledge 65. Create a survey - Then giveaway the results for free and help others in your niche. Ask questions people want to know the answers to, so that they will pass on the information via links. 66. Write a guest blog post - Share what you know with other websites, and write useful content. Add a link back to your website in an authors bio. 67. Create how to videos - Teach people how to use your products, or how to be better at their jobs. Give them the type of insights they'd usually have to pay for and they'll thank you for it. We giveaway how to guides that we could charge for, simply to build brand awareness. 68. Accept questions from the community - Then help them out with detailed answers so they will be likely to share the results with others. 69. Build an amazing infographic - Spend the time to make a great looking infographic that presents key information on your niche. Make it fun to view, and post it on infographic sharing sites for a link back. 70. Create Kinetic Typography - Or 'video infographics' as I like to think of them. Answer a question with the Infographic so people share it. Here's a great Google example. 71. Write a whitepaper - Give it away rather than charging for the results, but ask people to tweet about the whitepaper so they can get it. Here's how the Clockwork Pirate does it. 72. Make a Top 10 list - Then link to everyone in the list and give them a badge to display on their own website. You're giving them links and exposure for free, but if they are proud of the achievement they'll link back. 73. Fight against something you feel is wrong in your industry - I spent hours fighting against eBook piracy and writing content to complain about it. I did it because it was an issue that needed exposing. The fact it became the most linked to piece of content on our blog was an added bonus. Expand Your Network 74. Host a free event - Give people a chance to get together in your industry and make it free. Organise the event through your website, so people have to pass the link around to make other attendees aware. 75. Speak at a conference for free - You'll improve awareness of yourself, and get a link from the conference website. 76. Attend free networking events - Make friends in your industry and give them information and your time. If they like what you have to say then they'll talk about you later and may pass on link love. 77. Buy someone a beer - Twitter is great, but no substitute for taking people out and chatting face to face. So take someone out for dinner, or just buy them a beer. Get them on your side so you have a possible linking partner in the future. 78. Pay for a phone call - Email may be free but phone calls are much better for link prospecting. If you want a link then call up and ask for it. Give the person a reason to link to you, and explain why they should. 79. Teach a class - Pass on the industry knowledge you have in a class. The people you train today are link allies for the future. 80. Provide lecture materials to Universities - Work with lecturers to ensure their classes have the most up to date information in your niche. Then over time you can ask the University to mention your assistance on the course page or in their blog. 81. Have dedicated Twitter feeds - When your brand in mentioned online you want to be able to react. So when Peter Shankman asked for a steak at the end of his plane journey he got one. Of course Peter has thousands of Twitter followers, so fulfilling his request was great PR for Mortons who provided the steak. Alert the Media 82. Hold a Press Event - Spend time and money holding a press event to ensure maximum exposure for your next product. Then give it away for free to all who attend so they can write about it afterwards. 83. Give journalists a sneak peak - Collect together a group of journalists who are influential in your niche. Promise them exclusivity and a free product in return for a writeup. 84. Reply to HARO queries - Spend your time helping reporters out with HARO, and get exposure in the press. 85. Sign up for PR wire services - Do the same with any PR wire service and see what journalists would like help on. Give them knowledge when they need it, and you can build strong PR relationships for life. 86. Distribute press releases - Invest in a PR firm, or spend the time writing a killer press release. Give away information on the product and offer journalists review samples. 87. Call the local press - Ask if they need a source on a topic. Whenever there is motoring news in the UK, journalists ring the AA. It's because they know the AA will drop everything and help them out with a quote. The AA give something to journalists and get great press back. 88. Give your product to a celebrity - Get people talking about your product by photographing a celebrity with it and passing that on to the media. 89. Appoint a PR person - Then make their details available online for any questions. It'll take time on your part, but helping out journalists is the best way to get high quality links. Use Rewards 90. Provide fan discounts - The SEOmoz perks scheme is a set of discounts for pro members. The companies involved are missing out on revenue but they're also creating opportunities for people to check them out and share the word. 91. Improve customer security - Barclays bank sent all of their customers a free device that added extra security checks whenever they wanted to check their balance online. This gave them a new selling point and press coverage. 92. Add new features for free - Create a patch for your product, or give it extra features to create a new opportunity to promote the product. 93. Let the fans decide - Relinquish control to your fans and help them decide what you should do next. The design for the lead female character on the Mass Effect 3 box art was decided by a user vote. The competition went viral and exploded in a parade of links overnight. 94. Spend more on customer service - Remember that investing in your business is the same as giving something away. People love to compliment good customer service and will do so now they have social networks at their disposal. So treat them well and they will talk about you. 95. Recruit brand ambassadors - The Relentless energy drink team recruit people who can talk about their brand and help out at events. The group then get free stuff at events in return. 96. Build a street team - The London 2012 Olympics will give you free tickets if you help at out the event. With main tickets sold out now it's the perfect place for people to link to if they want to help their friends get tickets. 97. Hire mystery shoppers - Recruit people to go in to your stores and buy products to test the store customer service. Then let them keep the products. Create a subdomain where people can apply and refer others. 98. Reward fans with early access - In the run up to the release of Portal 2, Valve software set a competition where people could get early access to the game if they beat an Alternate Reality Game. The winners only got two extra days play, but the competition was reported by the mainstream gaming press with links to the ARG site. And the final rule: 99. Tie everything together - Right now these ideas are separate bullet points but you can tie them together. For example ask fans what they want, then give it to them for free, and offer to donate to charity every time they buy it (The Behemoth pulled this off amazingly). If you like these solutions I hope you'll also try my book - \"Free Stuff Everyday\" which explains more about the concept of getting stuff for free, and why that's great for brands and customers. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "99 Ways to Build Links by Giving Stuff Away (and Improve Your Brand Too)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "99 Ways to Build Links by Giving Stuff Away (and Improve Your Brand Too)"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Essex\n          \n            Mike Essex\n          \n            Mike Essex"
}