{
  "url": "https://moz.com/blog/a-beginners-guide-to-the-google-search-console",
  "slug": "a-beginners-guide-to-the-google-search-console",
  "title": "A Beginner's Guide to Google Search Console - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover the value of Google Search Console for SEO, marketing, and business owners. Learn how this free tool provides insights into your site's performance, engagement, and technical issues. Learn how you can use GSC to make more informed decisions for your website.",
  "content": "A Beginner's Guide to Google Search Console SEO Basics | SEO Analytics By: Angela Petteys November 20, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Angela Petteys November 20, 2023 A Beginner's Guide to Google Search Console SEO Basics | SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Whether you’re an SEO, marketing professional, or business owner, Google Search Console can be an extremely valuable tool. But if you’ve never worked with it before, it can be hard to know where to begin – especially if you need to start from scratch by setting up a brand-new property. But once you’ve had a chance to get familiar with it, you’ll find it’s pretty user-friendly. If you’re not familiar with Google Search Console, let’s begin by understanding what, exactly, Google Search Console is. Google Search Console is a free tool that helps site owners, SEO professionals, and marketing teams see how a site is performing, how people are engaging with a site, and identify problems that need to be addressed. In addition to showing how a site is performing on Google, Search Console can let you see which pages Google is indexing and find technical errors that can impact your site’s performance. Now that you know what Google Search Console is, let’s talk a bit about what Google Search Console isn’t. First, Google Search Console is not a ranking factor. In theory, a site can have lots of highly ranking content even if they don’t use Search Console. Instead, the information Google Search Console provides can help inform decisions that do impact a site’s rankings. Secondly, Search Console is not the same thing as Google Analytics. While they both provide insights into site performance and support SEO and digital marketing strategies, Search Console focuses more on search engine performance, while Google Analytics is more focused on user interactions on a website, such as conversion rates, other actions visitors take, and how much time people spend on a site. Before you can start taking advantage of everything Google Search Console has to offer, you’ll need to get Google Search Console set up on your site. Creating a new Google Search Console property When you open up Google Search Console while logged into your Google account, the first thing you’ll see is a screen giving you the options for your property type: Domain or URL Prefix. In most cases, you will want to go with the Domain option since it will include all pages and subdomains on your site. However, if you want to track the performance of one specific part of your site, such as a section with informational resources, you’ll want to use the URL prefix option. Creating a domain property If using the Domain option, enter your URL in the box and click Continue. This will take you to a screen where you’ll be provided with a TXT code to copy into your site’s DNS configuration. Do this in a separate browser tab or window so you can easily return to this screen when complete. Once you’ve copied the TXT record into your site’s DNS configuration, simply press the Verify button pictured above. Ideally, you’ll get a message telling you your ownership has been verified. However, if you get a message about your verification failing, don’t panic. This is a very common issue since it can take a little bit of time for DNS changes to update. Wait at least an hour or two and try verifying your site again, but it can take upwards of 48 hours for those DNS updates to go through. Creating a URL prefix property If you want to use the URL Prefix option, you’ll have a few different options for verification: HTML file, HTML tag, domain name provider, Google Analytics, and Google Tag Manager. Google recommends using the HTML file option, but regardless of which one you prefer, you’ll be provided with instructions on how to proceed if you click on your preferred method. If you already use Google Analytics or Tag Manager, those options may be easier for you. If you choose the domain name provider option, the process is essentially the same as going through the Domain Property verification process. Regardless of which option you use to verify your site with Search Console, once your site is verified, it will stay verified as long as Google is able to confirm your verification token. So, once you’ve completed this process, do not remove the verification code or HTML file provided by Google from your site. If you do, you’re going to need to re-verify your site if you want to continue using Google Search Console. Connecting Search Console & Google Analytics Earlier, we briefly talked about the distinction between Search Console and Google Analytics. While these are different programs, you may want to consider connecting these two accounts. Doing this will give you access to two additional reports in Analytics: Queries and Google Organic Search Traffic. The benefit of connecting your accounts is that the extra reports in Analytics give you additional options for customizing the order of your metrics/dimensions and how your data is visualized. In the case of the Organic Search Traffic report, you’ll also be able to drill down into your data using seven different metrics available in Analytics. To connect your accounts, open up your site’s Google Analytics property and select the Admin gear button. From there, look in the Property column and click on the Search Console Links option, found under the Product Links section. From there, click on the blue Link button. Next, you’ll be asked to select the Search Console property you want to link to the Analytics account. Once you’ve done that, you’ll be asked to select your data stream. Next, verify that all your selections are correct and hit the Submit button. Understanding owners, users, and permissions Now that you’ve verified your site with Search Console, you need to think about who you want to be able to access your Search Console account and what they can do while they’re logged in. Since many different people commonly access Search Console properties, it’s important to make sure everybody who needs to access the property is able to do what they need to do while limiting the chance that someone might make unwanted changes. There are two main types of users in Search Console: Owners and Users. Owners have full control over a Search Console property and its data. They can change settings, view data, work with tools, and add or remove other users. Users have more limited access. Someone with user-level access can see data, but they don’t have the free rein that owners get to take other actions or add users. To add users to a Google Analytics property, select Settings from the left side menu, then click on Users and Permissions. On the next screen, click on the blue Add User button on the right side of the screen. From there, simply enter the email address of the person you want to add, select their access level, and hit the Add button. Navigating Search Console Now, let’s start taking a look at the insights Search Console provides. When you first open a Search Console property, the first thing you’ll see is an overview screen, where you can take a quick look at your key metrics, including total clicks from search results, how many pages are indexed and are not indexed, where there may be issues with page experience, and a look at site enhancements from structured data. URL inspection If we start working our way down through the navigation menu on the left side of the screen, the next option under Overview is URL Inspection. If you want to check to see if a specific page on your site is being indexed by Google, you can do so here. Ideally, if you run this test, you’ll see the green check mark with a message letting you know that your URL is on Google, like in the screenshot below. This doesn’t necessarily mean the URL is ranking for any keywords; it just means that Google can include it in search results. You might also see a message letting you know that the URL can appear on Google, but there are problems that need to be fixed. If there’s a problem with the schema used on that page, you’ll be able to find information about those errors under the Enhancements section. You may also want to check the Security Issues and Manual Actions reports to see if there’s an issue that could be preventing the page from showing up in search. We’ll talk about the Security Issues and Manual Actions reports later in this article. You may also get a message letting you know the URL is not currently indexed by Google. This can happen for a few different reasons: If you see an explanation that the page isn’t being indexed because of an error, that means it’s being blocked by your robots.txt file, because of a noindex heading in the page’s HTML, or because of an HTTP authorization request header.If you see a note saying the page can’t appear in search results until it is indexed, this means that Google encountered an indexing error, such as if a page had a 400 or 500 status code when Google last tried to crawl it.You might also see a message saying that the URL is an alternate version of another page, such as the AMP version of a page. In this case, there is nothing else you need to do to fix it. The information in URL Inspection reports is based on Google’s last crawl of the page, not the live URL. If you’ve recently made some changes to a page and want Google to crawl it again, you can do so by pressing the Request Indexing button. Just remember that you are only able to request indexing for 10—12 URLs in a 24-hour period, so only request indexing once per URL on a given day. It might take some time for your page to be re-indexed, and submitting multiple requests for the same URL on the same day won’t speed anything up. Search results & Discover The Search Results report is going to be where you get a lot of insights into how your site is performing on Google. Here, you’ll be able to see how many impressions your pages are getting in search results, how many clicks you’re getting from search results, and average positions in search results. You can also get information about the ways people are finding your site, like what keywords people are searching for, which pages are getting the most visitors from search, and the types of devices people are using when searching for your site. This report has some great filters to help you get a very detailed look at your site’s search engine performance with data tailored to your needs. These filters can let you drill down your data based on dates, either by a range of dates or one specific date. You can also look at data for specific pages or page categories, the types of devices people use when searching, and which countries your search traffic is coming from. The Search Appearance filter can also be used to look at which pages are getting rich results in search. The Search Appearance filter can include several different types of rich results your site might qualify for, including videos, merchant listings, event listings, review snippets, and job postings. Many types of results you might see in the Search Appearance filter are driven by structured data on your site, but you may also see a category for pages that meet Google’s standards for a good page experience. There are a lot of possibilities for how these filters can be used, so if you’re new to Search Console, it’s worth taking some time just to play around with them a bit and get familiar with what they can do. I’ll give you just a few examples: Let’s say I wanted to know which blog posts on my site have been getting the most traffic from search in the past few months. From the screen pictured below, I’d select the New button next to the filters for web searches and the date range. That will take me to a screen where I can create a filter that shows all URLs that include “myfakesite.com/blog.”If I noticed my site had an unusual spike in traffic on a certain day and wanted to figure out what might have caused it, I could change the date filter to that specific day and take a look at the terms people were searching for and which pages had the highest click-through rate.Another thing I might want to do is focus on non-branded keywords my site is appearing in search results for. In that case, I could create a new Query filter to exclude keywords that use a company’s name or a product’s name. In addition to the Search Results report, Google Search Console also includes a Discover report, which lets you see how content on your site is performing in Google Discover. Pages Under the Pages option, you’ll find the Page Indexing report. This shows you how many pages are being indexed, how many aren’t being indexed, and why those pages aren’t being indexed. It’s very common for sites to have pages that aren’t being indexed, and it’s not necessarily a bad thing for pages to be unindexed. Google recommends that only canonical pages should be indexed, not duplicate or alternate versions of pages. Also, pages that have been redirected to a different URL will also show up as not being indexed. However, if there are any notable drops in the number of pages being indexed, it’s worth checking to see if there are problems you can address. In the section explaining why pages aren’t being indexed, look for issues where “Website” is listed as the source. This means that the reason has something to do with the website itself, not something to do with Google. If you take steps to solve a problem on your website and want to let Google know that you’ve fixed it, you can simply click on the reason you addressed and ask Google to verify your fix. Video page indexing The Video Indexing report is pretty similar to the Page Indexing report but focuses just on pages that contain video content. As is the case for the Page Indexing report, you can see how many indexed pages you have that include videos, how many unindexed pages have videos, and why those pages aren’t being indexed. Sitemaps Sitemaps are files that give search engines and web crawlers information about how your site is organized and the type of content available on your site. They can include metadata with details about your site, such as information about images and video content and how often your site is updated. By submitting your sitemap to Google Search Console, you’re making Google’s job easier by ensuring they have the information they need to do their job more efficiently. Submitting a sitemap isn’t mandatory, and your site won’t be penalized if you don’t submit one. But it’s a good idea to submit one, especially if you have a very large website, if your site has many pages that aren’t thoroughly linked together, or if your site is new and doesn’t have a lot of backlinks yet. To submit a sitemap, click on the Sitemaps option on the left side menu in your Search Console property. From there, all you’ll have to do is enter the URL of your sitemap in the Add a New Sitemap box and hit Submit. That’s all there is to it! Removals If you’re in a situation where you urgently need to remove a page on your site from Google search results, the Removals option on Search Console can help. This is not intended to permanently remove a page from search results. If you request a removal, the page will only be removed from search results for about six months, and you’ll need to take extra steps to make it permanent. This tool simply gives site owners time to either update the page content or take steps to remove it permanently. It’s also worth noting that Google has a list of times when the removal tool should not be used. If you need to request that a URL be removed from search results, all you have to do is select Removals on the left side menu and press the New Request button. From there, you’ll have the option of either temporarily removing a URL or clearing the cached URL. If you choose the Temporarily Remove URL option, this will remove the URL from search for about six months and clear its cached version and search snippet. The Clear Cached URL option will keep the URL in search results but clears the cached version and snippet until the site is crawled again. When requesting a removal, you can request the removal of a single URL or the removal of all URLs with a certain prefix. In most cases, you’ll probably want to remove a single URL. But if you want to remove an entire section of your site from search, you’ll want to go with the option to remove all URLs with a given prefix. Just be careful to make sure you select the right option so that you don’t accidentally remove a lot of content that you didn’t intend to. In one notable case, LinkedIn once ran into problems by doing this. Experience The Experience section of Search Console focuses on technical factors that can affect user experience for visitors to a site, such as your core web vitals, issues with mobile devices, and whether or not HTTPS is being used. If you look at the Page Experience overview and see that issues have been found, you can click on the type of problem to learn more and see which URLs are impacted. In the case of the screencap below, if I clicked on the Core Web Vitals box, I’d be taken to a report that lists the exact types of core web vitals that need attention. From there, I’d be able to click on a specific problem and see which URLs are experiencing that issue. Enhancements Structured data can be used on a site to enhance the appearance of a wide range of information in search results, such as product listings, event listings, and company logos, just to name a few. If you use structured data in any way on your site, the Enhancements report can help you make sure it has been implemented correctly or if any corrections need to be made. The options you see in the Enhancements section of Search Console will vary depending on which types of schema are being used on your site. This section is automatically populated by Google based on its crawls and the structured data it found on your site, so what you see might look slightly different from what you see in the screenshot below. If there are pages where Google isn’t able to identify which type of structured data is being used, it can be found in the Unparsable Structured Data report. Security issues & manual actions Hopefully, the Security Issues and Manual Actions reports are reports you’re not going to have to worry about too much. The Manual Actions report is where you can see if there are any instances where a person working at Google has found pages on your site that violate Google’s spam policies. Or if Google believes that pages on your site could be potentially harmful to visitors, those issues will be highlighted in the Security Issues report. The Security Issues report can include things like suspected hackings, malware/spyware, and content that engages in social engineering or phishing. Legacy tools & reports Google Search Console has changed a lot over the years, but not all of its past functionality has been incorporated into its latest version. Access to some of these older reports can be found in the Legacy Tools & Reports section. Links Last but certainly not least, there’s the Links report in Search Console. For SEOs, this report will be very helpful in letting you see which pages are linked to the most (both internally and externally), what anchor text is being used to link to your site, and which domains link to you the most. Ready to get started? We hope this guide has been helpful in getting you acquainted with Google Search Console. Now that everything is set up and verified, you can start taking in all the information that Google Search Console has to offer. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Beginner's Guide to Google Search Console"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Beginner's Guide to Google Search Console"
    },
    {
      "level": "H2",
      "text": "Creating a new Google Search Console property"
    },
    {
      "level": "H3",
      "text": "Creating a domain property"
    },
    {
      "level": "H3",
      "text": "Creating a URL prefix property"
    },
    {
      "level": "H2",
      "text": "Connecting Search Console & Google Analytics"
    },
    {
      "level": "H2",
      "text": "Understanding owners, users, and permissions"
    },
    {
      "level": "H2",
      "text": "Navigating Search Console"
    },
    {
      "level": "H3",
      "text": "URL inspection"
    },
    {
      "level": "H3",
      "text": "Search results & Discover"
    },
    {
      "level": "H3",
      "text": "Pages"
    },
    {
      "level": "H3",
      "text": "Video page indexing"
    },
    {
      "level": "H3",
      "text": "Sitemaps"
    },
    {
      "level": "H3",
      "text": "Removals"
    },
    {
      "level": "H2",
      "text": "Experience"
    },
    {
      "level": "H2",
      "text": "Enhancements"
    },
    {
      "level": "H2",
      "text": "Security issues & manual actions"
    },
    {
      "level": "H2",
      "text": "Legacy tools & reports"
    },
    {
      "level": "H2",
      "text": "Links"
    },
    {
      "level": "H2",
      "text": "Ready to get started?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    }
  ],
  "author": "Angela Petteys\n          \n            Angela Petteys\n          \n            Angela Petteys"
}