{
  "url": "https://moz.com/blog/a-beginners-guide-to-small-budget-local-clients",
  "slug": "a-beginners-guide-to-small-budget-local-clients",
  "title": "A Beginner's Guide to Small Budget Local Clients - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How do you maximize value for a local client with a small budget?",
  "content": "A Beginner's Guide to Small Budget Local Clients Local SEO By: Kalee Raisor December 30, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Kalee Raisor December 30, 2013 A Beginner's Guide to Small Budget Local Clients Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I did landscaping maintenance for a lot of years. When I first started, we focused on a few large accounts that together comprised over 85% of the business we did. We had small accounts, but only enough to schedule for one day a week and beyond that we generally referred them over to another company. Does this mean small accounts were bad? Not really. They were generally quick and painless, but they did require more overall down time (percentage wise) in the form of gas, travel time, account management, etc. However, regardless of the extra downtime, the profit margin was roughly the same as larger accounts. Does this sound familiar in any way? I read a lot of posts on here and other marketing sites about tips, tricks, and everything in between for marketing, ranking factors, content creation, social media, and so on. The majority of the time these are only applicable to clients above a certain budget. After all, how are you going to do onsite work, content creation, social media promotion, link building, landing page creation and optimization, and citation building for a local client with a small budget? You can’t, of course, at least not all at once. You also need to make sure the client understands that. So how do you maximize value for a small budget local client? Always start with the most important items first. This really goes without saying, but do the important things first. Assuming they already have a site, a starting guide looks something like this (as a reference, I recommend reading the 20 local ranking factors guide that was just published): Onsite Schema Location based landing page(s) Call to actions Creation (and verification) of Google+ local page Citation building Social profiles Brand awareness / link building And on down the line, until you reach a point where you’re back to adding new content to the site, social outreach, geo-targeted PPC ads, etc. Now, instead of regurgitating content you can find in the local ranking factors guide, I’m just going to summarize a few things. (Yes, I know it’s Google Maps, but I like this more) Get onsite and Google+ local done as soon as possible Will this (along with reporting, communication, etc.) consume the budget for a month or two? Yes. Is it worth it? Definitely. After that, setup social profiles, use a tool like HootSuite to manage it and save time, setup advance posting (or you can use NextScripts: Social Networks Auto-Poster if they have a Wordpress blog and if you can get them to post content) and try to automate it as much as possible, because with a small budget you aren’t going to have time to do much, and there’s still a lot that needs done. Citations, local business directories, and why others can do it better than you can With citations I like to take a bit different approach than I generally read about others doing. For the most part with small budgets I’ll reserve a certain amount each month (after the previous items are completed) and run it recurring through Whitespark. At first I focus on the general citations, to make sure the big directories are covered, such as Yelp, YP, Manta, etc. Once enough of those are placed to ensure syndication (see David Mihm’s post about it here) then I start using more and more of the citation budget for niche citations. At $5 per general and $6 per niche citation, it’s a hard price to beat. Just make sure your client understands the need to verify the accounts. Could I do the citations myself? Sure, but probably when you factor in the $99 a month for access to the tool, plus the time it takes me to personally do it, it’s cheaper and easier to send it off to them. Additionally, it gives me the remainder of the budget to focus on. Brand Awareness / Link Building That’s right, I’ve mentioned link building like three times so far. However, you’ll notice that it’s always presented along with brand awareness. I happen to agree with most of the stuff you read on Moz, building links for the sake of building links is generally not worth the time. Especially with small budget local clients, it just doesn’t make any sense. However, if you’re wanting to increase brand awareness and get links at the same time, there are good ways to do that. Just make sure you remember a few things: Diversify. Don’t just do one kind of link every month and nothing else. Add value. If what you’re creating doesn’t increase value in some way, don’t bother. You can’t afford to guest post, so you need to be creative. Blog Comments Search for local blogs, use the owner’s name, and leave relevant comments. Now, if you’re leaving spammy comments then don’t bother, but if you’re trying to reach local prospects and increase their awareness of the client’s business, then go at it. For example, here’s Matt Cutt’s talking about blog comments. It’s important to have your priorities in order, if your intent is links for the sake of links, then your actions will probably reflect that. Profiles Not all profiles are bad, or spammy. For example, make a profile for the client at About.me and other similar sites. Remember, take some time to fill them out properly, if it was your business you’d want it to look nice, right? Also take a little bit of time and find related businesses to follow or add. Try to find local profiles that you can add to collections or follow as well. Blog No, not just on their site. Make some blogs, add content, and don’t be afraid to mention the client, they’re paying for it after all. Just stay aware from the keywords in the anchor text, think brand awareness. Just make sure you’re adding content that has value. If your client does landscaping, have them write you up a list of five tips to keep your yard looking great and edit it as needed. Once again, there are plenty of places to do this as well. Everyone knows about Wordpress.com and Blogspot, and if you use those you can find related blogs to follow. Try to contribute, read some of their work, add comments, interact and give them a reason to follow back. This will increase the authority of the blog you made on behalf of the client. Content Curation / Aggregation By now I imagine most people know about the big ones, and what they do. You hit Rebel Mouse, Paper.li, and/or Scoop.it, create a relevant topic, and look for good sources to add. Take a bit of time and find authorities on the topic your client is in (from a different area of course) and make something that’s actually useful to read. In addition to the ones I already listed, other alternatives are Storify and a new one, PressJack. Press Releases A lot of press releases nowadays are nofollowed, which is fine. You also need to make sure that your client is doing something worth a bit of news as well. For example, over Halloween a lot of places were doing the candy for cash trades, and depending on the size of the city where the client is, this may qualify as something of note. Once again, stay away from keyword anchor phrases. You want brand awareness. Donations This one is great, in addition to helping the client, you also get to help the local community. A lot of times there are non-profit corporations, like animal shelters, that accept donations and then list the companies or individuals who helped on their site, brochures, in their office, etc. A fantastic way to increase awareness for your client. Obviously you can’t do these all at once, and it will take some research for your client’s area, but it’s a great way to go for a long term strategy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Beginner's Guide to Small Budget Local Clients"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Beginner's Guide to Small Budget Local Clients"
    },
    {
      "level": "H2",
      "text": "Get onsite and Google+ local done as soon as possible"
    },
    {
      "level": "H2",
      "text": "Citations, local business directories, and why others can do it better than you can"
    },
    {
      "level": "H2",
      "text": "Brand Awareness / Link Building"
    },
    {
      "level": "H2",
      "text": "Blog Comments"
    },
    {
      "level": "H2",
      "text": "Profiles"
    },
    {
      "level": "H2",
      "text": "Blog"
    },
    {
      "level": "H2",
      "text": "Content Curation / Aggregation"
    },
    {
      "level": "H2",
      "text": "Press Releases"
    },
    {
      "level": "H2",
      "text": "Donations"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kalee Raisor\n          \n            Kalee Raisor\n          \n            Kalee Raisor"
}