{
  "url": "https://moz.com/blog/a-brief-review-of-the-seomoz-professional-guide-to-link-building",
  "slug": "a-brief-review-of-the-seomoz-professional-guide-to-link-building",
  "title": "A Brief Review of the SEOmoz Professional Guide to Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I thought I had already submitted this but after I hit 'publish' it lost formatting and I'm not sure if it actually went to you. If this is a duplicate then please accept my apologies... My little boy had a temperature on Friday so it was a day of sitting under blankets on the settee, playing Lego…",
  "content": "A Brief Review of the SEOmoz Professional Guide to Link Building Link Building J By: James Wittering February 22, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: James Wittering February 22, 2007 A Brief Review of the SEOmoz Professional Guide to Link Building Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. My little boy had a temperature on Friday, so it was a day of sitting under blankets on the settee, playing Lego Star Wars, and watching DVDs whilst the virus worked it's merry way through my little soldier. It was also an opportunity to print out and read SEOmoz's guide to link building, retailing on this very site for $29.99. Why am I reviewing this? I tend to buy things based on the experience of others (hence my love of testimonials as an integral part of designing a site for conversion), and I thought it might be useful for you to get the opinion of an average(?) SEO consultant on the usefulness of this article, given that there is a cost attached. Why did I buy it? Link building is unquestionably the most important strategic device for improving organic SERP rank, so an insight into the methodologies employed by a team I regard very highly in the industry is an invaluable piece of knowledge to me. Potentially. If it's any good. What is it? The Professional's Guide to Link Building is a 40 page, 26 chapter article pitched as a complete guide to link building, starting with the basics and providing a series of simple 'How to' guides for finding links, determining the quality or value of a link, and how to go about securing those links, including \"over 50 unique strategies for link development.\" The real hook for me was this very cleverly included line: \"These are the same strategies SEOmoz employs with our clients to attract high quality links to boost rankings at the search engines and obtain relevant, direct traffic.\" Is it any good? Each element of the proccess covered (and they are all covered) acts like a blueprint for that part of the job. Simple to understand and easy to follow guidelines are laid out for you to shape into a workable format for each one of your clients requirements. There a fair few 'back to basics' moments where I was made to feel that I had been neglecting some things that, according to SEOmoz, are still important. A valid reminder perhaps of the wide array of things that must be considered, even within the link-centric factors of algorithms. I'll be honest - I picked up some fab tips. The kind of things that make you want to try them out right away, or at the very least include in tomorrow's 'to do' list. For me, there was clear value for money. $29.99 (Or £15 if you live in the town where Worcestershire sauce is made like what I do) is a fair price point. Anything missing? Everything is covered, and the content for each topic is spot on. There are a couple of question marks over one or two small points. Maybe a small update concerning the 'linking value' of a certain social media site, for example. But we are not in an industry that takes its time with changes, so a well-read professional will be quite used to identifying and forgiving small indiscrepincies. Individual perception and interpretation might also play a part. That's the point though, isn't it? What we know of what Google likes is not far off the money. We know this because we can measure the effects of what we do without knowing the precise reasons. I haven't seen a black hole, dark matter, or the Google algorithm, but I know what they do because I (or clever bearded men) can 'prove' them into existence. So it is with link building. It works, and here the best ways to make it work. How you adapt this advice into your existing techniques and the needs of your clients is up to you. Is it worth your $29.99? Give a man a link and he might rank for a term - teach him to find his own links and he can rank for all the terms he wants (if he works hard enough). That corny and ill-conceived pastiche of a well-known saying works for me as an over-riding theme for this article. I enjoyed it as much for the stuff I discovered I was doing right as for the new stuff I learned. I felt a mild twinge of pride that a technique I had discovered, tinkered with, and made work for me was also an integral part of the SEOmoz model. Go me. All the information is there. Perhaps a little housekeeping on some of the finer points may be required over time, but it's an authority on the topic. For the beginner, it's invaluable. I couldn't suggest a clearer introduction. For the seasoned pro - I'll bet there are a few reminders, refreshers, and juicy tid-bits to make it worth your time and money. For everyone in between, I can happily recommend this piece as an extremely informative guide to the most important part of your job. Oh, and since the word 'review' is in the title, so the word 'score' should appear at the end: Score: 9/10 Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Brief Review of the SEOmoz Professional Guide to Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Brief Review of the SEOmoz Professional Guide to Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Wittering\n          \n            James Wittering"
}