{
  "url": "https://moz.com/blog/a-checklist-to-choose-which-internet-marketing-channel-is-right-for-your-business",
  "slug": "a-checklist-to-choose-which-internet-marketing-channel-is-right-for-your-business",
  "title": "Which Internet Marketing Channel is Right for You? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My good friend, Aaron Kahlow, posed an interesting question during the Online Marketing Summit yesterday afternoon in Portland, OR. Aaron asked:",
  "content": "Which Internet Marketing Channel is Right for You? Marketing Industry By: Rand Fishkin July 1, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 1, 2009 Which Internet Marketing Channel is Right for You? Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My good friend, Aaron Kahlow, posed an interesting question during the Online Marketing Summit yesterday afternoon in Portland, OR. Aaron asked: If a client came to you with $1 million to invest in a single Internet marketing channel, which one would you choose? Obviously, the question is a bit ridiculous (given that there's no additional detail provided), but it's designed to elicit an \"off-the-cuff\" response to a challenging scenario. The answer, of course, is \"it depends\" - and therein lies the rub. On what does it depend? Well... That's what I hope to answer with this blog post. My goal is not to solve the issue for an individual campaign, but from a very strategic level - asking questions like \"where is the company today and where does it want to get to?\" then applying those answers to the selection of marketing opportunities. Let's start by defining the macro-level channels themselves, then examine how we'd reach the right conclusions. Internet/Electronic Marketing Channels Display Advertising The process of placing ads on third-party websites with the goal of creating branding awareness and/or generating traffic Examples: Banner ads, video ads, interactive ads, overlays, interstitials, etc. Email Marketing The process of collecting email addresses from potential leads and marketing to them via email messages Examples: Email newsletters, brand building emails, conversion-focused emails, etc. Pay-Per-Click Advertising (PPC) The process of bidding for placement at search engines (major or niche) to earn visibility and traffic when relevant queries are performed Examples: Google Adwords, Yahoo! Search Marketing, Business.com Advertising, etc. Online Public Relations The process of generating media from primarily online outlets in order to earn branding and traffic Examples: PRNewswire, PRWeb, Internet media focused PR agency work, etc. Search Engine Optimization (SEO) The process of earning rankings in the \"organic\" results of the major search engines (Google, Yahoo!, Bing) Examples: Keyword research, on-page optimization, link building, etc. Affiliate Marketing The process of incentivizing other sites to push your product in exchange for a share of the revenue they drive Examples: Commission Junction, in-house affiliate programs, etc. Social Media Marketing (SMM) The process of leveraging social media platforms (small and large) to earn visibility and traffic Examples: Facebook Group pages, Twitter marketing, pushing content on Digg, etc. Viral Content Campaigns The process of generating creative content that will help spread your branding/marketing message and earn traffic Examples: Linkbait production, viral videos, guerrilla marketing, etc. Conversion Rate Optimization (CRO) The process of improving the path from landing to conversion to get more leads/signups/customers Examples: Split & multivariate testing, click-through-rate improvements, purchase-process simplification, etc. Some of these may overlap - for example, viral content campaigns may simply be a means to an end of better search engine optimization - but as they can all be separate entities, engaged in for their own purposes, I've made them distinct. Primary Variables to Use in the Selection Process Although other factors should certainly play into the decision making, these three elements are excellent for narrowing down the options: Company Goals - What are the top priorities for the business to achieve? Brand Awareness - the current marketplace doesn't have enough familiarity/comfort with your brand to visit, engage or purchase from you. Education - the market for your product/service needs to be created; potential customers don't yet realize the problem they need you to solve. Raw Traffic - your business is monetized with advertising and needs more traffic/page views. Sales - your business has clear market demand on the web that needs to be drawn to your site and converted into leads/sales Budget - How much do you have to spend on your marketing effort(s)? Very High: in excess of $1 million High: $100K - $1 million Moderate: $25K - $100K Low: $5K - $25K Tiny: <$5K Available Talent - What personnel with free bandwidth or trustworthy, outsourced vendors do you have available? Strong Dev Resources - you have technology staff ready and able to make changes to your site to support marketing goals Strong Creative Resources - you have writers/artists/brainstormers poised for action Strong Search Resources - you have search marketing talent prepared for battle in the results Strong Social Resources - you have strong online networkers set to engage the Twit-Face-Digg-o-Sphere General Tiers of ROI, Effort & Cost by Channel These are based on my personal opinions (though, based on conversations, they appear to reflect the experiences of many web marketers and internal marketing departments). I suspect there will be lots of contention about these, particularly from marketers who specialize in non-tier 1 activities. I do think that over time, activities like social media marketing and viral may move to tier 1, but as yet, I believe that companies haven't seen the same consistency or trackability in ROI from these as Tier 1 channels. The eMarketer research I showed this weekend certainly suggests that these newer investments may have a chance to prove themselves fairly quickly. Formulas for Choosing the Right Channel Once again, I'm using my own opinions and experiences, but you can use this same format to help with your own decisions, even if the ordering is somewhat different: And of course, last, but not least, there's the strengths of your organization to consider. If you have amazing talent in these fields, that might sway you to lean more towards particular activities as shown below: Strong Dev Resources - lean towards: CRO SEO Viral Content (particularly dev intensive stuff like tools, widgets, etc.) Strong Creative Resources - lean towards: Viral Content (particularly written/graphic content that can be produced in a standard CMS) Email (great copywriters write great emails) Display (great designers make great ads) Strong Search Marketing Resources - lean towards: SEO PPC Strong Social Resources - lean towards: Social Media Marketing Viral Content Online PR That wraps up my brief, high level summation of this tough question, and hopefully it can help some marketers and marketing departments to find the right paths for their organizations/clients. I'd, of course, love to hear your feedback and ideas as well. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Which Internet Marketing Channel is Right for You?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Which Internet Marketing Channel is Right for You?"
    },
    {
      "level": "H2",
      "text": "Internet/Electronic Marketing Channels"
    },
    {
      "level": "H2",
      "text": "Primary Variables to Use in the Selection Process"
    },
    {
      "level": "H2",
      "text": "General Tiers of ROI, Effort & Cost by Channel"
    },
    {
      "level": "H2",
      "text": "Formulas for Choosing the Right Channel"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}