{
  "url": "https://moz.com/blog/a-comprehensive-intro-to-seo-powerpoint-slide-deck",
  "slug": "a-comprehensive-intro-to-seo-powerpoint-slide-deck",
  "title": "A Comprehensive, Intro to SEO Powerpoint Slide Deck - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the past few years, I've given numerous presentations introducing SEO to new audiences of marketers, engineers and executives. With the end of SEOmoz's consulting business this past January and the completion of our final contract obligations this Spring, I thought it would be wise to share the…",
  "content": "A Comprehensive, Intro to SEO Powerpoint Slide Deck Public Relations By: Rand Fishkin August 18, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 18, 2010 A Comprehensive, Intro to SEO Powerpoint Slide Deck Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the past few years, I've given numerous presentations introducing SEO to new audiences of marketers, engineers and executives. With the end of SEOmoz's consulting business this past January and the completion of our final contract obligations this Spring, I thought it would be wise to share the 190+ page deck to hopefully help those of you who are tasked with introducing SEO to your companies, agencies and colleagues. The deck is updated as of August 2010, but I hope to update it again in the future. Along with the Beginner's Guide to SEO, this resource should help those seeking to learn SEO or catch up on key points from the past few years. Introduction to SEO View more presentations from randfish. You can find the download link via Slidesare here (I normally use Scribd, but couldn't get it to display properly in all browsers, so switched). Feel free to use it or any elements inside. We always appreciate attribution, but even if you can't (which I understand happens), go ahead and make use of it or the images/contents. We love to introduce new people to the magical world of SEO, and if this resource can be of help, it's done its job! p.s. We've been murmuring about a BIG launch for SEOmoz coming up in the next couple weeks. Launch day is still a bit up in the air, but should be nailed down in the next few days, at which point we'll share a bit more. The new web app has proven pretty popular, and folks here are working many, many overtime hours to keep those reports running smoothly and fixing bugs (a big thanks to everyone who's sent us feedback so far!). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Comprehensive, Intro to SEO Powerpoint Slide Deck"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Comprehensive, Intro to SEO Powerpoint Slide Deck"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}