{
  "url": "https://moz.com/blog/a-comprehensive-guide-to-facebook-ads-a-30-minute-crash-course-in-facebook-advertising-17132",
  "slug": "a-comprehensive-guide-to-facebook-ads-a-30-minute-crash-course-in-facebook-advertising-17132",
  "title": "A Comprehensive Guide to Facebook Ads - A 30 minute Crash Course in Facebook Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " \n\n\t\n\n\tFacebook is the largest social network, with over 1 billion monthly active users on desktop and 600 million monthly active users on mobile. If it were a country, Fa...",
  "content": "A Comprehensive Guide to Facebook Ads - A 30 minute Crash Course in Facebook Advertising Social Media By: Pancham Prashar June 21, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pancham Prashar June 21, 2013 A Comprehensive Guide to Facebook Ads - A 30 minute Crash Course in Facebook Advertising Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Facebook is the largest social network, with over 1 billion monthly active users on desktop and 600 million monthly active users on mobile. If it were a country, Facebook would be the 3rd largest country in the world! Almost everyone who has Internet access and knows how to operate a computer has a Facebook account. Which is why you should take a look at Facebook advertising and, potentially, reach out to millions of users in a day. Facebook ads are an innovative and targeted way to reach out to your potential customers and establish a relationship with them. Since Facebook advertising primarily focuses on relationship marketing, you can use Facebook ads to build a better connection with your fans, and possibly engage them to give more leverage & visibility to your brand on Facebook. The social network offers a variety of advertising options that range from advertising your website to your Facebook page, probably any kind of goal can be met with the different options that are offered in Facebook advertising. There are 5 major types of Facebook ads that one can use, and are explained below. Happy reading! Marketplace Ads Page Post Ads Promoted Posts Sponsored Stories Sponsored Results MARKETPLACE ADS: Marketplace Ads look like traditional AdWords Text Ads and comprise of a title, an image (thumbnail) and a body. While mostly used for advertising external links, these ads can also advertise Facebook entities. There can be two types of entities advertised in this ad type. Marketplace Ads for External Websites: This Facebook ad type is best used for offsite marketing via Facebook. Advertisers who want to send relevant and targeted traffic from Facebook to an external URL (their website for example); these ads are the best option available within Facebook advertising. Marketplace Ads for a Facebook Entity (Page/App/Event): While marketplace ads are mostly used to advertise external websites, they can also be used in co-relation with sponsored stories to promote an app, increase page likes or promote an event. When using marketplace ads, an option to like the page, use the app, or attend the event being advertised is there within the ad itself (see below) =\"250\"] <- Marketplace Page Like Ad <- Marketplace Use App Ad Social Component: Marketplace ads sometimes have a social component with them. This shows the number of people that like the page that is being advertised, or the page that is related to the website being advertised. The social component can be added easily. There is a small checkbox underneath where you create the ad, which you can select to display the social component on your ad, as shown below. Examples of Marketplace Ads with Social Component: Placement: In the right hand column of a Facebook user's screen on desktops (only). Creation: Go to www.facebook.com/ads/create. Specify your Destination URL (your website). A preview of your ad will be shown. Here, you will see that the fields of the ad such as the headline, text are pre-filled. Facebook pulls content from your website and creates a rough draft of an ad. Since this would not be an ideal ad, edit the ad copy accordingly. Specify your targeted audience in the \"Choose your audience\" section. Set the bids in the \"Campaign, Pricing and Schedule\" section. Choose between CPC (cost-per-click) and CPM (Cost-per-impressions) depending on your end goal. If you choose CPC, you will be charged anytime someone clicks on your ad, for going to your website, liking your page or using your app. Any action taken on the ad itself is counted as a click. In CPM, you will be charged per 1000 impressions. Click on the review ad button. You will be taken to another page, with details of your ad and bids. Click on Place order and enter your billing details. Once you have entered your billing information, the ad will go under review and will go live after that. Once you have specified all the particulars, Click on the Review Ad button, it will take you to a confirmation page. Click on Place Order and you will be asked for your payment details. Enter your details and your campaign/ads will be ready to go live! Benefits: The foremost benefit of this Facebook ad type is that it lets advertisers take users to their external website from Facebook. Here, you decide where you want to send the user, which could be any webpage. Combined with the social context or social proof, these ads can be very effective in driving relevant and targeted traffic to your website from Facebook. PAGE POST ADS: <- Facebook Page Post Ads A page post ad is a post on a Facebook page that is promoted by an advertiser to gain more visibility. This ad type is more content oriented as they are organic posts that are converted into ads. A major advantage of page post ads is that they are visible in the news feed, which is where most of the attention of a Facebook user is focused. Since these are posts on a Facebook page, one can promote a lot of things such as new arrivals, discounts and in any manner, ranging from status updates, photos, polls, events etc. With such a wide variety of options, you can experiment and find out what will suit your business best. Placement: These ads appear both in the news feed and the right hand column. Creation: 1. Go to the Facebook ads interface (facebook.com/ads/create) 2. Enter your Facebook Page as the destination. 3. Select the \"Promote Page Posts\" from the ads dashboard. 4. A preview of 2 ad types is shown. One a right hand side column ad, and the other a news feed story. For the Right Hand Column: You can select any of your existing page posts from the drop down menu, or create a new one. There is also an option of foregoing the page post altogether and creating a new AdWords like ad. Whatever suits your needs best. For the News Feed: You can choose from 3 types of stories (as shown). They are: People liking your Page post People commenting on your Page post People sharing your Page post 5. In the \"Choose your Audience\" section, select your target audience. Make sure that you see through the \"Advanced targeting options\" as well. 6. In the \"Campaign, Pricing and Schedule\" section, fill in the important details such as Campaign name, etc. also, specify your bids, CPC or CPM. You will be charged per 100 impressions if you select CPM and for any action taken on the post (such as like, share), if you select CPC. In the screenshot below, we have used a CPC bid. 7. Once you have entered all the details, click on \"Review Ad\". Go through the details once on the next page and click on \"Place Order\". 8. Enter your preferred payment method, and your ad is ready. It will go live after review, which usually takes 24 hours. Benefits: Using Page Post Ads, you can give a lot of leverage to the posts on your page. As they are visible almost on all Facebook placements, their outreach can be huge. Since one can target non-fans also, page post ads can hugely increase the visibility of one's brand/page on Facebook. These ads aid greatly in increasing engagement with users and also give a boost to content marketing. Also with the different types of page posts that can be created, you have multiple options and ways of targeting users. Depending on what you want to advertise, you could choose between various kinds of page posts. For example, a clothing store brand could promote photos of new arrivals or collections. PROMOTED POSTS: *Source-Facebook Notice that it looks just like a regular post, with just the word \"Sponsored\" labeling it as sponsored A promoted post is a normal post, on your Facebook page or profile, that you pay for to be visible to a much larger audience. One can promote any kind of post that is created in the sharing tool, such as status updates, offers, videos and photos, as long as they comply with Facebook's advertising guidelines. When you promote a post, the post reaches more people than what a normal (organic) post would do. Due to Facebook's complex Edgerank algorithm, it is estimated that only 16% of your fans get to see a post when you post it. This happens because Facebook determines what stories appear more often in the news feed of a user according to his/her behavior on Facebook. So your post could get lost between a multitude of other posts. A promoted post will ensure that your content is reaching out to a larger number of your fans and stay relatively on top. Do not confuse promoted posts with page post ads though. Both of them have similar goals but they have a few differences. The most noticeable/major difference being their creation. While page post ads are created using the Facebook ads manager or the power editor, and promoted posts are created from the post itself (using the promote button). Promoted Posts are limited to fans and their friends, basically to those who have some connection with your page whereas page post ads can also target those who are not connected to your Facebook page. Placement: In the news feed of Fans and Friends of fans. Creation: 1. Promoted Posts are created using the \"Promote\" button on a post itself. 2. Enter the payment details, and specify the budget, and you're done. The budget is the total amount you are willing to spend and will be divided across the 3 day duration of your post. Since these posts are limited to fans and their friends (or to friends only for a personal profile), there are no targeting options available. The audience is limited to only those people who are connected to your page/profile. With promoted posts, Facebook has a few restrictions for both pages and profiles. For a personal profile: A post that is been shared recently, typically within the last 6 hours. Also, people with friends or subscribers more than 5000 cannot promote a post. Facebook recommends creating a page for reaching an audience greater than 5000. For a Facebook Page: A page needs to have more than 100 likes to be eligible for promoting their posts. Also, only posts made after June 2012 can be promoted. Pricing: These ads are based on a pre-determined price rather than a per click cost, which is a one-time payment. It works according to the number of people you want to reach out to. So you have an estimated budget with an estimated reach. For example, the more people you want to reach, the more you pay. Facebook gives some budget/reach options while promoting that you can choose from, with $x amount corresponding to n number of people. Benefits: With promoted posts, your posts get seen by a lot more people than it would if it weren't promoted. Due to Facebook's Edgerank algorithm, pages could not get their content across to all of their fans. Promoted posts let pages push their content to most of their fans, giving their page more visibility and eventually more engagement. SPONSORED STORIES: Sponsored stories are organic user actions that are paid for by an advertiser so that it appears highlighted in the news feed. A sponsored story can be any type of engagement that a user carries out with your page. It could range from from liking a page to sharing your page posts. You can have the following 6 types of stories: Likes on a Page Engagement on a Page such as likes, shares, or comments on a Page's post, votes on a question, and check-ins. Joins of an event Installs of an application Uses or plays of an application Likes or shares of a website Since sponsored stories appear in the news feed, users are more likely to see them, and eventually interact with them in some way. These stories carry a personal feel to them (or what we call a social proof) as you can see who among your friends has interacted with the page, and in what manner. <- Sponsored App ad on the right hand side Placement: In the news feed, and the right hand column. Creation: For creating a sponsored story, you go to the ad create flow (Facebook.com/ads/create). In the destination URL tab, you enter your Facebook page, app or event. (shown below). You will be shown a preview of the sponsored stories that will be created according to what you choose to advertise. For example, the stories are different when you are promoting an app, and different when you are promoting a page. You can select what kind of stories you would want to show. You can't however, control the content of the story. Specify your targeting criteria. With sponsored stories, only those who are eligible to see the non-promoted story will be able to see the sponsored stories. So one has to be careful with the targeting, so as to not reduce the reach with too much targeting. Set the bidding method (CPC/CPM) & bids (as is with every other ad type) and you are good to go. With CPC, you will be charged for any action taken on your sponsored story, For example, if you are promoting your app, you will be charged each time someone uses that app. Basically, any activity or action take on the sponsored story will be counted as a click and will be charged. With CPM it remains the same; you will be charged per 1000 impressions. Benefits: Due to Facebook's EdgeRank algorithm, a lot of your content gets lost in the news feed of your fans. Or, it does not appear at all. This depends on the kind of engagement each user has with your page. For example, someone who has had no engagement with your page for a long time won't see your posts/updates. By using Sponsored stories you propel your content to the top of the news feed of your fans, and their friends. SPONSORED RESULTS: Above are Facebook Sponsored Search Results These ads appear in the search results on Facebook. With sponsored results, advertisers have the option of targeting users when they are looking for something, using Facebook's search feature. Sponsored results appear above the organic term results that the user is searching for, giving them more prominence over the rest of the results. Placement: In the search results bar on Facebook. Creation: These ads are created in the Power Editor only. 1. Create a Campaign, if you haven't created one already. 2. Click on Create Ad. Select Sponsored Search Results as the ad type. 3. Enter your destination, for example your Facebook page. It has to be a Facebook entity only. It could be a Facebook page, app or event. 4. Specify your landing view. You can direct users to a specific view of your page, such as the photos tab, events tab etc. 5. Enter the body of the ad. You have 70 characters of space to entice the users to click on your ad. 6. In the \"Target Specific Searches\" column, you can enter names of entities that you would want to bid on and make your ad appear. 7. On the left, click on the \"Audience\" tab to filter out your audience. Here you can enter various targeting demographics such as age, interests, etc. Targeted Entities could be Places, Pages or Applications that a user could search for. Your ad would appear when a user would search for the entity that you bid on, also depending upon your bid. 8. You can also target competitor's brand names (search terms). For example, Coca-Cola could bid on Pepsi, with a small message, that should be compelling enough that the user would click on your ad and go to your brand page. 9. Under Pricing & Status, select between CPC or CPM. In CPC, you will be charged when someone clicks on your ad. CPM remains the same; you will be charged per 1000 impressions. 10. Enter your bidding amount, and you are all sorted! Benefits: Sponsored results can be both very effective in getting users to your brand's page, right when they have a searching intent. They are also best used to target searchers with specific intent on Facebook. For example, you have an app that you want to promote, you could target entities similar to your app and your ad will show up when users search for that particular entity that you have bid on. With the ability to also bid on rival entities, the potential that this Facebook ad type has is huge. Apart from these ad types, you might have seen various other ad types while browsing about on Facebook. For example, when you logout from Facebook on your desktop, you might see a huge banner ad on that page (Facebook Logout Ads). These types of Facebook ads are available only to major partners of Facebook, and have not been rolled out globally as yet. We would love to know your thoughts about Facebook Advertising. Would you try Facebook ads? Share your thoughts with us on Twitter with the hashtag #CueBlocksGuide. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Comprehensive Guide to Facebook Ads - A 30 minute Crash Course in Facebook Advertising"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Comprehensive Guide to Facebook Ads - A 30 minute Crash Course in Facebook Advertising"
    },
    {
      "level": "H3",
      "text": "MARKETPLACE ADS:"
    },
    {
      "level": "H3",
      "text": "PAGE POST ADS:"
    },
    {
      "level": "H3",
      "text": "PROMOTED POSTS:"
    },
    {
      "level": "H3",
      "text": "SPONSORED STORIES:"
    },
    {
      "level": "H3",
      "text": "SPONSORED RESULTS:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pancham Prashar\n          \n            Pancham Prashar\n          \n            Pancham Prashar"
}