{
  "url": "https://moz.com/blog/a-collection-of-rands-searchrelated-comics",
  "slug": "a-collection-of-rands-searchrelated-comics",
  "title": "A Collection of Rand's Search-Related Comics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the last 3 years, I've made more than 2 dozen unique presentations. Anyone who's seen these knows that one of my signatures is an attempt at humor. Occassionally successful, often dismally sad (particularly with British audiences) and universally tacky, embedded comics have been a mainstay of…",
  "content": "A Collection of Rand's Search-Related Comics SEO Events By: Rand Fishkin October 25, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 25, 2006 A Collection of Rand's Search-Related Comics SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the last 3 years, I've made more than 2 dozen unique presentations. Anyone who's seen these knows that one of my signatures is an attempt at humor. Occassionally successful, often dismally sad (particularly with British audiences) and universally tacky, embedded comics have been a mainstay of almost every Powerpoint I've authored. For no other reason than to share, I've collected some of these below as part of tonight's late-night blogging series (you can always tell when I'm busy at work because all the posts show up between 11:00pm and 2:00am): When Rebecca returns from London, I might ask her to start playing around with our collection of vector comics (originally created by Mystery Guest) and see if she can't bring the humor up a notch. In the meantime - if you've found humorous content related to the world of search, please do share in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Collection of Rand's Search-Related Comics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Collection of Rand's Search-Related Comics"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}