{
  "url": "https://moz.com/blog/a-fascinating-use-for-seo-shawn-of-digitalpoint-fights-winn-sims",
  "slug": "a-fascinating-use-for-seo-shawn-of-digitalpoint-fights-winn-sims",
  "title": "A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Shawn Hogan, the operator of the DigitalPoint forums, tools & ...",
  "content": "A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims Moz News By: Rand Fishkin April 21, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 21, 2005 A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Shawn Hogan, the operator of the DigitalPoint forums, tools & services has used his SEO knowledge and tactics to construct a site that operates solely as a reflexive act of antagonism against a law firm that unlawfully sued him (without his knowledge) and took $7,000 from a bank account of his.The law firm, Winn & Sims, appears to be the worst kind of legal institution - one whose corruption extends far into the reaches of bad business & financial ethics. I wish Shawn well on his endeavor, he has certainly contributed a great amount to the community - but, nothing, perhaps, is more interesting than his initiation of this virtual guerilla warfare tactic against a company by way of the Internet. The web has truly taken away the consolidation of power that was once held by firms like Winn & Sims and placed it into the hands of the people they influence.I have heard of other cases similiar to this... For example, a search for Lincoln Towing of Seattle reveals a very unhappy client who is airing her dirty laundry publicly. Lincoln Towing can't be happy about their rankings either, which as of the current time are squarely ahead of any of the company's own sites. I'm not even sure she was attempting to out-rank them, but on the web... these things can happen. The rule here is, don't upset the bloggers, they have \"eery powers\". Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Fascinating Use for SEO - Shawn of DigitalPoint fights Winn & Sims"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}