{
  "url": "https://moz.com/blog/a-few-thoughts-on-edu-links",
  "slug": "a-few-thoughts-on-edu-links",
  "title": "A Few Thoughts on .edu Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Once again, EGOL from SEOChat has sent in a contribution for SEOmoz.Good .edu links are getting harder to get thse days. Most professors are moving away from .html webpages and into cou...",
  "content": "A Few Thoughts on .edu Links Link Building By: Rand Fishkin July 25, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 25, 2005 A Few Thoughts on .edu Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Once again, EGOL from SEOChat has sent in a contribution for SEOmoz.Good .edu links are getting harder to get thse days. Most professors are moving away from .html webpages and into course management systems such as Blackboard, eCollege or WebCT, thus they are behind passwords and not spidered. They can bring you enormous traffic over a three day burst but they have zero value for your linkpopularity. You will see them in your referral logs but not in your backlinks. So, I hope that the SEs realize this and add some extra swack to the .edu links that are still out there. They are a dwindling species.If you are getting traffic from these teaching system websites you need to fix your adsense code. Since these links are normally displayed in framed pages you will likely get pub service ads or ads for teaching system software. You can fix this problem by using the \"framed page\" option when setting up your adsense.If you are trying to bag a few .edu links IMO the best way to evaluate them is on the basis of traffic delivery possibilities rather than ranking possibilities. Although I believe that .edu links are more valuable when compared to .com links of equal theme and connectivity just one is not going to be a silver bullet that will shoot you up the SERPs. It still takes a lot of them to boost you up on a competetive term. Evaluating traffic possiblities - an .edu link on a \"Chapter\" or \"Topic\" page of a professors website you will get a short burst of traffic each semester that the course is taught - normally less than one visit for each student enrolled in the course - unless that profs page is ranking in the SERPs and getting SE traffic. Edu links on the admissions page of the school site - such as \"local lodging\" or \"local restaurants\" can be golden. They can deliver a nice amount of traffic if they are optimized as they will frequently get top SERPs in local markets. These are very worth playing for if you have a site related to local lodging or restaurant themes.If the page is not well optimized, chat it up a bit with the prof or webmaster because a few friendly pointers might bump that page up the SERPs and triple your traffic and they might enjoy seeing their page in a more promient position. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Few Thoughts on .edu Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Few Thoughts on .edu Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}