{
  "url": "https://moz.com/blog/a-field-guide-to-moz-analytics",
  "slug": "a-field-guide-to-moz-analytics",
  "title": "A Field Guide to Moz Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Announcing Moz Analytics, the platform that enables marketers to track all their marketing data in one place.",
  "content": "A Field Guide to Moz Analytics Moz News By: Matthew Brown October 15, 2013 Table of Contents Copied! By: Matthew Brown October 15, 2013 A Field Guide to Moz Analytics Moz News In the late spring, we expanded our mission and made the switch to Moz to provide marketers with competitive analytics and resources to measure and improve their efforts. In addition to our name change and shiny new website, we started a private beta of Moz Analytics, our new platform to provide online marketers with all their inbound marketing data in one place: Moz Analytics gives you a deeper look at keyword rankings and more competitive tracking features In a hurry? Check out the tl;dr at the end of the post. Moz Analytics is now live! We were taken a bit by surprise when we received over 80,000 signups for the invite list over the summer. Today, we are pleased to announce we've sent out all those invites, given access to all our PRO customers, and have now released Moz Analytics to the public. If you haven't already tried it out, you can take a 30-day free trial right here. Our engineering team spent long hours this summer making sure our PRO users' data was transitioned as smoothly as possible and that new users would have a great experience with their workflow when they signed up. They also made a great deal of changes based on beta tester feedback, as well as added many new upcoming features to our roadmap. Rand laid out the vision of Moz Analytics in his post about our switch to Moz: Our goal is to give every marketer affordable software to measure and improve their efforts. Of course, there are numerous other ways to communicate with us about Moz Analytics. Our Help Team is working with our engineers to address issues and answer your initial questions, so please don't hesitate to reach out to them. And our Community folks are available on Twitter @Moz if you'd like to give us a quick shout. Before I dive in, I need to stop and give a shout out to the amazing work performed by the engineers, designers, data scientists, testers, product and project managers, marketers, and Help Team folks that made Moz Analytics possible. Today's launch is the result of over two years of massive effort from these Mozzers, and it's an honor for me to write this post introducing what they've built. Visitor metrics: powered by Google Analytics Moz Analytics makes use of Google Analytics as the backbone of our visitor analytics and search data, which we combine with our competitive link data, brand and mentions data, and social metrics to offer you useful data points like branded search vs. non-branded, the ability to track keywords over time, and the ability to assess your competitors' progress. Connecting your Moz Analytics account to Google Analytics isn't a requirement. You can still use all the functionality in our competitive research tools like Open Site Explorer, Followerwonk, Rank Tracker and Keyword Difficulty, as well as access to our Community Q&A and Moz Academy. However, connecting Google Analytics will provide you with the best Moz Analytics experience, which is key to identifying opportunities to drive visibility and find new audiences. All your marketing analytics in one place We've taken the core PRO functionality, added new brand and mentions tracking, enhanced data visualizations, and upgraded social analytics and competitor tracking. When we launched SEOmoz PRO in 2010, our goal was to consolidate our tools into a platform to enable marketers to simplify their workflow. With Moz Analytics, we're taking that one big step further and creating a platform that can be used to efficiently track all of your key marketing metrics and identify which channels have new opportunities for your site or company. Getting started: the campaign dashboard One of our main goals was creating better dashboards across the entire product. PRO users have given us lots of feedback about being able to quickly identify successes as well as potential problem areas. Our main campaign dashboard was the result of this feedback: The Moz Analytics campaign dashboard aggregates metrics from all your channels Our Help Team has made a fantastic walkthrough video of what you'll see on your campaign dashboard. Once you've got a feel for your data in the dashboard, you can start exploring the different channels measured by Moz Analytics. We built upon the four main elements of the SEOmoz PRO search features: traffic from search, keyword rankings, on-page performance, and crawl diagnostics. Start by checking to see how much traffic your site is receiving, in both branded and non-branded search traffic. As we move toward a world of (not provided), this will be a key metric to track in order to assess search performance. In the near future, we'll be releasing features that give you the ability to estimate keyword traffic based on page-level performance in order to replace some of the data that Google has removed. Moz Analytics tracks four major categories of marketing channels: Search: enhanced SEO performance tracking Search traffic data powered by Google Analytics combined with Moz Analytics brand tracking We kept almost all of the functionality of SEOmoz PRO, but increased granularity in the metrics. We've made the workflow easier to manage within the search channel, added a deeper view of the performance of visits that arrive from tracked keywords, provided a data view to identify and quickly add keywords to your campaign tracking, and recreated the search dashboard to provide an easy overview of your SEO performance. Coming soon: A brand new redesign of custom reports, and redesigned PDF exports. Our users have let us know that custom reports and exports are key to their PRO workflow, so they're getting a ground-up redesign and will be deployed in the next release (slated for mid-November). Social: new data and better reporting We've added Google+ fans and interaction tracking, an enhanced dashboard, an enhanced filtered view of your most engaging posts, more data from Facebook and Twitter, and an increased ability to track social behavior by source. You can also sort social performance by daily and weekly time frames. Aggregated metrics for Facebook, Twitter, and Google+, as well as analysis of your interactions Links: new features for competitor tracking There's now a new high-level view of link changes that ties to the traffic you're receiving from each link, as well as enhanced views that let you spot mentions that aren't yet linking to you. We've also included domain authority metrics from Mozscape, which will allow to track your progress against your competitors. Link tracking now lets you measure over time and drill down into your link profiles Brand and Mentions: quickly spot your opportunities Editor's note: In August 2015, we retired the Brand and Mentions section in order to streamline Moz Analytics and focus our efforts on features that are core to search marketing. Learn more about the change. Keep tabs on your brand mentions and branded links, and track against your competitors. Find mentions that are specific to your industry. This new section of Moz Analytics lets you easily spot which pages are receiving branded traffic and what percentage of your traffic is driven by brand strength across your channels. Brand and mentions tracking are key to finding competitive opportunities across your channels Setting up brand tracking One of the big feature additions to the new software is the ability to track brand and mentions data within the application (our standalone research tool to do this is Fresh Web Explorer). To measure branded traffic, you need to set up queries in the application. We recommend doing this as soon as you get started with Moz Analytics, so that the software can begin capturing this data. We put together a video that walks through this setup, and also shows examples of both basic and advanced queries that are available within Brand and Mentions. What if I want to switch back to PRO? Nothing is more important than the integrity of our users' workflow. It doesn't matter how nifty we think Moz Analytics is; if your time is negatively affected by the new platform, we're not happy. To that end, we made sure that users continue to have access to PRO while we transition to Moz Analytics. It's easy to make the switch back to PRO. There's a link right next to the Campaign drop-down at the top left: PRO users may sometimes wish to switch back to the new version of their campaigns to access custom reports and PDF exports. We anticipate having brand new versions of this reporting in November. We'll be sunsetting the PRO platform in the future, but users will receive plenty of heads-up before that happens. What's next? First up? Making sure Moz Analytics contains all the features and functionality that has made our PRO software useful to online marketers. We'll be making many feature additions and revisions throughout the rest of the year. This post was designed to give you an outline of the features and functionality of Moz Analytics, and what we're planning in the near future. From here, we'll regularly post feature breakdowns that go into more detail on each section of the software, and how we're using it across each of these marketing channels. Going forward, we also plan on cutting down the wait time significantly between releases. Our last major release was 2010, and we want to add value to our platform quite a bit more frequently than that. We'll be launching custom reports and PDF exports, content analytics, more Fresh Web Explorer integration, additional social media tracking data, enhancements to rank tracking, more comprehensive Freshscape indexes, and a few other surprises before the end of this year. Our goal is to continue to release new things that make being a Moz Analytics subscriber a great return on your marketing spend. We hope you enjoy your first experience with Moz Analytics, and please let us know what you think. Ready to get started? Our Help Hub has got you covered. Is there a tl;dr? Sure! The 'just the facts' version of this post goes something like this: Moz Analytics is now available to the public. Not signed up yet? Take a free 30-day trial. Moz Analytics provides vastly improved data visualization and enhanced competitive metrics vs. our PRO software We've designed Moz Analytics to allow our users to manage their competitive analytics in one place, and to highlight opportunities across a wide array of online marketing channels. Our visits and search traffic data is powered by Google Analytics. Connecting your Moz Analytics account to GA will provide the most robust data we have to offer. All current PRO campaigns will still be accessible for at least the next few weeks. All new campaigns will be created in Moz Analytics. Not ready to make the switch yet? You can continue to use PRO with the click of a link. Our Communications Team has created a plethora of great documentation to introduce new features and get you started. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Field Guide to Moz Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Field Guide to Moz Analytics"
    },
    {
      "level": "H2",
      "text": "Moz Analytics is now live!"
    },
    {
      "level": "H2",
      "text": "Visitor metrics: powered by Google Analytics"
    },
    {
      "level": "H2",
      "text": "All your marketing analytics in one place"
    },
    {
      "level": "H2",
      "text": "Getting started: the campaign dashboard"
    },
    {
      "level": "H2",
      "text": "Search: enhanced SEO performance tracking"
    },
    {
      "level": "H2",
      "text": "Social: new data and better reporting"
    },
    {
      "level": "H2",
      "text": "Links: new features for competitor tracking"
    },
    {
      "level": "H2",
      "text": "Brand and Mentions: quickly spot your opportunities"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Setting up brand tracking"
    },
    {
      "level": "H2",
      "text": "What if I want to switch back to PRO?"
    },
    {
      "level": "H2",
      "text": "What's next?"
    },
    {
      "level": "H2",
      "text": "Is there a tl;dr?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Brown\n          \n            Matthew Brown"
}