{
  "url": "https://moz.com/blog/a-funny-thing-happened-on-my-way-to-the-store-blog",
  "slug": "a-funny-thing-happened-on-my-way-to-the-store-blog",
  "title": "A Funny Thing Happened On My Way to the Store Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I did a search for \"plumbersurplus blog\" today because I couldn't remember the URL of it off by heart. Of course, the link I wanted was right at the top of the Google results, but when I clicked through, I saw this: You searched for '...",
  "content": "A Funny Thing Happened On My Way to the Store Blog Content Marketing L By: LindaBustos March 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: LindaBustos March 18, 2008 A Funny Thing Happened On My Way to the Store Blog Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I did a search for \"plumbersurplus blog\" today because I couldn't remember the URL of it off the top of my head. Of course, the link I wanted was right at the top of the Google results, but when I clicked through, I saw this: \"That's odd,\" I thought. The URL in my address bar reads: http://www.plumbersurplus.com/blog/. I click on the blog home page link (logo) and I get the same address bar URL, but the search suggestions disappear. My theory is that PlumberSurplus is using a personalization tool that delivers content based on referring keywords, because Google can't control how a page is displayed post-click, can it? Can it??? This is what happens with the same search through MSN: Cache date in MSN - March 4 Date of post displayed - January 31 Silly Yahoo! and Ask didn't show the correct link in the top 50 results, so I just gave up on them. I don't think this is Google's doing, or MSN's. Do you think this is a good idea? Are any of you using this on your website or blog? If so, what are your reasons? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Funny Thing Happened On My Way to the Store Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Funny Thing Happened On My Way to the Store Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LindaBustos\n          \n            LindaBustos"
}