{
  "url": "https://moz.com/blog/a-google-link-command-that-returns-perfect-data",
  "slug": "a-google-link-command-that-returns-perfect-data",
  "title": "A Google Link Search that Returns Perfect Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For several years now, Google has disabled its link command via web search. Actually, what it's done is worse, providing mis and dis-information, causing thousands of search marketing professionals to receive questions every day on why \"Google only knows about 10 of my links.\" However, I was…",
  "content": "A Google Link Search that Returns Perfect Data Search Engines By: Rand Fishkin January 4, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 4, 2007 A Google Link Search that Returns Perfect Data Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For several years now, Google has disabled its link search. Actually, what it's done is worse, providing mis and dis-information, causing thousands of search marketing professionals to receive questions every day on why \"Google only knows about 10 of my links.\" However, I was thrilled today to find that their link search works flawlessly in their blog search engine. For example: SEOmoz - 4,443 links Joe Morin - 49 links Boing Boing - 84,914 links Kineda - 51 links SFGate - 186,846 links ESPN - 3,669 links When I compare it Technorati, it's obvious that Google still has a long way to go in terms of growing their blog index: SEOmoz - 18,378 links Joe Morin - 765 links Boing Boing - 135,730 links Kineda - 2,098 links SFGate - 224,025 links ESPN - 5,900 links I'm not sure why Google is offering solid link data here and spoofing it in the normal search, but I'll take it! One more metric to add to the toolbox. p.s. For an update, see this post on the Google Link Command. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Google Link Search that Returns Perfect Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Google Link Search that Returns Perfect Data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}