{
  "url": "https://moz.com/blog/a-guide-for-non-ppc-folks-how-to-make-paid-search-decisions-that-won-t-sabotage-your-success",
  "slug": "a-guide-for-non-ppc-folks-how-to-make-paid-search-decisions-that-won-t-sabotage-your-success",
  "title": "How to Make Paid Search Decisions that Won’t Sabotage Your Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether your a PPC expert or a novice attempting to learn the nuances of the area, taking a smart-from-the-start approach is the best path to success.",
  "content": "How to Make Paid Search Decisions that Won’t Sabotage Your Success Paid Search Marketing (PPC) | Marketing Industry | Online Advertising By: Amy Hebdon August 6, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Amy Hebdon August 6, 2015 How to Make Paid Search Decisions that Won’t Sabotage Your Success Paid Search Marketing (PPC) | Marketing Industry | Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I once had a client who demanded we book him a banner takeover of Google.com. Another time a client (intentionally) commented out the tracking pixel from his e-commerce site, then was infuriated that recorded revenue was down. One client—and I’m not making this up—was so worried the Russian mafia was competing with her for top position on Google that she created three other \"sister sites,\" each with its own domain and a substantial ad budget to block out the Russians. Don't be like those bad decision makersEvery day folks with a limited understanding of PPC are tasked with making high-level decisions about how it should be run. I've been managing PPC campaigns on AdWords since 2004, working on nearly 100 accounts across a dozen different agencies, and I've seen a lot of innocent yet common mistakes made by people who lack a solid understanding of PPC: They undervalue key elements and overvalue less important factors. These errors sabotage their chance for success. Fortunately, you don't need much PPC expertise to course-correct. Whether you're an in-house digital director or you weigh in on paid search decisions for your clients, this guide can help you avoid rookie mistakes while leveraging the unique opportunities PPC offers. Top three overvalued PPC practicesInexperienced (or very vulnerable) marketers tend to share the same bad habits. Here are the three most common practices I see that are given too much weight, along with advice for how you can overcome each mistake, even if you’re new to PPC. 1. Finding the perfect keyword listPlease don't misunderstand this point: keywords matter.A lot. But keywords are often treated as the magic bullet that can fix an account, and, sadly, they are not magic. If your landing pages serve 404 errors, or your daily budget is $0.95, or you have a terrible product (or no product at all), a keyword expansion will solve exactly nothing. This may sound intuitive or obvious, but you'd be surprised how often everything but the keyword list goes completely overlooked. Understandably, marketers who don't control their landing pages or who can't ensure consistent tracking don't want to hear about their on-site problems. But if you’re expecting shiny keywords to rescue you from a bad user experience, you’re in for a difficult life lesson. (Image source)How to be smart about keywords: Once you've identified the problem areas, look at what most directly influences those numbers. Most likely it’s not a keyword issue, but if you actually can track it down to gaps in keyword lists, be sure you have ad copy and landing pages that directly support your missing keywords (see landing page section below).2. Spying on the competitionKeeping an eye on your competitors can be valuable. You can borrow some great ideas to test, and you can better understand the marketplace (if everyone else offers free shipping, that might explain why your $15 shipping offer isn't meeting your expectations). But I see a lot of marketers trying to mimic what their competitors are doing without understanding why or how (or whether) it's working. Being a copycat rarely improves ad performance, and if you choose keywords or change budgets for no reason other than you saw your competitor doing it, you aren't positioning yourself for success. How to be smart about competition: Focus on your company's unique benefits. “How can we provide the most value to our customers?” is a much more productive question than “How many variations of ad copy did our competitor run last month?”3. Winning more share of voiceImpression share can be a useful benchmark, but it's a horrible KPI. Average ad position is a useful metric, but an ad’s location on the SERP is only meaningful in the context of how it converts there. If the top position results in more sales, bid up all day long (assuming it’s efficient for you). But if your goal is the No. 1 position because being \"No. 1 on Google\" has a nice ring to it, it’s time to rethink your strategy. Driving brand awareness and increasing exposure are goals worthy of a portion of your budget, but in 2015 there are much better ways to achieve those goals than text ads on Google (which generate very little demand), and there are much better ways to measure impact than ad position. One final point: If you want to be No. 1 because it pushes your competitors further down but it doesn’t produce a good return for you, you’re likely doing your competition a favor. (Image source)How to be smart about impression share: Success comes back to knowing your KPIs. If your volume is too low, fix your budgets or your bids, play with your match types and think outside the search query to generate awareness.Keep in mind that impression share is calculated based on the number of impressions you were eligible to receive, not the total number of queries conducted. The score is relevant only as a benchmark. It doesn’t tell you anything about your competitors or the search universe outside your campaign's eligibility. Top three undervalued PPC practicesThe problem with managing channels outside your wheelhouse is you don’t know what you don’t know. These three practices will help you get the most out of your paid search efforts without having to certify in AdWords. 1. Documenting your PPC strategyA strategy, simply put, is your plan of action to accomplish your goals. Defining KPIs is an important first step, but you need a consistent, documented process to identify areas of opportunity and to understand how your campaigns are truly performing. If your boss were to ask you questions such as the following about your account, would you be able to answer them? Would your PPC team? Do you bid on brand terms? Why or why not? How are you optimizing for mobile devices? Do shopping campaigns have different ROAS goals than Gmail Sponsored Promotions? Are call extensions showing outside of call center hours? A strategy document will help you easily locate answers so you aren’t left guessing what is informing current account settings. It will also ensure that your PPC team is using consistent guidelines in creating new campaigns, adding negative keywords or adjusting bids. (Image source)How to be smart about strategy: PPC thrives on being agile, responsive, fluid and flexible. A strategy document need not contain every keyword, bid or variation of copy; that level of granularity is not needed, and a separate document would quickly fall out of date with regular account changes.A documented strategy can help you best decide how to respond to new opportunities or search behavior. If you have a strategy, refer to it as you build out new initiatives. If you don’t, work with your PPC team to create one. It protects your account both from inconsistent settings and from overspending on poorly performing initiatives. 2. Knowing what you're trackingProper tracking gives you answers to those vital post-click questions: How many people are converting into prospects or customers? What’s the conversion rate? How much revenue is your campaign driving? Given the importance of conversion metrics, it shocks me how often marketers try to launch campaigns that lack correct tracking. Here are a few scenarios where I’ve seen this happen: The CTA button links to a third-party site that does not contain the tracking pixel An analytics goal completion is configured as an “event click,” and not all CTA buttons on the page are properly tagged An analytics goal completion relies on URL naming conventions that are not followed GTM is not being used consistently, and the pixel gets removed from the page The campaign is time-sensitive and no one wants to wait for the developer to implement tracking Most of these problems could be avoided if marketers understood how their tracking worked and QA'd their pages before sending them to the PPC department. At best, schedules are delayed if errors aren’t caught earlier. At worst, campaigns run with tracking errors, which skews data and leads to historical inaccuracies that persist long after issues have been corrected. How to be smart about tracking: Be sure you know the conversion goals your sites use (for standard AdWords campaigns, you can find this in the interface under Tools or the Dimensions tab). Also make sure that you understand how conversions are tracked.For a conversion tracking introduction (or refresher course), see the AdWords guide: https://support.google.com/adwords/answer/1722054?hl=en. If your eyes glaze over when people talk about code, tags, and pixels, you're in good company. But you can't be great at your job until you are willing to learn what goes on beneath the hood. 3. Demanding better landing pagesI don't know why, but marketers seem to love to furtively create new landing pages with designers, only showing them to the PPC department when they're ready to launch. Often this leads to a few rounds of unsolicited, ignored feedback and a “we’ll let the data decide.” Then a month later, the data does decide, and we’re back to square one. Not everyone who does paid search is a conversion rate expert, but your PPC team can usually be quite helpful in identifying areas that need optimizing. I’ve never worked with a designer who knew better than a PPC manager what should go on a landing page. Don’t make your PPC team beg to help you with page improvements, or eventually they won’t. How to be smart about landing pagesUnderstand what makes a good PPC landing page. You can argue button colors or length of form fields all you want, but at the end of the day, every PPC landing page should do the following:Directly relate to the keyword, by ideally...using the keyword in the headline positioning itself as the solution to the problem entered into the search box matching the ad Orient the visitor: Quickly communicate where she is, what she can do, and why she should do it (See MECLABS' primer: http://www.marketingexperiments.com/improving-website-conversion/claritytrumpspersuasion.html) Focus on the visitor with “What’s in it for me?” benefits Offer the visitor an action she can take that is measurable and valuable to your company. If you influence or oversee the creation of landing pages, ensure that they're the best they possibly can be (you can work with your PPC team to test different treatments and assumptions). If you don't weigh in on landing pages, you can at least advocate for better pages and push for more education to avoid getting stuck chasing keywords to fix conversion rates. Next stepsTo quote Tolstoy, \"Happy families are all alike; every unhappy family is unhappy in its own way.\" There are plenty of ways to sabotage your success—with AdWords or with anything else—but this guide should at least put you on a smart track in managing PPC. If you have any tips I missed, please leave them in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Make Paid Search Decisions that Won’t Sabotage Your Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Make Paid Search Decisions that Won’t Sabotage Your Success"
    },
    {
      "level": "H2",
      "text": "Don't be like those bad decision makers"
    },
    {
      "level": "H2",
      "text": "Top three overvalued PPC practices"
    },
    {
      "level": "H3",
      "text": "1. Finding the perfect keyword list"
    },
    {
      "level": "H3",
      "text": "2. Spying on the competition"
    },
    {
      "level": "H3",
      "text": "3. Winning more share of voice"
    },
    {
      "level": "H2",
      "text": "Top three undervalued PPC practices"
    },
    {
      "level": "H3",
      "text": "1. Documenting your PPC strategy"
    },
    {
      "level": "H3",
      "text": "2. Knowing what you're tracking"
    },
    {
      "level": "H3",
      "text": "3. Demanding better landing pages"
    },
    {
      "level": "H2",
      "text": "Next steps"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Amy Hebdon\n          \n            Amy Hebdon"
}