{
  "url": "https://moz.com/blog/a-legal-guide-for-bloggers",
  "slug": "a-legal-guide-for-bloggers",
  "title": "A Legal Guide for Bloggers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Electronic Frontier Foundation (EFF) has created a Legal Guide for Bloggers that walks us through the important issues of having a online journal of events. It notes what opinions are legal to publish, what can get you sued an...",
  "content": "A Legal Guide for Bloggers Public Relations By: Rand Fishkin June 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 15, 2005 A Legal Guide for Bloggers Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Electronic Frontier Foundation (EFF) has created a Legal Guide for Bloggers that walks us through the important issues of having a online journal of events. It notes what opinions are legal to publish, what can get you sued and how far libel and copyright infringement laws extend. This work was first pointed out to me by Bill over at Cre8asite - thanks Bill. Notably, several of the most troubling legal problems affecting the SEO world are absent, but this guide is intended for bloggers of all types and focuses more on the creation, publication and dissemination of content over the Internet than anything else. Now, it's your responsibility to make sure your content is up to standards, so you don't have to endure pesky, expensive lawsuits. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Legal Guide for Bloggers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Legal Guide for Bloggers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}