{
  "url": "https://moz.com/blog/a-list-of-every-website-statistic-publicly-available",
  "slug": "a-list-of-every-website-statistic-publicly-available",
  "title": "A List of Every Website Statistic Publicly Available - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Admitedly, this is an ambitious list, but it's also a worthwhile one. Below, I've attempted to lay the foundation for every piece of website data available to marketers, researchers and the curious. Competitive analysis experts, welcome to data paradise:\nTechnical Data\n\n    IP Address - via…",
  "content": "A List of Every Website Statistic Publicly Available SEO Tools By: Rand Fishkin October 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 11, 2006 A List of Every Website Statistic Publicly Available SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Admitedly, this is an ambitious list, but it's also a worthwhile one. Below, I've attempted to lay the foundation for every piece of website data available to marketers, researchers and the curious. Competitive analysis experts, welcome to data paradise: Technical Data IP Address - via DomainTools Search(e.g. SEOmoz - 204.15.225.178) Other Sites on an IP Address - via IP Query at Live.com(e.g. SEOmoz's - 204.15.225.178) Server Type - via DomainTools Search(e.g. SEOmoz - Apache) Response Time - via DomainTools Search(e.g. SEOmoz - 5.78ms) Name Server - via DomainTools Search(e.g. SEOmoz - dns1.dedicatedns.com) W3C Validation - via W3C Markup Validator(e.g. SEOmoz - we passed!) CSS Validation - via W3C CSS Validator(e.g. SEOmoz - validates) Speed Report - via WebsiteOptimization.com(e.g. SEOmoz, 23.44 seconds @ 56K - sadly, you can't link directly to these) Use of Text - via Ranks.nl KW Density Checker (e.g. SEOmoz's homepage has 662 total words, 336 uniques and \"seo\" is the most common, again you can't link directly to these pages; note - I'm not endorsing KW Density; I just appreciate their tool) HTTP Headers Response - via Web Sniffer(e.g. SEOmoz - 200 OK) Ownership/Hosting Data Whois Data (registrant, registration date, contacts, etc.) - via DomainTools Search(e.g. SEOmoz) Additional Sites Owned/Registered - via DomainTools Search and Alexa(e.g. SEOmoz @ DomainTools & SEOmoz @ Alexa) SSL Certificates Issued - via DomainTools Search IP History - via DomainTools Search Hosting History - via Netcraft Whois History - via DomainTools Search(e.g. SEOmoz) Statistics/Popularity Data Alexa Rank - via Alexa(e.g. SEOmoz @ Alexa - 864th most popular site) Alexa Reach - via Alexa(e.g. SEOmoz @ Alexa - 1395 per million users) Alexa Page Views Estimate - via Alexa(e.g. SEOmoz @ Alexa - 2.7 per user) Google Trends Data - via Google Trends(e.g. SEOmoz - no data; only available for highly searched-for domains) Compete Snapshot - via Compete.com(e.g. SEOmoz - 5854 visitors in August, ranked #204,215th most popular site; no direct linking in) Ranking.com Rank - via Ranking.com(e.g. SEOmoz - 26,741st most popular site) Netcraft Ranking - via Netcraft(e.g. SEOmoz - 20,319th most popular site) Bloglines Subscribers - via Bloglines Feed Search(e.g. SEOmoz - 448 subscribers) Search Engine Indexing Data Google's Indexed Pages - via Google site: command(e.g. SEOmoz - 18,400 pages) Yahoo! Pages Indexed - via Yahoo! Site Explorer(e.g. SEOmoz - 5,432 pages) MSN Pages Indexed - via Live.com site: command(e.g. SEOmoz - 11,416 pages) Ask.com Pages Indexed - via Ask(e.g. SEOmoz - 362; note that this requires an additional term in the query to return results) Gigablast Pages Indexed - via Gigablast Advanced Search(e.g. SEOmoz - 1 page) Exalead Pages Indexed - via Exalead(e.g. SEOmoz - 5,481 pages) Clusty Pages Indexed - via Clusty Advanced Search(e.g. SEOmoz - 5,867 pages) How this Site Looked in the Past - via Wayback Machine(e.g. SEOmoz - all the way back from February of 2005) Link Data Yahoo! Link Data - via Yahoo! Site Explorer(e.g. SEOmoz - 187,234 external links) Technorati Link Data - via Technorati(e.g. SEOmoz - 8,961 links from 2,541 blogs) MSN Link Data - via Live.com(e.g. SEOmoz - 107,512 external links) Google Link Data - via Google (note that this information is purposefully inaccurate)(e.g. SEOmoz - a uselessly erroneous 2,370 links) Google PageRank - via RankAlert (shows for all 72 datacenters)(e.g. SEOmoz - PR 5/10 or 6/10 depending on DC) Exalead Links - via Exalead(e.g. SEOmoz - 4,308 external links) Social Tagging Data Bookmarks at Del.icio.us - via Del.icio.us(e.g. SEOmoz - 31 pages, thousands of bookmarks) Pages in StumbleUpon - via StumbleUpon Reviews(e.g. SEOmoz) Mentions at Digg - via Digg Search(e.g. SEOmoz - 50+) Mentions at Reddit - via Reddit Search(e.g. SEOmoz - 21) Mentions at Tailrank - via Tailrank Search(e.g. SEOmoz - 8) Mentions at Newsvine - via Newsvine(e.g. SEOmoz - 1) Third-Party Trust Metrics TrustGauge Rank - via TrustGauge Better Business Bureau Listings - via BBBOnline.org Truste Sealholders - via Truste Member List (sadly, no search function) Important Directory & Site Listings Listings in the Open Directory Project - via DMOZ(e.g. SEOmoz - 3) Listings in Wikipedia - via Wikipedia Search(e.g. SEOmoz - 12) Listings in the Yahoo! Directory - via dir.yahoo.com (e.g. SEOmoz - 1) Listings in MSN's bCentral - via bCentral Listings in Business.com - via Google Search (as Business.com has none of their own) Links in Google Groups - via Groups.Google.com (e.g. SEOmoz - 134) Press & Media Mentions Listings in Google News - via news.google.com (e.g. SEOmoz - 8) Listings in Google News Archive - via archive search(e.g. SEOmoz - 58) Listings in Yahoo! News - via news.yahoo.com(e.g. SEOmoz - 13) Wow... That took a bit longer than I expected and now it's 2am... You'd think I'd learn not to start ambitious blog posts at midnight. So, dear readers, any others to share? p.s. I almost forgot that today is the SEOmoz blog's official 2-year anniversary. Happy B-day blog :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A List of Every Website Statistic Publicly Available"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A List of Every Website Statistic Publicly Available"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}