{
  "url": "https://moz.com/blog/a-list-of-web-page-quality-signals",
  "slug": "a-list-of-web-page-quality-signals",
  "title": "A List of Web Page Quality Signals - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was inspired by Xan Porter's recent post on Evaluating Web Page Quality. Search engines have their own evaluation signals, but as they try to improve in quality, it's only natural to pursue more human metrics in order to refine to the greatest possible degree. The research she points to - ...",
  "content": "A List of Web Page Quality Signals Search Engines By: Rand Fishkin October 25, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 25, 2006 A List of Web Page Quality Signals Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was inspired by Xan Porter's recent post on Evaluating Web Page Quality. Search engines have their own evaluation signals, but as they try to improve in quality, it's only natural to pursue more human metrics in order to refine to the greatest possible degree. The research she points to - less is more: probalistic models for retrieving fewer relevant documents - offers up a terrific structure for how humans might evaluate documents: Intrinsic Features: How accurate is the information presented? How biased or unbiased is the data? How believable is the content? How credible is the source? Contextual Features: Is the information relevant to the user's query? Does the information add value to the subject? Is the work recent enough to be of value? Is the source thorough in its presentation? What amount of information is provided? Representational Features: Can the material be interpreted in different ways? How easy or difficult is the material for a user to understand? Does the document state the information concisely? Is the source consistent? Accessibility Features: Is the document accessible? Does the content present security risks? Of these, which can search engines currently measure? I'd guess that of the above, they have signals about many, but only solid metrics for accessibility, security risks and, possibly, readability... There's a long way to go. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A List of Web Page Quality Signals"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A List of Web Page Quality Signals"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}