{
  "url": "https://moz.com/blog/a-little-knowledge-can-be-a-dangerous-thing",
  "slug": "a-little-knowledge-can-be-a-dangerous-thing",
  "title": "A Little Knowledge Can Be A Dangerous Thing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week Seth Godin wrote a raging post about emails he’d received requesting links from his blog. The emails were from employees of Reed Elsevier, the publishers of titles such as Variety & LexisNexis, and what really angered Seth is not so much the fact that he received multiple reque...",
  "content": "A Little Knowledge Can Be A Dangerous Thing Link Building C By: Ciaran Norris March 26, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris March 26, 2007 A Little Knowledge Can Be A Dangerous Thing Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Last week Seth Godin wrote a raging post about emails he’d received requesting links from his blog. The emails were from employees of Reed Elsevier, the publishers of titles such as Variety & LexisNexis, and what really angered Seth is not so much the fact that he received multiple requests (although that definitely seems to have pissed him off), but the response he received to his reply explaining that link swapping was a practice he didn’t take part in. I won’t repeat the text of the email he got back from Reed (partly because you can read it over at Seth’s, & partly because it’s an example of awful English), but why should this take up more than a minute of my time? A big offline publisher doesn’t \"get\" the web – big deal, right? Except, these emails came from the US arm of my current employer RBI's parent company. And incidents such as this cast a bad light on a whole company, not just the individuals or departments involved. I’m not going to try & use this post to apologise for the incident, mainly because it’s not my part to do so. What I would like to do is use it as an example of what happens when you call on people to participate in a process that they simply don’t understand. My American colleagues have been involved in a link building process where all employees were called upon to drive inbound links to their sites. What this shows though is that this has been done with no real education in the etiquette of the web. As these two posts on the Link Building Blog show, there is a much better way to try and build links into a site which don’t involve harassing one of the most respected marketers in the world. I mean come on - WTF?! Who in God's name thought that it would be a good idea to hammer Seth Godin for reciprocals? By creating great content (using Rand's post as a guide perhaps), taking part in conversations within a community, and most importantly of all, by being polite & respectful at all times (whoever wrote those emails to Seth might want a lesson in humility – perhaps from this particular embarrassed American Reed employee), you have a much better chance of building links to your site. I do hope that this particular custard pie doesn’t damage the reputation of the rest of the company, especially as there are so many talented individuals (especially here in the UK) who really \"get\" the medium and are working hard to make sure that they provide the best content, in the best way possible to maximise its exposure. And can I also say that if Reed Elsevier does want to run a professional and ethical link building campaign, I am only a Reed employee for another 3 weeks, and after that the agency I am going to work for would be more than happy to run it for them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Little Knowledge Can Be A Dangerous Thing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Little Knowledge Can Be A Dangerous Thing"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}