{
  "url": "https://moz.com/blog/a-long-list-of-competitive-link-searches",
  "slug": "a-long-list-of-competitive-link-searches",
  "title": "A Long List of Competitive Link Searches - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, I covered searching for potential links through highly ranking sites at the engines. Today, we'll talk about competitive link searches - finding the links your competetion is using to rank well. As an example, I'll use Farecast, a local Seattle company that I've mentioned in the past…",
  "content": "A Long List of Competitive Link Searches Link Building By: Rand Fishkin November 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 2, 2006 A Long List of Competitive Link Searches Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, I covered searching for potential links through highly ranking sites at the engines. Today, we'll talk about competitive link searches - finding the links your competetion is using to rank well. As an example, I'll use Farecast, a local Seattle company that I've mentioned in the past (full disclosure: David Shim, who works there, is a friend). Since Farecast will want to rank for terms like \"plane ticket prices,\" \"compare airfare,\" and \"cheap airline tickets\" they'll be competing against some of the web's largest travel properties. The first step in any good competitive link campaign is to discover your competition. Many times, there will be a lot of sites that you didn't see as competitors initially. Remember that any site that ranks in the top 10-20 for your primary target search terms is, for these purposes, considered a target. Thus, a great way to start is by listing the 20-50 most competitive search terms & phrases that you want to rank for and searching for the top 20 listings at Yahoo!, Google & MSN. Once you've got your results, you'll want to take note of those sites that consistently rank in the top 5 for many different phrases as well as identifying other potential targets that rank 6-20 on a regular basis. I've made a short list from just a few searches for Farecast: www.orbitz.com travel.yahoo.com www.cheaptickets.com www.cheapflights.com www.sidestep.com www.planetickets.com www.priceline.com www.travelocity.com etc. From here, I'll use Sidestep.com as an initial source. The following are the major competitive link searches that I regularly use: Direct Link Searches:Note that MSN & Yahoo! tend to list more important links higher than less important links, so by searching through the top 1-200, you're, in general, getting the most \"powerful\" links the site has. There also appears to be a temporal component to link searches, so newer links will appear before older ones. Google - link:www.sidestep.com (practically useless) Yahoo! - linkdomain:sidestep.com (at SiteExplorer) MSN - linkdomain:sidestep.com - site:sidestep.com Keyword-Embedded Link Searches:Google doesn't allow these and neither does Yahoo! Site Explorer, so you'll need to use MSN and Yahoo!'s direct search function. I've used just a couple examples below, but you can use dozens of keywords and phrases to find pages that use this text and link to the competition. MSN - linkdomain:sidestep.com \"cheap airfare\" -site:sidestep.com MSN - linkdomain:sidestep.com \"ticket prices\" -site:sidestep.com Yahoo! - linkdomain:sidestep.com \"cheap airfare\" -site:sidestep.com Yahoo! - linkdomain:sidestep.com \"ticket prices\" -site:sidestep.com Extension-Specific Link Searches: MSN - linkdomain:sidestep.com site:gov MSN - linkdomain:sidestep.com site:edu Yahoo! - linkdomain:sidestep.com site:gov Yahoo! - linkdomain:sidestep.com site:edu Direct-Path-to-Inclusion Link Searches: MSN - linkdomain:sidestep.com \"add url\" MSN - linkdomain:sidestep.com \"submit site\" MSN - linkdomain:sidestep.com \"directory\" MSN - linkdomain:sidestep.com \"suggest a link\" MSN - linkdomain:sidestep.com \"suggest site\" All the above apply directly to Yahoo! as well Multiple Competitors at a Time:This is one of my favorite link searches, as it shows you hubs that have linked to several competing sites. These pages are often easier to get mentions from than standard link searches, because they're already pointing to several folks in the same space. MSN - (linkdomain:sidestep.com linkdomain:orbitz.com linkdomain:travelocity.com) (-linkdomain:farecast.com) Yahoo! - linkdomain:sidestep.com linkdomain:orbitz.com linkdomain:travelocity.com -linkdomain:farecast.com Non-Link Link Searches (using normal queries rather than link commands):This works particularly well at Google since they don't allow advanced link searches. Google - cheapflights.com -farecast -site:cheapflights.com Google - orbitz travelocity cheaptickets -farecast Google - orbitz -farecast -site:orbitz.com Google - sidestep \"compare airfare\" -farecast -site:sidestep.com Blog & News Link Searches: Technorati - orbitz.com (sort by authority) Technorati - sidestep airfare Topix - orbitz.com Topix - sidestep airfare GG News - orbitz sidestep -farecast GG News - compare airfare - farecast - not really a competitive link search, but a good one to use in general With the list above, a dedicated link builder could imagine thousand of permutations. It makes me glad I'm in the content and linkbaiting business more these days :) If you've got competitive searches to add to the list, please do! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Long List of Competitive Link Searches"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Long List of Competitive Link Searches"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}