{
  "url": "https://moz.com/blog/a-look-at-podcasting-seo-in-2016",
  "slug": "a-look-at-podcasting-seo-in-2016",
  "title": "An Exploration of Podcasting SEO in 2016 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO is everywhere you look. In today's post, Dan Shure dives headfirst into the world of SEO for podcasting, exploring the surprising similarities and differences in ranking for iTunes and uncovering his journey in launching an SEO-oriented podcast.",
  "content": "An Exploration of Podcasting SEO in 2016 Content Marketing | SEO Basics By: Dan Shure May 4, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Shure May 4, 2016 An Exploration of Podcasting SEO in 2016 Content Marketing | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 24 minutes] Marketers: Add podcast promotion to your skill set Sure. This post is for podcasters. Hi Podcasters. You may find the below interesting, perhaps educational — and I hope you leave your insights for the Moz Community in the comments below (I'll be reading and replying to all of them). But even if you never plan on having your own podcast, this post is for you, too! I see the marketing of podcasts will being an important addition to any marketer's skill set in 2016 and beyond. So below, we'll examine iTunes ranking factors, lay out promotional strategies I've used to grow listeners in my first 6 weeks of podcasting, and I'll transparently reveal all of my podcast's metrics. Before I show you this, though, let's look at exactly how much podcasts are growing. The \"Serial\" effect. To grasp the magnitude, we zoom out and look at the trends. Since Edison Research began tracking statistics in 2008, podcasting saw the largest YoY growth of monthly listeners in early 2016. Listeners jumped from 17% to 21%. That's now 21% of the US population, compared to only 9% in 2008. Estimates expect that percentage to grow even more. Yes, you are witnessing the Serial Effect: accelerated growth of a medium led by mass popularity of the best produced product in podcasting to date. Ways to consume podcasts are growing, too Not surprisingly, app developers have jumped on board — and the paths to discovery are growing. As a podcaster or marketer, you should want to look at this from a search perspective. iTunes (partially a search engine) is likely the top discovery channels for podcasts. Many other players like Sticher, Player.fm, and even Google (just announced) have a core search functionality for discovery. And Google just announced they'll show podcasts in search results in the Android Google App. How long before this carries into all of Google search? How's the data available to podcasters? Meager at best. Apple doesn't disclose search volume. There's conflating ideas of what a \"download\" actually means. There's no engagement metrics (i.e.: you can't tell how long people actually listen to an episode). Because of that (and my lack of extreme nerd-ness, I only have moderate nerd-ness) this post has NO fancy charts or big-data graphs. But my hope is to relate my experience with podcasting SEO thus far, to bring value to the marketing community at large. Keep in mind: this post is from the perspective of a two-person podcasting team, running it as a side project at Evolving SEO, with a combined total of only about 12 hours per week. Buckle up. Table of Contents There's a LOT here. You can absolutely consume this post by jumping around! iTunes rankings What are the \"paths\" to discovering podcasts? What are possible ranking factors? My promotion strategy Produce an exceptional product Run targeted Facebook ads Create an organic network effect Be a guest on other podcasts Interview guests who have audiences Goals & results General show stats iTunes rankings Business results Lessons learned & takeaways Patience Make a popular show iTunes wants to rank Competition is heating up Chat with me I. iTunes rankings What are the \"paths\" to discovering podcasts in iTunes? It's first important to understand the different nuances and places of \"ranking\" within iTunes. In other words — these are the places you can show up in iTunes. Curated lists vs. searching The biggest distinction I have learned — and you need to know — is lists versus search rankings. \"Ranking\" factors for each may be quite different. List Rankings are NOT attached to a search keyword, because no search happens. Found via clicks and navigating through the site. Search Rankings are impacted by keywords, because the user types a search into the search bar. Found via performing a search. The podcast \"home page\" lists This is the \"holy grail\" of what Podcasters talk about when trying to break into \"new and noteworthy.\" Supposedly if you get listed here, your downloads skyrocket, you make tons of cash, and you sit on a beach in the Bahamas. Category lists This includes: New & Noteworthy for the Category What's Hot for the Category All Podcasts for the Category Though not the \"home page,\" it's still generally quite advantageous to rank here. Lists function by clicking into the category list — not by running a search: Subcategory lists The UX in iTunes (desktop) is weird here, because you can't drill down from a category into subcategories. You have to find a show in the subcategory, and use the breadcrumbs to back out of it into the subcategory page: Now we're in the Business > Careers subcategory: As you can see, it still has \"New and Noteworthy\" and \"What's Hot.\" I should note, in the Podcast App, it's much easier to drill into subcategories. Related podcasts iTunes will show \"related\" podcasts in three ways: More by Channel If you publish more than one show. Publish multiple shows to show up here. Top Podcasts in Category Basically this looks like the Top 200 category list. So you need to break into the Top 200 list for your category to show up here. Listeners Also Subscribed to This seems to be the only \"related\" functionality based upon user behavior (like Amazon's \"people also bought\"). You need to get more subscribers in iTunes to show up here. Podcast search results This is the true \"search engine\" area of iTunes. These seem to operate quite differently than lists. Here is the \"first page\" result for \"marketing\": The main point to takeaway here is that there are a variety of discovery paths within the iTunes store, and you should be aware and optimize for all of them. What are possible iTunes podcast ranking factors? Below, I'm going to list a large variety of possible ranking factors and some anecdotal, instinctual thoughts of my own — as well as references to other opinions. Again, this is one view and set of hypotheses for how rankings might work within iTunes. I welcome opposing thoughts or discussion. Number of new subscribers in last week In the middle of writing this post I stumbled upon episode 421 of Podcast Answer Man. Admittedly, it threw me a HUGE curveball. Rob Walch claims to know the exact algorithm for iTunes List rankings. Yeah, I'm not kidding. Rob says: \"The top 200 list is number of new subscribers in the last seven days with a weighted average of 24, 48, and 72 hours. The actual algorithm is: (Day1x4 + D2x3 + D3x2 + D4 + D5 + D6 + D7) / 13\" You can go listen to the excerpt of that episode and Cliff's follow-up explanation for how this algo works. Again, this is the top 200 for each category (Business, Arts, Education etc). I do NOT think this is for ranking in searches. List or Search Rankings: This likely affects list rankings, not search. Likely Factor: I think likely, but would just like to see some example data to back it up. Influenceable: Indirectly; there's a lot of things you can do to promote getting subscriptions. Data Available: Supposedly yes, in Feedburner, but I'm just not seeing anything in my account yet. My Advice: You should be trying to grow subscribers anyway, so of course this is an important area. Keywords in show feed This includes the following areas: Show Name Artist Name Episode Titles Episode Description By the way, you can read a TON on podcast keyword placement suggestions on Pat Flynn's Podcasting Tutorial. It's pretty basic though. Put your keywords in those places, without being spammy. List or Search Rankings: This impacts search rankings (not list). Likely Factor: I say yes. It's quite obvious iTunes ranked my show based upon words I used. Influenceable: Yes. You can control, edit, and update any of this text at any time. It takes about 12–24 hours tops for iTunes to pick up the updates. Data Available: Yes, we can publicly see all text available in any Podcast feed. This makes it easier to study. My Advice: Similar to traditional SEO, definitely optimize your show with keywords. See Pat's tutorial for more specifics advice on that. Total number of plays/downloads This is a very common factor many podcasters will cite as having influence on ranking. To clarify, \"downloads\" can be misleading — it refers to any streaming play or actual download of an episode, as reported by podcast hosting services like Libsyn (the host I use). Nielson's Hot Pod states: \"We’re about a year and a half into this podcast-renaissance racket, but even with all this talk, a download still doesn’t necessarily mean a download, and an impression still doesn’t necessarily mean an impression.\" As far as I understand, I haven't seen download numbers affected at all by length of engagement. One could listen to the first 10 seconds of an episode and it still registers as a \"download\" (I've tested this myself). Likely Factor: No. Apple does not have access to my Libsyn stats of total downloads. Influenceable: Indirectly (unless you use Fiverr or something). Data Available: Only privately, or if podcasters willingly share their download numbers. My Advice: Of course you want to get listens or downloads. But consider these numbers proxy/relative metrics at best. And certainly don't try to boost thinking they impact rankings. NOTE: Downloads are often the go-to numbers used when sponsorships are purchased. See Tim Ferris' post or EOFire's great guide on sponsorships. Are you beginning to see how download numbers are pretty muddy too? Review acquisition This is one of the most hotly debated ranking factors for podcasts. The idea is that the more reviews you get and the faster, the more likely you are to hit \"New and Noteworthy.\" Likely Factor: In my opinion, unfortunately, yes. Although some may strongly disagree. And I respect Daniel's opinion. I'm just not sold on reviews being off the table as a ranking factor. Perhaps they don't affect Top Lists, but do affect search rankings. And maybe some people are gaming iTunes rankings for no actual reason, and I'm misreading this as a correlation. More on that below. Influenceable: Yes. Unfortunately. As you'll see below, fake reviews are plentiful. Data Available: Yes, you can see at any time how many reviews any episode has, when they were left and how many stars (out of five) were given. There could be sub-factors to just pure number of reviews, such as: Quality of reviews Velocity of reviews Who leaves them (kind of like a Yelp Elite user review has more weight). My Advice: I'm in the camp of \"earn your reviews organically.\" As of writing this I only have 10 reviews, while other shows that came out around the same time have 50+. I haven't asked a single person for a review, but that's my personal choice. Cover art Many podcasters have claimed that the quality of your cover art impacts rankings. They state that an iTunes editor will be more likely to place you into New and Noteworthy. Likely Factor: My opinion, no. I know many will disagree — but design quality is subjective, in a way. And I've seen many shows with what I would call \"ugly\" cover art ranking just fine. This may help you if iTunes wants to hand-choose you for the homepage. Also, this is not a scaleable ranking factor. Influenceable: Yes— hire a good designer :) Data Available: Subjectively. My Advice: You should aim to have great cover art no matter what (ok ok, I know mine is just OK, I made it myself, and we're working on a very lean/agile budget, remember?) :) Launching with 2–3+ episodes at once This seems to be commonly cited among podcasters — including Tim Ferris, in his exceptional article about building his podcast (it's great, you should read it). But I'm not sure I can agree. Likely Factor: I'm going to go against a lot of the podcasting community on this one and say — I'm highly skeptical. I think the idea is that you have a small window of time after launching to rank, and you'll \"miss out\" otherwise. I'm just not seeing evidence of this. My show didn't rank for much in week #1, but 7–10 days later after I had 3–4 episodes posted it did start to rank for things, yet I posted episodes one at a time. Influenceable: Yes. You can upload as many episodes as you want, whenever you want. Data Available: Sort of. We can look at newly launched podcasts, and try to parse those launching with only one episode from those that launch with three or more — and note ranking differences. So it's hard to say if this effect is correlation or causation. And I'm afraid many are seeing correlating evidence on this one. For example, perhaps more episodes will result in more reviews, which then results in higher rankings. In which case the directive should be \"get more reviews!\" Even with one episode. My Advice: You may want to consider launching with 3+ episodes, so when new people discover your show, they are more enticed to subscribe. II. My promotion strategy HUGE DISCLAIMER: There was so much more I wish we could have done. With extra resources (time and/or budget) I'm confident we could break into the \"New and Noteworthy\" section. Also, I have no intention of \"gaming\" rankings to break into \"New and Noteworthy.\" I want the answer to \"how would an average guy, with no fancy tricks, rank naturally in iTunes?\" 1. Produce an exceptional product This sounds like an empty platitude, but let me break it down for you. Here are a few core standards I wanted to adhere to from the beginning: a.) Ask the guests unique questions We're running a guest interview-format show. Therefore, the questions are everything. How do you ensure you're asking unique questions? Two ways: Listen to or read at least 2–3 recent interviews your guest has given. Avoid repeating questions they've already been asked. Reference very recent tweets or articles the guest has written, especially on newer topics. Chances are no one else has had the chance to ask about them yet. I can see our strategy working. Jen Slegg had this to say: If we're not asking at least 2–3 questions our guest has never heard before, we're not doing our job — and we're not going to have a show that stands out. b.) Read 1-star reviews of other podcasts to learn what NOT to do I know that's a long heading... so let me show you an example. The following are some 1-star reviews of other marketing podcasts: I read through hundreds of bad reviews of other podcasts. I started to see common things to avoid, such as: Make the intros short and sweet, and get right into the meat of the show. Listeners are not very tolerant of longwinded intros (note: I've worked on improving this, especially episodes 11 and on!) Don't \"banter\" and small-talk, especially not at the beginning. People are VERY turned off by the typical \"radio jock\" DJ you may have heard on radio stations in the '80s and '90s. Make the sound quality as good as possible. People complain a lot about unbalanced volume levels, inaudible guests, and just generally bad sound. Don't hurt people's ears! Don't trick people. There's a big trend in podcasting to just pile in the names of \"famous\" entrepreneurs to try to rank for searches of their name. People hate this. It's disingenuous. c.) Strive for professional audio quality Poor audio quality in a podcast should be the same criminal offense as having illegible fonts on your blog. It creates cognitive friction that distracts from your content. Fortunately, I have experience with audio production; if you don't, I highly recommend you get help in this area. Here are a few of the trade secrets I've been using. Use Compression — Most basic music software will have a compression plugin (including Garageband). Essentially, it evens out the high/low volumes, eliminating spikes and brings up the softer sounds. (There was a tool called \"Levelator\" which you could use, but it's been discontinued). Use a Gate — A \"gate\" is a way to eliminate lower volume extraneous noises, like fans humming, an echo-y room (like my office), sniffling, etc. This has been my secret weapon to really clean up the show. And I have to say, for not having the most fancy and expensive equipment and setup, our show sounds pretty good. It's something I'm super proud of. There's LOTS more we're doing to strive for a best-in-class show, but those have been the top three focus areas. 2. Run targeted Facebook ads I have a Facebook Ad consultant running ads for clients, so we set a campaign up for the podcast episode in which I interviewed Brian Dean. I figured leveraging a pretty known name in the industry would attract some clicks and interest on this particular episode. This was our targeting: Locations: Australia, UK, Ireland, US Ages: 22–50 Languages: English (UK or US) Interests: Amy Porterfield, KissMetrics, Neil Patel, Moz (marketing software), Smart Passive Income with Pat Flynn or Derek Halpern Must match interests: Podcasts Budget: $200 We tested a number of text/image combinations, but these were the two \"winners\": I think these won in CTR simply because the messaging is specific and intriguing. Ad 1 Stats: Reach: 14,151 Website Clicks: 746 Cost: $0.17 Spent: $123.14 Ad 2 Stats: Reach: 7,963 Website Clicks: 263 Cost: $0.21 Spent: $55.63 We also tested other images of Brian, but that one performed the best by far. It's tough to tell exactly how many plays we got from ad traffic, but it looks like about 30% of Facebook ad traffic resulted in a \"download.\" In other words, it cost about $1.00 per download. 3. Create an organic network effect Besides spending $200 on Facebook, we had no budget allocated; just time and effort. This means doing every little thing you can to create a cumulative effect. a.) Update your email signature Tons of people see my emails every day. These impressions add up and matter over time: Now you have my phone number :) b.) Send personal emails to highly relevant people This is truly the power of one in practice. Yes, I'll take the time to personally email a small handful of people who I think might enjoy the show. I don't ask them to review it or share it. These are people I already know pretty well, not cold emails. For instance, Jake, who asked me about Podcasts almost a year ago. We had a short conversation at that time, but I remembered the chain and followed up: This is an excerpt of his reply: I also remembered Borja Obeso had me as a guest on the Rebel Growth Podcast — and I had been emailing with him and let him know about it: He then voluntarily shared it: No. None of this is earth shattering. But repeat small actions like this dozen or hundred's of times and they add up. Besides, I'm just building/continuing relationships in the process — which is even better. c.) Share in seemingly irrelevant places A podcast has a much wider appeal than my SEO services. This means I can share my podcast in places I'd never be talking about SEO services. Like Instagram. I pretty much use it as a photographer: But I figured, why not just share a photograph per usual and announce it in the copy of the post? Luckily, this photo got the most likes I've ever received — and this the most visibility. And it actually worked: Yes, that's ONE person telling me they downloaded the Podcast. It's small. But it's one more person listening to the show. Remember, those add up. Cumulative effects. d.) Swap small talk for \"Hey, we started a podcast!\" How does your typical meeting begin? \"How are you?\" \"How's the weather there?\"\"What'd you do this weekend\"? Snooze. Because I probably talk to and/or meet 100+ different people per month, I have used these opportunities in the last 6 weeks to switch up my default answer from \"good\" or \"cold\" or \"here's some boring activity we did you don't care about\" to: \"Great! One exciting thing, we just launched our marketing podcast and it seems to be going well.\" Sometimes there's an awkward pause, because an actual conversation is so shocking to some people. But 85% of the time I sense an interest. In which case, I drop them a link in a chat or an email. Results? That person ended up leaving a review, too. This is just two examples, but it happened many many times — just by telling people as you go through your day. Again, this sort of \"word of mouth\" promotion is possible by the very nature of a podcast — it has a wide reach and appeal. 4. Be a guest on other podcasts When you think about it, the people you should be trying to get in front of are podcast listeners. Not all people interested in marketing will want to consume information in audio format. But if you can be a guest on a podcast in a related field, you're more likely to attract new listeners, because they're already in the podcasting ecosystem. I only had limited opportunity to do this, as I was the guest on Talking Drupal last week, but will be hoping to do this more in the future. Yes, I'm available to be on any podcast talking about SEO. Interested? Tweet me </plug>. 5. Interview guests who have audiences I think this is a given and in fact it's a pretty known \"trick of the trade\" in podcasting. Look at the success of shows like Entrepreneur on Fire, School of Greatness and Mixery. These shows are practically built on the following of the guests (and the hosts to some degree). Now... I will NEVER have a guest on I'm not excited about or who won't bring real value, just for the sake of siphoning their audience. But I'm well aware of the fact some guests may have a sizable influence. Take the show I did with Everette Taylor. All I did was put out one tweet and his audience did the rest: And Ross Simmonds' tweet with Everette's RT took it even further: (Yeah, some Twitter bots jacked up those numbers a bit) And again, I reiterate, there are plenty of people I could have on my show with \"influence,\" but I'd opt to have someone that makes for a great interview any day over \"influence\" alone. III. Goals & results First, before I show results, I have a few things in mind we're looking to achieve: Goal KPIs To hit \"New and Noteworthy\" in our subcategory, and category (I doubt the home page is possible with our limited resources and the 2016 competition) To rank in iTunes search for some general keywords like \"SEO,\" \"marketing,\" \"growth hacking,\" and some guest names like \"Brian Dean,\" etc. Goal show metrics Downloads — I'm shooting to hit 10,000–30,000+ downloads per episode within six weeks from the date they're posted. There's no consistent industry agreement on how many downloads you need to monetize (see here and here and here) but the 10,000–30,000 mark seems common. I'm NOT saying we'll definitely take sponsors, but I figure if we're \"sponsor-worthy\" we're \"monetization-worthy\" in one way or another. Business goals Monetization — As noted, I am not set on how we monetize, but this would be a great result for the hours, effort, and energy we put into a free show. New service / Product opportunities — Again, nothing I'm dead set on, but open to what happens. We may be in the position to train other companies on how to produce audio content, or to have this be on offshoot media company producing a variety of audio content. So how are we doing so far? It's been 36 days since we launched, so we're relatively young, but I'm seeing promising results thus far. General show stats (As of 4/28/2016) Episodes posted: 13 Reviews received: 11 Total \"Downloads\": 2,708 iTunes rankings I didn't do this very \"scientifically.\" I don't know how to track iTunes rankings automatically, so I just jumped in and took screenshots every few days. Here's some rankings in chronological order: Day 2 By day 2, we were \"indexed\" in iTunes and showing up for long-tail searches like \"digital marketing experts\": I doubt anyone searches that, but I was basically just checking that it showed up at all. Day 3 I was pleasantly surprised to see us ranking for \"seo\" — albeit position #51 — only 3 days in: I also quickly realized I would need to improve the cover art, as the font was WAY too small. I was even more happily surprised to see we ranked #6 for \"growth hacking\" by day 3. Sadly, we didn't actually have any content about growth hacking yet. I suspect we ranked for it simply because it's in our show title. By day 3 we also ranked for \"Brian Dean\": Day 9 Yeah, I know... what happened to days 4–8? Well by Day 9, we ranked even better for \"Brian Dean\": Day 12 In trying some other searches, I noticed we ranked pretty well for \"slideshare\": This was due to episode four with Ross Simmonds, which was mostly about SlideShare, so it was in the show title. Day 20 I know, I know, we've skipped 8 more days. Anyway, I'm still not ranking for the terms I think will bring the most value, like \"marketing\": I should not, at this point, as search result like this only has 100 slots. If you're not in the top 100, you're not there at all. That would be me (not there). We ARE, however, moving up the spots for \"SEO,\" now at position #27: Day 28 Finally. We made it into \"New and Noteworthy\" for the sub-category of Marketing and Management: Could we have done this sooner and ranked higher with the application of additional \"tactics\"? Sure. I could have directly asked people for reviews and subscriptions. But I really wanted to see what the natural progressions of rankings would be without this influence. Day 30 We then finally made it into \"New and Noteworthy\" in the main category of Business. Well, sort of. Ranking in the 15th row is there, but that's basically like the 10th page of Google: Beyond day 30 We tend to hover around the position 30 range for \"New and Noteworthy\" in Marketing & Management: Also, currently rankings are: 29 for \"seo\" Not in top 100 for \"marketing\" 3 for \"everette taylor\" 4 for \"growth hacking\" 18 for \"content marketing\" 67 for \"digital marketing\" 81 for \"analytics\" iTunes ranking hacks Throughout the course of doing this, I noticed a series of loopholes — if one had the desire to pursue them. Rank #1 by post-dating your episodes Now, I'm not sure if this is being done on purpose, but here's how you show up #1 in your category: If you look at his episodes, they are post-dated. So apparently this section is ranked chronologically: Rank for almost any keyword by being popular There's not much keyword targeting going on here: This show has nothing to do with marketing, but ranked #2 (at the time of my search) for \"marketing.\" Perhaps it had a marketing episode at one point. There's no apparent filtering or de-ranking for fake reviews Do these reviews by user names \"dghdb76\" or \"ghn dgd56\" look real to you? Yeah, me neither. However, this show (I didn't want to call it out) has dozens (maybe hundreds at this point) of fake reviews. It ranks exceptionally well. iTunes does nothing to filter them out. I'm not 100% sure the reviews are causing the rankings, but if the reviews are gamed, wouldn't you assume the subscriptions are as well? \"REALLY THIS PODCAST IS AN EXCELENT.\" <--- seriously? Podcast show metrics — our results Just like normal SEO, rankings mean nothing if they don't translate to marketing and business outcomes. Which is why we can look at my iTunes rankings all we want, but I'm more interested in downloads. First, here are my total \"downloads\" as of 4/20/2016: Remember. My GOAL is 10,000+ downloads per episode within 6 weeks of when they post. So for example, #3 with Brian Dean would have more like 9,000+ downloads by now. So yeah, we're just getting started. Here's the growth of downloads day by day. As you can see, it's been a nice steady trend upwards so far: Each spike is generally a day when a new episode posts, or when it gets some extra sharing on social media. What's cool is Libsyn also provides some nice data around user agents — here are the agents most used to play my show thus far: Though not a \"goal\" metric, it is nice to see a nice variety of agents and diversity of places people listen to the show. Business results This is where it gets interesting. Sure, metrics are great, but I'm paying extra attention to those \"serendipitous\" things most people might miss. I mentioned the long term goals of monetization and additional business opportunities. Of course 44 days in is pretty fast for that, but I can specifically point to other business results due to the podcast. Having a podcast makes writers more receptive to you I occasionally reply to HARO inquiries. I noticed that when I started putting that I was a podcast host, it helped warm up writers to me a bit more. I think it's less intimidating than \"agency owner.\" This is an example of one of a few placements that came as the result: People perceive you differently I can hear it in their voices. When I'm on a call and I tell a client \"we launched a podcast,\" you hear that like \"ohhhhhh,\" as if they're impressed. I think podcasting can have this effect right now, because they still have a perception of \"status,\" like authoring a book. If you want to stand out, podcasting is a great route, but not the only one. It's the idea of doing something \"real companies do.\" Instead of just being any other SEO agency or consultant, suddenly we have an extra badge of credibility. This can lead to a client having more confidence/trust in our ability to make decisions and set strategies for them — leading to more success. Relationship building leads to business outcomes I can cite two very concrete examples of business outcomes since interviewing about 20 people (we record the episodes a few weeks ahead of time): A new client — Someone I interviewed referred a small project to us a week later. A placement in a high-profile publication — Someone else I interviewed invited me to contribute content to a high-profile site in the tech/marketing industry. Since I have not done much of this, it opens the door to an opportunity of more exposure and doing so again in the future. (Note: this content has not been posted as of yet). Writing for higher profile sites beyond just the SEO industry has been a passive goal for a while. Running an interview-format podcast has opened the doors to a TON of relationship building and networking that I normally wouldn't be doing from Worcester, MA. :) Podcasting impacts your website rankings & traffic I spent most of this post focusing on ranking in iTunes for the sake of getting more podcast downloads. But your podcast can feed back into your website performance. Remember, podcast episodes are posted to your website, so all of that content lives on your domain too. This means I could eventually rank for some target terms like: People will search for podcasts in Google by category, so this is another source of traffic and discovery. You also get a link from Apple. Despite being nofollowed, I think this still must convey something to Google. Combine niches to create a new niche & stand out There are tons of SEOs. And there are LOTS of podcasters. But there are NOT many podcasting SEOs. This sounds like a cheap gimmick, but honestly, I only realized it in hindsight. Here's a concrete example. How many non-SEO podcasters would have noticed the dilemma in Google Play's email here? Or how many SEOs would have received that email without having a podcast themselves? However, now being in \"both worlds,\" it's an opportunity to spot something happening in one industry relevant to another — and be the source of interesting news or information. As an SEO or marketer, \"niche\" down into something and you'll spot TONS of information you can share between the two worlds, providing value to both, and helping you to stand out. The future of \"standing out\" is combining disciplines in new ways. IV. Lessons learned & takeaways Patience I'm only 44 days into podcasting. I realize I could be employing \"tactics\" (tricks?) to break into New and Noteworthy. I am aware of other podcasts that have received MORE downloads, reviews, listens, and praise than mine in the same amount of time. But, I refuse to employ such tricks, so I'm willing to be more patient to let those results come more naturally. Make a popular show iTunes wants to rank Just like Google, iTunes want to rank popular/quality podcasts — not make your podcast popular. Back in about 2006–2012, you could just put a decent show up in iTunes, rank in New and Noteworthy, and be set. But now, you can't depend on iTunes alone to make your show a success. You have to put in the work, especially if you're not going to use tricks. Should you optimize for iTunes rankings? Of course. But you'll have to market your podcast outside of iTunes as well. Competition is heating up We come full circle. There are real media companies — with budgets and brand equity — pouring into the podcasting space every day. I'm not saying it's too late to have a widely popular podcast. I'm still planning on it. But check it out: this is New and Noteworthy, April 24th, 2016. Look. At. All. The. BRANDS. Out of the top 27 podcasts in iTunes, there are these 12 brands: Entertainment Weekly Earwolf (a Podcasting Network) Apple Dean & DeLuca FOX Sports ABC News Digg New York Daily News Women's Health New Hampshire Public Radio Sports Illustrated ESPN Yes, folks, being successful at podcasting has evolved into real marketing. But with monthly listeners growing fast as well, there's still opportunity. The true variable of success is the quality of the product. Chat with me. Comments? Questions? Disagreements? I will reply to ALL below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Exploration of Podcasting SEO in 2016"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Exploration of Podcasting SEO in 2016"
    },
    {
      "level": "H3",
      "text": "Marketers: Add podcast promotion to your skill set"
    },
    {
      "level": "H3",
      "text": "The \"Serial\" effect."
    },
    {
      "level": "H4",
      "text": "Ways to consume podcasts are growing, too"
    },
    {
      "level": "H3",
      "text": "How's the data available to podcasters?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H2",
      "text": "I. iTunes rankings"
    },
    {
      "level": "H3",
      "text": "What are the \"paths\" to discovering podcasts in iTunes?"
    },
    {
      "level": "H4",
      "text": "Curated lists vs. searching"
    },
    {
      "level": "H4",
      "text": "The podcast \"home page\" lists"
    },
    {
      "level": "H4",
      "text": "Category lists"
    },
    {
      "level": "H4",
      "text": "Subcategory lists"
    },
    {
      "level": "H4",
      "text": "Related podcasts"
    },
    {
      "level": "H4",
      "text": "Podcast search results"
    },
    {
      "level": "H3",
      "text": "What are possible iTunes podcast ranking factors?"
    },
    {
      "level": "H4",
      "text": "Number of new subscribers in last week"
    },
    {
      "level": "H4",
      "text": "Keywords in show feed"
    },
    {
      "level": "H4",
      "text": "Total number of plays/downloads"
    },
    {
      "level": "H4",
      "text": "Review acquisition"
    },
    {
      "level": "H4",
      "text": "Cover art"
    },
    {
      "level": "H4",
      "text": "Launching with 2–3+ episodes at once"
    },
    {
      "level": "H2",
      "text": "II. My promotion strategy"
    },
    {
      "level": "H3",
      "text": "1. Produce an exceptional product"
    },
    {
      "level": "H4",
      "text": "a.) Ask the guests unique questions"
    },
    {
      "level": "H4",
      "text": "b.) Read 1-star reviews of other podcasts to learn what NOT to do"
    },
    {
      "level": "H4",
      "text": "c.) Strive for professional audio quality"
    },
    {
      "level": "H3",
      "text": "2. Run targeted Facebook ads"
    },
    {
      "level": "H3",
      "text": "3. Create an organic network effect"
    },
    {
      "level": "H4",
      "text": "a.) Update your email signature"
    },
    {
      "level": "H4",
      "text": "b.) Send personal emails to highly relevant people"
    },
    {
      "level": "H4",
      "text": "c.) Share in seemingly irrelevant places"
    },
    {
      "level": "H4",
      "text": "d.) Swap small talk for \"Hey, we started a podcast!\""
    },
    {
      "level": "H3",
      "text": "4. Be a guest on other podcasts"
    },
    {
      "level": "H3",
      "text": "5. Interview guests who have audiences"
    },
    {
      "level": "H2",
      "text": "III. Goals & results"
    },
    {
      "level": "H3",
      "text": "General show stats"
    },
    {
      "level": "H3",
      "text": "iTunes rankings"
    },
    {
      "level": "H4",
      "text": "Day 2"
    },
    {
      "level": "H4",
      "text": "Day 3"
    },
    {
      "level": "H4",
      "text": "Day 9"
    },
    {
      "level": "H4",
      "text": "Day 12"
    },
    {
      "level": "H4",
      "text": "Day 20"
    },
    {
      "level": "H4",
      "text": "Day 28"
    },
    {
      "level": "H4",
      "text": "Day 30"
    },
    {
      "level": "H4",
      "text": "Beyond day 30"
    },
    {
      "level": "H3",
      "text": "iTunes ranking hacks"
    },
    {
      "level": "H4",
      "text": "Rank #1 by post-dating your episodes"
    },
    {
      "level": "H4",
      "text": "Rank for almost any keyword by being popular"
    },
    {
      "level": "H4",
      "text": "There's no apparent filtering or de-ranking for fake reviews"
    },
    {
      "level": "H3",
      "text": "Podcast show metrics — our results"
    },
    {
      "level": "H3",
      "text": "Business results"
    },
    {
      "level": "H4",
      "text": "Having a podcast makes writers more receptive to you"
    },
    {
      "level": "H4",
      "text": "People perceive you differently"
    },
    {
      "level": "H4",
      "text": "Relationship building leads to business outcomes"
    },
    {
      "level": "H4",
      "text": "Podcasting impacts your website rankings & traffic"
    },
    {
      "level": "H4",
      "text": "Combine niches to create a new niche & stand out"
    },
    {
      "level": "H2",
      "text": "IV. Lessons learned & takeaways"
    },
    {
      "level": "H3",
      "text": "Patience"
    },
    {
      "level": "H3",
      "text": "Make a popular show iTunes wants to rank"
    },
    {
      "level": "H3",
      "text": "Competition is heating up"
    },
    {
      "level": "H3",
      "text": "Chat with me."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Shure\n          \n            Dan Shure"
}