{
  "url": "https://moz.com/blog/a-new-perspective-on-link-building",
  "slug": "a-new-perspective-on-link-building",
  "title": "A New Perspective On Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Dictionary.com defines a link as \"anything serving to connect one part or thing with another; a bond or tie.\" Interestingly, the given definition for a relationship is \"...",
  "content": "A New Perspective On Link Building Link Building By: Daniel Deceuster June 20, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daniel Deceuster June 20, 2011 A New Perspective On Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dictionary.com defines a link as \"anything serving to connect one part or thing with another; a bond or tie.\" Interestingly, the given definition for a relationship is \"a connection, association, or involvement.\" From a semantic point of view, these two words seem to be synonyms. Yet from an SEO point of view, all too often they are mortal enemies. Let's be honest, link building is not the most glamorous task out there. We all know it has to be done. We all know search engine algorithms heavily weight link metrics. But no one ever looks forward to sitting down and building links. I believe this paradigm is self-defeating. If you don't want to do something but still do it because you have to, how can you expect to be successful? In sports you hear phrases like \"the other team just wanted it more\" or \"they didn't show up to play\" or something similar. When athletes are just going through the motions it is pretty obvious. What would make link building any different? I think it is time to offer a new perspective on link building. Let's start thinking of it as relationship building instead. Please bear in mind, I'm not talking about low level linking tactics like social bookmarks, directory submissions or article publication. No real relationship is involved in acquiring these links. However, for those who like to leave blog comments, request link exchanges or email webmasters, it's time to get your head in the game. Building A Relationship Online I'm not talking about eHarmony here. I'm talking about the relationships we can build with webmasters, which in turn naturally play out in their websites and ours. Let me start with a personal example. I started a college football blog a few years ago. After about a year of the routine link building tactics, I decided it was time to start building relationships. For those of you familiar with the BCS, I am aggressively opposed to it. I did, however, know of a blog or two that favored it. I decided to reach out to one of these webmasters. I suggested that he first post an argument in favor of the BCS. I would then respond on my blog and reference his original argument. The debate ended up going back and forth over a few months and several blog posts. Naturally, I followed his blog and he followed mine. I linked to his blog and he linked to mine. My readers visited his blog and his readers visited mine. All the good things you are supposed to get from a successful SEO campaign naturally came to both of us through that relationship. What would have happened if I was just another link in his blogroll? What would have happened if he was just another link in my comments? Perhaps our rankings would have improved slightly, but we both would have missed out on the extra visitors and subscriptions. A Case Study: Danny Sullivan If you have been in the SEO industry for more than a day you probably know who Danny Sullivan is. Suppose you have a new blog about search engine marketing and really want a link from Search Engine Land. Is the best way to do this to simply scan the blog for an hour and then email the webmaster, asking for a link exchange? Probably not. You probably want to build a relationship with Danny, which would in turn do more for your blog than that one link anyway. So how could you go about doing this? First, find as much information as you can about Danny without being a creepy stalker. A quick Google search could tell you he runs Search Engine Land, has a personal blog at Daggle.com, has a Twitter and Facebook account, uploads photos to Flickr, answers questions on Quora, shares stories on Digg, posts videos on YouTube and even has a Wikipedia entry. This can take all of 10 minutes and in that superficial research you can learn a lot about Danny as well as see other connections he has in the industry which could benefit you as well. After doing the research, you should start engaging Danny in various ways. Some obvious methods would be to comment on his blog posts at Search Engine Land, interact on Twitter or reply to his answers on Quora. After a few weeks, Danny may start to recognize your name when he sees it. The next thing I would try would probably be pitching a topic for SMX. If you write to Danny, who by now has a general idea of who you are, and come up with a great pitch for a great lecture at SMX, there's a good chance you could present in front of hundreds of people in your industry. Which do you suppose is more valuable, a link from Search Engine Land or a 15 minute introduction and presentation in front of other industry experts? Not to mention at that point you will have interacted directly with Danny as a result of being an SMX speaker. An aspiring SEO blogger would do well to have one of the most influential people in the industry as a friend on Facebook and follower on Twitter, don't you think? Finding Relationship Opportunities Most of the time our existing relationships are what lead us to new relationships. You may not know Danny Sullivan or Rand Fishkin, but do you know someone who works at Search Engine Land or SEOMoz? The best relationship opportunities can be found in our existing relationships. Networking can be a very powerful tool in building new relationships. One of the best books I've read in a long time is called The City Of Influence. I highly recommend it for those looking for more information on the value of relationships and how to network in order to build new relationships. Another easy way to build a new relationship is by looking for guest blogging opportunities. For example, I just did a Google search for 'finance + guest + blog' and found several websites that publish guest posts as well as tips for being a guest blogger. If you were in the finance industry, these could be great relationships. Bloggers seem to be the most open to making new connections, so another technique is to simply Google your keyword + blog. Look for blogs in your industry and find people you can reach out to. Another method would be to search Twitter for your keywords and see who you can connect with. Speaking from personal experience, I get emails all the time from people looking for links. I ignore them. Every once in a while I get an inquiry from my personal blog, or a direct message in Twitter, or an email proposal that doesn't involve links at all. I pay attention to these and other webmasters do too. Conclusion Rand Fishkin has a brilliant slideshow that explains the history and future of Google rankings. Evidence is pretty strong that social media is starting to have a big impact on organic rankings. In other words, relationships, not links, are poised to become the top ranking factor. Search engines openly say they calculate a users authority and trust. A tweet, like, citation or mention from an authority user is going to go a long way in the future of SEO. So remember, links matter now and you need to have them to be successful. Don't stop looking for link opportunities. But I would stress that the link building of the future is going to be relationship building. People are going to influence rankings more than links do. So let's stop focusing on the link building and start focusing on the relationship building. I believe we'll all be better off for it.P.S. Don't miss Rand's great post Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect that he wrote after this post was initially written. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A New Perspective On Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A New Perspective On Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Deceuster\n          \n            Daniel Deceuster\n          \n            Daniel Deceuster"
}