{
  "url": "https://moz.com/blog/a-nonseo-view-of-how-to-get-blogged",
  "slug": "a-nonseo-view-of-how-to-get-blogged",
  "title": "A Non-SEO View of How to Get Blogged - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "TechCrunch has a post from last Friday - Top Ten Things You Can Do To Get Blogged - that explains carefully and simply how the company chooses Web 2.0 companies to be profiled or written about on their site. While this a...",
  "content": "A Non-SEO View of How to Get Blogged Link Building By: Rand Fishkin September 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 13, 2005 A Non-SEO View of How to Get Blogged Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. TechCrunch has a post from last Friday - Top Ten Things You Can Do To Get Blogged - that explains carefully and simply how the company chooses Web 2.0 companies to be profiled or written about on their site. While this applies to a specific niche of the blogosphere, the advice is universally adaptable and of great value to those SEOs who'd like their sites (and those of their clients) to be picked up and written about (with a nice accompanying link, of course). Here's just 2 of the great tips: Start a Blog. This is important for multiple reasons. First, it is an easy way for bloggers to see what you’ve done over time. It is also a good way for bloggers to find out about new releases and milestones via your RSS feed. Most company blogs have only a few subscribers – don’t let this discourage you. Those that have subscribed are keenly interested in what you are doing. It is very likely they have a blog. Make it easy for them and they will post about you. Be humble. The more humble you are, the more outstanding I assume your product is. Showmanship often equals desperation. I'd say that most of these rules apply to how I personally select sites to write about. Building a better mousetrap is one thing; finding a better way to get out the word - that's our job. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Non-SEO View of How to Get Blogged"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Non-SEO View of How to Get Blogged"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}