{
  "url": "https://moz.com/blog/a-piece-of-content-that-doesnt-deserve-to-be-linkbait",
  "slug": "a-piece-of-content-that-doesnt-deserve-to-be-linkbait",
  "title": "A Piece of Content that Doesn't Deserve to be Linkbait - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Either someone at the Web Advertising Blog is gaming the social media sites, or the bar on quality has dropped to fantastically low levels. Making its debut on Digg and del.icio.us/popular today was this absolute stinker - ...",
  "content": "A Piece of Content that Doesn't Deserve to be Linkbait Social Media By: Rand Fishkin October 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 17, 2006 A Piece of Content that Doesn't Deserve to be Linkbait Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Either someone at the Web Advertising Blog is gaming the social media sites, or the bar on quality has dropped to fantastically low levels. Making its debut on Digg and del.icio.us/popular today was this absolute stinker - How to Promote Your AdSense Niche Site. From the piece: Work on your Search Engine Optimization. Learn about on and off page optimization. Learn about keyword density, image alt tags, meta tags and link popularity. Search Engines are going to be a huge asset to driving traffic to your site. With a little effort you can find your niche site in the top 10 keywords. Start a reciprocal link campaign with other web sites in the same niche. Trade links or simply ask for a link to your site. You can do this for free with a links directory script to manage your links. Not only is the advice misguided and misleading (keyword density? reciprocal link scripts?), it's overly generic, poorly written and, in the end, useless. Yet they probably received 30,000+ visits today and Technorati is already counting up the blogs linking in. I can't prove it was spam, but I really hope that's the case. The alternative - that the readers of Digg & del.icio.us actually enjoyed the post, found value therein and wanted to share it, is too scary to contemplate. It makes no sense to me because some previous posts at that blog like this one on increasing feed subscribers and this one on maximizing blog page views are pretty decent. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Piece of Content that Doesn't Deserve to be Linkbait"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Piece of Content that Doesn't Deserve to be Linkbait"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}