{
  "url": "https://moz.com/blog/a-quick-approach-to-keyword-research",
  "slug": "a-quick-approach-to-keyword-research",
  "title": "A Quick Approach To Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting a starting point for your keywords is often very straight forward as they should relate to the area of business you are in, products you sell, or services you provide.  For the purpose of the example, we’re conducting keyword research for a company that is selling....Halloween…",
  "content": "A Quick Approach To Keyword Research Keyword Research By: Jonathan Walker November 16, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jonathan Walker November 16, 2010 A Quick Approach To Keyword Research Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. *Before you begin to read the article, please realise that this is a basic method of keyword research, specifically using Google’s Keyword Tool!* Getting Keyword Ideas Getting a starting point for your keywords is often very straight forward as they should relate to the area of business you are in, products you sell, or services you provide. For the purpose of the example, we’re conducting keyword research for a company that is selling....Halloween costumes! With that example, what keywords have you thought of? I imagine “Halloween Costumes” is one of them right? Perhaps “Halloween Costumes Shop” is another? Make a list of your initial keyword ideas and head on over to the Google Keyword Tool. I prefer the previous interface of the tool to the current one, so I choose that option from the right hand corner. Enter your keyword, i.e Halloween Costumes and press the get keyword button. You’ll be presented with a list of keywords and a few columns, change the \"Match Type\" to \"Exact\" and hide the following columns: \"Advertiser Competition\" and \"Global Search Volume\". I’d also click on the “Local Search Volume” column to sort them in order of most searched. What you’re left with now is a list of keyword ideas with their estimated search volumes in your country, we’ve chosen an “exact” match type to get a fairer reflection of the amount of people who are specifically searching for what you are offering. We’ve hidden the advertiser competition information as it is more relevant if you were considering running an Adwords Campaign. Assessing Keyword Difficulty Now with your list of keywords, if you are fortunate enough to have an SEOmoz pro account, insert your keyword into the keyword difficulty tool to be presented with information about the websites occupying the top spots for those keywords. If you don’t have access to the keyword difficulty tool, head over to SEOmoz’s Open Site Explorer and manually record the Page Authority, Domain Authority, the amount of linking root domains for the sites in the top spots. Here you’ll need to use some judgment, if the websites don’t appear to be particularly powerful (i.e a domain authority less than say 25) then potentially you could realistically overtake them in time.However if the top 10 results of the keyword you are researching is full of websites with a high domain authority, then you are likely to find that your battle to cement a place on that results page to be a struggle. I’d also take a look at the websites themselves and quickly try to determine how relevant they are to the keyword they are ranking for. In our example, I would be somewhat happier seeing general costume websites, with a broad amount of keywords throughout the site that rank for “Halloween costumes” than truly focused, dedicated “Halloween costumes” websites. You may find that your keywords are just too difficult to crack, for example if you were trying to offer SEO, I wouldn't advise you to target the keyword \"SEO\"!. I'd suggest you incorporate your geographic location (so an example would be SEO Cardiff), which would limit the amount of true competitors and should also mean that your website will be seen by those who are potentially a lot more interested in purchasing something from you/hireing you than those simply looking for information. Get An Insight! Armed with your keywords, take a look at Google insights, which will show you the months of the year when your keywords will be the most in demand. Restrict your results to only show the trends in your country and choose to view the information available from the past 12 months. Our example would be pretty obvious, with October being the peak time to buy Halloween Costumes, but you may find a few surprises. I’d also suggest that you scroll to the bottom of the insights page to view keywords that are being searched for more at the moment, you may get a few surprises that may also be worth targeting. Here you may find keywords that people are searching for, but your competitors are not targeting, if you can nail this, you could find your conversion rate soaring! Implement When you have a list of keywords that you want to target, its time to ensure that they are present on your website. For a Halloween costume shop, you could target three primary keywords on the homepage, i.e Halloween costumes, scary Halloween costumes & cheap Halloween costumes (remember to limit yourself to 70 characters in the page title and that branding may be important to you!) and then target additional keywords on the most relevant pages (i.e targeting “ladies Halloween costumes” on a ladies Halloween costume page would be logical!). Due to many people finding it easier to gain links to the homepage of their website, many people will place the keywords with the highest search volume on the homepage of their site, others will double up some of the keywords in the page title on the homepage and targeted page in an attempt to gain two ranking positions in Google’s results – there is no real right or wrong way here, but for credibility (and to fit into Google’s guidelines) don’t make your keyword usage look spammy! So there you have it, a quick and simple approach to keyword research ! This article is written by Jonathan Walker, who has lead the way in terms of rankings for SEO in the Cardiff area for over four years. He now runs SEO Training courses and enjoys helping newcomers Learn SEO Go On Follow Me On Twitter! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Quick Approach To Keyword Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Quick Approach To Keyword Research"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Walker\n          \n            Jonathan Walker\n          \n            Jonathan Walker"
}