{
  "url": "https://moz.com/blog/a-review-of-the-international-search-summit-london-2009",
  "slug": "a-review-of-the-international-search-summit-london-2009",
  "title": "A Review of the International Search Summit London 2009 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier this month I had the pleasure to attend the International Search Summit for first time. This conference, org...",
  "content": "A Review of the International Search Summit London 2009 SEO Events By: David Carralon December 4, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: David Carralon December 4, 2009 A Review of the International Search Summit London 2009 SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Earlier this month I had the pleasure to attend the International Search Summit for first time. This conference, organised by Web Certain, focuses on International search. I made the day trip from Paris, where I have my independent search marketing consultancy. Paris-London is now only a 2 hours and 15 minutes trip on the Eurostar. The location for this conference was also very convenient for those arriving at London St Pancras train station: the British Library. I only had to get off the train, walk a few metres and there I was, perfect! The event was as fulfilling as any other SEM event I had attended this year. The international focus of the event made it very interesting for me because of my SEO role at the British Council, where there is a situation of 100 country websites and over 400 project-based or sub-branded sites. This is the first conference I have attended this year where I have not bothered taking lots of notes. Instead, I logged onto tweetdeck and started twittering some of the highlights of the various presentations. This was my first time live-blogging experience on Twitter, it was good fun. If you care looking at the twits from the event, the tag was #isslon. Global Search Strategies by Bill Hunt Without any doubt, one of the best sessions was ‘Global Search Strategies’ given by Bill Hunt of Back Azimuth Consulting: 60% of all Google searches happen in a language other than English Do not ever translate keywords and expect them to be the right ones to target. The only way to get your keywordsright is carrying out Keyword research individually for each language concerned. The most known/practised country detection methods are: TLD (top level domain), IP address and correct use of the language tags : <html lang =\"de\"> or <html lang =\"en-gb\"> if English is from the UK Bill forewarned about using IP detection default location methods to direct users to specific content. The danger is that this might keep the crawler from finding your local content if the crawler comes out of say, Mountain view (California) or Zurich and your content seems to be aim to Spanish visitors. Read more about it on this article Bill wrote for Search engine land The ‘SEO’ department has to work closely and in an integrated way with all other departments to ensure that the organisation makes the best of their investment in online marketing. Overall, a great lesson of good SEO practice. Microsoft’s presentation about Bing This presentation was given by Peter Maxim from Bing. The topic for the session was: Beyond Blue Links: key consumer insights that have shaped Microsoft’s search strategies and the development of Bing. The main focus of this presentation was ‘bing’, as a search engine capable of facilitating quality search results in a timely manner. Apparently, only one 1 in 4 searches deliver successful results. Bing is there to counteract this problem. Thank you Peter for letting us know how serious Bing is about bringing quality to the search results. I would have loved to see a demostrations of the new Bing Webmaster tools and how those can help international search corporate efforts. International Keyword Research by Andy Atkins-Krüger Andy, CEO at WebCertain spoke about one of the subjects he is best at: keyword research in an international context. Andy explained the need to try and find out the keywords that are popular with your target audiences. It is easy to find the grammatically correct translation for a specific term in the dictionary, but that doesn’t mean that your customers will use that term. Andy wrote a great article for Search engine watch last summer about why keywords should never be translated, which I bookmarked and keep referring people to. It is worth taking into account the complexities of every language, its linguistic keyword expansion, the possibilities for keyword misspellings, accents, plurals and how those factors can affect your competitive advantage. A relevant article to Andy's presentation is the one he wrote on SEW a few days ago on how keywords affect the longtail. The international challenges of Local search by Will Critchlow Will Critchlow from Distilled and his brother Tom Critchlow both organised and spoke at the SEOMoz Pro training seminar last month. I wrote a post about my top takeaways from the event on my own blog. Will explained that Google actually suggests some ways to verify local listings in multiple countries. These are not flawless but they can be a good start. He added that local search is currently being spammed by many SEOs and went on to give examples about typical scams on Google search: eg book yourself into a hotel and get the google local business verification postcard sent to the hotel to illegally claim the local listing. He then gave some tips to optimise for visibility on local search: reviews, avoid capitalisations, get citations… Universal Search and Digital Assets optimisation Anne Kennedy from ‘Beyond Ink’ spoke about about the importance of universal search, the benefits of optimising for Universal search results (people get the information much more quickly on visuals). Throughout her presentation she used the term DAO (digital asset optimisation), a brand new acronym that I had not heard about. Eye tracking search technology shows evidence that user scanning behaviour reflects a mix of vertical results on SERPs Anne advised us to enable \"enhanced image search\" in GWMTs account, which I personally never do, so this was a good tip for me. And lastly, embed your digital assets in text for better results. Brand Reputation Management by Massimo Burgio Massimo spoke about brand reputation management, the fear & opportunity of social media, the search for buzz and about the new brand reputation management tool powered by global search interactive, Massimo’s own search agency. The enabling tecnologies for Massimo’s new brand reputation management tool are Wordpress and RSS. The presentation given by Massimo was entertaining as expected though apparently last’s years one was a lot more agitated. One of Massimo’s most known points is starting a dialogue with the online audience : participate, listen, and measure. Check out his presentation on Massimo’s slideshare profile area. Panel debate - What is the best type of link? On the panel we had Alex Chudnovsky, founder of Majestic SEO and Andy Langton from Receptional. The debate revolved around the various different types of links, during which some of the expected questions came up: paid links and whether they are a good strategy or not. The reality is that in some sectors most of the top ranking companies buy links and if they don’t, they fall behind and their business is affected. Someone in the audience asked if there is potentially a possibility that nofollow links may be taken into account by Google somehow if not directly in its ranking algorithm. Another questions that came up was whether 301 redirections are discounted of some value. There were no straight answers to those questions; instead they triggered a good debate and conversation between the panel and the audience. Advanced Link analysis using Majestic SEO by Dixon Jones. This was purely a showcase of MajesticSEO as a link analysis tool, which I very educational, I knew about Majestic SEO but had never seen a showcase of the product in a practical and informative way. While some may argue that this was a sales presentation, I would say, yes, perhaps it was but for me it was still very useful. So far, the tools I have been using for the purpose of link analysis is Linkscape and Advanced Link Manager, which are different between themselves, so why not compared with a third one to get some further insights to which works best for you? Throughout the slides used by Dixon I learned that you can Use the folders facility within Majestic SEO to keep up with the verticals Use the Link Reclamation feature: majestic equivalent to SEOmoz’s top pages reports Get potential sources for getting links from: the equivalent of link juice finder from SEOMoz Get comparing link quality reports At the end of the showcase I ask Dixon what the best selling point of Majestic SEO was in comparison to Linkscape, in his own opinion? Dixon replied saying that Linkscape is also a very good tool, but a good plus point from Majestic SEO is the vast amount of data it deals with: 3.1 billion pages. See Dixon’s slides on this Majestic SEO blog post Using online PR for links by Kristjan Mar Hauksson Some top tips from Kristjan with regards to Online PR are: produce two or three versions of the same press release if you plan to distribute via different channels write it short and scannable make sure you do the keyword research and apply the right terminology to the PR don’t spam it with links: two or three will do nicely A good question from the public was: ‘is there a duplicate content problem if you put the press release on your own site after having distributed it over various channels?’ Kristjan replied saying that it was best to put the press release on your website first. This is a presentation that generated a fair amount of interest from the audience. Search in Japan by Motoko Hunt and Koichiro Fukasawa I personally love to see datasets about search engines and usage trends in other countries but who has the time to compile loads of data into some practical pointers. Makoto did just that, so this was a unique opportunity to get a first hand view of search in Japan. According to Makoto, e-commerce is huge in Japan, as well as high speed internet penetration, mobile internet and mobile usage. Some useful figures: E-commerce generates $35.85 billion Japanese character-based domain names will be out soon. 9 out of 10 japanese use the mobile web More than a third are on a flat-rate ‘all you can eat’ plan 80% of them are on 3G Japanese mobile phone users use their mobile phones for plenty of things: watching TV, paying for tickets, drinks and food, scanning codebars to avoid having to enter urls, apart from making make phone calls SEO is a growing SEM technique, and so is SMO (social media optimisation) Yahoo has the lion's share of the search engine market with a 53% market share. Google takes up the remainder 47%, which in my view, is not too bad considering Yahoo's dominance. Having been to Japan on a pleasure trip at the beginning of November, I had the chance to personally get impressions/opinions from some Japanese friends about the internet and search engines. Their general impression was that Google had no chance in Japan as Yahoo was giving the Japanese the right products at the right time. They all spoke very keenly about Yahoo! and not so much about Google Some challenges about doing SEO in Japan are: Japanese alphabet doesn’t require having spaces to separate words, it makes it more difficult for search engines to be able to understand keywords. Japanese alphabet is made of four different alphabets, so this adds to a linguistic complexity that search engines need to overcome in order to be able to return quality results. Koichiro Fukasawa from Wasabi Communications took over from Mahoto Hunt and he began the presentation explaining that as the market geared towards an increased use of the internet on their mobile phones, it would not be a bad idea to focus on Yahoo! Mobile or Google mobile! instead of putting all resources on the more mainstream search engines. Kochiro explained that good old site SEO is still effective in Japan and that search engine algorithms not being as effective and sophisticated as the PC search engines. As an example, acquiring links from major directories (eg: Yahoo! Business Express Mobile) is still an SEO tactic that works very well. Some other mentioned MUST directories are: J-Entry, X-recommend, Sitelist, Google directory (DMOZ). There are some interesting resources on Japan in the attached pdfs Optimising for Baidu by Ching-Yun Huang from Web Certain Baidu is the most popular search engine in China. Unlike Yahoo in Japan, Baidu actually has a the largest market share by difference: 73.20% Google: 20.70% and Yahoo, Sogo and other ones : 6.10% Total internet users in Japan: 380 million, of which 281 are using on Baidu The main reason why Google cannot beat Baidu is to do with the language. As Baidu understands the linguistic complexities and technicalities of Traditional and Simplistic Chinese, it is able to return much more relevant results than Google. Baidu also has keyword research tools to enable Search professionals to perform their keyword research and target their keywords, but how do you really optimise for Baidu? Ching-Yun actually got to the point with giving out tips: Get hosted in China and choose the right host: China Host seems to be the preferred vendor Use ‘simplified Chinese’ as opposed to ‘traditional Chinese’ Create unique text content and have native speakers to translate your sites Avoid using flash, javascript, frames and iframes, it makes sense! Make sure the target keywords appear on the right areas in your pages: titles, headings, main content, anchor text of internal links Also ensure that your off page optimisation efforts include getting inbound links from high authority sites with the right anchor text Ensure that you have outbound links to sites related to yours too Ching Yun Huang went on to giving other tips about KW research tools, Search in Holland by Bas Van den Beld from Search Cowboys.com Being Search cowboys one of my favourite SEO blogs and Bas Van den Beld one of my favourite columnists, I could have not missed this session. Bas focussed his presentations on the Dutch as a nation. The Dutch have their own cultural peculiarities and if you are interested in doing well on the Dutch search engines, you need to know the Dutch. Some facts: 17 million people live in the Netherlands As in the majority of West Europe countries, Google has the largest market share: 94% 85% of the Dutch are online, probably above the market European average (14 million). The Dutch are very opinionated people and according to Bas they like to complain and like to feel that they are right. The Dutch are multilingual and are proud of it, although they of course like their own language 80% has a mobile phone The Dutch like to trade and find a good deal They like privacy but also like to know what their neighbours are doing, they don’t like cookies They use Google but they also use home-made online verticals (eg: Hyves, a popular social media site competing with facebook, Marktplataats the Dutch equivalent to eBay) View Bas's presentation How to target Latin American Markets by Ana Leckenby from Web Certain Nowadays 61% of Spanish users come from Latin America (not including the Caribbean) It is very easy to fall in the mistake to think that traditional Spanish can be applied to the Latin American context, particularly keywords. The same applies to Portuguese spoken in Brazil, highly influenced by north American culture. Although website copy can be reused and partially repurposed for use in LatinAmerican websites, keyword research needs to be carried out individually in every country. Keywords can be substantially different from one neighbour country to another as sharing the same language doesn’t mean that cultures and expressions are the same. Ana gave illustrated this with some goog examples. Eg: ‘renta autos’ in Mexico vs ‘alquiler autos’ en Argentina The myth that Latin America is an under-developed continent packed with dusty towns, guys looking like Antonio Banderas in Desperado and unstable governments and economies is immediately dispelled by Ana during her presentation. Since 2000, there has been a 800% growth in the use of the Internet. About 74% of internet users still do not understand the difference between organic and paid search results. 85% do not go to the second result pages as they think that the top 10 results represent the leading companies. 56% of the content found on the Internet comes from Spain and 10% from the US, so there is a lack of local content There exists still a degree of mistrust in buying over the internet as payment methods do not make the population feel 100% confident about placing credit card details on e-commerce websites Tips: It’s the moment to do SEO as a lot of companies are still not aware of the concept SMB find SEO very expensive and cant see how they will benefit from it Paid search has very low CPC in Latam and huge volume, so great opps for pioneering search marketers (£0.20 per click or less) There is a good average conversion rate in PPC If you have to use one single website to target all Spanish speakers in Latam, use neutral Spanish People do not search with accents, however they expect to see them in the website copy The leading markets in Latam are Brazil with 67 million users and Mexico with 27 million users.With Spanish being my mother tongue, I found this presentation highly educational. Here's some dos and dont's to be aware of if you are concerned with doing Search marketing on Latam markets: Managing Websites across multiple markets by David Sowerby David Sowerby from Straker Software spoke about the need to focus on international search and international markets to respond to their major changes in the world such eg: global economy. However, translation seems to be a business area that has not changed much in the last few decades. The ordinary translation workflow process is time consuming and the answer to that may be ‘Machine translation’ (MT) with an element of human review. This presentation made me raised my eye-brows as I would have not expected MT (Machine Translation) technology to be thought of as an enterprise-level solution to the multilingual needs of large organisations. David Sowerby's was the last of the speaking sessions. If you would to read more about this event and the various presentations, visit the event’s official blog: Multilingual Search . Overall ISS was an enriching experience that enlightened my knowledge a bit further and gave me the opportunity to keep abreast of the latest news on international search. There was also a fair amount of networking time during the breaks and some drinks at the end of the event, so I managed to network a bit with some members of staff from Web Certain: Gemma, Peter, Andy, Ana, other speakers like Massimo and attendees: Oscar Carreras, SEO manager at Hotels. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Review of the International Search Summit London 2009"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Review of the International Search Summit London 2009"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Carralon\n          \n            David Carralon\n          \n            David Carralon"
}