{
  "url": "https://moz.com/blog/a-reputation-20-problem",
  "slug": "a-reputation-20-problem",
  "title": "A Reputation 2.0 Problem - Wiki-Circularity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What with it being Labor day in the US yesterday, it should have fallen on the trusty global associates to put together something for the SEOmoz blog. Unfortunately we were working instead :(\n\nWaiting for the bus in the rain this morning was a fairly miserable start to the day, but what if it had…",
  "content": "A Reputation 2.0 Problem - Wiki-Circularity Branding By: Will Critchlow September 2, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow September 2, 2008 A Reputation 2.0 Problem - Wiki-Circularity Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's early on a rainy Tuesday morning here in London as I settle down to write the post I should have written yesterday... What with it being Labor day in the US yesterday, it should have fallen on the trusty global associates to put together something for the SEOmoz blog. Unfortunately we were working instead. I was hoping to hold the fort while the Americans slept before returning to work after the long weekend, but it turns out Rand never sleeps. Waiting for the bus in the rain this morning was a fairly miserable start to the day, but what if it had started worse? What if I had woken up this morning to find bad things written about me or my company on the internet? Years ago, we only really had to worry about what was printed in the newspaper and what people said to each other (you know, person to person – in real life – which doesn't scale all that far). These days, the power of the great world wide web means that people whining to one another can become a search result for your name for ever more. At the expert seminar a couple of weeks ago, Duncan and I talked about two things that have been taking up a lot of our time here at Distilled HQ – international SEO and online reputation management. This morning, I wanted to talk about a particularly pernicious reputational challenge that we have seen recently and which is very very hard to combat. It is something we talked about at the expert seminar, where we called it 'wiki-circularity'. While it isn't necessarily limited to Wikipedia, it's one of the easiest examples. Here's the scenario: You keep your nose clean, behave well, have a wiki page ranking for your name with nothing untoward on it (we'd generally class this as a 'neutral' result in a reputation audit). Someone (malicious or misguided) writes something untrue (or even libelous) on the Wikipedia page Mainstream media pick up the story (“checking their facts” on the internet) Fictitious story appears on powerful newspaper website (of course, they don't reference Wikipedia –they want to look like they researched the story) So far, so reputation 2.0. The kicker comes in the final step: Wikipedia gets updated to reference the mainstream media story Your SERPS now contain a negative result (the wiki page – even if the news story doesn't rank), and unlike in many situations, you have done nothing to deserve it It is now almost impossible to convince a wiki editor to remove the reference as they tend to assume the sanctity of “real” media – an assumption that breaks spectacularly when “real” media is getting their stories from Wikipedia. What can you do about it? Unfortunately, as outlined above, once the circle is complete, it's hard to do very much about it (try some high-powered legal advice – you probably want the page removed from the newspaper website rather than just a retraction elsewhere on their site). This makes it all a powerful argument for monitoring your reputation and that of your business online so that you get a chance to do something about it early. If you don't have the information, you are dead in the water. For most people and businesses it takes hardly any time to skim everything written about you every day – and for higher profile brands it is definitely worth investing in. Of course, we at Distilled have an online reputation monitoring tool, but I'm also going to give a shout out to other ways of doing your monitoring, such as Andy Beal's Trackur. Or, if you want to put more work in but do it for free, you can follow Andy's advice and monitor it all yourself. If you are monitoring then these kinds of untrue stories can often be quashed early on without recourse to legal action before everything explodes. If the situation does get worse and you have the circular issue happening to you, then this real-world example of a similar thing happening to Sacha Baron Cohen (in a relatively harmless way) shows how with a lot of detective work, the circularity can be broken. The real world It's easy to classify this all as a theoretical problem, but we have seen it in real life (those at the expert seminar got the story with names removed) in a situation where the story was completely untrue. High profile people are gradually becoming aware of these kinds of issue – I found it interesting to read that the new Republican VP candidate had some wiki-cleaning done the day before the announcement. I'd call that reputation 1.5. They have understood the importance but not the social nature of web 2.0 and the likelihood of getting called out. It seems that the edits were approached in a pretty upfront way – with high-quality changes referencing published sources, but simply the volume and proximity to major news were destined to risk red flags. Rand always steers people away from political discussion in the comments, so remember to discuss online tactics, not policy... Breaking celebrity reputation news On a different note, this morning I read a story about Soulja Boy having his online identity hijacked. I love his response to it. For a (expletive-laden, R-rated) lesson in how to respond to a reputation attack rapper-style, check out this story. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Reputation 2.0 Problem - Wiki-Circularity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Reputation 2.0 Problem - Wiki-Circularity"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}