{
  "url": "https://moz.com/blog/a-sneak-preview-for-mozcon-2015",
  "slug": "a-sneak-preview-for-mozcon-2015",
  "title": "A Sneak Preview of #MozCon 2015 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here's a sneak peek at our amazing speakers for MozCon 2015!",
  "content": "A Sneak Preview of #MozCon 2015 SEO Events | Moz News By: Erica McGillivray March 26, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray March 26, 2015 A Sneak Preview of #MozCon 2015 SEO Events | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Considering coming to MozCon, July 13-15 in Seattle this year? Maybe you're on the fence because you're not sure what's going on, and most importantly, what our amazing speakers are talking about? I hear you, MozCon fans! While the agenda is still being finalized, we wanted to give you a sneak preview. If you're like \"oh, shit, I forgot to buy my MozCon ticket!,” do so now: Buy your ticket! We're still finalizing a couple more speakers and topics, and of course, community speakers submissions are fast approaching. Keep your eye out here on April 2nd for more info! Adam Singer Analytics Advocate at Google @AdamSinger Adam Singer is Analytics Advocate at Google, startup adviser, investor, and blogger. He previously was director for a global consulting team and has provided digital strategy for brands in a variety of industries including marketing, technology, healthcare, and more. Topic: Digital Analytics: People, Process, Platform In a data-driven world, Adam will pull you back to think again about your analytics, best practices, and how you report. Cindy Krum Founder and CEO at MobileMoxie LLC. Twitter: @Suzzicks Cindy Krum is the CEO and Founder of MobileMoxie, LLC, and author of Mobile Marketing: Finding Your Customers No Matter Where They Are. She brings fresh and creative ideas to her clients, and regularly speaks at US and international digital marketing events. Topic: Become a Mobile SEO Superhero With Google's algorithm mobile change, Cindy will walk you through the changes, what they mean for your site and its rankings, and what you should be focusing on going forward. Courtney Seiter Head of Content Marketing at Buffer Twitter: @courtneyseiter Courtney Seiter examines social media and workplace culture at Buffer, and her writing has been published at TIME, Fast Company, Lifehacker, Inc., and more. She lives in Nashville, where she is a founder of Girls to the Moon, a leadership camp for girls. Topic: The Psychology of Social Media Courtney dives into the science of why people post, share, and build relationships on social media and how to create an even more irresistible social media experience for your audience. Dana DiTomaso Partner at Kick Point Inc Twitter: @danaditomaso Whether at a conference, on the radio, or in a meeting, Dana DiTomaso likes to impart wisdom to help you turn a lot of marketing bullshit into real strategies to grow your business. Dana is also a fan of the random fact. Kick Point often celebrates \"Watershed Wednesday\" because of her diverse work and education background. In her spare time, Dana drinks tea and yells at the Hamilton Tiger-Cats. Topic: How to Make Your Marketing Match Your Reality Too often, the tone and promises of marketing don't match those of the business itself. Dana will help you bring your brand identity together, both in-store and online. David Mihm Director of Local Search Strategy at Moz Twitter: @davidmihm David Mihm has created and promoted search-friendly websites for clients of all sizes since the early 2000’s. David co-founded GetListed.org, which he sold to Moz in November 2012. He now serves as Moz's Director of Local Search Strategy. Topic: Astoundingly Useful Applications of Facebook Search for Marketers Facebook has long neglected its potential as a local search giant, and as a result, its Graph Search product is an afterthought for too many marketers. David showcases Graph-powered insights for small-business marketers—with utility well beyond Facebook. Joanna Wiebe Creator at Copy Hackers Twitter: @copyhackers The original conversion copywriter, Joanna Wiebe is the cofounder of Snap and Copy Hackers, where startups learn to convert like mofos. She is a natural-born thief who steals messages from the mouths of customers and turns their words into higher-converting copy. Topic: Sinners Are Winners: How Messaging Your Prospect's Darkest Desires Can Boost Engagement Playing it too safe? Joanna will show you how to tap into your prospects' secret wishes in your copy—and use bold messages your competitors wouldn't dare use. Kristina Halvorson Founder at Brain Traffic Twitter: @halvorson Kristina Halvorson is widely recognized as one of the most important voices in content strategy. She is the founder of Brain Traffic, the coauthor of Content Strategy for the Web, and the founder of the Confab content strategy conferences. Topic: How To Do Content Strategy (Probably) Put 10 people in a room and ask them to define “content strategy,” and you’ll likely get 10 different answers. Kristina will share her own tried-and-true approach! Lexi Mills Head of Digital at Dynamo PR Twitter: @leximills Lexi Mills is a PR SEO specialist, with over eight years experience working with both small firms and big brands. She has designed and implemented integrated PR, SEO, content, and social campaigns in the UK, Europe, and USA for B2B and B2C clients. Topic: Marketing Innovations: Creative PR, Content, and SEO StrategiesLexi shows you how to apply strategies used in emerging markets to grow the success of your PR, SEO, and content work from bathrooms to rock bands. Marshall Simmonds Founder and CEO at Define Media Group, Inc. Twitter: @mdsimmonds Marshall Simmonds is the Founder of Define Media Group, the enterprise audience development company specializing in strategic search and social marketing. Define works with many of the most influential brands and networks in the world. Topic: Dark Search and Social—Run Rabbit Run! With data from 112 publishers with 164+ billion page views, Marshall will dive into the challenges of tracking social and search campaigns. He'll focus on history's lessons and what’s happening with direct and mobile traffic in an app-heavy world. Marta Turek Senior Digital Marketing Programs Manager at ROI·DNA Twitter: @MTurek Marta holds seven years of experience in digital advertising, specializing in lead generation, and paid search marketing. Developing digital strategies and telling stories through data is what rocks her boat. Topic: Too Busy to Do Good Work Don't let your work suffer from being busy. Instead, let Marta show you the tactics to clean up your PPC processes to finally get more strategic. Matthew Brown Head of Special Projects at Moz Twitter: @MatthewJBrown Matthew runs Special Projects at Moz. This has been going on for two years, and we're still not totally sure what that means. Topic: An SEO's Guide to the Insane World of Content Find yourself arguing whether or not SEO is just great content? Matthew will talk through a strategic and tactical journey of content strategy from an SEO's viewpoint and leave you with new tools and tactics. Pete Meyers Marketing Scientist at Moz Twitter: @dr_pete Dr. Pete Meyers is Marketing Scientist for Moz, where he works on product research and data-driven content. He has spent the past three years building research tools to monitor Google, including the MozCast project, and he curates the Google Algorithm History. Topic: Surviving Google: SEO in 2020 Organic results are disappearing, replaced by Knowledge Graph, direct answers, new ad hybrids, and more. How can SEOs be ready for Google in five years? Purna Virji Founder and CEO of Purview Marketing Twitter: @purnavirji Purna is the founder and CEO of Purview Marketing, a boutique consulting firm helping companies of all sizes grow via search and content marketing. Purna is an avid traveler and speaks six languages (and can swear in 17!). Topic: How to Better Sell SEO to the C-Suite Whether you need more resources, trust, or buy-in, Purna will share practical tips for focusing on Profit & Loss and better communicating SEO planning, forecasting, and strategizing. Rand Fishkin Founder at Moz Twitter: @randfish Husband of Geraldine. Founder of Moz. Presenter of Whiteboard Friday. Writer of blog posts. Sender of tweets. Topic: Onsite SEO in 2015: An Elegant Weapon for a More Civilized Marketer SEO has come full circle as on-page SEO has returned to the forefront. Rand will share how and why on-site SEO is so important and show off uncommon tactics with powerful potential. Richard Millington Founder at FeverBee Twitter: @RichMillington Richard is the Founder of FeverBee, a community consultancy, and the author of Buzzing Communities. Topic: Reaching Critical Mass: 150 Active Members Imagine you could create and rejuvenate a successful community whenever you like? Richard Millington will take you through a step by step action plan to reach critical mass. Wil Reynolds Director of Strategy at Seer Interactive Twitter: @wilreynolds Wil Reynolds founded Seer with a focus on doing great things for its clients, team, and the community. His passion for driving and analyzing the impact that a site's traffic has on the company's bottom line has shaped SEO and digital marketing industries. Wil also actively supports the Covenant House. Topic: The Time to Do the Web Right Is Incredibly Short In \"web time,\" competitive advantage can be lost in an instant, speed matters. Wil shares how keep on the pulse of competitor agility and how to get things done to stay ahead of them. In addition to fabulous days full of great content from extraordinary minds, we're also cooking up three nights of great fun, networking, and MozCon love. Monday night, our partners will be hosting a pub crawl in Seattle's Belltown neighborhood with special prizes for those who hit every spot. Tuesday night, we're doing a networking event, featuring you, the community, and your passions besides marketing. Details to come as they're finalized! And finally, Wednesday night, we'll say 'see you next year' with our traditional party at the Garage: karaoke, bowling, pool, and chilling with friends. Questions about MozCon? I'm happy to answer them in the comments. See you at MozCon, friends! Buy your ticket! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Sneak Preview of #MozCon 2015"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Sneak Preview of #MozCon 2015"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}