{
  "url": "https://moz.com/blog/a-sneak-preview-of-the-london-pro-seo-seminar-2010",
  "slug": "a-sneak-preview-of-the-london-pro-seo-seminar-2010",
  "title": "A Sneak Preview of the London Pro SEO Seminar 2010 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tickets are on sale for the London PRO seminar on 25th and 26th October. With two days of unbeatable advanced SEO advice, a classy party and personal access to top speakers, you should get your tickets before they sell out.\n\nRead on to learn about how we are shooting for an even higher standard…",
  "content": "A Sneak Preview of the London Pro SEO Seminar 2010 SEO Events By: Will Critchlow August 22, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow August 22, 2010 A Sneak Preview of the London Pro SEO Seminar 2010 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'd like to invite you to the London Pro SEO seminar we are running on the 25th and 26th October. With a 98% satisfaction rating and 95% of attendees recommending it to others, we were blown away by the positive feedback we received last year. Seasoned pros like Rob from Easynet Connect called it the \"highlight of the year\" and we have plenty more where that came from (see for example: \"a must attend event for any SEO professional\" --PricewaterhouseCoopers). This year we are aiming to put together something even better. Just like last year, we expect it to sell out, so if you are already sold on coming, I would recommend booking now. The Details: Where: The Congress Centre in London's West End When: October 25th and 26th Price: £699 +VAT (plus optional super-exclusive breakfast with the speakers @ £149 <-- this is very nearly sold out so be super-quick if you want to come to this) Book: now! If you are an SEOmoz PRO member, you can get access to special pricing by using the code in the discount store - making it a steal at £499 +VAT / person. Get your ticket now! If you haven't been before and don't know anyone who has, then I figure I need to do a little more to convince you. Here are three big reasons to come: #1: just look at this schedule The full schedule (note: of course with two months to go, it's possible some of the details of this could change) will look something like this: Dueling laptops: Live site reviews Speakers: Rand Fishkin, Tom Critchlow and Stephen Pavlovich (of Conversion Factory) Live and in-person, a simultaneous review of on- and off-site factors as well as conversion rate tips for members of the audience Site architecture and faceted navigation Speaker: Duncan Morris With design patterns like “mega nav” and filtered searching becoming more popular, how can you offer all the options you want without descending into duplicate content madness? Head to head: Reputation management in a real-time world Speakers: Will Critchlow vs. Rand Fishkin Although the big vote will be saved for the end of the second day (see below), we thought there might be a few bragging rights to be won on one of the trickier topics in the line-up. Reputation management is rapidly changing and difficult. Presenting about it is hard both because of those factors and because case studies tend to be highly secret. We'll be egging each other on to share our best ideas here. Advanced linkbuilding Speaker: Wiep Knol One of the world’s leading linkbuilders letting us inside real campaigns and showing us what actually works. 'Nuff said. Overcoming Twitter’s cannibalisation of the link graph Speaker: Rand Fishkin Rand has written about the problems introduced for SEOs by the changing user behaviour that has us all creating content and links on social media sites rather than on our own blogs. What should you do about it? Good question - let’s hope Rand has the answer. How to hire SEOs Speaker: Tom Critchlow You might have noticed Distilled growing quite a bit recently. Tom and Duncan have been honing the interview process, whittling candidates down and learning where to advertise for the best results. Whether you are looking for a job or hiring, you will learn the tricks of the trade that have worked for us. SEO vs. Google Speaker: Dave Naylor of Bronco With Google increasingly ranking their own features and properties within organic search, you might find the SERPs you care about so full of universal stuff, you can’t find the organic results. If you find yourself in that situation you need the kind of creativity that only Dave can bring. Sexing up your reports Speaker: Will Critchlow Doesn’t sound that interesting, but if you have a boss or clients, I promise this will be one of the more actionable sessions of the two days. Integrating development and SEO Speaker: Alex Craven of Bloom Media Bloom build and run websites for some of the largest online brands in the UK. Alex is going to cover the details of how they integrate SEO deep into that process, deal with customer sign-off and change requests without screwing things up and generally make us all better at our jobs. Data journalism Speaker: Russell Smith of The BBC(!) This is what your pansy infographics would be like if they had the might of the BBC behind them. When you’re under that kind of scrutiny, you learn a load of lessons. The shortcut to learning those lessons is to get out of bed on the second day and come hear Russell speak. Keyword research - the ultimate process Speaker: Richard Baxter of SEOgadget I think this is the session I am personally most excited about. Rich is truly a king of the keywords. He has never even told me the full details of his in-depth keyword research process, but he’s going to “give away the farm” (his words). Understanding your competitors keyword, link and content strategies Speaker: Sam Crocker of Distilled Being surrounded by these kind of industry veterans could be pretty intimidating. If you saw Sam speak at SMX London, you know that he’s not scared. Backed by the insights of the full Distilled consulting crew, there’s going to be some great stuff in this one. Top 10 tips Email Speaker: Tamara Gielen We thought we should break up the SEO geekfest a little with some nuggets from related fields. The first of these comes from Tamara who brings email marketing insights from eBay and is going to share tips and tricks you can use in SEO. CRO Speaker: Stephen Pavlovich Next up is Stephen whose definitive CRO guide on the SEOmoz blog was one of the most popular of the year so far. Design (TBC) The maths of SEO Speaker: Ben Hendrickson of SEOmoz I introduced him last year as the smartest guy in the room and I fully anticipate that being true again this year. Ben is the guy behind the moz-metrics and he is going to be walking us through Latent Dirichlet Allocation and (hopefully) how an understanding of it can make you better at your job. Building the perfect analytics account Speaker: Will Critchlow I have given dozens of presentations on analytics, but it’s only at our own event that I get the freedom to pull everything together and present my views on the metrics that are important, and those that aren’t, the hacks you need and the ones you don’t. How lessons from sales can make you a better SEO Speaker: Caitlin Krumdieck of Distilled Caitlin is Head of Sales at Distilled, but this session won’t have a single second of pitching in it (if I can keep her under control). Instead, Caitlin will be sharing her skills and insights into how sales skills can help you win budget, convince sceptical development teams and build links. I think I used to do OK running new business at Distilled. Caitlin is better than me. You’ll want to hear her speak. SEO in competitive niches Travel Speaker: Richard Baxter Alongside the keyword insights he’s going to be sharing, we thought it was only appropriate that Rich went back to his roots and shared some of his thoughts and experiences of the uber-competitive travel sector. Three other sessions with exact details TBC but including insights from Jane Copland of Ayima, Patrick Altoft of Branded3 as well as Martin MacDonald from Seatwave (MOGmartin here on SEOmoz) Big budget linkbuilding: head to head Speakers: Will Critchlow vs. Rand Fishkin What can you do to build links if you have lots of money? You can buy them, obviously... Is that going to be all we come up with? You have to come along to find out. You have to figure Rand’s going to bring his A game - he must really want to win one by now... #2 See Rand get whupped (again)(*) One of the things we do to get the quality as high as possible is to look at the list of subjects, pick the subject that we thought might be hard to make interesting but that we felt was important to cover and make it a presentation-off (hence the Reputation Management session). By making it competitive, we make sure we put in twice as much effort. Rand and I have now gone head to head twice. The first time I beat Rand, he helped me make the announcement to a packed lecture hall that my first child was on the way by giving me a present of a babygro saying \"my dad beat Rand Fishkin\": My daughter loves wearing it and wore it when she met Rand for the first time some months later: (*) yeah, I'm 2-0, but only in London - the first US test comes in just over a week at the Seattle seminar. I'm nowhere near as confident about either of them as my bluster makes it sound. #3 The focus on adding value for experts If you feel like you know most of the stuff being said at most conferences (or could even give most of the presentations), then the Pro seminar is for you. I learnt loads last year and envisage learning even more this year. I encourage our speakers (none of whom are slouches when it comes to this stuff) to do new research, learn new things and come up with interesting stuff to say that no-one has heard before. I'm pretty sure that people who came last year will back me up on this in the comments below. Bonus #4 Networking and fun Exclusive breakfast with the speakers (if you book early enough), a party for everyone at The Circus (no, not clowns on unicycles - seriously - check out their photo gallery), no expo hall, no multiple tracks, loads of chances to pick the brains of the top minds in SEO - both speakers and attendees. Were you paying attention? Here's the details again. The Details: Where: The Congress Centre in London's West End When: October 25th and 26th Price: £699 +VAT (plus optional super-exclusive breakfast with the speakers @ £149 <-- this is very nearly sold out so be super-quick if you want to come to this) Book: now! If you are an SEOmoz PRO member, you can get access to special pricing by using the code in the discount store - making it a steal at £499 +VAT / person. Get your ticket now! A big part of the value of the event is the quality of the other attendees you get to meet, so if you're coming, please do spread the word (why not start with Twitter!). I hope to see you there. If you can't make it out to London, I understand that there are still a handful of tickets available for the Seattle seminar where both Tom and I will be speaking in a little over a week. We're in town for almost a week so hopefully we'll see some of the rest of you there. In the meantime, normal service will be resumed with some less promotional posts :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Sneak Preview of the London Pro SEO Seminar 2010"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Sneak Preview of the London Pro SEO Seminar 2010"
    },
    {
      "level": "H1",
      "text": "Get your ticket now!"
    },
    {
      "level": "H2",
      "text": "#1: just look at this schedule"
    },
    {
      "level": "H2",
      "text": "#2 See Rand get whupped (again)(*)"
    },
    {
      "level": "H2",
      "text": "#3 The focus on adding value for experts"
    },
    {
      "level": "H2",
      "text": "Bonus #4 Networking and fun"
    },
    {
      "level": "H1",
      "text": "Get your ticket now!"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}