{
  "url": "https://moz.com/blog/a-social-media-tool-that-youll-actually-use",
  "slug": "a-social-media-tool-that-youll-actually-use",
  "title": "A Social Media Tool... That You'll Actually Use! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, I received an email from Christ Bennett at 97th Floor, telling me about an awesome tool they were due to release tomorrow (now today, obviously), that lets you tell how many times a page you're currently viewing has been submitted to / voted upon at the four biggest social media…",
  "content": "A Social Media Tool... That You'll Actually Use! Social Media By: Jane Copland September 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland September 13, 2007 A Social Media Tool... That You'll Actually Use! Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday, I received an email from Christ Bennett at 97th Floor. He told me about an awesome social media tool they were due to release tomorrow (now today, funnily enough), that lets you tell how many times a page you're currently viewing has been submitted to / voted upon at the four biggest social media services. However, far from being just a Firefox toolbar extension, the tool also shows up on Digg, Reddit, StumbleUpon and del.icio.us pages to show you how many votes (or reviews, in the case of StumbleUpon) each individual story has received at the other three sites. The counts from the other sites will show up on all the pages within the site, not just the homepage stories. Due to many social news sites' practice of awarding credit to the person who first bookmarks or submits a page, this tool could be amazingly valuable to people intent on beefing up the strength of their social media profiles. As you can see above, a few of the del.icio.us entries have no votes ore reviews at Reddit or StumbleUpon. Admittedly, they may have been submitted to Reddit and downmodded to 0 (it happens more regularly than you'd think), but you're also likely to have come across a URL that takes you from 1 to 100 Reddit karma points in a day, which never sucks. The toolbar you add to your Firefox browser has a number of bonuses. Firstly, it has two different settings for how you'd like it to deliver you information: after right-clicking on the far-left box that reads \"Manual,\" you can choose either this setting or Automatic. Using the Manual setting means that you have to click the manual button in order to get the information for the page you're currently viewing. This is the best option for when you're surfing and want to check the status of an individual page: it guarantees that you're not viewing the statistics of another URL. Set the toolbar to Automatic when looking at Digg, Reddit and del.icio.us so that the icons show up next to the stories. Another awesome feature? If you're viewing a page and wish to give it a Digg, Reddit upmod or del.icio.us bookmark, you can do so simply by clicking the icon of the service through which you want to promote the page. No word yet on whether Digg will blacklist referrals coming from the toolbar, but they're not known for their tolerance of external apps that make digging content easier. Clicking the StumbleUpon icon takes you either to StumbleUpon's submissions form or to the StumbleUpon page that shows how many votes and reviews the page has received. Obviously, there is already a quick, simple toolbar for giving a page your StumbleUpon thumbs-up of approval! This tool will also come in handy for people who regularly have their content submitted to social sites. Ever been surprised and crippled by the Digg effect? In more recent times, ever been shut down by Reddit traffic? Keeping a vigilant eye on the bottom right corner of your Firefox browser and refreshing the stats by re-clicking Manual when you've created some potentially viral content may reduce the likelihood of a surprise flood of traffic. One more bonus is that those of you who are still clinging valiantly to your Internet Explorer browsers might just consider a switch to Firefox for this one. Maybe? Okay, well you just have a think about it, then. 97th Floor say they're working on some tweaks to the tool, and since this is its first public outing, you can probably expect improvements and changes to the tool's features over time. However, this seems like a very sweet extension that can make your social media campaigns quicker and easier right away. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Social Media Tool... That You'll Actually Use!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Social Media Tool... That You'll Actually Use!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}