{
  "url": "https://moz.com/blog/a-tale-of-two-studies-google-vs-bing-clickthrough-rate",
  "slug": "a-tale-of-two-studies-google-vs-bing-clickthrough-rate",
  "title": "A Tale Of Two Studies: Google vs. Bing Click-Through Rate - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Howdy Mozzers! You may remember us from our last study, Mission ImposSERPble (we know, that title was way better), but we're not done yet. After we finished with Google, we started in on Bing.",
  "content": "A Tale Of Two Studies: Google vs. Bing Click-Through Rate Marketing Psychology By: Jeremy Dearringer December 6, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jeremy Dearringer December 6, 2011 A Tale Of Two Studies: Google vs. Bing Click-Through Rate Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Howdy Mozzers! You may remember us from our last study, Mission ImposSERPble (we know, that title was way better), but we're not done yet. After we finished with Google, we started in on Bing. Releasing A Tale of Two Studies in October we shook the foundation of my very desk, by jumping up and down like giddy school girls. But it wasn't all jumping and data. Our findings provided us with a terrible truth. Did you know that every month, roughly 117 million searches are made for the keyword \" google\" in Bing? Yeah. Scary. Now for the highlights: Results from the Google study showed that CTR was 18.2% for a No. 1 rank and 10.05% for a No. 2 rank; results from the Bing study showed that CTR was 9.66% for a No. 1 rank and 5.51% for a No. 2 rank. And so that I wouldn't have to write out all the highlights, and because our last infographic was such a success, we made this awesome infographic! Have fun. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Tale Of Two Studies: Google vs. Bing Click-Through Rate"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Tale Of Two Studies: Google vs. Bing Click-Through Rate"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeremy Dearringer\n          \n            Jeremy Dearringer\n          \n            Jeremy Dearringer"
}