{
  "url": "https://moz.com/blog/a-tiny-little-peek-into-china",
  "slug": "a-tiny-little-peek-into-china",
  "title": "A Tiny Little Peek Into China - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After 5 days in China, I'm completely unqualified to give any advice on the country, tourism, travel or search marketing, but I think that despite that, it's still worthwhile to give my early impressions. Bullet points are a must, given the average of 5-6 hours a night of sleep, numerous blisters…",
  "content": "A Tiny Little Peek Into China SEO Events By: Rand Fishkin May 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 21, 2007 A Tiny Little Peek Into China SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After 5 days in China, I'm completely unqualified to give any advice on the country, tourism, travel or search marketing, but I think that despite that, it's still worthwhile to give my early impressions. Bullet points are a must, given the average of 5-6 hours a night of sleep, numerous blisters and a dead-tired roommate :) China is accessible - before coming to China, I had a lot of questions, and plenty of fears. Can you drink the water? (no) Are the hotels accomodating of English? (absolutely) Are the streets safe? (completely) Is it affordable? (for the most part). Today, a lot of those questions are answered, and I'd feel as comfortable traveling to most parts of China as I would visiting most parts of Europe. It's certainly not the same, but from a global traveler's perspective, it's as accessible as any major city in the western world. The Chinese people are as unique and varied as anyone else - stereotypes about \"Chinese\" abound, and they're almost all as completely inaccurate as stereotypes about Americans, Canadians, Mexicans or Indians. People here are like people everywhere - unique, not definable with simple adjectives, individual. There may be traits that are more popular here than elsewhere (slightly less friendly to strangers, often more friendly to friends, entrepreneurial, and much taller on average than you might first guess). Internet Adoption is Rampant - in the back room of tiny restaurants and washing machine repair shops in the poor neighborhoods of Xi'an, you'll find an old computer and a young person surfing the web. Internet cafes are wildly popular in every neighborhood I've seen them in, and everyone in Beijing has a cellphone with web access (at least, that's the way it seems). Political Discourse is Open - The myth that Chinese people are ignorant of their political climate or that of the world around them is totally false (at least, those we've met in big cities, and even in little shops on the outskirts). Like Americans or Mexicans or South Africans, they freely discuss the imperfections in their government and policies and how they think it should be made better. There's no misconceptions, either, about the news you get from official sources vs. what's actually happening - much as with US news, the educated folks here recognize that you don't get the full story in the papers. The censorship of certain websites, search results, etc. seems almost useless - no one I've talked with is unaware of, for example, disputes on exports and trade deficits, the events at Tiananmen Square in 1989, the history of conquering Tibet or the many mistakes made during the cultural revolution (1966-76). It may not be as \"free\" and \"open\" as some western societies, but at least in big cities, or anywhere a tourist might find themselves (tiny towns near the Great Wall or the Terra Cotta warriors), knowledge is far more abundant than westerners presume. Some of the things you hear about China that absolutely are not myths, however, include: A Big Population - There are no words to describe the size of a city like Beijing, and from what I'm told, almost no city on the planet rivals Shanghai. In the densest provinces, you cannot find a speck of unsettled land. In Sichuan, we've heard that you can drive from one end to the other, and never see an acre undeveloped. A Red Hot Economy - Three business cards per person is not uncommon, and neither are three jobs. Opportunity is everywhere and the myth of disrespect for foreign goods is completely unfounded - the Chinese, from all evidence, love western brands and goods and are as happy (if not happier) to consume these as home-grown items. Pollution - the air quality is generally terrible, save for just after a heavy wind or rain. In Xi'an and Beijing both, even on the outskirts (with the exception of this morning's trek to a section of the Great Wall), it's rough going. I've noticed that despite days and days in the hot sun, my skin has barely taken a tan, never mind burned. Comparable exposure in Seattle would leave me fairly crispy, and from what I hear, this is because of the thick, smoky haze that constantly hangs over us. I know that in a week's time, I'll have much, much more to share, including a considerably better understanding of the China search marketing environment. Please do share your own knowledge of China below - I'm certain that many of our Chinese readers will have a much better idea than I about the truth of my early impressions above. p.s. If you're going to be in Shanghai tomorrow night (Tuesday) or the next (Wednesday) and want to meet up for dinner, shoot me an email :) p.p.s. Photos so far are all on Flickr - China, May 2007. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Tiny Little Peek Into China"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Tiny Little Peek Into China"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}