{
  "url": "https://moz.com/blog/a-tweets-effect-on-rankings-a-youmoz-case-study",
  "slug": "a-tweets-effect-on-rankings-a-youmoz-case-study",
  "title": "A Tweet's Effect on Rankings - (A YouMoz Case Study) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier this year I attended LinkLove New Orleans a search conference put on by Distilled and SEOMoz and learned a lot of advanced SEO tactics. One of the things that really piqued my interest at the conference was Rand mentioning that retweets can affect rankings and he mentioned a post on his…",
  "content": "A Tweet's Effect on Rankings - (A YouMoz Case Study) Social Media By: Alex Adekola December 2, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Alex Adekola December 2, 2011 A Tweet's Effect on Rankings - (A YouMoz Case Study) Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Earlier this year I attended LinkLove New Orleans a search conference put on by Distilled and SEOMoz and learned a lot of advanced SEO tactics. One of the things that really piqued my interest at the conference was Rand mentioning that retweets can affect rankings and he mentioned a post on his blog for further reading. He stressed that this was a preliminary finding and that this needed to be looked at more. It’s obvious by the fact that Google was using twitter data that tweets have an effect on rankings. Rand and SEOmoz are heavyweights how would this play out for smaller outfits? I was really curious as to how many retweets would be necessary as well as how long the page may last in the SERPs and how high that page may rank. After retreating to my hotel room I read the blog post entitled “A Tweet's Effect On Rankings - An Unexpected Case Study” In the example posted on Rand’s blog post he was retweeted by Smashing Magazine. That in itself is an awesome feat but realistically a local SEO consultant like myself and others on the YOUMoz blog may not have the clout and luck to get a retweet from a company with 488,751 followers. Even if you have something worth retweeting it has to be seen, so some luck is involved. I’m not saying it can’t happen, but the chances of getting a retweet from more niche blog are much better. So I set out to replicate SEOMoz’s study in which they achieved a first page top ranking. My first goal was to create a valuable piece of content that would resonate with a particular audience enough to get retweeted. I had decided early on that I would begin contributing content to DZone.com as part of a strategy to grow my blog following. Dzone is a aggregate of links and content that are programming or tech related in nature. It’s sort of like a reddit or digg for programmers. Unfortunately we recently lost two great minds in the tech world Steve Jobs and Dennis Richie. One was a celerity of sort and the other was an obscure quiet humble man who pioneered the information age with his work at Bell Labs. In fact Steve Jobs would have never been if it wasn’t for the work of Dennis Richie who in effect was the creator of UNIX and the C programming language. All Mac operating systems run on a flavor of unix and most native apps are written in C. So I wrote a blog post titled \"The most important man in tech died last week...it wasn't Steve Jobs\" and submitted it to Dzone. It gained some traction pretty quickly and made it onto Dzone's first page of links then it received enough upvotes to get tweeted on Dzone's twitter account which has 11,458 followers. So here are the results of my small scale experiment on rankings. The search phrase I choose was \"Man in Tech\" which had a Moz KW difficulty of 44% vs a Moz KW difficulty of 66% for \"Beginners Guide\" My blog post debuted at the #9 spot for the search term and made it all the way to #6 I wonder what the results would have been if we weren't competing against a brand that had two of the keywords in their domain name. My rankings were short lived, less than a week. My tweet was retweeted about 10 times which really isn't a lot but enough for Google to notice. Meanwhile SEOMoz still ranks and has the #2 spot for \"beginners guide\" so I would bet that the number of times your retweeted has an effect on the length of time you appear in the rankings along with user data. Obviously guest blogging is a great way to generate a lot of traffic to your website, my bounce rate was pretty high but is to be expected since my post was very short and my website is for my web design business and there isn't much value to programmers other than my blog post tribute to Dennis Richie. Most of my blog content is written for business owners. I was very surprised by the number of visitors that Dzone sent to my website over 2,000. Some things to take away from this if you plan to use twitter for a boost in rankings: Aim for a short title with keywords for you content. The more retweets you get the longer your content will appear in the SERPs. Make sure you content is relevant to your targeted audience. Research your keywords for low competition and high traffic and unique phrase combinations. Seek out influencers or resources that may auto tweet content (Dzone auto tweets big links). Use other methods of tweetbait - like writing about or interviewing an influential person or company on twitter. Time your effort for maximum effect since your rankings may not last via retweets. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Tweet's Effect on Rankings - (A YouMoz Case Study)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Tweet's Effect on Rankings - (A YouMoz Case Study)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alex Adekola\n          \n            Alex Adekola"
}