{
  "url": "https://moz.com/blog/a-visit-to-google-kirkland",
  "slug": "a-visit-to-google-kirkland",
  "title": "A Visit to Google Kirkland - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Danny Sullivan was in town over the weekend and on Saturday night, Vanessa Fox from Sitemaps invited Mystery Guest and me over to Google's Kirkland offices. We had a ton of fun and got to meet some new (and very friendly) Googlers. Just a few photos:\n...",
  "content": "A Visit to Google Kirkland Search Engines By: Rand Fishkin January 29, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 29, 2007 A Visit to Google Kirkland Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Danny Sullivan was in town over the weekend and on Saturday night, Vanessa Fox from Sitemaps invited Mystery Guest and me over to Google's Kirkland offices. We had a ton of fun and got to meet some new (and very friendly) Googlers. Just a few photos: Mystery Guest and Danny share a Diet Dr. Pepper in the movie room Danny authors Google's to-do list for the next week The final list included the first 9 from me and 10-13 from Danny: Re-institute accurate \"link:\" command Add action tracking to Google Analytics Dis-mantle new Google-bomb protection algo New logo for Groundhog day Add true PageRank data to Sitemaps console Ban Digg.com from index (just to mess with Rose's head) Make results numbers precise(ish) Remove PageRank from the toolbar Change anchor text for title use to use any random anchor text Make site: command show all subdomains once again Ban SERoundtable.com just to mess with Barry's head Frame all Wikipedia links so clickthrough shows page with AdSense alongside Onebox to show alternative porn listings for any search From left to right: Matt, Amanda, Vanessa, Trevor, Rand, Susan & Danny Thanks a ton, Vanessa and crew. Let me know when I can return the favor at SEOmoz :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Visit to Google Kirkland"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Visit to Google Kirkland"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}