{
  "url": "https://moz.com/blog/a-visual-guide-to-rich-snippets",
  "slug": "a-visual-guide-to-rich-snippets",
  "title": "A Visual Guide to Rich Snippets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rich snippets -- we see them everywhere in the SERPs, with some verticals having a higher abundance of them than others. For the average searcher, these rich snippets help show them what they're searching for is within reach on a particular site.",
  "content": "A Visual Guide to Rich Snippets Technical SEO By: Selena Vidya March 13, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Selena Vidya March 13, 2012 A Visual Guide to Rich Snippets Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rich snippets -- we see them everywhere in the SERPs, with some verticals having a higher abundance of them than others. For the average searcher, these rich snippets help show them what they're searching for is within reach on a particular site. A few benefits of rich snippets include: 1) Drawing a user's attention to your relevant result. 2) Providing instant information as related to their query. 3) Increasing click-through rates and lessen the amount of bounces due to not searchers not finding the content they were looking for. Find & track your Featured Snippets! For companies leveraging content strategies, there's an especially large benefit of having mark up for authors being displayed in the SERPs with the emergence of AuthorRank. For instance, a \"know\" based query (informational search) that displays an author with a photo, name, and a link other articles they've written creates a feeling of trust and authority. It can also encourage them to click-through and read other articles they're written, essentially making that author a new resource. As another example, \"do\" based queries, such as going to a concert or event, can end up displaying results from ticket sites that have a quick and instant snippet breakdown to help them in the purchasing process. In order to consolidate and decode some of the information you need to sift through when learning about rich snippets, we've created this visual guide to walk through the basics, fundamental types, implementation, and benefits of utilizing them. Enjoy! Some food for thought: How do you see rich snippets evolving in the future? Feel free to display this Infographic on your site. Just please reference the original with proper attribution. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Visual Guide to Rich Snippets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Visual Guide to Rich Snippets"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Selena Vidya\n          \n            Selena Vidya\n          \n            Selena Vidya"
}