{
  "url": "https://moz.com/blog/a-wrinkle-in-london-time",
  "slug": "a-wrinkle-in-london-time",
  "title": "A Wrinkle in London Time - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "WARNING: The following post is long, personal and rambles quite a bit. It contains very little SEO advice, so if this isn't your kind of thing, you might want to skip it. It was written over the course of 20ish hours and hops back and forth between days and times during my recent trip to London.…",
  "content": "A Wrinkle in London Time Moz News By: Rand Fishkin February 21, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 21, 2009 A Wrinkle in London Time Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. WARNING: The following post is long, personal and rambles quite a bit. It contains very little SEO advice, so if this isn't your kind of thing, you might want to skip it. It was written over the course of 20ish hours and hops back and forth between days and times during my recent trip to London. 6:45am GMT, February 19th It's just after dawn here in London and the sky's turned a husky gray; a color that's likely to stick around all day. I'm meeting Will Critchlow for breakfast in a couple hours, but, like the last 3 nights, I can only manage 4 or 5 hours of sleep before my internal Seattle clock forces me awake. After some email (not all of it, but enough to get by) and a shower (which helps drown out the grogginess), it's time to revisit an old habit of mine that's been dormant a long while - a personal blog post. There are a lot of reasons I haven't written in this fashion for so many months (since May of 2008, actually). Time is obviously a big one, but it's not alone. SEOmoz is a brand that can scale, Rand Fishkin isn't. Thus, over the past year, I've been working hard to focus on one over the other, though I'm unsure what degree of success I've had. I've traded in my yellow shoes & blue jeans for suits and ties - a change that some seem to find unsettling (but it's hard to get folks outside of core SEOs to take you seriously in bright colored footwear). 12:00pm GMT, February 19th This is the part I hate. My left arm is tingling from the weight of my hanging bag as I run up the fifth escalator in a row. The Heathrow Express was delayed by 45 minutes by a slow train in front of us and now I'm scrambling to make my flight. London's bizarre security triathlon doesn't make it any easier - first a pre-luggage screening, then the usual x-ray and finally a second x-ray just for shoes (with lovely pat downs, passport checks and ticket stamping in between). Once I'm through to the bazaar of liquor, perfume & wallets, I've entirely forgotten what kind of British chocolate bars Mystery Guest wanted me to pick up (thankfully, my AT&T phone's web connection is solid, so I can pull it up on email and stuff a monstrous heaping of Cadbury into my bag). The departures screen says my flight's gate will be announced at 12:30pm, but it's almost 1:00pm and there's no gate listed, so I grab a few snacks for the flight (if only we had these brilliant macadamia, cranberry & dark chocolate \"Eat Natural\" bars across the pond) and wait on line for 10 minutes, primarily to dispose of my remaining sterling notes. In the meantime, my flight's started boarding and Gate 34 is a good half mile track race from the posh vendors of Terminal 3 (honestly, who buys a $500 Hermes tie at the airport?). By the time I arrive at the gate (for my fourth passport & ticket check of the hour), I'm a tired, sweaty wreck. 2:00pm GMT, February 16th Lunchtime with Will & Duncan. I've flown in a day early so I can spend some time with our partners from Distilled. I feel a little groggy from the flight and I've been in the same clothes for 24+ hours, but my compatriots aren't yet commenting on a smell. Thus far, it's been a fantastic relationship. Last fall, we completed our first big client project together - strategic and tactical work for Scribd.com, a Web 2.0 startup that had tremendous SEO opportunity. I'd just emailed over a Techcrunch article covering Scribd's success and the traffic trend line at the end of the year makes us all smile. The big topic, however, isn't specific clients, but scaling and tools. Distilled's tool, Reputation Monitor, has been steadily growing and they've already got a very impressive customer list. We work on how SEOmoz's web crawl (and our new super-secret project) can help make the service even better, and run through the wireframes for our next version of PRO (hopefully Adam will have something to tease us with on the blog in the next few weeks). It's remarkable how much value I get from time spent with Will & Duncan. CEOs often complain about how lonely it is at the top, but sharing tough experiences with friends who confront those same challenges every day isn't just cathartic, but educational, too. 12:00pm GMT, February 18th I'm heading out to lunch with Doig Simmonds, my maternal grandmother's adopted brother. A bit of back story - the early 1940's were a terrificly bad time to be a Jew in Eastern Europe, so the British helped out by airlifting kids like my grandmother out of danger and into the suburbs of London. Doig made it out to my wedding last year and now I'm getting the chance to visit with him again. At the end of lunch at an Italian bar in Islington, I tell Doig how much I like his scarf, and he won't let me leave without it (at least I managed to snag the bill before he could). I can't imagine a better reason to come to London. Over the last hour and a half, we've shared stories about family, friends, work & politics. I hear about how he investigated forged antiquities with the British police for a Christie's auction and recount my own (much less exciting) tales of running a technology business. Even if I did nothing else on the trip, this lunch would have made the journey worthwhile. 9:00am GMT, February 18th This is why I'm here. Mike Grehan's panel of search marketing community leaders at SES London turns out to be a great session (at least, if the Tweets are to be believed). Jill Whalen says our jobs as Internet marketers should be to make the web a better place. I disagree and posit that our jobs are to serve our clients, and if the two goals don't intertwine, we have a fiduciary and contractual obligation to the latter over the former. Mike Grehan worries that Google's crawl technology can't keep up with the speed of expansion user-generated content has brought to the web. I disagree again, noting how far and how fast Google can crawl. I think even if the web grew 10X tomorrow, Google's crawlers would have little issue keeping up. Overall, though, the disagreements are minor and they make the session exciting. We talk about new signals to search engines - things like user data, citations that aren't necessarily links and how search might change in the year to come. On the search marketing agency side, there's a lot of consensus - both consolidation (big agencies swallowing little ones) and fragmentation (laid off and disgruntled marketers starting their own businesses) are inevitable thanks to the economic climate. SEO is getting more advanced, too, as we all start to apply more math, science and rigor to the process for a competitive advantage. I hear lots of positive feedback from attendees and hope that my contributions haven't made Mike regret his decision to fly me out & put me up. He's been a friend for many years, and I'm honored to contribute. I'm also shocked when, at the start of the session, I ask how many people in the audience have visited SEOmoz and nearly every hand goes up. It's amazing to see this little company stretching so far and wide, and it carries with it a lot of responsibility. 8:00pm GMT, February 18th Time to unwind. I'm with friends - Jane (whom I sorely miss having around, though, in classic fashion, I probably appreciate her more now that she's gone), Lyndon, Rob, Lisa, John, Mel, Dixon, Ciaran, Richard, Karl, Stephen, Ben and some other guy.... I think his name was Dean? :-) We've managed to squeeze 12 gents (plus Jane & Lisa) into a private room at the \"Drunken Monkey\" (yes, really) set up for 8. The conversation drifts from UK vs. US tax law to hiring & firing to Rob's unfortunate bout with liquor the night before to John & Lisa's upcoming wedding. There's plenty of beer and wontons and pancakes filled with duck, cucumber & hoisin. It's that part of the trip where I get to be myself and I don't need to hide what I think or how I feel. When we head back to the hotel bar at the Hilton, I'm reminded of just how much scrutiny we're under at SEOmoz. Someone brings up a comment I never replied to on the blog, while someone else wants to know my opinion of a potentially insulting tweet or my take on the latest blogosphere drama. It's this attention to detail - to every post that's written, every comment that's left, every mention across every social media platform - that's trying on the spirit. And yet, what right do I have to complain? If SEOmoz gets to reap the benefits of being a public brand, with a vibrant, active community, aren't we then obligated to be under the microscope and take our licks? In many ways, this is my own fault. There have been times in the past where I've reacted poorly (or simply reacted at all) to comments and threads I should have ignored. I like writing about search spam, showing how it works and learning from it, and yet I've let myself be bullied away from that subject matter because my skin isn't thick enough. I've compromised on my motto of \"sharing way, way, way too much\" in the last year, something I thought I'd never do. It doesn't seem to have hurt, though - the reach of the blog and site are bigger than ever (not that I don't miss it). I can recall back to the first time I (and SEOmoz) got negative press in the community. Not just criticism of something I'd written or something I'd done, but an indictment of our motivations and of me as a person. It was the summer of 2007, and I was on vacation with Mystery Guest in Ashland, Oregon (where we had such a terrific time, we held our wedding there last fall). Vanessa Fox shot me a text with a link to a Sphinn story about... actually, I can't recall (and since I'm at 35K feet, there's no way to jump online and jog my memory). I remember being confused, upset and scared - since it hadn't happened before, I didn't know what the consequences might be. I actually called up the author of the piece on the phone, figuring that it was just a misunderstanding, and once we got to know each other a bit more, everything would be fine - no such luck. I had a few sleepless nights, some conversations over email with friends and finally, a few days later, after it was clear the world wasn't going to end, started to let go. It's happened a few more times over the years - almost always at Sphinn, where it seems drama, accusations and conflict are becoming a weekly tradition. Luckily, I've toughened up a considerable amount, and though the occasional remark (especially if it's from someone I've spent time with personally) will still get to me, it's reassuring to know that it doesn't seem to dramatically impact our long term goals. During a chat with Jill Whalen at the conference, she notes that criticism necessarily follows growth - and that she paved the path of building both loyal followers and devoted critics long before I was on the scene. Hers aren't a bad pair of footprints to follow in. 11:00pm GMT, February 18th I really should turn in for the night considering how terrible I am at falling asleep here, but instead I'm talking to a friend about how Linkscape's next evolution is going to bring a lot more statistical rigor to the SEO process. He's probably thinking that my proposal is just a crazy pipe dream, but Ben, one of our Linkscape engineers, has convinced me this is going to work. Just plug in a search query and an engine, grab the top 30-40 results and Ben's system runs keyword & link analyses and spits back an algorithm that would produce those 30 results in that order, along with probabilities for what it would take to move from position X to position #1 (more link juice? trust? anchor text? better keyword optimization? internal link popularity?). I'm geeking out pretty hard, and I've had at least four glasses of Stella (according to Ciaran, the Brits call it a \"wife beater,\" even though in the States it's a fairly posh brew - and we reserve that phrase for an unflattering undershirt). When I get back to my room, instead of climbing into bed as I should, I jump on the computer. My status message in Gmail says \"Email is My Life\" and it's true. Ever since I started in the search industry and found that big names wouldn't respond to my messages, I've made it my business to reply to every email that gets sent to me. Two weeks ago, I hit a new record - more than a thousand emails answered in just under 65 hours (though, to be fair, my wife was tag-teaming on her computer to help me get through it all - if you want to know what love is, look no further). Sadly, I think this practice of mine is about to become impossible. The volume I get has been steadily rising, and although it's nowhere near as bad as my friends Susan & Vanessa or someone like Matt Cutts, my board of directors has been asking that I contribute to the business in more scalable fashions, and that's probably the right call eventually. At least tonight I don't have to blog - Danny & Rebecca have both put up posts today and tomorrow's Thursday, so Scott has a WB Friday in reserve that we filmed three weeks back (in anticipation of my unavailability). By 1:00am, I'm asleep, dreaming of high PageRank scores and a sudden fall in the cost of Linkscape's crawler bandwidth (at least, I assume that's what I dream about - I never actually remember). 9:00am GMT, February 19th I've been awake for 4.5 hours already, so I'm starving. Thankfully, Will's waiting in the lobby for me and we dash across the street for breakfast. Will orders \"The Full Monty\" - commenting that he's entitled, since he was supposed to play basketball the night before (and even though he didn't, it still counts as a pseudo-workout). My eggs royale are phenomenal - combining smoked salmon and hollandaise sauce is a genius move (that hopefully will make its way to the colonies sometime soon). Over tea & coffee (oddly, the Seattlite orders tea while the Brit takes coffee), we talk about stock compensation, salaries and morale. Like many in management before us, we both agree that while those things can turn heads and help initially attract talent, they're never what motivates people. The work environment you build - the positivity of the people on the team, the quality of the work itself and the feeling that your input is valued and your efforts have an impact are a much better retention and productivity tool than any financial incentive (although you still have to get both parts of the equation right). We linger for an extra hour and see the tables around us empty, fill up and empty again. There's a touch of rain, but the temperature's been decent all week, so it's tough to complain. Apparently, the week prior, London was completely shut down by 8 inches of snow - just as Seattle was back in December. Even during WWII, London's buses operated continuously, but white flurries brought them to a standstill. Jane must have felt right at home :-) 11:40pm PST, February 19th London's 6 hours behind me and home's another 6 away. Looking through the emergency exit window, I can see ice flows through the clouds - cracked like shards of broken glass. A dozen movies are playing in my peripheral vision; Greg Kinnear in a suit, Mark Wahlberg firing a shotgun, Keira Knightly with her hair on fire. I'm reviewing my Moleskine notes from the last few weeks and find a passage that I need to remember. It says \"You are not the user;\" a lesson I wish I learned a year ago. Building a tool that makes me a better SEO is fun, but it's not what we should be doing. 130,000 people have signed up for accounts on SEOmoz and 15,000+ visit every day. We've got a responsibility to them. So what's in store the next 6 months? First up is something called SEOmoz Labs, where early-alpha versions of tools and resources will launch before they go into polished development. If they're popular and useful, they'll be made into more full-featured products and if not, they can remain in Labs. After that, Jeff & Adam have big upgrades for the Rank Checker Tool. Linkscape is updating again soon and hopefully coming out of beta in a few more months once the update cycle is more fully automated (Nick & Ben have far better things to do with their time). We've got our new version of PRO membership launching and a training seminar this summer, and I've got keynotes in Munich, Australia, Washington DC & possibly Oslo before October rolls around. I'm not in the office much anymore, especially this Spring, which means I'm relying more and more on the team for everything from product design to PRO membership support and financial management. And although my travels and schedule are a mess, at the end of the day, I have Mystery Guest to come home to. The first thing most people ask me when I see them is \"How's married life?\" It's awesome - better than I could have expected, even after dating for seven years. I look forward to coming home from every trip and every day at the office and I think this feeling is going to last a long, long time. Aboard my flight to Calgary, they're handing out customs cards, which means landing can't be far off. The map shows us just above \"Flin Flon,\" which I assume is Air Canada's idea of geography humor (I'll have to check a real map when I get home to be sure if such a town really exists). The end of Little Miss Sunshine is playing on my neighbor's back-of-the-seat screen and Steve Carrell's dancing up a storm. I regret not bringing more games for my new Nintendo DS (a Christmas/Hanukkah present from Mystery Guest) - Professor Layton's village was curious, but I've managed to solve all the puzzles, and New Super Mario Bros. is too challenging to be fun (honestly, how many spiky turtles and flying fireballs can one plumber handle?). I can't wait to get home. We're moving apartments this weekend, which doesn't sound particularly fun, but I think our new place is going to be great. I'm also really excited to get back to 7 hours of sleep a night. I hope it can help take away this permanent half-queasy feeling I've developed this past week. As for more blog posts like this one, we'll have to see - I've got a lot of 8+ hour flights coming up the next 3 months. Back in Seattle on Saturday morning. My friend Todd has a new program for me try out (to see if I can better acclimate to the Twitosphere), but I'm worried if I start following more people, the ones I don't select will take offense. My wife's already left her $0.02. SEOmoz's Q+A is packed with all our new members' questions. I tackled 25 or so late last night, but this morning, Jane's back on the job and IMs me to communicate that I should really prioritize the transit of our apartment. As Mystery Guest finishes up the Coraline book I got her for Valentine's Day, I'm trying to get our utilities moved over (no such luck; Comcast says I have to wait until Monday). We've got a few dozen more boxes to pack and fragile items to ferry over before the movers arrive tomorrow for the furniture, but the bulk of the work was done while I was in London - I'm a very lucky guy. Reading over this post, I'm realizing it's not the most well-crafted of stories, but I suppose I'll follow the philosohpy of \"launch early, launch often\" and see what sticks. Maybe it will make for some entertaining weekend reading. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Wrinkle in London Time"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Wrinkle in London Time"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}