{
  "url": "https://moz.com/blog/accurate-data-visualization",
  "slug": "accurate-data-visualization",
  "title": "Data Visualization: Win Friends and Influence People with Accurate Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The key to good reporting is making sure your data elicits the thought, implication, or decision that you want to leave the reader with. To do that, you'll need to make smart choices in how you choose and display your data. Here's how.",
  "content": "Data Visualization: Win Friends and Influence People with Accurate Data SEO Reporting | SEO Analytics By: Helen Pollitt August 18, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Helen Pollitt August 18, 2021 Data Visualization: Win Friends and Influence People with Accurate Data SEO Reporting | SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Marketers love graphs. Oftentimes, however, we visualize complex data in a way that can be unintentionally misleading. The graph trends upwards but is the data the right metric to be plotting? Are we choosing data that genuinely conveys the state of play, or just information that supports our case? We have reams of data at our fingertips, and using that to support business cases or budget increases is paramount. How do you do this in a way that conveys truth to a less-knowledgeable audience? When presenting results to stakeholders, marketers will often find themselves talking to people who don't understand the metrics to the same degree. Let’s make smart choices in how we choose and display data. From cleansing data and choosing the right metrics, to visualizing them in a way that helps build support and omits bias. Winning friends with reporting Marketing reports are about communicating a message through data. Often that data can be fairly complicated — augmented by segments, audiences, time periods, and campaigns. The message is usually much more simple. There is a key thought, implication, or decision that you want to leave the reader with. The key to good reporting is making sure the data elicits those thoughts in an unbiased way that is easily comprehended. Consider your audience The first step in ensuring your reports are useful to other people is putting yourself in their shoes. Go back to basics with your report and ask yourself this: who is the audience of this report? The audience is central to the reporting process. After all, you’re trying to convey a message. So, when designing your reports, you may want to conduct some research first — that is, speak to the people who will be receiving your report. This might be a client, your line manager, a colleague, or an outside stakeholder. Whoever it is, they’re likely to have a different set of questions they want to have answered by the data than you. Ask them some of the following: What questions do you want this report to answer? Find out from the report receiver if there is a specific question they need answered by the data you're presenting. This might well be something along the lines of needing to know if the campaigns being run are generating ROI. It might be wanting to know if the budget is being assigned efficiently. Perhaps they need to know whether the new marketing channel being trialled is bringing about results, or if the test you’ve been running should be rolled out across more pages of the website. If you don’t know what the report needs to answer, it'll be hard for you to write one that’s useful to the people you’re presenting it to. Who else needs to see this report? Your key stakeholders may not be the only people who will pick up the report and draw conclusions from it. As an agency account executive, you may have a key contact who you send the reports to, but find out from them if they then send them on to others. If it goes to your contact’s colleagues or boss, they may have different needs. Perhaps you send the reports to your line manager, who then discusses it with the board of directors. Is there key information the board needs that you can include front-and-center in your reports? What insights do you want to be able to pass on? The marketing report you provide might be useful in helping the recipient communicate ideas to their stakeholders. For instance, if the report is designed to show the performance of SEO for your company, might your line manager like to be able to argue for a bigger budget? What can you include in your reports to make this decision clearer? What do you already report on that you would also like to see in this report? There’s often a lot of duplication going on with marketing reports. Each marketing channel will be commenting on their impact on the website, or how they’re improving brand awareness. Can you help to simplify the reporting process by bringing some of these other reports into yours? If your report’s recipient is already reporting on metrics of their own, find out if they’re aligned enough to include in your reporting. You'll instantly be adding value to the report you’re creating. What are your key objectives and performance metrics? Ascertain what metrics actually matter. Marketing reports can end up cumbersome, and unfortunately, skim-read as a result. Are there any pertinent metrics that your report recipients really need to know? What are the KPIs they're being measured on? How does your work impact those? Include these metrics directly into your report so your stakeholders can see how your activity is benefiting them. How much of what I report on are you already familiar with? It’s not an easy question, and requires some tact, but it’s important to understand your report recipient’s level of understanding about what you’re reporting on. Are they marketers themselves, or are you their main touch-point within your marketing department? Are they seasoned SEOs who have seen every iteration of an SEO report under the sun? Once you know their level of understanding on the subject, you can decide how to format your report to aid in explaining details more clearly, like including a glossary or notations. An example email to a stakeholder designed to help understand what a marketing report needs to cover. Learn to use your reports for your own marketing purposes Let’s not forget that we’re reporting on marketing data because we want to show how our work is paying off. That means there will always be an element of showing our successes and failures. How we communicate those through our reports is important. What do you want to communicate? Are you looking to prove that a concept works or that a campaign has been successful? Are you wanting to share an update on the general trends of an account? Consider your marketing reports as a marketing tool in their own right. Once you have a better understanding of their audience, you can use them to present data to clearly convey your message. Your reports can help you get sign-off Your marketing reports will serve to sum up the successes and room for growth in your previous marketing endeavors. Done well, they'll help to show off your skills and achievements. This can pave the way for future buy-in from your stakeholders. “Referral traffic to the website has increased by 50% due to the last digital PR campaign you ran? Of course you can run another!” Your reports prove the worth of your work Along with showing off all the good you’ve achieved, your reports should also cover what you’ve learned. That might include projects or campaigns that have not performed as you hoped. Being honest about what didn’t work and how you would change that in the future can help to solidify your reputation as a diligent, accountable marketer. Not everything will go to plan all of the time, and our reports should reflect when they don’t. Only giving one side of the story through reports can lead to some awkward conversations later down the line when stakeholders want to know where their budget has gone or why goals haven’t been met. Summarize effectively The unfortunate truth about marketing reports is that they don’t always get read. You may spend hours putting together an intelligent, thought-out commentary to go alongside your carefully crafted graphs and charts, only for it to lie attached to an unopened email for weeks. One of the ways our reports can be off-putting to their audience is length. Send a Data Studio document consisting of 15 pages to a busy executive and they may never click “open” again. A way around this, and to make sure the pertinent information is definitely being read, is a succinct summary. Add the main message to the first page of the report. Write it after the rest of the report has been constructed and take from that analysis the most salient points you want your audience to know. Summarize the key points and include only the important data on that first page. If the recipient reads nothing else from the report they should be able to take away the key information you need from this one page alone. The rest of the data, tables, charts and commentary should be backing up that first page. This can be where the deep-dive analysis of the data is carried out, but not where the important information is first raised. Continually review your report structure and tone Your reports might need to go through several iterations in order to get the right level of “comprehensive” and “clear”. Don’t be afraid of asking for feedback on your reports. Think of them like marketing collateral – you may need to refine the messaging to make sure it's resonating with your target audience. Reports shouldn’t be a case of “set-it-and-forget-it” — they may need to be adapted to new team members or stakeholders. Share insight, not just intelligence There's a difference between insight and intelligence. In this instance, intelligence is the sharing of data. It's valuable in its own right, but not necessarily the best way to communicate through your reports. Instead, consider insight to be the goal. Insight should come from a place of analysis. When reporting on your marketing campaigns, dig deeper to look into trends, seasonality, social, and political factors that might be having an effect. Your expert take If you're producing marketing reports, chances are you're a skilled marketing professional with a broad or deep knowledge of marketing disciplines. Your opinion matters. Depending on the type of report you're creating, and the audience who's receiving it, you may need to go into quite some detail explaining what the data shows. Guide the readers to the conclusions that can be drawn from the data. This way, the reports become useful decision-making tools. Evaluate how this report backs up your other comms It's likely that your marketing reports aren't the only source of information about the campaigns or channel your stakeholders are receiving. You may be updating them on progress through meetings, dashboards, and emails. Progress might be frequently discussed by other members of your team. Your reports need to be cohesive with these other communications. If they aren’t, how do stakeholders know which one is the source of truth? There are many of ways in which the results may be misunderstood or miscommunicated. When creating your reports, it's imperative that you're aware of what other discussions around the report-subject are being held so you can ensure you're providing the data that evidences and reiterates those discussions. Keeping data accurate and unbiased Using your reports as a marketing tool makes sense when you think about them being a reflection of your hard work. However, this approach could lead to some distortion of the facts. One key takeaway from this article is this: keep your reports honest and unbiased. This is hard to do. There’s often a lot riding on your reports — new budgets, recurring revenue, your promotion opportunities, etc. To help, the following are ten tips for making sure you're presenting the data in the best way possible for your audience to see the true message. 1. Choosing the right data set What data do we need to report on? This might seem like a simple decision to make, but it’s actually more nuanced than you might expect. Consider what you're trying to demonstrate through your reports. If it's the success of a marketing campaign, then the data you need to report on might go beyond the data you have a direct impact on. For instance, if you're tasked with driving converting organic traffic to a website, then it might not be enough for you to just report on the Google Analytics organic channel traffic and conversions. To create a truly useful marketing report, you may also need to include data from what happens after the traffic completes a conversion on the website. Can you include data from software like Salesforce or Hubspot, which gives an indication of how much of that traffic actually became a marketing qualified lead, or even a customer? Your data should be chosen based on the overall goals of the marketing initiatives you're reporting on. Rarely is that simply to drive more traffic to a website or generate more awareness of a product. It usually comes down to revenue. To really identify whether the work you're carrying out is making an impact on a company’s bottom line, then you may need to include that revenue data in some way. Doing this gives a much fuller picture of how effective your marketing is, and keeps you accountable to the role that your marketing activity should be playing in the success of the business. 2. Reporting on the key goals Think about the big picture of the company. What are the overall KPIs it's working with? How can the information provided in your report tie into those KPIs? Say, for example, your company has released a new line of sneakers. The overall goals of the new campaign are to have sold 20,000 units of this new stock by the end of the year. How can your SEO report include information that might help identify whether that launch has been successful? By including references to wider company goals in your report, it will stay more relevant to a wider audience. It also means there's a direct correlation to be drawn between the activity you're carrying out and the success of the business. This might mean that your report structure needs to change seasonally as the goals of the company change. You may have a page of your report dedicated to data that tracks the success of the sneaker launch until the end of the year. As a new product line launches and the focus of the company changes, so may the focus of that page of the report. 3. Keeping the integrity of that data set Our reports ride on a lot of trust that the data we’re using is… actually right. Consider: Who has access to your Google Analytics data? Your Search Console account? Who can add filters, delete views, change custom groupings, delete properties? It’s really important to lock down who has the ability to make changes to your data that could drastically affect its reliability. It’s even more important to build processes that will reduce the risk of it happening. Even the most seasoned Google Analytics user will not necessarily be aware of how adding a traffic filter to the account may affect the integrity of data that someone else in the team is reporting on. You may well be trying to clean up your data source by better attributing channel data, or filtering out bot traffic. These are all good ideas. However, unless it's carried out in conjunction with other people who are using that data, properly noted and even annotated within your data source, it can cause a loss of integrity. Even outside of the data source itself, there can be factors that affect it. For instance, Google Analytics channel data relies on people using UTM codes correctly. Make sure you invest time in creating training programs that inform stakeholders of how their actions can impact data. Create processes that limit the effect of those changes. Consider keeping a centralized document of UTM codes used on marketing campaigns and develop a system for creating them consistently. This way you can limit the poorly attributed traffic polluting your marketing reports. 4. Avoiding bad data To reiterate: Our marketing reports should be useful to their recipients. Safe reports — ones that just cover basic metrics or cherry-pick data— do not add value. When writing your reports, avoid just choosing data that is “bad”. That is, data that obfuscates truth and hides issues. This can be through choosing metrics that, on the face of it, look good (like a low site-wide bounce rate), but in reality do not provide sufficient information to base decisions on. For bounce rate to be a metric on which to base decisions, a reader would need to know what the bounce rate of individual pages were, or the type of content they contained, or even just whether the low bounce rate is coupled with a high engagement rate. Bad data can also be data that has been highlighted because it's positive, but at the expense of showing data that might reflect badly on the marketing activities. Showing that traffic to a webpage is growing may look great. Not including the fact that conversion rate has steadily been declining could hide the issue of the decreasing quality of that traffic. For example, look at these two charts. They show the same organic traffic data to a webpage: The first image shows just the organic traffic to the page. If an agency presented this image to a client, it would suggest that their work over the past year had been successful. Organic traffic has almost doubled during those 12 months. This second image uses the same organic traffic data, but adds in the leads generated by that traffic during the same time period. By adding in the leads generated by that organic traffic, you see a different story emerge of the success of that campaign. The traffic has increased but leads have decreased. There could be several reasons as to why that has happened, but this image would not suggest the recent SEO work has been successful in adding to their client’s business goals. 5. Giving a clear picture of the data Your report needs to analyze, detail, and display the data in a way that tells a story. This is the insight that adds value. Think of your report like a journey. You want to draw your reader into the data in a way that helps them to understand the context, the results, and the conclusions. Consider starting your report broad: What is the context of this data? Depending on your niche, this might include all sorts of related information like political background, weather data, economic factors, societal restrictions, COVID-19 case levels, etc. Your report should then narrow down to what is being reported on, looking specifically at the business. Perhaps this will include some of the more business-focused KPIs we discussed earlier. It might be the wider marketing team’s goals and metrics. Next up should be the KPIs that your work has directly impacted. For instance, SEO traffic data, conversions, or content engagement. From there it would be worth narrowing down further to look at the results of activity that has been carried out during the reporting time period. For instance, detail the results of that link-building campaign, or demonstrate how the changes to the webpage copy impacted bounce rate and dwell time. 6. Using the best visualizations for the data Choosing the best way to display your data can make or break a report. You can take data from a confusing mess to being easily understood by simply changing the scale on an axis. It's also very easy to mislead your audience by using an inappropriate chart or graph. Consider what you're trying to demonstrate. Is it the changes in data over time? Then perhaps a line or bar graph is the best bet. Need to show the relationship between the parts of a whole? Then a pie chart might be a good choice. Whatever you do, make sure you avoid these common ways of skewing the data visually: Manipulating the axis scale: Not starting at zero is a common way of making data look more significant than it is. A scale going from 1,000 to 3,000 makes the comparison of two data sets that differ by 500 look huge. Similarly, the axis not being labelled in the right increments can be very misleading. Too big a gap between increments and differences between plots on the graph look small. Too small a gap and the differences look very significant. Parts not adding up to a whole: The key to a pie chart, or any graph that is meant to represent parts of a whole, is that it needs to add up to 100%. That is, every part should be represented, even if it's included in an “other” segment. Percentages instead of actual numbers: You’ll see these sorts of statistics all over social media when marketers are showing off their work. Growth will often be spoken about in terms of percentage changes rather than absolute numbers. Which sounds better: increasing traffic to the site from 10 to 20 users, or a 100% increase in users? Missing data: Only showing the best quarter of a year of poor results can make the results look a lot better. In reality, the missing context is significant and shouldn’t be hidden. 7. Annotate your charts and graphs Wherever possible, annotate your visualizations, especially if they're time-based. For instance, did you start filtering out internal traffic in March 2021? If so, that could have caused a dramatic drop in website traffic from that point onwards. Someone new to the business or your team may not know that it happened and will be looking for reasons for this change in traffic. Equally, when comparing March 2021’s traffic to the previous year, the graph may give the impression of a drop in traffic year-over-year. In fact, this could be masking an increase in the external traffic to the site. Noting significant changes in the context of your data on your marketing charts and graphs can help identify genuinely significant changes. 8. Waiting for the right time to draw conclusions and report on data It might be tempting to call out successes in your campaigns as soon as you see them. Often, though, it pays to wait before drawing those conclusions. You may be only a month or two into a six-month campaign. Instead of declaring it a success now, note in your reports how other factors may yet influence it. It would be better to wait for a longer period of time to pass before you call a campaign or activity a success. There may still be insights to be gleaned from how successful it is or could be. 9. Showing a clear link between the data and next steps Remember to be clear about the conclusions you want the reader of your report to take away. These conclusions should result in actions or decisions. Otherwise, the report isn’t actionable and its value is arguably limited. What would you want someone who is less knowledgeable about the work you’ve been doing, or marketing as a whole, to take away from it? The data you're choosing to report on should be sufficient enough to back-up your analysis, and clearly link the conclusions you've drawn to your next steps. 10. Stay true to the data Your reports need to be factually accurate in order for you to achieve a good balance of marketing collateral and reliable analysis. If you gave this data set over to another industry professional with the same level of expertise as you, and with access to the same contextual knowledge, would they be likely to draw the same conclusions? If not, you may have introduced some bias into your analysis. When analyzing your data, always consider whether another person who is more objective of the situation would be interpreting the data in the same way. This should help you to be more critical of the information, and less prone to highlighting only the positives. Conclusion The key aspects of any marketing report is that it needs to be accurate, factual, and clear. It should also show how your marketing has had an impact — whether it be positive, negative, or if it remains to be seen. Reports shouldn’t leave the reader confused as to their significance. Help your audience understand the data's context, and clearly show the actions that can be taken off the back of it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Data Visualization: Win Friends and Influence People with Accurate Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Data Visualization: Win Friends and Influence People with Accurate Data"
    },
    {
      "level": "H2",
      "text": "Winning friends with reporting"
    },
    {
      "level": "H3",
      "text": "Consider your audience"
    },
    {
      "level": "H4",
      "text": "What questions do you want this report to answer?"
    },
    {
      "level": "H4",
      "text": "Who else needs to see this report?"
    },
    {
      "level": "H4",
      "text": "What insights do you want to be able to pass on?"
    },
    {
      "level": "H4",
      "text": "What do you already report on that you would also like to see in this report?"
    },
    {
      "level": "H4",
      "text": "What are your key objectives and performance metrics?"
    },
    {
      "level": "H4",
      "text": "How much of what I report on are you already familiar with?"
    },
    {
      "level": "H2",
      "text": "Learn to use your reports for your own marketing purposes"
    },
    {
      "level": "H3",
      "text": "What do you want to communicate?"
    },
    {
      "level": "H3",
      "text": "Your reports can help you get sign-off"
    },
    {
      "level": "H3",
      "text": "Your reports prove the worth of your work"
    },
    {
      "level": "H3",
      "text": "Summarize effectively"
    },
    {
      "level": "H3",
      "text": "Continually review your report structure and tone"
    },
    {
      "level": "H2",
      "text": "Share insight, not just intelligence"
    },
    {
      "level": "H3",
      "text": "Your expert take"
    },
    {
      "level": "H2",
      "text": "Evaluate how this report backs up your other comms"
    },
    {
      "level": "H2",
      "text": "Keeping data accurate and unbiased"
    },
    {
      "level": "H3",
      "text": "1. Choosing the right data set"
    },
    {
      "level": "H3",
      "text": "2. Reporting on the key goals"
    },
    {
      "level": "H3",
      "text": "3. Keeping the integrity of that data set"
    },
    {
      "level": "H3",
      "text": "4. Avoiding bad data"
    },
    {
      "level": "H3",
      "text": "5. Giving a clear picture of the data"
    },
    {
      "level": "H3",
      "text": "6. Using the best visualizations for the data"
    },
    {
      "level": "H3",
      "text": "7. Annotate your charts and graphs"
    },
    {
      "level": "H3",
      "text": "8. Waiting for the right time to draw conclusions and report on data"
    },
    {
      "level": "H3",
      "text": "9. Showing a clear link between the data and next steps"
    },
    {
      "level": "H3",
      "text": "10. Stay true to the data"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Helen Pollitt\n          \n            Helen Pollitt\n          \n            Helen Pollitt"
}