{
  "url": "https://moz.com/blog/actionable-ideas-for-an-effective-analytics-strategy-15168",
  "slug": "actionable-ideas-for-an-effective-analytics-strategy-15168",
  "title": "Actionable Ideas for an Effective Analytics Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How to evaluate and gain clarity on your goals surrounding your website's analytics. Mine your Google Analytics data with purpose.",
  "content": "Actionable Ideas for an Effective Analytics Strategy SEO Analytics By: Neal Cabage May 17, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Neal Cabage May 17, 2012 Actionable Ideas for an Effective Analytics Strategy SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Many websites have Google Analytics setup, but the majority are not making the most use of these resources. Often, analytics is an afterthought or is dismissed as merely a way of tracking the number of visitors on a given day. But there is so much more actionable data to be had with a little time and forethought. In this post, I am going to talk a bit about analytics strategy and then provide examples of actionable data that can be tracked and how it might be useful. Strategy At a very high level, start by considering the goals of your site and how those map to your analytics tracking. Most eCommerce and Software as a Service (SaaS) businesses, for example, want to generate a purchase transaction. Services businesses such as consultancies may be looking to generate higher funnel leads that will eventually lead to contract for service offline, at a later time. Still others, such as news content sites, might define a goal as keeping a user on the site for a minimum amount of time or having them return a specified number of times within a month. Whatever your goals are, it is imperative to define those clearly - ideally before you even create your website, but certainly before setting up an analytics campaign. Each of the above goals is possible to track using custom events, goals, events, and funnel tracking in Google Analytics. There's even a way to setup custom widgets on the dashboard and have reports and alerts emailed to you on a schedule as well, making it easier than ever to access highly meaningful performance metrics. There really is no excuse to still be using a tool as powerful as Google Analytics to merely track your page views day-to-day. Define Your Goals What should we be tracking? Let's take an eCommerce site as an example, since it has the most sophisticated and well-defined conversion funnel, and we'll demonstrate the Key Performance Indicators (KPIs) at each major step of the funnel that we might consider tracking. This should give a good idea of what's possible and get the creative juices flowing a bit. There are three major steps to the typical eCommerce funnel with an optional fourth step. Let's walk through each one: i. Acquisition We start by looking at how traffic was acquired. How were users sent to your website and from where? Although you may never attain 100% visibility, you'd be surprised just how much visibility you can achieve. You probably already know this through the standard analytics reports: that you can see keywords that were searched and on which search engine. Google also makes it very easy to integrate AdWords data to see exactly which AdWords campaigns are generating traffic and which are converting. Google also owns Feedburner, which provides yet another trackable channel for which you can directly attribute traffic. Tagging is possible for anything outside of the Google-sphere, making it possible to add (utm) tags to the querystring of any URL you embed into an email campaign, social campaign, or banner marketing campaign. For many people, that's the point where the light really goes on, realizing that you can tag and thus achieve almost complete visibility of traffic sourcing, and factor all of this into your integrated analytics campaigns. An example of using UTM tags to track external click events: http://www.site.com/myproduct/?utm_source=yahoo&utm_medium=300x250-banner&utm_campaign=myproduct With all of these tactical tracking opportunities in mind, imagine the possibilities. Here are just a few examples of valuable KPI data points you might consider tracking as part of acquisition: Organic Search (SEO) Paid Search Marketing (SEM) Social Campaigns Banner Campaigns Links from External Sites Links from Online Videos Email Recipients RSS Subscribers ii. Engagement Once you've got the attention of your users, are you effectively driving that traffic toward your funnel or toward micro-conversion events that help to keep them engaged? Even if the visitor does not purchase something today, it can still be extremely useful to capture an email address, get them to subscribe to an RSS feed, or any number of other activities that will keep the communication channels open and continue to educate and qualify them in preparation for a later purchase. This is particularly true of larger purchases or services, which require longer time for transactions to mature. To begin thinking of KPI data points in the engagement segment of the funnel, consider what sort of user activities you could be implementing and the corresponding micro-conversion goals you could be setting. This may also help you realize that you could be doing more to engage your users. Here are a few examples of good engagement goals to track: Account signup Email signup RSS subscription Saving product to wishlists Adding item(s) to cart Contributing product ratings or reviews Watching video Content interactions (e.g. photo zoom, faceted search attributes, etc.) iii. Conversion You've made it from acquiring to engaging, and now you're finally converting that prospect into a paying customer. This is the point at which you're finally able to attribute cost and value to all of your efforts and begin making some decisions. If you're spending money on paid search campaigns, you can see the precise value of each ad campaign, if you've integrated conversion tracking. You'll also be able to see percentage of conversions for other non-integrated channels such as SEO, social, and banner re-targeting. Plus, other details such as average order value and average time to complete a purchase, and you can segment those macro statics by channel to derive insights such as paid search converts with better velocity than social. The KPIs to consider tracking at this funnel step are: Return on ad spend (ROAS) Return on investment (SEO, Social) Revenue Average order value Average time to complete order Average visits before conversion * Consider segmenting all of these KPIs by ad channel iv. Loyalty All of the above analysis can be very valuable, but is a bit myopic if take in isolation, particularly if you have return visitors or a more sophisticated sales and marketing operation that involves multiple touches prior to conversion. Consider the more complex scenario of a prospect who visits your site, then sees retargeted banners on other sites (reminding them of you), so they sign up for your newsletter and eventually convert into a customer. And what if they come back a second or third time thereafter and purchase again. How do you attribute the sales? Does it all get attributed back to the 'first touch' interaction with one of your ads? The new version of Google Analytics (v5) introduces the idea of a multi-channel funnel, which helps to address this issue. With a series of new reports, you can finally see which touch triggered the transaction, but you can also see the path and which other touch points may have assisted with that transaction. This can go a long way toward helping to understand the less tangible value of the early-stage-funnel 'assist' campaigns. For example, the social channel has notoriously low direct conversion attribution... But with multi-channel attribution, you can finally begin to see its role in setting up other activities later down the funnel to trigger a transaction. Putting it all together Hopefully, you are seeing the sort of user behavior and ad campaign performance insights you can mine from Google Analytics, if you take the time to define a strategy and properly implement the tracking and reporting. And that really is the key take away: analytics is a powerful tool that will provide substantial actionable data and enable you to make much smarter marketing budget decisions; but it requires clarity for your goals and how you drive traffic and engage your users. Without that clarity, you do not have a road map to setup a meaningful analytics campaign. Clarity and discipline is where many businesses get stuck and why so few practice meaningful analytics, outside of the major enterprise. But if you have clarity around your traffic generation and engagement activities and goals, you can generate highly informative and actionable data to super charge your marketing efforts, and that is a real competitive advantage. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Actionable Ideas for an Effective Analytics Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Actionable Ideas for an Effective Analytics Strategy"
    },
    {
      "level": "H2",
      "text": "Strategy"
    },
    {
      "level": "H2",
      "text": "Define Your Goals"
    },
    {
      "level": "H3",
      "text": "i. Acquisition"
    },
    {
      "level": "H3",
      "text": "ii. Engagement"
    },
    {
      "level": "H3",
      "text": "iii. Conversion"
    },
    {
      "level": "H3",
      "text": "iv. Loyalty"
    },
    {
      "level": "H2",
      "text": "Putting it all together"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neal Cabage\n          \n            Neal Cabage\n          \n            Neal Cabage"
}