{
  "url": "https://moz.com/blog/actionable-link-building-strategies",
  "slug": "actionable-link-building-strategies",
  "title": "Actionable Link Building Strategies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I wanted to talk about some actionable link building techniques that you can go away and start using straight away.  I appreciate how difficult it can be to implement some of the link building techniques we talk about here, so I wanted to cover some which many of you should be able to use…",
  "content": "Actionable Link Building Strategies Link Building By: Paddy Moogan May 29, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan May 29, 2011 Actionable Link Building Strategies Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I wanted to talk about some actionable link building techniques that you can go away and start using straight away. I appreciate how difficult it can be to implement some of the link building techniques we talk about here, so I wanted to cover some which many of you should be able to use straight away. The first two techniques involve some software called Screaming Frog. We love this in the Distilled office, its a great tool and the guys who own it are very open to suggestions for improvements. At first glance, you wouldn’t think you could use it as a link building tool. But there are a couple of creative ways that I think you can use it for link building. If you are not familiar with Screaming Frog yet, Dr Pete did a comparison to Xenu a few months ago which gives you some insight into the features it has. Use it to help you get a hook in your outreach We all know the importance of having the right hook when you email someone asking for a link. One of the hooks commonly talked about is finding something that is broken on the site you are contacting. Run Screaming Frog over the site you'd like to get a link from and filter the results by 404 pages, then see where these pages are linked to internally. Then reference these in your outreach email. This will help distinguish your email from the other emails they get that look auto generated and spammy. The fact you mention something like a broken link shows you are a real person. Use it to snipe competitors links I love this one, its sneaky but meh, alls fair in love and link building. Run Screaming Frog over your competitors and find 404 pages. Chances are that you’ll find a few. Now run these through a backlink checker such as Open Site Explorer and see if anyone is linking to these 404 pages. You have to hope for a bit of luck here, as there may be no one linking. But when you do find some, its not very difficult to drop an email to the site who are linking to the 404 page and let them know. At the same time you let them know about the amazing piece of similar content you have which isn’t broken. If you are going to use this technique, I’d highly recommend you genuinely do have good content to replace the 404 page. Otherwise, you are going to look a bit silly asking the site owner to change the link to your unrelated, poor quality page. Quick housekeeping note here. If you are doing this, you should also be doing the same for your own site. You’ve got other ways of finding 404 errors, such as using Google Webmaster Tools, Google Analytics or your own server logs. Whichever way you choose, get into the habit of checking 404s and fixing them. Hopefully this means you’ll never get into the situation of having incoming links that go to 404 pages. Revamp old content and data that got links Sometimes content can be published that isn’t “evergreen”. Meaning that it is useful for a while but at some point goes out of date and isn’t relevant anymore. When this happens, its unlikely to be linked to very much. Ideally, you should always be pushing out evergreen content but in reality, this is very hard to do. So our goal here is to find old content on other sites that was good a couple of years ago but not likely to get links now. We then need to decide whether we feel we can redo that content, update it and publish it again. This works particularly well on any content that references a time specific dataset. For example, a comparison of the average alcohol consumption in each US state vs the crime rate for 2008. If this content did well and got lots of links, then updating it with a 2011 dataset may be just as successful. To find this content, you can use search tools in Google to specify a date range from a couple of years ago: Its then a case of sifting through the results which admittedly can take time. But you will get better at this as time goes on. I should also mention that you should take some time to make sure that the website haven’t already updated the dataset and posted it elsewhere on their site, or that they don’t have previous datasets demonstrating a propensity to update it every year. Good example here is the SEOmoz Search Ranking Factors that are updated every two years. If you didn’t do your homework, you could easily think that this was only run in 2009, whereas its actually updated every two years. Start doing weekly roundups of industry news This is a very simple one and can be very effective as a consistent way of getting good quality links as well as social shares. The great thing about this is that it can be applied to most industries too. If you work in an industry where there isn't lots going on all the time, you could do monthly roundups which can still work well. The general idea is that you write a blog post that links out to a number of good quality news items or informational posts over the last week. You can then also tweet about them and get the attention of the site owner by including them in the tweet. This can work very well and isn't seen as spammy at all. Just look at the paper.li links that we all see on Twitter, when we get tagged in one of these, you can't help but go take a look at why you've been tagged. You can also email key sites to let them know they've been featured in your weekly roundup, make it very informal and don't ask for a link in return. Just treat it as a way to get some conversation going with the site owner, then it can lead to getting links back further down the line. Remember that good quality sites will not link to you for no reason, you need to get their attention somehow and give them something. If you do this roundup, you are getting their attention and giving them a link which is exactly what you need to do. You can see some examples of people that do this such as Wiep and Ontolo. Hopefully these quick link building techniques can help you with your own sites, I've tried to write about techniques that most people can use. Please let me know how you get on in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Actionable Link Building Strategies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Actionable Link Building Strategies"
    },
    {
      "level": "H2",
      "text": "Use it to help you get a hook in your outreach"
    },
    {
      "level": "H2",
      "text": "Use it to snipe competitors links"
    },
    {
      "level": "H2",
      "text": "Revamp old content and data that got links"
    },
    {
      "level": "H2",
      "text": "Start doing weekly roundups of industry news"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}