{
  "url": "https://moz.com/blog/add-products-to-gmb-listing",
  "slug": "add-products-to-gmb-listing",
  "title": "How to Add Products to Your Google My Business Listing, Illustrated - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Miriam helps you get started in Google My Business Products with this illustrated tutorial, walking you through how to add your most important products and services.",
  "content": "How to Add Products to Your Google My Business Listing, Illustrated Local SEO | Search Engines By: Miriam Ellis September 13, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 13, 2021 How to Add Products to Your Google My Business Listing, Illustrated Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “Who has X near me?” This customer FAQ has become all the more important since 2020, with the public relying heavily on the Internet to help them remotely source goods and services while spending as little time as possible on business premises. Google gets this, and is taking one step after another to position itself as the intermediary for this foundational query. Becoming the “transaction layer of the Internet” is how my friend and colleague David Mihm of Near Media describes Google’s aims when it comes to online shopping and the role they plan to play in it. As local businesses everywhere have scrambled to implement e-commerce and delivery features, Google has been very busy, too, with its own developments. Perhaps the simplest of all these opportunities to get started with is Google My Business Products — a sort of virtual window shopping interface that can really spruce up your listings. Located in eligible GMB dashboards and with an output that’s visible on several local search interfaces, this feature could not be easier to use.This illustrated tutorial will walk you through adding your most important products and services to Google My Business Products, building your confidence that you are keeping apace with local search expanding to encompass local shopping search. Who can and can’t add Google My Business products to their listings? If you sign into your Google My Business dashboard, and you see a tab in the left menu for “products” you are eligible, with the exception of the products listed here that you can’t upload. If you lack the “products” link but see that your competitors are using it, it’s likely that they have a Google My Business category you’re missing. Use the GMB Spy Chrome Extension to see all of the competitor’s GMB listing categories so that you can consider adding whatever is necessary to prompt the “products” option to appear in your dashboard. Google’s documentation of this feature states that it’s intended for small-to-medium local businesses, and that they prefer large, multi-locations brands to provide product data through Local Inventory Ads. It would be helpful if Google would update this page to give a numeric cutoff between a medium-sized business and a large chain. Meanwhile, if you’re marketing a restaurant, please note that Google prefers you to use the popular dishes and menu functions for showcasing your offerings, rather than the products option. Also for restaurants and service-oriented businesses, be aware that adding items to the products function will delete any meal or service menus that have been created for you by a third party. You’ll need to recreate them with the aforementioned, Google-based menu function or the Services tab in your GMB dashboard. What can be added as a product to Google My Business listings? You can list the following as products: MerchandiseVirtual inventory, like softwareServices There’s a strong argument to be made for listing your services as products, in fact, because they are more visible and have those strong, linked calls-to-action. As far as I’ve seen, Google has no problem with you having both products and services listed, so you can do both! How to add products to your Google My Business dashboard in 10 easy steps To keep yourself organized, create a spreadsheet (or make a copy of this freebie I created for you) containing all the products you plan to list, and include a field in it for: Product imageProduct nameCategoryPriceDescriptionButtonLink BEFORE YOU BEGIN: Note that the last product you add will be the one that shows up first on your profile. So, save the best for last. Made a mistake? You can delete a product and re-add it as the newest item, which will make it show first, or you can edit a product in some minor way and the edit will also trigger re-ordering of the product lineup. Now you’re ready to get going! Step 1: Sign into your Google My Business dashboard for the listing you want to add products to, and click on the Products tab in the left-hand navigation menu: Step 2. This will bring up a popup telling you how many people saw your listing last month and prompting you to add your products. Click the “get started button”. Step 3. This brings up the simple wizard for adding your products Step 4: Begin by adding a 1200 x 900 photo representing your first product. I recommend using original photos and graphics rather than stock photos, and it can make a bold visual statement if you choose to overlay the name of the product in text on the image. Step 5: Give your product a name: Step 6: Create a category for the product. If this is the very first product you’ve added to your listing, there will be nothing in the dropdown. As you add more products and categories, though, the categories you’ve previously created will appear in the dropdown and you can select them to apply to the next product you add, or you can create further, new categories. Step 7. Optionally, enter the price. You can either enter a single price, or use the little grey toggle on the right to enter a minimum and maximum price range. Don’t use letters or symbols in this field or Google will reject them. Our product pricing structure at Moz is complex, with special offers and different pricing for monthly vs. annual customers, so we chose to leave this field blank, but if your pricing is simple and not subject to frequent change that would require you to be updating pricing on a regular basis, it’s a good idea to add it. Step 8: Add a product description of up to 1000 characters. It’s optional to do this, but you should definitely make the most of this opportunity to talk about the benefits of the product. I included a short explanation of the Moz Pro product, plus a customer’s testimonial. Step 9: Add a call-to-action button from among the choices of Learn More, Buy, Order Online, or Get Offer. There’s also the option not to add a button, but why forego the chance to bring customers from your listing to your website? In the “link for your button” field, add the URL of the page you want this button to take the customer to on your website. If you want to measure how your product listings are performing, use UTM tagging in the link you enter, and you can track engagement in Google Analytics, though not in GMB Insights, sadly. Step 10: Take a second look at all you’ve entered to be sure you’re happy with your entry and then hit the blue “save” button. Google will then show you the product in your dashboard: And as you add more products and product categories, you can see them tabbed in the “Products” section of your GMB dashboard: And, presto! Within minutes to a couple of hours, you should see your products appearing on your Google Business Profile when you search for you brand name (or brand name + city, if Google is a bit confused): Customers can click on the “view all” link to see all the products you’ve listed: Or, they can explore using the product categories you’ve created. Look at how big and bold these category buttons are, highlighting key offerings of your business! And it will also show up on the Google Local Finder version of your GMB listing, though as far as I have seen, not in the Google Maps version of your listing: The big question: Should you use GMB products? Can and should are never the same thing. You’ve just learned whether you can upload your inventory via GMB products and you can definitely do it! But to determine whether you should invest the time in doing this, consider all of the following: Maybe, yes! Adoption of Google My Business products is so low as of yet, that if you add your products, it will really make your listing fuller than the bulk of your competitors in most markets. This is a definite competitive difference maker.If you’ve got the ability to take good quality photos or have a graphic designer in-house who can efficiently design some imagery for you, product photos add a very appealing visual element to your listings. If you’d like to make a rather plain listing more inviting, this is a great option.If you have an inventory that’s relatively stable, meaning you won’t be having to continuously editing existing product listings to avoid customer letdown when items become unavailable, that’s a good bet. If your pricing on stable products changes, you may want to opt out of showing prices.If you need to drive any additional traffic you can to your website and shopping cart, this is surely an opportunity. Added bonus that this traffic is likely to be qualified traffic, because the searcher is looking for something particular.If you’ve not yet been able to invest in a full e-commerce solution for your local business, consider GMB products a first step towards alerting shoppers that you have inventory for sale, even if you can’t yet fulfill their desire to buy it online. Finally, a “yes” vote on adding products to your GMB listings can be consistent with your company’s culture of empathy. Regardless of where you do business, your community is full of elders, neighbors with serious health issues, and unvaccinated small children who are staying at home for safety’s sake for as long as the pandemic is with us. You can think of GMB products as a kind of virtual window shopping for these valued community members, and if you can connect your product showcase with curbside pickup or home delivery, your efforts are making your town a more caring and better-resourced place to call home. Use the description field and buttons to let people know how you can get your products safely into their hands. Maybe, no! If your inventory changes constantly, you’ll need to evaluate whether you have the internal resources to regularly edit your product set in the GMB dashboard.If your inventory is large, you may not want to add every single product. Instead, you could add a representative product for each major category of goods, and write the description to make it clear that you have a wide selection of this type of item.Mobile phones can take great pictures these days, but if your photos just don’t look great, it could be off-putting to customers seeing low-quality images. You might want to hold off on adding products until you learn to take photos that create a professional impression of the quality of your goods and services.Some business owners may feel qualms about Google’s increasing involvement between them and their customers, and prefer to work on their own website rather than devoting additional resources to Google My Business features.If your resources are limited, you may prefer to skip Google My Business products for now and go straight to Google Shopping, with its more sophisticated interface. Overall, most local businesses will benefit from devoting some time to adding Google My Business products. Google has given us every reason to believe they are intently focused on shopping, with two major signs being their debut of the Shopping Graph at I/O this past spring and making it free to upload products to Google Shopping in 2020. We’ve all learned together over the past few decades that when Google zooms in on an area of search, we should at least be paying attention to how their efforts might be put to work for our local brands. You have multiple opportunities to explore for enhancing the online visibility of your inventory, and right now, Google My Business products are the easiest way to wade into this work. The holiday shopping season is, incredibly, just around the corner, and if you start uploading products today, it will be your listing that stands out as the place that has what local customers want in December. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Add Products to Your Google My Business Listing, Illustrated"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Add Products to Your Google My Business Listing, Illustrated"
    },
    {
      "level": "H2",
      "text": "Who can and can’t add Google My Business products to their listings?"
    },
    {
      "level": "H2",
      "text": "What can be added as a product to Google My Business listings?"
    },
    {
      "level": "H2",
      "text": "How to add products to your Google My Business dashboard in 10 easy steps"
    },
    {
      "level": "H2",
      "text": "The big question: Should you use GMB products?"
    },
    {
      "level": "H3",
      "text": "Maybe, yes!"
    },
    {
      "level": "H3",
      "text": "Maybe, no!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}