{
  "url": "https://moz.com/blog/adt-keyword-ranking-case-study",
  "slug": "adt-keyword-ranking-case-study",
  "title": "How We Ranked a Single Page for 2.6K Keywords Driving 30K Monthly Searches [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By leveraging data-centered campaigns, paired with personalized outreach to top publishers, we regularly garner earned media placements for our clients. In rare cases, we create content that generates results so far beyond what was anticipated that a single project can greatly move the needle. I’m…",
  "content": "How We Ranked a Single Page for 2.6K Keywords Driving 30K Monthly Searches [Case Study] Content Marketing | On-page SEO | SEO Reporting By: Kristin Tynski May 4, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristin Tynski May 4, 2020 How We Ranked a Single Page for 2.6K Keywords Driving 30K Monthly Searches [Case Study] Content Marketing | On-page SEO | SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the last decade, I’ve touted the enormous long-term value of a dualistic approach to content marketing for SEO. By leveraging data-centered campaigns, paired with personalized outreach to top publishers, we regularly garner earned media placements for our clients. In rare cases, we create content that generates results so far beyond what was anticipated that a single project can greatly move the needle. I’m going to walk through one such instance to reveal how it all works together, what can be learned from this experience, and the type of result it can achieve. While typically you need to invest in ongoing content generation and promotion, extraordinary examples like these demonstrate the impact this kind of work has over the long-term. Content marketing + digital PR case study: ADT ADT is a household name with good domain authority, providing a great base to start from. We knew that the content we’d create would likely have a leg up in terms of ranking potential, especially if that content addressed many potential high-intent keywords. Content production After speaking with ADT, we determined our joint goal was to create a piece of content that could earn dozens to hundreds of links from top publishers, with another focus on earning links from local news publications. The client had the idea to create a crime map tool for ADT.com, and it fit the bill for everything we typically look for in a piece of content. But for the purpose of this article, I’ll examine what makes it ideal. Say you were starting from scratch. You can start with a simple Google search of “crime,” which would serve as a reminder of how localized the topic is. Just from this search alone, you can identify the desire for crime maps specifically, and you can consider why someone would search for a crime map: To identify crime in their areaTo investigate the crime in places they’re looking to visitTo investigate the crime in places they’re looking to move Because people might not want to know just about the areas right around where they live, it was a strong idea to create a comprehensive, interactive crime mapping tool that gives users the ability to search local areas and see detailed, local-level crime statistics. This concept had a high chance of success for other reasons as well, including: 1. It has a practical use. Not all content necessarily needs to be practical — it depends on the industry you’re in and whether you can get by with entertainment value. If it’s not practical, it should reveal insights that speak to the human experience and inform a reader about their context in the world. We actually added this element in the crime map project by building in functionality where you can compare the crime rate in your area to national averages. However, having a practical element (or actionable advice) means your content has built-in value. It communicates that you care about the person reading it, and they engage with the content more because they feel like they can do something with the information. 2. It's data-based, making it authoritative and accurate. It’s very difficult these days to pitch publishers anything that isn’t data-based. Not only does it add credibility to what you’re working on, but showing that you did your research also indicates that you’re an authority (or becoming an authority) on the subject. I’ll dive into more on this toward the end of the article. 3. The data can be tailored to countless local angles. If your goal is to build as many valuable links and as much general brand awareness as possible, you should always consider how to localize your content. This has to happen at the beginning when you’re collecting your data. Ask yourself: Is the data set comprehensive enough that insights about different segments, like geographic locations, can be gathered? The more people who can connect with and “see” themselves in your content by having it be as personalized as possible, the better. 4. It invokes emotions like safety and concern for loved ones. Tapping into emotional concepts is always a good strategy when creating content. Crime and security inherently come with some obvious emotions: fear, concern, pride in protecting your family, etc. If you’re in a niche that doesn’t seem to have straightforward ties to emotion, ask yourself these questions to reveal the emotions at work in the background: Why do people care about this?What is our audience’s biggest struggle?What might our audience worry most about? For example, while it doesn't seem so on the surface, personal finance can be extremely emotional. It involves the way people lead their lives and is tied to the guilt of not saving enough, the pride of being on top of their finances, the fear they won’t have enough money to retire, etc. No matter what vertical you’re in, there are emotions involved, and tapping into them with empathy can make your content exponentially more compelling and helpful. 5. As a security company, it makes perfect sense for ADT to be the brand that’s offering a resource where people can check the crime rates all over the country. When you have this sort of brand alignment with an idea, it's clear to publishers and readers alike why the brand created it, and it helps build trust. Always consider these types of criteria when you move forward on a content concept. Digital PR Because of the local/regional aspect of the interactive, our outreach approach was to pitch regional news publishers with the exclusive coverage. We customized pitches for publishers by state for our initial outreach. Here is a sample pitch similar to the one that successfully landed coverage: Hi [Website Name] team, In the wake of natural disasters like Hurricane Florence, fears of looting and other forms of crime are often heightened. The newly released ADT crime map wants residents to be aware of crime hot spots in their neighborhoods and use precautionary measures to prevent being victims of crime, especially during hurricane season. The interactive map allows users to look up specific crime data and compare it to national averages to determine how much crime is happening in their area. For example, Florida’s overall crime rate is 1.21x higher than the national average. That said, the murder rate is relatively low when compared to the rest of the nation (0.03x less). To explore your city using the ADT Crime Map, please visit https://www.adt.com/crime. Interested in covering this so that your readers can stay as safe as possible under any circumstance? If so, feel free to use this press release or graphics from the map. We just ask that you attribute ADT by linking to the Crime Map somewhere in your coverage. Best, [Your Name] Each pitch was personalized by adjusting the first and second paragraph to include locally relevant details for that area. This regional outreach strategy had a high chance of success because: The content was highly relevant to local news publishers Local news publications are often the best syndicatorsWe put together a new, exclusive resource that many consumers would find helpful Offering content as an exclusive makes it especially newsworthy and appealing to writers In this case, the exclusive was given to ABCActionNews.com, a Tampa Bay, Florida ABC affiliate. Luckily, the publisher liked the story so much, they decided to include it in that day’s nightly news coverage. As one of the largest local news affiliates in that area, this coverage was likely seen on over 25,000 local televisions. We continued pitching the story, attempting to exhaust our pitch list and support syndication of the exclusive picked up by ABCActionNews.com. After roughly a month, we compiled a report on all coverage and syndications. We were happy to report to our client that the story was picked up by dozens of local news publishers, eventually generating links from 127 unique linking domains per Ahrefs. The impact on search A graph of acquired links shows a very organic progression — something we see often when a story syndicates well across many domains. Almost immediately the page began ranking — likely a result of the ADT site’s awesome existing domain authority, topical relevance of the project related to the domain, and the massive injection of new unique links to the crime maps page. Don’t have high domain authority? While having an authoritative brand can make this whole strategy a bit easier, that doesn’t mean it can’t work for you if you are newer or are trying to keep up with huge, household-name competitors. It just means it’s even more important that you use data-focused content. We’ve always thought that using data as a foundation for content was the best way to build authority, but a recent study we did with BuzzStream about authoritative content confirmed that. Having an authoritative methodology can increase the chances people trust your content — and thus your brand — by extension. And when you’re trying to get attention in competitive spaces, every authority signal matters. Regarding promotions, all of the tips I’ve provided in this article should work for you. Perhaps when pitching, you can provide a sentence or two describing your brand. It’s also best practice to have someone at your company, either the person who knows the most about the topic or the person who did the research, ready to answer questions that writers may have about the content. But in general, promotional success will be heavily based on the quality of the content you’re pitching, especially if the writer isn’t familiar with who you are. Conclusion Is this type of strategy easy? No. It’s much simpler to pay for links or churn out quick blog posts. But if you’re looking for long-lasting, sustainable, never-to-be-penalized, link-and-authority-building content, this is your best route. As we can see here, a combination of existing domain authority, an injection of a large number of new high-authority links, and a topically relevant/related piece of content for the brand can generate huge numbers of new ranking keywords extremely quickly. If you don’t have that level of domain authority, don’t worry! This strategy can still work for you — just don’t expect it to happen overnight (as that’s so rarely the case for anyone). It’s an investment, but as we’ve seen time and time again, it pays off exponentially. To learn more about keyword research, visit the Keyword Research Master Guide! THE KEYWORD RESEARCH MASTER GUIDE Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How We Ranked a Single Page for 2.6K Keywords Driving 30K Monthly Searches [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How We Ranked a Single Page for 2.6K Keywords Driving 30K Monthly Searches [Case Study]"
    },
    {
      "level": "H2",
      "text": "Content marketing + digital PR case study: ADT"
    },
    {
      "level": "H3",
      "text": "Content production"
    },
    {
      "level": "H3",
      "text": "Digital PR"
    },
    {
      "level": "H2",
      "text": "The impact on search"
    },
    {
      "level": "H2",
      "text": "Don’t have high domain authority?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristin Tynski\n          \n            Kristin Tynski"
}