{
  "url": "https://moz.com/blog/advanced-onpage-optimization-whiteboard-friday",
  "slug": "advanced-onpage-optimization-whiteboard-friday",
  "title": "Advanced On-Page Optimization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this week's Whiteboard Friday, Rand goes into depth on how you can optimize your on-page content. Presented here are five advanced tactics that get you thinking beyond the basics of traditional page optimization and set you up to start creating content that's both relevant and unique.\n\t\n\tHow do…",
  "content": "Advanced On-Page Optimization Whiteboard Friday By: Kenneth Martin December 15, 2011 Table of Contents Copied! By: Kenneth Martin December 15, 2011 Advanced On-Page Optimization Whiteboard Friday In this week's Whiteboard Friday, Rand goes into depth on how you can optimize your on-page content. Presented here are five advanced tactics that get you thinking beyond the basics of traditional page optimization and set you up to start creating content that's both relevant and unique. How do the phrases on your page relate to one another? Does your page content make your visitors happy? By moving beyond simply making sure those title tags are optimized and scattering a few keywords around, we can produce intelligent content that's not only engaging but gets better rankings too. As promised, here is a Quora thread that describes Google's use of Machine learning. Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week, we're talking about advanced on-page optimization. Specifically, I have five tactics for you that go beyond the traditional \"I'm going to put my keyword in the title tag. I'm going to put my keyword in the URL\", those kinds of things. First one, starting out is this idea of semantic connectivity. We talked about this in the past. We did some research a couple of years ago, maybe 18 months ago on LDA, which is latent Dirichlet allocation, which, of course, is a form of topic modeling that we suspected Google might be using. It's a way to imagine the connections between words in a particular language. I'll give you an example. Here is the word \"cat\", and the word \"cat\" is probably closely related to the word \"feline\". If you were a search engine and you saw a document with the word \"cat\" and the word \"feline,\" you would think that document is more relevant to a query for the word \"cat\" than a document that has the word \"cat\" and the word \"whiteboard,\" which maybe that would be very far away. Here's cat and here's canine. Those are much more distant, but cat is relatively closer to tiger, but it's even a little closer to meow. So, you get this sense of, ah, the search engines have a graph of all the words in a language set, how they're connected to each other, what's relevant to what, phrases not just individual words but the two or three or four word phrases. This kind of thing can be very helpful if you're looking at a document and you're saying to yourself, \"Boy, I talked about cats, but I forgot to mention anything about what they eat or what family they're in or what they're related to. I didn't even use the word 'pets.' Maybe, I should be optimizing for those types of things.\" Employing those closely connected terms can help to boost the relevancy and help boost your rankings. Second thing on the list, block level optimization. There is a great YOUmoz post about this that we promoted to the main blog recently talking about precisely this type of thing where search engines will essentially analyze individual portions of a page. They'll look at, oh, here's a sidebar and we've decided that's not really relevant because that's navigational links or here's the top nav. We're not going to analyze that for relevancy as much potentially. We're going to look at the header of the document, where the headline is, those first few sentences. We're going to look at the middle of the document, maybe in paragraph forms, the footer of the document, the end. Are all of those things talking about the topic? Are they all on the subject, or is this something that starts out talking about tigers, but it eventually gets into a discussion on genetically modified foods? If that's the case, maybe it's less relevant to tigers. It's just that the initial headline looked like it was relevant to tigers, and so therefore, we don't want to rank this document for the word, tigers. We might even want to be ranking it for something like genetically modified foods. It just happens to use that catchy title. So, make sure that your document . . . do this kind of check for all of these sections, making sure that they're pertinent, that they're relevant to the content of the query, that they're serving the visitor's interests and needs. If you have that kind of off topic diatribe, and I'm not saying you can't go off topic in your writing a little bit and explore some storyline themes, particularly if you have a long expository piece or you're writing a narrative blog post. That's great. I'm just saying, for stuff that is hyper targeting a particular keyword, especially for a commercial intent or a navigational intent, this might not be ideal. You might want to make those more focused. Number three, internal and external links. I'm not talking about the links pointing to the page. I'm talking about the links that actually exist on the page. You remember some folks from Google have actually in the past said that, yeah, we might have some things, some first order or second order effect things in our algorithm that rewards people who link out, meaning link to other websites. Marshall Simmons from The New York Times was on a Whiteboard Friday a couple of years ago, and Marshall talked about how when The New York Times changed their policy to put more external links on the page off to other websites, they actually saw increases and boosts in rankings from the articles that did that, strongly confirming what Google had said about there being some sort of effect in the algorithm, maybe not directly but indirectly looking at, hey, is this person linking out or are they linking out to good places? If they are, we might want to reward them. Another optimization tactic that's on the more advanced side is putting good external links referencing relevant, potentially useful content on your pages. Linking out to other people is a wonderful thing too, because it puts you into the ecosystem. What I mean by that is if you link to someone else, other people go and visit that page. They might be talking about it. They might thank you for the reference. Someone might see that on Twitter. They might look in their analytics and see that you've sent visitors over and come check out your page and then link to something you've done. That reciprocation is very, very powerful in the organic web, and it can be useful, not only for this direct relevancy boosting signal, but also from a links perspective, from a traffic perspective. Number four on the list, the happiness of visitors to a page. I know what you're thinking. It's sort of like, wait a minute, that's not on-page optimization. That's more like conversion rate optimization. Yes, but it matters for rankings because Google is looking so much at usage and user data. I'm going to ask Kenny, who's filming this video, going to wave, Kenny? That's a great wave. Did you all see that? He looked great. It's amazing. I'll ask Kenny to put in a link to a Quora thread where a Google engineer, somebody who worked at Google, actually talked about how they use machine learning on user and usage data signals in the potential ranking algorithm to help better stuff come up when the rankings may be ordered normally just by their classic on-page link stuff and these types of things. That means that if I can make visitors happier, if I can boost the value of what they're getting out of the pages, I can potentially rank higher too, not just convert more of them but even improve in rankings. We were talking about things like: Are these visitors completing actions? Are they spending more time on this site or page on average with a good experience than they are with others? What I mean by this is it's not just, \"Oh, my time on site is low. I need to find ways to keep visitors on there a longer time.\" Maybe, you have something that's answering a very, very short query in a short amount of time, and that's making visitors happy. And, maybe, you have something that's answering that query but after a long period of time, visitors are actually unhappy and they're going back to Google and clicking, you know what, block all results from this site, I don't want to see it any more. Or they see you in the rankings in the future, and they're like, \"Oh, I remember that domain. I do not want to go through that again. They had those annoying ads and the overlays, and they blocked me from going there.\" Every time I see Forbes, I was like, \"Man, does this article look interesting enough to me to have to go through that initial screen of the ad, because I know I'm going to get it every time, and it's going to take extra time to load?\" On my phone when I'm browsing the Web, I'm always like, \"I'm not going to click on that Forbes link. Maybe I'll check it later on my laptop or my desktop.\" Those types of things are signals that the engines can look at. Are people coming back? Are they returning again and again? When they see this stuff, true they've got 25% market share with Chrome. They've got the Google tool bar. They have Google free Wi-Fi. They have relationships with ISPs. So, they can get this data right about where everyone goes, not just from search but all over the Web. They know what you're bookmarking. They know what you're returning to. They know your visit patterns. This kind of stuff is definitely going to make its way into the algorithm, I think, even more so than it does today. Fifth and finally, some content uniqueness and formatting. So, you're all aware of duplicate content issues, thin content issues, and the Panda stuff that happened earlier this year that affected a lot of websites. What you may not know is that there are a bunch of tactics that you can apply in an advanced on-page optimization scenario that can help, so things like completely unique. When I say \"completely unique,\" what I mean is not that you can't quote someone in here, but just that what you can't have is a mad lib style SEO where you've got XY blank Z blank ABC blank, and it's fill in the city name, fill in the proper name, fill in the name of the business, and that's the same across every page on your site, or that's taken from a manufacturer's description and that's put in there. You need to have that uniqueness throughout, and Google is very good at shingling, which is sort of a method for pattern detection inside topics or inside content. Don't play with them. Just make sure that this is a highly unique piece. If you want to quote something, that's fine. If you want to use media or graphics from somewhere else, that's fine and reference those. I'm not talking about that, but I am talking about that sort of playing mad libs SEO is a dangerous game. We've noticed that longer content, more content is literally quite well correlated with better rankings, particularly post Panda. What you saw is that sites. I'll give you an example. I look at a lot of rankings for restaurant sites, because I'm constantly doing searches for restaurants and types of food because I travel a ton. What I see is that Yelp and Urban Spoon do very, very well. City Search often does well, and then you'll see those independent, individual blogs. When they tend to rank well, when they're on page one is when they've written that long diatribe exploring all sorts of things on the menu with lots of pictures of the food, an experiential post versus a short snippet of a post. You'll find those on page three, page four, page five. They don't do as well. That longer in- depth content, more of the uniqueness, more value in the content, more than I can get out of it as a reader seems to be something that Google is picking up on. I don't know if that's pure length. I don't know if that's something necessarily they're looking at in the user and usage data, but it could be helpful if you're not ranking very well and you're thinking, boy, I have a lot of pages that are just short snippets. Maybe I'm going to try expanding some of them. Using images in media, we've, of course, seen the correlation with alt attributes matching the keyword and images. That's not what I'm talking about necessarily, but using images on the page can create more of that in- depth experience and can create a better relationship between you and the visitor. Those things could be picked up and used in other places, and then they'll link back to you. There are all sorts of benefits. User generated content, so getting comments and interaction down here at the bottom, that type of stuff often is an indication in search engines that, hey, people really care about this. It's also an addition to the amount of content, and it tends to be very unique and valuable and useful. It uses those words that people on the Web would be using about the topic, and that can again be helpful for your content optimization. Then, finally, Google is clearly looking at things like reading level and correctness of grammar and spelling. There's now a filter inside Google. If you click on the advanced search in the little gear box on the top right- hand corner of your screen when you're logged into Google, you can see advanced search. When you click that, there's a reading level filter to say, \"Only show me content that's 12th grade and above.\" Clearly, Google has that ability. What I'm saying here is that your content formatting, the way you're putting things together, the length of the document, the in-depthness, and the correctness, these can all have an impact. Don't just be thinking about keyword stuffing and using a few keywords here and there and putting it in the title at the front. Be thinking a little bit more broadly about your on- page optimization. You might get more benefits than even doing some link building, sometimes. All right, everyone. I hope you've enjoyed this edition of Whiteboard Friday, and we will see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced On-Page Optimization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Advanced On-Page Optimization"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kenneth Martin\n          \n            Kenneth Martin"
}