{
  "url": "https://moz.com/blog/advance-seo-career-whiteboard-friday",
  "slug": "advance-seo-career-whiteboard-friday",
  "title": "How to Advance Your SEO Career – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As SEOs, we know how to optimize websites, but what about our careers? In this episode of Whiteboard Friday, Noah shares his insights from his own search marketing career path, with tips for those people in the beginning and middle stages of their career.",
  "content": "How to Advance Your SEO Career – Whiteboard Friday Whiteboard Friday | Marketing Industry By: Noah Learner March 3, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Noah Learner March 3, 2023 How to Advance Your SEO Career – Whiteboard Friday Whiteboard Friday | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As SEOs, we know how to optimize websites, but what about our careers? In this episode of Whiteboard Friday, Noah shares his insights from his own search marketing career path, with tips for those people in the beginning and middle stages of their career. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans. This is incredibly exciting to be with you here today for Whiteboard Friday. Most of these help you with really cool strategic and tactical stuff, and today we're going to be optimizing something super different. It's your career. It's the most important thing in the world. This talk is going to be especially useful for people in the beginning and middle stages of their career. Perhaps you've just started out in your journey in SEO, perhaps you've started to take on some more challenging work, perhaps you're given more areas of responsibility, and you're trying to understand how do I get to that next step. You're thinking about, \"How do I go from maybe being a specialist to a manager, to a senior manager, or maybe even better, to a director or a vice president in an organization?\" For me, this was a really exciting journey. I want to share with you some thoughts that I've gathered along the way in the hopes that you, too, can have a little bit of the same kinds of outcomes that I've been able to do. The steps are pretty simple. The execution takes time and a lot of dedication and a lot of effort. So if you're a striver, a trier, someone who just really has a lot of energy and drive, you're going to get a ton out of this today. The first thing that I want to say is that if you are just slightly strategic, just slightly strategic, imagine yourself as a shepherd and you're up on top of a mountain and you have all of these sheep, and all you know is that you need them to go downhill. It's that level of strategy that's necessary to get to the next place. You don't have to know everything. You don't have to be an expert in all areas of SEO, and we'll get into that in a second. What are we really talking about? We're talking about craft, and we're talking about people primarily in this process that we're going over. For me, a lot of this comes from a blog post that I read by a guy named Jason Roberts. He published this in 2010. It'll be a link in the show notes. For him, it was called the Surface Area of Luck. This blog post blew my mind when I read it, because it's all about the doing. It's about the craft. It's about the skills. It's what we learn, it's what we do, and it's about the telling. It's how we communicate to others the qualities and the skills that we bring to the craft every single day. So what we're talking about are things like learning how to do great work and how to tell people about it. The better we do and the more skills we learn and the more people who know about it, and it's not just all of the people, it's the right people, that will accelerate your career through all those steps that I talked about before, whether it's from specialist to manager, manager to director, or director to vice president. So what are we really talking about? We're talking about getting smarter. We're talking about when we start in SEO. I think it's crazy important to start in an agency environment. My theory is that if you're in an agency, you're exposed to all different types of problems and all different types of clients and all different types of verticals. As you get started, part of learning is learning how to think. It's learning how to make decisions. It's learning how to look at data. It's learning the fundamentals of the web, how to build HTML, maybe some cascading style sheets, maybe a little bit of JavaScript, just a little just to know what it is. Learning a lot about different types of SEO with different types of clients, learning the challenges that happen in a local SEO type challenge, learning about the challenges that come into play when you're learning how to build content, learning how to build stuff around strategy, learning all about e-commerce SEO as well. So getting this wide array of exposure so you can learn all about the different types of problems. What you're going to find in that process is you're going to start getting excited and passionate about something, and you're going to find yourself talking to people, and you're going to find yourself following people on social media that are experts in one specific thing. You're going to watch Whiteboard Fridays about specific topic areas. You might find yourself going super deep into technical SEO. You might find yourself going super deep into e-commerce SEO. You need to listen to that, because that's your inner self telling you where your passion is. This is our Moz-shaped superpower. This whole process of learning is really important, and it's really important because it helps you unlock your superpower. Going from going wide, almost like what Rand talked about all those years ago with a T-shaped marketer, that's a lot what we're talking about, getting a really nice wide foundation early in our career so that we can unlock what our superpower is. What is our superpower? It's that thing that keeps you up at night. It's that thing that when you wake up, you think about. It's that thing that you can't find yourself stop talking to your colleagues about or reaching out to other people on social media. Notice, when we start talking about reaching out to people on social media, that's where we get into the people portion of this process. So once you find your superpower, you want to get really, really good at it, and you're going to find yourself up-skilling religiously. You're going to learn all kinds of new technologies. You're going to learn processes and workflows to help you get the most out of that superpower. This is where we get to the next stage, and this is incredibly powerful. As you start to improve and start to go down that path, remember this concept of the sheep. When you start to unlock your superpower, it doesn't mean that you're going to end up walking in a straight line. It's going to be meandering, and it's going to be in a direction, and you should expect that and be open to change and open to possibilities. Once we know what our superpower is, we can start to think about our board of advisors. These are the people who are 6 to 24 or 36 months ahead of you. The reason that we're targeting that very specific range of time and world of experiences is that they're going to be able to have all of the same recent learnings and recent challenges that you're going through in the back of their own minds, and they're going to do everything that they can to help you. So start to pay attention on social media, places like Twitter, places like LinkedIn, and start following the people who are doing the thing that you're really passionate about. Start liking and commenting on their tweets, maybe comment, and eventually you're going to find yourself reaching out to them directly and saying something like this via a direct message. \"I love what you're talking about and the problems that you're working on. Would you be open to a Zoom? I'm trying my hardest to build my network, and I'd love some time. Thoughts?\" Keep it really simple, value their time. What you're going to find is that if you're kind and you're nice, people will go above and beyond to help you in your career. So we're building our board of advisors here. What you're going to find is that these people care a ton about your outcomes, and they're going to do whatever they can to introduce you to other people who are going to be able to help you as well. Now that we're talking about people, we all know how to be a good person. The core of it is being nice. You're going to find, and this has played so well for me in my career, that if you're kind, genuinely caring about your peers and colleagues across our industry, you're going to find that the industry will open up to you like an oyster. More things on people. You're going to find a need to connect with these people who share that same passion, and that's when we get into this idea of community. This is critically important. When I started in SEO, I had no idea how I fit into anything. I had a 20-year career doing retail, and I also had a lot of experience building websites, but I didn't have direct SEO experience. I knew I liked automation. That was my sheep down the mountain moment. But I didn't really see my community. I would advise that you try and find one on Slack, Discord, or maybe a YouTube channel that you're really passionate about. If you don't see a community, make one. Sounds crazy, right? Then, after you join this community, you're going to find that if you're producing content, we're telling mode, we're telling the world about what we do, if you're producing content, whether it's a podcast, a YouTube channel, or maybe it's articles because you don't feel comfortable yet being in front of your peers, maybe imposter syndrome is still like totally overwhelming at times, you're going to find that starting to get in touch with that community is going to open up more and more doors for you. It's this concept of the Luck Surface Area. The more we do and the better we get at it and the more people that know about it, the better our world will become. What you're going to find is that the next stage, if possible, if you can get yourself to that place, is to consider speaking in public. You're going to find that that's incredibly powerful. If it sounds scary, start really, really small. Go bigger, start at a local meetup, speak at a local conference, try and go a little bigger and see what your comfort level is. If you like it, you're going to find that there's no better opportunity for opening doors for you. So that's it. It's the Luck Surface Area. If you embrace this and really dedicate yourself to upskilling, you're going to develop the types of skills and relationships that make you impossible to ignore in our industry. If you do that in five, six, seven years, you'll be able to move from being a specialist through management into being a director and hopefully a vice president. I hope you guys got a ton out of this today. I'm super grateful to be here, and y'all take care. Cheers. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Advance Your SEO Career – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Advance Your SEO Career – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Noah Learner\n          \n            Noah Learner\n          \n            Noah Learner"
}