{
  "url": "https://moz.com/blog/advanced-white-hat-seo-or-how-i-learned-to-stop-chasing-rankings-and-love-my-users",
  "slug": "advanced-white-hat-seo-or-how-i-learned-to-stop-chasing-rankings-and-love-my-users",
  "title": "Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Irrelevant Preamble    I am not now, nor have I ever been, Darren Slattern.     My reasons for stating this at the start of this post are two fold:    ·        Scurrilous rumours to this effect were posted in the comments of my ...",
  "content": "Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users Public Relations L By: LGTim July 21, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: LGTim July 21, 2008 Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Irrelevant Preamble I am not now, nor have I ever been, Darren Slatten. My reasons for stating this at the start of this post are twofold: Scurrilous rumours to this effect were posted in the comments of my previous blog post. I will quash them! I’m writing in response to one of his recent posts on YOUmoz that was received lukewarmly by the SEOmoz community. Of course, I am willing to accept the possibility that I am in fact Darren Slatten and am not aware of it (in a Fight Club-esque piece of schizophrenia). However, for the purposes of this blog post, I will operate under the assumption that I am not. Relevant Preamble Having previously blogged about my SEO n00bishness, the title of this post may indicate that I am punching somewhat above my weight. This is true. However, having read Darren’s post and the many concerned responses to SMX Advanced (yes, I spend too much time on Sphinn. What of it?), it seems like this is a seriously sticky question for many people in the whitehat SEO community: What is Advanced Whitehat? Is there such a thing? I’ll preface everything I’m about to write with the blanket disclaimer that this is supposed to provoke discussion, not provide answers. It’s food for thought – comment bait, if you will. Anyway, enough preamble; let’s get stuck in with some dramatic emboldened statements. Blackhats Will Always Have the Google Algorithm by the Balls The algorithm is an equation – a very sophisticated equation veiled in Cuttsian mystery, but an equation nevertheless. Numbers. Figures. Variables. With any equation, the blackhats will always be ahead of the game, will always have more knowledge of how the system works and how to game it. They work in automation, calculating what variables the search engines work on and creating programs to feed them precisely what they want. Shady made an interesting post about this a while back. To quote him: Blackhat sites are typically a hyperbole of whitehat sites. Everything is more. More speed, more pages. Extremely good, or extremely bad links. Identical anchor text, or purposefully randomized anchor text. Many internal links, or none at all. And you control these variables. It’s truly incredible for research, and finds the “breaking points” much faster than most whitehat sites. If you take “Advanced SEO” to mean “understanding how the algorithm works and learning how to game it,” blackhats are the ones who are advanced. Typically, whitehats don’t have the research to understand the algorithm so precisely, and cannot/will not try and game the system in the same direct way. Whitehats want to improve the quality and relevancy of a website, but a computer doesn’t know what quality and relevancy are. It only knows how to create rough approximations of quality and relevancy through numbers and figures – numbers and figures that are all too easy to game. Rankings Addicts: Just Say No The problem is that most SEOs, whitehat and blackhat, treat the SERPs as one massive scoreboard (or rather, billions of different scoreboards). It’s a human instinct – Tarzan see numbered list, Tarzan want to be top of numbered list. Tarzan want to be king of jungle and king of Google! I’d suggest we need to take a step back from rankings. They are NOT what SEO should be about about. Perhaps SEO is something of a misleading term (and maybe we should let Jason Gambert get his filthy paws on it so we can come up with something better). You aren’t optimising a site for search engines, unless you run a business selling luxury holidays or funky t-shirts to Googlebots (someone, I beg you, please Photoshop this concept). You are optimising for human users – the search engines are only a tool to connect the two of you together. In any case, you are trying to attract relevant traffic that will convert into sales, enquiries, use of a website’s resources, whatever your objectives are. Of course, being higher up in the rankings helps this, often significantly, but it isn’t the end goal of whitehat SEO. In the chase to climb up the rankings, it's all to easy to forget why you're trying to do it in the first place. Rankings are a means to an end. If you can get to that end by other means – by what I would argue are qualitative means – then so be it. (For anyone who didn’t intern at a market research firm – qualitative and quantitative definitions.) Qualitative vs Quantitative Search engine algorithms will always be quantitative computers pretending to be qualitative human beings Blackhat SEO will always be better at gauging and manipulating quantitative data Human use of the internet is a qualitative experience Whitehats will always be better at improving qualitative experience Buried beneath the flame on the comments on Darren’s post was a very interesting quote on advanced whitehat (quoting Lisa, whoever she may be), which simply said: \"It's about analytics.\" This is massive. Not analytics in the way that blackhats approach it – map out the equation, game the variables, boost the rankings – but qualitative research into user behaviour. Keyword research and site analytics are the starting points for this – the rest comes from communication with potential customers and imaginative thinking within your market niche. This article gives a very good summary of this concept, which can perhaps be summarised as: Basic SEO is learning to think like a machine Advanced SEO is remembering what it is to be human being again Sweeping Conclusion So what is advanced whitehat? Using analytics, empathy, imagination, and just plain common sense to figure out what users want and giving it to them, or even figuring out what they don’t know they want and giving it to them. It isn’t as narrowly defined as “achieving top rankings for specific key phrases;” it is involved in the much more subjective field of “making websites better.” It requires a lot more creative thinking, usually requires a close relationship with your clients, and has no guaranteed results or clear methodology - but hey, that's what makes it advanced. Basic whitehat makes websites visible and gives the rankings a little boost. Advanced whitehat is the production of outstanding online resources. It isn’t about being top on the Google scoreboard: it’s the quest to be remarkable within your niche. Become remarkable and those rankings will follow sooner or later (usually later) – but high rankings alone never made anyone remarkable. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Advanced White Hat SEO, or How I Learned to Stop Chasing Rankings and Love My Users"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LGTim\n          \n            LGTim"
}