{
  "url": "https://moz.com/blog/advanced-seo-keyword-research-tips-and-ideas-14216",
  "slug": "advanced-seo-keyword-research-tips-and-ideas-14216",
  "title": "Advanced SEO Keyword Research Tips and Ideas! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post is for anyone who is an SEO, Online Marketer, Domain Name Buyer or PPC in general and does keyword research using the Google Keyword Tool. Don't get me wrong -- keyword research is a very important aspect for SEO and if you do not do it correctly you can make a huge mistake by targeting…",
  "content": "Advanced SEO Keyword Research Tips and Ideas! Keyword Research By: James Norquay October 18, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: James Norquay October 18, 2011 Advanced SEO Keyword Research Tips and Ideas! Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This post is for anyone who is an SEO, Online Marketer, Domain Name Buyer or PPC in general and does keyword research using the Google Keyword Tool. Don't get me wrong -- keyword research is a very important aspect for SEO and if you do not do it correctly you can make a huge mistake by targeting your whole SEO campaign around specific keywords which are not all that correct. Some times the data can leave you a bit angry when you compare it with other real time sources or more accurate PPC data. I have decided to do a bit of a write up how you can use incorporate some more advanced elements into your keyword research process, rather than just having the standard keyword with search volume. I would like online marketers to start thinking differently about how you gather your keyword research data. Sure enough I am sure many savvy SEOs have already incorporated some of the elements I am going to talk about in the post. Step 1 - Selecting The Keywords! Finding out which keywords you want to utilize for your keyword research, can be a long process especially when you are working with e-commerce clients, some ways in which you can speed up the process include: Looking at what keywords competitors are targeting. Gathering a list of products and categories from your client. Talking to internal stake holders in the business and gathering ideas such as copy writers. Looking at the current site structure. Using search engine auto suggest scrapers to find related keywords. Taking ideas from Google Keyword Tool. Using other keyword research tools such as Wordtracker. Step 2 - Sorting The List In Google Keyword Tool! OK, so you have worked out the keywords in which you wish to target. Now the next step head over to the Google Keyword Tool. For my example I will be using the following example: Market: Australia Keywords: Fashion Related Page I will be targeting the following keywords for a new page I am creating: online fashion plus size fashion fashion clothing fashion clothes fashion online ladies fashion mens fashion australian fashion online fashion accessories fashion stores online guys fashion girls fashion men's fashion women's fashion Now do the following: Sign into the Google Keyword Tool and make sure you log into your Google account. You would be surprised how data is different from beeing logged in and logged out. Copy and paste in the keyword you have selected. Make sure you select [Exact] match type. Select your region (for me I will be selecting Australia) then select the devices you wish to scan. click for larger view Now once you have done the above, do the following: The key area to look at is the Local Monthly Searches, unless you are targeting a global brand. Be sure to monitor the keyword ideas section. Click download as CSV for excel. click for larger view Step 3 - Adding In Some Keyword Difficulty Scores From SEOmoz! Open up the fantastic SEOmoz keyword difficulty tool here: https://analytics.moz.com/tools/keyword-difficulty/and place the keywords for which you will get the competitive data. If you don't use SEOmoz then try out Market Samurai, though after recently API updates with Yahoo it has run into some trouble. Now take all the numbers above and place them in a text file which you can copy across to your excel csv file you are building. An extra keyword research blog post worth looking at is by Jahn an up and coming SEO who I have been managing for 12 months he has more keyword research basics here: http://www.seobrain.com.au/keyword-research-basics/ Step 4 - Adding In Some Social Media Data! Another advanced idea with keyword research is adding in social media data into your keyword list, it can provide extra information for your keyword list. I used the three following tools for my social media analysis: Buzzmetrics by Nielson: Buzz Metrics (Paid)Topsy: http://www.topsy.com (Free)Social Mention: http://www.socialmention.com (Free) You can also use other tools such as Radian 6 (Paid) Buzz metrics data was already tracking Australian related websites which we have used for the fashion niche. Data from Topsy and Social Mention is more focused on US data I have decided to use Buzzmetrics for my social data. If you are in the USA it would be advisable to check out Topsy and Social Mention or Radian 6. Once you have scanned all the websites you will be able to see mentions data per keyword be sure to refine your search data from social monitoring tools as it can easily become skewed out. Topsy data is another fantastic source of information for social sharing data. It is advisable to use the \"Advanced Search\" field. Social Mention is another great free social monitoring tool. It is advisable to use the Advanced Search section. Step 5 - Adding In Your Paid Search Data! The great thing about working with paid search teams is that you have paid search data at your fingertips to use, you can have impression data for specific keywords, CTR data and also conversion data if you are selling products. You can easily match up the data with a vlookup in Excel. Step 6 - Your Excel Template! Now your excel file should be gathering some extra fields and you should have some extra data, an example of what you will see is as below. Now my next step is to color in the various keyword which match what you want to target, for example I do not want to target any keywords which have higher than 45 keyword difficulty in SEOmoz and also below 350 exact monthly searches. You can set rules in excel to do this step quickly. Also you can select lower sections for your social mentions, impressions, CTR and conversions it really comes down to personal preference and time allowance. - Also please note the figures above are only a guide, I have just made this template to show potentially what the data could look like. Conclusion! Overall this is just a guide and a few quick keyword examples to show areas you can incorporate into your keyword research, sure all clients and verticals are different so you need to switch up your methods for each new niche. You can also find various other methods in which you can incorporate into your keyword research, finally if you have any additional methods you would like to add please share them in the comments section below! If you want more SEO and Social Media advice please check out the following places I am active on: My Blog: http://jamesnorquay.com My Twitter: http://www.twitter.com/connections8 My Linkedin: au.linkedin.com/in/norquay Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced SEO Keyword Research Tips and Ideas!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Advanced SEO Keyword Research Tips and Ideas!"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Norquay\n          \n            James Norquay\n          \n            James Norquay"
}