{
  "url": "https://moz.com/blog/advanced-citation-audit-clean-up-achieve-consistent-data-higher-rankings",
  "slug": "advanced-citation-audit-clean-up-achieve-consistent-data-higher-rankings",
  "title": "Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Cleaning up your citations is not as easy as waving a magic wand or blinking while wearing your Google Glass. Read on to find out how to audit your citations and clean up your local listings!",
  "content": "Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings Local SEO | Advanced SEO By: Casey Meraz July 9, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Meraz July 9, 2014 Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings Local SEO | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Did you know that having consistent and correct citations is mandatory for any successful local SEO Campaign? If you've read the 2013 Moz Local Ranking Factors survey or you've been in the local SEO game for a while, it's no secret how important citations are to ranking locally in Google. In fact, citations and external location signals are the 3rd most important ranking factor according to the Moz local search ranking factors survey. This is why it's essential that you have your correct NAP listed across the major citation sources. So what is the NAP format? NAP stands for Business Name, Address, and Phone Number. Having this information listed on another website such as Yelp, Citysearch, or Yellowpages acts like a positive vote for your local listings. While many people know they need to build citations to help increase their local rankings, surprisingly many people overlook having duplicate listings and incorrect listings. Some people think they only need to update their Google My Business listing which is incorrect. In fact, according to David Mihm from Moz \"If all you're doing is updating your Google+ Local Page, you're going to continue to see problems because \"new\" erroneous data will constantly feed into Google from all of its other sources.\" This has been known to create bigger problems down the road. So what is the downside if you have inconsistent citations, duplicate citations, or citations that are just plain wrong? In a nutshell you're missing out on getting credit for that citation, it's hurting your local rankings in Google, and its potentially creating longer term issues when the incorrect data is scraped. Unfortunately while there are some resources you can use to simplify this process, it's not as easy as waving a magic wand or blinking while wearing your Google Glass. Let's Start With The Basics: What is an Incorrect NAP? So what is an incorrect NAP? The long and the short of it is that Google and other search engines want to give you credit for having your business name, address, and phone number listed on other reputable websites. It acts as a vote of confidence for you similar to a link in organic SEO. You should make sure that your Google My Business Listing has your correct NAP format the way you want it displayed across the web. If any of this information is not the same as it is listed in Google My Business then you may not be getting credit for it. Additionally if you have a duplicate listing it could be hurting you as well. Just because you didn't create or publish the incorrect information doesn't mean it's not polluting the local ecosystem. There are plenty of ways this can happen as I discuss a little later in this article. But first, let's take a look of some good and bad examples of correct and incorrect NAP. How Exact Do These Citations Need to Be? As you can see from the examples above, I was very clear with the items I changed from the correct example. Although Google has gotten good at detecting minor differences, you should always aim to be the least imperfect. The whole reason we are fixing these in the first place is to make it easier for Google to associate the proper listings together for your business. Minor differences such as Street and St. should not be an issue. However, incorrect, duplicate, or false information is a big no no. The long and the short of it is that the Business Name, Address, and Phone Number you want to use should be 100% correct in your Google My Business Dashboard (formerly Google Places, Plus Local, etc.). From here, you can copy this exact format on every source you wish to get a citation from. Overall, there are three types of citations we're trying to fix during this process. These include: Duplicates -Duplicate listings on the same directory Mismatches - Listings for your business that have the wrong Business Name, Physical Address, or Phone Number (or just the 800 number and no local number). This can get especially complicated for doctors and lawyers, as I will discuss later in this article. Incomplete Citations - It's important that you fill out the profiles to completion once you've claimed them. This includes adding photo and filling out every field there is an option for. How Does This Happen & What Causes These? Just because you don't remember creating an incorrect listing doesn't mean there is no bad data in the local ecosystem. In fact, here are just some of the common reasons you have incorrect NAP across the web: Your business moved physical locations You used tracking phone numbers at one point You hired an SEO to create citations or get listed on online directories The data aggregators have incorrect information You inherited a dirty phone number You changed your local phone number You used tracking phone numbers You used an 800 number and not a local number You have different trade name or business name variations Your listing was incorrectly submitted and scraped to other sites Someone in your organization setup the listings without knowledge of NAP consistency (this is pretty common) While there is a major possible ranking benefit of cleaning up this data, there is another reason it should be on your radar too. If you're a fan of brand consistency like me, then you want to be the least imperfect and ensure all information about your company is accurate across all mediums you control. The example below shows just how confusing this data can be and the issues that can be caused by incorrect citations on one of these sites. (Graphic from David Mihm's Local Search Ecosystem) Before We Start: Here are Some Important Things to Know If you're paralyzed just thinking about the hundreds you need to fix, don't sweat it. While a good long term-goal would be to clean up a lot of the data, the reality is that your first focus should be on the top citations for your industry and city. Also check out Phil Rozek's list here and the Top 50 Citation Sources that Whitespark mentions on this page. Focus your efforts on the primary citation sources for your niche and area. Once these are fixed up you can move on. Just spend 15 minutes a day cleaning this up. Keep good records using this spreadsheet. You will need to follow up with these directories again and again in some cases. Don't worry, I made a spreadsheet below that you can use for this. Make sure to update the old incorrect citation instead of just adding new ones! This work can be tedious, but accuracy is essential. Don't try to use shortcuts. Read Moz's case study from David Mihm regarding cleaning up citationsLet's Start By Identifying Possible NAP Variations & Recording Them In the Spreadsheet The first step in the citation cleanup process is to find out exactly what information is actually out there about your business. I put together an awesome spreadsheet you can use here. The first tab has a place to post the duplicate information. I like to color code it for simplicity as you can see in the example below: In the example above, I have the correct business information at the top of the spreadsheet in green for easy reference and the incorrect variations in red. You will want to record every variation you find here to make our job a little bit easier moving forward. But how do you find the incorrect variations for your client or business? I prefer to start at the source by talking to the business owners and marketing managers. After you have collected their proper NAP info, ask these questions to see if you can get any details: Have you ever moved physical locations? Is this the address you have listed on your legal business paperwork with the State and Federal government? Have you ever used tracking phone numbers? Have you ever hired an SEO company or someone to manage your online presence. Do you have a list of logins or websites they submitted you to? Do you use any lead generation services? (Sometimes they use tracking phone numbers) Does your business go by any trade or fictions business names? Typically asking these simple questions up front can save a lot of time in the long run. If you don't get any good info from them or they just don't know there are several ways you can look for this information online first to make your life easier. After You Have Asked the Questions, It's Time to Do Your Own Investigative Work While the questions above are helpful, it's important to dive a little deeper and see what you can find. These are the steps I typically take: Check the secretary of state's filing for the business. Most have an online search platform where you can see who registered the business. If it has a different Name, Mailing Address, or Phone number go ahead and add these to the spreadsheet. We will want to check these out when searching for duplicates. (BONUS TIP: Search their filed business documents online and see if they had previously filed for a fictitious business name or DBA.) Review the company BBB listing. Check out Phil Rozek's article on his BBB Hack for finding possible conflicting information. The long and the short of it is that the BBB.org business listings show additional reported phone numbers, business names, and addresses as shown in the example below from his website. Check Google Map Maker. By viewing the classic Google Map Maker, you can see the edit history of a business. This will tell you if a phone number or business name has been changed. To get this data simply pull up the Classic Map Maker, search for a business and then select the history tab. Once you're on the history click \"Show All Changes\" in the upper right corner of the listing as shown below: Once you have clicked on this, it will show the entire edit history. Look for edits to the NAP over the time the listing has been live. In the example below, you can see how the business name was actually changed at one point. This is the business name I will want to record in my spreadsheet (the old one). Once you feel like you have a good handle on this, you can start by moving on and searching for these culprits hiding across the web. Now it's time to get fixing! Here is a Quick Way to See What NAP Variations Google Already Associates with Your Business If your business is recognized by Google and has reviews on other websites the new Google My Business dashboard tries to condense that information in one place. It provides examples of listings it has associated with your listing already. I recommend checking this to see what differences it recognizes for your business and mainly used for reference. If Google detects an inaccurate citation, don't assume that it will find others. Remember, always aim to be the least imperfect. To access this simply follow the steps below: Login to your dashboard at www.google.com/mybusiness Open up one of your locations and scroll down to the reviews section. Click the blue \"Manage Reviews\" button Then scroll down and check under the \"Reviews from around the web\" heading and see what pops up. You should see the listings here of other detected reviews. You can click the \"View full review on....\" link and view the full review there. Check the NAP for that citation and see how or if it varies from your correct NAP. Record the differences as we can use them later in this guide. Start With the Data Aggregators Before Your Manual Efforts Tools are great and help make tedious jobs like this easier. While there are some tools I advocate for this job, the reality is that most of them don't cover the niche specific directories and others you may be listed on. That being said there are some great tools you can use to help save time and money and are recommended in my overall procedure below. Start with Moz Local. Moz Local provides a Check My Listing score which will scan your listings just by entering your Business Name and Zip Code. This will give you a score that includes the citations that are Complete, Incomplete, Inconsistent, and Duplicates from the Top 15 citation sources and data aggregators. If you're not starting here, you might be shooting yourself in the foot. Signing up for this service which is $50 a year will help fix this data at some of the sources that distribute their data to many other providers across the web. You can also use this service to find other possible NAP variants. Consider additional tools to see if they will help you. My manual methods are below but if you want to pull other data, you can also check out Brightlocal's Local SEO Checkup product which will show you NAP variants and the accuracy of major listings. You can also check out Whitespark's citation finder to start with a list of sites it detects you being listed on. They both offer great citation finding resources which will make this a bit easier. Also, Yext just recently introduced a product for fixing duplicates. While I have not had a chance to review this yet I believe it's only for their network and it is a paid service. Once you're ready, it's time to move on to the manual side of NAP Cleanup using my method below. The Manual Cleanup Process When dealing with citation cleanup, efficiency and accuracy is the name of the game. I have developed a process that I find works best for me when it comes to being productive in fixing citations and removing duplicates. This is what I'm going to explain below in more details, but basically it boils down to four steps. On the second tab of this spreadsheet that I created for you, you will see the sheet has several columns. They are identified and explained below: Website Put the domain of the citation source. This will help you sort it later for easy tracking. Business Name Copy and paste the business name from the citation you want to keep here. If the one you want to keep is wrong, paste it here anyhow. We will correct it later. Address Copy and paste the address including suite # from the citation you want to keep here. If the one you want to keep is wrong paste it here anyhow. We will correct it later. City State Zip Copy and paste the City, State, and Zip Code from the listing here. Phone Copy and paste the Phone Number from the listing here. Links To Put the URL that the citation is linking to if applicable. Issues Put the main issue here. Mention all issues if possible. If the citation is a Duplicate and has an incorrect name I would put \"Duplicate | Incorrect Business Name\" URL Of Live Listing Copy and paste the URL of the citation source so we can refer to it later if needed. Duplicate 1 Copy and paste the URL of any duplicates here Duplicate 2 Copy and paste any duplicates here Status I added a status column to check and update the status. Sometimes when you contact them they may not be prompt. Green If you highlight the row in this color, you have confirmed there are no issues with this citation and no duplicates. Yellow There is an issue with this listing like the company name is missing \"The\" in front of the name or the suite number is not perfect. Basically this is for minor secondary issues that don't need fixing, but you could fix them if you wanted to. Red If there is a major issue with the NAP such as wrong Name, Address, Phone Number or a Duplicate you can mark it as red. This will help us to prioritize our work later. Below are two screenshots of how the spreadsheet looks when you pull it up. Once you start finding the citations, you will want to color-code each row after evaluating the citation. This will help you prioritize your work later once your're ready to start fixing these up. The Process Audit Your Citations - Using my spreadsheet and the methods listed below you can start by auditing every citation source you find for your business. Record the Data - Record the NAP information in the spreadsheet provided and don't be shy with the details. After you have identified a problem make sure to color code the row. Red is a very important fix, Yellow is something you can fix but can wait, and Green is good meaning there are no problems and no duplicates. Outreach & Fix - Once you have a list of your action items, you can sort the list by RED or priority items. You can then outreach to these sites and record it in the notes with the date. Follow Up, Record, & Repeat - You can't just send an email or contact form and call it good. You have to follow up. Don't change the color of the row until the live listings are fixed. This will allow you to check and re-check until these issues are cleaned up. The reality is that some of these listings will require multiple contacts to get fixed (just like link removals). Finding Your Incorrect Citations Finding these citation sources can be a difficult task. However, if you already have a list of primary citations you want to tackle you're in a good spot. Remember that focusing your efforts on the primary sources will provide the most ROI. Remember that when you're searching for citations using these methods you will want to search for each of the ones you identified to ensure complete accuracy. In other words, don't just search a directory by the proper business name or phone number. Also, search it with the WRONG information you identified to see if any wrong sources come up. Method 1: Search Specific Directories & Websites If you only have one business location this task gets a bit easier as there a search string you can use to narrow down your results. However if you're a multi-location business it may not work as well (depending on how many locations you have). This search string is going to use three commands. The first command site: searches only within the website immediately following the colon. If I just wanted to search Yellowpages.com I could type site:yellowpages.com. Now putting information after the site command will help narrow down your search. Let's say that I wanted to search only YellowPages.com for my exact company name, but only for listings that DO NOT contain my primary phone number that is associated with my NAP. In this case I could put in this search: site:yellowpages.com \"The Reeves Law Group\" -714-550-6000 The site: command tells Google to search only the website (in this case YellowPages.com) The Quoted \"The Reeves Law Group\" tells Google to only return results that include the company name in that exact phrase order The -714-550-6000 tells Google to not include any results that use this phone number. The minus allows you to exclude information you don't want to appear in the results. If you have a list of citation sources you want to check such as the Moz Top 10 by City or Industry, you could then use these search strings, identify duplicates and problems on the primary sites. Most reputable websites also have an internal search function as well. It's important to check this too as the Google Site: command only searches for indexed citations. It's possible that the incorrect one may not be indexed yet, but could cause problems in the future. Method 2: Searching Google's Index Citations While you can search specific directories for incorrect citations if you already know the websites you want to check, what if you don't have that list? Another easy way is to pull the incorrect results direct from Google. To do this we will use the MozBar and modify our search settings which allow us to scrape 100 results at a time. Simply follow the example below. Before using this method, you need to change your search settings in Google Start by pulling up Google.com and clicking on the gear icon in the upper right hand corner of a search page. You will want to navigate to search settings where you will check the button \"Never Show Instant Results\" and then change the Results Per Page slider to 100. This will allow you to search 100 entries as a time. You can see the settings we changed in the picture below: You will also need the MozBar for this. If you don't have the extension you can download the Chrome version here and the Firefox version here. Once you have the MozBar installed you will be ready to start scraping these results! When the MozBar is on and you do a search in Google you will now be able to see 100 results and easily export them by clicking the export button in the top left corner of the MozBar as shown in the example below. Once you have these results you can copy and paste them in my trusty spreadsheet for evaluation. Of course if you're doing a lot of searches I recommend conducting the searches first, combining the results, and then removing duplicates in Excel. This will save you a ton of time! So Which Search Operators Should You Use? Using the proper search operators and getting a bit creative will save you a substantial amount of time. Don't think that you're stuck with the ones I have provided below. Get creative and think outside of the box based on your situations. Below are some examples you can use along with an explanation of them. They are sorted by categories below. Casey's OCD Pro Tip: Using Google can produce different results depending on how the data is entered on the actual citation site. For example it's a good idea to search different Phone number variations. Some variants include: 111111111111, 111-111-1111, (111) 111-1111 Take note that when you do a search with quote around the keyword (e.g: \"Keyword One\"), it will search for the words in that order exactly as they appear. If you want to learn more about creative boolean search terms check out this resource. How to Find Listings With Incorrect Phone Numbers What you should search: 800 Number -Local Number Example: 800-644-8000 -714-550-6000 This search when preformed in Google is telling it to search for the main company's 800 number (800-644-8000), but exclude the local phone number of the main office (which is why I used the - sign before 714-550-6000). If you have one location that uses or used an 800 number at some point this will be your primary go to search. If you have multiple locations though it will likely just return results from the other locations. You could of course add - to additional offices and search this way as well. What you should search: 800 Number -Local Number +Company Name Example: 800-644-800 -714-550-6000 +Reeves Law Group At first glance this search operator probably looks like the one above with the simple addition of +reeves. However take a closer look and notice how I took out one \"0\" from the 800 number. What I am doing here is looking for a possible wrong entry but also making sure that part of the company name (in this case The Reeves Law Group) is shown in the string. How To Find Incorrect Business Names That Have The Proper Phone What you should search: 555-555-555 -\"Company Name\" Searching for the office locations phone number and then excluding the company's name using the -\"company name\" command will show all results for that phone number that do not mention the proper company name. This is an easy way to find variants of the business name across the internet. Other Searches You Can Try What you should search : \"Business Name\"+\"Address\" With quotes this will search for all instances of the exact business name and exact address you put in. The more specific you get the narrower the search results will be. What you should search : \"Business Name\"+\"Zip code\" Doing this will give you another list of options that could include listings without the proper business phone number. Finding Which Citations are Correct What you should search (Without quotes): \"City Name\"+\"Zip Code\"+\"Company Name\"+\"Phone Number\" Thankfully, you can also use these tricks to see which citations you have that are correct. If you're scanning for citations this way make sure you also check each of these sites for possible duplicates as you could have one correct listing and one or more bad ones too. Once you have your list of sources you can us the Mozbar export option outlined above and sort through these on the spreadsheet. Once You Have Them Documented You Can Prioritize and Outreach Once all of these are all properly documented comes the painstaking task of fixing them. Some of these websites will allow you to claim listings and directly edit them which is nice. Some you will have to hunt for the contact information and if you can't find it I recommend checking their WHOIS information to get the data of the domain owner. Most reputable sites though will have some way of contacting them. Usually when you encounter duplicate listings, you will have to contact the website to get them removed. Be patient. Remember that in most of these cases you're not paying to be listed on their website so their response can take some time. Be sure to document your contact dates in the spreadsheet as well so you can easily follow up. Here are a few tips for the outreach methods: Make sure all email contacts come from an email address on your websites domain such as Webmaster@YourDomain.com. This may help the back and forth verification process where possible. Some listings will require you to claim and verify them and may call the business with an automated system. Be prepared to take a few calls. Always be very clear with your request but also be concise. They don't typically spend a lot of time on these requests so making it as easy as possible with the links is recommended. Make sure to read the websites FAQ's for removing duplicates or updating listings. It will save you a lot of time and they may already have a process in place for this. If you can't find the procedure try the contact form on the website first, then email if you don't hear back in a reasonable amount of time. Contacting Websites to Fix Listings via Email Below is a very quick and easy sample outreach email I use for some of these contacts. This example can be used if you have two listings at YellowPages.com that are on the following URLs: 1) http://www.YellowPages.com/Listing1 2) http://www.YellowPages.com/Listing2 Sample Contact Email: Hello, I recently discovered that your website has two listings for my business, \"Business Name\" located at \"Address\". I was hoping you could help me delete the duplicate listing. The correct listing is: 1) http://www.YellowPages.com/Listing1 The listing I need deleted is: 2) http://www.YellowPages.com/Listing2 Could you please notify me once you have had the chance to fix this? Thanks! - Business Owner How This Helps By sending out clear and concise emails you may eliminate the back and forth emails and get them done quicker. Over time you may notice that some of these websites don't reply. The reality is that some of them won't reply or will charge a fee to be fixed. You can make the decision on a case by case basis whether these are important enough to worry about. Conclusion I hope you found this guide useful and hope it's something tactical that you can put to use right away. Using this method you will be off to a good start at fixing up your citations. Like everything else in local search this will take time to cleanup and time to process. Let Google find and index these naturally over time and watch your local rankings soar. If you have any other tips for citation cleanup please post them in the comments below. Additionally if you have any specific questions please feel free to contact me directly anytime. Just take it one step at a time and you'll be done in no time! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings"
    },
    {
      "level": "H2",
      "text": "Let's Start With The Basics: What is an Incorrect NAP?"
    },
    {
      "level": "H3",
      "text": "How Exact Do These Citations Need to Be?"
    },
    {
      "level": "H3",
      "text": "How Does This Happen & What Causes These?"
    },
    {
      "level": "H3",
      "text": "Before We Start: Here are Some Important Things to Know"
    },
    {
      "level": "H3",
      "text": "Let's Start By Identifying Possible NAP Variations & Recording Them In the Spreadsheet"
    },
    {
      "level": "H3",
      "text": "Here is a Quick Way to See What NAP Variations Google Already Associates with Your Business"
    },
    {
      "level": "H3",
      "text": "Start With the Data Aggregators Before Your Manual Efforts"
    },
    {
      "level": "H3",
      "text": "The Manual Cleanup Process"
    },
    {
      "level": "H3",
      "text": "The Process"
    },
    {
      "level": "H3",
      "text": "Finding Your Incorrect Citations"
    },
    {
      "level": "H3",
      "text": "So Which Search Operators Should You Use?"
    },
    {
      "level": "H3",
      "text": "Once You Have Them Documented You Can Prioritize and Outreach"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Meraz\n          \n            Casey Meraz\n          \n            Casey Meraz"
}