{
  "url": "https://moz.com/blog/adwords-agencies-dont-get-mesmerized-by-pretty-graphs",
  "slug": "adwords-agencies-dont-get-mesmerized-by-pretty-graphs",
  "title": "Adwords Agencies, Don't Get Mesmerized by Pretty Graphs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm head of online marketing at a lead generation company which has a very large internal spend on Adwords, and we also manage Adwords accounts for other clients. I personally deal with about 70 campaigns, so looking at them all weekly needs to be done efficiently. This is a very step-by-step guide…",
  "content": "Adwords Agencies, Don't Get Mesmerized by Pretty Graphs Paid Search Marketing (PPC) J By: James Hawkins November 10, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: James Hawkins November 10, 2011 Adwords Agencies, Don't Get Mesmerized by Pretty Graphs Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Background: I'm head of online marketing at a lead generation company which has a very large internal spend on Adwords, and we also manage Adwords accounts for other clients. I personally deal with about 70 campaigns, so looking at them all weekly needs to be done efficiently. This is a very step-by-step guide on how we operate daily to do so efficiently without wasting hundreds of hours lost in the world of statistics! It applies to the Search Network, not the Display Network. There is a lot of information here; so I intend this as an interactive piece, and I’m more than happy to address questions in the comments. Abbreviations CPC = Cost Per Click CPL = Cost Per Lead CTR = Click Through Rate Preventing Disasters Daily Overview Purpose: to prevent accidentally spending thousands of dollars by not keeping an eye on things, but also monitor campaigns in an efficient manner. 1. Set the date range to the last couple of days. 2. Glance at the graph at the top, plotting the CPL, number of conversions, and conversion rate so you can get an instant overview of any major issues or worrying trends. 3. Sort all of the adgroups by CPL, double checking that there is nothing outrageously expensive. If so, find out why. Did the server crash? Is the website working properly? Have you got a new competitor? 4. Sort all of the adgroups by spend. This means that if a lot has been spent with zero conversions, you'll spot it. (Don't forget - the CPL will be zero if no conversions have happened, even if $500 has been spent!) Campaign Optimisation We carry this out weekly per campaign unless it's very new, important, or badly-performing and hence needs more attention. Part A - Negative Keywords 1. After picking a campaign, click on the ‘Keywords’ tab. 2. Pick a suitable date range – from the day after you last carried out a negative keyword report for this campaign up to today’s date. 3. Click ‘Download’ and open the report in Excel. 4. Sort the data by impressions so you deal with the most important stuff first. 5. Add an extra column onto the left-hand side. 6. Starting at the top and work your way down the first 200 results, putting a ‘1’ in the new column you’ve created next to any keyword that ought to be a negative. (I.E. if I were selling widgets, I’d want to remove the keyword ‘I’m not interested in Widgets,' so I’d put a 1 next to it). If you're unsure about a keyword, look at the CPL and the CTR. If still unsure and it’s a keyword with a lot of impressions, you could always pull up a keyword report over a bigger date range to get more information, but this is time-consuming. Sidenote: whilst you do this, have a pen and paper to hand to jot down any new ideas for positive keywords this may give you. 7. Now sort the data again, this time by the new column that you’ve inserted to get all of the negatives at the top. 8. Open Adwords Editor and get the most recent changes to the campaign. 9. Click on 'Keywords,' click 'Negatives' – choose to 'Add Campaign Level Negative Keywords.' 10. Copy and paste the negative keywords into Adwords. After doing this, we would normally add them as 'phrase match' by finding them on the screen, selecting them, and choosing ‘Phrase.’ 11. Choose to upload your changes. 12. Backup everything from Adwords Editor; this is really easy and quick too. Part B - Ad Texts Purpose: to continue increasing the CTRs of your adverts incrementally, and we think that refreshing content helps Quality Scores, but it’s just a theory. 1. Set the date range to at least a month, or possibly longer if your campaign has not got a massive amount of traffic. We don’t do much longer than a month because a lot of ad texts fluctuate seasonally in their performance. 2. If time-constrained: viewing all of the adgroups, sort by impressions or cost so the most important ones are at the top, and only deal with the top few. Try not to do this all the time. If not time-constrained: use the bar on the left and go through the adgroups alphabetically since this is a quicker way of doing it as it involves less clicking. Make sure you’re really concentrating when you’re on the most important keywords. 3. Click into each adgroup and view the two ads that you’re running. (Sidenote – we really recommend you have two adverts running for each ad group so you can do this process.) 4. Choose the better-performing ad text and pause the other. I normally go for the one with the better CTR if the ads are quite similar and the traffic is low. If there is more traffic, hence more data, I’d pick the one with a lower cost per conversion, even if the CTR is slightly worse. If unsure, extend the date range for more data; if still unsure, leave it and come back to it a week later or even add a third ad text. 5. Add a new ad text to test over the next week. Be creative! Part C - Bid Adjustment and Adgroup Maintenance Purpose: to maintain a good volume of conversions without very high CPCs. You can try automating this with ‘automated rules,' but we prefer to do it manually so we can take the keywords into consideration, as it often helps to understand why certain adgroups are performing in certain ways. 1. Viewing all of the adgroups, sort by CPC. 2. Look at those adgroups with very low costs per conversion. How do their positions look? If they’ve got a low CPL with a low position, increase your bid. Sidenote: if you’ve got keyword-level bidding, make sure you adjust this, because the adgroup-level bidding settings will get ignored if the keyword-level setting is higher. 3. Look at adgroups which have an expensive CPL. If their position is too high, then your conversion rate must be too low either due to the nature of the search term or your website itself: so try to improve the landing page or – if insufficient time – decrease the bid to reduce the CPC. 4. If an adgroup has a high CPL, don’t pause it immediately. Instead, look at the different keyword performances within the adgroup and pause them individually if just one or two keywords are doing badly. Add negatives very carefully so these keywords don’t continue triggering your ads. Sidenote: you should never just have 'broad match' keywords. Instead, start by adding broad, phrase, and exact and then remove the ones that do badly and add negatives carefully at campaign level so the terms don’t reappear. Part D - Adding New Adgroups and Keywords Purpose: to find low-competition, hence low CPC keywords to increase traffic and decrease CPL. 1. Once your brain is exhausted, use a third-party tool to come up with ideas. We use KeywordSpy. Alternatively, quickly ask your co-workers, if they look bored, “Can you think of 8 words that people might say instead of double glazing?\" which is the sort of fascinating conversation we sometimes have. Sometimes, your other campaigns for different industries may bring up common ideas too. Words like “quote,\" “price,” or “sale” are useful very widely. 2. Write your ideas into Excel, using a plug-in to see search volumes. Make sure you consider local monthly searches and bear in mind the differences between exact, broad, and phrase match. You can also use Google’s Keyword Tool for this. 3. If the volume is high enough to bother with it (this will depend on time constraints) and you feel the keyword will lead to the right kind of traffic, then add a new adgroup based around the keyword. You can also check to see if your competitors are advertising on the keyword at all, which is a good indicator that it will work, but bear in mind that the match-type is important. For example, your amazing idea of ‘Super Duper Widgets Keyword’ may be triggering their keyword ‘Widgets’ on broad match. The ad text of their adverts will give you an idea as to whether they’re using your new idea – for example, if they’ve repeated ‘Super Duper Widgets Keyword’ in their adtexts several times. Use Google’s Ad Preview Tool if you’re targeting a different area than where you live. 4. Make sure the new ad texts repeat the keyword several times, and that the best landing page is picked or created. 5. Create two ad texts so you can compare to see which performs better in the future. 6. Double check the URLs and that there are no naughty phrases or punctuation (i.e. that it abides by Google’s guidance for what you’re allowed to do, which you ought to know). 7. Creating too many new adgroups can make monitoring difficult. You ought to monitor new adgroups very frequently if you can see that the estimated search volume is high. We go for slow, but steady. Force yourself to do monitoring every time. Write in a diary any short-term monitoring you need to do so you don’t forget it. Top Tips Include the current month or current news in ad texts, i.e. ‘Great Deals in October’ to aid CTRs. If unsure about an action, increase the date range to get more data, which may make it more obvious. We are very fussy about keywords. If the search is vaguely informational, and you’re trying to sell something, we usually find that the CPC is too high. This will depend on your margins. For example, I’d have ‘Widget Information’ as a negative if I were selling widgets; whereas, I’d be willing to bid very high for ‘Widget Quotes.’ It’ll cost a lot per click, but the conversion rate will be high so the CPC should be fine. This will obviously depend on how tuned-in your competitors’ bidding strategies are. Make sure to read Google’s advice. They have a brilliant learning centre and even a test you can do to get certified in Adwords Management. This will really help your understanding when you're trying to diagnose problems or why something is working well. Stick rigidly to this plan of action. If you must spend time browsing the info, allocate a set period in which to do this, which can also be when you read about new targeting techniques, etc. Allocate separate time to use tools like the Website Optimiser if you can see long-term trends developing like a falling conversion rate or if your products change. Shooting through a campaign with these technique takes from 25 minutes to an hour if you have a lot of ad texts to do. However, you can quantify the benefits to an extent. For example, if you compile a list of to-be-negative keywords from the search term report, you can add up just how much you've spent on poorly-performing keywords since the last review; the amount you can effectively make per hour is very high indeed from this alone. If you let your positions fall, then you may find that your conversion rate drops with it since visitors are flicking through multiple results, especially if your website is similar to your competitors'. An important aspect of managing Adwords is that it is done regularly, not just to keep an eye on things, but to help you find new trends in search, which can feed back into your SEO efforts. Regular management also means disaster avoidance. For example, a news item with your keywords may generate a massive surge in traffic, which could slash CTRs and harm your quality scores, or alternatively, it could lead to a lot of low value traffic, for which you'll be paying. Stay on top of your Adwords, and you'll stay on top of the results (*or wherever is optimal!). Do make suggestions as to how this process could be further streamlined in the comments. Written by James Hawkins head of marketing at Talk Solar Panels. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Adwords Agencies, Don't Get Mesmerized by Pretty Graphs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Adwords Agencies, Don't Get Mesmerized by Pretty Graphs"
    },
    {
      "level": "H3",
      "text": "Preventing Disasters"
    },
    {
      "level": "H3",
      "text": "Campaign Optimisation"
    },
    {
      "level": "H3",
      "text": "Top Tips"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Hawkins\n          \n            James Hawkins"
}