{
  "url": "https://moz.com/blog/agency-vs-inhouse-vs-freelance-seo-the-endless-debate-starring-mr-men-12928",
  "slug": "agency-vs-inhouse-vs-freelance-seo-the-endless-debate-starring-mr-men-12928",
  "title": "Agency vs In-House vs Freelance SEO: The Endless Debate (starring Mr. Men) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So you want a career in SEO? Or maybe you already have an SEO role and it's time for a change. Well, I've been doing SEO for five years now and I can safely say that I've endured the pros and cons of almost every type of SEO career situation. So let me give you some insight on the good, bad, and…",
  "content": "Agency vs In-House vs Freelance SEO: The Endless Debate (starring Mr. Men) Public Relations M By: Michael King June 22, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Michael King June 22, 2011 Agency vs In-House vs Freelance SEO: The Endless Debate (starring Mr. Men) Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So you want a career in SEO? Or maybe you already have an SEO role and it's time for a change. Well, I've been doing SEO for five years now and I can safely say that I've endured the pros and cons of almost every type of SEO career situation. So let me give you some insight on the good, bad, and ugly for all of them. What's an SEOMoz post without graphics? I'm partial to the Mr. Men characters by Roger Hargreaves, I tend to use them in my presentations to bring what I'm talking about to life. So let's meet the key players: Mr. Persnickety – This is me. This is you. This is the SEO. You know your stuff very well, you come with case studies and analytics to make your points but it is essentially your job to tell people who have gone as far as to win awards in their capability that they are doing everything wrong. You are oftentimes the conductor of a cacophonic symphony – that's why you wear a bowtie. Little Miss Stubborn –Will be playing various members of the defensive Creative Team (Copywriter, Art Director, Creative Director, Graphic Designer). They are very stuck in their ways and instead of building for SEO they'd rather try to retrofit SEO and effectively placing a band-aid over the mouth of an active volcano. Mr. Lazy – Will be playing the part of the Tech Department or the Web Developer who most likely knows the right way to do things but likes to take a shortcut instead because they think you don't know enough to push back when they say they can't do something. Note to non-technical SEOs: LEARN HOW TO BUILD A WEBSITE! Mr. Nonsense – Will be playing the Account Manager. Depending on the agency these guys usually don't have any idea what you do. They sell based on what the client is asking for rather than what you can actually provide. By definition it is their job to make the client happy which means you will be responsible for unreasonable requests that keep you at work until 10PM. These are the people that will make your life very very hard. Mr. Fussy – This is your boss. This guy typically knows just enough about everything to be annoying. He'll drop buzzwords of the day out of context like “siloing” and “canonical redirect” because he follows Bruce Clay's blog and has never touched a site before in his life. He will also complain to you about things like utilization. Mr. Impossible – Will be playing the client. He wants you wave your magic SEO wand and make his thin ad copy based content rank #1 for highly competitive terms. He wants you to drive conversions with landing pages that were clearly not optimized for conversion. He wants exact projections of when he can expect rankings. He doesn't care if you emailed 10,000 people he only sees that you only got seven links. He wants to dominate every position in the SERPs – today and he wants it all for as close to free as possible. After all Organic Search is \"free\" traffic, right? Note: If I've worked with you in the past and you think I'm using these characters to personify you -- you're right. Now that we got our key players, let's talk about the playing fields. Agencies have the highest allure for digital. They make me think of scenes from \"Who's the Boss\" where Angela Bower ran her own Ad agency with the constant shuffle of people busy making the world turn. They make me think of the off-the-wall Creative ideas scribbled on whiteboards and the brand rooms that house their realizations. They make me think of drinking beer at my desk, and brainstorming meetings that birth viral campaigns so successful your friends send them to you rather than you having to beg them to watch in order to get your views up. As far as SEO, agencies allow you to make your SEO success real for your friends and family. Up until about a month or so ago I could say \"hey man Google 'sweaters.' Yep, I helped make that happen\" because I worked on Ralph Lauren and they were #1 for sweaters in location-agnostic searches in March and April. Sure I could have already said that for [insert small company you never heard of here] but to be involved in brands that everyone is aware of is next level. In short, agencies are cool. I separate agencies into two types. There are boutique agencies where SEO is the main focus and there are other capabilities that they support to facilitate SEO. These agencies can have any type of client from small to enterprise. Then there's what I'm going to call fully featured digital agencies. These agencies have a large department for every different capability. They are generally full of very smart people, there is a constant pipeline of Fortune 500 business and companies like Google fill their lobbies with branded ping pong tables and sofas to thank them for continuing to pump money through Adwords. Overall Pros of Agencies: People know their stuff – In an agency you are generally surrounded by people that are leaders in their field and are on the cutting edge of industry trends. Diversity of Client Portfolio – In an agency you are not tied to one niche or one type of client so it doesn't get boring and the things you learn from one client you can apply to another. Overall Cons of Agencies: Employee Turnover – The average lifespan in my experience at agencies is about two years. This is because it's not hard to learn the next level's job and once you do it's not hard to convince another agency that you are worth more money. It's actually gotten so bad that holding companies have developed programs that allow you to bounce between agencies. So this is clearly not a con for an SEO's pocket however the work and client relationships do suffer. Live and Die by Business Development – Depending on how the agency is set up if a client does not renew then that means a bunch of employees are getting laid off or there are no new hires and the agency has to contract and everyone has to do double duty. Unless of course you are upper management then you are mostly safe until there is some sort of merger. Boutique Agency My boutique agency experience is interesting and as I look at billboards and SEPTA bus ads for a local SEO agency or I see agencies that use their TopSEOs.com ranking as a selling point, I wonder how many people at boutique agencies are having the same experiences. Typically boutique SEO agencies are just that. While they may fill in the other capabilities around SEO as needed such as presentation layer and back end web development, a lot of them just focus on SEO. I got my start in SEO at a boutique agency in 2006 as a technical analyst (read: web monkey). The place I worked at had some talent but we were basically an SEO chop shop. The owner got into it early somehow and built it into something big enough where he drove a Mercedes SL350 and lived in penthouse apartment downtown. Our production team was seven people at its largest. We had three Account Managers, three Technical Analysts, and an Art Director and about 50 small to mid-level clients. Our sales team was 15 people cold calling companies on an autodialer that scraped WHOIS records. We were effectively the Walmart of SEO promising results and timeframes that were unrealistic. They'd taught me all I knew about SEO so I had no idea; I just kept on with the keyword stuffing and the hundreds of quick links across the bottom of the page and the bold and italics on every instance of the keyword. I had no idea that not redirecting non-www to www could lead to a duplicate content issue. Our link-building consisted of me spending hours searching for [keyword] + add url and posting links to anything I could find. Needless to say we rarely (if ever) delivered; clients blew up our phone daily and my then-boss never answered the phone which ultimately led to credit card charge backs. Ultimately my boss got fired and I became the boss and I actually delivered to the best of my ability. That is the say the work they'd taught me to do I actually got done for our clients. I stayed as late as 10pm sometimes, I let clients call me at home and I hacked Zen Cart to make it easier for the client to input products. I worked my behind off and in the end even though I didn't know that we were doing 1999 SEO in 2006 I did know that the owner wasn't about delivering quality results for the clients so I'd had enough. Guys like him give our industry a bad name. Granted my experience is not indicative of the experience to be had at reputable boutique agencies like SEER Interactive or Portent Interactive, so let's distill (no pun) it down to pros and cons that you may find in both cases. Pros of Boutique Agencies Familial Atmosphere– People are less about having an ego and more about getting the job done. It's essentially the startup \"let's make it happen\" ethos in which people are trying to pull their weight to build something successful. Your coworkers become more of a close-knit family that shares victories, has group lunches and pushes each other to be better. Agility – Boutique agencies have the ability to stop on a dime, fail fast and adopt early. Who do you think is already implementing Schema.org markup and complaining about the two seconds Google's +1 adds to page load time? I'm going to guess it isn't R/GA. Hands-On Approach – In my experience at larger SEO agencies we don't do any implementation which makes the process very annoying. However at the boutique agency we did all the implementations so we saw the results and could tweak as needed. I understand why but I sorely miss the ability to do that these days. Cons of Boutique Agencies Clients Expect the World for $5 – Clients are generally smaller for boutique agencies and if they are not smaller they expect to pay your company less because you're smaller. Despite that they still expect performance at the speed of light for such a low rate. They believe since they are paying you that they own you and your \"little agency.\" Team is Often Spread Thin – Your team is doing double duties because there are only five of you but there are a hundred clients to make sure your owner is making money. You're an account manager, copywriter, developer, and a short order cook. One of those balls you're juggling is going to fall. You should have juggled eggs instead so when they fall you finally have time to eat – multitasking! Lack of Clout – You're not going to be visited by the Google fairy with branded basketballs and throw rugs. You aren't running $50 million through Adwords monthly, so you don't have a Google rep that gives you the exact numbers from the internal Adwords keyword tool. You're a civilian on the battlefield but at least you're MacGyver. Full-featured Digital Agency This is the primetime. My full-featured digital agency experience has been a fast-paced roller coaster full of impressive successes and disheartening setbacks. It's truly a challenge of wills because you are dealing with your stereotypical digital prima donnas but it is very exciting work so it's worth it. I moved to a big agency after an in-house gig and was quite surprised by the fact that we just wrote about SEO best practices rather than implemented them and that we did so many menial tasks by hand. Truthfully the job felt kind of intimidating because I was surrounded by people who really got the results for highly competitive terms. In my interview they asked me \"what would you do if a client was targeting an impossibly competitive term like 'tv'?\" and I said something to the effect of \"tell them to pick an easier keyword.\" These were the guys that could rank #1 for \"tv\" so all I wanted to do was learn from them. It was a great learning experience; there were all types of awesome resources, coworkers bringing back great info and tools from conferences, great training sessions, discounts and free offerings from all types of places. Many times when I'd sign up for an API or inquire about software people were very receptive and went out of their way to be helpful due to what was behind the @ symbol in my email. In short, it was an incredible experience and I learned a lot from leaders in the field. After seven months of jedi SEO training I landed a gig at another agency where I now lead SEO. These days I have a ton of meetings internally and with clients and it's hard to wrangle other capabilities into doing what needs to be done but when things align properly, I'm accomplishing SEO the right way on the big agency level the right way – or at least my way. It's a lot of work but it's oh so rewarding! Pros of Full-featured Digital Agencies Clientele – I like walking through the King of Prussia mall and being able to point at the different high end stores and say I do their SEO. The perks of working for these brands can be pretty incredible too; let's just say I don't pay retail for any home electronics or home appliances. The other cool thing from an SEO standpoint of working with big brands is that they generally already have a ton of links so you really get to see large scale ranking changes when you fix something simple. Work with Rockstars – Adamanatium sharpens adamantium. You're surrounded by very smart people who have mastered something that you haven't had time to. The information sharing and friendly competition is going to make you better at what you do at an exponential rate. I was obviously a good SEO before I got my first big agency job but I learned more in three months at that job than I'd learned in the three years prior. Ok that's an exaggeration, but I learned a lot, yo! Resources – You want training in Omniture? You want to go to MozCon? You need a million API calls monthly from the SEOMoz Site Intelligence API? You want search volume that's not to just three significant figures from Google? You want to go back to school? There's an app(lication) for that! Simply put, these guys generally have the resources to get you what you need to do what you want to do. They Treat You Like An Adult – That's the way one of the Senior Analysts put it when I was interviewing for my first big agency job. You can work from home whenever you want, you have beer at your desk regularly and it's ok to curse when you're mad. Just be at work when you're needed and get the job done. The Pay – My salary doubled when I moved from full-time in-house to full-time big agency. Cons of Full-featured Digital Agencies Multi-Agency Involvement – This never works simply because it's never in one agency's interest to help the other. For example when one agency has Paid Search and another has Organic, Paid can always dial up the results with more money and then throw Organic under the bus. Or if one agency is building the site and another is preparing SEO recommendations, the building agency could just never implemented the recommendations and then the SEO agency gets the blame. Multi-capability involvement – Your Creative department hates you. Your Tech team hates you. Your Account team hates you. The Strategy & Analytics team gets along with you and you may never once talk to your Paid Search team. Why so much hate? Well you undermine everything that it is natural for them to do. Your Creative team is thinking about the \"golden mean,\" gridded layouts, widows, orphans and color schemes. If you are a true inbound marketer you're thinking about conversions, bounce rates and eye-tracking as well as SEO. So when you say \"Let's A/B test the CTAs to see what messaging and sizing drives better conversions\" Creative hears \"let's open up the door to ruining the beautiful design that I just put into my portfolio.\" Your Developers or Technical team think you're a hack. Rightfully so, in my opinion there are too many SEOs that cannot build a website. In that regard developers are movie producers and you are a film critic. Your Account team generally has no idea what you do, they just know you are responsible for making the team miss launch dates. They barely knew how to sell SEO to begin with and really had no idea what they got themselves into. These people often refer to SEO work as \"SEO Optimizations\" and ask you \"will this domain name affect the SEO quality score?\" Uhh....What? Strategy & Analytics thinks, \"Yay! Here's someone that will actually put our data and insights into play.\" These guys will be your best friends in the agency world. They'll be interested in what you're doing they'll even come up with reasons for things that are happening that you wouldn't think of. I love the Strategy guys if only because they know enough math to turn that AOL CTR data into progressive forecast models. Paid Search looks down their nose at you and says \"Oh, you do SEO? That's cool. Good luck with all that link building. I'll be over here doing marketing with ROI that you can accurately forecast.\" As we all know an integrated search approach is the best way to go especially to test landing pages and to make those Paid Search dollars work the hardest. Even still Paid and Organic Search rarely pow wow. No Direct Implementation – If your agency does do implementation it's most likely the web development or technical team that handles it. These guys don't want to be bothered. They assume that you don't understand what it takes to develop a website and that your knowledge of code is limited to whatever it is your favorite SEO tool told you to is out of whack. A lot of them even randomly know just enough about SEO to be dangerous to your cause. That is to say in 2003 they read a blog post or attended a panel discussion so they say things like \"you worry about making sure the content has 4-7% keyword density, I'll worry about the code.\" I've learned that if I make a joke about multi-dimensional arrays in our first conversation they are a lot more open to me telling them to make changes to their JavaScript to account for Page Speed issues. Corporate BS – There are very few big agencies that are not owned by WPP, Publicis Groupe, or some other holding company. This is great for your salary and benefits but people are laser-focused on bottom lines and corporate politics. Your super duper boss (your boss's boss's boss) will worry more about utilization and productivity numbers rather than the initiative you put forth by building something that helps you work faster. If you can't navigate the high school clique archetype that is our world, a big agency may not be for you. SEO is an Afterthought – Aside from the fact that the other capabilities are not in your corner SEO is not the biggest money maker in the house. Typically SEO is sold in the SOW as the site being built with SEO best practices or if SEO has its own clients you're still not bringing in the money that a $10M site redesign is. That said you will most likely see the site as its going out the door and you will have trouble getting your optimizations in to the build. It will be up to you and your team to fight with Creative to make SEO work because people in the building aren't all that concerned with it. Creative is perfectly fine with building pretty cars with no engines and letting Media push it up a hill. Creative won't come running until the client is asking why their car is sliding back down the hill once Media is gone. Let me be up front, I think in-house SEO is absolutely boring, so boring that when I did it I automated most of it while I focused more on deciphering Aesop Rock lyrics. However I also believe it's the most effective way for a company to accomplish its SEO goals. By definition in-house SEOs are experts in their niche and succeed because the effort is so focused. Site Management I worked for a company that did basement waterproofing, basement finishing, crawl space and foundation repair. We developed products and also had a lot of dealerships internationally so we developed and optimized the dealership sites for lead generation. Yo, if I ever see another sump pump as long as I live.... Anyway, so I put the work we were doing in the shooting fish in a barrel category simply because we dominated a niche and focused on geotargeted keywords with very low competition. As you've probably guessed we were awesome at it. I was hired as the resident whiz kid because I had previous agency experience and before I bored myself out of it I'd offered a bunch of changes to their approach. We had to build a ton of sites that basically looked the same with different logos and color schemes and the biggest hold up was generally that our two copywriters would have to \"scuff\" up existing content, updating it for the service area. Truthfully, the copy was as good as it was going to get so what I did to speed this process up was have them write four versions of each page with the same number of sentences in such a way that sentence one in version A made sense with sentence two in version B and so on. I also had them leave in markers for towns, cities, states and dealer names. Then basically I wrote a script that randomized the lines and positions where it would place the variables, then it checked how close it was to previously generated versions and it wouldn't spit out copy unless it was 90% original. Not quite your typical content spinner and to date I haven't heard of that content getting penalized or not ranking #1. It's probably pretty obvious that I went after generating sites and generating dynamic service area landing pages next because I was bored. I guess that is part of why in-house SEO works so well, you have to keep experimenting to keep yourself from losing your mind working on the same thing. I learned a lot here too and worked with a lot of talented people, but I also learned I needed to work at a digital agency where innovation is expected and not looked at as risky voodoo. Pros of Site Management Full Control – This can be the same setup as the full featured digital agency where your company has a bunch of different capabilities that handle different parts of the site. However being that the company is so invested in SEO you are most likely touching the site directly yourself or at least working directly with a development team that is forced to follow your direction. When I was in-house we were the \"Web Team\" and while we had an Art Director, Flash guy, a couple copywriters, a link builder and a PPC guy the rest of us were Web Specialists which meant we were responsible for building and optimizing the sites. This is the best place to be in because you can do anything as needed. There's no writing about what needs to be done, presenting it, and then hoping a third party implements it. It's done right the first time because YOU did it. Knowledge of Niche – This is why every company that is focusing on SEO should bring it in-house. When you optimize for one industry you really begin to master it, know the key players and the best ways to get links and develop content. The goals of the brand have been embedded into your DNA and it is easier for you to apply them to your overall efforts. Your universe is small but you are the master of it. Cons of Site Management Scared of Risk – Brands generally don't understand SEO but they do understand the New York Times. As we all know SEO has a bad reputation for backfiring on big brands so they don't want to do anything that Bruce Clay wouldn't like. That said if you are someone that follows the blogs and is really up on the newest techniques you may get a lot of push back from your boss about applying any tactics that are not vetted by Mr. Clay. Sidebar: I'm sorry Bruce, you're probably great at what you do but your work has been the cited by the people that have caused me many headaches in my career so you tend to end up in a lot of my SEO punch lines. No hard feelings man. Company is Not Knowledgeable – Oftentimes when someone has the brilliant idea to build an in-house SEO team they don't fully understand that SEO is typically a long-term initiative. They also don't communicate it to the guys upstairs and further don't understand that Landing Page and Conversion Optimization are large parts of that process. So what happens is the people upstairs cleared your hiring and then they expect you to work magic on their failed websites in very short time periods. Basically the expectations are often not managed and you don't really have any control over it. Then your boss starts leaning on you because his boss has turned up the heat. Expect to have to educate the people above you when you get there. Agency Management Redundancy is certainly the American way because a lot of companies are hiring in-house SEOs and then subsequently hiring third party agencies to develop their SEO strategy, content and link profiles. I guess the point is for the company to have someone on their side that speaks the language and can verify the work. Good grief! If these companies just want to waste some money make all checks payable to Michael King, I always wanted to buy a Knight Rider car but only sit in it inside of a Mack truck. I don't have any experience with being an in-house SEO that manages an agency relationship. I'd love to hear about some experiences in the comments below. I imagine it's similar to my dealings with third party agencies in other roles though so that's what I'm going to base this set of pros and cons on. Pros of Agency Management It's Easy – You have agencies laying out your strategy, you're just QAing it and making sure that it fits your brand guidelines and overseeing the implementation on your side. So it's basically reading some documents, passing them along then double checking if the work was done. I don't even understand why companies hire an SEO for this anyone that can read can do this. Cons of Agency Management Condescension from the Agency – You're the in-house SEO, you couldn't possibly be on the cutting edge of things like an agency -- or so they think. You think the agency is pompous, the agency thinks you're stupid and getting in the way of the implementation of their strategy. They will blame any failures on you and take full credit for any victories. I know because I've seen it and I do it. Those of us who have done anything on a freelance basis know that it's the most bipolar of them all. In this case I don't mean contracting for an agency as an employee without benefits; I mean working as an independent consultant. I've done freelance work since I was a teenager in both web and software development (in fact I think Jamie Stevens and I did a freelance site together back in 1995) but lately it's been mostly about SEO for companies, other agencies and individuals. I've been a touring musician for about eight years so this was the ideal situation for me to supplement my income while on the road and clients have come in all shapes and sizes. Some were very cool, easygoing and helpful while others were absolutely insane, unrealistic and unreasonable. A lot of clients tend to see SEO as a quick fix and don't understand all the moving parts so client education is absolutely paramount when you do freelance work. Then there are the people that don't believe you can do what you say and will often stand in the way of their own success. Sometimes clients come to you because they didn't like how the results of working with a boutique agency went and they think working with an individual is a better idea. What I love most now about freelance is that is keeps me sharp. This is often the opportunity where I get to implement optimizations myself and test out the new ideas I'm having or that I'm hearing about on the SEO blogosphere. Writing about SEO is mostly conjecture; my freelance work is what keeps my SEO skill set relevant. Pros of Freelance SEO Freedom – You choose your clientele and make your own schedule. In an agency it's not your call whether to dump a problem client; at best you can get transferred to another account. When you do freelance you can avoid or fire problem clients.Obviously you and your client must agree on dates for deliverables but if all you do is freelance work then you get to wake up at 3pm and optimize whenever you feel like it. I've optimized whole sites on flights to Europe, got off the plane uploaded and then performed a concert. File under: awesome. Autonomy – You call the shots! Sure you have to work within the brand guidelines and client goals but aside from that there's no one dictating your strategy. When you have a great idea for link building or want to build a tool to take advantage of something that applies to the client's niche there is no boss telling you not to. Cons of Freelance SEO Everyone wants a package deal – Before we even talk goals or keywords most potential freelance clients first just ask me how much would SEO cost for their site. The conversation usually ends at \"it depends\" but the fact of the matter is that it does depend on a variety of factors. While I know some industry leaders like Danny Dover (in \"Search Engine Optimization Secrets\") have suggested that SEO prices should be standardized based on the task with a multiplier applied based on experience, I strongly disagree. I price my work based on an hourly rate multiplied by the amount of hours I've scoped for the tasks or project. Even still people would much rather hear what my silver, gold, and platinum packages are. Man this ain't the car wash or McDonald's I can't get you the works for $15 or an Extra Value Optimization. Lack of Client Education – Typically freelance clientele is small businesses referred to you by a friend or even big business that doesn't want deal with the headaches of an agency. These people have heard the term SEO thrown around and their knowledge often stops at Meta tags. The biggest part of any freelance job in my experience is client education, I spend more time writing emails and making calls about what I'm doing and why than actually doing it. That's not to say that SEO education is not a big problem within agencies and amongst their clients as well, but you personally won't spend as much time educating clients in those roles. Ebb and Flow of Work – Peaks and valleys. Feast or famine. No matter how well you network it tends that you will have a time where you have too much on your plate followed by a time when you wonder when you're next job is coming in. Being that most of my freelance clients are small businesses, I've found it difficult on a freelance basis to get clients to sign on for continued optimizations. They typically want some sort of \"one and done\" situation or just a small amount of monthly link building. The best situation to get around this ebb and flow is to partner with a boutique web design shop that doesn't have SEO on staff and help them out. I'm having too much fun with the Mr. Men meets Dilbert cartoons so I figured it might be a fun guessing game for me to post more memories and have people guess in the comments where they happened. I'll give you guys the answers after we get enough comments. Obviously this comes from a bias lens and I've been around the block enough times to know I am the big agency type but I hope people find this insightful so they don't go into any of these scenarios blindly. Also keep in mind these are insights from my experience so you may go into any of these scenarios and never run into these problems. Just like anything in life, every opportunity is what you make of it. I want to hear from you guys. Those of you with multiple experiences I'd like to know what scenario you think the best. Have I left out any glaring pros or cons? I especially want to hear from people who have worked in-house managing an agency relationship. Thank you to all the people that I have worked with who can laugh at this post because they know they were awesome and they were nothing like the archetypes I have just described. Hope you guys have enjoyed my first post! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Agency vs In-House vs Freelance SEO: The Endless Debate (starring Mr. Men)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Agency vs In-House vs Freelance SEO: The Endless Debate (starring Mr. Men)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael King\n          \n            Michael King\n          \n            Michael King"
}