{
  "url": "https://moz.com/blog/aggressive-use-of-your-homepage",
  "slug": "aggressive-use-of-your-homepage",
  "title": "Aggressive Use of Your Homepage - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Lots of sites have a very simple homepage design.  Google is a perfect example of this.  However, I have found that loading up the homepage with information has increased sales, pageviews, visitor time-on-site, and linkbuild rate.  (Rand and Matt's new design for seomoz.org - shown at right ...",
  "content": "Aggressive Use of Your Homepage Design E By: EGOL March 13, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL March 13, 2006 Aggressive Use of Your Homepage Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Lots of sites have a very simple homepage design. Google is a perfect example of this. However, I have found that loading up the homepage with information has increased sales, pageviews, visitor time-on-site, and linkbuild rate. (Rand and Matt's new design for seomoz.org - shown at right - also puts a lot of info up front).For a long time I worried that changing my homepages would put my rankings at risk but learned that I was wrong as long as I maintain basic SEO. Here are a few ways that I have used my homepages that have yielded good results. RETAIL SITE: - announce new items - suggest holiday gifts - suggest in-season items - show off hot selling items or historic best sellers - link to product category pages by manufacturer and product typeINFO SITE: - show off new articles and resources - point to newsy posts in my blog - link to my most popular pages - link to category pages by topic, geographic area, format - promote pages that I hope will attract natural links - inspire return visits by having new stuff above the fold every weekMy homepage goal for both retail and info is to give the impression... \"This site has everything!\" I believe that this encourages visitors to go inside and snoop around. It also should promote bookmarking and linking.How do you manage your homepage? Do you have ideas or a philosophy of homepage content that you can share for discussion here? What other items are worthy of homepage real estate? We would love to hear your comments and ideas. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Aggressive Use of Your Homepage"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Aggressive Use of Your Homepage"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}