{
  "url": "https://moz.com/blog/all-about-anchor-text-whiteboard-friday",
  "slug": "all-about-anchor-text-whiteboard-friday",
  "title": "All About Anchor Text - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Welcome to our first Whiteboard Friday of the new year. It's 2012 and we're going to kick it off by examining the intricacies that revolve around anchor text. Although, this may seem like a very basic topic, we are going to cover some lesser known aspects of anchor text that is sure to satisfy even…",
  "content": "All About Anchor Text Whiteboard Friday By: Rand Fishkin January 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 5, 2012 All About Anchor Text Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Welcome to our first Whiteboard Friday of the new year. It's 2012 and we're going to kick it off by examining the intricacies that revolve around anchor text. Although, this may seem like a very basic topic, we are going to cover some lesser known aspects of anchor text that is sure to satisfy even our more advanced SEOs. Enjoy and don't forget to leave your comments below! Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. Happy New Year. This is the first Whiteboard Friday of 2012, and today we're talking about anchor text, which could seem like a basic topic. But, in fact, there are a lot of intricacies that we should cover. Let's get right to them. What I have drawn here is a web page, and it says, \"I just found this great website on Portuguese cooks. You should check it out.\" Now, this, this text in blue with the underline, that links somewhere, and that link points to another page. Let's say it's a page over here, a very nice page on Portuguese cooks. It has some pictures on it. I don't know what it's got. What it's saying to the engines is not only eye this page and this website, I'm voting for this other page over here, and I want to pass over some PageRank and link juice. I want to pass over trust. I want to pass over the domain diversity, whatever the signals, the keyword agnostics signals are, but I also want to say that I particularly like this web page about Portuguese cooks. That's what I think you, search engine, should interpret and take away from it. Of course, this anchor text with the keyword embedded in it becomes a very strong signal to search engines, and as we all know, this is one of the strongest signals that Google and Bing interpret, Bing maybe even stronger than Google. Because of this, lots of people go down a path of trying to acquire links that say the precise keyword that they want. Of course, this is a challenge because most natural links on the Web don't generally do this. They will say things like your brand name. They might say something about your site. They might use your personal name, if they're linking to a blog or something. But it's rare, it's uncommon that they might say \"Audi 87 engine parts for sale\" or \"best deals on holiday gifts.\" These types of anchor texts, the things that people search for, longer phrases, in particular, are very hard to get as natural links, and this is one of the biggest reasons that gray and black hat SEO exist because manipulating the search engines by acquiring lots of links that have these keyword matches pointing to your page can, in fact, do a great job of ranking you up, at least temporarily until the engines catch up and do something bad to you or to the people linking to you. What I want to cover is some intricacies around this, some details that you may or may not know about anchor text, and those include: Number one, multiple anchors from the same page \"do not\" provide more value. What I mean by this is if this page said I just found this great website on Portuguese cooks, you should check it out and a bunch of other text, and then it said Portuguese cooks again and linked over to this page, not helpful. It does not add additional value. There is no reason that you should be going, \"Oh man, I wish I could get four anchor text match links from this web page.\" No, that's not going to help you. Multiple web pages will help you, but if they're from the same domain, that's not nearly as valuable as if they're from different domains. That leads us to the next thing, diversity of anchor text, diversity of the source. The root domain source of the anchor text links provides the strongest benefit, meaning if you can get lots and lots of websites, not just individual web pages but different unique web domains, linking to you saying \"Portuguese cooks,\" chances are good this web page will do very well. Number three, the fluctuating anchor text. This is something that people talk about all the time. They don't just talk about diversity of the link location across different domains, but they talk about diversity of anchor text itself, meaning, \"Oh, I should have one that says Portuguese cooks and one that says Portuguese cooking and one that says cooks from Portugal. I'm going to vary up the anchor text a lot.\" I'm a little skeptical about this, not because it's not potentially useful, and it should be a natural thing if you're going out and doing white hat types of link building and inbound marketing. But because the primary reason I think most SEOs do this is so as to not trigger pattern matching problems in the engines, meaning if every website that's linking to me says Portuguese cooks, that's suspicious, highly suspicious. That suspiciousness is the feature that people are trying to prevent. So, I'm not so sure whether this fluctuation is all that important unless you're doing manipulative types of link building, in which case SEOmoz is not all that helpful for you. So, you're probably not watching this video. Number four, the first anchor text in the HTML of a page is what Google counts, Bing as well. This was discovered on SEOmoz a couple of years ago. We ran some tests about it. We published the results. There was a lot of skepticism. I think Debra Mastaler from Alliance-Link wrote about it and said, \"Hey, Matt Cutts, would you please confirm this?\" And he did. He came out and said, \"Yeah, that's how we interpret it\". So, basically, here's what's going on. If you see a web page and it says this website is awesome, it features highlights of great Portuguese cooks, now look, these two links are both pointing to the same page. I don't know why my handwriting is so terrible in 2012. I hope that repairs itself soon. That means not that the website is going to get credit for the anchor text website and the anchor text Portuguese cooks, but rather they are going to consider the anchor text website and ignore Portuguese cooks. It's very frustrating, and something that you should think about when you're doing internal linking and you say, \"Oh, yeah, we should optimize this link.\" If it's already in your menu, if it's already at the top of the page somewhere in a side bar and that's higher up in the HTML code, then that is what the engine is going to count. So, do be aware of that and same goes for anything that you're earning externally. If you've got the optimized anchor text for your website in the footer of the blog post where it talks about the author, Rand Fishkin is the CEO of SEOmoz, an SEO tools company, but I've already link to SEOmoz's home page somewhere in the blog post above, that \"SEO tools company,\" that's not going to help anything. That's going to be discounted by the engines. Number five, internal anchor text, meaning anchor text that comes from your own site, your own pages, it does help. It helps a tiny bit. You can see a little bit of benefit from that. I wouldn't focus on it too much because tiny is a small amount. That's probably the most obvious statement I've ever made on Whiteboard Friday. But nevertheless, tiny, small amount, therefore don't focus too much energy on this. Link naturally, internally. Link in such a way that people think your site is good, and, yeah, if you can work in your anchor text, great. External anchor text is where it really helps, meaning websites that are not your own linking to you. That's where you really get value from anchor text, and you do need to worry about this a little bit. There should be some manual efforts, some efforts, whether that's guest posting and blogging, whether that's sponsoring an event, whether that's getting your biography featured or something like that, getting a badge embedded somewhere or a graphic embedded somewhere that links back to you in a certain way, you do need that anchor text link match. So, working on at least a little of that external anchor text is definitely worthwhile. Number six, if a link uses an image, like this, so check out this awesome site on Portuguese cooks, and then here's a little screen shot of the Portuguese cooks website, and this is linking over. I tried to illustrate that in blue. This does not have any anchor text. It's an image. So what could the anchor text possibly be? The answer is they use the Alt attribute. The engines use the Alt attribute that becomes the anchor text usually, not always. If there is no Alt attribute, sometimes they'll use something like the surrounding text, and you can sort of see and feel that association. Sometimes, they'll use page titles. Sometimes, they won't use anything, but they'll have weaker signals from those other areas of the page, that kind of thing. If you are embedding images and you're linking back to yourself or you're getting links from somewhere or you're linking out to someone, you want to help them out, use good Alt attributes that describe the page that you're linking to. This is a great best practice just in general for screen readers and usability reasons. It's also good for search engines. Then finally, number seven, no surprise, surrounding text can matter as well. Just as in this example where we said, \"Hey, Portuguese cooks is mentioned right before the image,\" the engines may be using surrounding text of an anchor, particularly where the anchor itself doesn't have much value or context. If something says, \"Click here, you'll find some great information about Portuguese cooks,\" the engines might sort of glance around the page and look at the sentence, parse the paragraph, try and understand, \"Hey, what do you think they're talking about here? What seems relevant?\" This is one of the reasons why you can see that people who have earned not necessarily great anchor text can rank very well for keywords because it's often talked about. That topic is talked about when their website is talked about, and it becomes a brand association thing. It becomes a contextual association thing. This is a helpful thing to think about if you are earning links and you can't control the anchor text. Maybe, at least, you can get them to mention what you do somewhere near the link. All right, everyone. I hope this edition of Whiteboard Friday has been helpful. I look forward to discussing more details about anchor text in the comments and hope to see you again all next week for another edition of Whiteboard Friday. Happy New Year! Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All About Anchor Text"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All About Anchor Text"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}