{
  "url": "https://moz.com/blog/all-the-female-bloggers-say-heyyyyhello-ladies",
  "slug": "all-the-female-bloggers-say-heyyyyhello-ladies",
  "title": "All The Female Bloggers Say Heyyyy!...Hello? Ladies? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Kim Krause Berg recently raised a stink on her Cr8pc blog, criticizing the utter absence of female bloggers interviewed for Google Blogoscoped's Popular Blog Posts entry.  In her blog, she protested that female bloggers have a lot more to juggle than a couple unique blog entries ...",
  "content": "All The Female Bloggers Say Heyyyy!...Hello? Ladies? Public Relations By: Rebecca Kelley November 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley November 16, 2006 All The Female Bloggers Say Heyyyy!...Hello? Ladies? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Kim Krause Berg recently raised a stink on her Cr8pc blog, criticizing the utter absence of female bloggers interviewed for Google Blogoscoped's Popular Blog Posts entry. In her blog, she protested that female bloggers have a lot more to juggle than a couple unique blog entries each day and should get a little recognition for it. She exemplified this by detailing a day in the hectic life of Kim (wife, mother, and SEO extraordinaire), and she also gave a shout-out to some of her favorite bloggers (including the lovely ladies of SEOmoz, Mystery Guest included). Why blog about this, you ask? Well, since I'm one of two resident (and regular; sorry Gillian and Mystery Guest) lady bloggers at SEOmoz, Rand wanted me to give my input on the matter. While I admire Kim for being proud, outspoken, and secure in her beliefs (her constant allusions to sex in her posts are admirable, amusing, and disturbing at the same time), I think that both she and Philipp Lenssen have a valid point.First, a little background info: I'm a tomboy through and through. Growing up around two older brothers and lacking a female role model (Mom worked nights, sis was attending college), I learned to love to watch basketball, pee quickly, enjoy videogames and the awesomely-bad films of Van Damme, keep my fingernails short, appreciate a crude but clever sense of humor, and hate chick flicks. I think I'm one of a few select gals who are genuinely excited to get the special edition of Dawn of the Dead as a Valentine's Day gift (seriously; my boyfriend is contemplating sending a Thank You card to my brothers for helping shape me into what he considers to be the Best Girlfriend Ever). The bottom line is, I relate to the fellas. My male-to-female friends ratio is ridiculous. I dislike high-maintenance girly girls, so I'm choosy when it comes to befriending females. That being said, I really like and admire a lot of females in the SEO industry (Kim included) for their ability to hold their own against the big boys. They're confident, smart, well-spoken, and have a good sense of humor. I can see how Kim got offended for being overlooked as a gender.However, we're overlooked in this field because it's male-dominated. The tech, Internet, and SEO industry are mostly comprised of males because it's the sort of industry that attracts more males than females. It's not like it's 50/50; if it were, then it's more justifiable to feel overlooked. However, I can't be outraged by the lack of recognition of female bloggers in the industry because, quite frankly, there aren't that many to recognize. If he did indeed try, I can't fault Philipp for making the effort to reach out to the few female bloggers, let alone the ones who truly know their stuff, there are out there and not receiving a response. I don't believe in overcompensating and thinking, \"Well, since there are so fewer female bloggers, I should really try to get their input as well so I won't seem sexist.\" That's crap. You should instead simply decide how great the information is and how much you value that blogger's input, regardless of his or her gender. I don't want to see a female become the \"best female SEO in the industry\" because she knows the most out of the other female SEOs, only to actually be not that knowledgeable in the overall sphere. There should be a level playing field.Basically, my opinion is that I don't want any special treatment simply because I'm a minority in the industry (hmmm, female, young, Asian...I'm a triple threat!). I think of myself as an SEO and as a blogger. I don't slap \"female\" onto that to stand out more and demand more recognition. That's the way I am, and that's what I believe. It's not what I want or expect everyone to believe. I don't judge or fault Kim for getting angry, nor do I condemn Philipp for only featuring male bloggers. My personal belief is sometimes you've got to work with what you have, and I'd rather work with sexless information than be oversensitive to it.Now if you'll excuse me, I have to go make some tea for all the boys in the Fresh Egg office... ;) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All The Female Bloggers Say Heyyyy!...Hello? Ladies?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All The Female Bloggers Say Heyyyy!...Hello? Ladies?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}