{
  "url": "https://moz.com/blog/all-the-different-ways-to-calculate-link-numbers-and-the-best-one",
  "slug": "all-the-different-ways-to-calculate-link-numbers-and-the-best-one",
  "title": "All the Different Ways to Calculate Link Numbers (and the Best One) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If, like many SEOs, you're seeking to find a good way to tell exactly how many links you've got (or how many your competition has), this post is for you. There are dozens of link reporting methodologies, and I'll try to cover as many as I can remember:\nGoogleWith the crappiest numbers around, it's…",
  "content": "All the Different Ways to Calculate Link Numbers (and the Best One) Link Building By: Rand Fishkin July 10, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 10, 2006 All the Different Ways to Calculate Link Numbers (and the Best One) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If, like many SEOs, you're seeking to find a good way to tell exactly how many links you've got (or how many your competition has), this post is for you. There are dozens of link reporting methodologies, and I'll try to cover as many as I can remember: GoogleWith the crappiest numbers around, it's a wonder that anyone pays attention to them at all. Google themselves have stated that the numbers are inaccurate, vary wildly, update on a schedule known only to the most spiritually aware shamans and show in no particular order. However, if you still want them, the command is: link:www.seomoz.org Note: no modifiers (like -site: or intitle:) can be used MSNMSN's numbers, while relatively more accurate than Google, are still largely useless. The count system in MSN engine is, in their engineers' own words, a \"work in progress\" and an \"ongoing issue.\" I have doubts as to whether they'll ever report accurate numbers, but the link data at least, is valuable. MSN is doing a fairly good job of showing more important links ahead of less important links (though not with complete predictability). If you compare the first 100 links that MSN reports to the 2nd 100, you'll find much higher quality and importance in the first set. link:www.seomoz.org or link:https://moz.com - shows links to the specific URLlinkdomain:seomoz.org - shows all links to any page on the domain Note: using modifiers such as -site:seomoz.org will produce numbers that (supposedly) remove links from internal pages on the site. Other cool modifiers, like linkdomain:seomoz.org intitle:seo mean that you can get as flexible or narrow with the search results as you'd like. Yahoo!Thank goodness for Yahoo! Without them, it would be nearly impossible to get good link information. The data provided by Y! isn't perfect, but it is the most numerically accurate (not always exact, but when comparing relative numbers, it's practically flawless) and, like MSN, they tend to show more important links before less important ones. link:https://moz.comlinkdomain:seomoz.org Note: Like MSN, modifiers can be added to your heart's content, enabling lots of very cool search data. For example, I can see how many people link to SEOmoz and have my name on the page using the search linkdomain:seomoz.org \"rand fishkin\" -site:seomoz.org. BIG TRICK: We've seen lots and lots of link search data from Yahoo!'s many sources - site explorer, web search, APIs for both of these, results from the engines they serve (see below), etc. To date, the most accurate link counts we've ever found are done via the search.yahoo.com URL. Once you get to the results page, surf to the last page of results available - you can also append &b=999 to the end of the URL manually. Yahoo!'s count will update to be more accurate and if the page only shows \"results X through Y of Z,\" you can use those numbers to get a good idea of how many truly unique links you've got. e.g. linkdomain:seomoz.org - site:seomoz.org shows 112,00 results, but surfing to that last page shows 108,000 results. For smaller size searches like link:https://moz.com/articles/recommended.php -site:seomoz.org, surfing to the last page shows 34 of 52 supposed total results. That 34 number is our favorite one to use for these smaller size link searches. And what about the smaller engines? Ask.com - no link functionality at all. You can't even do a site search with them.Exalead.com - link:seomoz.org; fairly good results, though the low level of spidering means lower numbers overall, but more important pages/sites showing up.AltaVista.com - link:www.seomoz.org still works. Supposedly they're on Yahoo!'s index, but the ordering and numbers don't match, so something different is going on here.Hotbot.com - link:www.seomoz.org as with AltaVista. Note that you can add modifiers here, too.AOL Search - link:www.seomoz.org which appears to be returning Google's exact data.Vivisimo - link:www.seomoz.org shows interesting results, the best part of which is the clustered results, which appear to me to suggest the most common anchor text or possibly subject matter of the links pointing to the site. Any search data you particularly love? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All the Different Ways to Calculate Link Numbers (and the Best One)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All the Different Ways to Calculate Link Numbers (and the Best One)"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}