{
  "url": "https://moz.com/blog/all-play-and-some-work-at-ses-latino",
  "slug": "all-play-and-some-work-at-ses-latino",
  "title": "All Play and Some Work at SES Latino - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sorry for the delay, but I didn't realize how truly indispensable I was until I left town for a few days. Once I got back it was nothing but, \"Rebecca, Rebecca, the company almost went under without you! Fix this! Help me! Where are my yellow Pumas?\" Okay, now that I'm done with my illusions of…",
  "content": "All Play and Some Work at SES Latino SEO Events By: Rebecca Kelley July 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley July 14, 2006 All Play and Some Work at SES Latino SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sorry for the delay, but I didn't realize how truly indispensable I was until I left town for a few days. Once I got back it was nothing but, \"Rebecca, Rebecca, the company almost went under without you! Fix this! Help me! Where are my yellow Pumas?\" Okay, now that I'm done with my illusions of grandeur, the following is an exhaustively comprehensive recap of my trip to Miami for the inaugural SES Latino conference. Proceed at your own risk, as this post is likely to suck about ten minutes of your time...if you just want to check out the photos, they're available at Picasa. Day 1: Monday, July 10 After waking up at 7:00 am (the equivalent of 4:00 am Seattle time) and inadvertently flooding my bathroom floor due to extreme grogginess (next time it might be smart to remove the hand towel and bath mat draped over the tub so as not to create a makeshift waterfall when showering), I headed downstairs for Day 1 of the SES Latino conference. This being my first SES show, I felt a little apprehensive about being thrown into the madness of multiple sessions, hundreds of people, and a barrage of español y portugués. The pearly gates Introduction to Search Engine Marketing My first session was \"Introduction to Search Engine Marketing,\" delivered by none other than Danny Sullivan. After some technical difficulties, his presentation went underway. The seminar was basically SEO 101 and introduced topics such as the difference between free and paid listings, vertical vs. horizontal search, how to research search terms, what are crawlers and how to submit to them, title and meta tags, and link quality over quantity. While the seminar covered topics I was already very familiar with, I can't deny that Danny is a great speaker who gives comprehensive information without overwhelming his audience. His examples were top-notch (Nike not ranking well for \"shoes\"?), and he knows how to captivate the crowd. Danny has easily become one of my favorite speakers. Some technical difficulties Search Landscape: U.S. Hispanics The second seminar I attended was \"Search Landscape: U.S. Hispanics.\" For purposes of condensing this blog as much as I can, I'll only summarize one presentation, Nacho Hernandez's (CEO of iHispanic Marketing Group) \"A New Multilingual and Multicultural Search Marketing Opportunity.\" Nacho provided fantastic data about the untapped U.S. Hispanic market. According to Nacho, the U.S. Hispanic population is slated to grow 55% between 2004 and 2015 (from 44 to 68 million). The U.S. Hispanic household is also 42% larger than the U.S. household, with 46% ages 24 and under (compared to 33% non-Hispanics). On average, U.S. Hispanics view 13% more pages online than the general market, and they spend 10% more minutes online. One of the more interesting pieces of data presented was that although Hispanics are generally a loyal culture (meaning that they tend to stick to the same brands), 67% of U.S. Hispanics do not exclusively use one search engine when conducting searches. Furthermore, although the majority of U.S. Hispanics conduct their searches in English, highly competitive terms (evaluated by SEOmoz's very own KW Difficulty Tool!) in Spanish have a far lower CPC than the same terms in English. Less competition can result in a very high ROI. Overall, Nacho's presentation was fantastic. His data proved that U.S. Hispanics are an extremely overlooked demographic in search marketing. The potential to target this group is huge, and it's amazing that, although Hispanics comprise a large chunk of our population, they aren't being sufficiently targeted. Search Landscape: Latin America In his presentation, Marcelo Sant'Iago, the president of IAB Brasil, pointed out that one challenge to targeting ads at Hispanics is dialect variances. He provides an example where, depending on where you are in Brazil, there are three different words for a tangerine: a mexerica, a tangerina, and a bergamota. Marketers, therefore, need to be aware of the specific culture and language of their target audience in order to avoid inadvertently alienating or offending them. The Challenges of Search Marketing to U.S. Hispanics & Latin Americans The panel More search marketing challenges were presented in this seminar. Matias Perel, CEO of LATINTHRE3, warned not to expect the same traffic level as English campaigns. He also advises to target locally and be conscious of language diversity. Massimo Burgio, co-chair of the SEMPO Global Committee, gave an interesting presentation on mapping the search marketer's experience in targeting to an Hispanic audience (and, being Sicilian, not-so-discreetly began his presentation with a slide of Team Italy, the champions of the World Cup). Massimo conducted a survey of Latino search challenges and administered it to various SEMPO members. Since the survey completion was under a tight deadline, only 7.87% of the members were able to complete it. Of the responses, the biggest challenges to targeting Latino users were: Content localization Cultural and language diversities A lack of reliable market data on user behavior and search trends Low Internet penetration Low buying power Client education The lack of support from search engines and ad networks Hosting issues Development costs The survey also found that the most successful campaign strategy is a mix of SEO and PPC. Since Hispanics respond positively to visuals and pizazz, the best Latin search integration is a mixture of design and multimedia on landing pages. Lastly, Matt Williams, managing partner for Prominent Placement, discussed an experience his company had with conducting SEO for a client. Although he admitted that Spanish SEO can be complex and costly (both in management time and in the cost of outsourcing work to translators and linguists), within weeks of launching their ad campaign his client dominated the SERPS in both paid and organic results. Business from Spanish speaking countries grew 1400%, with an overall sales traffic increase to 33% from Latin America, Spain, and Portugal. What Comes Before Part B? Part-ay! After Day 1 of the conference wrapped up, it was off to Yahoo!'s yacht party, which, thanks to Joe Morin (blog), president of Boost Search Marketing, I was attending. Me on the Yahoo! yacht After the yacht party I went to a swanky club called Bed, where I got to experience Miami club life firsthand. Fun times were had by all. Once again, more pictures are available for viewing at Picasa. Day 2: Tuesday, July 11 Meet the Search Engines Moderated amusingly by Mike Grehan (blog), the founder and CEO of Smart Interactive, this seminar featured an interesting presentation by Alex Laats, the president of PodZinger. With PodZinger a user can search for a term and the results will pull up podcasts that are queued up to the moment where the term is first mentioned. In the age of impatient web surfers, this feature is great for skimmers, both auditory and visual. Converting Visitors into Buyers Jeffrey Eisenberg, CEO and co-founder of Future Now, gave a fantastic presentation on conversion. He presented data showing how conversion rates have dropped from 3.2% in 2002 to 2.4% in 2005, and that the number of sites a user visits (I'm assuming in one day, though I didn't get a chance to write it down) has dropped from 11 in 2002 to 7 today. Conversion, therefore, is more important now than ever before. Jeffrey posits that successful target content has descriptive words found on its site 72% of the time. It's also important to stay relevant and show the same images or message from the ad to the landing page so as not to confuse or deter visitors. He finished his presentation with a useful acronym, AIDAS, or Attention, Interest, Desire, Action, and Satisfaction. These are important steps in successfully targeting a user and garnering a conversion. Lucas Morea, the CEO of LatinEdge, discussed how when converting visitors, it's important to remember that cultural differences don't change overnight. Many Spanish-speaking countries, for example, rely on alternate forms of payment and shipping due to local customs, the high prevalence of credit card or identity fraud, or various other reasons. Also, the overall offline experience may be as important or even more important than the online experience; that is, people may need to know that there are actual people behind a website that can be contacted if needed. Lucas maintains that the more offline capabilities a site has, the fewer clients it will lose. Come Sail Away, Come Sail Away, Come Sail Away With Me! After Day 2 wrapped up, I went sailing on Daron Babin and Brandy Shapiro-Babin's (of Webmaster Radio) sailboat with Joe Morin, Danny Sullivan, Vanessa Fox, Massimo Burgio, and Jessie Stricchiola. We had a great time and even saw some dolphins. Joe Morin and Danny Sullivan (aka the Gorton's fisherman) Well, that's about it. I had a fantastic time at SES Latino. I met a lot of great people in the industry and learned an immense amount of information about the Hispanic search market. The conference was incredibly valuable and showed me that we're not taking advantage of search marketing geared towards an important but overlooked demographic. I highly recommend going next year and hope that I can attend again. Special thanks to Rand for sending me and to Joe, Daron, Brandy, Danny, Vanessa, and Massimo for their generosity and kindness (whether it be picking up cab fares or dinner tabs or for simply chatting with me and showing me a good time). Also, thanks so much to Nacho Hernandez for putting together an amazing conference. He did a great job, and his presentation and moderating were top-notch as well. Finally, thanks to you, the reader, for putting up with my long-winded post. Until next time.....next time being SES San Jose, of course! íAdios Miami! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All Play and Some Work at SES Latino"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All Play and Some Work at SES Latino"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}