{
  "url": "https://moz.com/blog/all-eyes-on-you",
  "slug": "all-eyes-on-you",
  "title": "All Eyes on You - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You may already be familiar with eye tracking, a technology used to conduct marketing and usability tests for websites by examining the vision patterns of users as they view a page... but have you seen it in use? Etre, a company specializing in usability, offers an eye tracking service for clients,…",
  "content": "All Eyes on You SEO Analytics K By: katfive April 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: katfive April 14, 2006 All Eyes on You SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You may already be familiar with eye tracking, a technology used to conduct marketing and usability tests for websites by examining the vision patterns of users as they view a page... but have you seen it in use? Etre, a company specializing in usability, offers an eye tracking service for clients, and features a video of what eye tracking looks like on-screen. Watching other people's eyeballs flick back and forth made me self-conscious about my eye movement for about five minutes...eugh. But I would be curious to see the results for some big-name sites, as well as for SEOmoz and our clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All Eyes on You"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All Eyes on You"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "katfive\n          \n            katfive"
}