{
  "url": "https://moz.com/blog/am-i-an-seo-greenhorn",
  "slug": "am-i-an-seo-greenhorn",
  "title": "Am I an SEO Greenhorn? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As I was checking my usual list of go to websites this morning (SEOMoz, Marketleap, Prchecker, iWebtool & Widgetbox to name but a few!) I started to ponder... \"Am I an SEO greenhorn?\"...",
  "content": "Am I an SEO Greenhorn? Content Marketing M By: Martin Holland August 4, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Martin Holland August 4, 2009 Am I an SEO Greenhorn? Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As I was checking my usual list of go to websites this morning (SEOmoz, Marketleap, Prchecker, iWebtool & Widgetbox to name but a few!) I started to ponder... \"Am I an SEO greenhorn?\" I am completely used to feeling \"out of place\" because I grew up in Manchester, England and now live in Ft. Worth Texas, so the feeling that I might be new to something, or not quite fitting in, is not alien to me at all. I have held back on posting to the SEOmoz blog for a while now because I was just unsure whether I am SEO-savvy enough to contribute to an SEO blog. That often heard talk radio phrase came to mind: \"Long time listener, first time caller!\" I read SEOmoz every week and have found invaluable advice which I have definitely tried to follow, I like to think of my brain as a coffee filter full of ideas, my daily surf is the super hot water percolating through, I just hope the result is a nice Costa-Rican espresso and not a weak milky machine made coffee! So is there any way to determine if I am an SEO greenhorn? I enjoyed reading Rand's post \"What Makes an SEO\" and I can quantifiably determine that I an not an SEO, I think I qualify for the \"Technical\" rating because I definitely practice SEO with my blogs but I don't think I will ever qualify for the \"Self Constructed\" or \"Peer Validated\" attributes because my blogging is not yet a full time profession. I always try to focus on the quality of my blog content but a lot of my website updates are made with an aim to increasing search engine traffic; I use Keyword suggestion tools to help me pick titles for my posts, the titles are often a little obscure but it works! Example, I wrote about a company that uses green dye to make dead grass look healthy, my keyword research showed that \"Green Grass Leaves\" would generate more traffic than \"Green Blades of Grass\" etc. I try not to focus just on Google (which is difficult sometimes) and I am definitely working on my Yahoo! and Bing search results. Sitemaps galore have been submitted and I check my webmaster tools for the various \"other\" search contenders regularly. I have poked my head down the \"nofollow\" rabbit hole and implemented \"nofollow\" on some elements which recur in every post such as social networking links, I don't feel completely comfortable implementing \"nofollow\" techniques but I hope to learn more. I started my 2009 link campaign back in February and am focused on building meaningful links with sites that I truly want to be associated with. (High PR also helps!) My site has so far had very little investment other than my own time but I have started using pay per click advertising to direct people to key areas including promoting my site widgets, I won't embarrass myself by saying how little I spend on advertising but lets just say I spend more on coffee everyday. (Have I inserted enough coffee references yet?) \"Cross browser compatibility\" is no longer an odd phrase, I now try to test any updates I make in IE6, IE7, Mozilla and more recently Safari. My next adventure will be into creating a mobile friendly version of my site. Anyway, I am very conscious that people reading this post will probably have a finger hovering over that Back button so I will wrap things up. I guess I am looking for some of that \"Peer Validation\" so if you think I'm an SEO greenhorn, don't hold back, I can take the criticism (I hope) and would love to get some feedback. Am I on the right track or headed for SEO oblivion? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Am I an SEO Greenhorn?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Am I an SEO Greenhorn?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Martin Holland\n          \n            Martin Holland\n          \n            Martin Holland"
}