{
  "url": "https://moz.com/blog/an-example-of-why-content-is-king-the-guardian-chalkboards",
  "slug": "an-example-of-why-content-is-king-the-guardian-chalkboards",
  "title": "An Example Of Why Content is King - The Guardian Chalkboards - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes the power of the internet and the modern age just astounds me. I'll see something that I just need to share and this is one of those times. It's not necessarily about SEO directly but it certainly demonstrates some amazing internet marketing and it re-emphasis just how powerful data and…",
  "content": "An Example Of Why Content is King - The Guardian Chalkboards Social Media T By: Tom Critchlow February 6, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow February 6, 2009 An Example Of Why Content is King - The Guardian Chalkboards Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sometimes the power of the internet and the modern age just astounds me. I'll see something that I just need to share and this is one of those times. It's not necessarily about SEO directly but it certainly demonstrates some amazing internet marketing and it re-emphasis just how powerful data and original content is. I'm talking about the Guardian's recent football (soccer) application called the Guardian Chalkboard. It's an online application which has data from the past three years for every premiership football match, as well as info about tackles, passes, shots, throw-ins, etc for every single player! That's an incredible amount of data, and it allows you to draw virtual chalkboards and compare matches and players. In the words of Blue Peter, here's one I made earlier: by Guardian Chalkboards This is on the very basic end of the spectrum, but you get the idea. This kind of content is very nicely packaged up - the interface for creating them is slick. In short, it just works. And I suspect they're going to be raking in the benefits from this for a long time to come, not only in links, but also in coverage and branding. Every football forum, blog or site will be talking about this in the coming weeks if they haven't already, and that's worth more than just the links they'll get out of it. That said, I wouldn't be the SEO I am if I didn't do a little critique of the online implementation, so firstly here are some of the things I really like about the chalkboard: It's slick. The interface just works (barring a few tiny niggles, see below). There are very few barriers to creating a chalkboard and the whole process takes only 1 or 2 minutes (and that included me signing up for an account as well - now I have an account creating one will take no time at all). That's not say, of course, that you can't spend hours playing with the data if you want to!! Mmmm. Data. It's well integrated into the rest of the site. Take a look at their individual team pages (here's the Arsenal page) - nice and prominent is a link to the chalkboard application. Widgets! There are widgets! You can embed them! They have an html link back to the Guardian site! Tick, tick and tick again. I do love widgets. Virality. There's a call to action from each board to make your own or comment on the current one. Both of these things really encourage users to engage with the content, and engagement is the key to virality. Prizes. As if football fanatics really need an incentive to play with the data, the Guardian are also giving away signed premier league shirts to the best chalkboards. Social. Each chalkboard is open to comments, which generates discussion, and opinion, which is key to helping word about chalkboards. Encourage healthy discussion wherever possible. Each chalkboard appears on your own user profile page (here's mine) as well. Sure, the profile pages are a little bare but the idea is there. Unique URL for each chalkboard - this is basic, but you'd be surprised at how many people get this wrong! And last but not least, they deliver what they say they would. This is crucial to success and they seem to have done it well. Nothing about the process frustrated or confused me - the data seemed solid. Well done, the Guardian Ok, enough Guardian love. Here are a few things that I think could be done better (I'm well aware that many of these things are probably in the pipeline for development, but it's worthwhile to discuss these things so everyone learns): Too much flash. The application needs to be in flash - but I'm not sure I like the large flash used to explain the whole process. It causes the call to action to create a chalkboard appear below the fold. In fact, the call to action isn't even on the page when the flash first loads - it fades in! Not to mention the lack of link juice. I know, it's not a big thing but personally I don't like it. Certain pages (which appear to be used for aiding spiderability) appear on the www.guardianchalkboards.com site (e.g., this page: http://www.guardianchalkboards.com/clubchalkboards.aspx?clubname=arsenal). This seems unnecessary to me and it would be worth migrating all of this onto the main site. Again, this is probably a dev issue. The share code is poorly implemented - if you click 'share' on the widget, it takes you to a generic page full of Digg and reddit links. I think the chance of this page going hot on Digg or reddit is minuscule. I mean, most of the US doesn't even know what soccer is, let alone care about individual boards. I think this could be vastly improved by targeting the media people ARE likely to share them on, such as email (there's no easy way of emailing multiple people about your chalkboard and there's no tracking of how many emails are sent), Facebook, etc. Since forums are big business in the football industry, I think it would be great to offer a 'lite' embed code which is pre-formatted for forums and just shows an image of the chalkboard and links through so that people can embed them all over the place. Copy and paste. This is a small gripe but it really annoys me and is the only thing that actually frustrated me about the whole process - trying to copy the code for the chalkboard is really difficult. There is no godly reason why the embed code shouldn't a) auto-highlight, b) auto-copy onto your clipboard, and c) there should be a button to copy the code onto your clipboard. Forcing users to select and copy and paste is a barrier and a completely unnecessary one. IMHO. While there's loads of links to share, the chalkboard there isn't a perma-link field anywhere. I think this should definitely be in there - it's easy enough to copy and paste the address bar, but that's a barrier. No barriers! Also, where's the integration with twitter? Perma-links are ideal for pasting into Twitter. Yay links! It's great that there's a flat HTML link in the widget, but how about a second link to the actual chalkboard? It gets the Guardian a second link and is actually very user-friendly, as this drives you to go to the page and comment and interact with the board. Title tags. Title tags, title tags, title tags. There's probably not a lot they WANT to rank for with these chalkboards, but there's no reason why the title tags shouldn't be unique. After all, these pages are going to get links, and pages that have links are able to rank for things. Especially for a site like the Guardian, where page views and ad revenue is what it's all about. And there you have it. I hope you can all learn something from this - content really is king! It got me to link, after all! Now, can someone, anyone, pretty please make one of these for the NFL or the NBA?!! Disclaimer: The Guardian aren't a client, I just really liked the chalkboard and felt compelled to blog about it! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Example Of Why Content is King - The Guardian Chalkboards"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Example Of Why Content is King - The Guardian Chalkboards"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}