{
  "url": "https://moz.com/blog/an-indictment-of-the-major-competitive-intelligence-services",
  "slug": "an-indictment-of-the-major-competitive-intelligence-services",
  "title": "An Indictment of the Major Competitive Intelligence Services - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the last week, we've collected visitor traffic data from 25 popular websites in the search and online marketing space, including:\n\n    Brian Clark from Copyblogger \n    Aaron Wall from SEOBook \n    Matt Cutts from MattCutts.com ...",
  "content": "An Indictment of the Major Competitive Intelligence Services SEO Analytics By: Rand Fishkin October 18, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 18, 2006 An Indictment of the Major Competitive Intelligence Services SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the last week, we've collected visitor traffic data from 25 popular websites in the search and online marketing space, including: Brian Clark from Copyblogger Aaron Wall from SEOBook Matt Cutts from MattCutts.com Danny Sullivan from Daggle Mike Davidson from MikeIndustries (he also runs Newsvine) and many more... We're thrilled to be able to share this data in a way that illustrates the relative values of real visitor analytics vs. external metrics from competitive intelligence services. In the report, we've compared data from services like: Alexa Compete.com Ranking.com Netcraft.com Technorati Sadly, the findings aren't particularly encouraging from a marketer's/researcher's point-of-view, but it does provide fantastically accurate insight that I don't believe is available anywhere else. Check it out:Website Analytics vs. Competitive Intelligence Metrics A big thanks to all the participants; it's fantastically generous of all of you to contribute your competitive data so that others might learn. Please go visit their sites to help show your appreciation. p.s. Frankly, I was shocked about the relative traffic levels of some of the folks on the list. You've got to see it to believe it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Indictment of the Major Competitive Intelligence Services"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Indictment of the Major Competitive Intelligence Services"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}