{
  "url": "https://moz.com/blog/an-interview-with-danny-sullivan-on-smx-west-third-door-media",
  "slug": "an-interview-with-danny-sullivan-on-smx-west-third-door-media",
  "title": "An Interview with Danny Sullivan on SMX West & Third Door Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, I asked Danny Sullivan, Founding Partner and Chief Content Officer for Third Door Media (as well as the Editor-in-Chief at Search Engine Land) a few questions about the upcoming SMX West conference and the other sites he helps run (Sphinn and Search ...",
  "content": "An Interview with Danny Sullivan on SMX West & Third Door Media SEO Events By: Rand Fishkin February 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 10, 2008 An Interview with Danny Sullivan on SMX West & Third Door Media SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, I asked Danny Sullivan, Founding Partner and Chief Content Officer for Third Door Media (as well as the Editor-in-Chief at Search Engine Land), a few questions about the upcoming SMX West conference and the other sites he helps run (Sphinn and Search Marketing Now). SMX West represents the first larger scale show for the SMX Series. Can you talk about the \"whys\" behind this show - why 3 days rather than 4, why Santa Clara, why end of February, and why 4 tracks? Last year, it made sense for SMX to start off with shows that were focused around particular topics. We saw no one doing events for advanced search marketers or the intersection of social media and search, for example. Plus, 2007 was already set with four different major shows in the US aimed at the beginning to intermediate search marketer – with me and Chris Sherman doing two of them as part of our previously contracted work for SES! Doing a large show last year made no sense. Now it’s 2008, Chris and I are fully devoted to our SMX work, so it was time to move forward with larger shows. As I said, both SMX West and East are aimed at the beginning to intermediate search marketer, largely. Bigger -- IE longer – shows work well for them, since they need to come up to speed on things. But I tend to think of these shows as \"general purpose,\" because even if you’re advanced, there’s lots there for you (look at our agenda-at-a-glance, and we even have ski run style icons showing \"expert\" tracks from \"intermediate\" or \"beginner\" runs). General purpose shows are also a great place for many in the search marketing community to come together. Since Chris and I have successfully done this types of shows for years, we obviously wanted to keep doing them as part of SMX. It lets us continue the programming that people have enjoyed, plus since we’re in control of the entire series, we can ensure all the little touches we want are there too, from wi-fi (we got some crazy sponsor to pay for that – thanks Rand!) to really nice conference bags to a new special pre-conference networking system that’s just gone up (more here http://searchmarketingexpo.com/west/2008/network.php). And good food! Santa Clara is part of Silicon Valley, and doing a show there makes sense as you can more easily have the search reps turnout. As for three days, I felt that four days was getting too much when I was doing the old series. That’s one reason why I began making the fourth day more of a half day. People just get tired, no matter how much enthusiasm they have to start with. Ultimately, I think three days will work much better How many attendees are expected? How many booths? At what size would you consider the show a \"runaway success\"? I believe we’re expecting more than 1,500 people, with 50+ booths. I'll consider it a great success in that range! You ran the Search Engine Strategies conference series for nearly ten years - what are some of the biggest areas that you've tried to improve or grow with the SMX series vs. those things you've chosen to keep the same? Chris Sherman and I always drew praised for the quality of our programming, which came from thinking hard about sessions, looking forward in the space and thinking of new session ideas, working with speakers on topics and giving them feedback from evaluations. We’re continuing to use all that experience. The main change is that we’re working with a variety of session coordinators, people that when a particular session idea has been decided upon work closely on selecting speakers and the exact topics that will be covered. So sessions that cover both long-range strategies as well as tactics from in the trenches, we’re continuing to do those just as we always did. Probably the biggest difference is that since I can now influence the entire series, rather than just the programming, SMX is building up the overall conference experience. People want good food on plates. I heard that for years, and we’ve given it to them at our shows, and they love it. It can sound stupid, but little touches like that can make a huge difference. So, too, can ensuring there are a range of networking events for everyone, or that you can network ahead of time and other touches like that. Which audience groups do you feel will get the most value from SMX West? Who is this conference's primary target attendee? As I said, anyone might find it useful. It’s especially geared to beginners who will find our \"Boot Camp\" sessions will get them a basic grounding. Intermediate folks should find plenty of sessions that let them expand. There are sessions for Advanced people, of course. If you’re really advanced, then the SMX Advanced show in Seattle this June is a better choice, if you have to choose. But advanced folks thinking \"one or the other\" should look at our networking pass. This lets you hit all the networking events and the lunches without having to pay for the conference session portion. I’ve already heard from a few \"old school\" types that these were perfect for them. And, for balance's sake, what are audiences that either shouldn't attend SMX West or would probably get more value from another show? Like I said, the advanced folks should look at SMX Advanced. Or if you’re advanced and really into a particular area, then you might look at one of our specialized shows. I couldn't help notice Louis Monier from Cuill giving a keynote on the second morning - first off, what is Cuill and second, what is he going to be talking about? Will he be revealing any insight into the new startup search engine he's working with? Louis is a giant in the space. AltaVista begat much of what you see on Google – and if AltaVista’s owners hadn’t taken it down the portal path, Google might not have had such a great opportunity to grow. That’s not to take away from all that Google has done, but AltaVista was like a great boxer who suddenly had their coach throw in the towel. Louis will talk about search from his perspective – having started AltaVista, having later been part of Google and now being part of a new search start-up. He’s someone that’s seen it all in search and can better filter out the things that are really likely to stick. As for what he can reveal on Cuill, we’ll see. They’ve been very quiet, and I was thrilled they agreed to do this first public outing. But what we’ll learn remains to be seen. There's an afternoon panel on Tuesday the 26th about creating search marketing standards - in your personal opinion, is it time? Does the industry need self-regulation? A formal training program? I think the industry will do just fine despite the \"reputation problem\" that some think will kill it at any time. That’s failed to do so for years, and I don’t think it will any time soon. But it’s a pain, and it sucks that many good people in the industry have to deal with the stereotypes. I think that some type of system that lets the industry self-report actual scams might help. I don’t care what color your hat, black or white, no one likes rip-off artists. Perhaps there’s something that can be done there. There's also a panel that asks how the social graph might change search - I've seen only sparse mention of this phenomenon as yet, but some forward thinkers seem to think it's going to be a revolution. Can you tell us your opinion and some basics about how the social graph impacts search & search marketing? Right now, it doesn’t. There are high hopes it might, but there have also been attempts over the past years that have failed. Search doesn’t seem to be that social of an activity. Google’s probably had the most success from deciding that \"social\" means you and what you visit, using that activity to personalize results. But maybe new ideas will allow social to flow into search more. The Microsoft/Yahoo! news is fresh on everyone's mind and will certainly be a big water cooler topic at SMX West - any predictions for how the deal will go and whether we might be looking at a very fresh search landscape come end of February? I doubt things will be resolved by the end of February. Even Microsoft being optimistic things it would take until the middle of this year, if the bid is accepted. I could see a decision being made by the end of the month, of course – and then the waits on shareholder or regulatory approval. I tend to think Microsoft will have its way, but what’s going to emerge really remains to be seen. Personally, I think turning Yahoo into a pure search place and migrating portal stuff to \"classic Yahoo\" or MSN might be a way to go. The search world has been buzzing quite a bit about the competitive landscape between the major search marketing conferences. What are your thoughts on the subject - is the SEM world big enough for so many shows? Will there be cannibalization of attendees? How does SMX stack up against the others and what are your plans to stay competitive? I think there’s plenty of room for quality events. We expect to do that though the things I’ve mentioned, continuing our focus on great programming and experience. To stay competitive, we set ourselves a high bar to meet. Last question - on Third Door Media in general and your launch of the Search Engine Land, Sphinn, SMX, and Search Marketing Now properties, what's your assessment? Have things fared according to plan? What have been the biggest setbacks and the greatest accomplishments over the last 18 months? I’ve been thrilled with how things have gone. I don’t have any particular setbacks but rather unexpected digestion problems, I suppose – that we had so many partners approach us about doing SMX outside the United States. This year, our partners have shows running in Spain, Latin American, Sydney, China, Germany and the UK. We hadn’t planned to go international at first, but when good people approached us, it made sense to push ahead. As for the greatest accomplishment, I can’t go with one. We’ve got a trifecta – Search Engine Land as a recognize must read search blog after a year of running; Search Marketing Now offering great webinars to folks for free on a consistent basis, an entirely new resource for search marketers that can get overlooked between SEL and SMX; plus SMX itself as a new, viable conference series that’s here to stay. And hey, a fourth – that Sphinn emerged and became essential reading for so many people. Many thanks Danny! We're all looking forward to seeing you soon :) Danny takes a call during SMX Social Media in New York City, October, 2007 (courtesy of) BTW - Feel free to leave questions or comments in the thread and Danny may have a chance to stop by and contribute over the next few days. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Interview with Danny Sullivan on SMX West & Third Door Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Interview with Danny Sullivan on SMX West & Third Door Media"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}