{
  "url": "https://moz.com/blog/an-interview-with-wil-reynolds",
  "slug": "an-interview-with-wil-reynolds",
  "title": "#RCS, YouTube, and Being Helpful: An Interview with Wil Reynolds - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Wil Reynolds talks about who inspires him, his love of using YouTube to help others, and, of course, Real Company Stuff.",
  "content": "#RCS, YouTube, and Being Helpful: An Interview with Wil Reynolds SEO Events By: Erica McGillivray April 17, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray April 17, 2013 #RCS, YouTube, and Being Helpful: An Interview with Wil Reynolds SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Anyone who's seen Wil Reynolds from SEER Interactive give a presentation remembers him. The first time I saw him speak, at SearchFest in 2012, I found myself not just nodding along with what he was saying while checking Twitter -- but actually listening. I was actually thinking about what I was doing as an inbound marketer and how I could make it better. So when I sat down to interview Wil, I wanted to know more about his inspirations and his belief in the power of YouTube. And of course, Real Company Shit Stuff (#RCS). Wil at MozCon 2012. Photo by Rudy Lopez Photography. What's inspired you lately? I was most inspired by Lani Lazzari, the 18-year-old who went on the TV show Shark Tank and just killed it. (Fast forward to 22 mins to see her.) It was inspiring to think at that age she had the confidence, poise, ownership of the stage in a way that most people never gain in their entire professional lives. Younger people who do this tend to inspire me. I don’t throw around the word 'inspiration' often; it's something I don’t say lightly. I have also recently been reflecting on great client service, and I have been thinking a lot about how to create experiences for our clients that are above and beyond expectations. What got me inspired by that? A recent stay at a 5-star hotel. The attention to detail and the care about me enjoying myself were more than I’ve experienced anywhere. When you first started pondering #RCS, what kind of hope did you have for the widespread adoption you've seen? I had no hope. (It's why I didn’t register the domain or anything!) I just started thinking, 'Is my job going to be having a less crappy list of link networks? Do I get excited about sending emails as a female persona because the open rate is higher? NO way!' My hope for #RCS is the same it's been for every other presentation I’ve ever given. Give people one to two things that will stick with them WELL PAST the day or two after the conference. I want to find the simple things people can do or the mind shift we need to make to make real changes and real successes. Watch Wil's talk from last year's MozCon on #RCS. As you've implemented #RCS for SEER and your clients, what's a favorite 'ah ha' moment you've had or seen? The client response. It's amazing how every so often a lead comes in saying, 'We are looking to do #RCS.' That is always kind of exciting as it means the client and SEER are aligned on what success looks like. Getting two clients on TV, from an SEO company idea, is hands down one of my proudest moments. I’m glad to have clients who believe and a team who believes that an SEO company is just as able to develop quality marketing ideas as a marketing agency. I also realize that #RCS should have never had to have been said... If I was at a marketing, branding, or PR conference, it would have been a dud. As that is what they have been practicing all along. What's #RCS' biggest nemesis? Google. If #RCS doesn’t drive rankings, then many SEOs will continue to seek to find shortcuts. If the rewards for their hard work of convincing a client; building quality assets; and promoting it to real news outlets, publications, and bloggers will not get ranking love, that is a major smack in the face. You also advocate for marketers to help each other to build their careers. What are some of your favorite channels to help others on? YouTube. Google+ Hangouts. It's funny; right now, there is a massive debate on women at conferences. But, I have yet to see someone say, 'Hey, I’ll be on Google+ doing a hangout to help any of these guys (or gals) get better.' I absolutely love the power of YouTube to help others, even in my sleep. :) As a company founder, I see a large part of my job being to understand what my team is seeking in their careers. And as long as they are kicking butt for clients, how can I invest my time and network to help them get on that path or get that exposure. I think that is the start. While we're on the topic of giving back, you've spent some time lately unplugged and in Nicaragua to work for your wife Nora's nonprofit. Tell us a bit about it. My wife Nora co-founded an organization, Water for Waslala, to help people in very rural Nicaragua get access to clean drinking water. It's funny how, in parts of Waslala, I can get a cell phone signal, but I can’t get clean drinking water. That was eye opening as it was a reminder that there is no money in clean water, and as such, it's not as big of a priority, sadly. I have been twice, and the trip usually results in several bruises since it is like eight hours travel in the back of a truck. After being there though, it's always all worth it. I am most concerned with what [my unplugging and traveling to Waslala] says to Nora; I want her to know that me being off the grid never happens, but I place supporting her efforts as highly as she prioritizes supporting mine. I guess it is what makes us work. Awww. Thanks, Wil, for ending this interview on an awesome note. For more thoughts on #RCS, Wil will be speaking again at this year's MozCon, July 8th-10th. He'll be giving everyone an update on how #RCS been going and his tips for implementing it in your business. You can also follow Wil at @wilreynolds. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#RCS, YouTube, and Being Helpful: An Interview with Wil Reynolds"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#RCS, YouTube, and Being Helpful: An Interview with Wil Reynolds"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}