{
  "url": "https://moz.com/blog/an-initial-review-of-boudica-the-social-news-site-for-women",
  "slug": "an-initial-review-of-boudica-the-social-news-site-for-women",
  "title": "An Initial Review of Boudica, the Social News Site for Women - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Danny Sullivan's lovely wife, Lorna (who lent me a hat and gloves when we went to see Stonehenge on an especially cold, windy day), recently created Boudica, a social news site for women. The site is pretty new and is currently in Beta testing mode, but I thought I'd give an initial review of…",
  "content": "An Initial Review of Boudica, the Social News Site for Women Social Media By: Rebecca Kelley July 1, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley July 1, 2008 An Initial Review of Boudica, the Social News Site for Women Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Danny Sullivan's lovely wife, Lorna Harris (who once lent me a hat and gloves when Danny took me to see Stonehenge on an especially cold, windy day), recently created Boudica, a social news site for women. The site is pretty new and is currently in Beta testing mode, but I thought I'd give an initial review of things thus far. I'll start with the following caveat: I'm not an especially girly female. I love Digg and reddit and don't get offended by the \"omg hot girls\" content that frequents more male-dominated social media sites. However, having said that, though I'm not fawning over the latest fashion trends or counting down the days until the next Matthew McConaughey shirtless pec-baring chick flick rom com, I am still female, and thus I was intrigued by Boudica and wanted to take a peek under the hood and see what sort of content it has, the community it's building, etc. I don't intend this to be a scathing review of a site that's \"too girly\" for my tomboy tastes. I'll aim to be fair yet straightforward, and keep in mind that the following are nothing more than my personal opinion. What I Like About Boudica The community doesn't seem stereotypically \"girly.\" Thankfully, unlike this satirical glimpse of what the Internet would look like if it were \"ruled by females,\" Boudica features stories about women on the web, lists of \"super foods,\" crazy fad diets, travel tips, gadgets, geek stuff, and more. In other words, you'll find a lot of stories that frequent Digg and other social news sites. Sure, there are submissions about Sex and the City, body figures, and Desperate Housewives dinnerware, but there's also content that I find appealing. I can discover articles and stories that may slip through the cracks on other social news sites. There was a submission that linked to a study claiming that gay men have similar brains to straight women. It's an interesting article, and I hadn't seen it on other social news sites. While I saw some submissions that were already prevalent on Digg, del.icio.us, etc, I did find some interesting submissions that I'd not seen before. The site transcends beyond social news and focuses on the community. Though I haven't delved too deeply into Boudica, there's plenty for me to do here. I can send private messages to other members, post a blog entry, submit stories to the social news section, scrawl a quick message on the \"Scrawl Wall,\" and interact with members beyond simply adding them to my friends list. The various features are a nice change of pace from other social news sites--Boudica encourages participation and discussion, and it seems to reward/appreciate users who put a lot of time and effort into using the site. I like the marketing potential. Women-oriented sites can craft link bait and interesting articles/blog posts that appeal to women rather than trying to figure out a way to put a \"techy/young male\" spin on a story in hopes of getting a piece on Digg or reddit or Propeller. If Boudica gains in popularity, it can be a great marketing resource for sites that produce content/offer products that are more female-centric. What I Don't Like About Boudica Purple and pink aren't really my cup of tea. Does \"female\" always have to equate to \"pink and purple\"? I like bright greens and oranges and other \"web 2.0\" colors--I'd love to see Boudica have a hip, cool design that's fresh and clean but doesn't feel blatantly \"feminine.\" Also, from a usability perspective, the pink links are a bit light and can be difficult to read. I don't understand the top-level navigation. At this point I can't tell the difference between the News, Arts, House, Time-Off, and Talk categories. They all seem to list submissions. \"News\" and \"Arts\" could be different subject categories, but what's \"House\"? Are they stories that deal with home matters? That are appealing to housewives? Is it a category entirely devoted to Hugh Laurie? Is it mighty migh-tay, just lettin' it all hang out? The same goes for \"Time-Off\" and \"Talk\"--I don't understand what they signify. I think a brief but clear explanation for each category would be useful (and perhaps it's necessary to re-name the categories with something more intuitive). The site lists users by \"karma\" but doesn't explain what \"karma\" is. I can imagine that Karma is like your popularity or signifies the strength of your account, but it's never explicitly defined on the site. Why is karma good? How do you get more karma? Can you lose karma? What's the benefit of increasing your karma points? Do you get a nifty badge or title that you can display? This is another feature that I'd like to see fleshed out a bit more. The site layout is a bit too cluttered for my taste. One one page I can see submitted stories, my account information, a list of recent blog posts, a list of people on my friends list, a list of the best karma users, my friends' recent blog posts, an invitation to invite a friend to use Boudica, a tag cloud, the best published \"scoops,\" the best upcoming \"scoops,\" and the Scrawl Wall. It's a bit of an information overload. I don't really need to see my list of friends--that could be something I can click on and see within my profile. Recent blog posts/friends' blog posts could maybe go under a \"Blog\" section that gets added to the top-level navigation. I think the Scrawl Wall is cute, but it could move further down the page so that more important information (like upcoming and published scoops) can get moved further up. It seems like a lot of the information featured on the page can be better placed elsewhere on the site. Obviously, a lot of my gripes can easily be due to the fact that Boudica's still in Beta and is working out the kinks. For example, I like the tag cloud, but it's not working properly right now (I clicked on \"book review,\" which seemed like a popular tag based on its font size, but no stories pulled up). I certainly don't fault the site for any of the problems I've identified--I've no doubt that Boudica will strive to improve user experience and functionality based on its Beta feedback. That being said, overall I have to say that Boudica is a pretty interesting site. I'm really curious to see how popular it will become, not just among female SEOs and marketers, but what its adoption rate will be for other women (such as people like my sister, a teacher with two kids who casually uses the Internet but isn't uber-net savvy, yet sends me interesting stories and photos she comes across every now and then). I hope the site gains in popularity--if anything, it'd be a fascinating ethnographic study to see what sort of women frequent the site and what information they think is interesting. And, of course, as I said, the marketing potential is huge (hey, you can take the girliness out of the marketer...). Obviously I'll keep hanging around Digg, reddit, Propeller, Mixx, Yahoo! Buzz, del.icio.us, StumbleUpon, and other social news and social media sites, but alhough I'll certainly keep playing with the boys in their treehouse, I'm happy to sit down for a tea party with the girls every now and then, too. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Initial Review of Boudica, the Social News Site for Women"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Initial Review of Boudica, the Social News Site for Women"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}