{
  "url": "https://moz.com/blog/an-inside-look-at-competitors-backlinks-with-open-site-explorer",
  "slug": "an-inside-look-at-competitors-backlinks-with-open-site-explorer",
  "title": "An Inside Look at Competitors Backlinks with Open Site Explorer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hi SEOmoz folks,\n\nSometimes we begin a new SEO consulting service  and do not to know where to start our Link Building. We have a lot of  options but the first thing I really like to do is to analyze what my competitors are doing. As we know, one of the best ways to analyze  backlinks is by using…",
  "content": "An Inside Look at Competitors Backlinks with Open Site Explorer Link Building By: Fábio Ricotta July 13, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Fábio Ricotta July 13, 2010 An Inside Look at Competitors Backlinks with Open Site Explorer Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hi SEOmoz folks, Sometimes we begin a new SEO consulting job and do not to know where to start our Link Building. We have a lot of options but the first thing I really like to do is to analyze what my competitors are doing. As we know, one of the best ways to analyze backlinks is by using Open Site Explorer (OSE). With this tool we can submit a domain and see which pages on the web are linking to it and some awesome metrics. We can use it to begin our analysis. The first thing you need to do is to create a competitor list. Then you need to go to OSE and insert your competitor(s) domain(s). Then you will filter by links from \"External Pages Only\" and \"All Pages in the Root Domain\", as you can see below. With these filters, we guarantee that we will have an overall look at your competitors' website backlinks. After the above steps, we need to export all this data by clicking on \"Export to CSV\". After that, you will import this data to Excel: Next, you will remove the 6 first lines, as they are only comments. Then you need to select the first line, click on the Data Tab and select \"Filter\". This will give you the ability to sort every column by some filters. Now we can begin our competitor analysis. For this part, I have chosen 9 commonly used link building strategies that you can use OSE and find what your competitors are doing. So, let's take a look: Finding Directories As some SEOs know, using Directories as part of your link building strategy can provide a good value to your backlink profile. If your competitor is using any directory strategy, we can find it using OSE data, filtering the Title column by the text filter \"directory\" or you can filter the URL column with text \"directory\". The good part of that is that you can see the Page Authority and Domain Authority of each directory page that your competitor is listed in and figure out to which one you should submit your website. A \"bonus\" filter you can use is filter by PA above 5 and DA above 20, so you will remove all the bad directories from your list. Niche Forums One thing that I really like are forums, maybe it's because most of my knowledge came from there. Well, thinking about link building and SEO, when you find a niche directory, you find a community that talks about the same thing (or related) as you. If those members recommend your services you can get really good leads. So, one thing you can do is to investigate which forums your competitors were recommended in, so you can interact with those people. The idea here is to filter the Title column by the text filter \"forum\" or you can filter the URL column with text \"forum\". Using it will retrieve all the forums that provide at least 1 link to your competitor. You can use the same tip here that I gave in the last topic. Powerful Profile Pages Sometimes when we do a link building strategy we use some profiles to post and interact with customers and people about our website. And sometimes, those platforms that we use for it provide ways to drop a link (eg. user website). Based on this idea, one cool idea is to check which social networks your competitor is working. You can do it easily by filtering the URL column or Title column by text filters \"user\" or \"profile\". After identifying those profiles check how you competitor is working with it, like how is he interacting with the community, check if he is creating new content, check which keywords he is using on that new content. A good tip here is to check the backlinks to that profile page. We noticed that some competitors are buying links for that profile page, so they can get more juice and spread it to their content. I am not telling you to do the same, but maybe you can file a spam report. Tag Pages A common and cheap link building tactic is to submit your website to social bookmarking websites. Sometimes, social bookmarking does not provide a strong enough value, but many SEOs use it as a base for their link building strategy. So, you can find which social bookmarking websites your competitors are using. The good thing (tip) here is to find a niche social bookmarking website. Those kind of websites can provide you some good leads as they are related to your niche. So, be careful when checking this. To find the tag pages and then the social bookmarking websites, you can filter the Title column by text filters \"tag\" or \"tagged\". Another filter you can use is \"tag\" in the URL column. Where They are Submitting Articles As Rand pointed in a previous Whiteboard Friday, if you create a good Article Submission strategy you can get some good links and traffic. For example, you can filter the URL column with some already known article directories (\"ezinearticles.com\", \"amazines.com\", \"articlealley.com\", \"articleindex.net\", \"goarticles.com\", \"articlesltd.net\", \"365articles.com\", \"articletrader.com\", \"articlesbase.com\", \"thebestarticles.com\", \"mycontentbuilder.com\", \"thinkarticle.com\", \"articlerumble.com\", \"gsarticles.com\", etc...). The idea here is to find where your competitors are gaining links and then find their profiles. After that, grab a list of all articles that they posted and run a OSE report for each link (you can do it using the SEOmoz API). Check which ones have a large number of backlinks. Then you need to check why they attracted so many links and just use that idea to create some new content. A bonus tip here is that some article directories enable comments with link... so, try to comment in your competitors' best articles. Resource Pages as Good Backlink Sources Some years ago, one of the common things that webmasters did was to create pages listing some useful links as resources. Nowadays it's not common but the point is that there are a lot of resource pages out there. So you can check if your competitor is listed in any resource page and then ask the webmaster to include your valuable website. It's really easy, but don't forget to be generous and really show that your website can help their visitors. To find the resources page, you can filter the URL column using the text filter \"resources\". I've tried to filter the Title column but I didn't like the results I found. Competitors Press Releases When we talk about press releases we need to be careful about our objectives. The first thing here is to identify which company your competitor is using to distribute their press releases. So you can filter the URL column by the common PR Distribution companies (\"prweb\", \"send2press\", \"prnewswire\", etc...) and since those companies sometimes publish the press release inside their domain, you can find your competitor's press releases. The second step is to grab a list of all press releases they published and do the same thing I told you about article directories' profiles. Find which are the most linked press releases and why. This will give you some advantage in your next press release. Linkbait with InfoGraphics One of the latest link building tactics is to create amazing InfoGraphics. The cool thing for link building is that if you create a good infographic it can go viral and provide a lot of backlinks. So the point here is to see if your competitors are using infographics to get links. To check it, just filter the Title column by text filter \"infographic\" and you will find the list of infographics that give links to your competitors. The point here is that you can tell me \"Hey, when I create an InfoGraphic I post it at my site, not in someone's else blog\". You are right, but the point here is that some websites can't use / post those kind of images inside their structure, so they need to publish it as guest post. A tip here is: if you find an infographic inside a blog, don't forget to comment in the comments area. You can get some value there. Trusted links: Any .EDU or .GOV links? Most of the linkbuilders love .edu and .gov links. They are strong, they are trusted and they really rock. Based on that, you can check if your competitors have any link coming from any of those TLDs. You can find it filtering the URL column by text filter \".edu\" or \".gov\". You need to check why your competitors have those links and then try to find a way to get them. Don't forget to avoid those .edu crap networks. Wikipedia Links Worldwide known, Wikipedia is a great source of visitors and leads. We can't count their backlinks because of nofollow, but they still provide value by sending you traffic. We made some Wikipedia strategies for some clients and those links are just growing our referral visitors. You can find the Wikipedia pages that link to your competitors by just filtering the URL column by text filter \"wikipedia.org\". One thing to remember is that Wikipedia (moderators) does not like spam or commercial stuff. So the easy way we find to get a link from them is by adding some valuable content, specially when you adds notes about statistics that you published in your press release. This really rocks and in most cases they allow you to reference your data source (you). Conclusions We saw in this article that using a SEO tool such as Open Site Explorer could help you to find what our competitors are doing, providing us some insights on how to create our SEO strategy. It is important to highlight that I am not telling you to get the same backlinks that your competitors had, but I am trying to show you is that you can begin your strategy by getting the best of what your competitors did, and then, improve with your own ideas. Hope you liked this post! Fabio Ricotta is the Co-Founder of MestreSEO, a brazillian SEO company. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Inside Look at Competitors Backlinks with Open Site Explorer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Inside Look at Competitors Backlinks with Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Fábio Ricotta\n          \n            Fábio Ricotta"
}