{
  "url": "https://moz.com/blog/an-introduction-to-pr-strategy-for-seos",
  "slug": "an-introduction-to-pr-strategy-for-seos",
  "title": "An Introduction to PR Strategy for SEOs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jen Lopez and Everett Sizemore invited me to elaborate on the \"PR side of SEO\" in a detailed Moz post. Here's that post!",
  "content": "An Introduction to PR Strategy for SEOs Public Relations | Branding By: Samuel Scott March 5, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Samuel Scott March 5, 2014 An Introduction to PR Strategy for SEOs Public Relations | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In case you missed it, Google’s head of web spam, Matt Cutts, wrote this on January 20: “Okay, I’m calling it: if you’re using guest blogging as a way to gain links in 2014, you should probably stop.” Three days later, Jen Lopez of Moz responded with this excellent post on “guest blogging with a purpose”: As with anything, you don't want to be out there trying willy-nilly to get your posts on every blog for the sole purpose of building (probably bad) links. It's important to have this tied to your business and marketing goals, as you would with any other tactic. SEO is only one piece of the larger strategy, and if you focus solely on writing posts for link building purposes, you're missing out on a ton of other possibilities. In Lopez’s post, I commented in some detail that “guest posts” are really just another name for what the public relations industry calls “by-lined articles” and that the goals of the two should be identical. In response later in that thread, Lopez and Everett Sizemore invited me to elaborate on the “PR side of SEO” in a detailed Moz post. Well, let’s get to it! Marketers, Assemble! (photo courtesy of Marvel Studios) First, let’s set the record straight. As I’ve written elsewhere while using “The Avengers” as an example (Joss Whedon fans, unite!), \"SEO\" is actually just a slang term for a collection of best practices -- it is doing web development well, content creation well, social media well, PR well, and so on. This is why successful SEO, and digital marketing in general, necessitates that companies “assemble” a holistic, integrated team with expertise in numerous disciplines. And that includes public relations. Rand Fishkin once tweeted a similar sentiment: Here, I’ll cover how PR relates to content and linkbuilding. PR By Any Other Name… I can already hear the groans: “But, wait! I’m not a PR flak! I’m an inbound marketer!” I completely understand – as a former journalist, who only later went into SEO, I specifically had been looking for something in marketing that was not PR. But the fact remains that much of inbound marketing is just PR by another name: Are you interacting with influencers, journalists, and bloggers on Twitter? Sure, you can call yourself a “social-media marketer” – but you are really doing PR Are you pitching guest posts by-lined articles to news outlets and other online publications? It is not “guest post marketing” – it is PR. Are you e-mailing people in the hopes of getting links, mentions, or anything similar? It’s often called “e-mail outreach” today, but it is just doing PR via a specific communications channel It took me a long time to accept the fact that a lot of what we do as “SEOs” is actually, well, PR. But the sooner that we accept that fact and throw away our preconceived notions about PR, the sooner that we can start to learn, adopt and benefit from its best practices. Here’s the kicker: Technologies and communications channels change, but people do not. Publicists, for example, may contact reporters with Twitter more than the telephone today – but it is still one human being talking with another human being. And PR experts know how to work with people. Social media is often just a communications channel – and not a discipline unto itself – that can be used by PR professionals, customer-service representatives, lead generators, and more. The Basics of PR Strategy There are many types of PR. But since the idea for this post was born out of a discussion on guest posts, I will discuss PR strategy here specifically on pitching content and story ideas to journalists and bloggers. This is a brief summary of some of the ways that The Cline Group works with our PR clients – and the resulting “hits” (in PR-speak) give them the added bonus of gaining quality, natural links and social media exposure as well! The first thing to understand is that public relations is an art, not a science. There are specific, defined ways to create XML sitemaps, ensure that Google can crawl and index a website, avoid duplicate-content issues, reduce page-load time, and more. PR methods, however, can vary as drastically as the number of people using them. Here, I will present the overall strategy that The Cline Group uses in our public-relations work. This strategic, step-by-step process delivers the best results. 1. Goal Identification PR is not an end. It is a means to an end. The goal is not to “get coverage” – the goal is to get coverage that supports a company’s overall business and marketing goals. Here are some examples of our PR clients’ goals: We want to gain VC funding or to exit by selling We want to maximize downloads of our mobile application We want to gain more leads who will become users of our B2B software We want to build our brand through authoritative content It is useless to create a PR strategy without first having a clear sense of the objective. 2. Target Market Identification The PR team must then research and compile a list of the general targeted audiences based on the goals that the client established. Here are some for the above examples: Investment: Angel investors, start-up founders, corporate VC funds Mobile Downloads: People who would be interested in a mobile app (of the given type) B2B Leads: The business owners, executives, and managers who would be interested in the solutions that the B2B software provides Content: The people who would be interested in the information that the content communicates 3. Messaging and Positioning Once the goals are determined and the target markets are identified, then the PR team can determine the positioning (how will you brand the company/individual/product/content to the target markets) and messaging (what text, images, and more will you use to communicate the positioning). Take one of our mobile-app clients, MediSafe Project. Which of the following pitches do you think would be more likely to interest reporters, and, in the end, their readers? “MediSafe reminds people to take their medication.” “A year and a half ago, Bob Shor’s diabetic dad asked him if he had seen his dad take his insulin. Bob’s answer, “No, I didn’t see you take your meds” was interpreted by his father as “No, you haven’t taken them.” His dad overdosed that day, which Bob says was the reason he and his brother Rotem created MediSafe, a collaborative app that helps keep track of long-term medication.” The second example is the opening paragraph of a Cult of Mac article. That coverage came from positioning MediSafe as a personal story rather than as just another random app. 4. Media List Creation The next step is to compile a list of the outlets – and the most-appropriate writers at those outlets – that are read by the identified target audiences. The importance of this phase of the process cannot be emphasized enough. An ideal media list should usually be comprised of publications that have all of the following (in both PR and digital contexts): The publications that are read by the target audience The specific writers at those outlets that will likely be most interested in what you are pitching Publications with large readerships Outlets (and writers) with large social-media followings Publications whose online sites have high Domain Authority When compiling media lists, remember that time is a limited resource. There are only so many hours that a PR team can devote to a campaign. At one extreme, they could send the same, generic press release to thousands of outlets via a wire service and just hope for the best. At the other extreme, they could focus all of their efforts on a single reporter at a single outlet that is highly desired. A simplistic example: Say a PR executive has one hour of pitching time – should he or she spend one hour on one outlet or five minutes each on twelve outlets? Usually, you want to be somewhere in the middle. 5. Press Release Development and Pitching The final stage is to craft the actual pitches and press releases. Sometimes the same press release can be used. Other times, it is best to create individualized, tailored releases for each type of outlet or each specific reporter. It just depends on the context. One example of online pitching will be discussed in the next section. A good PR strategy can lead to great SEO results such as this outcome from one single campaign for iOnRoad, a mobile app that was later bought by Harman International following our work (the PowerPoint slide originally contained an animated GIF of Hugh Laurie – a.k.a. Dr. House – from back in his British comedy TV days): This one campaign netted 591 quality links from 253 authoritative domains – and a lot more. Whether digital marketers are promoting a company, a product, or a piece of content, those who use this general strategy will be many steps ahead of the competition. Sizemore once summarized the importance with the following statement in this essay of his: If I had to choose between your average link builder and an expert PR professional who knew how to approach and interact with media outlets and presented well on camera, I’d go for the public relations person any day of the week. Twitter's a PR Gold Mine Twitter specifically is an invaluable tool for PR pitching – but it must be used strategically and wisely in this context. My colleague Scott Piro, our EMEA Managing Director and Chief Strategy Officer, has written a guide to using Twitter for media relations. I highly suggest that Mozzers read his essay for more details (not that I’m biased!), but I will summarize some of his points here: Many busy reporters do not answer their phones and receive countless e-mails, but they do pay attention to Twitter Writers will often say in their Twitter bios whether they want (or do not want) to be tweeted with pitches Twitter is public, so do not give away too many details of an exclusive story – switch to e-mail or the phone as soon as possible Link to a press release somewhere online (on a company website or on a wire service) Know your audience and when to be more formal and when to be more friendly Piro also gives two general examples of Twitter pitches: The Benign Intro: @journalist Do you accept story pitches? If yes, what’s the best way to send you one? THX The FYI: @journalist I emailed a story idea to your [media outlet name] address. Hope u can take a look; I think it’s rly a good fitPR: The Old and New Off-Page SEO I’d like to close this post with the rest of my comment on Lopez’s earlier Moz essay: When I was a journalist, the point of submitting freelance articles or op-ed articles was to publish a piece of quality content to build your \"brand\" (as a writer or pundit). It was not primarily to get links (especially when links did not exist before the public Internet). In PR, companies submit what are called \"by-lined articles\" to build a brand and raise awareness of your company among the readers of a certain publication. (If you sell widgets, then you want exposure in a media outlet that is read by people who buy widgets.) It is not primarily to get links. Today, it's called \"guest posts.\" The same is true today. When my company gets articles in specific, targeted media outlets for clients, the point is first to build a brand and second to get referral traffic (and hopefully leads or sales) via a link in the author's biography or elsewhere. No-follow or not, it didn't matter… I now advocate that no one do anything with the primary purpose of \"getting links.\" Do the great content, promote it on social media, and the links will come naturally, indirectly, and organically. You are earning them and not building them. One of these links are worth ten of the others. Example: My agency gets a client a great by-line article in a great outlet. The article may contain a (do-follow or not) backlink or not. But it doesn't matter -- the exposure is what matters. Then, the readers will see the content and perhaps write about the company on their own blogs with links. It snowballs from there. But in the end, it's not directly about the links. As long as a company does all of the \"SEO\" best-practices, the good links will come themselves over time. I would submit that this is what Google still likes. It is \"guest posting\" for reasons other than links. The same is true for press releases -- you distribute news releases to get coverage, not links. The links will then come later. It all comes down to what I’ve called the “PR-based SEO process”: The idea can be summarized as such: Do something newsworthy Create newsworthy content based on what has been done Promote the company and content Repeat as often as possible Linkbuilders often ask themselves: “Why would this website want to link to us?” Reporters ask a related question (at least to themselves): “I get dozens of pitches a day – why should I write about you?” If you can answer this question, you’ve got a great head start. As I wrote in the linked post above: What can a company do that would interest journalists? The possibilities are limited only by the imagination – release a new product, hire a big-name executive, conduct an authoritative analysis of the state of the industry, and so on. Then, create quality, engaging content in the context of the action – a blog post, an infographic, a press release, a video, a podcast, and so on. The next step is crucial: use traditional public relations to promote the company’s news – and use online PR and social media to promote the content created for the news to obtain backlinks, citations, and social-media mentions. This practice will yield far better online PR results than just stuffing backlinks into meaningless press releases. Here’s the secret: Reporters want to write about you. Years ago, space in a newspaper and minutes in a broadcast were limited. Journalists could be picky. Today, however, they know as well as we do that “content is king” and the way to maximize traffic and (for their purposes) advertising revenue. Writers are under constant pressure to write and write and write since websites can support an almost-infinite amount of content. So, it can be easier to convince them. Just give them a nudge through the strategies that we’ve presented here. For more details on SEO and public relations, I invite you to see my SMX Milan 2013 presentation and notes. I will also speak on a similar subject at SMX West in March 2014. I hope to see you there! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Introduction to PR Strategy for SEOs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Introduction to PR Strategy for SEOs"
    },
    {
      "level": "H2",
      "text": "Marketers, Assemble!"
    },
    {
      "level": "H2",
      "text": "PR By Any Other Name…"
    },
    {
      "level": "H2",
      "text": "The Basics of PR Strategy"
    },
    {
      "level": "H3",
      "text": "1. Goal Identification"
    },
    {
      "level": "H3",
      "text": "2. Target Market Identification"
    },
    {
      "level": "H3",
      "text": "3. Messaging and Positioning"
    },
    {
      "level": "H3",
      "text": "4. Media List Creation"
    },
    {
      "level": "H3",
      "text": "5. Press Release Development and Pitching"
    },
    {
      "level": "H2",
      "text": "Twitter's a PR Gold Mine"
    },
    {
      "level": "H2",
      "text": "PR: The Old and New Off-Page SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samuel Scott\n          \n            Samuel Scott\n          \n            Samuel Scott"
}