{
  "url": "https://moz.com/blog/an-seos-guide-to-http-status-codes",
  "slug": "an-seos-guide-to-http-status-codes",
  "title": "An SEO's Guide to HTTP Status Codes (An Infographic) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A visual guide to the HTTP status codes that really matter to SEO (200, 301, 302, 404, 501, 503). Half infographic, half cheat-sheet, half man, half bear, half pig.",
  "content": "An SEO's Guide to HTTP Status Codes (An Infographic) Technical SEO By: Dr. Peter J. Meyers May 31, 2011 Table of Contents Copied! By: Dr. Peter J. Meyers May 31, 2011 An SEO's Guide to HTTP Status Codes (An Infographic) Technical SEO A while back, I started thinking about how the different status codes and redirects (301s, 302s, etc.) might look visually. I started drawing up some ideas for what was going to be an illustrated blog post, but then it suddenly dawned on me that I was slowly creating an infographic. I then proceeded to have a conversation with myself about how I could never create an infographic and was probably doomed. Depression turned into mania which turned into depression - this happened about 47 times between 9:00 and 9:14am. Actually, that's the start of my typical day.I could go on, but I'll just cut to the chase. I took the most useful HTTP status codes, from an SEO perspective, and illustrated how they work. It's half cheat-sheet, half-infographic, and mostly just an excuse for me to have some fun. Hopefully, somebody learns something. This is completely my fault, so if you gouge your own eyes out with a spork to escape the horror, don't sue SEOmoz.Click the image to see the full-sized version. A few technical notes:As I mention about 301/302, I've abbreviated some of the official names for design purposes.The visual format required a black-and-white interpretation. Search-engines handle 302s inconsistently.Rel-canonical is obviously not a status code, but it's a functional relative that I felt should be included.Comments are welcome. Did I miss any of your favorites? There are dozens, of course, but many are similar or almost never used. The 400-series alone has dozens of status codes, actually, most of which I had honestly never heard of in 13 years of full-time web work.When I was about 90% done with this infographic, I found out that fellow SEO and Moz friend Richard Baxter created a status code diagram earlier this year. It's pretty cool, too, and you should check it out. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An SEO's Guide to HTTP Status Codes (An Infographic)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An SEO's Guide to HTTP Status Codes (An Infographic)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}