{
  "url": "https://moz.com/blog/an-seomoz-pro-tip-for-everyone",
  "slug": "an-seomoz-pro-tip-for-everyone",
  "title": "An SEOmoz PRO Tip (For Everyone) & Feedback About the PRO UI - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Lots and lots of people sign up for SEOmoz's PRO membership, and I have to tell you that on a personal level, every single one makes me feel honored, humble and yes, even a bit guilty about reading comic books last night instead of working on new tools/q+a/tips/etc. One of the big frustrations PRO…",
  "content": "An SEOmoz PRO Tip (For Everyone) & Feedback About the PRO UI Technical SEO By: Rand Fishkin July 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 17, 2008 An SEOmoz PRO Tip (For Everyone) & Feedback About the PRO UI Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Lots and lots of people sign up for SEOmoz's PRO membership, and I have to tell you that on a personal level, every single one makes me feel honored, humble and yes, even a bit guilty about reading comic books last night instead of working on new tools/q+a/tips/etc. One of the big frustrations PRO members have, though, is that they can't find (or don't even know about) a lot of the cool stuff PRO membership provides. For example, at SMX Advanced, I did a few demos of PRO at our booth, and lots of folks gathered to watch. When I showed off the Q+A Section, someone commented that they didn't even know it existed (or that they could ask questions and see everyone else's past Q+A in the knowledge base), despite being a PRO member for the last 3 months. Even worse was our PRO Tips which, when I showed it, elicited audible gasps from members who'd never known we offered it. Thus, although I feel a bit uncomfortable about promoting our paid service, I want to let PRO members know that the tips section is REALLY valuable and useful. I also thought I'd give this post some real editorial value and share an example of how PRO Tips work - here's a sample (note: this one's new and hasn't been published before): Discovering the Relative Crawl Speed of Googlebot on a Site As Jonah Stein noted at SMX Advanced, crawl frequency may be the new PageRank (as far as valuable/usable external measurements of a site/page's relative importance to the engine). Knowing how often a particular page is crawled or how quickly Googlebot reaches new content on a domain gives insight into potential ranking ability, bot behavior, and the percentages of content getting spidered and included. Google exposes this data with date-specific range queries, such as http://www.google.com/search?q=site%3Aseomoz.org&as_qdr=m2 - which uses the &as_qdr parameter plus either d/m/y (and a trailing number) to show results from a given time frame. You can expand this query to be creative by using subfolders or keywords, as well. For example, I can see how many threads from our q+a section have been spidered in the last 10 days with http://www.google.com/search?q=site:seomoz.org/qa+inurl:view&as_qdr=d10&filter=0. Using this query, particularly several times over the course of a few days/weeks, can help you puzzle out how frequently Googlebot is crawling a site, even without log files. I wouldn't take this as far as saying that sites that are crawled more frequently are always more important (they may just produce less fresh content), but certainly improving this metric over time, especially on a large site or blog, can have very positive effects. It's also valuable as a competitive intelligence tool to get an idea of what new content is being produced, how frequently, and which portions are getting indexed. UPDATE: Hamlet Batista wisely points out in the comments below that looking at the cache date for the pages is also valuable, as this differs substantively from the indexing date (and that information can be valuable as well). You'd also want to calculate which URLs you've updated and when to match against the data Google provides, for a more complete picture. If you like getting tips like this, do check out the PRO Tips section for lots more (they're typically updated 1-2X per week): Naturally, this brings up issues of how to make the SEOmoz PRO interface better, particularly from a navigational and discovery perspective. If you're a regular user of PRO, and you've got insight about what you'd like to see, we'd love to hear from you. We're working under the gun on a very ambitious set of projects for October (sorry - they're extra top secret), but after that, our goal is to build a more usable, friendlier site, and we want to make it as user-centric as possible. In addition to collecting feedback here on the blog, we'll be asking some PRO members to demo some of our new products & interfaces in the near future. If you'd like to be part of that group, look for an email to PRO members in the next 60 days and we'll make you part of our alpha/beta testing team. Thanks for the suggestions & support! BTW - Technically, the prize for least-known benefit of PRO membership has to go to the discount store. Even the link & social media directories get more love than that guy :-) Also - Only 90 minutes left to run all the Trifecta reports you want before we start limiting to PRO (and 1/day for non-PRO). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An SEOmoz PRO Tip (For Everyone) & Feedback About the PRO UI"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An SEOmoz PRO Tip (For Everyone) & Feedback About the PRO UI"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}