{
  "url": "https://moz.com/blog/an-seo-dream-job",
  "slug": "an-seo-dream-job",
  "title": "An SEO Dream Job - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While many in SEO, myself included, pride themselves on being independent contractors or owners of small firms (in my case), there are others who are seeking that prestigious, well paying position in the Internet industry that will provide security, challenges and a fun work environment.\n...",
  "content": "An SEO Dream Job Public Relations By: Rand Fishkin July 27, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 27, 2005 An SEO Dream Job Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While many in SEO, myself included, pride themselves on being independent contractors or owners of small firms (in my case), there are others who are seeking that prestigious, well paying position in the Internet industry that will provide security, challenges and a fun work environment. Thanks to a new friend of mine, John Broady of CNET Games & Entertainment, that opportunity is now open. CNET Games runs sites like TV.com, MP3.com and the illustrious Gamespot.com. If you've visited these sites (as I have) and thought to yourself - \"man, they could be getting so much more traffic if they did SEO right\", this could be the right position for you. While John noted to me that they're looking for an exceptional SEO, they're also seeking someone who can fit well with their team and has the right persona for the job. For those of you who hide in your basement and snarl at other humans, this may not be the perfect career path, but for those who feel that a journey into some highly competitive, honest, corporate SEO would be a great experience, it could be a great match. Plus, this is your chance to market video games, HDTV and everything else you love about technology in the 21st century. If you're seeking the position, see the full job listing at SEW and send an e-mail to John - jmbess2003-1 at Yahoo.com. I can personally vouch for the fact that this is not only a serious job offer, but commands the salary and position due a top-notch SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An SEO Dream Job"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An SEO Dream Job"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}