{
  "url": "https://moz.com/blog/analyze-the-google-link-command",
  "slug": "analyze-the-google-link-command",
  "title": "Analyze the Google Link Command - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "RustyBrick - a frequent poster on SEOChat and many of the other major search engine forums released a tool over the summer that conducts an advanced analysis of the links listed in Google's link command. ...",
  "content": "Analyze the Google Link Command Search Engines By: Rand Fishkin October 14, 2004 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 14, 2004 Analyze the Google Link Command Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. RustyBrick - a frequent poster on SEOChat and many of the other major search engine forums released a tool over the summer that conducts an advanced analysis of the links listed in Google's link command. The link popularity analysis revealed some fairly interesting things. In addition to showing how PageRank is being passed, I discovered that several links which I presumed were not counted because of re-direct scripts actually have been counted by Google. If only Rusty could provide the same analysis for the Yahoo! linkdomain command... p.s. Check out this new post for a more up to date view on Google's link command. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Analyze the Google Link Command"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Analyze the Google Link Command"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}