{
  "url": "https://moz.com/blog/anatomy-of-a-forum-thread",
  "slug": "anatomy-of-a-forum-thread",
  "title": "Anatomy of a Forum Thread - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Kim Krause Berg posted a hilarious topic over at Cre8asite on the subject of a forum thread on light bulb changing. Naturally, her fellow SEO forum members chipped in with their own personal takes on the post and ma...",
  "content": "Anatomy of a Forum Thread Public Relations By: Rand Fishkin September 29, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 29, 2005 Anatomy of a Forum Thread Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Kim Krause Berg posted a hilarious topic over at Cre8asite on the subject of a forum thread on light bulb changing. Naturally, her fellow SEO forum members chipped in with their own personal takes on the post and managed to turn it into a perfect example of Kim's joke... Enjoy folks, this may be one of the few times you'll actually see me flame someone in a thread. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Forum Thread"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Forum Thread"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}