{
  "url": "https://moz.com/blog/anatomy-of-a-link-bait-pitch-letter",
  "slug": "anatomy-of-a-link-bait-pitch-letter",
  "title": "Anatomy of a Link Bait Pitch Letter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I’ve exhausted a lot of research lately on best practices when writing a pitch letter for publishing content as link bait online. A lot of the suggestions were the same, but each piece I read had one or two suggestions different than the others, so I’ve compiled them all into one document that will…",
  "content": "Anatomy of a Link Bait Pitch Letter Content Marketing By: Andras Kovach August 3, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Andras Kovach August 3, 2010 Anatomy of a Link Bait Pitch Letter Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I’ve exhausted a lot of research lately on best practices when writing a pitch letter for publishing content as link bait online. A lot of the suggestions were the same, but each piece I read had one or two suggestions different than the others, so I’ve compiled them all into one document that will hopefully make sense and help when you’re ready to submit an article or post to be published. I’m not saying this is the be-all, end-all of writing a pitch, so if it doesn’t make sense for you to use these suggestions for your client or company, just don’t use them. This is just one process that happened to work for me. Please enjoy! Overall notes about the “feel” and “sound” of your pitch letter: The overall tone of your pitch letter should be light, positive, and professional-sounding. After making the ten-plus “final” edits we all tend to make, read your letter out loud to yourself or to someone else. (My two yellow labs, Toby and TJ, are great listeners!) Plus, after the twentieth time reading it to yourself, your eyes are pretty tired, especially if that twenty times has been on a computer screen. I always catch things I hadn’t caught before when I read my piece out loud. Your letter should look good, too. Type it in a consistent 12 point size in an easily-readable, internet-friendly font such as Arial. Don’t use email “stationary” or multiple sizes and colors of fonts throughout your letter, just stick with plain black. Always spell- and grammar-proof your letter. It never hurts to have someone else read through it. Other people tend to catch what you’ve missed. (Don’t be afraid of the red pen!) And make sure your attachments are attached! I can’t tell you how many times I’ve fired off an email without attaching the attachment; it never fails to make me pull a Homer Simpson. The introduction of your pitch letter Use a friendly, positive greeting along with the contact’s first name. This detail sounds personable and shows you’re paying enough attention to not make it sound like an automated form letter. You want to sound human, because, well, you’re human. Good Afternoon, Stella— Identify yourself and your company. If your company has a website, go ahead and make it linkable. Your contact, if she’s never heard of your company, may want to see which website she's dealing with right at that moment to quickly check for legitimacy. Sometimes this part can be a bit awkward to write because you don’t want to make your contact feel belittled. I usually just cut to the chase and get it over with. It’s Summer from Widgets-R-Us.com. Getting into the body of your pitch letter Talking about your relationship with this person’s company or website makes a personal connection. Now’s the time to name-drop. (But don’t sound overly name-droppish.) Mention the scope of the content: if it's educational, informational, humorous, etc. Suggesting where the content might be placed on her website gives her a quick mental image of how it might look to her readers. I’ve been conversing with Mary Carpenter for a while now, and in our most recent conversation, found out she’s no longer with WeSellWidgets.com. She recommended I contact you directly about some educational content you may be interested in posting on your website, perhaps as a blog post. Explain the piece’s title and what it’s about. If you’re including photos, host them yourself so she doesn’t have to go to the trouble. Your article, especially if it's of an educational or informational nature, should offer additional resources so her readers can learn more about the topic if they so desire. Also, work a reference into your pitch linking to a previous/archived post on her site. This also shows you’re familiar with, and took the time, to explore her site’s content. The Non-Widgeter’s Guide to Using Widgets focuses on the first-time widget buyer and includes a couple of photos, as well as resources linking to definitions, product examples, and where to learn more, including a link to one of your WeSellWidgets.com archived posts regarding the most common widgets invented. Write some quick bullet points showing the article’s main elements at-a-glance. Your contact is most likely skimming through your email the first time she sees it, so the bullet points will stand out to her. In addition, this light-hearted, in-depth article teaches readers: * What widgets are * How they operate * How to choose the right widget for her specific needs * Why replacing the factory widget is beneficial * How to test the widget system to make sure it’s working Note that I wrote “her specific needs.” Pay attention to the general audience of the site you’re pitching. In my actual real-life pitch letter, I acknowledged that the main audience of her particular site is women. This showed my contact I know about and understand the whole angle of the site: it’s female-friendly. Again, do your homework! Perform a search on your contact’s site for anything that has to do with the subject of your content. Go back a few months. But make sure you're not giving her readers old, out-dated information. If you happen to find a reference more than a year old on her site, and there was nothing more recent on your subject matter, use that to your advantage: mention in the pitch letter that you’d like to offer updated, current information to her readers. You also want to offer your contact something valuable her site doesn’t already have. Go ahead and link to this reference so she can click on it and say, “Oh yeah, we don’t have anything like that on our site.” Mention how this information is a must-read and how it benefits her readers. Not wanting to offer you duplicate content, I performed a search on your site and found a reference, but no recent posts, specifically about the first-time widgeter’s widget experience. I’m confident your readers will enjoy the opportunity to learn how they can save money by increasing their widget’s efficiency and output. Ending the pitch letter You’ll want to end your pitch letter well because it’s how your contact will know how to get back to you, and it's how they'll remember you. Make sure all of your contact numbers and website/email address links are correct and are working. The last thing you want to have happen is for your contact to jump on the opportunity to post your content, only to discover your email address link is broken and doesn’t work. She’ll most likely move right on to the next offer. And she’ll probably pass over your email the next time you try to pitch her on something else. (Pay attention to this part; it's important.) Be sure you attach your copy and photos post-ready in HTML format so all your contact has to do is simply cut and paste. It’s a good idea to send a backup rich-text Word document as well. Your contact is a very busy person. Anything you can do to make it easier for her to publish your content would be much appreciated. I’d be delighted to hear from you any time via email at summer.s@widgets-r-us.com or by telephone at 888-555-8855 x.285, as the article is post-ready. (I’ve attached it in HTML code for you to simply cut and paste, and also as a backup .rtf Word document.) Make sure to mention when you’re going to be following up...and then do it! If you say you’ll be calling on Friday, call on Friday. Be true to your word. End the letter cordially and personably with a thank you and a call-to-action. (I prefer to put a smiley face beside my name on my correspondence; it’s just something I do. If you’re not comfortable with that, don’t put anything there except your name.) I prefer to make my company’s website, Facebook page, and Twitter information linkable. I also prefer to end with my first name only as all of my contact information is directly below my name in my signature line. These two things show my friendly and approachable personality. I know you’re a busy lady, so I’ll connect with you toward the end of the week, but feel free to contact me before then. Thanks, and I hope to hear from you soon! Summer [List contact information.] Sit back and see what happens It may not work this way for everyone in every situation, but it did work for me on my first official pitch: Hi Summer. J-- forwarded your letter to me. I'm the new Consumer Marketing person here at _____.com, and I've also taken over supervision of the blog. I have to say I was very impressed with your letter - an excellent pitch - and the material itself is great and \"ready to go.\" I'd be delighted to post your article as one of our blog entries! It's not time-sensitive so I will probably schedule it a couple of weeks out. Thanks very much for the submission. K-- Lastly, reply to your contact's acceptance e-mail After I got over my initial shock of actually being published for the first time on a major industry website, I sent a short thank you note to my contact, again keeping it positive, light, and professional. Doing this one last thing shows my contact that I am truly interested in developing an on-going, professional relationship with her and her website: Hi K-- That sounds excellent--thank you! Please let me know if you have any questions. And congratulations on your new position--I look forward to working with you! Summer I really hope this has helped you and I'd definitely appreciate any feedback, additional suggestions, and/or tips and tricks from my fellow Mozzers. Good luck with your pitches! This post has been brought to you by the letter S and the number 31. Summer's been marketing and SEOing it up at TruckChamp.com for a little over a year now. She enjoys being a part of the SEOmoz community and learns something new every day from her fellow Mozzers. Also, she likes ice cream and has an addiction to white chocolate mochas. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Link Bait Pitch Letter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Link Bait Pitch Letter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andras Kovach\n          \n            Andras Kovach"
}