{
  "url": "https://moz.com/blog/anatomy-of-a-super-digg",
  "slug": "anatomy-of-a-super-digg",
  "title": "Anatomy of a Super Digg - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, our SEO company Voltier Inc took on a local used car dealer in West Palm Beach, Florida, as a client. We were hired to bring customers to the dealership through referrals from the website. This is mainly done through leads generated on the website, and interest i...",
  "content": "Anatomy of a Super Digg Social Media By: Dan Tynski February 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Tynski February 21, 2007 Anatomy of a Super Digg Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently, our SEO company Voltier Inc took on a local used car dealer in West Palm Beach, Florida, as a client. We were hired to bring customers to the dealership through referrals from the website. This is mainly done through leads generated on the website and interest in various vehicles that are displayed on the website. In conjunction with doing various on page SEO, it has been my job to get this site indexed (as it had 0 pages indexed on all search engines when my work began). Things were progressing fairly steadily, but with only around a month of link building, I'd seen only modest results in Google and Yahoo. As many would expect, it was fairly easy to rank well in MSN for our top keywords. Our rankings for Yahoo and Google, however, for the following keywords (or some variation of), have not seen much progress: Used Car West Palm Beach, Used Car Dealer Palm Beach, Palm Beach Used Cars, florida used cars Now comes the interesting part. As Part of our Link Building efforts, I released a number of articles meant as Link Bait. I wrote an article about airbag fraud, about best SEO practices for car dealers, the most dangerous drivers on the road, and a few others. The brainstorming was slow going, but on a whim I came up with an idea I thought could possibly be popular on a site like Digg or Reddit. The bad part was that the article didn't really have anything to do with used cars.... The article. What I came up with was an article entitled \"8 Diseases That Give You Superhuman Powers.\" Essentially, it was just a compilation of 8 different Discovery Health specials, with YouTube videos and Wikipedia references. It took about about 10 minutes to write, and it was online about a half hour after the conception of the idea. I decided to post the article on Reddit first, because it seemed that articles there were less easily buried. What happened was astonishing. The Climb. In the first 45 minutes I saw a steady climb in votes from Reddit. The article remained at the top of the Science page in Reddit, and made it onto the front page of Reddit \"Hot\" within an hour. It continued climbing the Reddit Hot page (non-science category) until it had reached the number one position. When the article was first posted to Reddit, it included a \"Digg\" buttion, and was submitted to Digg. The Digg button was located at the top of the page, and even through the climb of the article via Reddit, there were only a few more diggs (around 8). After the article hit the front page of Reddit, however, I decided to place an additional Digg button at the bottom of the page, assuming people would decided to Digg the article only after they had read it through. At this point, the article started to receive massive amounts of Diggs. Within an hour of being on the front page of Reddit, the article went from 8 - 110 - 250 - 450 Diggs. The article rose through the ranks on Digg, and within 3 hours had made it to the front page, with over 800 Diggs. As the night progressed, it continued to rise on Digg, and became the number two story of the day, with over 2,000 Diggs. The story also entered the top ten on Digg, and by 11pm that night (8-9 hrs after submission to Reddit) it had reached the Number 1 position on Digg's top ten. As it stands today, the article is the 191st most Dugg submission in the past 365 Days. The Traffic. The following are my traffic results from the \"Super Digg.\" Keep in mind that these results are unadulterated insofar as the site was receiving under 100 unique visitors per day before the submission to Digg and Reddit, and are therefore not skewed. First 4 Days: Top Referring Sources: As you can see, being on the top of Digg and Reddit gets you some serious traffic, but not just from those two sources. Not only did our page make it to del.icio.us popular, but it made it to the front of some very high traffic sites, such as Ebaumsworld.com and Gorillamask.net. As you can see, within five days, we received a total of almost 234,000 unique visitors. As it stands now, we are continuing to see traffic from sites such as ebaumsworld, although the main link is far from the front page. Additionally, we received significant traffic referrals from webmail clients such as gmail and yahoo mail, meaning our links were most likely being shared over email as well. Alexa Rankings After The Digg: Another astonishing fact was how our website moved up the rankings on Alexa. We went from being ranked around 1,200,000 to ranking at 120,000 in just 5 days. This means our boost was nearly enough to put us on the Movers and Shakers list, and put us well above the rankings of some very well established websites. We are particularly interested to see how this ranking drops again to previous levels. The chart signifies how Alexa saw everything. How Adsense Treated Us: After being Dugg, our Adsense account was finally approved 36 hrs later, and some Adsense ads went on the front page. (We assumed we'd make no money but were very interested in conversion rates, as we'd heard conflicting reports about the clickthrough rates of Digg users. ) What we found was not too surprising, although there were a few unexpected things. First was that Adsense actually accounted for more impressions than analytics. Our analytics showed 100,199 page views, but Adsense told us that we'd had 102,029 ad impressions. Over the four days we used Adsense, we made a total of 71.87 cents. Our average click through rate was a dismal 0.24%, although the ads on our site seemed to be fairly highly targeted. *Funny Sidenote: there were relevant Amazon ads on the site as well. They received 200,000 impressions. We made $1.00. The Aftermath. Above all else, we are interested in how our \"Super Digg\" will affect our backlinks and our position in the SERPS. Our particular scenario can help shed some light on a few questions. First, what is the effect of a large number of backlinks that are not well targeted to your site's content? We already know that untargeted backlinks are not nearly as effective as targeted ones from authority sites with similar content. The Digg did, however, produce links from many sites with authority in areas that are not entirely unrelated, and in some cases, from some sites with very high traffic and trust. Secondly, how long does this effect last, and how long does it take for its effects to be seen? Below are the number of backlinks seen by Yahoo Site Explorer before and since the Digg. Backlinks: Before The Digg: 207 Backlinks 3 Days After Digg: 1,270 Backlinks 5 Days After Digg: 2,642 Backlinks 7 Days After Digg: 3,545 Backlinks Technorati: Before The Digg: 0 Links After: 138 Links Del.icio.us Before the Digg: 0 Links After the Digg: 532 Links Changes in the SERPS. Google's latest crawl (7 days after the Digg) resulted in a huge increase in our rankings for our targeted keywords. We jumped up anywhere from 20-300 places, with most of our most important keywords ranking in the top ten (many in the top 5). Furthermore, Google has increased its rate of indexing, has increased the number of our pages that appear in the index, and have released over a dozen important pages from the supplemental results. However, No Backlinks Have Registered In Google Webmaster Tools (7 days after digg) Yahoo, while giving us credit for our backlinks, has done almost nothing in terms of ranking us better in the SERPS. Additionally, the number of our pages in their index has actually decreased. More Interesting Factors to Note: 1.) The Page that was dugg was experimental, and was not linked to our main page in any way. There was no link from the dugg page to our main site and there was no link on our main site to this page. (This was partially due to the fact that we did not desire any digg traffic on our main site, as our site desires only highly targeted local traffic.) The only connection between our main site and the dugg page was that they reside on the same domain. 2.) The dugg page has absolutely none of the keywords we have attempted to rank for on our main site. It does not link to or discuss any topics or other pages that are related to the keywords or topics of our main site. 3.) The dugg page ranks very highly for a great number of the keywords it contains, but does not rank first for the words in its title. This article was written for the purpose of input. I am very interested in anyone's opinions, ideas, or predictions about these results. I will be updating this blog post with additional information as it becomes available so we can track the true long term effects of this type of event. Has anyone else tracked anything this large? Has anyone else had long term experience in this arena. I know Rand has tracked some data regarding backlinks after a digg, and the link bump effect, but what are others thinking? -Daniel Tynski Note from Rand - Daniel's site, Voltier, was taken down by an insane traffic load from Digg, Reddit, & others today (which is why the hosted images above aren't displaying). Given time, I have no doubt they'll recover - many congrats for putting together some great linkbait, and better luck holding together the server next time; it's certainly an issue we at SEOmoz can empathize with. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Super Digg"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Anatomy of a Super Digg"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Tynski\n          \n            Dan Tynski\n          \n            Dan Tynski"
}