{
  "url": "https://moz.com/blog/anchor-text-rich-links-without-spam-or-manipulation-whiteboard-friday",
  "slug": "anchor-text-rich-links-without-spam-or-manipulation-whiteboard-friday",
  "title": "How to Acquire Anchor Text-Rich Links Without Resorting to Spam or Manipulation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How can we earn links with exact match anchor text without raising red flags? In today's Whiteboard Friday, Rand explains a few ways that might work well for you and your organization.",
  "content": "How to Acquire Anchor Text-Rich Links Without Resorting to Spam or Manipulation Link Building | Whiteboard Friday By: Rand Fishkin October 10, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 10, 2014 How to Acquire Anchor Text-Rich Links Without Resorting to Spam or Manipulation Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. All signs point to links with exact match anchor text retaining the huge value we've seen throughout the years, but many of the techniques for acquiring those links are spammy. There are a few, though, that not even Google would frown upon, and in today's Whiteboard Friday, Rand shows you what they are. For reference, here's a still of this week's whiteboard! Video transcription Howdy Moz fans, and welcome to another edition of Whiteboard Friday. This week we're talking about anchor text rich links, which have long been valuable and important in the SEO world. I think there has been some sentiment and some suspicion over the last five years to a year that anchor text was losing some of its importance, that external links with anchor text exact match wasn't as powerful. Actually, that doesn't seem to be the case. We did a bunch of tests as part of the IMEC Lab group that I've been talking about recently. We tested things like pointing to page A and page B from a single page with one of the links being anchor text rich and the other not being anchor text rich. Every time we could see that the link that pointed to A was bumping A up to the first ranking position, even with just a handful of anchor text rich links from good sources. The frustrating part about that in SEO is to know anchor text rich links are very important, but they're also a huge signal for spam. In fact, most of the ways that you can influence links to be exactly the anchor text that you want are often pretty manipulative. I don't want to talk about those methodologies today. I'm trying to get to some of the ways we can build anchor text rich links without resorting to spam. One of the things to keep in mind here as you're going down the anchor text path, I know you're thinking like, \"Man, I can't get 90% of the links that I'm going to acquire to be any specific anchor text. If they're coming in editorially, I don't have control.\" That's actually a good thing. You don't really want to have that. You want most of the natural editorial links that do come in to be with anchor text that is out of your control entirely and simply comes from the publisher, the blogger, the journalist, the partner, whoever decided to link to you. The way I think about it is this. There is probably 90% of my links where I have no control whatsoever over the anchor text, and that's a good thing. Maybe there is 10% where I do have some control in some format over the anchor. That's what I'm worried about. That's what I'm going to think about today. I'm not trying to influence that 90%. I don't think you should either. In fact, I think a natural link profile only has a small subset of its links coming with anchor text rich keywords. There are some methodologies to do this. The first one is a strong psychological nudge that you own and control 100% of the time, and that is really branding and naming conventions. Calling your product, your brand, your series, your content a keyword phrase plus the brand name that you've got or the brand name plus a keyword phrase is truly highly effective. Let me show you what I'm talking about. Let's say that I'm Zen Magnets and I'm trying to rank for magnet toys. I could have a product line called Zen Magnet Toys. They're designed for kids. They're fun to use. I'm not sure that they actually do have one because I think it's for ages 14 and up. I could call it that. That would be the series. That's the brand name as it goes out to market, as it appears on Amazon, as whatever it does, wherever it is. However I'm promoting it through any form of media, it's always called Zen Magnet Toys. I've got the keyword rich title right in there along with the brand name. Moz is a good example. We have this tool Followerwonk that we acquired several years ago. We could in our branding call it Followerwonk Twitter Analytics, Followerwonk for Twitter Analytics, or Twitter Analytics via Followerwonk. Combining those names, using that naming convention over and over again, repeating it, making sure it's in every title and every promotional piece that we do. When you sign up for it, that's what the email says. When you write about, that's what we call it. That's what the Twitter account for it says. That's what the Facebook page about it says. Repeating that over and over again gets it in people's minds that it's not Followerwonk, it's Followerwonk Twitter Analytics. In fact, Followerwonk does do some other cool things besides just Twitter analytics, so we probably wouldn't do that, but it's a good example. Slim Armor, which is the phone case I got for my new Android phone, they could call it Slim Armor Protection, or they could call it Slim Armor Phone Cases. You have a choice with these naming conventions. I would say this is something where SEO folks, who realize and understand the market demand and how people talk about products, need to be involved with the branding and the product design and development folks, so that you make sure you're taking advantage of what people call your products before they go to market. Number two, interviews, bios, press -- not press releases but press publications that you might earn, boilerplates that appear whenever you're mentioned, and image credits, these are all super valuable too. Michelle Lowery was someone who was tweeting at me as I was filming this Whiteboard Friday, so I used her as an example without asking permission. Hopefully, she's okay with this. Michelle's Twitter bio says she's the co-founder of Passion Fruit Creative Group. I looked at their website. They offer a lot of copywriting services. They'll do blog authorship and content authorship and stuff. I decided somewhat whimsically I'd say makers of fine copywriting, and fine copywriting is the link. Maybe Passion Fruit Creative also points to their homepage, and the fine copywriting points to the page that has their copywriting services and talks about what they do and that kind of thing. This is totally legitimate. She can put this in her bio on her website, on her about page. Then anyone who comes from anywhere on the web, who's going to pick up that bio and place it on their site, anyone who says, hey, I need a professional bio because you're speaking at our event, because we interviewed you, because we're citing a case study from you, because we're using a quote from you in a press release, any of those things, they will use this boilerplate, and it will point back. She can do the same thing with images. If Michelle or Passion Fruit Creative happens to have a great selection of images, a great image library that people want to use, or other kinds of visual assets too, when they pick those up they say, \"Please cite Passion Fruit Creative, makers of fine copywriting, in your source material when you point to us.\" Great, now you've given an additional nudge. There are two things I'd advise with this. Number one, make sure you're changing this up regularly. I do this with my bio. I've been performing a bunch of fun experiments with my bio. I like to change it up at least every three to six months. Come up with something new, something different. Point to some different pages, that kind of thing, and see how it plays out. This is also very helpful for making sure that you don't have an anchor text profile that looks particularly manipulative even though it's earned editorially. Second, be really careful with this on two things -- press releases and guest posts. Those are places where you really own the influence, and it can look pretty spammy and manipulative to Google if you're putting a bunch of guest posts with a bunch of anchor text rich links in your bio or your boilerplate. I'd be a little more careful. I might not even put this link in there if I were her and I were guest posting. It depends on where. It's a fine line. The third and last one is to use copy and paste nudges, little psychological nudges in the tools, embeds, or even directly in your outreach. Maybe you don't have tools, or embeddable content, or a widget, a calculator, a graphic that someone is picking up, but you do have something. You do some outreach, and you say, \"Hey, we'd love to be mentioned in here, or if you're going to write about this, here's a link to our site.\" Rather than just the URL, you can put in a sentence, a phrase, a word or two, and you can make that a little more whimsical and creative, like \"makers of fine copywriting.\" When I link to my wife's blog, to Everywhereist.com, I often say \"serendipitous travel blog,\" just to give it a little bit of creativity. It doesn't need to be perfectly keyword matched. Three things on these nudges for embeds, calculators, outreach, any of these things, you've got to keep that text natural, authentic, and honest. It has to be real. It can't feel spammy and manipulative. Nudging with text in an email actually can be quite helpful. I've seen it work plenty of times. When I copy and paste stuff, especially for reporters, they often just use exactly what I send them. Don't try to control or modify this text remotely using some kind of JavaScript. I've seen this happen where people have an embed, and the JavaScript is in there. Then they're like, \"Oh, now I can modify the link to point here, and modify it to point there, and change the anchor text to this.\" That will get you in big trouble. Google hates that stuff, and they came down very hard on it several years ago with badges, widgets, and embeds. You know anchor text is powerful. With a small percent of your links, 10% or less, I would try and nudge and acquire those links that have anchor text rich keyword text. It's good for users because it's descriptive about what your page is about. It's also good for search engines because they can find and rank the right stuff. Just be careful not to step over this line and you'll be fine. All right, everyone. Thanks so much. Take care. We'll see you again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Acquire Anchor Text-Rich Links Without Resorting to Spam or Manipulation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Acquire Anchor Text-Rich Links Without Resorting to Spam or Manipulation"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}