{
  "url": "https://moz.com/blog/and-then-there-were-six",
  "slug": "and-then-there-were-six",
  "title": "And Then There Were Six... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOmoz and Kat Ortland, who's been with us nearly a year, are parting ways today - Kat's off to pursue bigger and bolder ventures in the world of journalism and we wish her well. Her work with us, particularly on the Web2.0 Awards project helped to make her a star and we're looking forward to…",
  "content": "And Then There Were Six... Moz News By: Rand Fishkin August 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 16, 2006 And Then There Were Six... Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEOmoz and Kat Ortland, who's been with us nearly a year, are parting ways today - Kat's off to pursue bigger and bolder ventures in the world of journalism and we wish her well. Her work with us, particularly on the Web2.0 Awards project helped to make her a star and we're looking forward to seeing great things from her career in the future. Kat & Bill (Slawski) Show their Love of Citrus at SES San Jose What does this mean for SEOmoz? Well, it firstly spells a bigger workload for Rebecca (and the rest of us, too). We also might be hiring in the next few months, so keep an eye out! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "And Then There Were Six..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "And Then There Were Six..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}