{
  "url": "https://moz.com/blog/announcing-the-mozcon-2014-community-speakers",
  "slug": "announcing-the-mozcon-2014-community-speakers",
  "title": "Announcing the MozCon 2014 Community Speakers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Get ready; we've chosen the top four submissions from a pool of 146: Announcing the 2014 MozCon community speakers!",
  "content": "Announcing the MozCon 2014 Community Speakers SEO Events By: Erica McGillivray May 15, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray May 15, 2014 Announcing the MozCon 2014 Community Speakers SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Get ready to give some high fives, because I have some great news to share today: The four community speakers for MozCon 2014, July 14-16th in Seattle! First, I want to thank everyone who tossed in their hat. It's an incredibly brave thing to do, so pat yourselves on the back. We had 146 submissions this year—about 10 more than last year—during the week and a half that they were open. There were tons of amazing ideas, incredibly thoughtful sharing, and all around excitement. The selection committee all agreed that 2014's pitches were the best yet. Though, of course, that makes the decision the hardest one.Our four Community Speakers for 2014 In the order that they'll be presenting at MozCon: Mark Traphagen Google+ Game of Thrones: Claiming Your Kingdom for Brand Dominance Be the ruler of your vertical by claiming uncharted ground in Google+ to dragon-power your brand's Google influence. Mark Traphagen is Senior Director of Online Marketing for Stone Temple Consulting and a sought-after speaker and writer on Google+ marketing and Google Authorship. He runs the largest Google Authorship community on the web, and offline, he competes in story slams, but never, ever slams a good story. Stephanie Beadell Bad Data, Bad Decisions: The Art of Asking Better Questions Stephanie Beadell will discuss the power of surveys and how if you're not asking the right questions, you risk making decisions on the wrong answers. Stephanie Beadell is Director of Content Marketing at BuzzStream and was formerly head of Digital PR at SEER Interactive. She holds a Master of Science degree in Market Research from Boston University. Zeph Snapp More than Words: Localizing Your International Content Zeph takes you beyond the technical implications of international SEO, showing you real life examples of how to leverage your existing content in other languages. Zeph Snapp is the CEO of Altura Interactive. Justin Briggs Talking Back to Conversational Search Looking at how conversational search and the knowledge graph are changing how users search and engage with content, Justin will talk about implementing entities at an enterprise scale. Justin Briggs is the Sr. Manager of Organic Marketing at Getty Images, a leading stock photography company based in Seattle. Justin has over 10 years of web experience, including seven years working in SEO and social media.Honorable mentions go out to both Gianluca Fiorelli and Greg Gifford. Get ready to cheer these four on, and make sure that you've bought your ticket to MozCon 2014, as they're going quickly and will sell out. I get asked quite a bit about how the community speaker selection committee process works, so I thought I'd shed some light on it for those who are curious. This year, there were a total of nine committee members. That's a lot of people vetting your submissions. And you may notice that it's the same number as a more famous fellowship: You can make your guesses as to who correlates to whom on Moz's staff. The committee for MozCon 2014 consisted of: Cyrus Shepard, Senior Manager, Content Team Danielle Launders, Marketing Assistant Erica McGillivray, Senior Community Manager (that's me!) Jen Lopez, Director of Community Keri Morgret, Community Manager Matthew Brown, Senior VP - Special Projects Megan Singley, Social Community Manager Rand Fishkin, Founder Trevor Klein, Content Strategist I'm typically the one that does a first sweep through all the entires. I try to do a \"blind\" sweep through them to stay as unbiased as possible by not looking at names and emails, only reading the content pitch itself. We use a grade scale, A through F, and make notes on entries. (Sorry, person who submitted pretending to be Matt Cutts, you received the F. We did get a laugh, though.) From there, Cyrus, Danie, Jen, Keri, Megan, and Trevor jump in and they add their own grades and notes. Yes, sometimes we disagree! But most of the time, we're all pretty close in what we think. One hopeful sent his pitch in letter format with a koala bear. Someone's following my Pinterest account. After that, it gets easier to narrow it down to 20 or so pitches. Both Trevor and I also make special notes on ones that we might want to grab for blog posts or Mozinars if they aren't selected as speakers. When down to 20 or so, Rand and Matthew join in and give their thoughts on the top ones. We also start more extensively reviewing to see what kinds of presentations people have given in the past, if there are slide decks or video of them on stage, and what sort of other content they're putting out there, like blog posts. Once it gets down to less than 10, the choice gets harder. Typically there are one or two people that everyone is completely on board with. Then we discuss more about what we've seen from the rest and how the topic would fit into what's already being offered at MozCon. Usually, there aren't any \"cons\" to these fabulous folks, just lots of \"pros.\" I reach out to the selected four first, to let them know and confirm that they're still interested and able to attend MozCon. Then I have the somewhat sad job of telling the rest of the potentials that they weren't selected. But it's very important to inform everyone so no one is left wondering whatever happened to that time they pitched. (I know how frustrating never hearing back can be from the other side of a pitch.) Then I write this post.Hope that added some transparency to our process! A big thank you to all of you who submitted this year and congratulations to our four speakers for MozCon 2014! We can't wait to see you all there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing the MozCon 2014 Community Speakers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing the MozCon 2014 Community Speakers"
    },
    {
      "level": "H2",
      "text": "Our four Community Speakers for 2014"
    },
    {
      "level": "H3",
      "text": "Mark Traphagen"
    },
    {
      "level": "H3",
      "text": "Stephanie Beadell"
    },
    {
      "level": "H3",
      "text": "Zeph Snapp"
    },
    {
      "level": "H3",
      "text": "Justin Briggs"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}