{
  "url": "https://moz.com/blog/announcing-fresh-web-explorer",
  "slug": "announcing-fresh-web-explorer",
  "title": "Announcing Fresh Web Explorer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Announcing Fresh Web Explorer, a tool that gives SEOmoz PRO subscribers the ability to track the latest mentions and links for their brand or site.",
  "content": "Announcing Fresh Web Explorer Moz Tools By: Matthew Brown March 6, 2013 Table of Contents Copied! By: Matthew Brown March 6, 2013 Announcing Fresh Web Explorer Moz Tools Note: Fresh Web Explorer was retired on November 10, 2020. Instead, take advantage of other Moz Pro features — like Link Opportunities, Keyword Explorer Mentions, and Custom Reports – to help you accomplish similar use cases. Read more here. Have you ever wished you had an easy way to track all of your links, social mentions, and web citations in one place? If so, you're going to like the latest addition to your SEOmoz PRO account. Today, we are releasing a new beta product to our PRO subscribers: Fresh Web Explorer. Try Fresh Web Explorer Why did we build Fresh Web Explorer? One of the most challenging tasks as an online marketer is keeping track of all the latest blogs, forums, and news sites on the web that mention your brand or site. Many of the tools out there can be frustrating to use and don't have the metrics, scalability, or features that I need to effectively keep track of important links and mentions. Google Alerts can be hit or miss. Topsy is terrific, but it only covers social mentions. Trackur, Ubervu, Buzzstream, and SocialMention all offer a unique set of features, but I frequently rely on a number of different tools to provide me with an instant look into mentions of the sites and brands I track. We built Fresh Web Explorer to provide an easier way to give you a fast, comprehensive look at the latest mentions of and links to your content across the web. What's different about Fresh Web Explorer? Fresh Web Explorer (FWE) functions a lot like Open Site Explorer, so the interface will be familiar to OSE users. However, the data is extremely recent, and rather than just show you links, we grab full text content of articles, blog posts, forum threads, user comments, and other web content. FWE doesn't just show you links, but all term, brand, or phrase mentions as well. FWE is powered by our Freshscape Index, which is a 30 day index of 4.3 million feeds (and counting). There's a new Freshscape index every eight hours, sortable by one week, two weeks, or 30 days of mentions. You can also sort your data by Feed Authority, our new metric created specifically for Fresh Web Explorer: Feed Authority directly measures the importance of any feed on a scale of 1-100. It is a machine learning model that predicts the number of subscribers for a given feed and distinguishes among the many different feeds on any site. For example, it wil assign a lower score to a comment feed associated with a six-month-old blog post than the main feed associated with the blog. In this way, it is analogous to Page Authority, but applied to feeds. We currently use features extracted from crawling the feed (number of posts, post frequency, etc.) as well as Mozscape metrics to compute the score. Our data scientists are working to improve this metric, so expect to see some of the scores change as they refine the algorithm and introduce additional features. Warning: We're going to get even more nerdy about Feed Authority for a quick second. The chart below shows the distribution of Feed Authority across the Freshscape index: Approximately 25% of the index has a Feed Authority less than 2.0, with the other 75% having higher values. The feeds with low scores are mostly stale (no longer updated), have very few or no links, or have malformed XML. A similar graph for all feeds on the internet would have the opposite shape, with 75%+ of feeds having Feed Authority less than 2.0 (we confirmed this with a random sample of feeds from our Mozscape index). We minimized the number of low-quality feeds in our index by carefully building it from a set of high-quality blog directories and a curated list of feeds. Smooth Operator Bringing it back to using FWE, there are a number of operators you can use to customize your search: In particular, you may find yourself making extensive use of the 'Match phrase exactly' operator, by using double quotes around your search term or phrase. This cues Fresh Web Explorer to only return results where your phrase of terms appears on a page exactly as you searched for them in FWE, rather than returning results where the terms may appear anywhere on the page and in any order. When searching on non-branded or very popular terms, using this operator may surface a more precise set of results from FWE. Export FWE data to customize your reports If you're inclined to mix and match this data with other sources, FWE provides you with the ability to export up to 10,000 mentions in the Freshscape index, in .csv format: This export allows you to sort a large number of mentions by date found, Feed Authority, domain, HTML title, and URL. One of the additional fields available in the export that's not in the FWE web interface: the feed source where FWE found the page containing the mention. This can provide useful insight into why a Feed Authority score might be low, even though the page mentioning your search is located on a strong domain. We've put together a video walkthrough and a detailed FAQ to get you started as well as answer additional questions. Getting agile with FWE Fresh link and mention data have become critically important to online marketers. If you're engaged in link building and outreach, having the ability to quickly sort recent mentions by source and date can make a world of difference in quick outreach to build audience for your content or brand. If you're in the SEO trenches, you're probably all too familiar with how freshness plays a role in Google and Bing search results. If you've watched the meteoric rise of sites like Buzzfeed, Business Insider, or Huffington Post, the formula to their success is pretty clear: Match content to the most recent user intent you can surface, then build links and social mentions to that content like crazy. To get started, you can use FWE to engage in several high-ROI activities: Find recent mentions in FWE where you aren't being linked to - On news publications and high-volume blogs, the quicker you ask the writer for a link, the better chance you have of actually getting it. It's much harder to convince them it's worth the effort a month later. An effective technique that increases your chances even more is to add something new to the content that increases its value or changes the narrative of the story. Competitor analysis - Where are your competitors being mentioned? Are there feeds that highlight their content frequently? FWE is a good tool to build up your outreach list. Content Strategy - FWE allows you to check on or keep track of a set of terms over time, and helps you get a sense for what type of content gets a lot of mentions, shares, and links. For instance, a term like \"World Cup 2014\" is already drawing significant interest as we get closer to the 2014 event in Brazil. Sites like Bleacher Report and Goal are already starting to stake out their claim in the SERPs. FWE can help you make strategic decisions on how to create and focus both new and legacy content on this type of quickly evolving user search intent. Our engineers have put in a lot of work to make the Freshscape index, and we will be using it to power additional features in the near future. Ready to give it a spin? Try Fresh Web Explorer Just like you, we're just getting started with Fresh Web Explorer as a new tool in our marketing workflow. It's a beta release, so we're making improvements and squashing bugs quickly. You can flag suspicious results within the application, and we will use that feedback to make adjustments to the index. Please send us over any questions or comments you have, and be sure to check out the Help video and FAQ. We can't wait to hear how you're using it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing Fresh Web Explorer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing Fresh Web Explorer"
    },
    {
      "level": "H3",
      "text": "Why did we build Fresh Web Explorer?"
    },
    {
      "level": "H3",
      "text": "What's different about Fresh Web Explorer?"
    },
    {
      "level": "H3",
      "text": "Smooth Operator"
    },
    {
      "level": "H3",
      "text": "Export FWE data to customize your reports"
    },
    {
      "level": "H3",
      "text": "Getting agile with FWE"
    },
    {
      "level": "H3",
      "text": "Ready to give it a spin?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Brown\n          \n            Matthew Brown"
}