{
  "url": "https://moz.com/blog/announcing-localup-advanced",
  "slug": "announcing-localup-advanced",
  "title": "Announcing LocalUp Advanced: Our New Local SEO Conference (and Early Bird Tickets!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Moz and Local U are excited to present LocalUp Advanced, an all-day intensive local SEO conference, on Saturday, February 7, 2015 in Seattle. Join us and get your early bird ticket today!",
  "content": "Announcing LocalUp Advanced: Our New Local SEO Conference (and Early Bird Tickets!) Local SEO | SEO Events By: Erica McGillivray October 23, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray October 23, 2014 Announcing LocalUp Advanced: Our New Local SEO Conference (and Early Bird Tickets!) Local SEO | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Hoping to attend a future Moz Conference? We'd love to see you! That's right, Moz fans, we're diving into the the Local SEO conference space. Join us Saturday, February 7th in Seattle as we team up with Local U to present LocalUp Advanced, an all-day intensive local SEO conference. You'll learn next-level tactics for everything from getting reviews and content creation to mobile optimization and local ranking factors. You'll also have opportunities to attend workshops and meet other people who love local SEO just as much as you. Don't miss the early bird deal! The first 25 tickets receive $200 off registration. Early bird is sold out! Moz or Local U Subscribers: $699 ($499 early-bird) General Admission: $999 ($799 early-bird) Also, to get the best pricing, take a 30-day free trial of Moz Pro or sign up for Local U's forum. Who's speaking at LocalUp Advanced? Aaron Weiche Spyder Trap Aaron Weiche is a digital marketing geek focused on web design, mobile, and search marketing. Aaron is the COO of Spyder Trap in Minneapolis, Local U faculty member, founding board member of MnSearch, and a Local Search Ranking Factors Contributor since 2010. Cindy Krum MobileMoxie LLC. Cindy Krum is the CEO and Founder of MobileMoxie, LLC, a mobile marketing consultancy and host of the most cutting-edge online mobile marketing toolset available today. Cindy is the author of Mobile Marketing: Finding Your Customers No Matter Where They Are, published by Que Publishing. Dana DiTomaso Kick Point Whether at a conference, on the radio, or in a meeting, Dana DiTomaso likes to impart wisdom to help you turn a lot of marketing BS into real strategies to grow your business. After 10+ years and with a focus on local SMBs, she's seen (almost) everything. In her spare time, Dana drinks tea and yells at the Hamilton Tiger-Cats. Darren Shaw Whitespark Darren Shaw is the President and Founder of Whitespark, a company that builds software and provides services to help businesses with local search. He's widely regarded in the local SEO community as an innovator, one whose years of experience working with massive local data sets have given him uncommon insights into the inner workings of the world of citation-building and local search marketing. Darren has been working on the web for over 16 years and loves everything about local SEO. David Mihm Moz David Mihm is one of the world’s leading practitioners of local search engine marketing. He has created and promoted search-friendly websites for clients of all sizes since the early 2000s. David co-founded GetListed.org, which he sold to Moz in November 2012. Since then, he's served as our Director of Local Search Marketing, imparting his wisdom everywhere! Ed Reese Sixth Man Marketing Ed Reese leads a talented analytics and usability team at his firm Sixth Man Marketing, is a co-founder of Local U, and an adjunct professor of digital marketing at Gonzaga University. In his free time, he optimizes his foosball and disc golf technique and spends time with his wife and two boys. Jade Wang Google If you've gone to the Google and Your Business Forum for help (and, of course, you have!), then you know how quickly an answer from Google staffer Jade Wang can clear up even the toughest problems. She has been helping business owners get their information listed on Google since joining the team in 2012. Mary Bowling Local U Mary Bowling's been specializing in SEO and local search since 2003. She works as a consultant at Optimized!, is a partner at a small agency called Ignitor Digital, is a partner in Local U, and is also a trainer and writer for Search Engine News. Mary spends her days interacting directly with local business owners and understands holistic local needs. Mike Blumenthal Local U If you're in Local, then you know Mike Blumenthal, and here is your chance to learn from this pioneer in local SEO, whose years of industry research and documentation have earned him the fond and respectful nickname 'Professor Maps.' Mike's blog has been the go-to spot for local SEOs since the early days of Google Maps. It's safe to say that there are few people on the planet who know more about this area of marketing than Mike. He's also the co-founder of GetFiveStars, an innovative review and testimonial software. Additionally, Mike loves biking, x-country skiing, and home cooking. Mike Ramsey Nifty Marketing Mike Ramsey is the president of Nifty Marketing with offices in Burley and Boise, Idaho. He is also a Partner at Local U and many other ventures. Mike has an awesome wife and three kids who put up with all his talk about search. Dr. Pete Meyers Moz Dr. Pete Meyers is the Marketing Scientist for Moz, where he works with the marketing and data science teams on product research and data-driven content. He's spent the past two years building research tools to monitor Google, including the MozCast project, and he curates the Google Algorithm History. Rand Fishkin Moz Rand Fishkin is the founder of Moz. Traveler, blogger, social media addict, feminist, and husband. Will Scott Search Influence Helping small businesses succeed online since 1994, Will Scott has led teams responsible for thousands of websites, hundreds of thousands of pages in online directories, and millions of visits from search. Today, Will leads nearly 100 professionals at Search Influence putting results first and helping customers successfully market online. Why should I attend LocalUp Advanced? Do you have an interest in or do you delve into local SEO in your work? If so, then yes, you should definitely join us on February 7th. We believe LocalUp Advanced will be extremely valuable for marketers who are: In-house and spending 25% or more of their time on local SEO Agencies or consultants serving brick-and-mortar businesses Yellow Pages publishers In addition to keynote-style talks, we'll have intensive Q&A sessions with our speakers and workshops for you to get direct, one-to-one advice for your business. And as with all Moz events, there will be breakfast, lunch, two snacks, and an after party (details coming soon!) included in your ticket cost. Plus, LocalUp Advanced will take place at the MozPlex in the heart of downtown Seattle; you'll get to check out Roger's home! See you in February! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing LocalUp Advanced: Our New Local SEO Conference (and Early Bird Tickets!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing LocalUp Advanced: Our New Local SEO Conference (and Early Bird Tickets!)"
    },
    {
      "level": "H2",
      "text": "Who's speaking at LocalUp Advanced?"
    },
    {
      "level": "H3",
      "text": "Aaron Weiche"
    },
    {
      "level": "H3",
      "text": "Cindy Krum"
    },
    {
      "level": "H3",
      "text": "Dana DiTomaso"
    },
    {
      "level": "H3",
      "text": "Darren Shaw"
    },
    {
      "level": "H3",
      "text": "David Mihm"
    },
    {
      "level": "H3",
      "text": "Ed Reese"
    },
    {
      "level": "H3",
      "text": "Jade Wang"
    },
    {
      "level": "H3",
      "text": "Mary Bowling"
    },
    {
      "level": "H3",
      "text": "Mike Blumenthal"
    },
    {
      "level": "H3",
      "text": "Mike Ramsey"
    },
    {
      "level": "H3",
      "text": "Dr. Pete Meyers"
    },
    {
      "level": "H3",
      "text": "Rand Fishkin"
    },
    {
      "level": "H3",
      "text": "Will Scott"
    },
    {
      "level": "H2",
      "text": "Why should I attend LocalUp Advanced?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}