{
  "url": "https://moz.com/blog/announcing-state-of-local-seo-industry-report-2020",
  "slug": "announcing-state-of-local-seo-industry-report-2020",
  "title": "The State of Local SEO Industry Report 2020, Announced - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Moz’s very warmest thanks to the 1,453 respondents who volunteered time to contribute to this second installation of our industry survey. It’s rewarding to have such a large survey group; as this report details in high relief, the work of marketing a single business location can pass through a…",
  "content": "The State of Local SEO Industry Report 2020, Announced Local SEO | SEO Reporting By: Miriam Ellis June 17, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 17, 2020 The State of Local SEO Industry Report 2020, Announced Local SEO | SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Moz’s very warmest thanks to the 1,453 respondents who volunteered time to contribute to this second installation of our industry survey. It’s rewarding to have such a large survey group; as this report details in high relief, the work of marketing a single business location can pass through a dozen hands. Owners, staff, in-house SEOs, agencies, creative directors, webmasters, project managers, and consultants may all be contributing to promoting just one local company. By capturing their hands-on experience, we get the big picture of local SEO as an effort not confined to experts, but rather, requiring all hands on deck. In this report, you’ll find insights to share with coworkers and clients on: Company infrastructureLocal ranking factorsTool & software usageGaps in the marketplaceHigh ROI strategies and tactics Get the full report! A window in time on local business marketing The data in our survey depicts the local SEO industry both before and during the public health emergency. As such, it’s an eagle’s eye view of both the status of marketing priorities up to the present and a gauge of preparedness for change. Change has always been the only constant in local SEO — our industry is accustomed to an environment that can turn on a dime, literally overnight. This challenging setting toughens businesses for tough times. No one knows yet how COVID-19 may ultimately alter consumer behavior, but in the short term, one good sign which has emerged from the State of the Local SEO industry report is that local businesses were strongly embracing organic assets prior to the pandemic. Not long ago, you might have encountered narratives about websites being “dead” due to the dominance of local packs, zero click SERPs, and other Google features. Fortunately, our report indicates that many marketers have wisely ignored such schools of thought and have continued to promote the vital role local business websites play in connecting with communities. For now, if connection is curbside or delivery instead of foot traffic, local businesses which have been thoughtfully maintaining their websites own a strong platform for next moves — perhaps implementing local e-commerce, or taking orders via form submissions, or hosting gated video consultations. Access to the State of the Local SEO Industry’s data will enable you to do your own analysis of the sum total of marketing knowledge up to the present with an eye to future strategy. Here’s a preview of 3 emergent narratives that particularly caught my eye. Proximity falls to third as a local ranking factor Our 2019 report cited user-to-business proximity as the dominant influence on Google’s local pack rankings. So has every Local Search Ranking Factors survey since 2017. This is a surprising departure. Download the report for further analysis and view the numbers in the light of how Google might adjust proximity based on new factors like curbside pickup and local delivery. YOY, 19% more respondents are involved with offline marketing 94% (up from 75%) of our survey group are consulting with clients at least some of the time on topics like real-world customer service and consumer policies.This statistic professionally delights me, because of my years of advocacy here on the Moz blog for local search marketers to care deeply about what happens in real time between consumers and brands. Some enterprising agency should consider doing a webinar or eBook on the history of brick-and-mortar marketing so our industry can engage in deeper levels of learning and make informed decisions about future offline marketing strategy. COVID-era customer fulfillment strategies are here to stay 51% of respondents intend to permanently offer amenities like home delivery, curbside pickup, and video conferencing. Now is the time for innovative marketing agencies to put in the work researching the best possible solutions for clients for the long haul. Will it be in-house delivery fleets, or outsourcing to third parties like Instacart and Doordash? Which e-commerce platform is the best, not just for UX but for SEO? Many brands swiftly cobbled together new services to meet the state of emergency, but as time goes by, consumer feedback and marketing analysis will point the way to thoughtfully choosing the best transactional methodologies and platforms. All of these technologies predate the pandemic, but the year ahead is going to see them much more fully tested. Please accept our invitation to download the free State of the Local SEO Industry Report 2020, with 30+ timely questions on topics that impact how you work, what to offer, and how to improve your strategy for the year ahead whether you own a local business or are in the business of marketing local brands! Get the full report! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The State of Local SEO Industry Report 2020, Announced"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The State of Local SEO Industry Report 2020, Announced"
    },
    {
      "level": "H2",
      "text": "A window in time on local business marketing"
    },
    {
      "level": "H3",
      "text": "Proximity falls to third as a local ranking factor"
    },
    {
      "level": "H3",
      "text": "COVID-era customer fulfillment strategies are here to stay"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}