{
  "url": "https://moz.com/blog/announcing-serp-features-beyond-10-blue-links",
  "slug": "announcing-serp-features-beyond-10-blue-links",
  "title": "NEW: Rank Beyond 10 Blue Links with SERP Feature Tracking in Moz Pro - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Moz Pro now supports rich SERP feature tracking for 16 features (available immediately to all customers). Track SERP features over time across your campaign, by keyword, and get insights for where to target your efforts.",
  "content": "NEW: Rank Beyond 10 Blue Links with SERP Feature Tracking in Moz Pro Advanced SEO | Moz Tools By: Dr. Peter J. Meyers August 24, 2016 Table of Contents Copied! By: Dr. Peter J. Meyers August 24, 2016 NEW: Rank Beyond 10 Blue Links with SERP Feature Tracking in Moz Pro Advanced SEO | Moz Tools From Featured Snippets to In-depth Articles to Knowledge Panels, Google SERP features have remade the search marketing landscape. After three years of planning and many months of work, I'm thrilled to announce the launch of advanced SERP feature tracking in Moz Pro, available immediately to all customers! Using the most comprehensive data set on the market, Moz Pro now provides advanced analysis of the 16 features listed below: Try it now under the [Rankings] tab within any campaign (see screenshot below), or read on for a walk-through of the new features. New to Moz Pro? Take a free 30-day trial! Stage 1: AwarenessAt MozCon 2013, I gave a talk called Beyond 10 Blue Links, documenting the diversity of Google features surrounding organic results. Many of us at Moz felt strongly that the world of SERP features could have a profound impact on search marketers, and so we started to catalog Google's changes and collect the data to find out just how much SERPs were evolving. In early 2014, we built a prototype to better understand how we could help customers track SERP features, but we discovered that most of our customers were unfamiliar with them. None of us knew, at the time, exactly what impact SERP features were having or how we should adjust our tactics. The idea of tracking possibly dozens of types of results was daunting, especially in an industry where most of us already wore too many hats. So, we kept tracking the data, and we learned along with the industry. We also, I hope, contributed to that education. We built the infrastructure we knew we'd need down the road (much credit to our Silo team), even if we weren't sure when the turn in that road would come. Eventually – and in large part due to the growth of Featured Snippets – we knew that our customers were ready. Stage 2: AcceptanceAs of August, 86% of the SERPs in our 10,000-keyword tracking set had some kind of non-organic feature (a Knowledge Panel, a Featured Snippet, Rich Snippets, a Local Pack, etc.). If you count ads and shopping results, that number goes up to 97% – the days of 10 blue links are long gone. We recently did an analysis of over 400,000 search result interactions (thanks to Russ Jones) and found that SERPs with rich features send 28% fewer clicks to traditional organic results. At the same time, many of these features, including Featured Snippets, create new opportunities for non-traditional clicks. Either way, the impact on your SEO is very real, and it's essential to understand what you're up against. The challenge in tracking SERP features, as an SEO, is that which features matter to you can vary wildly with your niche. I've seen a single feature radically impact traffic for some sites, while that same feature may have little or no impact on others. Once you've accepted the reality of SERP features, you have to understand how the landscape looks for your own industries and sites: One of the first things you'll see on the new SERP Features page is the overview. This graph shows the presence of features across your campaign, as well as the proportion of features that you're listed in (where applicable). At launch, we support the 16 highest-impact desktop SERP features. Click on the pull-down above the graph, and you can pull up a Trended Analysis for any feature. Good news: we've already got a 60-day history available at launch: It's time to accept that SERP features really do exist, and dive into the details. Scrolling down, you'll see a comprehensive list of your Campaign keywords along with your current ranking, plus the features those keywords displayed the last time we checked them: The keyword list shows all of your campaign keywords, along with their rankings and a list of icons signaling which features appeared on those SERPs. Blue icons indicate that your site appears in the feature, red icons indicate your competitor is in it, and orange icons mean that you're both listed (this might occur in multi-listing features, such as News Packs). At the top of the page, you can narrow your list by keyword, label, location, or feature. Let's say you just wanted to see keywords with Featured Snippets. Next to the funnel icon at the top, click [+], then select \"SERP Feature\" and choose one from the list: The overview graph and keyword list are both filtered now, and you can explore whatever features are most applicable to your work. Stage 3: OpportunitySo, what do you do with this knowledge? We've developed an insights system to help you answer that question. For example, if a keyword in your campaign currently displays a Featured Snippet, and you rank in the top 5 organic results, you've got a decent shot at being able to compete for that snippet. So, we call that out: Click on any keyword with \"Insights\" to see possible opportunities. At launch, we highlight keywords with Featured Snippets, News Packs, Reviews, Videos, and Site Links (if you're not currently listed in them). We hope to add more insights in the near future. Bonus: Questions in KWEWant to put this to the test today? Here's a way to easily start tracking Featured Snippet opportunities. Go to Keyword Explorer, enter a term, view all results, and then, in the first pulldown select [are questions]. You'll get a list of question suggestions related to your chosen search term: Now, select the questions that interest you, and add them to your Campaign. We'll start tracking Featured Snippets and other SERP features, and soon you'll be discovering new opportunities to stand out from your competition. Thanks to everyone involved on the Product and Design teams, and special thanks to our Silo team for putting the pieces in place over the past year to make tracking features possible. Please reach out to us with any comments or suggestions, and we hope you enjoy the new features! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "NEW: Rank Beyond 10 Blue Links with SERP Feature Tracking in Moz Pro"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "NEW: Rank Beyond 10 Blue Links with SERP Feature Tracking in Moz Pro"
    },
    {
      "level": "H2",
      "text": "Stage 1: Awareness"
    },
    {
      "level": "H2",
      "text": "Stage 2: Acceptance"
    },
    {
      "level": "H2",
      "text": "Stage 3: Opportunity"
    },
    {
      "level": "H2",
      "text": "Bonus: Questions in KWE"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}