{
  "url": "https://moz.com/blog/announcing-our-acquisition-of-getlisted-plans-to-help-local-marketers-seos",
  "slug": "announcing-our-acquisition-of-getlisted-plans-to-help-local-marketers-seos",
  "title": "Announcing Our Acquisition of GetListed & Plans to Help Local Marketers & SEOs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It has been a tremendously exciting year here at SEOmoz. Today, we're excited to announce that we've taken a big step toward the future of Moz with the acquisition of GetListed, and the addition of David Mihm to the SEOmoz team!",
  "content": "Announcing Our Acquisition of GetListed & Plans to Help Local Marketers & SEOs Moz News By: Rand Fishkin December 4, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 4, 2012 Announcing Our Acquisition of GetListed & Plans to Help Local Marketers & SEOs Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ladies and Gentlemen, it has been a tremendously exciting year here at SEOmoz. While our burgeoning engineering team is toiling away on some amazing new stuff, we've been busy plotting the future of Moz. Today, I'm excited to announce we've taken one big step toward that goal with the acquisition of GetListed, and the addition of David Mihm to the SEOmoz team. (David and I celebrate at the Mozplex, while our data PM, Tela, photobombs) David and I have known each other a long time - since 2005! - and we've long been passionate about the same big problem - that web marketing, particular on inbound channels, is far too inaccessible and poorly understood by small, local businesses. As Moz has expanded our mission, we've been in talks with David since 2011 about combining forces to take on this challenge. As part of the acquisition, we're releasing the following reverse ransom note to the Internet on behalf of small businesses: The letters are made up of signs from local businesses in Portland and Seattle, our respective home towns, and we had a lot of fun putting them together (special thanks to Derric Wise from Moz, who helped make this happen). You can see the official press release here, and a larger version of the ransom note here. While I can't be 100% transparent about all our plans for the future of GetListed and our entry into the local space (partially because we haven't cemented it all quite yet), I do want to provide as much detail as possible: David has officially joined the SEOmoz team, while his co-founder Chris Tanger will be contracting and assisting with the transition to the next version of the product. They will both be staying in their respective home towns of Portland, OR and Chicago, IL. The current GetListed.org website and product functionality will remain completely free as it is today for at least the next 4-6 months. In Q2 of 2013, we hope to release a new version of the product focused on helping local, small business owners and the consultants/marketers who frequently work with them to better appear in and optimize their online presence on major search engines and local portals. Our long term goal is to provide software on the web and possibly in a mobile app that helps owners and marketers get a simple, but detailed overview of how they're performing in the local search ecosystem, what actions they should take to help their marketing, and how they compare against their competition. These goals may expand and will certainly get more fleshed out as we take products through user testing and release. David's personal site is remaining personal, though we encourage everyone interested in local inbound marketing to check out the excellent resources there - the Local Search Ranking Factors and David's blog on Local SEO. Local U is remaining a separate entity, though we hope to be able to support and sponsor some of their excellent events going forward, and David plans to keep speaking/participating in some of these. The acquisition technically wrapped up a couple weeks back, and the total price was in the ~$3million range including cash and SEOmoz stock. Moving forward, we've got a lot of work to do, including hiring some new team members to help support our growth into Local and David's ambitious and admirable plans. We also might be looking to open a new office in Portland, where Galen & Peter from Followerwonk are also based, (I like the idea to call it \"Mozlandia\") in 2013, so be on the lookout! If you haven't already, I'd urge you to join the more than 2 million local businesses that have used GetListed to help understand and optimize their presence online: A huge congratulations and a ton of gratitude to David and Chris - you guys have built something remarkable. Finally, a big thanks to all the local businesses, whose signage we used in our ransom note: Ace Hotel, Beast, Beecher's Handmade Cheese, Bishop's Barber Shops, Brave Horse Tavern, Bunk Sandwiches, Caffé D'arte, Caffé Vita Coffee Roasting Co., Caffe Ladro, Cherry Street Coffee, Courier Coffee Roasters, Delicatus, Deschutes Brewery, Dick’s Drive-In, Elephant Car Wash, Espresso Vivace, Evo, Fran’s Chocolates, Grand Central Bakery, Homegrown, Julia's, Kell's Pub, Kenny & Zuke's, Lola's, McMenamins, Mississippi Studios, Molly Moon's Ice Cream, Neptune Coffee, Odd Fellows, Ox, Pike Place Market, Podnah's Pit, Pok Pok Thai, Powell's Books, Quinn's Pub, Red Light Vintage & Costume, Red Mill Burger, Rogue Ales, Rudy's Barbershop, Salt and Straw, Scarecrow Video, Schnitzer Concert Hall, Serious Pie, Skillet Street Food, Snowboard Connection, Spirit of 77, Stumptown Coffee Roasters, Tasty N Sons, The Crab Pot, The Nines, The Pink Door, Voodoo Doughnut If/when you're in Seattle or Portland, you should give some of these terrific spots a try! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing Our Acquisition of GetListed & Plans to Help Local Marketers & SEOs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing Our Acquisition of GetListed & Plans to Help Local Marketers & SEOs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}