{
  "url": "https://moz.com/blog/announcing-the-social-media-directory",
  "slug": "announcing-the-social-media-directory",
  "title": "Announcing the Social Media Directory - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While this is not meant to count as our weekly social media post (Wasabi Wednesday, if you will), I'm pleased to set free our newest directory. Added to our Premium Content, the Social Directory is lists social media sites that can help you accomplish one of three things: allow direct outbound…",
  "content": "Announcing the Social Media Directory Social Media By: Jane Copland January 15, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland January 15, 2008 Announcing the Social Media Directory Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While this is not meant to count as our weekly social media post (Wasabi Wednesday, if you will), I'm pleased to set free our newest directory. Added to our Premium Content, the Social Directory lists social media sites that accomplish one of three things: allowing direct outbound links, providing profiles that rank well in search engines, or serving as great places to promote link-worthy content. Some sites serve more than one of these purposes. As is our first link directory, this is a work in progress and we will continually add new sites. My research for the Web 2.0 Awards has already uncovered some fantastic finds, even though my blog post about said research may have led you to believe otherwise. Each entry includes the number of inlinks a site has, as told by Yahoo! Site Explorer. The site's PageRank is also listed, as is the location of the live link or the potential URL of the strong profile. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing the Social Media Directory"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing the Social Media Directory"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}