{
  "url": "https://moz.com/blog/announcing-local-business-reviews-impact-report",
  "slug": "announcing-local-business-reviews-impact-report",
  "title": "Announcing: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We’re thrilled to announce Moz’s first large-scale survey on the habits of local business review readers, review writers and successful owner responses. Read our free report today for dozens of actionable insights, thoughtful analysis, and expert commentary from local SEO industry professionals.",
  "content": "Announcing: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report Local SEO By: Miriam Ellis November 16, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 16, 2022 Announcing: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A warm welcome to Moz’s first large-scale survey on the habits of local business review readers, review writers and successful owner responses. Our survey uncovered interesting insights and actions local businesses can take to better serve their customers, earn more reviews, and build relationships. Read our free report today to peruse the findings, our thoughtful analysis, and expert commentary from local SEO industry professionals. Read the report! We surveyed 1,000+ US residents to assess trending behaviors surrounding reviews and responses and gained a powerful picture of the role this type of online sentiment is playing in consumer journeys, conversions, and most importantly, reputation. Local business owners and their marketers can access the full report today for strategic takeaways like these: Only 11% of consumers trust brand messaging over public sentiment In the complete report, you’ll learn that 96% of consumers now read online local business reviews. That’s basically almost everyone accessing this type of content, and the context comes into high relief when you know that just 11% of the public trusts what brands say about themselves over what customers say. Review management deserves serious investment from local businesses because it is the customers who are now writing the most trusted brand narratives. 52% of respondents say their negative reviews stem from false or incorrect online information on assets like local business listings Local business listing management also needs to sit at the core of your marketing strategy because, without it, negative customer experiences in the real world result in negative online reviews. When neglect of listings leads to incorrect contact information existing around the web, customers are significantly inconvenienced by driving to wrong locations, calling outdated phone numbers, or arriving on the premises outside of accurate business hours. With over half of customers having written negative reviews following poor experiences like these, it’s clear that location data management is essential to customer service and is key to protecting your reputation. 91% of consumers’ next steps after reading reviews occur in areas completely controlled by the business Local search can be a powerful connector between brands and consumers, but it can also sometimes lead to feelings of a loss of control. While business owners and marketers can be part of the conversation in big spaces like review platforms and social media, they can’t directly control it. This is why it should come as such welcome news that the incredibly broad road of review readers lands the majority of customers right back into areas directly controlled by the business. As the next step after reading reviews, 51% of consumers visit your website, 27% go directly to your place of business, and 13% contact you. It turns out that you have significant control over customer experiences along the post-review-reading customer journey. The top reason customers don’t review your business is because they forget to As you dig deep into Moz’s complete survey findings, you will come to identify a leading consumer desire for a substantial number of recent reviews. It’s this trend that obliges local business owners to implement review acquisition campaigns so that fresh sentiment is always incoming. It’s a welcome insight to know that 38% of customers don’t leave you a review because they simply forget to when they have free time. This is the top reason, amongst many, explaining why you likely aren’t receiving as many reviews as you need to. Fortunately, a remedy is within easy reach with follow-through reminders to review your business being helpfully shared with customers via email, text, and print assets. You can get more reviews if you just keep communicating. 62% of negative reviewers would give a local brand a second chance after an owner response solves their problem As you move through the complete report, you’ll come to see the medium of reviews as a platform for two-way conversations, with the majority of customers who leave a negative review expecting to hear back quickly from the business owner. It's harder to imagine better tidings than that 62% of your customers are willing to give your company a second chance if your owner response successfully resolves their complaints. This figure transforms scary narratives surrounding negative reviews into moments within a relationship where forgiveness is likely to follow when real help is given. A complete local search marketing campaign must include ongoing hands-on responsiveness to online customer sentiment. Come get the keys to running a customer-centric local business As we’ve learned, reviews are a wide road almost all of your potential and current customers are traveling on. To fully charge your vehicle for best performance on that highway, local business review stats and trends can help you better serve customers by understanding their needs; implement structural fixes within your business based on problems cited by consumers; earn more reviews to improve your local pack rankings and conversions; and build loyal community relationships via two-way conversations. Reading The Impact of Local Business Reviews on Consumer Behavior will help you prioritize reputation management tasks on the basis of consumer demand and habits. It will give you access to expert commentary from industry leaders including Aaron Weiche, Amy Toman, Crystal Carter, Joy Hawkins, and Mike Blumenthal. And, it will be a resource you can share with multiple stakeholders, be they clients, staff, team members, or company leadership to get buy-in for the considerable work involved in professionally managing reviews. There’s nothing quite like good data to make a great point, so please come take this ride with us! Read: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing: The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report"
    },
    {
      "level": "H2",
      "text": "Only 11% of consumers trust brand messaging over public sentiment"
    },
    {
      "level": "H2",
      "text": "52% of respondents say their negative reviews stem from false or incorrect online information on assets like local business listings"
    },
    {
      "level": "H2",
      "text": "91% of consumers’ next steps after reading reviews occur in areas completely controlled by the business"
    },
    {
      "level": "H2",
      "text": "The top reason customers don’t review your business is because they forget to"
    },
    {
      "level": "H2",
      "text": "62% of negative reviewers would give a local brand a second chance after an owner response solves their problem"
    },
    {
      "level": "H2",
      "text": "Come get the keys to running a customer-centric local business"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}