{
  "url": "https://moz.com/blog/announcing-mozbar-v3",
  "slug": "announcing-mozbar-v3",
  "title": "Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're thrilled to announce version 3 of the MozBar for Chrome! Check out the functionality in this post; the Firefox add-on will follow soon.",
  "content": "Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar Moz Tools | Moz News By: Jon June 3, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jon June 3, 2014 Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar Moz Tools | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today we are thrilled to announce version 3 of the MozBar browser extension. The SEO toolbar is now available for Chrome users. Expect the Firefox version to be available in a few weeks. What is the MozBar? The MozBar is a free browser extension that provides on-page access to Moz’s link metrics and site analysis tools. Over the years it has gained a very popular following and saved a ton of time for SEO’s and Inbound marketers alike. Whilst there are certain features that are only available to Pro subscribers, we try to keep as much as possible free. We think this is the TAGFEE thing to do, plus it really helps people as possible to get acquainted with our brand and our tools. The MozBar, since its inception in 2008, solves three main problems for its users: SERP analysis Site/competitor research Link profile analysis Here’s how those features work in version 3! SERP analysis As you search Google, Yahoo or Bing, the MozBar instantly shows you valuable statistics about each of the results you see. This new version of the MozBar makes deconstructing SERPs faster than ever. Create search profiles for different engines and locations If you are working in local search, the MozBar allows you to create search profiles for specific regions and cities. This allows you to easily switch between a search for \"pizza\" in Chicago and Seattle without changing your search query. Export the SERP to a CSV As you search, easily export into a CSV key data about each SERP including: URL Page Title Description Detailed link metrics See Moz authority and search metrics next to each search result You'll get an overview of the most important statistics for each result on a SERP without even having to click through to those results. Site/competitor research This is another area where we've added a significant number of improvements, from on-page analysis to new structured data and markup detection. See Moz authority and link metrics For every URL you visit, the MozBar instantly shows you the link metrics at the top of the page, including MozRank, Domain Authority, subdomain metrics and more. Highlight followed, nofollowed, external, and internal links Easily spot which links are followed or nofollowed without having to dig through source code. See important page attributes and elements on the page The page analysis tools make up some of the strongest features of the MozBar. They allow you to perform an instant on-page audit of any URL you visit. With just a couple of clicks, instantly see important on page factors like title tags, meta description, canonical tags, page load time, HTTP status and more. Link profile analysis Detailed information about a page's inbound links, including quick comparisons to the site's domain and subdomain, are available at a glance. What's new in version 3? Those of you familiar with the MozBar will notice that version 3 has a new look and design. The redesign is a result of a bunch of customer and design research and has been optimized around the tasks and use cases it is designed to solve. It is also much faster and more reliable. Some exciting new features for v3 include: See social activity No more hunting for that social sharing bar on pages you visit: MozBar now includes social statistics from Facebook, Twitter, and Google+ right on the page. Validate and preview semantic markup You'll get an at-a-glance look at any semantic markup present on a page. Want to make sure a Twitter card is properly set up? No need to send a test tweet; just preview it in the MozBar. View keyword difficulty on the SERP One of our most-requested features was the ability to make it easier to check keyword difficulty. Now you can get a keyword's difficulty on the fly for any search query with a click of the button, right from the search page. Note: This feature is only available to Pro subscribers. Pro tip: MozBar obscuring your page? Hit Shift+Ctrl+Alt+M to show / hide the bar! Get version 3 now! If you already have the MozBar installed, you don’t need to do anything. The Chrome Store will update to the new version automatically. If you don't already have it, download it at the link above! Or maybe you are feeling a bit nostalgic? Check out how the MozBar has evolved over the years! (And what better way to travel back in time than with old screenshots and a cool gradient overlay?) :-) Looking for the Firefox version? We are still ironing out some last-minute issues in the Firefox version, and will launch it as soon as it's ready. For now, don't worry; you can still use version 2.65. Firefox Update - August 2015 Mozilla recently announced some architectural changes to the browser. One part of this is the deprecation of the current way Firefox handles Add-Ons and Extensions in favor of a new model that promises to be based on the WebExtensions framework used by Google Chrome. This is great news for the MozBar as we anticipate being to support the latest version of the MozBar across Chrome, Firefox, Opera and Microsoft Edge with a single version meaning better browser support and faster development. After several unsuccessful attempts at getting the latest MozBar approved for Firefox, we are still stuck at 2.65, but these changes will allow us to bring new features like Spam Score, Keyword Difficulty and Rich Snippet Analysis to Firefox! For this reason we have decided to halt all Firefox development of the MozBar until these changes have taken place, which Mozilla anticipates as \"a few months\". Read more here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing MozBar 3.0: the Free, Completely Redesigned SEO Toolbar"
    },
    {
      "level": "H2",
      "text": "What is the MozBar?"
    },
    {
      "level": "H2",
      "text": "SERP analysis"
    },
    {
      "level": "H3",
      "text": "Create search profiles for different engines and locations"
    },
    {
      "level": "H3",
      "text": "Export the SERP to a CSV"
    },
    {
      "level": "H3",
      "text": "See Moz authority and search metrics next to each search result"
    },
    {
      "level": "H2",
      "text": "Site/competitor research"
    },
    {
      "level": "H3",
      "text": "See Moz authority and link metrics"
    },
    {
      "level": "H3",
      "text": "Highlight followed, nofollowed, external, and internal links"
    },
    {
      "level": "H3",
      "text": "See important page attributes and elements on the page"
    },
    {
      "level": "H2",
      "text": "Link profile analysis"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "What's new in version 3?"
    },
    {
      "level": "H3",
      "text": "See social activity"
    },
    {
      "level": "H3",
      "text": "Validate and preview semantic markup"
    },
    {
      "level": "H3",
      "text": "View keyword difficulty on the SERP"
    },
    {
      "level": "H4",
      "text": "Pro tip: MozBar obscuring your page? Hit Shift+Ctrl+Alt+M to show / hide the bar!"
    },
    {
      "level": "H3",
      "text": "Looking for the Firefox version?"
    },
    {
      "level": "H3",
      "text": "Firefox Update - August 2015"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jon\n          \n            Jon"
}