{
  "url": "https://moz.com/blog/announcing-2015-online-marketing-industry-survey",
  "slug": "announcing-2015-online-marketing-industry-survey",
  "title": "Announcing the 2015 Online Marketing Industry Survey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're very excited to announce the 2015 Online Marketing Industry Survey is ready. By comparing answers and predictions from one year to the next, we can spot trends and gain insight not easily reported through any other source. This is our best chance to understand exactly where the future of our…",
  "content": "Announcing the 2015 Online Marketing Industry Survey Marketing Industry | Moz News By: Cyrus Shepard March 3, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard March 3, 2015 Announcing the 2015 Online Marketing Industry Survey Marketing Industry | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Announcement: The Online Marketing Industry Survey for 2015 is now closed, as is the sweepstakes. Watch for the results soon! In the meantime, here are the winners of the sweepstakes: Grand Prize: John Hampson iWatch: Tyler Lorenzen iWatch: Alanna Stage $50 Gift Cards: Lauren Busby, Carlos Rodriguez, Daniel Loeschen, Kaitlin McMichael, John Coleman, Olivia Stranger, Mehmet Aktug, Brittany Harness, Greg Trujillo, Dylan Hoover We're very excited to announce the 2015 Online Marketing Industry Survey is ready. This is the fifth edition of the survey, which started in 2008 as the SEO Industry Survey, and has also been known as the Moz Industry Survey. Some of what we hope to learn and share: Demographics: Who is practicing inbound marketing and SEO today? Where do we work and live? Agencies vs. in-house vs. other: How are agencies growing? What's the average size? Who is doing inbound marketing on their own? Tactics and strategies: What's working for people today? How have strategies and tactics evolved? Tools and technology: What are marketers using to discover opportunities, promote themselves, and measure the results? Budget and spending: What tools and platforms are marketers investing in? This year's survey was redesigned to be easier and only take less than 10 minutes. When the results are in we'll share the data freely with you and the rest of the world, along with the insights we've gleaned from it. Take the survey Survey importance By comparing answers and predictions from one year to the next, we can spot trends and gain insight not easily reported through any other source. This is our best chance to understand exactly where the future of our industry is headed. Every year the Industry Survey delivers new insights and surprises. For example, the chart below (from the 2014 survey) lists average reported salary by role. One of the data points we hope to discover is if these numbers go up or down for 2015. Prizes. Oh, fabulous prizes. It wouldn't be the Industry Survey without a few excellent prizes thrown in as an added incentive. This year we've upped the game with prizes we feel are both exciting and perfect for the busy inbound marketer. To see the full sweepstakes terms and rules, go to our sweepstakes rules page. The winners will be announced by June 15th. Follow us on Twitter to stay up to date. Grand Prize: Attend MozCon 2015 in Seattle Once again, the Grand Prize includes one ticket to MozCon 2015 plus airfare and accommodations. This is your chance to see greats like Wil Reynolds, Cindy Krum, Rand Fishkin and more over 3 days in Seattle. Plus experience lots of networking and social events. Moz is also covering the cost of the flight plus hotel room. 2 First Prizes: Apple Watch Shhhhhh! Because we're giving away two Apple Watches. These aren't available to the general public yet, which make them mysteriously awesome. 10 Second Prizes: $50 Amazon.com gift cards Yep, 10 lucky people will win $50 Amazon.com gift cards. Why not buy yourself a nice book? Maybe this one? Help with sharing! The number of people who take the survey is very important! The more people who take the survey, the better and more accurate the data will be, and the more insight we can share with the industry. So please share with your co-workers. Share on social media. Share with your email lists. You can use the buttons below this post to get you started, but remember to take the survey first! Take the survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing the 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing the 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H4",
      "text": "Announcement:"
    },
    {
      "level": "H3",
      "text": "Survey importance"
    },
    {
      "level": "H2",
      "text": "Prizes. Oh, fabulous prizes."
    },
    {
      "level": "H4",
      "text": "Grand Prize: Attend MozCon 2015 in Seattle"
    },
    {
      "level": "H4",
      "text": "2 First Prizes: Apple Watch"
    },
    {
      "level": "H4",
      "text": "10 Second Prizes: $50 Amazon.com gift cards"
    },
    {
      "level": "H2",
      "text": "Help with sharing!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}