{
  "url": "https://moz.com/blog/announcing-moz-content",
  "slug": "announcing-moz-content",
  "title": "We're Pleased to Announce Moz Content – A New Product for Content Marketers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're excited to announce the newest addition to our family of tools — Moz Content! Moz Content helps marketers build engaging content strategies with specialized research, measurement, and analysis tools.",
  "content": "We're Pleased to Announce Moz Content – A New Product for Content Marketers Content Marketing | Moz Tools | Moz News By: Jay Leary November 23, 2015 Table of Contents Copied! By: Jay Leary November 23, 2015 We're Pleased to Announce Moz Content – A New Product for Content Marketers Content Marketing | Moz Tools | Moz News Moz Content will be retired on November 21, 2016. After much deliberation, we arrived at the difficult decision to shift away from content marketing software back to our core of SEO. For more information, head here. Stating the obvious here, but content is a massively important part of any inbound marketing campaign. The problem that most of us run into — and I know this well from years of SEO consulting with publishers — is that even \"good\" content can fade from view without a share, link, or conversion. Engaging an audience isn't as simple as clicking \"publish.\" So, how do we avoid making phantom content a habit? For Moz, timely data has been a big part of the answer. Over the years, we've built internal tools like 1Metric to guide our work. It's a simple strategy, but the more analysis we perform, the better we understand our audience. The better we understand our audience, the easier it is to produce engaging content. When we blog and talk about those tools, folks in the community remind us that having something similar for their own use would be really helpful. Well, we took that feedback to heart and, about a year ago, set out to create a product that helps marketers and content creators optimize their content efforts. Now, after lots of hard work, we’re ready to roll back the curtain on our latest offering: Moz Content. Enough talk – let's check it out! Here’s a quick overview of we came up with... The Content Audit At the heart of Moz Content is the Content Audit. With an Audit, you can crawl and analyze any site, including a competitor's. The Audit inventories a site's pages and uncovers wins based on social and link activity... In other words, the basic analysis you’re probably already cobbling together in Excel. More importantly, Moz Content helps you find meaning in that mess of data with automatic tagging and filtering based on topics, authors, and even content types (think lists, videos, news articles, and more). With an Audit, you can answer important questions about a site's strategy, like: How do Guides on the Moz Blog stack up against Lists? vs. Average links and shares are almost double for Guides. Let's keep it up! The filtering lets you segment content to easily surface insights about your current strategy. Are \"social media\" or \"link building\" articles generating more links? How do Whiteboard Fridays compare with other videos? Audits let you shortcut the analysis and answer pressing questions about your audience's interests. That point-in-time analysis is helpful when you're researching or course-correcting, but we also know that ongoing performance reporting is critical to a content marketer's workflow. That’s where Tracked Audits come in. With a Tracked Audit, Moz Content will automatically re-crawl a site every week and trend your performance metrics. Then, with the handy Audit Selector, you can compare the Audits we’ve archived in order to measure your progress. By comparing two Audits, you can easily surface gains or losses and learn if your latest efforts are resonating. Content Search When we built Moz Content, we knew that we’d need to help sites at both ends of the content creation spectrum. Tracked Audits are great if a site has an active audience, but if you're just getting started, the focus is usually on research. That's where Content Search comes in. Content Search lets you explore popular articles from across the web with simple topic searches. Interested in SEO and content? A quick search for (no surprises here) \"SEO AND content\" surfaces competitor articles that have garnered lots of attention. (You can also search for content on domains with the “site:” operator.) Moz Content monitors hundreds of thousands of English-language sites in order to surface new content about the niches you play in. Use the tool to analyze competitors or research topics that are important to your audience. For social media marketers, Content Search also helps with curation. After you find something interesting, you can share it directly with your followers: It's worth mentioning that our index is still growing and you may see some gaps in the reporting. If that's the case, feel free to reach out with topics you'd like covered in the future. And a final note: you'll probably notice we're not reporting Twitter shares. Twitter, as of a few days ago, shut down the endpoint that many of us were using to measure Tweet counts. We didn't want this wrinkle to hold up the launch, but we're on the case and working on alternatives. Time to test drive There are other details we could cover, but I'm guessing you'd rather just dive in and see for yourself. With Moz Content, we're providing free, limited access to the Audit and Content Search. Just head over to https://moz.com/content and take it for a spin. (Tip: Log in to your Community account first for elevated page limits, more searches, and a saved Audit.) Try it out! If you need more data and higher limits, you can always subscribe to Moz Content on a monthly or annual plan. This is just the beginning for Moz Content — we’ll need your help as we improve and expand upon the functionality. Don’t hesitate to let us know what you'd like to see, and feel free to send any feedback our way with a comment below, a note to our Help Team, or outreach on social. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "We're Pleased to Announce Moz Content – A New Product for Content Marketers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "We're Pleased to Announce Moz Content – A New Product for Content Marketers"
    },
    {
      "level": "H2",
      "text": "The Content Audit"
    },
    {
      "level": "H2",
      "text": "vs."
    },
    {
      "level": "H2",
      "text": "Content Search"
    },
    {
      "level": "H2",
      "text": "Time to test drive"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jay Leary\n          \n            Jay Leary"
}