{
  "url": "https://moz.com/blog/another-post-about-getting-edu-links-i-know-you-have-a-couple-more-reads-in-you",
  "slug": "another-post-about-getting-edu-links-i-know-you-have-a-couple-more-reads-in-you",
  "title": "Another Post About Getting .edu Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey guys! This is my first post, so maybe in celebration we could take off the nofollows on this blog post...hahaha, just messing. Recently, I was talking to one of my friends at Georgia Tech and discovered he had his own web design company (like a lot of CS majors at Tech). When I went to his…",
  "content": "Another Post About Getting .edu Links Link Building N By: Nathan Taitt January 30, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nathan Taitt January 30, 2009 Another Post About Getting .edu Links Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hey guys! This is my first post, so maybe in celebration we could take off the nofollows on this blog post...hahaha, just messing. Recently, I was talking to one of my friends at Georgia Tech and discovered he had his own web design company (like a lot of CS majors at Tech). When I went to his website I discovered his homepage had a PR 4 (not too shabby). This piqued my interest and I took a look at his website. Like most web designers, he had a link back to his website in the footers of the web pages he had designed. This is where it got interesting. He had designed web pages for student organizations and clubs at Georgia Tech, giving him .edu links (a lot of Georgia Tech's web pages either have a high PR or it is easy to get them a high PR). While I was discovering all this information I was simultaneously interested in a new club (the Young Entrepreneurs Club) starting up at Tech. I went to the club the other week (it sounds like a great club and I look forward to getting involved) and offered to make a website (for free) for the club (.edu links!!!). Since I am making it for free, I have no problem having prime links back to my website from this club's pages. This brings me to my advice/idea. Find a college near you (unless you live in Atlanta, then disregard this advice and let me hoard all the links) and try to find some club or organizations that you would be willing to help (or any clubs that still don't have a website). Offer to make/give them a website, or if it is really crappy, to redesign it. Then feel free to let the .edu links flow to your webpage, increasing the credibility, authority, and, most importantly, the PR of your webpage. Hope ya'll found this helpful, I would love to hear feedback, constructive criticism, and advice about this post. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Another Post About Getting .edu Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Another Post About Getting .edu Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nathan Taitt\n          \n            Nathan Taitt"
}