{
  "url": "https://moz.com/blog/answers-to-43-questions-about-search-social-content-conversions-and-more",
  "slug": "answers-to-43-questions-about-search-social-content-conversions-and-more",
  "title": "Answers to 43 Questions About Search, Social, Content, Conversions and More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier tonight, I sent out the following tweet:\n\t\nHave any questions about search, social, content, conversion or analytics you want answered? I'm taking requests for the Moz blog tonight :)",
  "content": "Answers to 43 Questions About Search, Social, Content, Conversions and More Advanced SEO By: Rand Fishkin January 23, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 23, 2012 Answers to 43 Questions About Search, Social, Content, Conversions and More Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Earlier tonight, I sent out the following tweet: Have any questions about search, social, content, conversion or analytics you want answered? I'm taking requests for the Moz blog tonight :) — Rand Fishkin (@randfish) January 24, 2012 I was clearly under-prepared for the amazing responses. In order to tackle such a magnitude of great questions, I'm giving myself some rules for replies. If I don't have a good answer, I won't tackle the question. For example, Nathaniel Deal asked a good one on .NET viewstates impacting SEO, and while I'd love to reply, I don't know enough about them to provide solid suggestions. No answer can be longer than two paragraphs (plus maybe an explanatory image/graphic). Everyone who asked a great question gets their tweet embedded in this post (using Twitter's nice, new embed functionality), which also gives a spiffy followed link to their tweet. Where possible, I'll provide links to content for more detail so those who are particularly interested can follow up. Let's get started! @randfish What single site on the web would you most want to see the analytics for? — AlexConde (@AlexConde) January 24, 2012 Tough decision. It would probably be between YouTube and eHow, mostly for the putting-to-rest-conspiracy-theories value. But that's with my blogger/search news hat on. If I think more strategically and web-wide, I'd say Amazon's analytics would be fascinating to open-source ala Wikileaks. I suspect folks around the world could study the last decade of data and discover remarkable traits and trends about what we care about, buy and sell as a society. @randfish not a lot of coverage on enterprise b2b content out there. What differences in strategy should these companies use? — Jack Jones (@Mafuba) January 24, 2012 I think there's some pretty good stuff out there about Enterprise SEO (though, in all fairness, Moz hasn't been doing a great job on that topic lately - I'll try to fix that). Some recommendations: The columns at SELand on Enterprise SEO are often good (Ian Lurie's latest in particular) Tom Critchlow gave a solid delivery at Mozcation Peru on this topic, and his slide deck is on Slideshare. Speaking of Slideshare, Bill Hunt, who's a brilliant enterprise-level marketing tactician, also has a good deck there. A pair of good pieces from Aimclear and Raven covered enterprise sessions at conferences. In terms of my personal recommendations - the key is to think at scale. Oftentimes, the \"little stuff,\" like fixing title tags, getting URLs right, making it easier to use the CMS so more people at the company blog, etc. can have huge impacts at big organizations but would do little for SMBs. There's also larger strategies like content licensing and adding specific inbound marketing roles to a team. E.g. for a five-person team, you could have a content strategist, a full-time writer, an SEO/analytics data junky, a marketing-focused graphic designer and a marketing-specific developer. That combination can often do AMAZING things, even in very large organizations. @randfish Booh, the Filthy Linking Rich are getting some link Juice..? bit.ly/22IyMo — Dennis Goedegebuure (@TheNextCorner) January 24, 2012 I suppose linking to Twitter is giving a link-rich site more juice, but I'd worry about saying I'll link to everyone's individual domains, as that could create some more manipulative/non-authentic questions, especially considering the sphere we're in :-) Oh, and BTW, if you haven't read the article Dennis links to in his tweet (from the brilliant Mike Grehan), I'd check it out. I wrote about it again a couple years ago, because it's a concept that every marketer should know and embrace. @randfish conversion: how many people really click on related posts lists at the end of a post? — Brankica U (@BrankicaU) January 24, 2012 It totally depends on how it's implemented and what you put there. I've seen/heard of CTRs on \"related\" as high as 10% of visits (usually on hyper-targeted blogs that include images/graphics in the related section) and under 0.1%. My advice is to test the formats you think will work best against one another, using some A/B testing software like Google Website Optimizer or Unbounce. Given the task you're aiming for has relatively higher conversions than a traditional purchase funnel, you can likely see results fairly quickly. @randfish Do you think Google is using or will use 'author trust' as a highly relevant ranking factor? — David Cohen (@explorionary) January 24, 2012 Right now, I'd say it's a strong factor for earning those amazing rel=author style rich snippets in the SERPs (as seen below): In the future, I think it will depend on the degree to which the data format is embraced and used across the web, and whether they see a strong correlation with increased searcher happiness/relevancy when they test implementations. If you've not yet read the interview with a Google Search Quality Rater, check it out. To my mind, that clearly illustrates the process by which Google's Search Quality team determines whether an algorithmic shift is positive (and worth releasing) or negative (and thus, shut down). @randfish been thinking of doing a crowdsourced post about the state of affiliate marketing this year (with GSPYW, Panda, social signals)... — Jason Acidre (@jasonacidre) January 24, 2012 I think it's a great topic. Sadly, for a lot of affiliate marketers, I think Google's intent is to put them out of business, or at least make things much tougher for them in search/SEO. If I were doing any form of affiliate stuff, I'd be thinking extremely hard about how to build a unique value proposition, a recognizable, memorable, beloved brand and earn enough press and awareness, particularly in the tech community, so as to limit the potential damage of future Google updates targeted as eliminating these types of operators. I'd also try to diversify my traffic to get no more than 40% of visits from search (which likely means investing in a lot of content marketing, social media, blogs, etc). @randfish What kind of difference should I expect in conversions if I require a credit card for a free trial, vs open registration? — Adrian Pike (@adrianpike) January 24, 2012 We actually studied this one at Moz! Our findings, from talking to a bunch of folks in the sphere, were that the numbers come out very similarly either way. If you take a credit card upfront, you have a higher barrier to entry and fewer free trials, but a higher post-trial conversion rate. If you don't require a credit card, trials go up, but conversions at the end of the period go down to approximately the same. We based our decision on the fact that there are substantive costs associated with crawling a site, fetching data, etc. in our web app and tools (including social data, which we pay for based on usage). Thus, fewer trials with a higher conversion rate would give the business better overall margins. @randfish Could you write up a post about the science of sharing? I.e. best practices to get your readers to share your content? — Jon Cooper (@PointBlankSEO) January 24, 2012 I'm going to defer to the expert on this one and point over to these 10 excellent posts by Dan Zarrella. In fact, just go read all his stuff. Here's his posts on Hubspot and his Slideshare decks. If you want even more, I did a Whiteboard+ video that went up just today on the topic of sharing across multiple platforms. @randfish While SEO Moz lays out some fantastic best practices, can you think of any sites succeeding by doing the exact opposite? — AlexConde (@AlexConde) January 24, 2012 Many of the daily deals and subscription commerce sites actually do very little inbound marketing. Here's a cool infographic from the folks at Kiss Metrics showing off the impressive growth many of them have experienced: Some of this is based on the product alone, some is the virality of the concept, some is highly successful advertising and a few, to be fair, do a good job with inbound channels like content, search and social. Other great examples are Craigslist and Reddit. There's lots of ways to skin the web traffic cat, and while I'm biased to organic/free sources, I'm also keenly aware that it's not the only route. @randfish love to know more about canonical issues with site redesigns. When to use them or do I 301 bunch of weird urls? — Ken Savage (@kensavage) January 24, 2012 If possible, most SEOs generally like to use 301 rewrite rules. They scale nicely - even if you have 500,000 pages of product URLs that all need to change, a single 301 rule through .htaccess can often address the problem - and they're still a best practice. I'd lean more towards canonical when you have a specific reason to want to keep the page accessible to users in multiple formats, e.g. print/mobile-friendly versions of articles or the same product with different image views. @randfish What I mean is the best ways to implement sharing (i.e. social buttons) in your content to increase social traction. — Jon Cooper (@PointBlankSEO) January 24, 2012 Oh... Interesting. I think this would be worthy of some testing and research, but one cool data point I'd check out comes from the OKTrends blog. You might remember that they used to have multiple sharing buttons that dropped-down from the top of the page using CSS once you reached the bottom of an article. After testing, my understanding is that they found having a single Facebook like button (as per the image below) worked best. Perhaps less is more when it comes to sharing. I know that personally, I'm often overwhelmed by, for example, what Mashable or Huffington Post do with share buttons. Though, I do like having at least Twitter, Facebook and Google+. @randfish Google is pushing G+, Search Plus your world in it's SERP! What's the future of #SEO? Or do we just need to push content on G+? — Aakar Anil (@aakarpost) January 24, 2012 I think they'll only get more aggressive with pushing Google+ into the SERPs and into non-traditional results areas as with what we see below: I did a video about this last week, and I'd also recommend AJ Kohn's sublime SEO Guide to Google+ for more depth. @randfish when doing outreach, what's the best way to improve response/overall content conversion rates? — Xiaohan Zhang (@xiaohanzhang14) January 24, 2012 My top 5 things to get improved conversions through outreach are: Have a pre-existing relationship w/ those you contact Be a recognizable, trusted brand (or have an association that they'll know and trust) Make requests that benefit both parties (e.g. it's easy to get me to share great marketing content, because I know that if I do, I'll earn more followers/blog readers/circles/fans/etc) Make your content source (blog/website/infographic) as beautifully-designed, clean and ad-free as possible Be incredibly relevant - reference things that show you know the person you've reached out to, point to content that's recent, useful, interesting and \"up their alley,\" and be authentic in your request (i.e. explain how/why your request and content are relevant if it's not truly obvious) Mike King also offered some great suggestions in his blog post on the topic here. @randfish Hi :) With HTML 5 and long 1 page websites. What are the recommendations for Hx tags and for \"inner\" linking ? — Khalil Maaouni (@kmaaouni) January 24, 2012 I like internal anchor links a lot, and I don't just use them for long pages, but also to split up pages in a long document (e.g. our Search Ranking Factors). For those long one-pagers, do be aware that Google may rank specific portions from those internal anchors separately (which can be a good thing), and that you can also get the mini-sitelinks like these: You don't need to do anything fancy - clean, classic internal anchors and substantive content + good external links usually does the job. @randfish For @seomoz blog - These Google shenanigans, how much will it affect their activity? Will Bing/Yahoo see an increase overtime? — Bill Springer (@billyspringer) January 24, 2012 Probably not. I'd say that for logged-in users of Google accounts, Gmail and Google+, Google already has those users \"in their pocket\" as searchers and it will be very tough to go over to Bing. Core relevancy, particularly in the long tail, is still a weak spot for Bing, and Google's still relatively religious in their testing around user experience and click activity. If they see any hint of a real hit to usage, they'll tune things up very quickly. My guess is that the SPYW rollout wouldn't have even happened unless they saw some good data suggesting it would improve the metrics they care about. @randfish Do you see Pinterest ever playing a big role in the social marketing other than \"putting the button on my site\"? — Colby Almond (@colbyalmond) January 24, 2012 I think long-term, Pinterest may be more than it is today. Twitter started out as a place to tell people what you were eating. Facebook was just a place college students went to hook up. I'd guess Pinterest has a real shot at disrupting e-commerce and online shopping from a social perspective. @randfish What are the best options to integrate a mobile-optimized site with an existing desktop one? — Ryan Ricketts (@RickettsFish) January 24, 2012 My favorite is simply to have a mobile stylesheet. The content stays the same. The URLs stay the same. The social sharing and SEO isn't affected. It just makes it easier to read on tiny devices. @randfish in PPC setups, before people ever get the chance to see your content, what are some of the best ways to increase CTR / conversions — Bryan Pellegrino (@PrimordialAA) January 24, 2012 Help me Joanna Lord! You're my only hope. Seriously, we should get her to write a blog post about this. I bet it would be amazing :-) @randfish any opinion on which SEO plugin for wordpress is \"best\"? (IF there is good content and if not) — Aly & John (@hopandjaunt) January 24, 2012 I'm a longtime fan of Yoast's Wordpress plugins. They're powerful, flexible and nearly easy enough for beginners (at least, with a little light reading). He also keeps them updated regularly and allows for some of the cool, new functionality like rel=author (to be fair, you can do this without the plugin, too). @randfish Twitter vs. Facebook. Which link raises a page one result faster? (My tests say Facebook every time) wondering what you see. — Amanda MacArthur (@amaaanda) January 24, 2012 My understanding, which comes straight from Google is that neither influences search rankings directly (at least, not anymore - Twitter did from 2009-2011). However, they both spread content to users who search, click, like, link, +1 and perform all other manners of activity, some of which may indeed be directly influencing the rankings. In terms of which one's more powerful, I'd say it's about your network and your users. For example, on Moz, we have far more success spreading content using Twitter than Facebook. And for me personally, the same is true. For others, though, Facebook may be much more influential. You have to know your network and your audience. @randfish I once heard that Google takes the length of a domain registration into account as one of their ranking/authority factors. True? — Lennart(@LennartDam) January 24, 2012 I've heard the same thing, and I believe it's based on a webspam-related patent Google filed many years ago. Bill Slawski recently re-visited the patent and his coverage is worth a read. Personally, I'd guess that if it's a signal, it's a very small one, and potentially limited to use only for network spam detection. That said, I'd still register domains for multiple years, because it sucks royally when you forget to renew them :-) @randfish in the music lyrics industry, what's the best competitive advantage a site can get - considering all \"content\" is the same — Jonathan Dingman (@Dingman) January 24, 2012 Check out the brilliant work of Rap Genius. In my opinion, they set the gold standard for adding value in an industry/niche where few thought that could be done. @randfish Which books taught you the most about the Web? — Ryan Ricketts (@RickettsFish) January 24, 2012 I've got a list for you right here! Some of them are just enjoyable works of fiction, but the rest should be up your alley. @randfish Is there such a thing as a scalable link building strategy? — ROImedia (@ROImedia_LLC) January 24, 2012 Definitely. UGC is scalable. Content licensing is scalable. Embedded content is highly scalable. Data APIs are scalable. Even media coverage can be scalable. Heck, if you're really good at it, blogging can even be scalable. A good post on the topic comes from Distilled. @randfish Hi Randfish, I would like to know how to leverage on Twitter / Facebook to increase the Klout rank — Writing-Unleashed (@17OnlineIncome) January 24, 2012 Hmm... I don't think I'd worry much about Klout's ranking. It's a lot like toolbar PageRank in that there's not much point in attempting to inflate it. I'd concentrate more on social metrics like these. That said, I've heard that if you have lots and lots of @ reply conversations (particularly with a diverse set of folks), it can bring up your Klout score quite a bit. @randfish hey...if multiple accounts on FB and G+ link to a website (not to the FB page of the brand)..wud that improve the rankings? — Srikanth Ch (@srikanthch10) January 24, 2012 Potentially yes, though probably not by a huge amount unless they're accompanied by all the other nice signals that a group of social influencers often bestow on a site they all share (e.g. SEOmoz has quite a few powerful Twitter/Facebook/G+ accounts linking to it, though the benefits are probably more second-order impact than direct). @randfish- with radically differing serps by region is it neccessary to measure campaign performance on rankings anymore. — rbnfsh (@rbnfsh) January 24, 2012 I don't think I'd go that far. Rather, I'd say it's important to measure rankings for specific engines in specific regions, e.g. Google.co.uk AND Google.ca AND Google.com (US). @randfish as a small biz online, what should you focus on the most? Blog, newsletter, landing pages, social, other? — Robert Rolfe (@rrolfe) January 24, 2012 Unfortunately, the best advice I can give is the hardest to implement: You have to test. If you try a channel honestly and with authentic effort for 3-4 weeks, then compare against other things you're doing, you'll have real data about the value of that source for your brand. If not, you'll probably miss some. That said, if you do nothing else, have a blog you update religiously every week (or every day if possible), occasionally targeting keyword phrases for SEO, and get accounts on Facebook/Twitter/Google+ where you share your posts. It doesn't work for everyone, but it's a content+social strategy that often yields consistent rewards. @randfish How would you quantify, in $, the value of a single link with the purpose of comparing net roi of competing linkbuilding efforts — Dylan Whitman (@DylanWhitman) January 24, 2012 You ask for the impossible, sir. Links can almost never be measured in dollar value, unless it's an affiliate link with a tracking code and you know every visitor that came and their behavior over the next 3 months (and even then, you're probably missing some of the value). Rather than trying to come up with an arbitrary formula, I'd think holistically about the value of links - they send traffic, they help with branding and awareness, they likely provide some SEO benefits (if they're from good sources) and they build relationships with the linking site. Hard to measure is a good thing - it means the competition probably underinvests :-) @randfish A question: What has the most value, a \"mention\" of a URL or a no-followed link? — Mikael Rieck (@mikaelrieck) January 24, 2012 I would LOVE to run some tests on that :-) If anyone does it, we'd be thrilled to publish your findings here on the Moz blog. My total guess is that nofollow links probably do, but it's very hard to say and could even be on a case-by-case, e.g. link mentions on Wikipedia might be worth more than nofollow links on a random blog (but can't say for certain). @randfish Many software co's leverage post-blog CTAs in the form of whitepapers, free trials, & the like. Why does SEOMoz choose not to? — Ross Hudgens (@RossHudgens) January 24, 2012 We sorta do... This is what you'll see if you're logged-out of your account: Being honest, there's a natural tension inside SEOmoz about not pushing our products too hard in our community. It's part of our commitment to TAGFEE (specifically Authenticity). We believe there's a ton of value in building up trust and a relationship with our members prior to asking them to buy our stuff. So far, that's worked out well :-) @randfish As search engines become more intelligent with their search results do you think SEO will be as effective as it is today? — Mac Segura-Cook (@MacSegura) January 24, 2012 Engines have gotten tremendously more intelligent over the last decade, but I've only ever seen the effectiveness and value of SEO go up. Granted, it's become more complex and nuanced, but that's actually made it a more worthwhile investment, IMO. @randfish We have a ton of user-generated content, and as such, lots of inbound links. How can we leverage that info for greater exposure? — Greg Childs (@NICOclub) January 24, 2012 Target good keywords! And encourage folks who contribute UGC to do likewise (and to link to their profiles and their content in scalable ways, such as badges or direct-embedding, like I did with your tweet above). You can also try taking older, out-of-date content and redirecting it to more relevant, high quality, updated pages, thus consolidating some of the spread-out link juice and providing better value to visitors. @randfish What factors does Google use to define what an ad is? How does it know it's paid and how many is too many? [Above the fold] — Nathaniel W Deal (@NathanielDeal) January 24, 2012 Ads on the web follow extremely similar patterns such as tracking URLs and IDs, sizing formats, delivery through CDNs, etc. I'd guess that Google likely has a machine-learning based algo that has human editors tweaking it semi-regularly when any new ad network gets to scale. What's the best competitive benchmark for social ROI? RT @randfish: Have any questions... you want answered? I'm taking requests tonight :) — Bryant Tutterow (@BTutterow) January 24, 2012 There's only a few metrics you can really get publicly for the Twitter/Facebook/Google+/etc. accounts of your competition. Check out this post to see more. @randfish When on-page has been done all wrong for large WP Blog what path do u take? Fix 200 posts, go hard creating new ones done right? — Sha Menz (@ShahMenz) January 24, 2012 Depends. If the content was targeting good keywords and is high-value/useful then just clean up the on-page, perhaps update the content a touch and then re-share (particularly the good stuff) on social networks/featuring on the homepage, linking to it in new posts, etc. If, however, there's a lot of old junk in the blog, I'd worry less about reviving it and more about upgrading quality, SEO-targeting and share-worthiness moving forward. - @randfish Do search engines read URLs as separate words? Are dashes in URLs SEO friendlier? www. ThisURL .com vs www. This-URL . com ? — Sarah V. (@nettyboops) January 24, 2012 99% of the time, they do. But be careful if you make up words. For example, SEOmoz itself may not get the benefit of having \"SEO\" in the domain name, because \"moz\" isn't a word. Likewise, something like \"Everywhereist\" might not rank for \"Everywhere\" because the engines interpret \"ist\" as part of the word, not a separate one. However, if you have a domain like \"greetingcards.com\" that will certainly be seen as the words \"greeting\" and \"cards.\" @randfish is it possible to cost effectively outsource article creation (non-spun, non-spam) for non-tech businesses (eg. restaurants/vets) — Iain Dooley (@iaindooley) January 24, 2012 It is, but there's a bunch of pitfalls and shortcuts that lead many down the wrong path. My best advice is to outsource to those who are already blogging/content-creating passionately and authentically. For example, if you're a travel site seeking content, don't hire folks who've never written about travel before (or who do it through a content agency for $5 an article). Go find 50 travel writers on the web who aren't monetizing their sites well. Reach out individually and offer them $50-$100 per post. You'll get a lot of takers and way more value - because those bloggers will (oftentimes) SHARE the content they write for you, bringing far more value than just the words alone. @randfish How should one go about forecasting weekly organic search results to show ROI in order to obtain dev resources and budget? — Jonathon Colman (@jcolman) January 24, 2012 This deserves its own post, Jon. Excellent question though - I will try to tackle in some future content (maybe a WB Friday or a blog post). @randfish do paid website directory listingsoffer any SEO benefit anymore? — AlexConde (@AlexConde) January 24, 2012 Sadly, the answer is sometimes, but usually not permanently and on rare occasion, it can get you a penalty. I'd use extreme caution here (which means, I'd never do it personally, but some folks with higher risk tolerance do and get rankings from it). @randfish As SERPs become more personal & harder to influence en masse, what metrics will become more important for measuring SEO success? — Mollie Vandor (@mollierosev) January 24, 2012 Visits from search, # of keywords sending traffic, performance of keywords, # of pages receiving search traffic, rankings for key terms using non-personalized search (even if many are logged-in, the \"natural\" results still usually hold some sway in what gets shown, especially on Page 1). @randfish How about the parallel between search and usability and how the new generation of mobile users are influencing this — Jack Plouse (@jplouse) January 24, 2012 I'm not sure that mobile has added a ton here (though having content that's easy to consume + share on mobile devices is certainly a win, don't get me wrong). However, usability/UX has always been critical to SEO - it increases the likelihood your content will be seen, shared, liked, linked-to and all the other signals engines measure. Given how aggressive Google's been about user-experience style algo updates of late, I'd say a great UX is more important than ever, and it's something I'd nail even before worrying about broader marketing efforts. @randfish Would love to have data on the impact of images to link to as we market @Shutterstock. — David Fraga (@davidfraga) January 24, 2012 Links from images definitely appear to have an impact, and the alt attribute seems to act like anchor text. However, we did run some tests about 18 months ago showing that image links seemed to have less of a rankings influence than straight text links, so if possible, I might try to get the attribution to images in a caption below the image rather than just having the image itself click-able. Thanks to everyone who sent questions! This has been tons of fun, though a lot of work. I'm sure many of the comments will have more detail and probably some even better responses than those I gave above. That's the great part about this community - it scales. Someday soon, I suspect I'll be more of a question-asker than an answerer here, and that will be a wonderful day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Answers to 43 Questions About Search, Social, Content, Conversions and More"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Answers to 43 Questions About Search, Social, Content, Conversions and More"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}