{
  "url": "https://moz.com/blog/answers-to-ten-seo-questions-some-new-questions-from-danny-sullivan",
  "slug": "answers-to-ten-seo-questions-some-new-questions-from-danny-sullivan",
  "title": "Answers to Ten SEO Questions & Some New Questions from Danny Sullivan - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It looks like our ten questions post was a hit. To follow up, our own, intrepid point man, Scott Willoughby, will be crafting an advanced test/quiz on many different SEO topics - some fun, some serious - and should have it launched in the next 3-4 weeks. Await with bated breath (I know I am)\nAnd…",
  "content": "Answers to Ten SEO Questions & Some New Questions from Danny Sullivan Public Relations By: Rand Fishkin August 1, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 1, 2007 Answers to Ten SEO Questions & Some New Questions from Danny Sullivan Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It looks like our ten questions post was a hit. To follow up, our own, intrepid point man, Scott Willoughby, will be crafting an advanced test/quiz on many different SEO topics - some fun, some serious - and should have it launched in the next 3-4 weeks. Await with bated breath (I know I am) And now, the answers to last night's SEO questions: What four search engines comprise 90%+ of all general (non site-specific) web search traffic? The most correct answer would be Google, Yahoo!, MSN/Live and Ask, though AOL would also be acceptable (AOL, however, pulls its search results from Google and is thus more of a portal that includes Google's search engine than a true search engine itself). Explain the concept - \"the long tail of search.\" The long tail is an economic theory of demand. It posits that in the modern American economy, there are popular products and unpopular products in every sector and segment of demand and that, in any of those given sectors, a demand curve exists with a few popular products that have high demand and a great number of unpopular products that have a much smaller amount of demand per product. Long tail theory says that in any given demand curve, the \"tail\" or unpopular products, when combined, will have a greater amount of demand than the popular products at the \"head.' Here's how this applies to search: _ The above graphic does a good job of visually explaining the concept - popular queries in the head have thousands of queries, while unpopular queries in the \"long tail\" are rarely searched for. However, that \"long tail\" is actually, when taken together, a far greater amount of demand than the few popular queries. This theory seems to be vindicated by statements like those from Udi Manber of Google suggesting that 25% of queries have \"never been seen before.\" Name the three most important elements in the head section of an HTML document that are employed by search engines. Title, Meta Description and Meta Robots are the big 3. Although Meta Robots isn't essential to have, it's certainly able to control spider and search activity. Meta keywords is another common answer, but it would rank as a distant 4th, as our experiments show that none of the major engines will rank a page for a keyword that is listed only in the meta keywords tag. How do search engines treat content inside an IFrame? The engines all interpret content in an embedded IFrame as belonging to a separate document from the page displaying the IFrame content. Thus links and content inside IFrames refer to the page they come from, rather than the page they are placed on. For SEO, one of the biggest implications of this is that links inside an IFrame are interpreted as internal links (coming from the site the IFrame content is on) rather than external links (coming from the site embedding the IFrame). What resource and query can you use to determine which pages link to any page on SEOmoz.org and contain the words \"monkey\" and \"turnip\"? Use Yahoo! and search for linkdomain:seomoz.org monkey turnip. What action does Google threaten against websites that sell links without the use of \"nofollow\"? Google's Matt Cutts has noted that pages and sites caught selling links for manipulative purposes may have their ability to pass PageRank (or other link juice weighting factors) removed. What is the difference between local link popularity and global link popularity? Local link popularity refers to links from sites in a specific topical neighborhood (as identified by algorithms such as Teoma - now used by Ask.com), while global link popularity doesn't discriminate and counts all links from any site on the web. Why is Alexa an inaccurate way to estimate the traffic to a given website? Because SEOmoz is 3X more trafficked than NPR... Seriously, though, the underlying problem is that Alexa receives data from only those users who have the Alexa toolbar installed. As such, the sampling is massively skewed towards webmasters and technology buffs, who are more likely to use the toolbar than the population at large. Name four types of queries for which Google provides \"instant answers\" or \"onebox results\" ahead of the standard web results. Flight searches, such as Seattle to Chicago; recipe searches such as chicken recipes; image searches such as those for Hopper paintings; stock quotes like GE stock quote and many more. Google lists them all on their features page. Of course, they neglected to mention our favorite (and I believe there a few more that aren't covered publicly). Describe why a flat site architecture is typically more advantageous for search engine rankings than a deep site architecture. Flat architectures on websites allow spiders to crawl a large amount of pages without having to spider through many \"clicks\" or different pages to reach those links. A deep site architecture will force bots to crawl to many pages before being able to reach all of the content on a site. Flat site architecture provides three primary bonuses - first, search spiders are more likely to visit all of the content; second, the spiders are more likely to discover and index new content more quickly (as they don't have to visit as many pages to be exposed to new content); third, PageRank and link juice is more effectively passed with fewer pages and more links rather than more pages with fewer links, helping to keep content ranking and out of the (now defunct) supplemental results. BONUS - Name twelve unique metrics search engines are suspected to consider when weighting links and how each affects rankings positively or negatively There are dozens of answers to this question, but some of the most relevant and important would be: Anchor text (when it matches queries, it can have a significant positive impact) Placement on the page (MSN's research here describes how it may influence rankings) PageRank of the linking page (more PR = more good) Trust in the linking domain (more trust = ++) Link structure in HTML (inside an image, javascript, standard a href, etc.) - although Javascript links are sometimes followed, they appear to provide only a fraction of the link weight that normal links grant. Likewise, links from images (and anchor text in the form of alt text) appears to provide somewhat less weight than standard HTML links. Temporal nature of the link (when it appeared, how long it stays on the page for, etc.) - can affect how much weight the link is given and be used to identify patterns that may indicate manipulation Use of nofollow Relevance of page content to linked-to page (more relevant = better) Relevance of site to linked-to page (more relevance = better) Text surrounding the link (as the two above) Previous link relationships between the domains (if the page/site has already linked to the page/site in the past, it may be given less weight and this may also be used to identify and discount reciprocal linking schemes) Hosting relationships (if the domains are hosted on the same IP address, or same c-block of IP addresses, the link may lose some of its weight) Registration relationships (if the domains share registration information, it may be interpreted as less editorial and given less weight) In addition to all this fun, Danny Sullivan, who apparently wanted to test his own SEO knowledge mettle (and mine) shot over another great group of questions to me via email... Please feel free to answer these in the comments (I won't spoil them for you - there's actually two that I didn't know and had to look up!) How do you seize control of a local listing on Google? On Yahoo? What fields can you change? How do you add a picture? What elements are important to ranking well in Google Video and YouTube? How do you get into Google News? In particular, what unique structure do your URLs need to reflect to even be considered? Google Blog Search -- full text or indexing off whatever you put out in feeds? How do you submit to Google Product Search? Yahoo Product Search? Do you have to have a mobile web site to be in Google Mobile? Yaho Mobile? How do you know if Google is personalizing your web results? Thanks, Danny. Enjoy! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Answers to Ten SEO Questions & Some New Questions from Danny Sullivan"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Answers to Ten SEO Questions & Some New Questions from Danny Sullivan"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}