{
  "url": "https://moz.com/blog/anyone-up-for-a-friday-live-seom-chat",
  "slug": "anyone-up-for-a-friday-live-seom-chat",
  "title": "Anyone Up for a Friday Live SEO/M Chat? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "WeeWorld launched their new website yesterday and it's got a cool feature that's virtually unused called \"...",
  "content": "Anyone Up for a Friday Live SEO/M Chat? Public Relations By: Rand Fishkin March 31, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 31, 2006 Anyone Up for a Friday Live SEO/M Chat? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. WeeWorld launched their new website yesterday and it's got a cool feature that's virtually unused called \"WeeChat\". Basically, you create your WeeMee and then you can go and chat live in this room with other WeeMees. I thought it would be cool if we all met up there for 10-15 minutes (or longer) around 2pm PST, 5pm EST. Anyone who can join in, please post below. We can talk about any subject, but some fun stuff to cover might include: What you've noticed from Google's BigDaddy changeover Ask's new faster crawling and better results Paid linking Trends in effective linking The valuation of keyword domain names (they're making a comeback) Politics & Gossip I'd love to see you all there! UPDATE: It was pretty fun, although the limit of 6 people per chat room limited it a bit. We'll have to try something else next time (Matt suggested IRC). Some cool folks joined in - maybe we can do more in the near future. Thanks to everyone who made it! Not sure who the guy w/o pants is, but it's pretty funny. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Anyone Up for a Friday Live SEO/M Chat?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Anyone Up for a Friday Live SEO/M Chat?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}