{
  "url": "https://moz.com/blog/apis-for-datadriven-marketers",
  "slug": "apis-for-datadriven-marketers",
  "title": "APIs for Data-Driven Marketers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Data is everywhere, if you know how to access it. APIs (Application Programming Interfaces) are a powerful tool for data-driven content marketers, and this post is both an overview and mini-directory of the API world.",
  "content": "APIs for Data-Driven Marketers Advanced SEO By: Dr. Peter J. Meyers May 20, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers May 20, 2013 APIs for Data-Driven Marketers Advanced SEO Data is everywhere, and companies are virtually climbing over each other to give it away. If you’re a data-driven content marketer, data is opportunity, but accessing that data can take some technical know-how. This is a guide to APIs, one of the key methods for accessing 3rd-party data, and also a mini-directory of some of the most useful APIs currently available to marketers. What Is an API? Let’s start with the official definition – API stands for “Application Programming Interface”. Sorry, I’m not the one who lets engineers name things. Put simply, an API is a way to let you talk to a 3rd-party application, usually either to retrieve data or update that application. We’re going to focus primarily on the first use (retrieving data), and it looks something like this: The API itself isn’t really a box floating in space, so much as a chunk of code that acts as a gatekeeper. That code helps translate the third party’s data into something you can read, and it makes sure that only authorized users can access the data (a process called “authentication”). Why Should I Care? There are hundreds of applications on the market that collect useful data, and many of them are making that data available for free or very cheaply. You can use that data to do original research, create unique content or even build your own applications. If you’d rather stick to beet farming, well then that’s cool, too. Where Do I Start? Here’s the bad news – APIs are far from standardized, and you’re going to have to understand data structures and write some code. This is not a how-to manual so much as an overview of what’s out there that can help you decide if the world of APIs is right for you. There are some bright spots on the horizon – tools and sites that make programming APIs easier – and I’ll cover some of those at the end. Following is a list of hand-selected APIs (I’ll do my best not to play favorites, and our competitors are on the list), broken down into a few industry categories, and alphabetical within each category. For each API, I’ll provide a main link, a documentation link (documentation can be way too hard to find), a brief description of what’s available in that API, and whether or not there’s a free version. APIs are split into five sections: APIs for SEO APIs for PPC APIs for Social Miscellaneous APIs API Support Tools The last section covers sites and tools that can help you if you're new to APIs, new to programming, or just are hunting for something that's not on this list. (1) APIs for SEO This section contains APIs for organic SEO data, including keyword research and link profiling. Bing Search (Docs) The Bing search API allows you to integrate Bing search results and search data directly into your applications, including web search, images, news, videos, related search, and spelling suggestions. Free Version? YES, but rate-limited. Majestic SEO (Docs) The Majestic API includes a wide range of link metrics, including full back-link lists, discovery dates for links, anchor text, redirection information, and ACRank. Some features are limited to the paid version. Free Version? YES, but limited functionality. Raven Tools (Docs) The Raven Tools API lets customers access and update account and campaign information. It can also be used to access link data from your Raven campaigns. Free Version? NO, paid accounts only. SEOmoz Mozscape (Docs) SEOmoz's API has access to proprietary metrics, including MozRank, Domain Authority, and Page Authority, as well as link metrics such as linking root domains and anchor text data. Free Version? YES, but rate-limited. WordStream Keyword Tool (Docs) WordStream's Keyword Tool API lets you access WordStream's keyword volume metrics, along with related keywords and structured keyword suggestions. Free Version? YES, but rate-limited. (2) APIs for PPC The following APIs provide access to major ad platforms, including Google, Bing, and Facebook. Bing Ads API (Docs) While primarily a campaign management platform, the Bing Ads API does have access to useful data, including keword volume and keyword suggestions/opportunities. Free Version? YES, but authorization required. Facebook Ads API (Docs) The Facebook Ads API provides access to managing Facebook campaigns, as well as statistics about Facebook keyword searches and audience segments. Free Version? YES, but authorization required. Google AdWords API (Docs) Like Bing, the Google AdWords API is mainly for campaign management and building AdWords apps, but it also the only portal to Google keyword volume data. Getting authorized can be a long process. Free Version? YES, but authorization required. SEMRush API (Docs) The SEMRush API has a number of tools for both organic and paid search campaigns, but where it really shines is in competitive analysis, especially for paid search. Free Version? NO, starts at $15/month. (3) APIs for Social These APIs can access a wealth of information from major social networks and social aggregators. Facebook Graph (Docs) Facebook's \"Graph\" API is the primariy interface to building Facebook-based apps, updating Facebook accounts, and accessing Facebook social graph data. There are other, secondary Facebook APIs. Free Version? YES, but rate-limited. FollowerWonk (Docs) FollowerWonk's Social Authority API scores Twitter users on a 1-100 scale, for simple influence scoring and comparisons (Note: FollowerWonk is a part of SEOmoz). Free Version? YES, but rate-limited. Gnip (Docs) Gnip provides an enterprise-level API with \"firehose\" and filtered streams for Twitter, Facebook, Google+, YouTube, and more. Pricing is custom and is aimed at large-scale applications. Free Version? YES, but trial only. Google+ (Docs) The official Google+ API allows you to manage accounts, build apps, and access to data from user profiles, posts, and comments. It includes some limited search capability. Free Version? YES, but rate-limited. Klout (Docs) The Klout API provides access to Klout's aggregate social metrics, including Klout score, influencers, influence graphs, and topics of influence. Free Version? YES, but rate-limited. PeerIndex (Docs) PeerIndex is another social aggregator, and their API provides data on multiple influence metrics, including activity, authority, and audience scores. Free Version? YES, but rate-limited. SharedCount (Docs) The SharedCount API lets you access sharing stats on a number of platforms, including Facebook, Twitter, Google+, Reddit, LinkedIn, Digg, Delicious, StumbleUpon, and Pinterest. Free Version? YES, but rate-limited. Topsy (Docs) The Topsy Otter API is an alternative source for Twitter data, including a number of useful search functions - search by keyword, by links mentioned, by popluar stories on a domain, etc. Free Version? YES, but rate-limited. Twitter (Docs) The official Twitter RESTful API includes many tools for account management and data gathering, including individual tweet and user data, follower stats, and a variety of search options. Free Version? YES, but rate-limited. (4) Miscellaneous APIs Here are some other useful APIs, including Google products, analytics, and text processing. AlchemyAPI (Docs) AlchemyAPI provides a Natural Language Processing engine to perform tasks such as sentiment analysis, named entity extraction, author extraction, and topic categorization. Free Version? YES, but rate-limited. Google Analytics API (Docs) The Google Analytics API is a full-featured system to manage GA accounts and profiles, customize tracking codes, and to access and export analytics data. Free Version? YES, but authorization required. Google Places API (Docs) The Google Places API allows you to access the entire family of Google local data, including Google Maps, Google+ Local, and Google Places search. Free Version? YES, but authorization required. PageSpeed Insights (Docs) PageSpeed Insights is a Google Developer tool for website performance analysis. The PageSpeed API allows access to PageSpeed scores and recommendations. Free Version? YES, but authorization required. Repustate (Docs) The Repustate API provides access to a number of advanced algorithms, including sentiment analysis, social media monitioring, and predictive analytics. Free Version? YES, but rate-limited. (5) API Support Tools If you're new to APIs, this section can help get you started or find APIs outside the scope of this post. CodeAcademy API Track CodeAcademy is a resource for learning programming concepts and languages. The API track has specific online courses designed to help you learn API coding. Free Version? YES. Mashape (Docs) Mashape is an API marketplace that allows you to access over 2,000 APIs from a single account. Mashape also lets you distribute and monetize your own APIs. Free Version? YES, depending on the API. ProgrammableWeb ProgrammableWeb is a directory of over 9,000 APIs on a wide variety of topics. ProgrammableWeb has its own API, that allows you to access their search database. Free Version? YES. SEER Interactive SEO Toolbox (Docs) SEER's all-in-one interactive toolbox lets you access multple APIs via Excel, including Google Analytics, SEOmoz, Majestic, Raven, Twitter, and Klout. Free Version? YES, but rate-limited. SEOGadget Excel API Extensions (Docs) The SEOGadget API extension for Excel allows you to easily call link data from Excel spreadsheets, including SEOmoz, Majestic, and additional SEOGadget data. Free Version? YES, but rate-limited. What Are Your Favorites? While I don't intend this to be an exhaustive list of APIs, I'll try to keep the post up to date with the most useful APIs for marketers (assuming that people are interested). So, feel free to share your favorite data-collection APIs in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "APIs for Data-Driven Marketers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "APIs for Data-Driven Marketers"
    },
    {
      "level": "H2",
      "text": "What Is an API?"
    },
    {
      "level": "H2",
      "text": "Why Should I Care?"
    },
    {
      "level": "H2",
      "text": "Where Do I Start?"
    },
    {
      "level": "H2",
      "text": "(1) APIs for SEO"
    },
    {
      "level": "H3",
      "text": "Bing Search (Docs)"
    },
    {
      "level": "H3",
      "text": "Majestic SEO (Docs)"
    },
    {
      "level": "H3",
      "text": "Raven Tools (Docs)"
    },
    {
      "level": "H3",
      "text": "SEOmoz Mozscape (Docs)"
    },
    {
      "level": "H3",
      "text": "WordStream Keyword Tool (Docs)"
    },
    {
      "level": "H2",
      "text": "(2) APIs for PPC"
    },
    {
      "level": "H3",
      "text": "Bing Ads API (Docs)"
    },
    {
      "level": "H3",
      "text": "Facebook Ads API (Docs)"
    },
    {
      "level": "H3",
      "text": "Google AdWords API (Docs)"
    },
    {
      "level": "H3",
      "text": "SEMRush API (Docs)"
    },
    {
      "level": "H2",
      "text": "(3) APIs for Social"
    },
    {
      "level": "H3",
      "text": "Facebook Graph (Docs)"
    },
    {
      "level": "H3",
      "text": "FollowerWonk (Docs)"
    },
    {
      "level": "H3",
      "text": "Gnip (Docs)"
    },
    {
      "level": "H3",
      "text": "Google+ (Docs)"
    },
    {
      "level": "H3",
      "text": "Klout (Docs)"
    },
    {
      "level": "H3",
      "text": "PeerIndex (Docs)"
    },
    {
      "level": "H3",
      "text": "SharedCount (Docs)"
    },
    {
      "level": "H3",
      "text": "Topsy (Docs)"
    },
    {
      "level": "H3",
      "text": "Twitter (Docs)"
    },
    {
      "level": "H2",
      "text": "(4) Miscellaneous APIs"
    },
    {
      "level": "H3",
      "text": "AlchemyAPI (Docs)"
    },
    {
      "level": "H3",
      "text": "Google Analytics API (Docs)"
    },
    {
      "level": "H3",
      "text": "Google Places API (Docs)"
    },
    {
      "level": "H3",
      "text": "PageSpeed Insights (Docs)"
    },
    {
      "level": "H3",
      "text": "Repustate (Docs)"
    },
    {
      "level": "H2",
      "text": "(5) API Support Tools"
    },
    {
      "level": "H3",
      "text": "CodeAcademy API Track"
    },
    {
      "level": "H3",
      "text": "Mashape (Docs)"
    },
    {
      "level": "H3",
      "text": "ProgrammableWeb"
    },
    {
      "level": "H3",
      "text": "SEER Interactive SEO Toolbox (Docs)"
    },
    {
      "level": "H3",
      "text": "SEOGadget Excel API Extensions (Docs)"
    },
    {
      "level": "H2",
      "text": "What Are Your Favorites?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}