{
  "url": "https://moz.com/blog/app-search-whiteboard-friday",
  "slug": "app-search-whiteboard-friday",
  "title": "All About App Search: Indexing, Ranking Factors, Universal Links, and More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "App search is growing and changing, and there's more opportunity than ever to both draw customers in at the top of the funnel and retain them at the bottom. In today's special British Whiteboard Friday, Tom Anthony and Will Critchlow of Distilled dig into everything app search and highlight a…",
  "content": "All About App Search: Indexing, Ranking Factors, Universal Links, and More Mobile SEO | Whiteboard Friday By: Tom Anthony May 20, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Anthony May 20, 2016 All About App Search: Indexing, Ranking Factors, Universal Links, and More Mobile SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 10 minutes] App search is growing and changing, and there's more opportunity than ever to both draw customers in at the top of the funnel and retain them at the bottom. In today's special British Whiteboard Friday, Tom Anthony and Will Critchlow of Distilled dig into everything app search and highlight a future where Google may have some competition as the search engine giant. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Tom: Howdy, and welcome to another British Whiteboard Friday. I'm Tom Anthony, head of the R&D Department here at Distilled. This is Will Critchlow, founder and CEO. Today we're going to be talking about app search. App search is really, really important at the moment because research shows that the average user is spending 85% of their time in apps on their mobile phone. Will, tell us a bit about app search. Will: When we say \"app search,\" we could potentially mean three things. The first is App Store Optimization or ASO, which is not what we're going to be talking about today. It's an important area, and it's got its own quirks and intricacies, but it's pretty far down the funnel. Most of the searches in app stores are either branded or high-level category searches. What we want to spend more of our time on today is... App indexing This is right at the top of the funnel typically, and it's taking over the opportunities to rank in long-tail search. So this gives you the opportunity to acquire new users via search really for the first time in app marketing. The third element that we'll touch on later is the personal corpus, which is the idea right down at the bottom of the funnel and it's about retaining the users once you have them. The critical thing is app indexing. That's what we want to spend most of our time on. What are the basics, Tom? What are the prerequisites for app indexing? Tom: The first thing, the most important thing to understand is deep links. Tom: People sometimes struggle to understand deep links, but it's a very simple concept. It's the parallel of what a normal URL is for a web page. A URL takes you to a specific web page rather than a website. Deep links allow you to open a specific screen in an app. So you might click a deep link. It's just a form of a URL. It might be on a web page. It might be in another app. It can open you to a specific point in an app, for example the @Distilled page in the Twitter app. There's been various competing standards for how deep links should work on different platforms. But what's important to understand is that everyone is converging on one format. So don't bother trying to learn all the intricacies of it. The important format is what we call universal links. Will, tell us a bit about them. Will: Universal links — this is actually Apple's terminology, but it is, as Tom said, spreading everywhere — which is the idea that you can take a URL just like we use to a regular HTTP or HTTPS URL and this URL would normally open up the web page on the desktop. Will: Now if instead we were on a mobile device — and we've brought our mobile whiteboard again to demonstrate this concept — then if you clicked on this same link on your mobile device, same URL, it would open up the deep view within the app like Tom mentioned. So the critical thing about the universal link is that the form of this link is the same, and it's shared across those different devices and platforms. Now before that was the case, in the world where we had different kinds of links, different kinds of link formats for the different devices and platforms, it was important that we mapped our web pages to those mobile URLs. There were various ways of doing that. So you could use Schema.org markup on your web pages. You could use JSON-LD. You could match them all up in your robots.txt. Or you could use rel=\"alternate\" links. Tom: This is much like how you would've done the same thing for the mobile version of a desktop web page. Will: Right. Yeah, if you had a different mobile website, an m-dot website for example, you would use rel=\"alternate\" to match those two together. In the old world of deep links, where there were the application-specific links, you could use this rel=\"alternate\" to map them together. If you're using universal links, it's not so much about this mapping anymore. It's not about saying it's over there. But it's about advertising the fact that there is an app, that you have an app that can open this particular view or web page. That's kind of important obviously to get that indexed and to get that app ranking. Tom: Google and Co. are encouraging you to have parity at the moment between your app. So you've got your desktop site, your mobile site, and then you've got the same screen in the mobile application. Will: Absolutely, and they'd like that all to be on these universal URLs. Now all of this so far is pretty familiar to us as search marketers. We understand the concept of having these URLs, having them crawled, having them indexed. But in the app world there's more opportunity than just crawling because both Google and Apple on iOS have opened up APIs, which means that you can push information to the search engine about how the app is actually being used, which opens up all kinds of interesting possibilities. Tom: Absolutely. The first one is new types of ranking factor, the big one being engagement. Apple have already confirmed that they're going to use engagement as a ranking factor. We anticipate that Google will do the same thing. This is the idea that users opening your app, using your app, spending time in your app is a clue of the value of that app. So it's more likely to appear in search results. There are two layers to this. The first is appearing in personalized search results. If I use a specific app a lot, then I'll expect to see that more. Then, there's the second level, which is the aggregated user statistics, which is where they see that most people like this app for this thing, so other people will see that in the search results. The second point is taking us back to what Will mentioned at the start. The personal corpus This is the idea where you get search results specific to yourself coming from your data. So you might run a search and you'll see things such as your messages, entries in your calendar, photos from your gallery. I'd see different results to Will, and I'd see them all in the same interface as where I'd see the public search results. So I might do a search for a restaurant. I might see a link to the restaurant's website in the public search results, but I might also see that Will sent me a message about going for dinner at that restaurant, and there might be an entry in my calendar, which other people wouldn't see. It's a really interesting way that we might start to appear in search results in a new format. Then the third interesting thing here is the idea of app-only indexing. With universal links, we talked about needing parity between the desktop site, the mobile site, the app. With app-only indexing, we could be looking at a model where there are screens in apps that don't have a web equivalent. So you might start to see search results where there's no possibility of a website actually appearing for that. That's also a fascinating new model. Apple already do this. Google have confirmed that they're going to be doing this. So it's definitely coming. Then further out into the future one of the important things is going to be app streaming. So Will, are you going to tell us a bit about that? Will: Right. App streaming, this is another thing that Google has announced. It's kind of available in limited trials, but we think it's going to be a bigger thing because they're trying to attack this core problem, which is that to use an app and for an app to appear in search results, if you haven't already got it, you have to download it and you have to install it. That's both a slow process and a data-hungry process. If you're just kicking the tires, if this is an app you've never seen before, it's a little bit too much to ask you to do this multi-megabyte download and then install this app, just to try it out. So what they're trying with app streaming is saying, \"We can simplify that process. This is an app you've not used before. Let's preview it for you.\" So you can use it. You can see it. You can certainly check out the public areas of the app and then install it if it's useful to you. The current setup is a little bit of a kind of a kludge; they're running in a virtual machine in the cloud and streaming. It's all very weird. We think the details are going to change. Tom: Yeah. Will: Fundamentally, they're going to figure out a way to make this streamlined and smooth, and it will become much easier to use apps for the first time, making it possible to expose them in a much broader array of search results. Then there's all kinds of other things and stuff coming in the future. I mean, Tom's passionate about the personal assistant. Tom: Yeah. The intelligent personal assistant thing is really, really exciting to me. By intelligent personal assistant, I mean things like Siri, Cortana, Google Now, and the up-and-coming ones — Facebook M and SoundHound's Hound app. What's fascinating about personal assistants is that when you do a search, you do a search for weather in Siri for example, you just get a card about the weather for where you are. You don't get taken to a list of results and taken elsewhere. You just get a direct answer. Most of the personal assistants are already able to answer a lot of search queries using this direct answer methodology. But what we think is exciting about apps is that we anticipate a future where you can store an app and it allows the personal assistants to tap into that app's data to answer queries directly. So you can imagine I could do a search for \"are the trains running on time.\" Siri taps into my train app, pulls that data, and just lets me know right there. So no longer am I opening the app. What's important is the app is actually sort of a gateway through to a data source in the backend. We start to get all this data pulled into a central place. Will: It's fascinating. You mentioned a whole bunch of different tools, companies, platforms coming up there. The final thing that we want to point out is that this is a really interesting space because Google's had a lock on web search for what feels like forever. App search is a whole new area. Obviously, Google has some advantages just through the fact that the Android devices and they've got the apps installed in so many places and it's part of people's habits. But there are certainly opportunities. It's the first crack. It's first chink in the armor that means that maybe there are some upcoming players who will be interesting to watch and interesting for us as marketers to pay attention to. Thank you for joining us here in Distilled's London HQ. It's been great talking to you. Thank you for taking the time. Bye. Tom: Bye. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "All About App Search: Indexing, Ranking Factors, Universal Links, and More"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "All About App Search: Indexing, Ranking Factors, Universal Links, and More"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "App indexing"
    },
    {
      "level": "H2",
      "text": "The personal corpus"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Anthony\n          \n            Tom Anthony\n          \n            Tom Anthony"
}