{
  "url": "https://moz.com/blog/applying-atul-gawandes-checklist-manifesto-to-seo",
  "slug": "applying-atul-gawandes-checklist-manifesto-to-seo",
  "title": "Applying Atul Gawande's Checklist Manifesto to SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post was inspired by Rand. If I'm honest, I'm not sure how many of my posts aren't inspired by Rand... Specifically however it was this tweet which set the wheels in motion (if ever so slowly):\n\n\n\nThe link that Rand twittered was ...",
  "content": "Applying Atul Gawande's Checklist Manifesto to SEO Marketing Industry T By: Tom Critchlow February 21, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow February 21, 2010 Applying Atul Gawande's Checklist Manifesto to SEO Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post was inspired by Rand. If I'm honest, I'm not sure how many of my posts aren't inspired by Rand... Specifically however it was this tweet which set the wheels in motion (if ever so slowly): The link that Rand twittered was this one to the Financial Times. It's a story about checklists. Yeah, *yawn* right? Well not quite - you see these checklists, used by all kinds of people from pilots to doctors, have The book’s main point is simple: no matter how expert you may be, well-designed check lists can improve outcomes - freakonomics been shown to increase safety, save lives and make millions. Atul Gawande is a surgeon and has worked hard to get checklists implemented in the medical profession to help save lives. He's written a book about these checklists called The Checklist Manifesto (Amazon.com or Amazon.co.uk). If you want to read more about these fascinating checklists and their incredible power I suggest you check out the FT link above or click here to read this New Yorker article written by Atul Gawande himself. Also, be sure to check out a sample from one of the medical checklists. That said, this is the internet age - why should we be forced to read anything at all when we can instead get all the knowledge we need through a short and catch video clip? Well, here's the short and catchy video clip of John Stewart's interview with Atul Gawande on The Daily Show (sorry, only available to US viewers I'm afraid - c'mon guys get your act together. I can watch the show in the UK, why can't I watch clips online from the UK?): The Daily Show With Jon Stewart Mon - Thurs 11p / 10c Atul Gawande www.thedailyshow.com Daily Show Full Episodes Political Humor Health Care Crisis As you have probably guessed by now, I was inspired by all of this to apply some of this checklist theory to our SEO projects. The main idea being that while we all know what to do - sometimes we forget to do some of the basics and by having a simple checklist at hand we can make sure we don't miss anything out. There are obviously lots of different areas of SEO that this would apply to (and other areas - I think it'd work great for PPC) but I've chosen to focus on new projects. Below is a checklist that I am in the process of implementing at Distilled for any new SEO project which comes on board. I anticipate that it's still useful for in-house folks too when launching a new site or project. I welcome your feedback and thoughts on this work in progress! SEO Project Kickoff Checklist Is billing set up? - This is useful to ensure that not only is the client in the system and set up for billing but that the project has actually transitioned from sales to operations. It's also essential to check here that the SEO team knows how much the client is paying. Is the project in the project management system? - This is a no-brainer (like all the things on the list!) but useful to ensure that you can keep track of the project. In addition it's important to ensure client contact details are stored there. Introduce all team members - Ensure anyone within the company who's working with this client has sat down and knows what everyone else is doing. This is especially important if the client is paying for multiple services such as PPC, Web Development, SEO etc. Do you know which URL you're working on? - Often you'll start work for a company but that business may own many different sections and URLs. Which one are you working on? What is a conversion? - Whether goal tracking is set up or not in analytics it's crucial to understand what a conversion is and how much that conversion is worth to the business. Do you have access to analytics & webmaster central? - SEO without data is like the winter olympics without snow. Ensure you have access to the data from the very start. Check for irregularities - validating analytics data can be a complete piece of work sometimes, that's not what I mean here. What I mean here is just a quick sense-check that the site ranks for it's own name, that analytics data vaguely ties up with rankings, PPC traffic isn't appearing in analytics as organic etc. Benchmark current data - The three data points I think it's useful to benchmark (that you can't go back and check later) are: 1) Link metrics (my favourite are DA and PA) - it's useful to store a copy of linkscape somewhere too, 2) A count of indexed pages (yes, I know this is sometimes wildly inaccurate but it's still worth noting down), 3) A snapshot of rankings for the top 20 keyphrases (full rank tracking/analysis can be set up later in the project). Has a kickoff meeting with the client been scheduled? - And does the client know who their contact is within the SEO team. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Applying Atul Gawande's Checklist Manifesto to SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Applying Atul Gawande's Checklist Manifesto to SEO"
    },
    {
      "level": "H2",
      "text": "SEO Project Kickoff Checklist"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}