{
  "url": "https://moz.com/blog/approaching-the-end-of-the-pagerank-era",
  "slug": "approaching-the-end-of-the-pagerank-era",
  "title": "Approaching the End of the PageRank Era - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Even a great technological innovation like PageRank will eventually be supplanted. For a web information retreival model, PR has already had a remarkable long life, yet its downfall has been predicted across the web by some of the very best in the industry. Here'...",
  "content": "Approaching the End of the PageRank Era Search Engines By: Rand Fishkin February 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 15, 2005 Approaching the End of the PageRank Era Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Even a great technological innovation like PageRank will eventually be supplanted. For a web information retreival model, PR has already had a remarkable long life, yet its downfall has been predicted across the web by some of the very best in the industry. Here's a short list: Does Google still use PageRank Algorithm? - from SEW Forums New Versions of PageRank Employing Alternative Web Document Models - Research paper from Mike Thelwall & Liwen Vaughn How to Fix PageRank - from Threadwatch As a global popularity model, PageRank also has some inherit flaws. PageRank is ignorant of the temporal nature of the web and links, favoring old content rather than updated or new information. PageRank also uses a flawed 'random walk' theory, which does not take into account the purposeful nature of a typical web session. Lastly, PR doesn't account in any way for the manipulation or commercial interest aspect of the web, and thus ignores the global popularity spam that prompted Google to show PR updates on a quarterly basis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Approaching the End of the PageRank Era"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Approaching the End of the PageRank Era"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}