{
  "url": "https://moz.com/blog/are-we-doling-out-bad-advice",
  "slug": "are-we-doling-out-bad-advice",
  "title": "Are We Doling Out Bad Advice? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Aaron had a brilliant post yesterday on on Bad Advice that Sounds Good. He noted a few \"white lies\" of the SEO world that we continue to perpetuate. I agree with some of them wholeheartedly:\n\nCreate quality content. Why do I hate it? If you don't hav...",
  "content": "Are We Doling Out Bad Advice? Public Relations By: Rand Fishkin November 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 28, 2006 Are We Doling Out Bad Advice? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Aaron had a brilliant post yesterday on on Bad Advice that Sounds Good. He noted a few \"white lies\" of the SEO world that we continue to perpetuate. I agree with some of them wholeheartedly: Create quality content. Why do I hate it? If you don't have much brand recognition higher quallity content will lose out to average content. Most people never talk about the social aspects of the web when saying to create quality content. Create your website for users, not for search engines. Why do I hate it? Search is marginalizing many publishing business models. To pay for the costs of creating linkworthy content it makes sense to add a significant amount of lower cost highly monetized filler to a website. I also want to add a few that I've found: Anybody can be a bloggerIt's just not true - you have to be able to connect with an audience, write consistently interesting material, dedicate time in the beginning to the craft, despite the fact that no one's reading and find ways to make yourself stand out from the hundreds or thousands of other bloggers in your field. Don't plagiarizeObviously, I wouldn't recommend that you steal content, but being succesful on the web is often about re-purposing ideas for content, technology, value, capitalization, branding, advertising and everything else that falls under the umbrella of web marketing. Steal an idea, improve it and make it appeal to an audience likely to link to it - you don't have to work hard, just smart. Making money in SEO is easyYeah, the salaries are fairly good in the established tech hubs of the US, and the consulting gigs can be very lucrative provided you have a reputation. For basement-SEO-types, affiliate revenue is still strong and MFA sites can earn a return, but all of this requires deep knowledge, insight and the will to work through the ugly times to get ahead. It seems like a cakewalk because there are some very smart, somewhat lazy folks making a great living, but to compete with them, you need the years of experience + trial and error to know where to expend the minimum effort for maximum return. I have little doubt that SEOmoz has given out some bad advice over the years, either directly or through unclear references and it will always be something we have to work on. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Are We Doling Out Bad Advice?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Are We Doling Out Bad Advice?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}