{
  "url": "https://moz.com/blog/are-your-seo-resolutions-actionable",
  "slug": "are-your-seo-resolutions-actionable",
  "title": "Actionable SEO Resolutions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's that time of year again; the one where we look back on everything we ate during the last two weeks and promise not to do it again in the new year. It's also the time that many of us set new and ambitious goals for our businesses and clients. Unfortunately, while goals are important and…",
  "content": "Are Your SEO Resolutions Actionable? SEO Basics By: Dr. Peter J. Meyers January 4, 2010 Table of Contents Copied! By: Dr. Peter J. Meyers January 4, 2010 Are Your SEO Resolutions Actionable? SEO Basics It's that time of year again; the one where we look back on everything we ate during the last two weeks and promise not to do it again in the new year. It's also the time that many of us set new and ambitious goals for our businesses. Unfortunately, while goals are important and ambition can be admirable, we make the same mistake with our professional resolutions that we do with our personal resolutions. Take the classic weight-loss resolution. The problem with saying that you're going to lose 20 lbs. in 2010 is simple – it's just not actionable. At the end of the year, you'll either have lost 20 lbs. or not, but that outcome is affected by dozens of things beyond your control. What exactly are you going to do to make it happen? If the answer is wait around and wish for the pounds to melt away, best of luck. Uncontrollable SEO Resolutions Similarly, our SEO goals are too often beyond our control. If you set a goal like \"Rank #1 for Keyword X\" (a very common SEO resolution, I'm sure), what does that actually mean in terms of action? Are you going to pray to the Google Gods every morning and say 50 Hail Matts to purge your SEO sins (my apologies to our Catholic readers)? If you're worth your salt as an SEO, you have actions in mind that you plan to take, so why not resolve to take those actions in a measurable way? It's fine to have ranking (or weekly searches, CTR, CPC, conversion rate, etc.) as an ultimate objective, but wishing won't make it happen. Actionable SEO Resolutions Before this starts to read like a self-improvement seminar, let’s look at some SEO resolutions that are actionable. These are goals that you can directly control – you're in charge of whether or not you accomplish them. I'll break them up into two groups: (1) On-page SEO, and (2) Link-building (with some social networking thrown in). Of course, not every idea is appropriate to every situation – these are just ideas for actionable goals (substitute an appropriate number for \"X\"). (1) On-page SEO Goals Rewrite X page TITLEs Write X unique META descriptions Create an XML site map Create a custom 404 page Canonicalize problem URLs 301-redirect X broken URLs Remove X low-quality internal links Create a new [cleaner] master CSS (2) Link-building Goals Find X promising link prospects Send X personalized link requests Dig into analytics and find X hot topics Create X pieces of new content/month Write an e-book or comprehensive guide Spend X minutes/day building up a social profile Comment [thoughtfully] on X industry blogs/day Re-tweet X pieces of great content/day What Are Your Resolutions? Of course, these are just a few ideas. Let me open it up to the community – what kind of actionable SEO resolutions have you made for 2010? What can you do that will really kick-start your efforts and make you look like a miracle worker to your clients? Photo licensed from iStockPhoto.com (Created by Chris Lamphear). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Are Your SEO Resolutions Actionable?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Are Your SEO Resolutions Actionable?"
    },
    {
      "level": "H2",
      "text": "Uncontrollable SEO Resolutions"
    },
    {
      "level": "H2",
      "text": "Actionable SEO Resolutions"
    },
    {
      "level": "H2",
      "text": "What Are Your Resolutions?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}