{
  "url": "https://moz.com/blog/are-coworking-offices-eligible-for-google-my-business-listings",
  "slug": "are-coworking-offices-eligible-for-google-my-business-listings",
  "title": "Are Coworking Offices Eligible for Google My Business Listings? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The question on everyone's mind: Are coworking spaces eligible for GMB listings? Learn the answer to this and other important local SEO considerations when your main place of business is a shared coworking space.",
  "content": "Are Coworking Offices Eligible for Google My Business Listings? Local SEO By: Miriam Ellis June 14, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 14, 2016 Are Coworking Offices Eligible for Google My Business Listings? Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 7 minutes] Coworking office spaces have existed for more than a decade around the globe, and I consider it a testament to their growing popularity for start-ups and agencies that I’ve been seeing an increasing number of questions about them in recent times at places like the Moz Q&A forum and elsewhere. The burning question on everybody’s mind is: do coworking locations meet or fall afoul of the official Guidelines for Representing Your Business On Google? This article attempts to provide the most thorough possible answer to this important question. Image courtesy of Manuel Schmalstieg on Flickr Google isn’t always completely transparent in their guidelines, so I went for the next best thing. In researching this topic, I communicated with Google My Business Community forum Top Contributor, Colan Nielsen, and want to thank him for conferring about best practices with me. Virtual vs. coworking offices Let’s sync up with a couple of quick definitions. A virtual office offers a mailing address that is not physically occupied by the purchaser. This address is generally not a P.O. box. It typically offers some means of communication via a receptionist, call center and/or voicemail. A virtual office may sometimes offer rental of conference rooms. Virtual offices fail to meet Google guidelines, including: Make sure that your page is created at your actual, real-world location. Provide a phone number that connects to your individual business location as directly as possible. Provide your regular customer-facing hours of operation. If your business rents a temporary, \"virtual\" office at a different address from your primary business, do not create a page for that location unless it is staffed during your normal business hours. A coworking office is a space physically occupied by practitioners during stated business hours. In addition to providing desks, rooms, suites, phone booths, and other amenities, coworking spaces often promote collaboration between tenants and offer educational and social events. Many do feature a central reception desk, but participants should carefully weigh whether using such phone numbers is a wise decision. Properly utilized coworking spaces can be eligible for Google My Business inclusion. 10 tips for coworking local SEO success Image courtesy of IsaacMao on Flickr Over the past ten years, coworking spaces have popped up in cities around the world. They can be a good solution for: Startups with limited funding Sole proprietors who don’t like the quiet of working in isolation Home-based business owners who do not want to list their home addresses on the web Workers in rural areas in need of stable WiFi Professionals who consistently require office space but who can’t yet pay rent for a full, dedicated building Individuals looking for particular amenities, such as an address in a desirable location, a green environment (offered by some coworking spaces), or networking opportunities with other coworkers If your business or your agency’s clients are researching whether a coworking space will help or hinder your local search marketing efforts, be sure any space you consider meets these requirements: 1.) You must physically occupy the space. Any other scenario revokes eligibility. 2.) You must be able to receive postal mail at the coworking space or you won’t be able to receive your Google My Business verification postcard. 3.) Many coworking spaces have a central receptionist who takes calls and messages. You will be better off listing your own phone number on your website and citations, instead — a number that connects directly to you. It’s fine if it’s a cell phone. Invest in a dedicated line for your business and always answer that phone with your business name in greeting. Your clients (and Google) want to know they’ve reached your business if/when they call. 4.) Your Google My Business listing hours of operation must accurately reflect the hours that you are actually at the office. 5.) If you rarely or never meet with clients at the office, but mainly go from the coworking space to meet them at their locations, your business model is a service area business (SAB) and should hide its address in the Google My Business dashboard to be Google guideline-compliant. 6.) If you do not accept walk-in traffic but meet clients by appointment only, again, you should hide your Google My Business address. 7.) Do not generate fake suite numbers. Unless you have been assigned a permanent, dedicated suite number in the office, simply list the main office address on your website and all citations. Concerned about citation consistency? Do a quick lookup with a tool like Check Listing to be sure you aren’t publishing variants of the address around the web. 8.) Even if you occupy different rooms at different times in the coworking space, do not be tempted to create a Google My Business listing for each of them. Create just one listing. 9.) Do not create multiple Google My Business listings for the difference services or goods you offer. You are just one business and are eligible for just one listing. 10.) Local SEO agencies serving clients who use coworking spaces must advise them of the risks and be prepared to act if there's an accidental GMB listing takedown. The risks A business that is staffed during stated business hours, has a dedicated phone number, and, where appropriate, is adhering to Google’s SAB guidelines, should pass Google muster. That being said, a small amount of risk exists in the coworking situation for these two reasons: Accidental merging In the past, Google experienced major issues with merging listings with similar details that were at the same or similar addresses. Google appears to have become increasingly sophisticated in parsing out one business from another at a shared location, but merges do still occur. Should your business or clients experience a merge, first check for shared details apart from the address. A shared phone number appears to be the biggest risk factor, but shared Google categories between one business at a coworking space and a completely different business in the same building would be something to investigate as well. Make the details as you unique as you can and then get on the phone with Google to ask them to help you separate the listings. Industry history Coworking spaces are popular with tech start-ups. Unfortunately, SEO and design firms in particular have not always had an easy relationship with Google. In fact, for many years, Google excluded these industries from their local results. It’s believed that this may have been partly owing to Google’s determination that most businesses in these industries operate virtually rather than face-to-face with clients, but Google’s decision may also have been influenced by a high level of spam. Like the locksmith and auto dealership industries, tech industry companies may experience extra Google scrutiny, and a large cluster of business listings associated with a single address could potentially raise a red flag. Google could wrongly determine that a listing pertains to a virtual office rather than a staffed coworking space. If you suspect that a listing takedown has resulted from a mistake like this, your best bet is to fully explain your case on the Google My Business Community forum and ask the Top Contributors there to help. Given these two provisos, owners and marketers promoting coworking locations should be vigilant in regularly checking up on their Google My Business listings to be sure that nothing has been merged or removed and that no strange ranking drops have suddenly occurred. Google, the real world, and your business Image courtesy of Jodimichelle on Flickr Google’s rate of innovation has been breathtaking over the past two decades, and in local SEO, the pace of change has sometimes been particularly dizzying. One of the challenges I’ve encountered most in the midst of this continual technological commotion relates to Google not always accurately reflecting real-world business scenarios. One example of this would be the many years it took them to offer a support phone number to the millions of business owners whose bottom lines and very existences were being directly impacted by Google’s local pack results. Another would be Google’s historic treatment of service-area businesses as something of an afterthought rather than a core component of local commerce. Right now in the real world, economists say that the real rate of unemployment/underemployment in the United States is about 10%, while commercial real estate costs and rental pricing continue to skyrocket, driving would-be entrepreneurs to seek out affordable solutions to jump starting new businesses. Fortunately, this is a case in which Google appears to be keeping up with the times, allowing guideline-compliant coworking companies to be included in the local packs. To these bright new innovators who are working hard to contribute to their local communities, I’m wishing the best of success! Coworking spaces are a good fit for many local business owners on the way up, and if you’re coworking, our community would love to hear about your experiences and tips in the comments. Header image courtesy of Manuel Schmalstieg on Flickr. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Are Coworking Offices Eligible for Google My Business Listings?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Are Coworking Offices Eligible for Google My Business Listings?"
    },
    {
      "level": "H2",
      "text": "Virtual vs. coworking offices"
    },
    {
      "level": "H2",
      "text": "10 tips for coworking local SEO success"
    },
    {
      "level": "H2",
      "text": "The risks"
    },
    {
      "level": "H3",
      "text": "Accidental merging"
    },
    {
      "level": "H3",
      "text": "Industry history"
    },
    {
      "level": "H2",
      "text": "Google, the real world, and your business"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}