{
  "url": "https://moz.com/blog/are-you-a-pc-or-a-mac",
  "slug": "are-you-a-pc-or-a-mac",
  "title": "Are You a PC or a Mac? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have a DVR, so typically nothing comes between me and my stories (seriously, have you seen Lost this season? Waaaaaalt!), especially commercials. I typically watch shows on a delay and fast-forward through the annoying onslaught of advertisements. Lately, though, I'm a bit ashamed to say that…",
  "content": "Are You a PC or a Mac? Online Advertising By: Rebecca Kelley May 12, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 12, 2006 Are You a PC or a Mac? Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I have a DVR, so typically nothing comes between me and my stories (seriously, have you seen Lost this season? Waaaaaalt!), especially commercials. I typically watch shows on a delay and fast-forward through the annoying onslaught of advertisements. Lately, though, I'm a bit ashamed to say that I've actually been rewinding the DVR to catch the new Mac commercials. If you haven't seen them, they're a series of commercials featuring a \"PC\" (a middle-aged fuddy duddy dressed in a drab, stuffy suit) and a \"Mac\" (a laid-back, 20-something guy who looks like you'd totally want to hang out with him because he's so super cool). The general consensus at the SEOmoz headquarters is a resounding thumbs up for the ads. They're clever, creative, and funny, not to mention that it's pretty apparent who Mac seems to be targeting (translation: PCs are for geezers, dude! Get with the times!). In the age of DVRs and downloadable content, it's especially difficult nowadays for companies to create advertisements that are so different and noticeable that people will actually stop and pay attention to them. Kudos to you, Mac, for capturing this ADD-riddled blogger's attention. Check out the ads here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Are You a PC or a Mac?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Are You a PC or a Mac?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}