{
  "url": "https://moz.com/blog/are-word-limits-in-the-google-keyword-tool-affecting-the-long-tail-in-your-seo-keyword-research",
  "slug": "are-word-limits-in-the-google-keyword-tool-affecting-the-long-tail-in-your-seo-keyword-research",
  "title": "Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Chances are - if you visit SEOmoz on a regular basis - you already know the importance of keywords, choosing your keywords correctly and therefore that keyword research is one of the most important areas behind a successful SEO strategy.\nThe Google AdWords Keyword Tool is probably the i...",
  "content": "Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research? Keyword Research By: Steve Morgan August 16, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Steve Morgan August 16, 2011 Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research? Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Chances are - if you visit SEOmoz on a regular basis - you already know the importance of keywords, choosing your keywords correctly and therefore that keyword research is one of the most important areas behind a successful SEO strategy. The Google AdWords Keyword Tool is probably the industry standard way to assess which keywords to chase for SEO purposes. There are other alternatives, but it's free and it's Google giving data on Google. It may not be perfect, with its numbers sometimes not lining up with actual impressions (based on ads in AdWords showing 100% of the time) as well as different results whether you're logged in or not, but as a rough indicator and a guide, it is a good starting point and foundation for an SEO campaign. The Keyword Tool word limit However, another issue with it that I've discovered is that there seems to be a word limit - at least this seems to be the case with the current version. The results are affected like so: If you enter a one-word phrase, you will only be shown search terms of up to 3 words in length, If you enter a two-word phrase, you will only be shown search terms of up to 6 words in length. This seems to be the case regardless of whether: The \"Only show ideas closely related to my search terms\" box (below the main search box) is ticked or not, There are less than the maximum of 800 possible search terms, You're logged in or not. What this means If you type in \"seo\" and tick the \"Only show ideas...\" box, you may assume that you will see all suggestions containing the word \"seo,\" unless there are more than the maximum of 800, of course. If there are more than 800, which 800 does it show you? It's not necessarily the 800 keywords with the highest search volume (eliminating those that receive less searches), nor some randomly-generated mixture of head terms and long tail. Instead, if it's a search for just one phrase that itself is just one word in length (like \"seo\") then it looks like you will be shown the top 800 keywords in terms of search volume but only those that are no longer than three words in length. Try it yourself. Staying with the \"seo\" example, from the top few head terms... Examples: seo company uk (5,400 Local Monthly Searches (UK) on [Exact]) seo services uk (4,400) seo company London (1,900) ...All the way down to the low-performing long tail... Examples: help with seo (22 Local Monthly Searches (UK) on [Exact]) best seo consultant (16) articles for seo (12) ...The suggestions are all one, two or tree words long. There are absolutely no results containing four words or more, no matter how far you drill down. In order to get the likes of \"seo services in uk\" or \"best seo company uk\" (both of which have UK search volumes in the 100s on exact match), you would have to include a second word in your search - \"seo services\" or \"seo company,\" respectively - in order to flesh them out and get them listed. To give another example: typing in \"search engine optimisation\" will suggest \"search engine optimisation seo.\" Typing in just \"seo\" will not, because a 3-word search will show a 4-word suggestion, whilst a 1-word search will not display it (as that would only show phrases of up to 3 words). Why it's a big deal By limiting the number of words in search suggestions, you are effectively losing out on some potentially big search terms, unless you go to the effort of trying lots of different variations and types. A seasoned SEO will know that it's worth doing this anyway, especially if the extra effort results in finding a less competitive search term, but there's still the risk that a particular \"keyword area\" could be overlooked entirely, and with it an opportunity missed. It's not just the one-word queries where it's a risk. An important keyword in the UK car insurance market is a mighty seven words long: \"cheap car insurance for young female drivers\" (1,000 Local Monthly Searches (UK) on [Exact]). Even a search for keywords related to \"car insurance\" would skip it out, only showing suggestions that are up to 6 words long. This could be a big opportunity for the websites fighting it out in the highly-competitive car insurance SERPs, which could have been missed if only results relating to \"car insurance\" were considered, assuming that all car insurance-related phrases - long or small - will be picked up in the results. Keyword research for markets, products and services that typically contain multiple words should be fine, but be wary of: Acronyms and abbreviations (e.g. \"seo,\" \"ppc\"), 1-word brand/company names that may have long tail searches (e.g. people may search for a \"dell\" laptop by its product type, model number, screen size, colour, etc: \"compare dell inspiron q15r 15.6 laptop black\" = seven words), Very, very broad one-word searches (e.g. \"shoes,\" \"insurance\"). If you are conducting keyword research using the Google Keyword Tool for any of the above types or pretty much anything that stems from one or two words, then to be on the safe side and to cover as many bases as possible, make sure to include a few extra words to accompany your 1- or 2-word phrase, either on separate lines in the search box, or as separate, individual searches entirely. It may take longer; it may be a hassle... But it may also bring up the perfect keyword, which would otherwise have been missed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research?"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Steve Morgan\n          \n            Steve Morgan\n          \n            Steve Morgan"
}