{
  "url": "https://moz.com/blog/arguing-with-link-moses-this-already-seems-like-a-bad-idea",
  "slug": "arguing-with-link-moses-this-already-seems-like-a-bad-idea",
  "title": "Arguing with Link Moses - This Already Seems Like a Bad Idea - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I can't believe I'm about to do this, but I also can't resist. Eric Ward, aka \"Link Moses,\" aka \"The Link Building Expert,\" wrote a post last month about drinking the linkbait kool-aid and I'...",
  "content": "Arguing with Link Moses - This Already Seems Like a Bad Idea Link Building By: Rand Fishkin September 1, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 1, 2006 Arguing with Link Moses - This Already Seems Like a Bad Idea Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I can't believe I'm about to do this, but I also can't resist. Eric Ward, aka \"Link Moses,\" aka \"The Link Building Expert,\" wrote a post last month about drinking the linkbait kool-aid and I'm forced to take issue with his stance. From Eric's post: ...Nowadays I guess the term content has become quaint. I hear people saying, “I don’t have time to add real content, I need is something quick that will make everyone want to link to my site.” And I say, “Like what, the Diet Coke/Mentos fountain video? But I thought your site sold ball bearings?” Funny, but true. People are getting so caught up in their quest for viral, user-generated links that they will do anything. Who cares if it has nothing to do with your long-term business success, your site was on the Digg homepage yesterday! Cool!! I say you’re drinking the link bait Kool-Aid... He goes on to say: There’s nothing necessarily wrong with link baiting. It’s the term and the tactics I don’t like. If you are creating Link Bait for no other reason than to attract links in hopes of also attracting search engine rankings improvement via those links...well, good luck. That’s what EVERYONE is doing. And those types of links wont help you long if at all. But go ahead and try it. While you do, why not also add some really useful content and tools to your site that will help your users accomplish something? OK. Here's where Eric and I strongly disagree about the definition of linkbait and the value of the links & buzz generated via its creation. Let me first give my own abbreviated definition of linkbait: Linkbait is a content element on a website that is created for the purpose of appealing to bloggers, journalists, webmasters, social media enthusiasts and writers. Unlike content that is primarily targeted at industry insiders (from whatever sector/niche you're in), linkbait should be universally valuable, memorable and compelling. The higher quality the content you create and the more targeted you make it, the better your chances for keeping a percentage of the traffic you initially attract and getting a higher number of links from your effort. Linkbait IS NOT manipulation. You're not trying to fool anyone into linking to you or con visitors into coming to your site. The content you've created through linkbait should be the kind that others are proud to link to. If a blogger links to your content, it should be because their audience benefits directly from that link - they learn something new, have access to a fantastic tool, get a hearty laugh or discover something that provokes discussion. Eric is right in the sense that linkbaiting is merely content creation, but with a new twist. The existence of portals like Techmeme, Fark, Digg, Del.icio.us/Popular, Reddit, Boing Boing, StumbleUpon that aggregate what they (or their visitors) consider the \"best of the web,\" has created a new channel for quick delivery to a massive audience. One could argue that this ability to promote content rapidly has always been on the web, in the form of site like MSN.com (whose homepage will occassionally have a story about a new website), Yahoo!'s Site of the Day, Macromedia's Site of the Day, Slashdot, etc. These newer entrants are merely expanding the ability of clever content providers and marketers to have a big splash in the online world. There's a second (and some would argue, less altruistic - though I'd disagree) goal of linkbait - ranking at the search engines. When a viral meme makes its way across the blogosphere, it picks up hundreds and sometimes thousands of links. These links often feature the keywords used by the site to describe its linkbait content, thus providing powerful, high quality link popularity to a page that's now very likely to rank well for its featured content. Is this ethically questionable? Do search engines abhor this kind of behavior? NO! From a logic standpoint, this is exactly the type of content search engines would want to rank well in their index. Hundreds (possibly thousands) of people have literally voted with their links (and at places like Digg, Del.icio.us and Reddit, with their accounts) to say that this content rocks. If users love it and it provides value to them, aren't the search engines inherently passionate about making that content rank well, too? Let's put it another way - will people who search for \"page strength\" be dissapointed when they get to the SEOmoz tool? Will users searching for \"Web 2.0\" get frustrated when they see the spammy, low quality awards site? Are homeowners who search for \"real estate values\" getting fed up with finding Zillow's service? NO! Users get great value from these pages - they perfectly fit the query and deliver information the users want. Linkbait isn't just for bloggers or search engines or social taggers - it's for anyone who needs solid, high quality data to answer their search. Not all linkbait is valuable, and not all of it is content that the search engines would want to rank, but in theory, the goal is to create content that fits all of these criteria. Let's see if I can't get Link Moses to come around to my way of thinking :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Arguing with Link Moses - This Already Seems Like a Bad Idea"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Arguing with Link Moses - This Already Seems Like a Bad Idea"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}