{
  "url": "https://moz.com/blog/askcom-recreating-the-magic-and-offering-free-tshirts-to-boot",
  "slug": "askcom-recreating-the-magic-and-offering-free-tshirts-to-boot",
  "title": "Ask.com Recreating the Magic and Offering Free T-Shirts To Boot - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A short while ago, I wrote about the Ask.com advertising campaign that seems to have gone slightly wrong (what with the vandalism and deceptive ads).  The comments on the blog showed quite clearly the backlash they faced from the population who visited.Well, it seems th...",
  "content": "Ask.com Recreating the Magic and Offering Free T-Shirts To Boot Mobile SEO J By: Judith Lewis April 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Judith Lewis April 20, 2007 Ask.com Recreating the Magic and Offering Free T-Shirts To Boot Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A short while ago, I wrote about the Ask.com advertising campaign that seems to have gone slightly wrong (what with the vandalism and deceptive ads). The comments on the blog showed quite clearly the backlash they faced from the population who visited. Well, it seems that the ad company and Ask.com may have listened a little bit to the voices of the people (and gotten tired of the negative messages left on their site), and the site has undergone a major redesign. I like this new look much better. The site is clear about its associations. The point that Ask.com is small and has to go \"underground\" to get out the message about alternate search engines is clear and can evoke sympathy. There are points about why to switch and cute bios on the \"major players\" behind the movement. Ask.com seems to be trying to recreate that whole guerrilla movement feel without the horrible backlash. I can't understand why this wasn't the original approach. By evoking sympathy as the underdog - the David facing the Goliath - and asking for people to help, they are more likely to get the increase in users and positive buzz. Having taken the original disastrous route, the damage was done (figuratively and, for some shop owners, literally). One thing that remains a worry for me is that the site includes the statement \"Stay tuned here to see if we've been arrested,\" which seems to imply that actions will be undertaken which are illegal (again). While I love the idea of the little guy taking on the big guy, I wonder what they will do to get arrested and if it will be purely for publicity. A criminal record is for life, not just for Christmas. Want a free t-shirt? In the UK? Get one fast - they only have 1,000 and they are available now. http://www.information-revolution.org/requestshirt.php Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ask.com Recreating the Magic and Offering Free T-Shirts To Boot"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ask.com Recreating the Magic and Offering Free T-Shirts To Boot"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Judith Lewis\n          \n            Judith Lewis"
}