{
  "url": "https://moz.com/blog/at-what-stage-do-you-say-bugger-the-users-i-need-to-do-this",
  "slug": "at-what-stage-do-you-say-bugger-the-users-i-need-to-do-this",
  "title": "At What Stage Do You Say \"Bugger the Users, I *Need* to Do This!\"? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am fairly new around here and I kept wanting to contribute to YOUmoz because I read some great posts on here but I never had anything to write. Then today on my quiet, packed, solumn bus ride home, I realised that I had something to write about all along...I run a fairly hefty site. Its always…",
  "content": "At What Stage Do You Say \"Bugger the Users, I *Need* to Do This!\"? Online Advertising C By: Christian Biggins June 25, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Christian Biggins June 25, 2008 At What Stage Do You Say \"Bugger the Users, I *Need* to Do This!\"? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I am fairly new around here and I kept wanting to contribute to YOUmoz because I read some great posts on here but I never had anything to write. Then today on my quiet, packed, solemn bus ride home, I realised that I had something to write about all along... I run a fairly hefty site. It's always ranking in the top 5 national sites for its category (ranked by an independent company that sells competitive web stats). There are ~45,000 registered members and the site is about 7 years old (wow, that time went very quick!). I have always run the site as a not-for-profit entity and have never charged access to the site and haven't ever restricted access to guests (apart from our gallery). This becomes pricey when the site weighs about 60GB and pushes ~500GB per month. (If you want to visit the site, you can see the link in my profile but I won't link to it here because I feel it is irrelevant.) I have always tried to make any advertising on the site as unobtrusive as possible and I have only offered banners (little 468x60 ones) to local businesses, and they haven't ever covered my costs let alone made me money. I think my members have come to appreciate this and don't seem to like any excess advertising. About 10 months ago I started pushing some SEO changes on the site and have recently started feeling the extra traffic. My current server is holding up well, but it will soon need to be upgraded or even have a second one added to it. This is causing non-requisite and unwelcome stress on me and my wife as we fund most of this site ourselves. We recently were offered a deal with a local online advertising agency to serve (larger, more imposing) ads for their ad network partnership with Yahoo. We accepted the deal even though we have about 10 months left on some of our existing banner rotations, which means that we will need to run them alongside each other. Now I am feeling torn. These ads are likely to irritate and upset some users, but it's going to mean that we will actually make money (which is a concept totally unbeknownst to us) from the site. I have put my heart and soul into this site (and god knows how many hours) but now I feel like a sellout. I spend a lot of time pining over this decision and it causes me no end of concern as I really don't want my members to leave (and not because it looks good or makes the site more valuable, but because I actually want them to be happy on the site). Have I sold my soul to the advertising underworld? At what stage do you realise that you need something back regardless of how much you love doing it? Why is it so hard to keep everybody (or at least your members) happy? Where is the line that you must cross that forces you to start advertising on your site in such a way as it will likely irritate your regulars? Why is it so hard for me to say \"Stuff it, I am buying a house, we are going to have another child soon, get over it!\"? The site is like my illegitimate child. Anyway, I'm sure I had more to write, but isn't that always the way? I had to get all this down the second I got home from work. Let me know if you have been in a similar situation and how you dealt with it. You might renew my faith in myself (not likely). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "At What Stage Do You Say \"Bugger the Users, I *Need* to Do This!\"?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "At What Stage Do You Say \"Bugger the Users, I *Need* to Do This!\"?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Christian Biggins\n          \n            Christian Biggins"
}