{
  "url": "https://moz.com/blog/atoning-for-past-sins",
  "slug": "atoning-for-past-sins",
  "title": "Atoning for Past Sins - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Todd (stuntdubl) has a great post at SEW on how to make a successful re-inclusion request to Google. He notes, first off, that a customer of his got banned specifically for using Link Vault, which is new informat...",
  "content": "Atoning for Past Sins Blogging By: Rand Fishkin August 4, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 4, 2005 Atoning for Past Sins Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Todd (stuntdubl) has a great post at SEW on how to make a successful re-inclusion request to Google. He notes, first off, that a customer of his got banned specifically for using Link Vault, which is new information to me, as I had previously presumed that Google would not de-list sites for this but rather simply discount the value of the links. Here's some of Todd's key rules: Fess up - If you did something wrong admit it and fix it Don't ASK WHY- You know what you did, or most likely some potential causes - At least fix those if you're going to ask WHY Don't whine - If it is the fate of your business you should probably be buying adwords anyhow Don't be a recidivist - pretty self explanatory - if you get special consideration and abuse it you won't get it again Don't bug 'em - G is NEVER probably going to get through their mountains of e-mail...don't make it worse Re-read the webmaster guidelines several times before sending off your request. Contact a professional and have them review your site for potential infractions, and diagnose if it is indeed a hand banning. Be polite Todd's even got a good sample letter to send over to GG. I would actually consider hand writing, addressing and mailing this rather than using e-mail. Here's the address I'd opt for: Google Search EngineeringAttn: Search Index Quality Control Team1600 Amphitheatre ParkwayMountain View, CA 94043 Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Atoning for Past Sins"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Atoning for Past Sins"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}