{
  "url": "https://moz.com/blog/auditing-backlink-profile",
  "slug": "auditing-backlink-profile",
  "title": "7 Red Flags to Watch Out For When Auditing Your Link Profile - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From irrelevant, off-topic backlinks to cookie-cutter anchor text, there are more than a few clues hidden in your backlink profile that something spammy is going on. In this week's Whiteboard Friday, Kameron Jenkins shares her best advice from years working with clients on what to watch out for in…",
  "content": "7 Red Flags to Watch Out For When Auditing Your Link Profile - Whiteboard Friday Link Building | Whiteboard Friday | Advanced SEO By: Kameron Jenkins March 1, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins March 1, 2019 7 Red Flags to Watch Out For When Auditing Your Link Profile - Whiteboard Friday Link Building | Whiteboard Friday | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From irrelevant, spammy backlinks to cookie-cutter anchor text, there are more than a few clues hidden in your backlink profile that something fishy is going on. Alone they might not be something to worry about, but in conjunction, common red flags can spell trouble when you're checking your backlink profile for SEO risk.In this week's Whiteboard Friday, Kameron Jenkins shares her best advice from years working with clients on what to watch out for in a link profile audit. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hey, guys. Welcome to this week's edition of Whiteboard Friday. My name is Kameron Jenkins, and I work here at Moz. Today we're going to be talking about auditing your backlink profile, why you might want to do it, when you should do it, and then how to do it. So let's just dive right in. It might be kind of confusing to be talking about auditing your backlink profile. When I say auditing your backlink profile, I'm specifically talking about trying to diagnose if there's anything funky or manipulative going on. There's been quite a bit of debate among SEOs, so in a post-Penguin 4.0 world, we all wonder if Google can ignore spammy backlinks and low-quality backlinks, why would we also need to disavow, which essentially tells Google the same thing: \"Just ignore these links.\" I posed three reasons why we might still want to consider this in some situations. Why should you audit your backlink profile? Disavow is still offered Disavow is still an option — you can go to and submit a disavow file right now if you wanted to. You can still get manual penalties Google still has guidelines that outline all of the link schemes and types of link manipulation. If you violate those, you could get a manual penalty. In your Google Search Console, it will say something like unnatural links to your site detected, total or partial. You can still get those. That's another reason I would say that the disavow is still something you could consider doing. Google says their stance hasn't changed I know there's like a little bit of back-and-forth about this, but technically Google has said, \"Our stance hasn't changed. Still use the disavow file carefully and when it's appropriate.\" So we'll talk about when it might be appropriate, but that's why we consider that this is still a legitimate activity that you could do. When should you audit your backlink profile? Look for signs of a link scheme or link manipulation I would say that, in today's climate, it's probably best just to do this when you see overt signs of a link scheme or link manipulation, something that looks very wrong or very concerning. Because Google is so much better at uncovering when there are manipulative links and just ignoring them and not penalizing a whole site for them, it's not as important, I think, to be as aggressive as we maybe used to be previously. But if you do, maybe you inherit a client and you just look at their link profile for the first time and you notice that there's something sketchy in there, I might want to consider doing it if there are signs. You're an SEO. You can detect the signs of whether there's a link scheme going on. How do you audit your backlink profile? Check for red flags in Moz Link Explorer But if you're not quite sure how to diagnose that, check for red flags in Moz Link Explorer, and that's the second part of this. We're going to go through some red flags that I have noticed. But huge disclaimer — seven possible red flags. Please don't just take one of these and say, \"Oh, I found this,\" and immediately disavow. These are just things that I have noticed over time. I started in SEO in 2012, right around the time of Penguin, and so I did a lot of cleanup of so many spammy links. I kind of just saw patterns, and this is the result of that. I think that's stayed true over the last couple of years, links that haven't been cleaned up. Some people are still doing these kinds of low-quality link building techniques that actually could get you penalized. These are some things that I have noticed. They should just pique your interest. If you see something like this, if you detect one of these red flags, it should prompt you to look into it further, not immediately write off those links as \"those are bad.\" They're just things to spark your interest so that you can explore further on your own. So with that big disclaimer, let's dive into the red flags. 7 possible red flags 1. Irrelevance Countries you don't serve A couple of examples of this. Maybe you are working on a client. They are US-based, and all of their locations are in the US. Their entire audience is US-based. But you get a quick glimpse of the inbound links. Maybe you're on Link Explorer and you go to the inbound links report and you see a bunch of domains linking to you that are .ru and .pl, and that's kind of confusing. Why is my site getting a huge volume of links from other countries that we don't serve and we don't have any content in Russian or Polish or anything like that? So that might spark my interest to look into it further. It could be a sign of something. Off-topic links Another thing is off-topic. My favorite example, just because it was so ridiculous, was I was working with an Atlanta DUI attorney, and he had a huge chunk of backlinks that were from party planning, like low-quality party planning directories, and they didn't make any sense. I clicked on them just to see what it was. You can go to it and see okay, yes, there really is no reason they should be linking to each other. It was clear he just went to Fiverr and was like, \"$5, here build me links,\" and he didn't care where they came from. So you might notice a lot of totally off-topic, irrelevant stuff. But obviously a disclaimer, it might look irrelevant, but then when you dive in further, they are in the same market and they kind of have a co-marketing relationship going on. Just be careful with that. But it could be a sign that there is some link manipulation going on if you have totally off-topic links in there. 2. Anchor text The second red flag is anchor text. Again, this is another cool report in Moz Link Explorer. You can go in there and see the anchor text report. When I notice that there's link manipulation going on, usually what I see is that there is a huge majority of their backlinks coming with the same exact anchor text, and usually it's the exact match keyword that they want to rank for. That's usually a huge earmark of, hey, they've been doing some shady linking. The example I like to use for this and why that is concerning — and there's no percentage that's like, whoa, that's manipulative. But if you see a really disproportionate percentage of links coming with the same exact anchor text, it might prompt you to look into it further. The example I like to use is, say you meet with five different friends throughout the course of your day, different occasions. They're not all in the same room with you. You talk to each of them and they all say, \"Hey, yeah, my weekend was great, but like I broke my foot.\" You would be suspicious: \"What, they all broke their foot? This is weird. What's going on?\" Same thing with anchor text. If you're earning links naturally, they're not all going to look the same and mechanical. Something suspicious is probably going on if they're all linking with the exact same anchor text. So that's that. 3. Nofollow/follow Nofollow to follow, this is another one — please don't use this as a sweeping rule, because I think even Russ Jones has come out and said at a mass scale that's not a good predictor of spamminess. But what I have tended to see is usually if they also have spammy anchor text and they're irrelevant, usually I also see that there's a really, really disproportionate ratio of nofollow to follow. Use these red flags in conjunction with each other. When they start to pile on, it's even more of a sign to me that there's something fishy going on. Nofollow to follow, you might see something ridiculous. Again, it's something you can see in Link Explorer. Maybe like 99% of all of their backlinks are follow, which are the ones that pass PageRank. If you're going to do a link scheme, you're going to go out and get the ones that you think are going to pass PageRank to your site. Then one percent or no percent is nofollow. It may be something to look into. 4. Links/domains Same thing with links to domains. Again, not an overt sign of spamminess. There's no magic ratio here. But sometimes when I notice all of these other things, I will also notice that there's a really disproportionate ratio of, say, they have 10,000 inbound links, but they're coming from only 5 domains. Sometimes this happens. An example of this: I was auditing a client's backlink profile, and they had set up five different websites, and on those websites they had put site-wide links to all of their other websites. They had created their own little network. By linking to each other, they were hoping to bolster all of their sites' authority. Obviously, be careful with something like that. It could indicate that you're self-creating follow links, which is a no-no. 5. Domain naming \"DIR\" or \"directory\" This one is just kind of like the eyeball test, which I'll get to later. If you go to your inbound links, you can start to notice domain names that just look weird, and they'll start to look off the more you look into stuff like this. When I was doing a lot of backlink auditing, what I noticed was that a lot of these spammier links came from low-quality directory submission sites. A lot of those tend to have or they would say \"directory\" in it or \"DIR,\" so like bestlinkdir.co, whatever. A lot of times when they have naming conventions like that, I have noticed that those tend to be low-quality directory submission sites. You could even eyeball or scan and see if there are any \"DIR\" directory-type of links. \"Article\" Same thing with articles. Like back in the day, when people use to submit like e-zine articles or Article Base or something like that, if it has the word \"article\" in the domain name, it might be something to look into. Maybe they were doing some low-quality article submission with backlinks to their site. \"SEO\"/\"links\" Then if you tend to see a lot of links in their backlink profile that have like SEO link type naming conventions, unless you're working on a site that is in the SEO space, they shouldn't have a bunch of links that say like bestSEOsite.com or bestlinksforyou.com. I've seen a lot of that. It's just something that I have noticed. It's something to maybe watch out for. 6. Tool metrics These can be super helpful. If you see tool metrics that maybe there is a really high Spam score, it's something to look into. It might be helpful that Moz on their Help Hub has a list of all 27 criteria that they look at when evaluating a site's spamminess. That might be something helpful to look into how Moz's Spam Score calculates spamminess. DA and PA, just to know on this Domain Authority and Page Authority, if you see links coming from low DA or low PA URLs, just make sure you don't write those off right off the bat. It could just be that those domains are very new. Maybe they haven't engaged in a lot of marketing yet. It doesn't necessarily mean they're spammy. It just means they haven't done much to earn any authority. Watch out for kind of writing off links and thinking they're spammy just because they have a low DA or PA. Just something to consider. 7. Eyeball test Then finally we have the eyeball test. Like I said, the more you do this, and it's not something that you should be engaging in constantly all the time nowadays, but you'll start to notice patterns if you are working on clients with spammier link profiles. These kind of low-quality sites tend to have like the same template. You'll have 100 sites that are all blue. They have the exact same navigation, exact same logo. They're all on the same network. You'll start to notice themes like that. A lot of times they don't have any contact information because no one maintains the things. They're just up for the purpose of links. They don't care about them, so no phone number, no contact information, no email address, nothing. Also a telltale sign, which I tend to notice on these like self-submission type of link sites is they'll have a big PayPal button on the top and it will say, \"Pay to Submit Links\" or even worse it will be like \"Uses this PayPal to get your links removed from this site,\" because they know that it's low-quality and people ask them all the time. Just something to consider on the eyeball test front. I hope this was helpful. Hopefully it helped you understand when you might want to do this, when you might not want to do this, and then if you do try to engage in some kind of link audit, some things to watch out for. So I hope that was helpful. If you have any tips for this, if you've noticed anything else that you think would be helpful for other SEOs to know, drop it in the comments. That's it for this week's Whiteboard Friday. Come back again next week for another one. Check my link profile! Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Red Flags to Watch Out For When Auditing Your Link Profile - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Red Flags to Watch Out For When Auditing Your Link Profile - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Why should you audit your backlink profile?"
    },
    {
      "level": "H3",
      "text": "Disavow is still offered"
    },
    {
      "level": "H3",
      "text": "You can still get manual penalties"
    },
    {
      "level": "H3",
      "text": "Google says their stance hasn't changed"
    },
    {
      "level": "H2",
      "text": "When should you audit your backlink profile?"
    },
    {
      "level": "H3",
      "text": "Look for signs of a link scheme or link manipulation"
    },
    {
      "level": "H2",
      "text": "How do you audit your backlink profile?"
    },
    {
      "level": "H3",
      "text": "Check for red flags in Moz Link Explorer"
    },
    {
      "level": "H2",
      "text": "7 possible red flags"
    },
    {
      "level": "H3",
      "text": "1. Irrelevance"
    },
    {
      "level": "H4",
      "text": "Countries you don't serve"
    },
    {
      "level": "H4",
      "text": "Off-topic links"
    },
    {
      "level": "H3",
      "text": "2. Anchor text"
    },
    {
      "level": "H3",
      "text": "3. Nofollow/follow"
    },
    {
      "level": "H3",
      "text": "4. Links/domains"
    },
    {
      "level": "H3",
      "text": "5. Domain naming"
    },
    {
      "level": "H4",
      "text": "\"DIR\" or \"directory\""
    },
    {
      "level": "H4",
      "text": "\"Article\""
    },
    {
      "level": "H4",
      "text": "\"SEO\"/\"links\""
    },
    {
      "level": "H3",
      "text": "6. Tool metrics"
    },
    {
      "level": "H3",
      "text": "7. Eyeball test"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}