{
  "url": "https://moz.com/blog/auditing-the-moz-qa-optimization-and-insights",
  "slug": "auditing-the-moz-qa-optimization-and-insights",
  "title": "Auditing the Moz Q&A: Optimization and Insights - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Gianluca endeavored to learn more about our industry by analyzing more than 20,000 questions from Moz's Q&A section. Along the way, he discovered quite a bit about what makes for an effective online forum. Today's post covers what he learned.",
  "content": "Auditing the Moz Q&A: Optimization and Insights Advanced SEO By: Gianluca Fiorelli May 13, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli May 13, 2014 Auditing the Moz Q&A: Optimization and Insights Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One month ago I had a crazy idea: analyzing one year of Moz Q&As, and Trevor was even crazier accepting it.My original idea was both to understand the most common issues the Moz Community discusses and asks for help with, and also to understand how the trends in our industry are reflected in Q&A.After the first few days of digging into the data, though, I started seeing that there was a problem: a sub-optimal Q&A structure is preventing a truly accurate analysis of the same.For this reason, this post has been conceived as a two part series: Auditing a Q&A site/section;What insights can the analysis of the Moz Q&A site/section offer?This first part goes beyond the simple analysis of a community and, using the Moz Q&A section, takes into account and discusses issues that are common to all Q&A sites.The second part will published within a few weeks (I'm still \"digesting\" data and discovering great insights).Auditing a Q&A site/section Before people were sharing kittens and selfies on Facebook and Instagram, \"social\" was a synonym of \"forums\" in Internet-speak. In forums, people were (and still are) sharing knowledge, funny things, and questions. Forums were the first collaborative space in the web, maybe the purest symbol of the web philosophy. The forum's collaborative nature and crowdsourced knowledge is so strong that – upon reflection – the success of social networks, which mimic forums (Reddit is a clear example), must be essentially attributed to it.The advantages and difficulties of a Q&A site/sectionQ&A sites are a specific variant of the forum idea, and their model is quite simple: People ask and answer questions about certain topics.From an SEO point of view a well executed and maintained Q&A site/section has great positive effects: It may help your site rank for long tails;It may help your site earn natural links;It may help your site earn social visibility (hence second-tier links);It may help you discover ideas for new content;It's a great source for content to repurpose into other channels;The data you collect thanks to the Q&A may help you with other business decisions; orIt may help you understand if a business decision was correct or not.Its positive effects, then, have clear reflections on branding and thought leadership.The simplest ideas, though, are usually the most complex to shape into something real.The first difficulty is building a community that is able to feed the Q&A in the first place.Even if I know people who could create hundreds of fake accounts all asking and answering questions in order to “show” a lively forum and thus attract new members, if you are creating a Q&A section as a feature in your site, then it may be better to create it when you already have even a small (but loyal) community.Here is not the place to discuss how to build a community around your brand (check The Truly Monumental Guide to Building Online Communities by Mack Web Solutions for more on that), but if you are creating a Q&A section you must think at it as a product. Hence, first you must conduct an audience analysis, define the personas that you want to target with the Q&A, and from there, build the architecture of the section and shape its voice.Moz doesn't have this problem, as it has one of biggest and more loyal communities in its niche. Nevertheless, even if I am sure that Moz has portrayed what kind of personas are using its Q&A well, I tend to believe that this section of the Moz site has been designed more for marketers with at least a minimum of experience in the use of forums than it was for marketing newbies.A very brief history of the Moz Q&AThe Q&A section was created in 2007 as a a Freemium feature. Only Pro subscribers could ask a limited number of questions per month to SEOmoz, but everybody (if the question wasn't labeled as \"private\") could read the Q&A.In 2012, Moz revamped the Q&A section, eliminating the \"private\" questions and opening it to everybody, also introducing gamification rules (the \"500 thumbs up rule\") which: From one side can help fighting forum spam;Push people to be proactive on the site and in the Q&A in order to fully participate in the community.What didn't really change was the architecture of the Q&A itself, which is partly still operating.From the image above, apart from the funny Roger image, we can see how the categories were very broad back in 2012. That gave way to the more detailed architecture we see today.First commandment: Strive for a perfect Q&A IA and navigationChoosing a very broad architecture, especially in Q&As and Forums, can be a great idea in order: To avoid thin categories;To avoid \"too many choices angst\" (a syndrome caused also by eCommerce mega-menus).But it also has some risks, such as: Difficulties in extracting unique valuable data;Too broad of categories may risk looking very similar, especially to a non-expert audience (i.e.: \"Technical SEO Issues\" and \"On Page/Site Optimization\").The two issues listed above can be enhanced, then, by offering Q&A users the ability to enter their questions in up to a maximum of five categories, also in different topical areas.This freedom, however, is: Making it difficult to attribute a question to only one topic when it comes to data analysis;Maybe contributing to the confusion the question askers may already have.Hey Gianluca, weren't you saying Moz Q&A was broad? Here I see a complex taxonomy!Yes! The Moz Q&A has evolved through the years for the better, and the taxonomy used right now is very clear (check it out by trying to ask a question), but it still has issues, especially from a navigation point of view.For instance, when we enter the Q&A home page we see by default the latest-submitted questions, but if we want to restrict our search, we may have a panic attack, because we can choose between 45 categories, and many appear to be very similar.Too much freedom is not freedom, therefore: When offering users navigation through a taxonomy, it is always better to funnel them from broad to a more detailed offering, using both contextual menus and a way to go back in the architecture navigation.Unfortunately, the Moz Q&A lacks both: Because the main categories of the Q&A, i.e. \"Moz Resources\" or \"Online Marketing,\" are virtual and not made explicit with a real category page, the possibility of creating contextual menus is substantially hindered;Because the Q&A section doesn't include a breadcrumb navigation (the lack of which is probably not helping Googlebot in easily understanding the section's information architecture). Avoid confusion between categories and tagsIn the recent past there was a sort of \"anti-tags\" crusade, especially in the blogging world.This can be attributed to the misuse of tagging, which is usually considered to be a synonym of categorizing things, when the two in reality have a very different nature: A category is that ontology value that include everything related to a specific topic. For instance, under the category \"Link Building\" we can find questions about broken link building, guest blogging, news syndication, image link attribution et al;A tag is that transversal taxonomy value that reunites under its label questions from different categories, which share a same topic. For instance a tag \"infographics\" could be attached to questions that have been listed in different categories like Web Design, Technical SEO, Link Building and Content/Blogging.If used well, then, tags can really improve the usability of a Q&A site: Helping the asker specifying even better the nature of its question;Help the Q&A community members (and the casual visitors, who are not into the Q&A niche jargon) in following only those specific topics about which they are interested.From an SEO point of view, then, a well thought-out tagging system (which includes both a suggested tag engine and, ideally, a semantic tagging consolidation engine, and takes into account the duplicated content issue) can help the Q&A site become visible to an even greater set of queries, thanks especially to the semantic topical nature of the Tags' pages.Use category pages as topical hubsWhen it comes to category pages, Q&As (and Forums in general) may present us some of the same uncertainties that categories in classified ads or eCommerce sites present, the main one being related to the weight we want to give to category pages in relation to the pages of the questions themselves.In the case of Moz (just speculating here, now) the doubt was certainly greater, because the Moz Blog's categories tend to overlap those of the Q&A section. This is immediately understandable if we look at the \"link building\" topic, which is both a Q&A and a Blog category (also because the Q&A categorization was modeled after that of the Blog, which came first).In this case, Moz has decided that the blog is its main content asset (and has been since the beginning), and therefore the blog categories should have priority. They acted in order to have them ranking over the Q&A's. And it did well.But we could choose to follow the opposite path, using Q&A as the main content asset and, therefore, using its categories and sub-categories pages as \"topical hubs.\"The concept of the topical hub is becoming more important every day, because of the evolution of Google itself and its shift to semantics and \"understanding things\" as opposed to simply indexing pages.A topical hub, to be clear, is a page where people interested in a topic can start their research and navigation about the topic and its subtopics. They find relevant content about the topic itself, and these pages are some of the most important landing pages from an organic search perspective. A topical hub, in the case of a Q&A category and tag page, should therefore evolve from being a simple paginated list of questions. It should move from being a transition page to become a full \"reference page\".What are the elements of a topical hub? A clear description of what the topic the hub is about. It seems a bit \"old-school\" SEO, but it really isn't. In Q&A sites, then, it has the particular function of confirming for people that they have landed on the correct page, which is both good for them and for those of us administering the Q&A. For instance, the category labeled \"Reporting\" in the Moz Q&A is quite confusing, as many people refer to it thinking about their Moz Analytics reports (with essentially support-related questions), and not about reporting in the broader sense.The list of questions, with the visualization options you may desire to offer depending on the priorities you have assigned to the Q&A itself;Contextual menu, in order to create relations between sister categories;Tags menu, in order to create relations with transversal topics (also helping facilitate the crawling of questions pertaining to separate categories);Contextual related content. In the case of Moz, contextual content can be: Related educational content from Moz Academy;Related webinars;Related posts or post categories from the main blog and YouMoz.Moz should suggest the Link Building Moz Academy videos in its Link Building category page in Q&A.Help your analysts, empower your moderatorsAs we have seen, every Moz subscriber can include a question in up to five categories. Even though this is great for the users, from an analysis point of view it can make collecting insights quite difficult.For instance, when I was analyzing one year of Moz Q&As, it was very hard to understand which category to attributing the main value to, because the large majority of the questions had been associated with more than one category (many in all the five categories allowed).For this reason, apart from creating a tag system, it would be a wise idea to empower the moderators so that they can eventually place a question in a better-suited category and/or eliminate a question from an inappropriate or inconsistent category.(Re)discover the importance of internal searchInternal search is the secret feature that makes sites with a massive amount of content stand out and be loved by their users.It's obviously not the only one, but when we think of sites like Amazon, Zillow, Tripadvisor, or Yelp, we can easily understand how internal search plays a major role in how a user of those sites is satisfied. For that same reason, a certain specialization within SEO (one which is becoming more and more important) is what can be defined as Vertical Search Engine Optimization, meaning optimizing for the internal search algorithms of sites like the ones I just mentioned.A Q&A site's internal search, then, is essential for: Helping users find questions for which they seek the answers; andLimiting the creation of substantially duplicated content, with all the administrative loss of time it may cause.We should not forget, finally, how the analysis of internal searches can help us re-discover a big percentage of the keywords Google hides behind the (not provided) wall.If you have a small Q&A site, maybe the best solution is to rely on the Custom Search Engine offered by Google, which is also relatively easy to connect to Google Analytics. But if you have a big Q&A site, then Google CSE may be not enough. In that case, even if there exist third-party commercial solutions, creating a native internal search algorithm is the best choice.This is the path Moz followed, but is its algorithm a good one? It is not bad, but it could be improved.In fact, when we perform an internal search (try \"how to use hreflang?\"), the internal SERP offered is not really the best one:The first-ranking question is dated 2012; the second and fourth have responses, but are still tagged as not answered. The best question is ranking third.Sure, Moz's internal search allows us to refine our searches using advanced filters (for instance, searching for questions similar to ours in a determined category), but still, that should be an option, not a necessity.So, what should the ranking factors be in a vertical Q&A search algorithm like the one Moz uses? Here are some suggestions: The presence of keywords in the question title;The presence of keywords in the question body;The presence of keywords in the answers. For instance, \"hreflang\" may not be present in the question itself, but may be present in one or more responses, which means the question can be relevant for the user's query;The presence of one or more \"Good Answers.\" Good Answers are those that, in the Moz Q&A system, earn 3 or more thumbs up or are defined as such by a Q&A moderator. Clearly, a question with one or more good answers deserves better visibility in an internal SERP;The presence of one or more \"Staff Endorsements.\" When an answer is particularly good, moderators may endorse it, giving it a bigger value than simple answers or even \"Good Answers.\" This should be the equivalent of links in the case of Moz Q&A :-);Tbe freshness of the question. The reason is obvious: Questions, especially in inbound marketing, tend to become obsolete after a short time (but, remember, there are important exceptions). Therefore, showing the questions that match all the previous factors and that are also fresh as ranking first should be the rule.Don't forget the \"suggested question\" featureSomehow related to the internal search algorithm issue, we can also find the \"suggested question\" issue.This is something Quora was quite able to solve:When someone is writing a question, Quora interprets the question they are writing (not always very well, to be honest) and presents the asker a list of already-answered questions that might solve the one they are about to ask. If the questions presented are not satisfying the user, they can still proceed to post their own question.This feature is very helpful, again, for preventing the Q&A from being flooded with very similar questions, which is both useless for the users and the Q&A site itself (not to mention that it could be a potentially substantial duplicate content generator).Pay attention to design changesWhen I started analyzing the more than 20,000 questions users posted in Moz's Q&A between May 2013 and April 2014, the first thing I noticed was an large decline in the number of questions posted after May 2013.We must remember that one year ago this site rebranded from SEOmoz to Moz.At first, then, I thought that the fall in the Q&A postings was due to some SEO factors. But, after sharing this insight and discussing it with the Moz marketing team, I focused on the re-design of the site as the potential reason for that drop.In fact, if we look how the SEOmoz.org menu was, we will see that the Internal Q&A link was easily reachable by the users from the main menu:In the Moz.com site, the link to the Moz Q&A can be discovered and clicked only if we first click on \"Community,\" opening the community hub page, and then click on Q&A.Just moving the internal link away from the main menu may have caused the drop in posts.What's in the second part of this post?This is the end of the fist part of this \"Auditing the Moz Q&A\" mini-series.In the second part we will have a lot of fun, because analyzing 20,000+ questions can really offer us a realistic portrait of our industry's fears, hopes, and trends.I want to leave you with a teaser:The Moz community has an obsession, and it's not cats, sex, or whatever: It's Google. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Auditing the Moz Q&A: Optimization and Insights"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Auditing the Moz Q&A: Optimization and Insights"
    },
    {
      "level": "H2",
      "text": "Auditing a Q&A site/section"
    },
    {
      "level": "H3",
      "text": "The advantages and difficulties of a Q&A site/section"
    },
    {
      "level": "H3",
      "text": "A very brief history of the Moz Q&A"
    },
    {
      "level": "H3",
      "text": "First commandment: Strive for a perfect Q&A IA and navigation"
    },
    {
      "level": "H4",
      "text": "Avoid confusion between categories and tags"
    },
    {
      "level": "H3",
      "text": "Use category pages as topical hubs"
    },
    {
      "level": "H3",
      "text": "Help your analysts, empower your moderators"
    },
    {
      "level": "H3",
      "text": "(Re)discover the importance of internal search"
    },
    {
      "level": "H4",
      "text": "Don't forget the \"suggested question\" feature"
    },
    {
      "level": "H3",
      "text": "Pay attention to design changes"
    },
    {
      "level": "H2",
      "text": "What's in the second part of this post?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}