{
  "url": "https://moz.com/blog/author-photos-are-gone-does-google-authorship-still-have-value-29334",
  "slug": "author-photos-are-gone-does-google-authorship-still-have-value-29334",
  "title": "Author Photos are Gone: Does Google Authorship Still Have Value? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Does Google Authorship still matter once photos no longer show up in SERPs? Mark Traphagen considers why they were removed and what's next for Authorship.",
  "content": "Author Photos are Gone: Does Google Authorship Still Have Value? Technical SEO | Advanced SEO By: Mark Traphagen July 9, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mark Traphagen July 9, 2014 Author Photos are Gone: Does Google Authorship Still Have Value? Technical SEO | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Since the publication of this post, Google has discontinued support for authorship markup in web search. While we're leaving this post up for reference, we want you to know that implementation of authorship will no longer result in rich author snippets shown on SERPs. Carry on! On June 25, 2014, Google's John Mueller made a shocking announcement: Google would be removing all author photos from Google search results. According to the MozCast Feature Graph, that task was fully accomplished by June 29. In this post I will: Give a brief overview of how Google Authorship got to where it is today. Cover how Google Authorship now works and appears in search. Offer my take on why Author photos were removed Investigate the oft-repeated claims of higher CTR from author photos Suggest why Google Authorship is still important, and speculate on the future of author authority in Google Search. A Brief History of Google Authorship The Google Authorship program has been my wheelhouse (some might say \"obsession\") since Google first announced support for Authorship markup in June of 2011. Since I am both an SEO and a content creator, Google certainly got my attention in that announcement when they said, \"...we’re looking closely at ways this markup could help us highlight authors and rank search results.\" Of course, in the three years since that blog post, many search-aware marketers and content creators also jumped on the Google Authorship bandwagon. Occasional comments from prominent Google staffers that they might someday use author data as a search ranking factor, along with Bill Slawski's lucid explanations of the Google Agent Rank patent, fueled the fire of what most came to call \"author rank.\" Below is a video from 2011 with Matt Cutts and Othar Hansson explaining the possible significance of Authorship markup for Google at that time: During the three years since Google announced support for rel=author markup, there have been many changes in how Authorship appeared in search results, but each change only seemed to buttress Google's continued support for and improvement of the program. In the early days of Google Authorship, almost anyone could get the coveted face photo in search by correctly setting up Authorship markup on their content and linking to that content from their Google+ profile. As time went on, Google became pickier about showing the rich snippet, and some sort of quality criteria seemed to come into play. Still, it was not too difficult to earn the author snippet. Then at Pubcon New Orleans in October 2013, Matt Cutts announced that in the near future, Google would start cutting back on the amount of Authorship rich snippets shown in search. He said that in tests they found when they cut out 10% to 15% of the author snippets shown, \"overall quality went up.\" In December of that year we saw the promise fulfilled as the percentage of queries showing author photos dropped, and many individual authors either started seeing a byline-only snippet for much or all of their content, or losing Authorship snippets completely. It was clear by then that Authorship as a search feature was a privilege, not a right, and that as much as Google seemed to want people to adopt Authorship markup, they were determined to police the quality of what was shown in search associated with that markup. But none of that prepared us for what has happened now: the complete removal of author photos from global search. Google Authorship without Photos in Search Here are the fundamental facts about how Authorship is used in search as of this writing: 1. The only Authorship rich snippet result now available in global search is an author byline. Google has dropped author photos entirely (except for some unique exceptions in personalized search; see below). Also, Google dropped the \"in xx Google+ circles\" link that showed in some cases and led to the author's Google+ profile. 2. Author bylines now link to Google+ profiles. Previously, at least in the US, author bylines in search results linked to a unique Google search page that would show just content from that author. This feature is no longer available. 3. Qualification for an Authorship byline now is simply having correct markup. This was a bit of a surprise given Google's move last December to differentiate and highlight authors with better quality content who publish on trusted sites. But in a Google Webmaster Central Hangout on June 25, 2014, John Mueller indicated that now as long as the two-way verification (rel=author markup on the content site linked to author's Google+ profile, and a link back to the content site in the author's Google+ Contributor To links) could be correctly read by Google, a byline would likely be shown. You can check for correct Authorship verification for any web page by entering its URL in Google's Structured Data Testing Tool. If Authorship is correctly connected for the page, you should see a result similar to this: However, it is well known that this tool isn't perfect. For example, even though it shows Eric Enge's post on Copyblogger as being verified, Google has never shown an Authorship snippet for any of Eric's posts there, and even now does not show a byline for that content. Eric is a very well-known and trusted author who gets a rich snippet for all his other content on the web, and Copyblogger is certainly a reputable site. Why his content there has never displayed an Authorship snippet remains a mystery. In the Hangout, John Mueller went on to say that in the future they may have to reevaluate showing bylines for everyone who has correct markup, once they get more experience with the byline only results. He promised that there will be continued experimentation. If they see that people are using the bylines as a gauge of how great or trustworthy an author is, that might be impetus enough to try to re-implement some kind of quality factor into whether or not one gets a byline. So are there actually more Authorship results in search now? If Mueller is correct that Authorship snippets are now based merely on a technically-correct connection, and there is no longer any quality factor, then wouldn't we expect now to see more Authorship in search, even if only bylines? Not necessarily. Moz's Dr. Pete Meyers shared the following with me: So, in my data set, Authorship [measured the old way - by thumbnail photos] peaked on June 23rd at 21.2% of SERPs (in our 10K data set). Measured the new way [bylines only], Authorship is showing up around 24.0% of SERPs. That could mean that, in absence of the photos, Google has allowed it to appear more often, or it could mean that there were a handful of SERPs with byline-only Authorship before. I suspect it's the latter, but I have no data to support that. I agree with Pete's latter guess. The fact is that from the December 2013 \"purging\" of Authorship in search until the recent change, there have been two kinds of Authorship results: Those with a photo and byline, and those with byline only. I called the latter \"second class Authorship,\" and it looked like when Google ran its quality filter through the Authorship results, most lower-quality authors dropped to second class, byline-only results rather than being dropped altogether from Authorship results. So it appears that the net result is no overall change in the amount of Authorship in search, just an elimination of a \"first class\" status for some authors. 4. Author photos may still be shown in personalized search for selected Google+ content. This was an unannounced change in Google search that showed up at the same time author photos were being eliminated from global (logged-out-of-Google) search. Now Google+ posts by people you follow on Google+ may sometimes show an author photo when you search while logged in to your Google+ account (personalized search). The example below is an actual screen capture from my own logged-in search for \"Google Plus for Business.\" Joshua Berg is in my Google+ circles, and Google shows his relevant Google+ post both elevated in the results (higher than it would occur in my logged-out results) and with his profile photo. In my testing of this, I have seen that these personalized author photos for Google+ posts are most likely to show if the author is high in the \"relevancy\" sort in your Google+ circles, and is someone with whom you have engaged fairly frequently. While not Authorship related, it is interesting to note that Google+ brand pages that you circle and have engaged with may now show a brand logo snippet in personalized search for their Google+ posts. While some other parts of the world have had these branded results for a while, this is entirely new for US Google searches. I'll have more below on what I see as the significance of these new results and what they may say about the future of Authorship and author authority in Google. So Why Were Author Photos Removed? So if Google was committed to continued improvement of the Authorship program, why did they drop photo snippets entirely? Was this a complete reversal, a \"beginning of the end for Authorship\" as some thought? Or were author photos in search simply not producing the results Google was looking for? Before I give my take on those questions, I highly recommend Cyrus Shepard's post \" Google Announced the End of Author Photos in Search: What You Should Know.\" I agree completely with Cyrus's take there, and won't duplicate what he covered. Rather in the rest of this post I will try to bring some added insights and informed speculations based on my intensive observation of Google's Authorship program over the past three years. Let's start with the explanation given by John Mueller in his announcement post, linked at the beginning of this article. John said: We've been doing lots of work to clean up the visual design of our search results, in particular creating a better mobile experience and a more consistent design across devices. As a part of this, we're simplifying the way Authorship is shown in mobile and desktop search results, removing the profile photo and circle count. (Our experiments indicate that click-through behavior on this new less-cluttered design is similar to the previous one.) It sounds like Mueller is linking this change to Google's \"mobile first\" initiative. Mobile first seeks to unify, as much as possible, the user experience between desktop and mobile. It is a response to the rapid increase of mobile usage worldwide. In fact, at SMX West earlier this year Google's Matt Cutts said that he expects Google searches on mobile to exceed desktop searches before the end of 2014. In subsequent comments on his Google+ post and elsewhere, Mueller elaborated that images in search results take up lots of bandwidth in mobile search, slowing down delivery of results on many devices. They also take up considerable screen real estate on the smaller screens of mobile devices. But were UX and mobile concerns the only reasons for removing author photos? I seriously doubt that. If author photos were providing a significant benefit to searchers, according to Google's data, then it is likely they would have worked on some compromise that would have made them more compatible with mobile first. Furthermore, John Mueller himself, in the aforementioned Hangout, hinted that there were other considerations involved. For example, he commented that there may have been too many author photos for some search results, and that too much of any one feature in search is not a good user experience. My Personal Speculation. I don't doubt Mueller that demands by Google's search user experience efforts may have been the main driving force behind the removal of author photos, but as I said above, I do not think it was the only reason. I believe that after much testing and evaluation Google may have decided that author photos for now send a disproportionate signal to searchers. That is, the photos may have been indicating an implied endorsement of result quality that Google is not yet prepared to back up. Remember that in December we saw Google reduce the number of author photos shown in search as an attempt, according to Matt Cutts, to increase the quality of those results. However, when questioned about the concept of \"author rank\" (Google using author trust data to influence search results), Cutts consistently speaks about the great difficulty of evaluating such quality or trust. He elaborates that finding a way to do that remains a strong goal at Google, but he doesn't expect to see it for years to come. (For example, see my remarks on his comments at SMX Advanced last month.) Given all that, it may be that Google, realizing that they still have a lot of work to do toward evaluating author trust and quality to a degree where they would allow those factors to influence actual search rankings, decided that even though Authorship does not currently affect rankings, the photos still might imply to searchers a trust and authority for the author of which Google could not be fully confident. In addition, I believe that three years into the Authorship program, Google realized that they were never going to get the vast majority of authors and sites to implement Authorship markup. If author authority is to succeed as a contributor to better search results in the future, Google has to find ways to identify and verify authors and their connected content that are not tied to either markup or Google+. That also will be a long-term project. So this may actually be merely a temporary retrenchment as Google knuckles down to the hard work of figuring out how to make author authority something truly worthwhile in search. What About Ad Competition? When the dropping of author photos was announced, there was immediate speculation by many, including Moz's own Rand Fishkin on Twitter, that the author photos were seen as too competitive with the AdWords ads displayed in search. It's impossible to either prove or disprove such speculation, as only Google holds the data. I personally find it a little hard to believe that it came down to a zero sum game between author photos and ads. In other words, is it reasonable to think that was either/or; that author photos were so attractive and got clicked so much that when they appeared too many people totally ignored the ads? Also, that speculation is based on the assumption that author photos were, in recent history, huge CTR magnets. In the next section I'll examine those CTR claims. What About Author Photo CTR? One of the most oft-repeated alleged benefits of author photos in search was that they dramatically increased click-through rates (CTR), as people were drawn to those results even if they were lower on the page. I was as guilty as anyone else in confidently proclaiming in my online articles and conference presentations that \"studies have shown\" this increase in CTR for Authorship results. So it shocked me as much as anyone when John Mueller in his announcement post said, \"Our experiments indicate that click-through behavior on this new less-cluttered design is similar to the previous one .\" First, we should note some ambiguities in Mueller's statement: He does not actually say \"click-through rate,\" though that's what most readers assumed he was talking about. He called it \"click-through behavior,\" which could refer to other things, such as how quickly people bounced back to the search results after clicking an author photo result. In that case, higher CTR would not be a good thing from a search quality viewpoint. He does not explicitly say that the click-through behavior was for the author photo results exclusively. It could be an evaluation of overall click behavior on search pages that included author photos. This could be a reference to click behavior aggregated across all queries showing author photos. If so, then it may be that while CTR was higher for photo results in some queries, overall the effect may have been a wash. But were we ever really sure there was as huge a CTR increase for author photo results as was frequently claimed? After investigating those claims, I'm not so sure. Google themselves never made a positive claim of increased CTR for author photos. A much-cited paper by Google researchers on social annotations such as face photos in search was based only on eye-tracking studies and user interviews, not actual click behavior. It actually found that image-based social annotations were not necessarily as attractive to searchers as believed, and only were attractive under certain circumstances. I found hundreds of blog posts proclaiming \"30-150% increase in CTR!\" for Authorship. Those all seemed to trace back to one article two years ago that cited a 30% increase of CTR for rich snippet results in general. That post did not talk about Authorship specifically, nor was it made clear exactly how they determined the 30% raise. Most of the other articles or \"studies\" purporting to show increased CTR from Authorship are based on one-off, anecdotal evidence. In other words, the authors implemented Authorship, and then saw more organic traffic to their sites. While interesting, such correlative claims at best may demonstrate a one-off accomplishment for that particular author for particular queries, but they do not prove that there was a general, or even universal, CTR boost. Testing for actual CTR boost is probably impossible outside of access to Google's own data. That's because CTR is highly volatile by ranking position, and it is impossible to know if you're comparing apples to apples. For a truly conclusive test, one would have to be able to randomly show the same result for the same query in an A/B split with half the results showing an author photo and half not. I don't see any way for us to set up such a test. In the Webmaster Central Hangout mentioned previously, John Mueller hinted strongly that whatever CTR boost there may have been, Google has seen it wear away over the past couple years. He mused that it is likely people became more used to seeing author photos in search over time, and so they had less impact and drawing power. If Google sees a feature not having much effect, it is natural that they would remove it. Unfortunately, the Author Stats feature in Google Webmaster Tools is no help in evaluating CTR of author photo results vs. post-author photo results. Before June 28, for me it showed hundreds of pieces of content showing in search as Authorship snippets. Since June 28, only one result shows, and that is for a Search Engine Land article I wrote that made it into Google News results, where author photos can still show. Apparently the Author Stats tool was measuring only results with author photos. All that is not to say there was never any rise in CTR for any Authorship posts. But it is to say that we never really knew for sure, and we never knew how much. Most importantly, there was never any proof that any CTR boost was universal. That is, there was no reason to assume that just because your results got an author photo, they were automatically getting a CTR boost. So Does Google Authorship Still Matter? In a word, yes. If Google had actually lost its enthusiasm for and commitment to author identity as a future, important aspect of search, then this would have been the time to pull the band aid all the way off, rather than just removing photos. But, in fact, Authorship still works in search. Let me conclude with some reasons why I think Authorship still has value, and that author authority is still a major priority for Google search. 1. Authors still matter. The bylines are an indication that Google still cares who created a piece of content, and thinks that is significant and useful information for searchers. Every pixel of a search result is very valuable real estate. Google realizes that, and is still willing to give up some of that territory to an author's name. 2. Bylines are not invisible. Sure no one believes that a byline might capture the eye of someone viewing a search page to the same degree that a face photo probably did, but it does not follow that bylines are without value. More and more SEOs are advising their clients to optimize the meta descriptions for their pages. Why? Not because they are a ranking factor (they are not), but because they can have a significant effect on \"selling\" the searcher on clicking that result. We're used to hearing that the number one result for a given query usually gets the most clicks by far. But it doesn't get all the clicks, and on some queries the top result may not be as attractive as on others. If we all believed the top result was always the best, wouldn't we just click that \"Feeling lucky?\" button on Google's home page? The truth is that when the title of the top result doesn't immediately grab the searcher as a sure thing to fulfill her search need, she will begin looking for other clues in the other results. Among those will be the descriptive text under the results. When an author's name appears there, it may move the searcher to think the result is more reliable (written by a \"real person\"). And if that person is someone already known to and trusted by the searcher, the value goes up significantly. 3. Author and brand images now in personalized search. While limited in appearance, the fact that Google now will sometimes show an author photo or a brand image for Google+ content in personalized search indicates that they have not at all abandoned the idea that such image results can have value. It may be that they see that such highly-personalized recommendations have real value to searchers. It makes sense that if I regularly engage with Rand Fishkin on Google+, I will be more likely to value his content when I do a logged-in search with a relevant query. This may have implications for the future of author authority in search in general. It is conceivable that even if Google does implement it and expand it for content beyond Google+ posts, that it will remain highly personalized. In other words, Google may decide that it is most reliable to boost authors with whom you already have some affinity. 4. Authorship still builds your author rank database with Google. Using Authorship markup on your best content is still the clearest way to let Google see what you create and how people respond to it. You can be sure that Google has been tracking such data all along, and will continue to do so. Even if author authority is still not a ranking factor (outside of personalized search, and some search features such as In-Depth Articles), it likely will be someday. When that day comes, if Google has a clear history of your growth as a trusted author in your field, you may have a competitive advantage. 5. Google remains committed to author authority as a search factor. As recently as SMX Advanced in May, just a few weeks before the announcement of the end of author photos, Google's Matt Cutts reiterated his enthusiasm for author authority, while noting that it was a difficult and long-term project. For a transcript of his remarks, see my post here. Google understands that people are wired to trust other people long before they trust \"brands\" or websites. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Author Photos are Gone: Does Google Authorship Still Have Value?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Author Photos are Gone: Does Google Authorship Still Have Value?"
    },
    {
      "level": "H3",
      "text": "A Brief History of Google Authorship"
    },
    {
      "level": "H3",
      "text": "Google Authorship without Photos in Search"
    },
    {
      "level": "H3",
      "text": "So Why Were Author Photos Removed?"
    },
    {
      "level": "H3",
      "text": "What About Author Photo CTR?"
    },
    {
      "level": "H3",
      "text": "So Does Google Authorship Still Matter?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Traphagen\n          \n            Mark Traphagen\n          \n            Mark Traphagen"
}