{
  "url": "https://moz.com/blog/authoritative-content-funnel-whiteboard-friday",
  "slug": "authoritative-content-funnel-whiteboard-friday",
  "title": "The Authoritative Content Funnel — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In today’s episode of Whiteboard Friday, digital marketing expert Amanda Milligan walks you through the three parts that make up a content funnel for building authority, as well as the types of content that fit into each one.",
  "content": "The Authoritative Content Funnel — Whiteboard Friday Whiteboard Friday | Content Marketing By: Amanda Milligan November 11, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Milligan November 11, 2022 The Authoritative Content Funnel — Whiteboard Friday Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In today’s episode of Whiteboard Friday, digital marketing expert Amanda Milligan walks you through the three parts that make up a content funnel for building authority, as well as the types of content that fit into each one. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi, everyone. My name is Amanda Milligan. I am the Head of Marketing at Stacker Studio, and I am here to talk about something that I made up that I hope is very useful to you all. It is the authoritative content funnel. So the reason that I put this together is because of conversations I was having with folks about I'm always talking about authoritative content and I realized that there was a mismatch of what other people thought I was talking about and what I was talking about. What I realized is that there are so many different types and we need to be thinking about them in a certain context, and I thought the easiest thing to start this brainstorm was to think about it overlaid the typical content funnel that we're all used to. So what I'm going to do today is walk through those different categories, explain how I think about it, and then I would love to hear your feedback after watching this if there's something that I missed or anything else that we should explore. Decision So let's start down here at the bottom with our favorite, the decision stage. I have written here, \"Illustrate that your brand is the best solution.\" So in terms of building authority at the decision stage of the funnel, you're trying to reinforce that the person who's on your website or really anywhere is making the right decision. They're almost there, right? Like they have pretty much decided they want to go with you. Don't give them a reason to doubt themselves or to back out. Demos The way you see a lot of people do this, demos are good example of this. Even demos could almost be a little bit higher in the funnel. But it's a way of reassuring people, okay, this tool does what I thought it did. I'm getting the validation that everything that I need it to do is there. I'm seeing it for myself. I don't have to just base it off what they're telling me. I get to see it firsthand. That's helping to build authority. Testimonials Testimonials, especially in the B2B world, you'll see oftentimes a contact form will have testimonials listed next to them, and that's a way of saying, \"You're right. You do want to fill out this contact form or this lead form. Look at these authoritative brands who have trusted us in the past.\" So they're leveraging the authority of their previous or current clients to show that they work with great businesses like yours and to validate that you're making the right decision. Reviews Same thing with reviews. Whether it's your product reviews or it's just the star ratings, the average star ratings on a third-party platform, you'll see that come up a lot, third-party validation, and you'll also hear this referenced as like authority signals. It could be client logos or places you've been published, all that sort of thing. All of these are lingering around conversion pages because they're trying to validate to you, \"Yes, work with us. It's a good decision.\" So that is the decision part of the funnel. Consideration Consideration gets a little more nebulous. So you're trying to show that you understand the nuance of your audience's problems and that you could be a good solution for them. It doesn't always have to include your product or service, but it can. However, what it does need to do is reflect that you have a very good understanding of your buyer personas and your potential customers. Case studies So a lot of the examples are case studies. That's a little more branded, but you're showing I know what your problem is and I can show you how we did this, again, for other companies similar to yours and how we were successful. How-tos and guides But then you also have more higher in the funnel examples of how-tos or guides. So if you know, if you've done your keyword research or your question research and you understand what your target audience or even a little bit more of a general audience is looking for in your space and you're able to create content that answers those questions, people are going to start to trust you because you're helping them. Again, we're talking about not just content. If we zoomed out, there are other goals for content. We're already talking about some of them — conversion. But if we're talking about just authority, the way that you're building authority is by showing you know the answers to their questions, period. So the thought process here is: What are the best questions for us to answer no matter where they fall as long as we're showing that we care about them and we're the best people to answer their questions? Awareness Then we have awareness. This is what my career has primarily been based on, so I'm a little biased toward awareness because I think it's the biggest area of opportunity for marketers. It makes sense to focus here, especially in the beginning. You know that you need to convert. When you get the traffic, you know you want to convert those people. Completely understand. But I think the biggest area of opportunity and where a lot of people can start surpassing their competitors is up here, building awareness and authoritative awareness in particular. The way to do that is to create content that is not specifically about what you're trying to sell but about bigger topics in your industry and doing it in a particular way. So that's the other thing. Whether you have somebody in-house who is already an expert, definitely you can leverage that, but a lot of us don't have that. A lot of us are at companies where there's already somebody who's kind of famous in the field and everybody already inherently trusts. So you need to try to think about how you can create content that's going to build authority at the top of the funnel. Newsworthy content At Stacker, we're a newswire that creates stories usually based on data. We create newsworthy content on behalf of our brand partners. So we operate in the top of the funnel. Newsworthy content is essentially anything that a news site would deem worthy of picking up. So that's kind of a whole other strategy and a whole other Whiteboard Friday. But any kind of original data applies as well. A lot of companies will run surveys or they'll use internal data and share that, and that's really interesting to audiences. Again, you could do some digital PR and get that picked up. Or also really common are annual reports, and that often does take internal data and supplies information and trends to a broader industry for their benefit. But the difference here is you're trying to show readers that you're willing to invest time and money into creating content that's not just about selling for you. It's about helping the broader audience. But it's also about showing Google this. The way that that happens is when you're creating newsworthy content or any kind of like digital PR type content and earning great news mentions and links, that signals to Google that you're an authority too, and that's why there's a lot of missed opportunity if you don't do this part of the funnel. So that's how I think about it. I would love to hear how you think about it. If this is a topic that's interesting to you, I run a newsletter where I talk about stuff like this all the time. It's called \"Newsworthy,\" and you can go to this URL here and subscribe and say hi. If you reply to it, it's my email, so please feel free. But also, as you can see, I talk nonstop and I can talk about marketing forever, so please feel free to tweet me. I love to meet new people and to talk all things content, authority, newsworthiness, all that good stuff. So in the meantime, thank you so much for watching. I really appreciate it, and I hope to talk to you soon. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Authoritative Content Funnel — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Authoritative Content Funnel — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Decision"
    },
    {
      "level": "H3",
      "text": "Demos"
    },
    {
      "level": "H3",
      "text": "Testimonials"
    },
    {
      "level": "H3",
      "text": "Reviews"
    },
    {
      "level": "H2",
      "text": "Consideration"
    },
    {
      "level": "H3",
      "text": "Case studies"
    },
    {
      "level": "H3",
      "text": "How-tos and guides"
    },
    {
      "level": "H2",
      "text": "Awareness"
    },
    {
      "level": "H3",
      "text": "Newsworthy content"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Amanda Milligan\n          \n            Amanda Milligan"
}