{
  "url": "https://moz.com/blog/authoritative-links-and-ranking",
  "slug": "authoritative-links-and-ranking",
  "title": "The Correlation Between Authoritative Links and Ranking [SEO Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the past five years, the team at Perficient has conducted continuous studies to evaluate the lasting impact of links on rankings. These studies consistently show that links matter as a ranking factor, but they also show that Google is dialing up their emphasis on the quality/authority of those…",
  "content": "The Correlation Between Authoritative Links and Ranking [SEO Study] Advanced SEO | SEO Analytics | Link Building By: Eric Enge December 9, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge December 9, 2020 The Correlation Between Authoritative Links and Ranking [SEO Study] Advanced SEO | SEO Analytics | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the past five years, our team at Perficient has conducted continuous studies to evaluate the lasting impact of links on rankings. These studies consistently show that links matter as a ranking factor, but they also show that Google is dialing up their emphasis on the quality/authority of those links. We can say this because of the strong correlation our most recent studies show between the Domain Authority (DA) and Page Authority (PA) of linking pages and the rankings of pages receiving the links. Each year, Moz has graciously provided us with access to their Link Explorer index, where we obtain the raw data to perform our analysis. In these studies, we perform Spearman Correlation analyses to show how the following variables correlate with ranking: Number of links to the ranking pageDA of links to the ranking pagePA of links to the ranking page Please note that Moz has never compensated us for including, or asked us to include, the DA and PA calculations — we have chosen to do that of our own volition. In fact, Moz staff only learned that we had done so in early October of 2020, even though we published the post with our findings on April 16, 2020 (to be honest, I was too busy to catch up with the Moz team and let them know). In short, there is no quid pro quo here. Study methodology Go ahead and jump down to the study results section if you just want to see how things turned out! We have been conducting this study on a nearly annual basis since May of 2016. In 2016, we started with an initial query set of 6K queries, but have expanded to 32K queries over time. The queries were obtained by pulling keyword ranking reports for web sites in three different target market sectors, and then manually reviewed to remove any queries that were poorly formed or not relevant to that sector. The market sectors we looked at were technology, healthcare, and finance. Here is the breakout of the size of the query sets across the five studies we have done so far: May 2016: 6K queriesAug 2016: 16K queriesMay 2017: 16K queriesAugust 2018: 27K queriesDecember 2019: 32K queries Each of the expanded query sets includes all of the queries from the prior studies, which allows us to track the results on a consistent basis all the way back to 2016. In putting together this study, I also consulted with two experts in statistics: Paul Berger of Bentley University, and Per Enge, formerly of Stanford University. Because of the nature and structure of the data set, it was decided that the best approach was to calculate the quadratic mean of the Spearman Correlation for all the queries in the study. I went with this approach because it uses the square of the correlation variables (where the correlation value is R, the quadratic mean uses R squared). This is important because the correlation variable R is useful to know, perhaps, but it does not allow you to make a specific statement about what it means in real world terms. The R squared value, however, is more interesting. If you have an R squared value of 0.56, for example, we can say that 56% of the variability of the observed behavior Y (in our case, rankings) is caused by the test variable X (in our study, count of links, or DA/PA). Here’s a visual on how this calculation process works: Summary of the results As part of the study, we pulled data on the growth of the Link Explorer index over time. Since we have data on the index size over three years for our 16K query set, we looked at this snapshot of the data to show how the Link Explorer index has expanded: One of the core purposes of the study was finding the correlation between the number of links a page has and its ranking. Of course, the relevance and quality of the content are the most important factors in ranking — they have to be. That noted, here is the quadratic mean calculation result for how the quantity of links a page has correlates to its ranking: This score is a bit down from past years (the August 2018 score was 0.293, but still indicates that the number of links to a page correlates in a meaningful way with the ranking of that page). However, we also took a close look at the correlation of Moz DA and PA with the ranking of a page. Here are the results that we saw for that evaluation: This shows that Moz DA and PA are both better predictors of ranking position than the total link count. The scores of 0.328 and 0.307 are both very strong correlation scores in an environment as complex as organic search. This is an important finding, as it lines up with what many of us in the SEO community have believed for a long time: that the sites you get links from matters more than the sheer number of links. In addition, it's likely that most of the pages ranking in our query set that had a large number of links likely had a significant number of higher authority links as well. Please note that the Moz team has let me know they are working on an update to the algorithm that powers PA, which will be released in the near future, and they believe that this will improve these results. Conclusion This data confirms that obtaining links from more authoritative sites has more value than obtaining a large quantity of links. Google's perspective of what makes better links is likely more nuanced than a simple metric like PageRank (the Google metric that DA and PA are most similar to). This may include evaluation of relevance to the topic, and the overall quality perception of the linking site. As SEO professionals, increasing our own site quality and authority remains one of our core responsibilities in helping our sites, or our client's sites, grow. You can see the full original Links as a Ranking Factor study here. Important Note: Google does not have access to Moz's DA and PA metric data and Google does not use Moz DA or Moz PA as a ranking factor. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Correlation Between Authoritative Links and Ranking [SEO Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Correlation Between Authoritative Links and Ranking [SEO Study]"
    },
    {
      "level": "H2",
      "text": "Study methodology"
    },
    {
      "level": "H2",
      "text": "Summary of the results"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}