{
  "url": "https://moz.com/blog/avoid-google-ads-mistakes",
  "slug": "avoid-google-ads-mistakes",
  "title": "Google Ads Mistakes to Avoid — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO and PPC can work together for benefits all around, especially when it comes to optimizing your Google Ads. In this informative Whiteboard Friday, Dana DiTomaso explains how you can harness the power of both SEO and PPC for a better Google experience overall.",
  "content": "Google Ads Mistakes to Avoid — Best of Whiteboard Friday Paid Search Marketing (PPC) | Search Engines | Whiteboard Friday By: Dana DiTomaso August 28, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso August 28, 2020 Google Ads Mistakes to Avoid — Best of Whiteboard Friday Paid Search Marketing (PPC) | Search Engines | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Contrary to popular belief, SEO and PPC aren't at opposite ends of the spectrum. There are plenty of ways the two search disciplines can work together for benefits all around, especially when it comes to optimizing your Google Ads. In this informative Whiteboard Friday episode from last Spring, MozCon speaker and Kick Point President Dana DiTomaso explains how you can harness the power of both SEO and PPC for a better Google experience overall. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, Moz readers. My name is Dana DiTomaso, and I'm President and partner at Kick Point. We're a digital marketing agency way up in the frozen wilds of Edmonton, Alberta. Today I'm going be talking to you about PPC, and I know you're thinking, \"This is an SEO blog. What are you doing here talking about PPC?\" But one of my resolutions for 2019 is to bring together SEO and PPC people, because SEO can learn a lot from PPC, and yes, PPC, you also can learn a lot from SEO. I know PPC people are like, \"We just do paid. It's so great.\" But trust me, both can work together. In our agency, we do both SEO and PPC, and we work with a lot of companies who have one person, sometimes two and they're doing everything. One of the things we try to do is help them run better Ads campaigns. Here I have tips on things that we see all the time, when we start working with a new Ads account, that we end up fixing, and hopefully I can pass this on to you so you can fix it before you have to call an agency to come and fix it for you. One of the things is this is actually a much longer piece than what I can present on this whiteboard. There's only so much room. There is actually a blog post on our website, which you can find here. Please check that out and that will have the full nine tips. But I'm just going to break it down to a few today. 1. Too many keywords First thing, too many keywords. We see this a lot where people, in Google it says make sure to put together keywords that have the same sort of theme. But your theme can be really specific, or it can be kind of vague. This is an example, a real example that we got, where the keyword examples were all lawyer themes, so \"defense lawyer,\" \"criminal lawyer,\"\"dui lawyer,\" \"assault lawyer,\" \"sexual assault lawyer.\" Technically, they all have the same theme of \"lawyer,\"but that's way too vague for it to be all in one single ad group, because what kind of ad are you going to show? \"We are lawyers. Call us.\" It's not specific enough. Take for example \"dui lawyer,\"which I know is a really very competitive niche, and then you can do [dui lawyer], [dui lawyer seattle], and then \"dui lawyer\" and +dui+lawyer+seattle spelled out a little bit differently. I'll talk about that in a second. By taking this one thing and then breaking it down into a much more specific ad group, you can really have much more control. This is a consistent theme in all the tips I talk about is much more control over where you're spending your money, what keywords you're spending it on, what your ads are, having a much better landing page to ad match, which is also really important. It just makes your ad life so much easier when you've got it in all of those ad groups. I know it might seem intimidating. It's like, \"Well, I have three ad groups now.If I follow your tips, I'm going to have 40.\" But at the same time, it's way easier to manage 40 well organized groups than it is to manage 3 really badly organized groups. Keep that in mind. 2. Picking the right match type The next thing is picking the right match type. You can see here I've got this bracket stuff and this phrase stuff and these plus signs. There are really four match types. Broad match There's broad match, which is terrible and don't ever use it. Broad match is just you writing out the keyword, and then Google just displays it for whatever it feels like is relevant to that particular search. For example, we've seen examples where it's like a catering company and they'll have \"catering\" as a keyword, and they're showing up for all sorts of phrases in catering where they can't provide catering, so searching for a venue that only does in-house catering. Or they're spending money on a catering conference or just totally irrelevant stuff. Do not use broad match. Broad match modifier (BMM) The upgrade from that is what's called broad match modifier or BMM, and that's where these plus signs come in. This is really the words dui, lawyer, and seattle in any order, but they all have to exist and other things can exist around that. It could be, \"I need a DUI lawyer in Seattle.\" \"I live in Seattle. I need a DUI lawyer.\" That would also work for that particular keyword. Phrase match The next type is phrase, and that's in the quotes. This \"dui lawyer\" is the example here, and then you can have anything before it or you can have anything after it, but you can't have something in between it. It couldn't be \"dui who is really great at being a lawyer\" for example. Weak example, but you get the idea. You can't just shove stuff in the middle of a phrase match. Exact match Then exact match is what's in the brackets here, and that is just those words and nothing else. If I have [dui lawyer], this keyword, if I didn't have [dui lawyer seattle], this keyword would not trigger if somebody searches [dui lawyer seattle]. That's as specific as possible. You really want to try that for your most competitive keywords. This is the really expensive stuff, because you do not want to waste one single penny on anything that is irrelevant to that particular search. This is your head on, it's really expensive every click. I've got to make sure I'm getting the most money possible for those clicks. That's where you really want to use exact match. 3. Only one ad per group Next, tips. The next thing is what we see is a lot of people who have only one ad per group. Have at least 3 ads per group This is not a tip. This is a criticism up here. The thing is that maybe, again, you think it's easy for management, but it's really hard to see what's going to work, because if you're not always testing, how are you going to know if you could do better? Make sure to have at least three ads per group. Add emotional triggers into your ad copy Then look at your ad copy. We see a lot of just generic like, \"We are the best lawyers. Call us.\" There's nothing there that says I need to call these people. Really think about how you can add those emotional triggers into your copy. Talk to your client or your team, if you work in-house, and find out what are the things that people say when they call. What are the things where they say, \"Wow, you really helped me with this\" or, \"I was feeling like this and then you came in and I just felt so much better.\" That can really help to spice up your ads. We don't want to get too fancy with this, but we certainly want to make something that's going to help you stand out. Really add those emotional triggers into your ad copy. Make sure to have a call to action Then the next thing is making sure to have a call to action, which seems basic because you think it's an ad. If you click it, that's the call to action. But sometimes people on the Internet, they're not necessarily thinking. You just want to say, \"You know what? Just call me or email me or we're open 24 hours.\" Just be really specific on what you want the person to do when they look at the ad. Just spell it out for them. I know it seems silly. Just tell them. Just tell them what you want them to do. That's all you need to do. Use extensions! Then make sure you add in all of the extensions. In Google Ads, if you're not super familiar with the platform, there's a section called Extensions. These are things like when the address shows up under an ad, or you've got those little links that come up, or you've got somebody saying we're open 24 hours, for example. There are all sorts of different extensions that you can use. Just put in all the extensions that you possibly can for every single one of your groups. Then they won't all trigger all at the same time, but at least they're there and it's possible that they could trigger. If they do, that's give your ad more real estate versus your competition, which is really great on mobile because ads take up a lot of space at the top of a mobile search. You want to make sure to shove your competition as far as you possibly can down that search so you own as much of that property as you possibly can. One thing that I do see people doing incorrectly with extensions, though, is setting extensions at say the campaign level, and then you have different ad groups that cover different themes. Going back to this example over here, with the different types of lawyers, let's say you had an extension that talks specifically about DUI law, but then it was triggering on say sexual assault law. You don't want that to happen. Make sure you have really fine-tuned control over your different extensions so you're showing the right extension with the right type of keyword and the right type of ad. The other thing that we see a lot is where people have location extensions and they're showing all the location extensions where they should not be showing all the location extensions. You've got an ad group for, say, Seattle, and it's talking about this new home development that you have, and because you just loaded in all of your location extensions, suddenly you're showing extensions for something in say San Francisco. It's just because you haven't filtered properly. Really double-check to make sure that you've got your filter set up properly for your location extensions and that you're showing the right location extension for the right ad. I know that Google says, \"We'll pick the locations closest to the client.\" But you don't know where that person is searching right there. They could be in San Francisco at that moment and searching for new home builds in Seattle, because maybe they're thinking about moving from San Francisco to Seattle. You don't want them to see the stuff that's there. You want them to see the stuff that's at the place where they're intending to be. Really make sure you control that. 4. Keep display and search separate Last, but not least, keep display and search separate. By default, Google so helpfully says, \"We'll just show your ads everywhere. It's totally cool. This is what we want everyone to do.\" Don't do that. This is what makes Google money. It does not make you money. The reason why is because display network, which is where you're going to a website and then you see an ad, and search network, when you type in the stuff and you see an ad, are two totally different beasts. Avoid showing text ads on the display network for greater campaign control It's really a different type of experience. To be honest, if you take your search campaigns, which are text-based ads, and now you're showing them on websites, you're showing a boring text ad on a website that already has like 50 blinky things and click here. They're probably not seeing us and maybe they have an ad blocker installed. But if they are, certainly your text ad, which is kind of boring and not intended for that medium, is not going to be the thing that stands out. Really you're just wasting your money because you'll end up with lower relevancy, less clicks, and then Google thinks that your group is bad. Then you'll end up paying more because Google thinks your group is bad. It really gives you that extra control by saying, \"This is the search campaign. It's only on search. This is the display campaign. It's only on display.\" Keep the two of them totally separate. Then you have lots of control over the search ads being for search and the display ads being for display. Don't mix those two up. Make sure to uncheck that by default. Definitely there are more tips on our blog here. But I hope that this will help you get started. SEOs, if you've never done a PPC campaign in your life, I recommend just setting one up. Put 50 bucks behind that thing. Just try it out, because I think what will really help you is understanding more of how people search, because as we get less and less keyword data from the different tools that we use to figure out what the heck are people googling when they try to search for our business, ads give you some of that data back. That's where ads can be a really great ally in trying to get better SEO results. I hope you found this enjoyable. Thanks so much. Video transcription by Speechpad.com Ready for more? You'll uncover even more SEO goodness in the MozCon 2020 video bundle. At this year's special low price of $129, this is invaluable content you can access again and again throughout the year to inspire and ignite your SEO strategy: 21 full-length videos from some of the brightest minds in digital marketingInstant downloads and streaming to your computer, tablet, or mobile deviceDownloadable slide decks for presentations Get my MozCon 2020 video bundle Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Ads Mistakes to Avoid — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Ads Mistakes to Avoid — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Too many keywords"
    },
    {
      "level": "H2",
      "text": "2. Picking the right match type"
    },
    {
      "level": "H3",
      "text": "Broad match"
    },
    {
      "level": "H3",
      "text": "Broad match modifier (BMM)"
    },
    {
      "level": "H3",
      "text": "Phrase match"
    },
    {
      "level": "H3",
      "text": "Exact match"
    },
    {
      "level": "H2",
      "text": "3. Only one ad per group"
    },
    {
      "level": "H3",
      "text": "Have at least 3 ads per group"
    },
    {
      "level": "H3",
      "text": "Add emotional triggers into your ad copy"
    },
    {
      "level": "H3",
      "text": "Make sure to have a call to action"
    },
    {
      "level": "H3",
      "text": "Use extensions!"
    },
    {
      "level": "H2",
      "text": "4. Keep display and search separate"
    },
    {
      "level": "H3",
      "text": "Avoid showing text ads on the display network for greater campaign control"
    },
    {
      "level": "H2",
      "text": "Ready for more?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}