{
  "url": "https://moz.com/blog/avoid-unrealistic-seo-expectations-whiteboard-friday",
  "slug": "avoid-unrealistic-seo-expectations-whiteboard-friday",
  "title": "How to Avoid the Unrealistic Expectations SEOs Often Create - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Making promises about SEO results too often leads to broken dreams and shredded contracts. In today's Whiteboard Friday, Rand shows us how to set expectations that lead to excitement but help prevent costly misunderstandings.",
  "content": "How to Avoid the Unrealistic Expectations SEOs Often Create Whiteboard Friday | SEO Basics By: Rand Fishkin December 12, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 12, 2014 How to Avoid the Unrealistic Expectations SEOs Often Create Whiteboard Friday | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With all the changes we've seen in the field of SEO in recent years, we need to think differently about how we pitch our work to others. If we don't, we run the risk of creating unreal expectations and disappointing our clients and companies. In today's Whiteboard Friday, Rand explains how to set expectations that will lead to excitement without the subsequent let-down. For reference, here's a still of this week's whiteboard! Video transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat a little bit about the expectations that SEOs create and sometimes falsely create. It's not always our fault, but it is always our responsibility to fix the expectations that we create with our teams, our managers, our executives, and, if we're consultants, with our clients. So here's the problem. This is a conversation that I see happen a lot of the time. Here's our friendly SEO guy over here, and he's telling his client, \"Hey, if we can rank on page 1 for even 10% of all these terms that I've selected, we're going to drive a 500% increase in leads.\" Here's the client over here, and she's thinking to herself, \"That sounds amazing. 500% increase in leads, that's going to do wonderful things for my business. So let's invest in SEO. This is going to be great. We only have to get 10% of these keywords on there. I don't know anything about SEO, but that sounds totally possible.\" Six months later, after all sort of stymieing and challenging problems, here she is going, \"You told me we'd increase our leads by 500%!\" There's the SEO saying, \"Well yeah, but we have to get the rankings first, and we haven't done that yet. I said we'd get the leads once we got the rankings.\" This kind of expectation and many others like it are a huge challenge. It is the case that modern SEO takes a lot of time to show results. Modern content marketing works the same way. You're not going to start producing blog posts or interactive content or big content pieces and 3 months from now go, \"Well, we made 50 new content pieces, and thus our traffic has tripled.\" That's not how it works. The problem here is that SEO just doesn't look like this anymore. It did, kind of, at one point. It really did. We used to engage in an SEO contract. We'd make some changes to the existing pages, do some keyword targeting, some optimization, maybe fix things up that weren't SEO friendly on the site, get our link structure in order. Great. Do a little bit of link building to the right kinds of pages that we need on our site from the right kind of places. We'd get those rankings. Now we can easily prove the value of the search traffic that's coming through by looking at the keyword referrals in our analytics report, because keyword traffic is showing. This process has been broken over the last five, six, seven years. But expectations have not caught up to where we are today. Modern SEO nowadays is really like this. You engage in that SEO contract, and then the SEO's job is to be much more than an SEO, because there are so many factors that influence modern search rankings and modern search algorithms that really a great SEO, in order to have impact, has to go, \"All right, now we're going to start the audit.\" The audit isn't going to look at which pages do you have on the site and what keywords do you want to match up and which ones do we need to fix, or just link structure or even things like schema. Well, let's look at the content and the user experience and the branding and the PR, and we'll check out your accessibility and speed and keyword targeting. We'll do some competitive analysis, etc. Dozens of things that we're going to potentially look at because all of them can impact SEO. Yikes! Then, we're not done. We're going to determine which investments that we could possibly make into all of these things, almost all of which probably need some form of fixing. Some are more broken than others. Some we have an actual team that could go and fix them. Some of those teams have bandwidth and don't. Some of those projects have executives who will approve them or not. We're going to figure out which ones are possible, which ones are most likely to be done and actually drive ROI. Then we're going to work across teams and executives and people to get all those different things done, because one human being can't handle all of them unless we're talking about a very, very tiny site. Then we're going to need to bolster a wide range of offsite signals, all of the things that we've talked about historically on Whiteboard Friday, everything from actual links to things around engagement to social media signals that correlate with those to PR and branding and voice and coverage. Now, after months of waiting, if we've improved the right things, we'll start to see creeping up our rankings, and we'll be able to measure that from the traffic that pages receive. But we won't be able to say, \"Well, specifically this page now ranks higher for this keyword, and that keyword now sends us this amount of traffic,\" because keyword not provided is taking away that data, making it very, very hard to see the value of visitors directly from search. That's very frustrating This is the new SEO process. You might be asking yourself, \"Given these immense challenges, who in the world is even going to invest in SEO anymore?\" The answer is, well, people who for the last decade have made a fortune or made a living on SEO, people who are aware of the power that SEO can drive, people who are aware of the fact that search continues to grow massively, that the channel is still hugely valuable, that it drives direct revenue and value in far greater quantity than social media by itself or content marketing by itself without SEO as a channel. The people who are going to invest successfully, though, are those whose expectations are properly set. Everybody else is going to get somewhere in here, and they're going to give up. They're going to fire their SEO. You know what one of the things that really nags at me is? Ruth Burr mentioned this on Twitter the other day. Ruth said, \"When your plumber fails to fix your pipes, you don't assume that plumbing is a dead industry that no one should ever invest in. But when your SEO fails to get you rankings or traffic that you can measure, you assume all SEO is dead and all SEO is bad.\" That sucks. That's a hard reality to live in, but it's the one that we do live in. I do have a solution though, and the solution isn't just showing how this process works versus how old-school SEO works. It's to craft a timeline, an expectation timeline. When you're signing a contract or when you're pitching a project, or when you're talking about, \"Hey, this is what were going to do for SEO,\" try showing a timeline of the expectations. Instead of saying, \"If we can rank on page one,\" say, \"If we can complete our audit and fix the things we determine that need to be fixed and prioritize those fixes in the order we think they are, then we can make the right kinds of content investments, and then we can get the amplification and offsite signals that we need starting to appear and grow our engagement. Then we can expect great SEO results.\" Each one of these is contingent on the last one. So six months later, your boss, your manger, or your client is going to say, \"Hey, how did those content investments go?\" You can say, \"Well look, here's the content we've created, and this is how it's performing, and this is what we're going to do to change those performances.\" The expectation won't be, \"Hey, you promised me great SEO.\" The promise was we're going to make these fixes, which we did, and we're going to complete that audit, which we did. Now we're working on these content investments, and here's how that's going. Then we're going to work on this, and then we're going to work on that. This is a great way to show expectations and to create the right kind of mindset in people who are going to be investing in SEO. It's also a great way not to get yourself into hot water when you don't get that 500% increase 3 months or 6 months after you said we're going to start the SEO process. All right everyone, I'd love to hear from you in the comments. Look forward to chatting it up and having a discussion about modern SEO and old-school SEO and expectations that clients and managers have got. We will see you again, next week, for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Avoid the Unrealistic Expectations SEOs Often Create"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Avoid the Unrealistic Expectations SEOs Often Create"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}