{
  "url": "https://moz.com/blog/b2b-seo-success-roadmap",
  "slug": "b2b-seo-success-roadmap",
  "title": "The Roadmap to B2B SEO Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It can be hard to navigate the B2B marketing landscape, so today, guest host Austin Peachey walks you through the stops on Obility’s SEO roadmap.",
  "content": "The Roadmap to B2B SEO Success Whiteboard Friday | Marketing Industry | SEO Basics By: Austin Peachey August 13, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Austin Peachey August 13, 2021 The Roadmap to B2B SEO Success Whiteboard Friday | Marketing Industry | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It can be hard to navigate the B2B marketing landscape. Today, guest host Austin Peachey walks you through the stops on the roadmap that his team at Obility uses to create successful B2B SEO strategies. Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Hey there, Moz fans, and welcome to another edition of Whiteboard Friday. I'm Austin Peachey, SEO manager at Obility, a Portland-based B2B marketing agency. Working for a B2B-focused agency, I know it can be hard to navigate the B2B marketing landscape. If you want to succeed in B2B SEO, you need to make sure you follow the proper steps. Today, I'm going to walk you through our roadmap for SEO success. Data collection The first step on this road map is data collection. It's so important to have all the data you collect be clean and precise because it's going to help you make crucial decisions down the road. Three key pieces to that are tracking, filters, and goals. Tracking For tracking, you need to ensure that your scripts are properly set up so they're collecting data every day, and to minimize scripts on your website, try to implement as many as you can through Google Tag Manager. Filters Filters are the next step that are really important for clean data. These will help you to remove website sessions that have no purpose in your analysis. The three key filters to include would be: IP filters to remove traffic from your client, your office, or remote workers; domain filters to remove traffic from commonly known spam websites; and host names filters to ensure that the sessions are actually hitting your website. Goals Lastly, it's very important to have your goals properly set up and you're not tracking things like bounce rate or time on site as a recorded goal. These are good metrics to check in on the health of your site, but they're not going to be meaningful enough to make strategic changes on down the road. When it comes to B2B SEO, we focus on two different types of goals — micro and macro conversions. Micro conversions may be things like downloading a white paper or signing up for a newsletter. Macro conversions focus on bigger, lead-based goals, like form fills or demo requests. The buyer's journey is so much longer when it comes to B2B versus B2C, and you need to make sure that you are there with conversion points no matter where in the cycle they are. Technical SEO Once you get your data collection properly working, the next step is to look at the technical health of your website and anything that might impact your indexation or traffic coming into the site. Focus first on critical crawler issues that may be bogging down your site. These could be 404 errors, duplicate content, and website speed performance. 404 errors affect the crawlability of your site as well as the user experience as they're actually going through your content. Duplicate content errors can be as major as having two full instances of your website available to crawl as well as something as small as just having a blog post posted twice on your website. Big or small, though, it's really important to have unique content throughout your entire site. Site speed and Core Web Vitals are important to both SEO and the user experience. Work with your web developer to minimize the scripts used on the site, optimize your images, and really just clean up the code. Once your main crawler issues have been addressed, you can start looking at creating well-optimized title tags and meta descriptions. Make sure these are written for the user and not the search engines. A title tag isn't going to make a difference in your position on Google, but it could make a difference in somebody clicking on your posting versus a competitor. The Moz crawler is a great tool to help you improve the health of your site. It provides an organized breakdown of all the issues your site might be having as well as tips on how to remedy those issues. Keyword research Now that your site is in tip-top shape, the next step is to move and do keyword research. When doing SEO for B2B companies, it's important to remember that the customer's journey is so much longer than in B2C. These purchases are larger, and there are more stakeholders that are part of the buying process. Because of this, when you're doing your keyword research, you need to think about keywords throughout the entire consumer's journey, targeting keywords at the top of the funnel all the way to the bottom of the funnel. Think of it in this way. If your product is a software that does task management, you can't just focus on optimizing for the bottom of the funnel keywords, such as task management software or business organization tool. Instead think about the keywords that your user might be searching for just because they have a problem — what is the best way to keep my team organized or tips on how to meet deadlines on time. Start your keyword research by reaching out to your client and seeing what keywords are important to them and what they want to focus on. Then once you have that seed list, expand that by exploring their site, competitor websites, Google Search Console, and keyword tools, like the Moz Keyword Explorer. Once you have this list, it's time to actually prioritize those keywords, and by prioritize, we don't just mean whatever has the highest volume on a monthly basis. It's much more about what is relevant to your product and your consumers and what will eventually drive conversions down the road. Create content Then now that we know these keywords, our next stop is to actually focus on the content development that goes with these keywords. Evaluate the existing content on your website and determine whether you need to build something brand new, expand on what you already have, or more likely a combination of both of those things. As you develop this content, you have to remember the golden rule — write for users, don't write for search engines. The best content is the content people actually find useful and answers their questions. Make sure your content is easy to read, links to other relevant topics within the content, and covers the keywords you're focusing on as effectively as possible. That doesn't always mean writing the longest piece, but a piece that really delivers the content most effectively to the user. If you aren't sure what to write about, a good place to start is the search engine results for the keyword currently. What currently ranks well? What questions are they answering, and what was the intent of the user when they made that search? Answering these questions will really lead you to develop better content down the road. Now, as mentioned before, with your content like your keywords, you do need to follow the user through the funnel. Make sure you're providing content through every stage of where they might be in the buying cycle. So having top of funnel content, like strategies on how to meet deadlines, will be just as important as detailed content on the software you provide and the benefits it provides to the users. By doing this, your company will be seen and be a part of their decision-making process, whether they are just beginning to solve their problem or they're ready to go out and make a final purchase. Conversion rate optimization The last stop on our journey is conversion rate optimization. You figured out your keywords. You have great content. But that really doesn't mean much if they're not coming in and actually purchasing your product. There are multiple points of conversion rate optimization that you need to pay attention to — search engine page conversion optimization, information seeker optimization, and lead optimization. As mentioned in our technical health assessment, search engine conversion rate optimization comes from your title tags and your meta descriptions. These are the first things your users see as they kind of start on their journey searching and finding answers. You need to make sure they're well-written and entice the user to actually click and learn more about you. Test out different wordings and see what really drives the most clicks. Information seeker conversion rate optimization is for those users that are really at the beginning of their journey and they just need information. They're probably gathering it from many different points, but you just need to provide them with more information about you, whether it's a case study, a white paper, a video, or it's signing up for your newsletter program. Lead focus conversion rate optimization is really getting the user to perform the action, such as filling out a form, taking a product demo, anything that's kind of that final step before actually making a purchase. Maximizing these conversions is really what's going to help generate the most revenue for your business. The important thing to remember when doing conversion rate optimization is that you aren't just making guesses. Use heat mapping tools or A/B tests to determine what is actually working the best and then make strategic changes to your site based on those results. Well, there you have it, folks. That is our road map to B2B SEO success. Thank you very much for listening and I hope you all have a great day. Thank you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Roadmap to B2B SEO Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Roadmap to B2B SEO Success"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Data collection"
    },
    {
      "level": "H3",
      "text": "Tracking"
    },
    {
      "level": "H3",
      "text": "Filters"
    },
    {
      "level": "H3",
      "text": "Goals"
    },
    {
      "level": "H2",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Keyword research"
    },
    {
      "level": "H2",
      "text": "Create content"
    },
    {
      "level": "H2",
      "text": "Conversion rate optimization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Austin Peachey\n          \n            Austin Peachey\n          \n            Austin Peachey"
}