{
  "url": "https://moz.com/blog/backlinks-google-study",
  "slug": "backlinks-google-study",
  "title": "Can You Rank in Google Without Links? New Data Says Slim Chance - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For years, we've heard the drumbeat that marketers should stop focusing on links. While it's certainly true that marketers should avoid manipulative link building, the popular narrative would have us believe that external links aren't important in Google's ranking algorithms, and that link building…",
  "content": "Can You Rank in Google Without Links? New Data Says Slim Chance Link Building | Search Engines | Advanced SEO By: Cyrus Shepard June 15, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard June 15, 2015 Can You Rank in Google Without Links? New Data Says Slim Chance Link Building | Search Engines | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For years now, we've heard the drumbeat from Google that marketers should stop focusing on building links. While it's accepted wisdom that you should avoid manipulative link building to rank higher in search results, the popular narrative would have us believe that external links aren't important in Google's ranking algorithms at all, and that link building can be safely ignored. Is there any truth to this? To find out, we mined new information from our upcoming biannual ranking correlation study, conducted by Moz's scientist, Dr. Matthew Peters. https://moz.com/learn/seo/external-link Moz's study examined the top 50 Google search results for approximately 15,000 keywords. This allowed us to examine not only what factors correlate with higher search rankings, but also how frequently those characteristics are seen. At this point I must insert the usual caveat that correlation is not causation. Simply because a feature is strongly related to high rankings, this doesn't prove or disprove that Google actually uses it in its algorithm. That said, it sure is a hint! The relationship between external links and rankings When we look at what the study found about links, we find a strong relationship. The correlation between higher rankings and the number of linking websites (root domains) sits at .30. This number seems small, but it's actually one of the highest correlations the study found. (Smaller correlations are also not surprising—with over 200 ranking signals, Google specifically designed their algorithm so that one factor doesn't dominate the others.) Even more telling is the number of websites we found in the top results that had external backlinks, or rather, the lack thereof. Out of the top results, a full 99.2% of all websites had at least one external link. (The remaining .8% is well within the margin of error expected between Mozscape and Google's own link index.) The study found almost no websites ranking for competitive search phrases that didn't have at least a single external link pointing at them, and most had significantly more links. In other words, if you're looking for a site that ranks well with no external links, be prepared to look for a very long time. That said, the study did find numerous examples where individual pages ranked just fine without specific external links, as long as the website itself had external links pointing at it. For example, consider when The New York Times publishes a new page. Because it's new, it has no external links yet. But because The New York Times' website itself has tons of external links, it's possible for the new page to rank. In all, 77.8% of individual pages in the top results had at least one external link from another site, which means 22.2% of individual pages ranked with no external links. What the data says about links and Google rankings There are a number of conclusions you can reasonably draw from these numbers. 1. External links are almost always present for competitive searches If you want to rank for anything that's even remotely competitive, the chances of finding a website ranking without external links is very rare indeed. 2. It's possible to rank individual pages without links As long as your website itself is linked externally, it appears more than possible to rank individual pages on your site, even if those pages themselves don't have external links. That said, there's a strong relationship between links to a page, and that pages performance in search—so it's much better if the page actually does have external links. To put this in layman's terms, if a lot of people link to your website homepage, it's possible for other pages to rank as well, but it's even better if those pages also have external links pointing at them. Although not examined in this study, it's likely most of the pages without external links at least had internal links pointing at them. While not as strong as an external link, internal links remain a decent way to pass authority, relevancy and popularity signals to pages on the same site. 3. More links correlate with higher rankings It seems obvious, but the study confirmed the long-standing correlation between higher rankings and the number of external links found from unique websites. Indeed, out of all the data points the ranking correlation study looked at, the number of unique websites linking to a page was one of the highest correlated relationships we found. 4. When can you rank without links? Despite the fact that we found almost no websites ranking without external links, it is still possible? Absolutely, but there's a catch. The 15,000 keyword phrases used in this study were, for the most part, competitive. This means that lots of other people and websites are trying to rank for the same term. Think of phrases like \"Galaxy s6\" and \"New York car insurance.\" Non-competitive phrases, by their nature, are much easier to rank for. So if you want your website to rank without obtaining any backlinks, you might succeed by targeting more obscure phrases like \"Oregon beekeeper ballet emporium\" or \"Batman flux platypus.\" These phrases have much lower competition, and by default, much lower traffic (and in many cases, none.) There are other edge cases where it's possible to rank without links, such as when the user is searching for your website specifically, or when you offer something very unique that can't be found anywhere else. Even in these cases, it helps tremendously to actually have links pointing at you. Proceed with caution There's good reason people believe link building is dead, as readers of this blog know well. For readers less familiar with this concept, or those newer to SEO... A link isn't always a link. In the past 10 years, after people spammed the heck out of link building to gain higher rankings, Google began cracking down in a serious way starting in 2012. First with its Penguin algorithm, then by de-indexing several link networks, and then by cracking down on guest blogging. Today, even slight deviations from Google's guidelines on manipulative links can land webmasters in penalty jail. The web is filled with links. Billions of them. Many are built by robots, some are paid for by advertisers, some are good old fashioned editorial links. The challenge for Google is to separate the good from the bad in its ranking algorithm. When Google finds a link pointing at your website, it can choose to do one of 3 things: Count it in its ranking algorithm Ignore it - or not give it any weight in boosting your rankings Penalize you - if it thinks the link is manipulative In fact, most people would be surprised to learn how many links don't actually help you to rank, or can actually hurt. To play within Google's good graces, it's best to understand Google's guidelines on manipulative link building, and knowing what types of links to avoid. You can analyze any site's Spam Score using Moz's backlink checker, Link Explorer. The safest link building is simply link earning, and to get your content in front of the right people. But trying to rank in Google without any links at all? Fuhgeddaboudit. Photo Credit: Geographically Accurate Paris Metro Map by Nojhan under Creative Common License Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can You Rank in Google Without Links? New Data Says Slim Chance"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can You Rank in Google Without Links? New Data Says Slim Chance"
    },
    {
      "level": "H2",
      "text": "The relationship between external links and rankings"
    },
    {
      "level": "H2",
      "text": "What the data says about links and Google rankings"
    },
    {
      "level": "H3",
      "text": "1. External links are almost always present for competitive searches"
    },
    {
      "level": "H3",
      "text": "2. It's possible to rank individual pages without links"
    },
    {
      "level": "H3",
      "text": "3. More links correlate with higher rankings"
    },
    {
      "level": "H3",
      "text": "4. When can you rank without links?"
    },
    {
      "level": "H2",
      "text": "Proceed with caution"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}