{
  "url": "https://moz.com/blog/back-door-to-google-rankings",
  "slug": "back-door-to-google-rankings",
  "title": "Back Door to Google Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google has been keeping new websites out of its top rankings positions for nearly 1 year. Sadly, this has made the results far less relevant for ordinary users. Google probably assumes (hopefully incorrectly) that their brand loyalty will never die and that the prevention of SEO t...",
  "content": "Back Door to Google Rankings Search Engines By: Rand Fishkin February 4, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 4, 2005 Back Door to Google Rankings Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google has been keeping new websites out of its top rankings positions for nearly 1 year. Sadly, this has made the results far less relevant for ordinary users. Google probably assumes (hopefully incorrectly) that their brand loyalty will never die and that the prevention of SEO tactics and search spam is more critical to Google's survival then accuracy and timliness in the index. And, who knows, maybe they're right? However, there are still quick and easy methods to get into the top rankings at Google for mildly competitive or non-competitive keyword phrases. You just need to have access to pages on sites that are already beloved by Google (and subdomains only work sometimes). Good candidates are MSN & Yahoo! Groups, pages at Google Answers (thanks to Alexis Dawes for the tip) and newspaper advertising pages (yes, you can buy these online). This technique is neither for the faint of heart, nor the strapped of cash. Links to these pre-fab pages are still required, and spending SEO time on a site & page you have only partial control over is hardly a good time. However, these pages can, and do, rank quite well at Google in a very short amount of time. This serves as a further reminder that Google isn't broken, unless you started building links to your site after March of 2004... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Back Door to Google Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Back Door to Google Rankings"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}