{
  "url": "https://moz.com/blog/bad-linkbait-needs-to-die",
  "slug": "bad-linkbait-needs-to-die",
  "title": "Why Bad Linkbait Needs to Die: How Linkable Assets Deliver 10x More Value - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bad linkbait is the scourge of the Internet. It wastes our time, money, and our audience's attention. A growing problem with poorly executed linkbait is the risk it creates for your SEO and the hidden costs of creating less-than-stellar content. What's the solution? We love good linkable assets.…",
  "content": "Why Bad Linkbait Needs to Die: How Linkable Assets Deliver 10x More Value Link Building By: Cyrus Shepard November 19, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard November 19, 2013 Why Bad Linkbait Needs to Die: How Linkable Assets Deliver 10x More Value Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I hate bad linkbait, and it floods my inbox. Bad linkbait wastes our time, money, and our audience's attention. On the other hand, I love creating linkable assets. I also love searching the web for linkable assets and sharing them with others. Before we go any further, let's define what we mean by linkbait, bad linkbait and linkable assets. Linkbait: Website feature, usually content, meant to attract links for the purposes of SEO. Bad Linkbait: Content that attracts links without adding additional value. One of the hallmark characteristics of bad linkbait is that it often rehashes the work of others, without creating anything new. Linkable Assets: Content or features characterized by a high degree of practical utility or emotional engagement. Linkable assets often attract links over time due the high value they offer. The SEO problem with bad linkbait Bad linkbait is not only less effective, but it often has very real SEO consequences down the line in terms of types of links earned and the relevance of the content. In extreme examples, we've seen instances of poorly executed linkbait leading to Penguin-style Google penalties. While there is no single type of bad linkbait, the following characteristics are often defining hallmarks: Temporary spike in linking followed by a quick drop-off Meant to be scalable and easy Off-topic or marginally relevant content Visitors not likely to return Rehashed \"Top 10\" Lists Infographics without the \"info\" Controversy for the sake of controversy Commercial anchor text controlled by creator The reason bad linkbait sucks so much energy is that you get almost no return on investment for the effort you put into it. An example seen all the time is an infographic that is only marginally related to the subject matter of the website, such as those that Rand discussed in last week's Whiteboard Friday. Imagine a plumbing company that makes an infographic called \"10 Most Horrific Water Deaths Ever.\" The SEO company convinced them that the keyword \"water\" is related to plumbing, and this will help them to rank if they can get the infographic distributed widely enough. Maybe it will, but not nearly as much as if they created something truly new that was actually related to their core business. The links they earn spike when they are actively pouring money and effort into sharing, but stop almost immediately after that. The plumbing website has no other content about \"horrific water deaths,\" so the topic is only marginally related. The links all have the same anchor text due to the widget used to embed the infographic. Google's Penguin algorithm picks this up and penalizes them for \"water\" related keywords. After 2 weeks, traffic trickles to almost nothing. The SEO company moves onto the next infographic. Is there an easy solution? Take the same amount of time and money spent to create 2-3 pieces of mediocre linkbait, and spend that energy creating a truly remarkable linkable asset. How linkable assets deliver 10x the value The great thing about linkable assets is that, when successful, they take on a life of their own and the SEO benefit can grow to 10 or even 100 times what was originally anticipated. Good linkable assets earn repeat visits and traffic over time. Links aren't pushed but earned in unexpected places with natural and topically relevant anchor text. Plus, when you publish valuable content actually related to your core subject matter, you help establish yourself as an authority on that topic, and more likely to appear in search results for topically relevant queries. Because good linkable assets often earn a greater variety of links spread over time through value instead of aggressive link promotion, they are less likely to ever earn a Google penalty. Examples of linkable assets include this worldwide guide to etiquette, this online salary calculator or even Moz's Google Algorithm Change History. Questions used to help identify linkable assets: Does it create something new? Does it make something easier? Is it likely to be used again and again? Does it reveal new insight or knowledge? Does it create something beautiful? Does it evoke a strong emotional response? Does it provide practical value? Can linkable assets also be linkbait? The most successful linkable assets possess the better qualities of fine linkbait. In fact, for SEO benefit, it's essential that your linkable asset invoke a strong emotional response or be perceived as having high practical value. This is the \"sweet spot\" in the middle that combines the best marketing value of linkbait with the added value of linkable assets. Linkable assets: exemplary examples Visual assets Rand mentioned a good number in his recent Whiteboard Friday Why Visual Assets > Infographics, so I wanted to list a few more that offer high practical value and succeed in earning natural, highly-topical links. Can an infographic act as a linkable asset? Yes, when it meets the requirements defined above. This excellent Radiation Dose Chart infographic created by xkcd not only inspires awe but has been linked to thousands of times due to people wanting to share its practical utility. Which Local Review Sites Should You Try to Get Review On? by LocalVisibilitySystem.org displays a ton of knowledge in a succinct and successful format. Moz's Web Developers SEO Cheat Sheet provides a visual asset we're quite proud of. For pure visual appeal, this Cheetah infographic by Jacob Neal is one of my all-time favorites. It stretches the boundaries of visual design and I found myself reading every word as a result. Tools ShareTally – Similar in function to SharedCount, ShareTally gives you a free and quick overview of important social metrics for any URL. This is one you bookmark. Creative assets Robby Leonardi's Interactive Game Resume feels like playing a game and has led Robby to win multiple design awards. Data sharing Everyone has data if you look hard enough. Done at scale, the results can be truly outstanding. The (not provided) Global Report aggregates data from over 5000 websites to display near real-time reporting of Google's (not provided) keywords worldwide. Studies One of our favorite email providers, MailChimp, recently studied email subject line open rates. This graphic explores the effect of including a subject's first and last name across various industries. Moz's own Search Engine Ranking Factors is consistently one of the most popular studies we publish. Videos Look no further than Wistia's learning center for best practices on producing videos for your business. Check out this one they made on advanced video SEO with they guys from Distilled. Endless possibilities for linkable assets You can turn any unique knowledge into a linkable asset without shooting a video or adding fancy graphics. Think of folks like Seth Godin or Patrick McKenzie who regularly share their valuable thoughts with the world. The key is to deliver the content in both a valuable and emotionally engaging way. If you are a talented writer, this is probably your best avenue. If not, then thinking outside the blog post box may be required. What are your favorite examples of examplary linkable assets? Let us know in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Bad Linkbait Needs to Die: How Linkable Assets Deliver 10x More Value"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Bad Linkbait Needs to Die: How Linkable Assets Deliver 10x More Value"
    },
    {
      "level": "H2",
      "text": "The SEO problem with bad linkbait"
    },
    {
      "level": "H2",
      "text": "How linkable assets deliver 10x the value"
    },
    {
      "level": "H3",
      "text": "Can linkable assets also be linkbait?"
    },
    {
      "level": "H2",
      "text": "Linkable assets: exemplary examples"
    },
    {
      "level": "H3",
      "text": "Visual assets"
    },
    {
      "level": "H3",
      "text": "Tools"
    },
    {
      "level": "H3",
      "text": "Creative assets"
    },
    {
      "level": "H3",
      "text": "Data sharing"
    },
    {
      "level": "H3",
      "text": "Studies"
    },
    {
      "level": "H3",
      "text": "Videos"
    },
    {
      "level": "H2",
      "text": "Endless possibilities for linkable assets"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}