{
  "url": "https://moz.com/blog/bad-seo-advice",
  "slug": "bad-seo-advice",
  "title": "Bad SEO Advice? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So I'm taking this online course on SEO and I have a sneaking suspicion that the instructor is either an idiot or (more likely) that he composed the lectures in 1993.  This is more of a poll than a post, I'm just wondering what other people think.  Here's my evidence:. 1. He mentions Lycos and…",
  "content": "Bad SEO Advice? Marketing Industry By: JonnyRash February 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: JonnyRash February 18, 2008 Bad SEO Advice? Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm taking this online course on SEO and I have a sneaking suspicion that the instructor is either an idiot or (more likely) that he composed the lectures in 1993. This is more of a poll than a post, I'm just wondering what other people think. Here's my evidence:. 1. He mentions Lycos and Altavista all the time. 2. He says you should use up to a hundred keywords/1000 characters in the keyword metatag (and I noticed that SEOMoz doesn't even use metatags). [From Rebecca: we don't use the meta keyword tag.] 3. He says that commented out HTML that contains any of your keywords is counted as spam. 4. He says that javascript in the header will hurt your ranking, because search engines only cache a certain amount of the HMTL source. 5. He touts this $300/a year keyword software all the time from wordtracker.com (I'm pretty sure he's in bed with them, and I'd much rather get a premium SEOMoz membership). Basically the class has been a huge waste of time, I'm an SEO noob and I knew almost all the material before taking the course. I'm going to be asking for a refund, but I want a little more fuel for my angry, angry rant. Please advise. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bad SEO Advice?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bad SEO Advice?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "JonnyRash\n          \n            JonnyRash"
}