{
  "url": "https://moz.com/blog/bait-and-switch-with-fast-food",
  "slug": "bait-and-switch-with-fast-food",
  "title": "Bait and Switch - with FAST FOOD? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So I was eating at Del Taco and... I LOVE Del Taco's $0.99 Chicken Soft Tacos. In fact. I like them SO MUCH that I refer my friends to it. Now the other day I happened to eat 3 of these that did not meet my expectations. Now of course, this is 100% the fault of the franchise (which inspires some…",
  "content": "Bait and Switch - with FAST FOOD? Link Building J By: justFred January 21, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: justFred January 21, 2008 Bait and Switch - with FAST FOOD? Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I was eating at Del Taco and... I LOVE Del Taco's $0.99 chicken soft tacos. In fact, I like them SO MUCH that I refer my friends to it. Now, the other day I happened to eat 3 of these that did not meet my expectations. Of course, this is 100% the fault of the franchise (which inspires some other interesting analogies as well), but It certainly put my mind into search marketing mode. Let's assume that Del Taco DID one day decide to remove all of the chicken from its 99 cent soft taco, but didn't change the name, nor reduce the price. Or let's say they put less chicken and tons more lettuce. What? Pfft. This taco sucks! How would that make you feel about Del Taco at this point? I just told my friend to go grab an AWESOME chicken soft taco from Del Taco, and yet... there's no chicken in the darn thing. I trusted them and endorsed their taco, and now their taco has NO SUBSTANCE, NO CONTENT! Well, what if Del Taco actually changed their menu to include a beef soft taco for $0.99 (or $0.88)? This would not only appeal to me and my friends, but my friends and their friends may refer each other to the AWESOME KILLER BEEF TACO, dude! So, should they still sell chicken soft tacos? HELL YES. Never, ever, ever stop selling the chicken soft taco! Even if the chicken taco is not making any money, it is selling beef tacos and soda, and everything else on your menu. By the time you realize the damage, it will be several months too late. If a group of sites endorse your site and content and you achieve a good ranking, you could potentially replace that content with something more commercial and make more money! Yes? Well... yes and no. If your website relies on trust to sell your product, there is a good chance that baiting for links and switching could ruin that trust and take a while to recover regain it. If you don't replace the content with something of equal or greater value, it would be better to direct the link juice from the link-baited page to the new, commercialized content with an internal link. Leave the original content, and build a new page! At least until you're other limbs are strong enough to severe the old ones, you aught to keep 'em. -just the \"Fred\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bait and Switch - with FAST FOOD?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bait and Switch - with FAST FOOD?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "justFred\n          \n            justFred"
}