{
  "url": "https://moz.com/blog/bait-and-switch-a-case-study-of-sorts",
  "slug": "bait-and-switch-a-case-study-of-sorts",
  "title": "Bait and Switch - A Case Study (of sorts) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bait and Switch is a well known Link building strategy, which in my opinion works well with a viral campaign. In most cases its used for sites that don’t have very appealing content...Because I am inherently lazy, and do not want to particularly bore most of you with what this tactic is, I will…",
  "content": "Bait and Switch - A Case Study (of sorts) Link Building By: Rishi Lakhani March 12, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani March 12, 2008 Bait and Switch - A Case Study (of sorts) Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Bait and Switch is a well-known link building strategy, which, in my opinion, works well with a viral campaign. In most cases, it's used for sites that don’t have very appealing content... Because I am inherently lazy and do not want to particularly bore most of you with what this tactic is, I will just link to Jane’s presentation at SMX London. She covers the Bait and Switch tactic well (as well as quite a few interesting strategies, so it's worth a complete read anyway). What I do want to cover is how successful this strategy can be. In 2006, Chevy ran a campaign to create ads for them. They provided users with the tools necessary to create a range of video ads using a web application that also included access to various video clips that could be used. Quite creative ,actually. Unfortunately, the original strategy was to inspire UGC and interest in the brand, as well as tap into the creativity of the general public. Funny how best made plans can go wrong... I am afraid there isn’t a facility to embed videos into YOUmoz, but if you scoot over to YouTube, you should easily be able to see exactly how creative the general public can be. But see the sneak preview: I guess Chevy got fed up and switched off the campaign. The original site was created on the domain www.chevyapprentice.com Now here’s where we get to the interesting part – they 301’d the site to the corporate site after they took off the content. Wise move. Yahoo Site Explorer shows that there are over 5000 links to that URL! And these range from PR 0’s to PR 6’s, with most being from very relevant sites such as blogs about cars and 4x4s. As a conclusion – the strategy may have not worked as originally intended, but in the end it still produced thousands of backlinks for the corporate site. I am not sure whether this strategy is ethical or not (just mirroring Jane’s concerns), but you can't argue, it sure as hell does work ;). But note: 1. The 301's haven't been implemented on all variations of the URL, which means that the value may be much lower. 2. A GOOD Bait and Switch doesnt 301 - it replaces. It's suspected that 301's don't pass on as much authority as the links themselves, which means the link juice is being siphoned along the way. To keep the benefits of those links, replace the content with your commercial content, with maybe deeper links into the corporate site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bait and Switch - A Case Study (of sorts)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bait and Switch - A Case Study (of sorts)"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}