{
  "url": "https://moz.com/blog/balanced-digital-scorecard-simpler-way-evaluate-prospects",
  "slug": "balanced-digital-scorecard-simpler-way-evaluate-prospects",
  "title": "The Balanced Digital Scorecard: A Simpler Way to Evaluate Prospects - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Working with new clients, establishing what strategies will be most impactful to their goals — this is what makes working at an agency awesome, but it can also be challenging work. Emily Smith shares the framework her agency uses for focusing on future goals and actions, not just evaluation of the…",
  "content": "The Balanced Digital Scorecard: A Simpler Way to Evaluate Prospects SEO Consulting By: Emily Smith June 29, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Emily Smith June 29, 2016 The Balanced Digital Scorecard: A Simpler Way to Evaluate Prospects SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 10 minutes] As anyone who's contributed to business development at an agency knows, it can be challenging to establish exactly what a given prospect needs. What projects, services, or campaigns would actually move the needle for this organization? While some clients come to an agency with specific requests, others are looking for guidance — help establishing where to focus resources. This can be especially difficult, as answering these questions often requires large amounts of information to be analyzed in a small period of time. To address the challenge of evaluating prospective clients and prioritizing proposed work, we’ve developed the Balanced Digital Scorecard framework. This post is the first in a two-part series. Today, we'll look at: Why we developed this framework, Where the concept came from, and Specific areas to review when evaluating prospects Part two will cover how to use the inputs from the evaluation process to prioritize proposed work — stay tuned! Evaluating potential clients Working with new clients, establishing what strategies will be most impactful to their goals... this is what makes working at an agency awesome. But it can also be some of the most challenging work. Contributing to business development and pitching prospects tends to amplify this with time constraints and limited access to internal data. While some clients have a clear idea of the work they want help with, this doesn’t always equal the most impactful work from a consultant's standpoint. Balancing these needs and wants takes experience and skill, but can be made easier with the right framework. The use of a framework in this setting helps narrow down the questions you need to answer and the areas to investigate. This is crucial to working smarter, not harder — words which we at Distilled take very seriously. Often when putting together proposals and pitches, consultants must quickly establish the past and present status of a site from many different perspectives. What type of business is this and what are their overall goals? What purpose does the site serve and how does it align with these goals? What campaigns have they run and were they successful? What does the internal team look like and how efficiently can they get things done? What is the experience of the user when they arrive on the site? The list goes on and on, often becoming a vast amount of information that, if not digested and organized, can make putting the right pitch together burdensome. To help our consultants understand both what questions to ask and how they fit together, we've adapted the Balanced Scorecard framework to meet our needs. But before I talk more about our version, I want to briefly touch on the original framework to make sure we’re all on the same page. The Balanced Scorecard For anyone not familiar with this concept, the Balanced Scorecard was created by Robert Kaplan and David Norton in 1992. First published in the Harvard Business Review, Kaplan and Norton set out to create a management system, as opposed to a measurement system (which was more common at that time). Kaplan and Norton argued that \"the traditional financial performance measures worked well for the industrial era, but they are out of step with the skills and competencies companies are trying to master today.\" They felt the information age would require a different approach, one that guided and evaluated the journey companies undertook. This would allow them to better create \"future value through investment in customers, suppliers, employees, processes, technology, and innovation.\" The concept suggests that businesses be viewed through four distinct perspectives: Innovation and learning – Can we continue to improve and create value? Internal business – What must we excel at? Customer – How do customers see us? Financial – How do we look to shareholders? Narrowing the focus to these four perspectives reduces information overload. “Companies rarely suffer from having too few measures,” wrote Kaplan and Norton. “More commonly, they keep adding new measures whenever an employee or a consultant makes a worthwhile suggestion.” By limiting the perspectives and associated measurements, management is forced to focus on only the most critical areas of the business. This image below shows the relations of each perspective: And now, with it filled out as an example: As you can see, this gives the company clear goals and corresponding measurements. Kaplan and Norton found that companies solely driven by financial goals and departments were unable to implement the scorecard, because it required all teams and departments to work toward central visions — which often weren’t financial goals. “The balanced scorecard, on the other hand, is well suited to the kind of organization many companies are trying to become... put[ting] strategy and vision, not control, at the center,” wrote Kaplan and Norton. This would inevitably bring teams together, helping management understand the connectivity within the organization. Ultimately, they felt that “this understanding can help managers transcend traditional notions about functional barriers and ultimately lead to improved decision-making and problem-solving.” At this point, you’re probably wondering why this framework matters to a digital marketing consultant. While it's more directly suited for evaluating companies from the inside, so much of this approach is really about breaking down the evaluation process into meaningful metrics with forward-looking goals. And this happens to be very similar to evaluating prospects. Our digital version As I mentioned before, evaluating prospective clients can be a very challenging task. It’s crucial to limit the areas of investigation during this process to avoid getting lost in the weeds, instead focusing only on the most critical data points. Since our framework is built for evaluating clients in the digital world, we have appropriately named it the Balanced Digital Scorecard. Our scorecard also has main perspectives through which to view the client: Platform – Does their platform support publishing, discovery, and discoverability from a technical standpoint? Content – Are they publishing content which combines appropriate blends of effective, informative, entertaining, and compelling? Audience – Are they building visibility through owned, earned, and paid media? Conversions – Do they have a deep understanding of the needs of the market, and are they creating assets, resources, and journeys that drive profitable customer action? Measurement – Are they measuring all relevant aspects of their approach and their prospects’ activities to enable testing, improvement, and appropriate investment? These perspectives make up the five areas of analysis to work through when evaluating most prospective clients. 1. Platform Most consultants or SEO experts have a good understanding of the technical elements to review in a standard site audit. A great list of these can be found on our Technical Audit Checklist, created by my fellow Distiller, Ben Estes. The goal of reviewing these factors is of course to “ensure site implementation won’t hurt rankings” says Ben. While you should definitely evaluate these elements (at a high level), there is more to look into when using this framework. Evaluating a prospect’s platform does include standard technical SEO factors but also more internal questions, like: How effective and/or differentiated is their CMS? How easy is it for them to publish content? How differentiated are their template levels? What elements are under the control of each team? Additionally, you should look into areas like social sharing, overall mobile-friendliness, and site speed. If you’re thinking this seems like quite the undertaking because technical audits take time and some prospects won’t be open with platform constraints, you’re right (to an extent). Take a high-level approach and look for massive weaknesses instead of every single limitation. This will give you enough information to understand where to prioritize this perspective in the pitch. 2. Content Similar to the technical section, evaluating content looks similar to a lightweight version of a full content audit. What content do they have, which pieces are awesome and what is missing? Also look to competitors to understand who is creating content in the space and what level the bar is set at. Beyond looking at these elements through a search lens, aim to understand what content is being shared and why. Is this taking place largely on social channels, or are publications picking these pieces up? Evaluating content on multiple levels helps to understand what they've created in the past and their audience’s response to it. 3. Audience Looking into a prospect’s audience can be challenging depending on how much access they grant you during the pitch process. If you’re able to get access to analytics this task is much easier but without it, there are many tools you can leverage to get some of the same insights. In this section, you’re looking at the traffic the site is receiving and from where. Are they building visibility through owned, earned, and paid media outlets? How effective are those efforts? Look at metrics like Search Visibility from SearchMetrics, social reach, and email stats. A large amount of this research will depend on what information is available or accessible to you. As with previous perspectives, you're just aiming to spot large weaknesses. 4. Conversion Increased conversions are often a main goal stated by prospects, but without transparency from them, this can be very difficult to evaluate during a pitch. This means that often you’re left to speculate or use basic approaches. How difficult or simple is it to buy something, contact them, or complete a conversion in general? Are there good calls to action to micro-conversions such as joining an email list? How much different is the mobile experience of this process? Look at the path to these conversions. Was there a clear funnel and did it make sense from a user’s perspective? Understanding the journey a user takes (which you can generally experience first-hand) can tell you a lot about expected conversion metrics. Lastly, many companies’ financials are available to the public and offer a general idea of how the company is doing. If you can establish how much of their business takes place online, you can start to speculate about the success of their web presence. 5. Measurement Evaluating a prospect’s measurement capabilities is (not surprisingly) vastly more accurate with analytics access. If you’re granted access, evaluate each platform not just for validity but also accessibility. Are there useful dashboards, management data, or other data sources that teams can use to monitor and make decisions? Without access, you’re left to simply check and see the presence of analytics and if there is a data layer. While this doesn’t tell you much, you can often deduce from conversations how much data is a part of the internal team’s thought process. If people are monitoring, engaging, and interested in analytics data, changes and prioritization might be an easier undertaking. Final thoughts Working with prospective clients is something all agency consultants will have to do at some point in their career. This process is incredibly interesting — it challenges you to leverage a variety of skills and a range of knowledge to evaluate new clients and industries. It's also a daunting task. Often your position outside the organization or unfamiliarity with a given industry can make it difficult to know where to start. Frameworks like the original Balanced Scorecard created by Kaplan and Norton were designed to help a business evaluate itself from a more modern and holistic perspective. This approach turns the focus to future goals and action, not just evaluation of the past. This notion is crucial at an agency needing to establish the best path forward for prospective clients. We developed our own framework, the Balanced Digital Scorecard, to help our consultants do just that. By limiting the questions you’re looking to answer, you can work smarter and focus your attention on five perspectives to evaluate a given client. Once you've reviewed these, you’re able to identify which ones are lagging behind and prioritize proposed work accordingly. Next time, we’ll cover the second part: how to use the Balanced Digital Scorecard to prioritize your work. If you use a framework to evaluate prospects or have thoughts on the Balanced Digital Scorecard, I’d love to hear from you. I welcome any feedback and/or questions! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Balanced Digital Scorecard: A Simpler Way to Evaluate Prospects"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Balanced Digital Scorecard: A Simpler Way to Evaluate Prospects"
    },
    {
      "level": "H2",
      "text": "Evaluating potential clients"
    },
    {
      "level": "H2",
      "text": "The Balanced Scorecard"
    },
    {
      "level": "H2",
      "text": "Our digital version"
    },
    {
      "level": "H3",
      "text": "1. Platform"
    },
    {
      "level": "H3",
      "text": "2. Content"
    },
    {
      "level": "H3",
      "text": "3. Audience"
    },
    {
      "level": "H3",
      "text": "4. Conversion"
    },
    {
      "level": "H3",
      "text": "5. Measurement"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Emily Smith\n          \n            Emily Smith\n          \n            Emily Smith"
}