{
  "url": "https://moz.com/blog/basic-reputation-management",
  "slug": "basic-reputation-management",
  "title": "Basic Reputation Management for Better Customer Service - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In our State of Local SEO Survey, 90% of respondents agreed that the impact of reviews on local pack rankings is real. Local business owners should be able to turn those chilly black-and-white words on a review profile into a living color interaction, with the potential for further details, vital…",
  "content": "Basic Reputation Management for Better Customer Service Local SEO | Branding By: Miriam Ellis October 21, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis October 21, 2020 Basic Reputation Management for Better Customer Service Local SEO | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Internet can be a great connector, but sometimes, it acts as a barrier. Your local business receives a negative review, and the slate-colored words on the bland white screen can seem so cold, remote. You respond, but the whole interaction feels stilted, formal, devoid of face-to-face human feelings, like this: At least when a complaint occurs via phone, the tone of a customer’s voice tells you a bit more and you can strive to respond with an appropriate vocal pitch, further questions, soothing, helping, maybe resolving. Still, if you’re working off a formal script, the human connection can be missed: Image credit: News Oresund, Elvert Barnes It’s a win when a customer complains in person to your staff, but only if those employees have been empowered to use their own initiative to solve problems. Employees who’ve been tasked with face-to-face interactions but lack permission to act fully human when customers complain will miss opportunity after opportunity to earn the loyalty your brand would give almost anything to amass. Two people can be looking one another in the eye, but if one has to act corporate instead of human, too much formality ensures forgettable experiences: Image credit: Jan-Willem Boot, Amancay Blank What you really want as a local business owner is to have the power to turn those chilly black-and-white words on a review profile into a living color interaction. You want to turn one-way messaging into front porch conversation, with the potential for further details, vital learnings, resolution, and deeply informal human connection with a neighbor, like this: Image Credit: Christian Gries The great barrier: reviews Seventeen years into my journey as a local SEO, I’ve come to realize that my favorite businesses — the ones I’ve come to patronize with devotion — are the ones with owners and staff who treat me with the least formality. They’ve creatively established an environment in which I felt liked, heard, regarded, trusted, and appreciated, and I’ve responded with loyalty. It’s really a beautiful thing, when you step back and think about it. For me, it’s small local farmers who epitomize informal neighborliness in business. They: Do their best to grow high quality foodKnow me by nameKnow my dietary preferencesLet me roam around their properties for enjoyment’s sakeTrust me to pay via an honor systemAsk me if there’s additional produce I’d like them to growWant to know how I’m cooking their produceTell me other ways I might prepare their produceHave nice conversations with me about a variety of topics Am I describing a business here, or a friend? The line is blurry. I’ve hugged some farmers. Prayed for a few when they’ve had hard times. I may have first met them for monetary transactions, but we’ve built human relationships, and the entire way I relate to this sector is defined by how the farmers go about their business. With a few exceptions, most local brands can work at building less formality and more neighborliness into their in-person customer service. Think about it. In most settings, your customers would enjoy being treated with the respectful interest and kindness that invites camaraderie. But we hit a strange barrier when the medium is online reviews. If we learned to read and write in a formal school setting, we may unconsciously ascribe a certain stiffness to textual exchanges. We’re worried about getting lower marks for making a mistake, and we’re aware of being in front of a public audience in writing review responses. We’re missing vital communicative cues, like the facial expression of the customer, their tone of voice, and their body language. On our side of the equation, we can’t shake hands, or physically demonstrate our willingness to help, or even signal our approachability with a smile. To tell the truth, reviews aren’t a great substitute for in-person communication, but they are here to stay, and there’s a certain amount of fear on both sides of many transactions that builds up the layers of the barrier, like this: What can be done to bring the two parties closer together, so that they are at least leaning over the same fence to talk? Create a workflow for spotting single and aggregate review cues The easiest way I know of to get started with a workflow surrounding reviews is via a very intuitive product like Moz Local. Basic components are built into the dashboard, offering a simple jumping off point into the complex world of reputation management. The screenshot above shows a portion of the functions Moz Local offers for review management. The organization of the various data widgets create a bridge for getting closer to customers and engaging in real, meaningful dialogue with them in an atmosphere of goodwill, rather than fear. Let’s break it down by tasks. 1. Seek cues in single reviews with ongoing alerts To enter into a conversation, you have to know when it starts. The right-side column of the Moz Local dashboard keeps a running feed of your incoming reviews on a variety of platforms, as well as incoming Google Q&A questions. On a daily basis, you can see who is starting a conversation about your business, and you can tell whether customers most recent customers were having a good or bad experience by looking at the star rating. Make it your practice to click first on any review in this feed if it’s received a 3-star rating or less, and see how much information a customer has shared about the reason for their less-than-perfect rating, as in this fictitious example:. Because the reviews are timestamped, you may have the ability to connect a customer’s poor experience with something that happened at your place of business on a specific day, like being understaffed, having an equipment failure, or another problem. In fact, a second view in the dashboard makes it immediately obvious if the reviews you received on a particular day had lower star ratings than you’d like to see: If you know a customer’s complaints can be tied to an issue, this gives you something more and better to say than just “I’m sorry,” when you respond. For example, broken equipment leading to a cold meal is something you can explain in asking the customer to let you make it up to them. 2. Seek cues in aggregated sentiment Knowing whether you have just one customer with a single complaint or multiple customers with the same complaint is vital quality control intelligence. Very often, Google reviews are particularly brief in comparison to reviews on other platforms, and you need to be able to take a large body of them to see if there are shared topical themes. The Review Analysis widget in the Moz Local dashboard does exactly this for you: In this view, you can see up to 100 of the most common words your customers are using when they review you, the percentage of the reviews containing each word, and the star rating associated with reviews using each word. You can toggle the data for each column. In our fictitious example, the business owner could see that when food is served cold, it’s yielding very poor review ratings, but that, fortunately, this is a complaint contained in only 1.7% of total reviews. Meanwhile, the business owner could notice that 2% of reviews with a 3.8 star rating (only a moderately good experience) are revolving around the phrase “service”. The owner can click on each word to be shown a list of the reviews containing that term to help them identify what it is about the service that’s diminishing customer satisfaction. The figures in the above screenshot are all pretty low, and likely represent only mild concerns for the business. If, however, the business owner saw something like this, that would change the narrative: Here, 12.2% of the reviews mentioning the restaurant’s veggie burgers are associated with a very poor 2.0 rating. The owner would need to dive into this list of reviews and see just what it is customers don’t like about this dish. For example, if many of these reviews mentioned that the burgers lacked flavor, had bland condiments, or buns that fell apart, these would be cues that could lead to changing a recipe. Again, this would give the owner something genuine to say in response to dissatisfied customers. Ideally, it would lead to the customer being invited to come again for something like a free taste test of the new recipe. Whatever details the review sentiment analysis function yields for your business, use it with the intention of having a two sided conversation with your customers. They complain, in aggregate, about X, you research and implement a solution, and finally, you invite them to experience the solution in hopes of retaining that customer, which is typically far less costly than replacing them. 3. Grade your business at a glance These two views in the Moz Local dashboard allow you to analyze two key, related aspects of your business at a glance. The Average Rating view is the fastest way to grade yourself on aggregate customer satisfaction. This example shows a business with little to fear, with 96% of customers rating the business at 4-or-more stars and only 4% having a three-stars-or-less experience. In terms of having happy customers, this fictitious company is doing a great job. However, the Reviews Reply rate needs some work. They’re only replying to 1% of their overall reviews, 0% of their 2-to-5-star reviews, and only 21% of their 1-star reviews. The business is doing an excellent job offline, but unless they improve their online responsiveness, their average review rating could begin to decrease over time. In sum, a workflow which investigates reviews singly and in aggregate tells the story or customer satisfaction across time, and gives the business owner a clearer narrative to tap into and write from in responding. Make optimal response rates and two-way conversation your goal As a local business owner, you have many demands on your time. That being said, my pro tip for you is to respond to every review you possibly can. There’s no scenario in which it’s smart to ignore a conversation any customer starts, whether positive or negative. Just as you wouldn’t ignore a percentage of your incoming calls or customers walking around your business, you shouldn’t ignore them online. If thinking of reviews as a two-way conversation is a bit of new concept to you, consider that most review platforms enable people to edit their reviews for a reason: many of your customers think of the reviews they write as living documents, and are willing to update them to journal subsequent interactions that made a scenario better or worse. My own research has shown this to be true, and multiple studies have reached the conclusion that the majority of customers will continue doing business with brands that resolve their complaints. This means that local businesses can manage a customer journey that follow this pattern for negative reviews, much of the time: In black-and-white review land, this might look like this: Or, when a customer is happy to begin with, offering extra incentives to come again while thanking the customer for taking the time to write their review could look like this: Here, a conversation starter about salsa has been turned into a two-way dialog guaranteed to make the customer feel heard and valued. They’ve been invited back, their opinion has been solicited, and both the existing customer and all potential future customers reading Mary’s response can see that this is a restaurant with a lively, on-going relationship with its diners. Takeaway: don’t just say “thanks” to every customer who positively reviews your business. Seek cues in their words that show what they care about and tie it to what you care about. Find common ground to further engage them and bring them back again. How big of a priority are reviews, really? I’ve consulted with so many local business owners over the years — everybody from beekeepers to bookkeepers. It’s a plain fact that all small business owners are extremely busy, and not all of them instantly take a shine to the idea of having a lot of little two-way conversations going on with their customers in their review profiles. Statistics can change minds on this, when it comes to figuring out how much of a priority review analysis and management should be. Consider these findings from the Moz State of the Local SEO Industry survey of over 1,400 people involved in the marketing of local businesses: Respondents placed aspects of Google reviews (count, sentiment, owner responses, etc.) as having the second greatest impact on Google’s local rankings. 90% of respondents agree that the impact of reviews on local pack rankings is real. Nearly 14% of those marketing the largest local enterprises realize that more resources need to be devoted to review management. Yet, in another section of the survey, agency workers placed review management in a lowly 11th place in terms of something they are requested to help their clients with. Learn more about these trends by downloading the free State of the Local SEO Industry Report for 2020. Statistics like these indicate that there is a maturing awareness of the vital role reviews play in running a successful local business. Management of all aspects of reviews deserves priority time. Make a habit of reading reviews between the lines Moz Local software will ensure you know whenever single reviews come in, and help you slice and dice review data in ways that tell customer service narratives in aggregate. If you’re already using this software, your first steps of reputation management are just waiting to be taken with ease and simplicity. But to get the most of any review management product, you’ll need to bring a human talent to the dashboard: your ability to read between the lines of review text that can be brief, vague, sharp, and sometimes unfair. With the exception of spam, there’s a real person on the other side of each text snippet, and for the most part, their shared desire is to be treated well by your business. Even if a review stems from a customer you can’t identify or one who communicates disappointment rudely, you can take the high road by making a mental image of yourself standing face-to-face with someone you highly value who is voicing a problem. Respond from that good place, with the conscious intention of improved neighborly communication and you may be pleasantly surprised by your ability to transform even the most dissatisfied person into a happier, more loyal customer. I’ll close today with an excerpt of a very long real-world review which I’ve truncated. I’ve underlined the cues and the rewards I’m hoping you’ll spot and see as you strengthen your commitment to review management as a key component of your customer service strategy. The new Moz Local plans — Lite, Preferred, and Elite — are designed to offer more features and flexibility to better meet the needs of local businesses and their marketers. Customers on any of the new plans can now monitor reviews via alerts, and depending on the plan, respond to reviews and take advantage of social posting. It’s never been more important to actively engage and listen to the needs and concerns of your current customers — and potential customers will take notice. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Basic Reputation Management for Better Customer Service"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Basic Reputation Management for Better Customer Service"
    },
    {
      "level": "H2",
      "text": "The great barrier: reviews"
    },
    {
      "level": "H2",
      "text": "Create a workflow for spotting single and aggregate review cues"
    },
    {
      "level": "H3",
      "text": "1. Seek cues in single reviews with ongoing alerts"
    },
    {
      "level": "H3",
      "text": "2. Seek cues in aggregated sentiment"
    },
    {
      "level": "H3",
      "text": "3. Grade your business at a glance"
    },
    {
      "level": "H2",
      "text": "Make optimal response rates and two-way conversation your goal"
    },
    {
      "level": "H2",
      "text": "How big of a priority are reviews, really?"
    },
    {
      "level": "H2",
      "text": "Make a habit of reading reviews between the lines"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}