{
  "url": "https://moz.com/blog/be-better-than-your-competitiors",
  "slug": "be-better-than-your-competitiors",
  "title": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how to outperform your competitors by targeting and satisfying choosy customers. This blog post guides you through identifying specific customer needs, analyzing competitors, and optimizing your content and marketing strategies.",
  "content": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers Local SEO | Competitive Research By: Miriam Ellis Edited By: Emilie Martin June 24, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis Edited By: Emilie Martin June 24, 2024 How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers Local SEO | Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The digital marketing industry is awash right now in waves of complaints that authoritative, authentic, carefully crafted content is consistently being outranked by slapdash, throwaway filler in Google’s SERPs for too many search phrases. Opinions on the degree of the problem differ, and there are even sensible arguments to be made that our expectations of Google are simply too high. What’s a fact is that the lion’s share of clicks routinely goes to whatever comes up first in Google’s results. It’s a second fact that there’s heightened public scrutiny at present over Google rewarding large brands for their encyclopedic approach to publishing content on all conceivable topics, regardless of how little they have to do with the overall brand. Some SEOs call this approach content farming, while others argue in its favor. And it’s a third truth that some search intents (like weather reports) can be fulfilled by SERP feature quickies. Meanwhile, even AI-produced content may appeal to some searchers. Such sources may not provide the best answer and can often contain misinformation, but if the searcher either doesn’t realize this or has low expectations of quality, then they may be satisfied before ever making it to our better-quality content. Because of the current state of the SERPs, my best take on the present scenario is that low-expectation searchers can’t be viewed as your core customers unless you are marketing a big brand that’s become entrenched in Google’s index. The bulk of your audience can’t be made up of looky-loos who are too easily satisfied. Instead, you’ve got to double down on your SEO and marketing of any content for which you are currently somewhat visible, but also… Identify the goods/services/information you offer that meet the highest and most specific expectations people haveFind out who your actual competitors are for the content surrounding these assets and conduct a full competitive analysis of them with both tools and manual investigation (tutorial and a free template here) to find every possible SEO winRecognize when you cannot move past an entrenched competitor and identify gaps in their presentation of their offerings so that you know what you can do better to meet a choosier consumerImprove your content based on the gaps you’ve noticed and hope you see some upward movement from Google, even if you can’t surpass an entrenched siteIncrease user behavior signals by marketing beyond Google everywhere you can think of, including social media posting, paid ads, and offline marketing in hopes of earning discovery by and loyalty from visitors who come to realize your offering is actually superior to whatever may be outranking youSee if improvised user behavior metrics are rewarded by Google with better SERP visibility for these high-expectation searches even if, again, you can’t surpass an entrenched brandHope for a future Google update that rewards quality over mere largeness I can’t promise any easy wins in this piece. But I can show you how to look at your competition’s content as a step towards becoming the best at serving customers with the highest expectations and most specific needs. 1. Identify valuable, hard-to-please customers by their search phrases As a consumer, I am a very tough sell. Seriously, people should be running their ad campaigns past me to see if they could convince me to buy because I would mostly say “no” unless something is an exceptional match for my tastes and needs. When I spend money, it’s typically only after a long search for something that checks off almost everything on my wishlist. Current example: I’m totally dissatisfied that the majority of the clothing offered for women these days is made out of some form of fossil fuel or plastic. I feel insulted that clothing manufacturers apparently view me as a garbage can awaiting its hefty bag instead of as a human being who is part of the natural world. I’m not alone. Forum threads and People Also Ask SERP features are replete with people frustrated in their search for the kinds of natural fiber garments that every generation wore until the advent of synthetic fibers during the Great Depression. How bad is this problem? Take a look at my notes on the ads that come up for “organic cotton knit maxi dress”: Despite the good specificity of my search language, only 1/8 of ads, which are given priority screen space in Google’s results, match my query. The rest of the garments being shown to me, at great expense to the seller, are either the wrong fiber, the wrong textile, the wrong style, or don’t match my “organic” modifier. And things don’t get much better when I dive into the organic SERPs, which are adorned with non-organic, non-cotton, non-knit, non-maxi dresses, interleaved with endless product results that also don’t match my search language. Is my summer ruined? Must I wear polyester and swelter in 105-degree heat while contributing to particulate plastic pollution of our lands, oceans, and bodies? No, because I will keep digging to see if what I want exists somewhere in the subterranean recesses of Google, but for site owners, the takeaway here is that a search like mine is exactly what you need to look for in keyword research tools like Moz Keyword Explorer (try it for free) when identifying potential customers with high-expectation intents. Look at longer-tail searches that have been modified for specificity, like these, indicating a clear sense of choosiness on the part of the searcher: For these searchers, not just any chocolate chips will do. They want fair trade, organic, or some other quality before they will bake cookies. The more specific the search language, the better chance the searcher knows exactly what they want. Hopefully, they will accept no substitutes, no matter what is ranking highest or is most visible due to ad spend. However, this is also where problems arise, specifically for retailers, who mainly vend non-unique SKUs. If you are selling the same thing that multiple competitors do, it’s very hard to distinguish your company from any other. We’ll come back to this dilemma in a moment, but… 2. Identify competitors For the sake of example, let’s imagine we’re marketing an organic women’s clothing business. Go to Moz Keyword Explorer and enter one of your choosy search phrases, like “organic cotton knit maxi dress: Go to the SERP analysis box and click on “see full results”: As we can see, our top competitor for this phrase is a site called HopeandHenry.com. Moz tells us this entry has a Page Authority of 26 and an overall Domain Authority of 23. Neither is a huge figure. And when we click on the Page Score element, we’re taken to On-page Grader, which lets us know that our exact keyword phrase, “organic cotton knit maxi dress,” isn’t appearing in its entirety anywhere on the page, though bits of it are present, which is interesting information: 3. Pay a visit to the competitor’s page Now, let’s take a look at the actual page from our hypothetical top competitor: It’s a nice garment that ticks off most of the boxes for our example search, and Google is ranking it first, but as we can see at a glance, there are some significant weaknesses here. Unless a customer happens to be the single dress size offered, the first result in the SERPs will be one they quickly click away from in disappointment because the garment won’t fit them; only a fraction of the population is a size “2” or any other single size. I was concerned about the H tag on the page when I landed because it didn’t mention “organic cotton.” I thought Google was showing me yet another dress in the wrong fiber. You have to read the finer print on the page to confirm that this is, indeed, the desired material. And what really surprised me is that there is no garment length given; with so many “midi” dresses coming up for a “maxi dress” search (these are not the same thing!), I’d want confirmation that this gown is of a specific length. There also isn’t a country of origin provided, and I expect that many customers with highly specific shopping standards would want this information for ethical considerations. And finally, a maximum effort hasn’t been made to showcase the garment. Compare it to this product page on an Etsy site, where there are still photos from multiple angles, live models wearing the garment, and even video footage to give the fullest possible remote sense of how the item of clothing looks, fits, drapes, and moves, and where complete technical specs are provided, including length, garment care and country of origin: If Google were a human searcher instead of an index based on calculations, I have no doubt that the Etsy page would outrank the current top site in terms of sheer information being provided about the garment being sold. The truth is that most rankings feel a bit arbitrary without a rock-solid answer for exactly why Google thinks one page would be preferred by human searchers over another. Our first order of business is always to look at SEO signals via tools to see if we can explain why a particular SERP features a particular ranking order. Don’t skip this step because it can help you find all the possible wins! But beyond this, we know that ranking order is often a poor approximation of actual content quality and that options that might satisfy a choosy customer much more fully may be buried somewhere down in the SERPs. Despite this dilemma, we still want to make every effort to publish the most consumer-satisfying content we can so that it will be chosen if a customer reaches it via any road. So far, we’ve learned what our competitor was missing from their page. Now, let’s make a list that includes these elements and also incorporates further possibilities for our own page’s improvement. 4. Differentiate your offering Here is a starter list of basic elements that you could add to your page if you notice that your top competitor is lacking them: A URL, title tag, H tags, and alt text that have all been optimized for the customer’s search phraseMore detailed product/service descriptions that cover all salient points, including technical specs, dimensions, care instructions, use cases, etc.An expanded treatment of the page topic with more comprehensive text, including diving into subtopicsMore and better imagery that bridges the online-to-offline gap more effectivelyVideo contentAudio content, like a related podcast episodeQuotes and other forms of content from customers, influencers, authoritative figures, or industry expertsRelevant facts, statistics, and data that strengthen your case/offeringReviews and testimonialsProduct/service comparisonsFAQsCase studiesInfographics, charts, or tablesHow-to guides or detailed instructionsDeals and special offersRelated products/servicesClaims to fame such as awards, media mentions, etc. Whether or not Google immediately rewards your inclusion of elements like the above with better rankings, they could make the difference between a customer choosing you or a competitor if they get to your page via any route. And there’s a last step we can take to make our best pitch to be chosen by choosy customers. 5. Identify the real reason your offering is the best match for a potential customer Every solid business or organization needs an overall unique sales/value proposition (USP/UVP), but individual offerings need one, too, to differentiate them from competing products/services. When hoping to win customers with specific requirements, a forthright explanation of why you believe your option is the best choice can help you go the last mile of earning a transaction. This can require some soul searching and putting yourself in the shoes of a customer, asking, “Which of these factors would make me feel the best about choosing this product/service?” Storytelling Can you tell a better story than your competitor about why becoming your patron is a positive choice? Is it the origin story of your business, the fact that your operation is family-owned, has been in business longer with a track record of customer satisfaction excellence, and is more inclusive and diverse? Or is the best story how this offering will contribute to the life of the customer? Will it make them happier, safer, smarter, healthier, more comfortable, etc.? Words, images, and videos that help the visitor picture their life being improved can work wonders. Often, it's your customers' own words that tell the most relatable and best stories. Price In many cases, people simply shop by finding the lowest price, but for higher-intent customers and transactions, an explanation of a higher price could help. For example, if a garment you’re offering costs $150, but similar garments are half that price, explain why. Is it that you pay your workers a living wage? Is it that the fabric is USA-made? Is it that the quality of the fabric is more durable, resolving the major issue of fast fashion? Is it that the construction of the garment is more difficult, with higher-end finishings and details? Ethics Are particular standards of green practices or human rights in place in the production of your offering that competitors don’t adhere to? Are you able to make a caring appeal to customers whose choosiness is the result of their personal ethics and concerns over the welfare of the environment or other people? Is there something about the mission of your business that underpins every product and can move hearts and minds? Philanthropy Does a percentage of your earnings go to supporting a cause your audience cares about, meaning that they can feel extra good about the money they spend being of additional benefit to society beyond a mere transaction? Tie-ins Does becoming a customer of your business confer additional perks, such as access to special offers, membership in a social community, a valuable loyalty program, discounts on related products, lifetime guarantees, real human support vs. chatbots, or something else that makes being your customer different than going elsewhere? Location Earlier, I mentioned that retail business models can have the toughest challenge in differentiating themselves in real ways from competitors; if you are offering the same products as multiple online competitors, it can too often come down to a mere price comparison for customers. Location, however, changes the game. If you have a physical branch at which a customer can quickly purchase a product or have it delivered the same day, decreasing the wait time and risk of theft, then this is a strong UVP for your scenario. Authenticity Too much marketing and advertising hinges on corporate wishes rather than facts. We’ve been talking about storytelling and choosiness today, and a classic example from my childhood was a long-running ad campaign for Jif peanut butter, sold with the slogan, “Choosy moms choose Jif.” It was a memorable slogan at the time, but it contained the inherent problem that food label reading became a big “thing” in that era, and many discerning parents noticed that, instead of being made of 100% peanuts, this product contained sugar, hydrogenated oil, and other additives they might not have wanted their kids to eat. So, in fact, lots of “choosy moms” were likely to choose something that only contained peanuts. The more authentic story about this particular peanut spread was that it was one of the least expensive options. So, a more realistic pitch of the product might have been that many people were choosing Jif because it fit their food budget. That might not have sounded prestigious to brand leadership, but it was the truth of the matter. These days, consumers are quick to call out discrepancies in advertising, meaning your sales pitch should reflect reality rather than an image you wish existed. Stand behind what you sell, and tell it like it is. If it meets your audience’s expectations, they’ll recognize a legitimate solution to their needs. 6. Go beyond Google Whole businesses are run on Instagram, and YouTube has made millionaires out of good storytellers. For a couple of decades now, so many hopes have been pinned on Google’s algorithms rewarding our hard work, but too often, we see that ranking order can’t be easily justified. SEO exists to help us get as far as we can in competitive Google SERPs with the metrics tools provide… but that’s not all SEO tools are for. When you open a tool set like Moz Pro or whatever your favorite software is, don’t just look at competitive analysis data as information on links or keyword usage; instead, see it as a window into how the top-ranked competitors are or aren't telling good stories. If a big brand has become entrenched at the top of the SERPs, it may also become unmotivated to really reach for customers’ engagement. Are there gaps in their story that you can fulfill, not just on your site but across the social media world and in the increasingly insular world of forums and private servers? You’ve got to get the SEO basics right first, of course. Don’t pass “Go” until you know exactly how to: Conduct an outstanding SEO competitor analysis to get you every win you possibly canConduct a local business competitive audit, if that’s applicable to your business model Without getting a firm handle on these more straightforward ways to compete first, you’ll miss out on tons of opportunities. But, there will be times when you just can't seem to move up at all in one of those choosy-intent environments, and you’re banging your head against your desk wondering why Google insists on favoring a lower-quality offering over yours in their results. Come back to this blog post when you get there, and get into a creative headspace for finding the best story to share beyond Google. If your marketing activities result in conversions, you’ll experience the massive relief of getting to care a little less about rankings at least once in a while! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H2",
      "text": "1. Identify valuable, hard-to-please customers by their search phrases"
    },
    {
      "level": "H2",
      "text": "2. Identify competitors"
    },
    {
      "level": "H2",
      "text": "3. Pay a visit to the competitor’s page"
    },
    {
      "level": "H2",
      "text": "4. Differentiate your offering"
    },
    {
      "level": "H2",
      "text": "5. Identify the real reason your offering is the best match for a potential customer"
    },
    {
      "level": "H3",
      "text": "Storytelling"
    },
    {
      "level": "H3",
      "text": "Price"
    },
    {
      "level": "H3",
      "text": "Ethics"
    },
    {
      "level": "H3",
      "text": "Philanthropy"
    },
    {
      "level": "H3",
      "text": "Tie-ins"
    },
    {
      "level": "H3",
      "text": "Location"
    },
    {
      "level": "H3",
      "text": "Authenticity"
    },
    {
      "level": "H2",
      "text": "6. Go beyond Google"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}