{
  "url": "https://moz.com/blog/be-careful-using-adwords-for-keyword-research",
  "slug": "be-careful-using-adwords-for-keyword-research",
  "title": "Be Careful Using AdWords for Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the past decade, most of us in the field of search have relied on Google's AdWords data (either in the public tool, the API or the tools inside AdWords accounts). It's the best source we've got, but many marketers may not realize that sadly, the numbers and queries may not always match up to…",
  "content": "Be Careful Using AdWords for Keyword Research Keyword Research By: Rand Fishkin February 14, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 14, 2012 Be Careful Using AdWords for Keyword Research Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the past decade, most of us in the field of search have relied on Google's AdWords data (either in the public tool, the API or the tools inside AdWords accounts). It's the best source we've got, but many marketers may not realize that sadly, the numbers and queries may not always match up to what's actually happening on Google's search engine. I'll illustrate with an example. An SEOmoz blog post ranks in the top 2-3 results for many keywords around the phrase \"blog traffic.\" Here's a screenshot of some of those rankings: I went into our Google Analytics account and pulled the related keywords along with how much traffic they've sent in the past 30 days: Then I went to Google's AdWords Tool and searched for \"blog traffic\" to compare the suggestions: Here I got confused, because many of the terms that we receive traffic for are NOT shown above in the list... Is Google hiding them? Do they not know about them? To be sure, I typed them into Google's AdWords Tool manually, performing [exact match] searches only: Holy cow... There they are. So, AdWords does have volume for these, and will display it, but only if you enter them exactly (or rather, \"more exactly\" - you can find them if you do sets of imprecise, but closer queries, too). I made the chart below to illustrate which terms were available from the broad reserach: As you can see, there's ~50% of the terms not shown in the suggestion list, which is fairly substantive and could lead to some serious missed targeting opportunities. THE IMPORTANT LESSON: Running discovery-focused searches in AdWords may not show you all the valuable/high-volume keyword phrases connected to a word/phrase. There are a few ways to address this challenge: If you have the budget, my top recommendation is to buy a few, very broad keywords in AdWords, send them to a relevant landing page on your site, but realize you probably will lose money on the campaign. The goal isn't conversions, but rather to learn by watching the keyword terms/phrases for which you get impressions. This is also great conversion-testing if you have the budget to invest, but even a week or two of data can be highly valuable for future keyword targeting. When searching in AdWords, start broad, and then enter narrower queries and note the new phrases that come up. Make sure to use exact match, and be diligent in testing variations. Google only lies through omission. The relative numbers of searches aren't perfect (as you can see above), but they are relatively decent. In fact, I'd say they've improved in what they show vs. the actuals you'll see compared to prior years. However, Use your own analytics as a guide to find new terms/phrases you might be imperfectly targeting. And if you see keyword variations that have a unique or different intent, it might even pay to create a more targeted page for that query, and you often need less work to rank, since Google uses the \"indented results\" system to drop a second URL from the same domain directly underneath the first one on a given page. Now I'd love to hear from you - what are your experiences around keyword research in AdWords? Are you seeing the same thing we are? You can share your thoughts in the comments. BTW - Given that 30%+ of our referrals from Google searches are keyword (not provided), I'd venture to guess that all of the numbers from our analytics are underreporting by about that same percent. Keep that in mind when comparing the data from AdWords vs. our analytics above. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Be Careful Using AdWords for Keyword Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Be Careful Using AdWords for Keyword Research"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}