{
  "url": "https://moz.com/blog/be-quantitative",
  "slug": "be-quantitative",
  "title": "Be Quantitative - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a profession, we should always be as quantitative as possible.  We work with limited information, but that shouldn't be an excuse for throwing up our hands.  Even an estimate, if it is quantitative, can be useful in both guiding marketing tactics and communicating with co-workers and clients.",
  "content": "Be Quantitative Online Advertising D By: Dan Crean December 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dan Crean December 18, 2008 Be Quantitative Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As a profession, we should always be as quantitative as possible. We work with limited information, but that shouldn't be an excuse for throwing up our hands. Even an estimate, if it is quantitative, can be useful in both guiding marketing tactics and communicating with co-workers and clients. Wider use of analytic programs, the (to some extent) willingness of the engines to share information with us, and ease of communication and calculations means there is little excuse for not using numbers. One reason I appreciate SEOmoz's Linkscape is its brave attempt to assign numbers corresponding to link and page values as on the web. Maybe the Linkscape values don't match the real search engines' values, but they are a bold attempt and I suspect they come reasonably close. On a smaller scale, we should all try to use numbers, always keeping in mind their limitations and caveats. Let's take an example. Suppose you know only one thing about a website: average number of sales per day. Let’s say the site averages 5.1 sales/day. What is the probability that on any given day, say tomorrow, there will be 2 or fewer sales? Guess. 5%? 10%? 15%? Believe it or not, there is a way to estimate this probability. There’s an equation that tells you the probability of any given number of sales assuming a discrete Poisson distribution. Plug the numbers in and you get: Number of sales % probability 0 0.6% 1 3.1% 2 7.9% Total 11.6% With this very limited information, our estimate of a day with two or fewer sales is 11.6%. How close did you get? Now, this is an estimate, but it is a good estimate. It assumes a certain pattern of day-to-day sales (this pattern is called a Poisson Distribution). This type of pattern is observed in many facets of life: the rate of cars entering the fast food restaurant drive-through, for instance. The number of false firm alarms on a given day. Or the number of spam e-mails you receive on a given day. So it is a good method for estimating the probability of two or fewer sales tomorrow. As a marketing professional I would have no problem defending this method to a client. I would state my assumptions and the method used, but this is a legitimate way to estimate the answer. It’s a lot better than just shrugging and saying, “who knows?”, which is a behavior we see all too often in marketing. You might object: but what if tomorrow is a Saturday and I know sales decline on weekends? Shouldn’t I include that information in my analysis? My answer: yes, of course you should. Include whatever information you have that is relevant and weigh its importance accordingly. My point with the example was to show that with only a single point of data we could develop a reasonable estimate. Don’t be scared off by the math. It’s really not that hard. All those equations on the Wikipedia page are mostly part of a derivation and we can just use the first equation in the article. We’re going to be better off as an industry if we adopt quantitative habits. One advantage search marketers have over our counterparts in traditional media is much greater detail on customer behavior and buying patterns, and we should take advantage of this hard data. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Be Quantitative"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Be Quantitative"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Crean\n          \n            Dan Crean"
}