{
  "url": "https://moz.com/blog/be-the-ceo-of-more-than-just-your-job",
  "slug": "be-the-ceo-of-more-than-just-your-job",
  "title": "Be the CEO of More Than Just Your Job - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Almost two years ago, Brad Feld put up an excellent blog post called \"Be the CEO of Your Job\" based on an interview with Mark Pincus of Zynga by the NYTimes. I loved the concept and have tried to apply it even since before I had a name for the attitude of independence that great companies tend to…",
  "content": "Be the CEO of More Than Just Your Job Marketing Industry By: Rand Fishkin December 20, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 20, 2011 Be the CEO of More Than Just Your Job Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Almost two years ago, Brad Feld put up an excellent blog post called \"Be the CEO of Your Job\" based on an interview with Mark Pincus of Zynga by the NYTimes. I loved the concept and have tried to apply it even since before I had a name for the attitude of independence that great companies tend to grant their team. From Brad's article: Pause and ponder the idea. Assuming you are in an entrepreneurial organization, are you being the CEO of your job? Is this culturally (and functionally) acceptable? Do you get rewarded for taking risks and succeeding (or failing) like your CEO does? If not, would you be more effective if you did? Now, if you are the CEO of an entrepreneurial organization, do you encourage everyone in the company to be CEO of their job? Is this culturally (and functionally) acceptable? Do they get rewarded for taking risks and succeeding (or failing) like you do? If not, would they be more effective if they did? At the Mozplex, \"CEO of Your Job\" has come up in a few exec meetings and several hiring discussions, too. When it does, it's always as a positive quality we're seeking, e.g. \"How can we empower so-and-so to be CEO of their job?\" meaning \"How do we remove restrictions (imagined or real) so that so-and-so can work on this independently, execute and take pride in that accomplishment?\" But in the last few weeks, I realized that there's a nuance to the logic behind being \"CEO of your job\" that can cause strife and frustration if it's not well-understood by the entire team. Here's an illustration that (hopefully) says the thousand words I'd rather not type: Owning your job is awesome. Empowering people to make decisions on their own and giving them flexibility is, too. But a danger arises when multiple people or teams are being CEOs of their job to the exclusion of the larger organization. This can happen at two-person startups or huge enterprises equally. Heck, I'm guilty of it myself! I get passionate about a particular aspect of the business at Moz (for example, this blog), and overinvest my own time in it, along with those of folks I manage or influence (which is quite a good number at this point). That pulls resources off other mission-critical projects and, potentially, hurts the company's ability to accomplish all those things that desperately need doing. Mike King recently dropped by Seattle for our mini-Mozcation/charity bake sale (he gave a killer presentation called \"What Being an Indie Rapper Taught Me About SEO\"). On our walk to dinner after the event, I mentioned to him that it embarrassed me to say that, in the past few years, I've knowingly prioritized projects over SEO, social media or other inbound marketing efforts during our roadmap meetings at Moz. I know.... I complained for years about how the companies I advised as a consultant didn't put SEO first, and then, when I have the power to change things at my own organization, I put other projects first. I'm a hypocrite! But, I'm also responsible for the success of the whole business, and sometimes that means stepping away from being CEO of just your job to seeing the bigger picture and knowing when your projects deserve to be on the backburner or even when something you're working on needs to be scrapped entirely in favor of a new direction or wholly new task. Autonomy and freedom to kick ass at your work is a great power, but also a great responsibility. If you put your job CEO-dom ahead of the broader goals, things can get messy. p.s. Hopefully, this post can also help in-house, agency and consultant marketers who get frustrated with executives for not pushing through their agendas with the speed or passion we'd put behind it. Sometimes, especially if resource allocation is a roadblock, it might actually be the right decision (rarely, though). :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Be the CEO of More Than Just Your Job"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Be the CEO of More Than Just Your Job"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}