{
  "url": "https://moz.com/blog/be-your-sites-hero-audit-manifesto-next-level",
  "slug": "be-your-sites-hero-audit-manifesto-next-level",
  "title": "Be Your Site's Hero: An Audit Manifesto – Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO comes with a lot of \"whys\" that can be difficult to answer. Jo Cameron is here to remove some of the mystery and level up your site audit skills with the help of ace tips, Bonnie Tyler, and a hefty toolkit in the newest installment of our Next Level educational series!",
  "content": "Be Your Site's Hero: An Audit Manifesto – Next Level Advanced SEO | SEO Basics | Competitive Research By: Jo Cameron April 6, 2016 Table of Contents Copied! By: Jo Cameron April 6, 2016 Be Your Site's Hero: An Audit Manifesto – Next Level Advanced SEO | SEO Basics | Competitive Research [Estimated read time: 12 minutes] Welcome to the newest installment of our educational Next Level series! Last time, we shared some advice on resolving duplicate content issues. This time around, we're rocking out to the tune of site audits. Read on and level up! Finding out what's hampering your site on its journey to the top of the SERPs can feel like a mystery sometimes. Why aren’t I ranking? Why are people bouncing off my page? Why, why, why? To stop you going 'round and 'round in circles and to find the answers to these questions, I’m calling on the sweet, husky tones of '80s pop idol, Bonnie Tyler. Be warned — you’re about to be earwormed! As Bonnie Tyler hollers: “...it’s gotta be fast, it’s gotta be strong, and it’s gotta be fresh from the fight!” I’m not going to stop there, because it has also: “...gotta be sure, it’s gotta be soon, and it’s gotta be larger than life!” In case you were wondering why this is relevant, it’s not just an angsty love song, but a full-blown, toe-tapping site audit manifesto. Using Bonnie’s passionate message as a guide, I’ll show you how you can run a simple site audit that will identify priority issues and ultimately sweep all and sundry off their proverbial feet. I’ll show you the free tools I find invaluable when searching for site issues and how you can plug this knowledge into Moz Pro, as well as some quick and easy tricks to get your audit to the next level. Now that I’ve got you humming along, let’s go through these 6 site essentials that Bonnie is so darn keen on. #1: Gotta be FAST It doesn’t matter if you’re running a humble 5-page website, a WordPress for your small business, or an encyclopedic, all-singing, all-dancing ecommerce website. Each page on your site needs to load quick-smart. Slow pages won't only impact the way your site is crawled — they'll also affect user experience. Think about the last time you visited a slow site; how long until you bailed? I would say that after 4 seconds I’m rapidly losing trust, patience, and the will to live. Site speed is very interesting, because it aligns the interests of two very important site visitors: bots and humans. If your site is too focussed on one and forgets the other, your site might end up being completely unenjoyable from a human perspective, or too hard to crawl and index. Toolkit Screaming FrogGoogle PageSpeed InsightsMoz Pro So let’s start answering those “why” questions by grabbing a site crawling tool. Screaming Frog is a downloadable software that allows you to crawl 500 pages for free. Crawling software, like the adorable Screaming Frog SEO spider, will have you whizzing around the site dressed up like a bot and seeing the code like a machine does. Save that cute li'l froggy to your dock, like I’ve done below, and you’ll have the power to crawl your own (or someone else’s) website with the click of a button. Workflow First things first: paste or type in your website URL into the field at the top, then click \"Start\" to let the crawler do its job. Next you can filter by “Response Time” to find the pages that aren't cutting the mustard. Whoa, 11 seconds?! Get out of town! You have got to find out more, so now is a good a time as any to set up your Moz Pro campaign. If you’ve not used it before, you can set up a 30-day free trial. Upon setup, you’ll get a prompt to check out PageSpeed Insights through the \"Insights\" tab when you first create your campaign. And here are your PageSpeed stats, right at your fingertips. Click \"Learn More\" to go straight to the Google PageSpeed insights to find out what specifically on your site is dragging you down. It may be a symptom of a larger problem. This tool is great for getting right to the root cause of slow load time. Click \"Show how to fix\" for further guidance. It’s a real insight into how important site speed is to user experience. Consider for a moment that Google built a tool specifically to help you diagnose these issues… Have we found our hero? Further reading Use the Google PageSpeed Module to Dramatically Increase the Speed of Your Website How Website Speed Actually Impacts Search Ranking How to Achieve 100/100 with the Google PageSpeed Test Tool #2: Gotta be STRONG Fast is great, but you also want your site to be built on strong foundations that are water-tight. A strong site is never down and gives the user what they need without throwing up barriers. Toolkit Moz Crawl TestHttpStatus checker Workflow We’ll use Moz Crawl Test for this bot job, which is available in Moz Pro, and start gathering data for up to 3,000 pages. Pop your site in, like you did with Screaming Frog, and click \"Crawl this URL.\" Our thoughtful little bot, Roger, takes care not to slow your site down, so Crawl Tests can take a few hours to complete. But it’s worth the wait, and you’ll get an email once it’s complete. The crawl report is available for 90 days, so export that tasty CSV and save it so we can work some Excel magic. We’ll use this CSV later on as well, so keep it safe. In Excel, sort your results by \"HTTP Status\" to find those pesky pages throwing up nasty 500s, unexpected 404s and forgotten 302s. 500s are server errors. They can be temporary, but best to check with your host to see what exactly is going on. 400s indicate a problem with the page. Check that page out on your backend. You might need to look at putting a 301 redirect in place if that page has changed location. 300s indicate a redirect of some sort. Learn the difference between a 302 and a 301. \"302 temporary, 301 permanent.\" Drill it into your brain, chant it during your workout, pull it out at dinner parties to impress your guests. Whatever it takes. It’s fundamental, and as a web manager, marketer, online business owner, or budding SEO... you should know the difference. If you don’t address these errors at your earliest convenience, especially on high-traffic pages, you will be disappointing me, Bonnie, and your potential customers. So now that you’ve got the scoop, next you can dig a bit deeper with a header checker tool to locate any canonicalization errors or redirect loops. These might not looks so bad on the browser, but can be bad news for bots. Enter all your URL combos (www, non-www, and https://) into this status checker tool: https://httpstatus.io/ Hover over the redirect to check they’re all pointing to the correct URL. OK, right on moz.com!! 301s all pointing to the same location. Now that you know what we’re looking for, let’s see what happens when good sites go bad… The site below starts off great, but then we see an error, and it looks like we have two versions of the URL accessible. See those 200 status codes? They generally mean we’re all gravy, that people can access that page, buuut it’s not so great in this instance. Letting bots and humans reach your site from two URLs, like www.moz.com and moz.com at the same time, is called a \"canonicalization error.\" Say it 5 times fast, because that’s the only fun you’ll have with a canonicalization error. Below we see a redirect chain and a canonicalization error. This is something you might not see in a browser, but when you're dressed up like a bot it’s uncovered. Redirect chains and canonicalization errors make it harder for search engine bots to crawl your pages. And you’ll be wasting your link juice like a sprinkler on hot tarmac. We’re starting to find some answers to those bothersome \"why\" questions. These errors can be the holes in your otherwise solid ship. It’s time to go plug them up. Further reading Learn SEO: HTTP Status CodesLearn SEO: CanonicalizationThe Web Developer's SEO Cheat Sheet #3: Gotta be FRESH from the fight SEO can be a bit of a fight sometimes. (What am I saying? I mean ALL the time.) Not only do you fight to keep up to date with the latest Google algorithm updates — you also battle with your competition in the SERPs. You’re a busy website owner, you’re managing orders, or you're helping customers and running your business. You don’t have time to digest every update. I get it. It’s understandable that you don’t want to take time away from pressing jobs at hand to read about a Penguin or a Panda update. But you also don’t want to be clueless when the winds shift — and so do your rankings. That’s where these tools come in handy. Toolkit MozcastGoogle Algorithm Change HistoryMoz Pro: Keyword Rankings Workflow Find time to check Mozcast as regularly as you can. This will show you if things are heating up and can indicate adjustments to the algorithm. Not sure what that all means? I would strongly recommend setting some time aside to read through the Google Algorithm history; it really helps put things into perspective. I’m going to plug Moz Pro again, because this feature is really nifty. You can get \"updates in your updates\" (as beautifully Tweeted by our main man Jeremy), and see your ranking data with Google updates overlaid. It’s important to note that correlation doesn’t necessarily mean causation. This means that a change to the way Google calculates results might affect your rankings, or it could be a coincidence. Maybe something else happened, like your competition put some work into their SEO, or maybe there's a new competitor on the scene, and so on. You can see if an algo update aligns with fluctuations in your website rankings, and gets you started in your investigations as to why those fluctuations occurred. #4: Gotta be SURE In SEO (and pretty much the world) everything is relative. From my very first day on the job as a baby SEO, I’ve been asked by website makers of the world: what is a “good” number? What is a good level of competition? What is a good number of searches? What is a good number of links?… and so on. So here’s what you want to know: a good number is the number that’s better than your direct competitor. Being sure is about knowing who your competitor is, and understanding what they're doing. That’s why you’re going to do everything you’ve just done above, but for your competitor’s website. But, before you rush off to do that, I’ll show you some more free tools to assess who your competition is. Toolkit SimilarWebGoogle (or your friendly neighborhood search tool)SEMRush Competitive Data ToolMoz ContentMoz Pro Campaign Workflow Pop your domain into SimilarWeb and click \"Add Competitors.\" Looky what we have here! A dropdown with a list of relevant sites to get you started. By entering the URL moz.com into SimilarWeb, we’ve found Semrush.com, Raventools.com, opensiteexplorer.org, Hubspot.com, and Searchengineland.com. That’s a great start, but there are no surprises here. That’s why I also like to do a few manual searches in Google to find out who is else is ranking for those all-important primary keywords. Type in some of your main categories, topics, and long tail keywords to see what other sites are out there ranking for these terms. You can also enter your domain, keyword, or a URL into SEMrush’s Competitive Data tool. I have found this works really well for your broader primary keywords, but if you pop in a long tail term you might find there isn’t enough data. For the term \"easy site audit\" above, we’re not getting any results. That’s OK — you can go back to manual searches. But for a broader term like \"site audit?\" Whoa! Look at that great data! This tool gives you quick and easy insight into your niche, helping you find related keywords to pop back into the tool or into Google so you can uncover more competitors through the organic search results tab. But don’t stop while you’re on a roll! You can also find out even more about your potential competitor by popping their URL into Moz Content. You can run 5 content searches, 25 pages for a site, and 10 results per search on our Freemium plan. I’ve entered \"site audit\" to see what articles and sites are performing well for this keyword. Now we’ve also turned up results from some other sites, including searchenginejournal.com So I’ll also run a search for site:searchenginejournal.com to see how their content is performing. Now we can use all this valuable info to make educated decisions about what competitors to enter into your Moz Pro campaign. Moz Pro automatically suggest 3 competitors, but with the research you’ve performed you’ll now have a good idea of who else you want to stalk — err, I mean track. If you have more than 3 competitors you want to track, set up a second campaign for your domain and enter the other competitors. This works particularly well if you’re a small or new site and still feeling your way around within your industry. Now you have a good idea of who you’re competing with and you’re keeping a beady eye on what they’re up to. Further reading Conquer Your Competition With These 3 Moz Tools – Next LevelThe Illustrated SEO Competitive Analysis Workflow #5: Gotta be SOON \"Soon\" is a nicely vague timeframe, isn’t it? Soon relative to what, exactly? In this section, we’re going to figure out your priorities. The issues you’ve found on your site could be as vital as a server error on a crucial page (remember those nasty 500s we talked about before?), or something you’ll gradually fix, like missing alt tags on images of less-important pages. It’s nice to think we can fix everything at once, but no matter how much bandwidth you give a project, there's only so much you can get done at any one time. Make sure you prioritize your tasks so you don’t bite off more than you can chew. Toolkit Moz Pro Site CrawlYour Crawl Test Excel file from step #2 Workflow The main reason I love having a Moz Pro campaign set up for my site is the weekly Site Crawl. It finds all the things that need attention on your site and dishes them out to you neatly prioritized by High, Medium, and Low. High-priority issues are things you should really take care of straight away. But by gosh, look at our Medium issues! There are 1,688 of them, so where the heck do you start? This is where you can use some simple Excel data filtering to locate the pages with on-page issues that need attention based on Page Authority like I’ve done below. I filtered by \"Title Element Too Long\" and then sorted the results by Page Authority. Now you can work through from top to bottom, crossing them off as you go. Pretty cool, right?! If you’re a one-person-band, maybe you can look at fixing one a day, or do a couple every afternoon, or once a week — make it Bonnie Tyler Tuesday and bash those Medium issues right on the nose. Further reading Technical Site Audit Checklist: 2015 Edition #6: Gotta be LARGER than life We’ve been bogged down in all these Excel sheets and data, so now it’s time to use your creativity to come up with some larger-than-life ideas. This could be the next step beyond your current state. After all, you now know this site inside and out. Toolkit A sunny dayA dog’s wagging tailBonnie Tyler on full blast Workflow Step away from your computer, go to your creative space and think big. Draw, walk, talk to someone you know. Shake all that data out of your brain and reconstruct it into something new and beautiful. Further reading How to Create Content that Earns Engagement, Trust, and Loyalty for Your BrandHow to Create 10x ContentHow to Find Your Brand's Disruptive Opportunity Did you hold out? I hope this manifesto serves you well in your quest to make your site the best it can possibly be. If you get stuck or overwhelmed, just hum this tune and you’ll soon be back on track. Don’t forget that Moz Pro is free for the first 30 days and you’ll be able to try out all the Mozzy features mentioned in this post to get your site ship-shape. I’d love to know what tools, tricks, or love songs you listen to to get you revved up — let me know in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Be Your Site's Hero: An Audit Manifesto – Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Be Your Site's Hero: An Audit Manifesto – Next Level"
    },
    {
      "level": "H2",
      "text": "#1: Gotta be FAST"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H3",
      "text": "Workflow"
    },
    {
      "level": "H4",
      "text": "Further reading"
    },
    {
      "level": "H2",
      "text": "#2: Gotta be STRONG"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H3",
      "text": "Workflow"
    },
    {
      "level": "H4",
      "text": "Further reading"
    },
    {
      "level": "H2",
      "text": "#3: Gotta be FRESH from the fight"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H3",
      "text": "Workflow"
    },
    {
      "level": "H2",
      "text": "#4: Gotta be SURE"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H3",
      "text": "Workflow"
    },
    {
      "level": "H4",
      "text": "Further reading"
    },
    {
      "level": "H2",
      "text": "#5: Gotta be SOON"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H4",
      "text": "Workflow"
    },
    {
      "level": "H4",
      "text": "Further reading"
    },
    {
      "level": "H2",
      "text": "#6: Gotta be LARGER than life"
    },
    {
      "level": "H3",
      "text": "Toolkit"
    },
    {
      "level": "H3",
      "text": "Workflow"
    },
    {
      "level": "H4",
      "text": "Further reading"
    },
    {
      "level": "H2",
      "text": "Did you hold out?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jo Cameron\n          \n            Jo Cameron\n          \n            Jo Cameron"
}