{
  "url": "https://moz.com/blog/beat-your-competitors-rankings-comprehensive-content-whiteboard-friday",
  "slug": "beat-your-competitors-rankings-comprehensive-content-whiteboard-friday",
  "title": "How to Beat Your Competitor's Rankings with More *Comprehensive* Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand's three-step process for improving your \"content comprehensiveness\" will help you answer all of a searcher's questions and help you beat out competitors for those higher-ranking positions.",
  "content": "How to Beat Your Competitor's Rankings with More *Comprehensive* Content Whiteboard Friday | Content Marketing By: Rand Fishkin November 11, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 11, 2016 How to Beat Your Competitor's Rankings with More *Comprehensive* Content Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Longer, more thorough documents tend to do better in the search results. We know that's true, but why? And is there a way we can use that knowledge to our advantage? In today's Whiteboard Friday, Rand explains how Google may be weighting content comprehensiveness and outlines his three-step methodology for gaining an edge over your competitors when it comes to meeting searchers' needs. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about, well, something I've noticed, something we've noticed here at Moz, which is that there seems to be this extra weight that Google is putting right now on what I'm going to call content comprehensiveness, the degree to which a piece of content answers all of a searcher's potential questions. I think this is one of the reasons that we keep seeing statistics like word length and document length is well-correlated with higher rankings and why it tends to be the case that longer documents tend to do better in search results. I'm going to break this down.Broad ranking inputs On the broad ranking inputs, when Googlebot is over here and sort of considering like: Which URL should I rank? Someone searched for best time to apply for jobs, and what am I going to put in here? They tend to look at a bunch of stuff. Domain authority and page-level link authority and keyword targeting, for sure. Topic authority, the domain, and load speed and freshness and da, da, da.But these four, all of which are sort of related: Searcher engagement and satisfaction, so the degree to which when people land on that page they have a good experience, they don't bounce back to the search results and click another result. The diversity and uniqueness of that content compared to everything else in the results. The raw content quality, which I think Google has probably lots of things they use to measure content quality, including engagement and satisfaction, so these might overlap. And then comprehensiveness.It's sort of this right mix of these three things, like the depth, the trustworthiness, and the value that the content provides seems to really speak to this. It's something we've been seeing like Google kind of overweighting right now, especially over the last 12 to 18 months. There seems to be this confluence of queries, where this very comprehensive content comes up in ranking positions that we wouldn't ordinarily expect. It throws off things around link metrics and keyword targeting metrics, and sometimes SEOs go, \"What is going on there?\" So, in particular, we see this happening with informational- and research-focused queries, with product and brand comparison type queries, like \"best stereo\" or \"best noise cancelling headphones,\" so those types of things. Broad questions, implicit or explicit questions that have complex or multifaceted answers to them. So probably, yes, you would see this type of very comprehensive content ranking better, and, in fact, I did some of these queries. So for things like \"job application best practices,\" \"gender bias in hiring,\" \"résumé examples,\" these are broad questions, informational/research focus, product comparison stuff. Then, not so much, you would not see these in things like \"job application for Walmart,\" which literally just takes you to Walmart's job application page, which is not a particularly comprehensive format. The comprehensive stuff ranks vastly below that. \"Gender bias definition,\" which takes you to a short page with the definition, and \"résumé template Google Docs,\" which takes you to Google Docs' résumé template. These are almost more navigational or more short-format answer in what they're doing. I didn't actually mean to replace that.How to be more comprehensive than the competitionSo if you want to nail this, if you identify that your queries are not in this bucket, but they are in this bucket, you probably want to try and aim for some of this content comprehensiveness. To do that, I've got kind of a three-step methodology. It is not easy, it is hard, and it is going to take a lot of work. I don't mean to oversimplify. But if you do this, you tend to be able to beat out even much more powerful websites for the queries you're going after. 1. Identify ALL the questions inherent in the search query term/phrase: First off, you need to identify all the questions that are inherent in the searcher's query. Those could be explicit or implicit, meaning they're implied or they're obvious. They could be dependent on the person's background, the searcher's background, which means you need to identify: Who are all the types of people searching for this, and what differences do they have? We may need different types of content to serve different folks, and there needs to be some bifurcation or segmentation on the page to help them get there.Same thing on their purpose. So some people who are searching for \"job application best practices\" may be employers. Some people may be job applicants. Some may be employees. Some may be people who are starting companies. Some may be HR directors. You need to provide that background for all of them. One of the ways to do this, to get all the questions, truly all the questions is to survey. You can do that to your users or your community, or you can do it through some sort of third-party system. For example, Oli Gardner from Unbounce was very kind and did this for Moz recently, where he was asking about customer confusion and objections and issues. He used UsabilityHub's tests. UsabilityHub, you can use this there as well. You can also use Q and A sites, things like Quora. You can use social media sites, like Twitter or LinkedIn or Facebook, if you're trying to gather some of this data informally. 2. Gather information your competition cannot/would not get: Once you have all these questions, you need to assemble the information that answers all of these types of questions, hopefully in a way that your competition cannot or would not get. So that means things like: Proprietary data Competitive landscape information, which many folks are only willing to talk about themselves and not how they relate to others. It means industry and community opinions, which most folks are not willing to go out and get, especially if they're bigger. Aggregated or uniquely processed metrics, obviously one of the most salient recent examples from the election that's just passed is sites like FiveThirtyEight or the Upshot or Huffington Post, who build these models based on other people's data that they've aggregated and included. It also could mean that you are putting together information in visual or audio or interactive mediums. 3. Assemble in formats others don't/can't/won't use: Now that you have this competitive advantage, in terms of the content, and you have all of the questions, you can assemble this stuff in formats that other people don't or won't create or use. That could be things like guides that require extraordinary amounts of work. \"The Beginners Guide to SEO\" is a good example from Moz, but there are many, many others in all sorts of fields. Highly customized formats that have these interactive or visual components that other people are generally unwilling to invest the effort in to create. Free to download or access to reports and data that other people would charge for or they put behind pay walls. Non-transactional or non-call-to-action-focused formats. For example, a lot of the times when you do stuff in this job search arena, you see folks who are trying to promote their service or their product, and therefore they want to have you input something before they give you anything back. If you do that for free, you can often overwhelm the comprehensiveness of what anyone else in the space is doing. This process, like I said, not easy, but can be a true competitive advantage, especially if you're willing to take on these individual key phrases and terms in a way that your competition just can't or won't. I'd love to hear if you've got any examples of these, if you've tried it before. If you do use this process, please feel free to post the results in the comments. We'd love to check it out. We'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Beat Your Competitor's Rankings with More *Comprehensive* Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Beat Your Competitor's Rankings with More *Comprehensive* Content"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Broad ranking inputs"
    },
    {
      "level": "H2",
      "text": "How to be more comprehensive than the competition"
    },
    {
      "level": "H3",
      "text": "1. Identify ALL the questions inherent in the search query term/phrase:"
    },
    {
      "level": "H3",
      "text": "2. Gather information your competition cannot/would not get:"
    },
    {
      "level": "H3",
      "text": "3. Assemble in formats others don't/can't/won't use:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}