{
  "url": "https://moz.com/blog/bebo-the-best-social-network-no-its-just-the-best-bebo",
  "slug": "bebo-the-best-social-network-no-its-just-the-best-bebo",
  "title": "Bebo the Best Social Network? No; It's Just the Best Bebo - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The British consumer organisation Which? has released the results of an independent assessment which lead to it naming Bebo as the 'best social networking site'. The test was based on factors including:ease of setting up and using the site, the range of features, and the way the site...",
  "content": "Bebo the Best Social Network? No; It's Just the Best Bebo Social Media C By: Ciaran Norris January 7, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris January 7, 2008 Bebo the Best Social Network? No; It's Just the Best Bebo Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The British consumer organisation Which? has released the results of an independent assessment, which lead to it naming Bebo as the 'best social networking site'. The test was based on factors including: ease of setting up and using the site, the range of features, and the way the sites protected privacy and security, including how easy it is to remove personal details. Considering the fact that Which? is a very respected organisation (sorry about the Wiki link, guys) and that the criteria mentioned are all very valid, we can assume that the suggestion that Bebo is the best social network is a valid one, right? Wrong. It's utterly ridiculous. In many ways, the report makes the same kind of assumptions that many of the commenters did on Rebecca's recent MySpace rant post, Things I Hate About MySpace. Whilst a lot of Rebecca's gripes were valid ones, relating to site performance & the like, a lot of the comments could be summed up as: I don't get it. It's messy. Too loud. Bloody kids. Things weren't like this in my day. Bring back national service. Meh! Now, these are all entirely acceptable reasons for deciding not to use a particular social network, but they also highlight the difficulties of trying to compare them; just because we group them together, they are in fact utterly unique, and the Which? report is therefore the equivalent of announcing that oranges are the best cars. Or something. The problem with the report and the views of many of the Mozzers on Rebecca's post can be broadly summarised in two ways: Which? assumes that a social network can be judged on its ease of use, its privacy, and other such issues. In fact, the only thing that can be assessed by looking at these factors is how well a site deals with those factors. Bebo may encourage 'responsible networking', but that only means that it is the best at encouraging 'responsible networking'. The reason that it is so popular is unlikely to be down to any of these reasons and is much more likely to be due to the simple fact that it provides its target market with what they want (essentially, their own little world). We are all guilty, to varying degrees, of making professional judgements on social networks & other sites based on our personal tastes (i.e., I hate digg. I just do. Sorry). Most of the comments about MySpace referred to it as ugly, or badly designed. But if you happen to be a teenage emo fan interested in finding new music, then you probably don't want a minimalistic white profile; you want one that looks like Robert Smith just vomited on your wall. It is for a mixture of these reasons that the same old sites always get press, whilst other very successful networks receive almost none. So, Facebook gets tons of press (at least here in the UK) and I seriously put a lot of that down to the fact that media & lifestyle journalists in their mid-30s can 'understand' the site. They get it. But Habbo, a phenomenally successful site aimed at the yoof audience? Barely a mention; probably because they don't feel comfortable hanging out in a virtual world where most of the users speak a language they don't even understand, antwacky old mouldies that they are. It seems that no matter how much we may wish it otherwise, people will continue to use and enjoy sites that we can't stand, no matter how much we try to explain to them why they shouldn't. Because at the end of the day, if someone has a personal reason for liking a particular site, then that's the best reason there is. Ciarán is the SEO & Social Media Director at British online marketing agency Altogether Digital. He's signed up with lots of social networks & has trouble remembering all of his passwords. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bebo the Best Social Network? No; It's Just the Best Bebo"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bebo the Best Social Network? No; It's Just the Best Bebo"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}