{
  "url": "https://moz.com/blog/become-an-effecte-marketing-manager-with-disc",
  "slug": "become-an-effecte-marketing-manager-with-disc",
  "title": "Become an Effective Marketing Manager with DISC - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you Getting Things Done? Supporting the E-Mail Charter? Prioritizing correctly? If you answered yes, then congratulations, you are effective with your working time. But what about your team? Are you as effective in managing your team?",
  "content": "Become an Effective Marketing Manager with DISC SEO Copywriting By: Andre Kiwitz November 21, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Andre Kiwitz November 21, 2011 Become an Effective Marketing Manager with DISC SEO Copywriting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Are you Getting Things Done? Supporting the E-Mail Charter? Prioritizing correctly? If you answered yes, then congratulations, you are effective with your working time. But what about your team? Are you as effective in managing your team? If your answer is no, please check the resources I linked to above. If your answer is yes I would like to take you to the next level. Getting the most out of your Online-Marketing Team. Introducing DISC DISC is a model that illustrates how people have natural tendencies and motivations depending on their personality type. Some people are motivated by money or recognition and others by well-being. While certain individuals like direct communication, others prefer gentle talks. Getting to know your employees improves Mutual Communication leading to an more enjoyable work environment and increased productivity. Would you travel to Peru and expect to communicate clearly with the locals in English? Of course not, because English isn’t their language. Clearly your would achieve better communication in Spanish. The same logic applies to communication with your work force, you must speak their language. Being aware of the different personalities in your company gives you the power to adapt your message to the recipient. Clear, effective messages improve relationships, increase productivity, and result in successful business. The DISC model is both popular and proven, making it easy to find online resources about it. Over the years I have studied the DISC model thoroughly. Having implemented it in my own business I have observed it at work. The DISC model explained in this article is based upon my personal findings and experiences. I would like to keep the explanations short. Basically DISC analyses a person's behavior and personality based on four segments: Dominant, Influence, Steady (or Supportive) & Cautious. The analysis asks the following questions. a) Are they assertive or reserved? b) Are they task or people focused? Some people have a very balanced profile, others have a high characteristic in just one or two segments. A person classified as being an Influencer for example is referred to as \"High I\" , this is how his profile would look like compared to a balanced profile: a balanced profile: a profile from a \"High I\" Discovering your team members natural behavioural tendencies can be found in two ways. You can have them fill out a questionnaire and purchase the analysis. Or you can simply observe and analyse their behaviour yourself. In my opinion the latter is good enough. For example, a dominant person is assertive and task focused, while an Influencer is assertive and people focused. Dominant individuals (\"High D\") love to take responsibility, solve problems, and are often managers or business owners. Influencers love networking, to solve a problem, their first step is to think of a person that might be able to help them. \"High I's\" are often found in politics, journalism, or consulting. The Supportive person (\"High S\") enjoys a comfortable atmosphere. They love working for foundations, helping others, and contributing to the greater good. The cautious (\"High C\") thrives in an atmosphere of control over the situation where through logic they are able to solve problems (they typically enjoy jobs such as engineering, accounting, or medicine). Three tips to get the best out of your team: 1) Get effective with the composition of the team If you ask an experienced manager, how they get great results they will tell you the key to great results is their team. And that's the truth, but that’s not all. Having the best engineers in the world doing Marketing won’t get you the results you're looking for. A productive work force is typically comprised of a mix of High D's, High I's, High S's and high C's. So analyse the tasks of your team and adjust accordingly. A team of High D's will result in leadership but nobody will want to do the actual work. If you just have just High I's you will lack in planning and controlling. A team of High S's and you will have invest too much time to details and fail to produce results. If your workforce is all High C's your team like won't adapt quickly to change and therefore fall behind the competition. So, analyse your team. Your marketing team for example may include the following positions. Link builder, Content Creator, Conversion Optimizer, Usability Specialist, Web Developer, Social Media Specialist, Onsite-SEO Specialist, Graphic Designer, etc... When choosing your team, don't make the common mistake of selecting individuals like yourself! Utilize the DISC model. Recruit High I's for the Social Media and Link-building. Web Developers and Onsite-SEO positions should be filled by High C’s. For the positions of Usability Manager and Graphic Designer look for a High S. High D’s should be placed working as a Conversion Optimist or Project Manager. Creating a mixed team and aligning personality types to job positions will improve productivity, efficiency, and overall job satisfaction. 2) Motivating your team with DISC Would you give your 10 yr old niece a gift card to Starbucks for good grades? Of course you wouldn’t, and you wouldn’t try and motivate a High C with a gift card to the GAP. A more appropriate incentive would be to send them to a life-hacker convention for example. Different personality types are motivated in different ways, so make sure your incentives are appropriate. To make things easy on you I included a small Cheat Sheet for DISC: When giving positive feedback encourage effective behaviour by letting the High I know, that his work will be highly recognized by his colleagues and others in the industry. If providing positive feedback to a High C, you would tell them that their work is helping to raise the Quality Standards in the company. 3) Avoiding Common mistakes in your Team A typical staff meeting may go something like this \"Hi Staff, it is important for me that we finish all of our projects on time this quarter\" This message will be received differently by each individual due to their unique personality types. The High D will tell herself: sure, that's the way it should be. The High I may hear the words but soon forget the message. To be effective it's better to address the weaknesses of your team members individually in your one-on-ones. For example in the O3 with the High I \"Hi Daniel, this project is important for the reputation of the company and will influence how people will judge your work here. To make sure, we are on the right on track I would like you to send me a detailed project plan and update me weekly on how we are progressing\". This is a mix of my second and third recommendations ;-) 4) An enjoyable work environment DISC will help you identify individual topics that are important to your team members. Talking to a High S about upcoming changes in the company and how everything will become better won't get them excited or make them feel better about the future. To the contrary a High S. will most likely worry about the details and not the big picture for example, how big is the new office, will there be a window, and what will parking be like? The changes may not even be that big, but as a High I you embrace changes and see them coming a lot. So, keep in mind what your team fears and what they enjoy talking about. So to address a change in the company to a High S, emphasize \"how\" things will change to make things better for \"the whole team\". This will encourage the High S and he will be less likely to hinder your plans for the changes. As you see, DISC can provide great value, so I highly recommend downloading the Cheat Sheet and using it until you are comfortable and communicating more effectively with your team. PS: Getting to know Geraldine, Rand and Casey at the mozcation in Lima was awesome, thanks for coming to South America. I really hope you enjoyed mozcation as much as Yngrid and I did. Andre Kiwitz is the Founder of viventura, a Tour Company organizing tours to South America. His passions are South America, Travel, Online Marketing, & Management. You can follow him on Facebook, Twitter, LinkedIn & Google+. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Become an Effective Marketing Manager with DISC"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Become an Effective Marketing Manager with DISC"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Anatomy of Addictive Content"
    },
    {
      "level": "H3",
      "text": "Humans vs. Robots: Picking the Best Audience for Your SEO Content"
    },
    {
      "level": "H3",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andre Kiwitz\n          \n            Andre Kiwitz"
}