{
  "url": "https://moz.com/blog/bees-attract-bees-social-networking-over-the-net",
  "slug": "bees-attract-bees-social-networking-over-the-net",
  "title": "Bees Attract Bees - Social Networking Over the Net - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "An Idea can change the world.But internet is a funny place – so many great ideas and start ups failed for so many unknown reasons. So...",
  "content": "Bees Attract Bees - Social Networking Over the Net Social Media K By: Kamanashish Roy March 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kamanashish Roy March 19, 2008 Bees Attract Bees - Social Networking Over the Net Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. An idea can change the world. But internet is a funny place – so many great ideas and startups failed for so many unknown reasons. Sometimes you can guess the reason and sometimes you can just watch the ship sink. Actually, we can rephrase the first sentence: An Idea can change the world if you can spread it well. And to spread an idea you need more people (nodes) who will believe it, act on it, spread it, and take those extra initiatives. Actually, you need a social network. The basic idea is still playing its role in different formats and styles, such as Socialize and identify yourself in respect to the webby friends or FOAFs that you have made. Somewhere, the basic philosophy is that of creating a virtual network of friends, a network of like minded people with at least one common field of interest (in Orkut you have the liberty to start a discussion board). Social beings on the net: When you are born, you are given an identity by the society. You have nothing to do about it. At most you can improve on it, but you can in no way erase your history. However, on the net, you are born as anonymous and build up your identity or personality as you wish (although, most of the netizens are not aware of it). But, in the process, you do not lose your anonymous identity or anonymity (call it a blessing or a curse of internet, but it is reality) – you can easily shift between both. Anyway, here we have identified top 10 networking websites in respect to their features and usability. Debates: We had to undergo a lot of debates among us to determine “which features identify a social networking platform.” The primary reason why Orkut or Facebook is already established as a social networking website is that they both offer you a platform to communicate with each other. In this respect, we can call BlogCatalog or MyBlogLog social networking websites too, as they offer the same platform to its members (bloggers). However, we did not include them into the social network sphere, as they do not try to identify the actual physical location of the blogger – the emphasis is not on the social human being, but on his or her web presence (blogger id). We also had a lot of debates on whether there is anything social in LinkedIn or not, but finally we decided that it could not come into the list. We found it more like a website where you manage your profile. You can not discuss, though you can add friends in your contact list. Theoretically, “Forums” also stand close to social networking phenomenon, since you can communicate with another person and, unlike a blog, anyone can start a conversation. But the basic difference is that in a forum the topic in discussion is more important then the person. Thus, the essence is different and that is why we kept them separate. We also thought a lot about what are the most important features that can help to build a good social network. We were especially concerned about where the website was putting maximum emphasis. For example, we asked if it is really necessary to integrate a blog platform in social networking websites. However, we concluded that it can be an “added service” and not the primary one. The most important aspect was the scope for p2p contact. We were also interested in finding the impact of Gravatar on social networking. Perhaps we will be able to come up with our study result soon. And we think that there are a lot of things to do on the internet than networking. Primary Parameters: What were the primary parameters of selecting social network websites? Scope for internal and interpersonal discussion and communication (micro communities - organizations, groups) Probations for incorporating existing and new friends Enough space or scope to identify the person by himself or herself Offline to online transformation User registration Our Findings: Blogger.com gave a good fight to Myspace.com. But Blogger.com is primarily a blog platform rather than a platform for social networking. You can start a discussion there in the Myspace forum, create groups (micro communities), change the layout of your page, and add widgets. Here you can also search for new friends and invite existing friends (offline to online). And the best thing is that you get a section called Events where you can introduce an offline event. The attendees can list themselves there. We liked this feature because the margin between offline and online is reduced more due to this feature. In other social networking sites you can post such events, but an official (built in as a feature) events calendar has a different impact. Apart from that, you can post advertisements in the classifieds section. We also liked this feature because it creates another field for real life communication. At the same time, it saves a lot of souls from spammers and others who do not want to become a spammer. When you register in Friendster, the very next step is to “invite your friends” from your mail account (you can skip this step, too). We did not like this step. We feel that inviting friends to join can be an attached feature and not the main focus. We should let the new member establish him or herself at the first place, and if they want, they can invite more people. At the same time, we believe that registration does not stand for complete faith on that site. We do not know the ratio of people who actually complete this step but as experienced web surfers, we all looked for the skip button. Who likes to share personal information with someone on the very first meet! You can start a blog there (paid or ad supported). But the URL structure of these blogs is like http://title.blog.friendster.com (same as Windows Live spaces), which does not give a serious impression (this is not a serious blogger's platform, either). Like Myspace, you can change the layout of your profile page and add more widgets. You can also set your profile as private. However, the page structure is somewhat similar to Orkut. There too you can create a group, start a discussion, make new friends, etc. And they have a free classified section where you can buy and sell things. They have a video section where you can upload your own videos. However, the overall impression is that the site is too clumsy, with scattered elements like Myspace. Like Friendstar, Multiply has “invite your friends” as the next step to registration (as usual, you can try this later). Basic features are almost similar to Friendstar, but require Java installation to run the page. You can upload photos, create groups, and, as they claim, this is one site for everything. Unlike most sites, you can import your blog posts from other platforms like Blogger, Typepad, xanga, etc, or start writing there. You can customize the look of your site, too. The good thing is that they have made a clear statement on their purpose – “By inviting your friends and family and encouraging them to invite their friends and family, you'll eventually be connected with everyone in your social circle (your 'network').” It’s a good effort to take offline to online. However, we could not see other “faces” until we joined a group and clicked on the ‘View Members’ link or we searched for someone by name or mail id. You can meet other people and add them as a contact, but somewhere there is some sort of a hindrance. It seemed like they are putting more emphasis on groups and activities rather than people. Groups are more easily accessible then people. Last but not the least – page layout is better than Myspace or Friendstar. Now the latest buzz is that Bebo and Facebook have teamed up on technology. Whatever the outcome, it is a good site so far. And can pose a real threat to Myspace. Bebo also asks you to add friends (existing offline) or find them here via mail id or name (it strictly looks for first and last name to search; which means that you are well aware of the other person). Bebo has always given Myspace a good fight within its restricted environment. And now Bebo has introduced an open application platform to its users to customize their page. You can also use different skins to make your page look different. When you register at Bebo, you are not immediately asked to call your friends. On the contrary, they have given you a field to send invitation to your friends. You can see the updated status of your friends along with your own profile change log. To add to this, you can get updates, text upload, data browsing, etc. on your mobile phone – more knocks to stay connected or come back to Bebo. And we must say that Bebo combines almost all features offered by other social networking websites. The best thing about Orkut is its clean and simple page layout. You may say that, as two users are different, so should be the page layout. But somehow we did not agree to it. A human being needs not look like an elephant to be distinguished from another individual. A profile page is different from another profile page for the content or information provided by the individual. At the same time, the uniformity of page layout saves time in search for page elements. When Orkut was first launched, if you remember, for whatever reason, membership was by invitation only. That not only created a close bond among individual pages, but also made the service popular. You needed to wait for an invitation from your friend or ask him or her to send one. You can say, when other websites are asking you to invite your friends, they are doing the same thing. However, as we see, those two things are somewhat different. Things have changed so far – now you can join Orkut without an invitation or a Google account. Bebo and Orkut share certain similarities as far as features are concerned and the way they are introduced; for example, “invite your friends.” We are not looking for who followed whom, but things seem similar. To add to all these, Orkut is powered by Google – well known for its simplicity. Conclusion: Answer one question – how many copies of the same friends do you want? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bees Attract Bees - Social Networking Over the Net"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bees Attract Bees - Social Networking Over the Net"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kamanashish Roy\n          \n            Kamanashish Roy\n          \n            Kamanashish Roy"
}