{
  "url": "https://moz.com/blog/beginners-guide-to-link-building",
  "slug": "beginners-guide-to-link-building",
  "title": "Announcing the All-New Beginner's Guide to Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're excited to announce the third beginner's guide from Moz: The Beginner's Guide to Link Building!",
  "content": "Announcing the All-New Beginner's Guide to Link Building Content Marketing | Moz News | Link Building By: Trevor Klein August 20, 2014 Table of Contents Copied! By: Trevor Klein August 20, 2014 Announcing the All-New Beginner's Guide to Link Building Content Marketing | Moz News | Link Building It is my great pleasure to announce the release of Moz's third guide for marketers, written by the inimitable Paddy Moogan of Distilled: We could tell you all about how high-quality, authoritative links pointing to your site benefit your standing in the SERPs, but instead we'll just copy the words straight from the proverbial horse's mouth: \"Backlinks, even though there’s some noise and certainly a lot of spam, for the most part are still a really, really big win in terms of quality for search results.\" — Matt Cutts, head of the webspam team at Google, 2/19/14 Link building is one area of SEO that has changed significantly over the last several years; some tactics that were once effective are now easily identifiable and penalized by Google. At the same time, earning links remains vital to success in search marketing: Link authority features showed the strongest correlation with higher rankings in our 2013 ranking factors survey. For that reason, it has never been more important for marketers to truly earn their links, and this guide will have you building effective campaigns in no time. Read the Beginner's Guide to Link Building What you'll learn 1. What is Link Building, and Why Is It Important? This is where it all begins. If you're brand new to link building and aren't sure whether or not it's a good tactic to include in your marketing repertoire, give this chapter a look. Even the more seasoned link earners among us could use a refresher from time to time, and here we cover everything from what links mean to search engines to the various ways they can help your business's bottom line. 2. Types of Links (Both Good and Bad) Before you dive into building links of your own, it's important to understand the three main types of links and why you should really only be thinking about two of them. That's what this short and sweet chapter is all about. 3. How to Start a Link Building Campaign Okay, enough with the theory; it's time for the nitty-gritty. This chapter takes a deep dive into every step of a link building campaign, offering examples and templates you can use to build your own foundation. 4. Link Building Tactics Whether through ego bait or guest blogging (yes, that's still a viable tactic!), there are several approaches you can take to building a strong link profile. This chapter takes a detailed run through the tactics you're most likely to employ. 5. Link Building Metrics Now that the links are rolling in, how do you prove to ourselves and our clients that our work is paying off? The metrics outlined in this chapter, along with the tools recommended to measure them, offer a number of options for your reports. 6. The Good, the Bad, and the Ugly of Link Building If we're preaching to the choir with this chapter, then we're thrilled, because spammy links can lead to severe penalties. Google has gotten incredibly good at picking out and penalizing spammy link building techniques, and if this chapter isn't enough to make you put your white hat on, nothing is. 7. Advanced Link Building Tips and Tricks Mastered the rest of what the guide has to offer? Earning links faster than John Paulson earns cash? Here are a few tips to take your link building to the next level. Caution: You may or may not find yourself throwing fireballs after mastering these techniques. Enough talk, let's get to the guide! The PDFWhen we released the Beginner's Guide to Social Media, there was an instant demand for a downloadable PDF version. This time, it's ready from the get-go (big thanks to David O'Hara!).Click here to download the PDF.Thanks We simply can't thank Paddy Moogan enough for writing this guide. His expertise and wisdom made the project possible. Thanks as well to Ashley Tate for wrangling the early stages of the project, Cyrus Shepard for his expert review and a few key additions, Derric Wise and David O'Hara for bringing it to life with their art, and Andrew Palmer for seamlessly translating everything onto the web. Now, go forth and earn those links! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing the All-New Beginner's Guide to Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing the All-New Beginner's Guide to Link Building"
    },
    {
      "level": "H2",
      "text": "What you'll learn"
    },
    {
      "level": "H3",
      "text": "1. What is Link Building, and Why Is It Important?"
    },
    {
      "level": "H3",
      "text": "2. Types of Links (Both Good and Bad)"
    },
    {
      "level": "H3",
      "text": "3. How to Start a Link Building Campaign"
    },
    {
      "level": "H3",
      "text": "4. Link Building Tactics"
    },
    {
      "level": "H3",
      "text": "5. Link Building Metrics"
    },
    {
      "level": "H3",
      "text": "6. The Good, the Bad, and the Ugly of Link Building"
    },
    {
      "level": "H3",
      "text": "7. Advanced Link Building Tips and Tricks"
    },
    {
      "level": "H2",
      "text": "The PDF"
    },
    {
      "level": "H2",
      "text": "Thanks"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}