{
  "url": "https://moz.com/blog/behind-the-scenes-at-mozcon-virtual",
  "slug": "behind-the-scenes-at-mozcon-virtual",
  "title": "Behind the Scenes at MozCon Virtual - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "MozCon 2020 is going virtual, and we're pulling out all the stops, including setting our speakers up with remote recording studios. Here's a behind the scenes look at the equipment and set-up.",
  "content": "Behind the Scenes at MozCon Virtual Moz News | SEO Events By: Dr. Peter J. Meyers July 2, 2020 Table of Contents Copied! By: Dr. Peter J. Meyers July 2, 2020 Behind the Scenes at MozCon Virtual Moz News | SEO Events Re-imagining MozCon hasn't been easy. I won't lie — I'll miss seeing so many of you in person, and, yes, I'll miss the magic of the big stage. We're working hard to make this year special, including leveling up our speakers for their remote sessions. I recently shared my own set-up on Twitter: This stirred up quite a bit of interest in our set-up and equipment list, so thanks to Cheryl on our events team for filling in the blanks for me, and thanks to our amazing A/V partners at Seamless Events for helping this all come together. Also, many thanks to our speakers who gave me permission to share their photos and let you in on some of the magic behind in front of the curtain. MozCon Virtual equipment list Before we get to the fun part (or maybe this is the fun part for you), here's the standard equipment list our A/V team used for MozCon Virtual (some speaker set-ups may vary): Logitech C920 HD Pro Webcam (more info)Neewer Backdrop Support System (more info)Neewer Gray Photography Backdrop (more info)UBeesize 8-inch Selfie Ring Light w/ Tripod Stand (more info)Z ZAFFIRO USB Lavalier Lapel Clip Microphone (more info)Vilcome 4-in-1 USB C Hub Adapter (more info) Note that some of the models/sizes linked to in [more info] may not be exact matches to our kit. While Moz doesn't endorse any of these specific products, I've personally been pleasantly surprised at how affordable and accessible decent A/V equipment has become, and quarantine is making the value proposition even stronger. The presenter remote on my desk is not part of the kit, but is my own Logitech R400 (more info). I've had this one for almost six years, and wish I'd bought my own remote sooner. I use it even when I'm presenting at my desk or practicing on a plane (that may say more about me than about Logitech, admittedly). The LEGOs and half-finished LaCroix were not included in the speaker kit, although LEGOs factor heavily into my MozCon presentation. Sneak-peeks with our speakers Just for fun, here's a sneak-peek at a few of our speakers and their set-ups. Dana DiTomaso (@danaditomaso) I was going to make all of the photos 16:9 like the one above, but Dana ruined that by having this amazing skylight in her loft, so all of the speakers are getting big photos now. Dana's MozCon Virtual session:\"Red Flags: Use a discovery process to go from red flags to green lights\" Izzi Smith (@izzionfire) If I hadn't resorted to full-sized photos for Dana, I would've done it for Izzi's wall art. Izzi's MozCon Virtual Session:\"How to Be Ahead of the (CTR) Curve\" Shannon McGuirk (@ShannonMcGuirk_) Shannon braved a trek to the office just for MozCon and wins the award for looking more professional than the rest of us. I cleaned my home office. That counts for something, right? Shannon's MozCon Virtual Session:\"Great Expectations: The Truth About Digital PR Campaigns\" Ross Simmonds (@TheCoolestCool) Ross has clearly got chair game. My $79 knock-off Aeron from Costco is looking pretty sad... Ross's MozCon Virtual Session:\"Designing a Content Engine: Going from Ideation to Creation to Distribution\" Robin Lord (@robinlord8) Robin went for the rare standing set-up. Robin has also delegated his copy of \"Pandemic\" to being a monitor stand, as it's far too depressing to play right now. Robin's MozCon Virtual Session:\"Whatever You Do, Put Billboards in Seattle – Getting Brand Awareness Data from Google\" Rob Ousbey (@RobOusbey) I'm not sure if Rob is expertly offsetting his window light with two ring lights or if we just forgot to send him the instruction sheet. He's my boss, so I'll assume the former. Rob's MozCon Virtual Session:\"A Novel Approach to Scraping Websites\" Sarah Bird (@SarahBird) Last, but certainly not least, our own CEO, Sarah Bird, who apparently gets to have a hammock outside her office, because she's the boss. Sarah's MozCon Virtual Session:\"Welcome to MozCon Virtual 2020 + the State of the Industry\" The idea for this post was a little last-minute, and I didn't want to personally annoy every speaker with photo requests, so a big thanks to all of our speakers for going the extra mile to make the shift to a virtual event with us and set up all of this equipment. Special thanks to Cheryl and Carly for all of their work pulling this plan together. What's your home set-up? Have you leveled up your A/V set-up and you're just itching to show it off? Let us know about your favorite equipment in the comments, or send us your home-office photos on Twitter (@Moz). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Behind the Scenes at MozCon Virtual"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Behind the Scenes at MozCon Virtual"
    },
    {
      "level": "H2",
      "text": "MozCon Virtual equipment list"
    },
    {
      "level": "H2",
      "text": "Sneak-peeks with our speakers"
    },
    {
      "level": "H3",
      "text": "Dana DiTomaso (@danaditomaso)"
    },
    {
      "level": "H3",
      "text": "Izzi Smith (@izzionfire)"
    },
    {
      "level": "H3",
      "text": "Shannon McGuirk (@ShannonMcGuirk_)"
    },
    {
      "level": "H3",
      "text": "Ross Simmonds (@TheCoolestCool)"
    },
    {
      "level": "H3",
      "text": "Robin Lord (@robinlord8)"
    },
    {
      "level": "H3",
      "text": "Rob Ousbey (@RobOusbey)"
    },
    {
      "level": "H3",
      "text": "Sarah Bird (@SarahBird)"
    },
    {
      "level": "H2",
      "text": "What's your home set-up?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}