{
  "url": "https://moz.com/blog/best-practices-for-setting-up-a-twitter-account-by-the-numbers",
  "slug": "best-practices-for-setting-up-a-twitter-account-by-the-numbers",
  "title": "Best Practices for Setting up a Twitter Account by the Numbers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Get more tips like this and learn about the full range of social media marketing platforms, tool, techniques and strategies from Dan Zarrella's book \"The Social Media Marketing Book,\" published by O'Reilly.  I love data. Rather than just doing what \"feels right\" or seems \"...",
  "content": "Best Practices for Setting up a Twitter Account by the Numbers Social Media D By: danzarrella November 22, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: danzarrella November 22, 2009 Best Practices for Setting up a Twitter Account by the Numbers Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Get more tips like this and learn about the full range of social media marketing platforms, tool, techniques and strategies from Dan Zarrella's book \"The Social Media Marketing Book,\" published by O'Reilly. I love data. Rather than just doing what \"feels right\" or seems \"truthy\" I like to dig into the numbers around an issue to find facts. Working at HubSpot has allowed me to get into some great data, including the millions of Twitter accounts that have been analyzed by Twitter Grader. Here's a few account creation best practices that have come from that data. Username The first step in creating a Twitter account is picking your username. Many of the same rules that work for picking domain names should apply, it should be unique, memorable and spelled correctly. You should also aim to have it as short as possible to reduce the number of characters it uses up when people are replying to or retweeting you. I've also done some research that shows accounts with numbers and underscores tend to have fewer followers than those without. Bio My research has found that the majority of accounts on Twitter don't contain any bio information. This field is 160 characters and requires very little investment of time and energy, but accounts that have bios tend to have far more followers than accounts that do not. I've also looked at what words in bios are related to more or less followers and found that authoritative words like \"official,\" \"speaker,\" and \"expert\" are associated with more followers. Where as accounts with cutsey things like emoticons tend to have fewer followers. Link Most accounts also don't have a link in the profile. And while copy-and-pasting a URL only takes a few seconds, accounts that include one have far more followers than those that do not. Following to get Followers A well known tactic to getting followers is to follow lots of people. When you follow someone, they're sent an email and many will follow you back. But when I looked at the ratio of following-to-followers I found that very low ratio accounts (those with many more people following them than they are following) tend to have more followers than accounts with very high ratios. So while the following to get followers tactic works, you should do it in a step-by-step fashion and try to keep your ratio as close to one as possible. And here's a little trailer for my book if you want some more information: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Best Practices for Setting up a Twitter Account by the Numbers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Best Practices for Setting up a Twitter Account by the Numbers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "danzarrella\n          \n            danzarrella"
}