{
  "url": "https://moz.com/blog/best-practices-for-targeting-generic-specific-terms-phrases",
  "slug": "best-practices-for-targeting-generic-specific-terms-phrases",
  "title": "Best Practices for Targeting Generic & Specific Terms & Phrases - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My post yesterday caused a bit of confusion about internal linking practices and I figured it would be wise to clear it up with a handy visual representation.\n\nIn the example above, we have a website that wants to build search-targeted pages for 4 unique keyword t...",
  "content": "Best Practices for Targeting Generic & Specific Terms & Phrases Technical SEO By: Rand Fishkin September 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 27, 2007 Best Practices for Targeting Generic & Specific Terms & Phrases Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My post yesterday caused a bit of confusion about internal linking practices and I figured it would be wise to clear it up with a handy visual representation. In the example above, we have a website that wants to build search-targeted pages for 4 unique keyword terms: Wind Wind Power Wind Energy Wind Turbines In order to effectively communicate to the engines (and to users) which page is targeting each particular keyword, I've used anchor text from the generic \"wind\" page to each of the more specific subpages and, likewise, linked back to the generic \"wind\" page from those subpages with the singular anchor text phrase \"wind.\" Why is this necessary? Shouldn't the engines be able to \"figure it out\" on their own, especially since those pages target the keywords by using them in the title tag, URL, headline, etc.? Well... Yes. They probably SHOULD be able to sort it out. However, we've seen a lot of instances where that's not the case, and it has detrimental results. The problem generally isn't that you can't rank the page at all - it's that the wrong pages rank for the wrong search terms, leaving users less than fully satisfied. Just imagine - you've searched for \"wind power,\" but instead you get a general page about wind. You might be willing to read the piece and see if there's specific information about your intended query, but you might just as likely go back to the results and choose another sites. Even worse, sometimes the listing in the SERPs will dissuade the searcher from ever choosing your page, even if you rank very highly. The solution above tends to work particularly well in our experience. It's also a great way to get the \"broken-out\" results for both the general and specific queries. For an example of a site doing a great job with this strategy, you need look no further than the ever dominant Wikipedia: Google search results for \"Wind\" I'm never a fan of creating two pages with exactly the same keyword as the targeted term/phrase. Even if you can earn the coveted first two spots, my opinion is that you'll do far better by having the broken out result something more specific - you may even catch the searcher's intent before they re-try their search (or interest them in something they didn't realize they wanted). Does anyone use this strategy? Are there others that you like better when targeting generic and more specific variations of a keyword? BTW - If you read just one great post on SEO this week, make it Vanessa's 301 Sword of Link Power - any SEO post with a Highlander reference has got to be worth a read. And yes, I know it's faulty logic to put that at the end of a post about SEO, but I'm feeling whimsical this evening. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Best Practices for Targeting Generic & Specific Terms & Phrases"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Best Practices for Targeting Generic & Specific Terms & Phrases"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}