{
  "url": "https://moz.com/blog/best-thing-about-search-conferences",
  "slug": "best-thing-about-search-conferences",
  "title": "Best Thing About Search Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Every search conference is usually filled with sessions, keynotes, site reviews, clinics, etc. If you're not at the conference you can usually follow the blogs and Twitter to get your daily dose of conference fare. These help keep you up-to-date on the sessions and general goings on.",
  "content": "Best Thing About Search Conferences SEO Events By: Jennifer Sable Lopez August 13, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez August 13, 2009 Best Thing About Search Conferences SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Every search conference is filled with sessions, keynotes, site reviews, clinics, and the like. If you're not at the conference you can follow the blogs and Twitter to get your daily dose of conference fare. These help keep you up-to-date on the sessions and general goings on. The unfortunate part of not being here is that you miss out on the social aspect of the conferences. For me one of the biggest draws of these conferences is the chance to network and get to know people within the industry. (Plus, no one knows who I am so I can roam around fairly incognito without having to shave my head to do so.) Last night at SearchBash (from WebmasterRadio.fm - great party by the way!) I had several Pro members approach me to tell me how much they enjoy our tools and feedback. How much does that rock?! Yep. A lot. But when it comes down to it, what is REALLY the most important part of coming to a conference? Is it the sessions or the excellent networking? Although both are extremely valuable, the one part of the events that seems to get overlooked is one of the most important (or at least the most fun) aspects of the conference. The Free stuff people! FREE stuff! If a company does it right, then they have hundreds (thousands?) of people walking around with their T-Shirt on, or sanitizing their hands with their branded sanitizer (heh, yep). So let's take a walk through the SES San Jose Expo Hall to see who stands out... I'm with Stupid T-Shirts from StupidSem.com Do you like how I made sure to not stand with the finger pointing my way? Stupidsem.com is the clear winner in the awesome T-Shirt department. Today I'm walking around with 4 T-Shirts and I don't even wear T-Shirts! So I'll probably give them away to other people, who will prominently wear these shirts around town as a walking ad campaign for the company. Smart move, people. Great giveaways from Website Magazine and Orange Soda These were my two favorite giveaways. Most people might think that the iPhone was the true winner here, but really check out that bike! It's saweeeet, with the big bucket seat and well it's orange. Who doesn't want to ride around on a big orange bike that they had to pay $100 to ship back to their home town? :) Website Magazine was giving away the iPhone and Orange Soda had the great bike. Fun Stickers from PixelSilk Pixelsilk had various stickers with different names and roles on them. I noticed people stuck these all over the place. I saw them on backpacks, on people's clothes, on their head, their pants, on computers and anything else you can think of. This is such a fun way to get your name out there and have people take a double look at your site. The Rest! This is just a collection of the free giveaways I grabbed over the past couple days. I guarantee that many of my friends who are addicted to Facebook would LOVE to have a FB thumbdrive of their own. These freebies are excellent ways to get your brand out there and if you find the right product or niche you may just go viral. Heck one company was giving away free screwdrivers before noon, and I'm not talking about the kind you use to fix the hinge on your door. The ladies with the \"I'm with Stupid\" T-Shirts seemed as if everyone wanted their picture taken with them. It was obvious that they had hit the mark, the question really is whether it pays off in the end. It's interesting here at SES San Jose, many people come to this conference every year and have the T-Shirts to show for it. Many people show their badges of honor by wearing past conference T-Shirts and talking about their favorite Yahoo! pen or that tiny mouse that PixelSilk gave away last year. Why do these products mean so much to us? Is it that it gives people bragging rights, or is it just plain old fun? What is your favorite freebie from a conference? And do you keep it in a conference box in the basement like one attendee confessed? (By the way my husband is an amazing photographer and is going to KILL me for these horrible photos.) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Best Thing About Search Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Best Thing About Search Conferences"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}