{
  "url": "https://moz.com/blog/best-seo-blogs-top-10-sources-to-stay-uptodate",
  "slug": "best-seo-blogs-top-10-sources-to-stay-uptodate",
  "title": "Best SEO Blogs: Top 10 Sources to Stay Up-to-Date - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Like many overly-connected web junkies, I find myself increasingly overwhelmed by information, resources and news. Sorting the signal from the noise is essential to staying sane, but missing an important development can be costly. To balance this conflict, I've recently re-arranged my daily reading…",
  "content": "Best SEO Blogs: Top 10 Sources to Stay Up-to-Date Public Relations By: Rand Fishkin August 7, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 7, 2010 Best SEO Blogs: Top 10 Sources to Stay Up-to-Date Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Like many overly-connected web junkies, I find myself increasingly overwhelmed by information, resources and news. Sorting the signal from the noise is essential to staying sane, but missing an important development can be costly. To balance this conflict, I've recently re-arranged my daily reading habits (which I've written about several times before) and my Firefox sidebar (a critical feature that keeps me from switching to Chrome). I'll start by sharing my top 10 sources in the field of search & SEO, then give you a full link list for those interested in seeing all the resources I use. I've whittled the list down to just ten to help maximize value while minimizing time expended (in my less busy days, I'd read 4-5 dozen blogs daily and even more than that each week). Top 10 Search / SEO Blogs #1 - Search Engine Land Why I Read It: For several years now, SELand has been the fastest, most accurate and well-written news source in the world of search. The news pieces in particular provide deep, useful, interesting coverage of their subjects, and though some of the columns on tactics/strategies are not as high quality, a few are still worth a read. Overall, SELand is the best place to keep up with the overall search/technology industry, and that's important to anyone operating a business in the field. Focus: Search industry and search engine news Update Frequency: Multiple times daily #2 - SEOmoz Why I Read It: Obviously, it's hard not to be biased, but removing the personal interest, the SEOmoz Blog is still my favorite source for tactical & strategic advice, as well as \"how-to\" content. I'm personally responsible for 1 out of every 4-6 articles, but the other 75%+ almost always give me insight into something new. The comments are also, IMO, often as good or better than the posts - the moz community attracts a lot of talented, open, sharing professionals and that keeps me reading daily. Focus: SEO & web marketing tactics & strategies Update Frequency: 1-2 posts per weekday #3 - SEOBook Why I Read It: The SEOBook blog occassionally offers some highly useful advice or new tactics, but recently, most of the commentary focuses on the shifting trends in the SEO industry, along with a healthy dose of engine and establishment-critical editorials. These are often quite instructive on their own, and I think more than a few have had substantive impact on changing the direction of players big and small. Focus: Inudstry trends as they relate to SEO; Editorials on abuse & manipulation Update Frequency: 1-3X per week #4 - Search Engine Roundtable Why I Read It: Barry Schwartz has long maintained this bastion of recaps, roundups and highlights from search-related discussions and forums across the web. The topics are varied, but usually useful and interesting enough to warrant at least a daily browse or two. Focus: Roundup of forum topics, industry news, SEO discussions Update Frequency: 3-4X Daily #5 - Search Engine Journal Why I Read It: The Journal strikes a nice balance between tactical/strategic articles and industry coverage, and anything SELand misses is often here quite quickly. They also do some nice roundups of tools and resources, which I find useful from an analysis & competitive research perspective. Focus: Indsutry News, Tactics, Tools & Resources Update Frequency: 2-3X Daily #6 - Conversation Marketing Why I Read It: I think Ian Lurie might be the fastest rising on my list. His blog has gone from ocassionally interesting to nearly indispensable over the last 18 months, as the quality of content, focus on smart web/SEO strategies and witty humor shine through. As far as advice/strategy blogs go in the web marketing field, his is one of my favorites for consistently great quality. Focus: Strategic advice, how-to articles and the occassional humorous rant Update Frequency: 2-4X weekly #7 - SEO By the Sea Why I Read It: Bill Slawski takes a unique approach to the SEO field, covering patent applications, IR papers, algorithmic search technology and other technically interesting and often useful topics. There's probably no better analysis source out there for this niche, and Bill's work will often inspire posts here on SEOmoz (e.g. 17 Ways Search Engines Judge the Value of a Link). Focus: IR papers, patents and search technology Update Frequency: 1-3X per week #8 - Blogstorm Why I Read It: Although Blogstorm doesn't update as frequently as some of the others, neraly every post is excellent. In the last 6 months, I've been seriously impressed by the uniqueness of the material covered and the insight shown by the writers (mostly Patrick Altoft with occassional other contributors). One of my favorites, for example, was their update to some of the AOL CTR data, which I didn't see well covered elsewhere. Focus: SEO insider analysis, strategies and research coverage Update Frequency: 3-5X monthly #9 - Dave Naylor Why I Read It: Dave's depth of knowledge is legendary and unlike many successful business owners in the field, he's personally kept himself deeply aware of and involved in SEO campaigns. This acute attention to the goings-on of the search rankings have made his articles priceless (even if the grammar/spelling isn't always stellar). The staff, who write 50%+ of the content these days, are also impressively knowledgable and maintain a good level of discourse and disclosure. Focus: Organic search rankings analysis and macro-industry trends Update Frequency: 1-3X weekly #10 - Marketing Pilgrim Why I Read It: A good mix of writers cover the search industry news and some tactical/strategic subjects as well. The writing style is compelling and it's great to get an alternative perspective. I've also noticed that MP will sometimes find a news item that other sites miss and I really appreciate the feeling of comprehensiveness that comes from following them + SELand & SERoundtable. Focus: Industry news, tactical advice and a bit of reputation/social management Update Frequency: 2-3X daily Other sites that I'll read regularly (who only barely missed my top 10) include Distilled, YOUmoz, Performable, Chris Brogan, the Webmaster Central Blog, Eric Enge, Avinash Kaushik, SEWatch, Gil Reich & the eMarketer blog. I also highly recommend skimming through SEO Alltop, as it lets me quickly review anything from the longer tail of SEO sites. The rest of my Firefox sidebar is listed below, sorted into sections according to the folders I use. Note that because I've got the SEOmoz toolbar (mozBar), I use that to access all the moz SEO tools rather than replicating them in my sidebar. I've also been able to ditch my large collection of bookmarklets thanks to the mozBar, but if you prefer to keep them, here's a great set of 30 SEO Bookmarklets (all draggable). Rand's Firefox Sidebar Social Buzz Hacker News Techmeme Reddit Delicious Popular StumbleUpon: Top Rated Twittersphere PopURLs Sphinn Tech / Entrepreneur Blogs A VC Seth Godin Read Write Start Mashable Chris Dixon Mark Suster Sean Ellis On Startups A Smart Bear Andrew Chen Seattle Tech Startups List Steve Blank Search / Marketing Blogs SELand SEOmoz Blog SEOBook SERoundtable SEO Alltop SEJournal Conversation Marketing SEO By the Sea Blogstorm Dave Naylor Marketing Pilgrim Distilled YOUmoz Performable Chris Brogan GG WM Central Eric Enge Avinash Kaushik Gil Reich eMarketer SEO & Web Tools DomainTools W3C Link Checker DaveN KW Tool GG AdWords Tool GG Insights MS AdCenter Tools GG Trends for Websites Down for Everyone or Just Me? Social World Twitter LinkedIn Facebook Quora News NYTimes | Most Emailed Slate Magazine BBC News The Stranger (Local Seattle Blog/News) Electoral-Vote National Geographic News Free Time Everywhereist (the best part of my day) The Sixty One Drawar MetaCritic Web Boggle Rotten Tomatoes Hulu Hopefully some kind individual in the comments will build a nice HTML file for those of you who'd like to directly import this list. :-) UPDATE: TopRank just published a list of the most subscribed-to blogs in the SEO field that can also be a great resource for those interested. p.s. We've only got 60 out of 310 seats left for the Seattle Training Seminar (August 30-31) and just opened up a few more spots for the Tools Training (Sept. 1). Hope to see you there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Best SEO Blogs: Top 10 Sources to Stay Up-to-Date"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Best SEO Blogs: Top 10 Sources to Stay Up-to-Date"
    },
    {
      "level": "H2",
      "text": "Top 10 Search / SEO Blogs"
    },
    {
      "level": "H3",
      "text": "#1 - Search Engine Land"
    },
    {
      "level": "H3",
      "text": "#2 - SEOmoz"
    },
    {
      "level": "H3",
      "text": "#3 - SEOBook"
    },
    {
      "level": "H3",
      "text": "#4 - Search Engine Roundtable"
    },
    {
      "level": "H3",
      "text": "#5 - Search Engine Journal"
    },
    {
      "level": "H3",
      "text": "#6 - Conversation Marketing"
    },
    {
      "level": "H3",
      "text": "#7 - SEO By the Sea"
    },
    {
      "level": "H3",
      "text": "#8 - Blogstorm"
    },
    {
      "level": "H3",
      "text": "#9 - Dave Naylor"
    },
    {
      "level": "H3",
      "text": "#10 - Marketing Pilgrim"
    },
    {
      "level": "H2",
      "text": "Rand's Firefox Sidebar"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}