{
  "url": "https://moz.com/blog/better-customer-experiences",
  "slug": "better-customer-experiences",
  "title": "Building Better Customer Experiences - Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your customer's experience after becoming a lead is important for their loyalty and retention. In this classic Whiteboard Friday, Dana DiTomaso shares 3 big things you can start doing today that will immensely improve your customer experience.",
  "content": "Building Better Customer Experiences - Best of Whiteboard Friday Community Management | Whiteboard Friday By: Dana DiTomaso May 1, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso May 1, 2020 Building Better Customer Experiences - Best of Whiteboard Friday Community Management | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Are you mindful of your customer's experience after they become a lead? It's easy to fall in the same old rut of newsletters, invoices, and sales emails, but for a truly exceptional customer experience that improves their retention and love for your brand, you need to go above and beyond. In this popular episode of Whiteboard Friday, the ever-insightful Dana DiTomaso shares three big things you can start doing today that will immensely better your customer experience and make earning those leads worthwhile. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hi, Moz fans. My name is Dana DiTomaso. I'm the President and partner of Kick Point, and today I'm going to talk to you about building better customer experiences. I know that in marketing a lot of our jobs revolve around getting leads and more leads and why can't we have all of the leads. The typical customer experience: But in reality, the other half of our job should be making sure that those leads are taken care of when they become customers. This is especially important if you don't have, say, a customer care department. If you do have a customer care department, really you should be interlocking with what they do, because typically what happens, when you're working with a customer, is that after the sale, they usually get surveys. - Surveys \"How did we do? Please rate us on a scale of 1 to 10,\" which is an enormous scale and kind of useless. You're a 4, or you're an 8, or you're a 6. Like what actually differentiates that, and how are people choosing that? - Invoices Then invoices, like obviously important because you have to bill people, particularly if you have a big, expensive product or you're a SaaS business. But those invoices are sometimes kind of impersonal, weird, and maybe not great. - Newsletters Maybe you have a newsletter. That's awesome. But is the newsletter focused on sales? One of the things that we see a lot is, for example, if somebody clicks a link in the newsletter to get to your website, maybe you've written a blog post, and then they see a great big popup to sign up for our product. Well, you're already a customer, so you shouldn't be seeing that popup anymore. What we've seen on other sites, like Help Scout actually does a great job of this, is that they have a parameter of newsletter at the end of any URLs they put in their newsletter, and then the popups are suppressed because you're already in the newsletter so you shouldn't see a popup encouraging you to sign up or join the newsletter, which is kind of a crappy experience. - Sales emails Then the last thing are sales emails. This is my personal favorite, and this can really be avoided if you go into account-based marketing automation instead of personal-based marketing automation. We had a situation where I was a customer of the hosting company. It was in my name that we've signed up for all of our clients, and then one of our developers created a new account because she needed to access something. Then immediately the sales emails started, not realizing we're at the same domain. We're already a customer. They probably shouldn't have been doing the hard sale on her. We've had this happen again and again. So just really make sure that you're not sending your customers or people who work at the same company as your customers sales emails. That's a really cruddy customer experience. It makes it look like you don't know what's going on. It really can destroy trust. Tips for an improved customer experience So instead, here are some extra things that you can do. I mean fix some of these things if maybe they're not working well. But here are some other things you can do to really make sure your customers know that you love them and you would like them to keep paying you money forever. 1. Follow them on social media So the first thing is following them on social. So what I really like to do is use a tool such as FullContact. You can take everyone's email addresses, run them through FullContact, and it will come back to you and say, \"Here are the social accounts that this person has.\" Then you go on Twitter and you follow all of these people for example. Or if you don't want to follow them, you can make a list, a hidden list with all of their social accounts in there. Then you can see what they share. A tool like Nuzzel, N-U-Z-Z for Americans, zed zed for Canadians, N-U-Z-Z-E-L is a great tool where you can say, \"Tell me all the things that the people I follow on social or the things that this particular list of people on social what they share and what they're engaged in.\" Then you can see what your customers are really interested in, which can give you a good sense of what kinds things should we be talking about. A company that does this really well is InVision, which is the app that allows you to share prototypes with clients, particularly design prototypes. So they have a blog, and a lot of that blog content is incredibly useful. They're clearly paying attention to their customers and the kinds of things they're sharing based on how they build their blog content. So then find out if you can help and really think about how I can help these customers through the things that they share, through the questions that they're asking. Then make sure to watch unbranded mentions too. It's not particularly hard to monitor a specific list of people and see if they tweet things like, \"I really hate my (insert what you are)right now,\" for example. Then you can head that off at the pass maybe because you know that this was this customer. \"Oh, they just had a bad experience. Let's see what we can do to fix it,\"without being like, \"Hey, we were watching your every move on Twitter.Here's something we can do to fix it.\" Maybe not quite that creepy, but the idea is trying to follow these people and watch for those unbranded mentions so you can head off a potential angry customer or a customer who is about to leave off at the pass. Way cheaper to keep an existing customer than get a new one. 2. Post-sale monitoring So the next thing is post-sale monitoring. So what I would like you to do is create a fake customer. If you have lots of sales personas, create a fake customer that is each of those personas, and then that customer should get all the emails, invoices, everything else that a regular customer that fits that persona group should get. Then take a look at those accounts. Are you awesome, or are you super annoying? Do you hear nothing for a year, except for invoices, and then, \"Hey, do you want to renew?\" How is that conversation going between you and that customer? So really try to pay attention to that. It depends on your organization if you want to tell people that this is what's happening, but you really want to make sure that that customer isn't receiving preferential treatment. So you want to make sure that it's kind of not obvious to people that this is the fake customer so they're like, \"Oh, well, we're going to be extra nice to the fake customer.\" They should be getting exactly the same stuff that any of your other customers get. This is extremely useful for you. 3. Better content Then the third thing is better content. I think, in general, any organization should reward content differently than we do currently. Right now, we have a huge focus on new content, new content, new content all the time, when in reality, some of your best-performing posts might be old content and maybe you should go back and update them. So what we like to tell people about is the Microsoft model of rewarding. They've used this to reward their employees, and part of it isn't just new stuff. It's old stuff too. So the way that it works is 33% is what they personally have produced. So this would be new content, for example. Then 33% is what they've shared. So think about for example on Slack if somebody shares something really useful, that's great. They would be rewarded for that. But think about, for example, what you can share with your customers and how that can be rewarding, even if you didn't write it, or you can create a roundup, or you can put it in your newsletter. Like what can you do to bring value to those customers? Then the last 33% is what they shared that others produced. So is there a way that you can amplify other voices in your organization and make sure that that content is getting out there? Certainly in marketing, and especially if you're in a large organization, maybe you're really siloed, maybe you're an SEO and you don't even talk to the paid people, there's cool stuff happening across the entire organization. A lot of what you can bring is taking that stuff that others have produced, maybe you need to turn it into something that is easy to share on social media, or you need to turn it into a blog post or a video, like Whiteboard Friday, whatever is going to work for you, and think about how you can amplify that and get it out to your customers, because it isn't just marketing messages that customers should be seeing. They should be seeing all kinds of messages across your organization, because when a customer gives you money, it isn't just because your marketing message was great. It's because they believe in the thing that you are giving them. So by reinforcing that belief through the types of content that you create, that you share, that you find that other people share, that you shared out to your customers, a lot of sharing, you can certainly improve that relationship with your customers and really turn just your average, run-of-the-mill customer into an actual raving fan, because not only will they stay longer, it's so much cheaper to keep an existing customer than get a new one, but they'll refer people to you, which is also a lot easier than buying a lot of ads or spending a ton of money and effort on SEO. Thanks! Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Building Better Customer Experiences - Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Building Better Customer Experiences - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The typical customer experience:"
    },
    {
      "level": "H3",
      "text": "- Surveys"
    },
    {
      "level": "H3",
      "text": "- Invoices"
    },
    {
      "level": "H3",
      "text": "- Newsletters"
    },
    {
      "level": "H3",
      "text": "- Sales emails"
    },
    {
      "level": "H2",
      "text": "Tips for an improved customer experience"
    },
    {
      "level": "H3",
      "text": "1. Follow them on social media"
    },
    {
      "level": "H3",
      "text": "2. Post-sale monitoring"
    },
    {
      "level": "H3",
      "text": "3. Better content"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Leave the Best Possible Negative Review for a Local Business"
    },
    {
      "level": "H3",
      "text": "Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship"
    },
    {
      "level": "H3",
      "text": "How (and Whether) to Invest in and Structure Online Communities"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}