{
  "url": "https://moz.com/blog/better-alternatives-expert-roundup-style-content-whiteboard-friday",
  "slug": "better-alternatives-expert-roundup-style-content-whiteboard-friday",
  "title": "Better Alternatives to \"Expert Roundup\"-Style Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Thinking of publishing an expert roundup? Don't—there's a better way. In this Whiteboard Friday, Rand explains why expert roundups aren't the best use of your time and effort, and how to pivot your strategy to create similar content that'll make the juice worth the squeeze.",
  "content": "Better Alternatives to \"Expert Roundup\"-Style Content Content Marketing | Whiteboard Friday By: Rand Fishkin March 10, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 10, 2017 Better Alternatives to \"Expert Roundup\"-Style Content Content Marketing | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You may be tempted to publish that newest round of answers you've gotten from industry experts, but hold off — there's a better way. In today's Whiteboard Friday, Rand explains why expert roundups just aren't the best use of your time and effort, and how to pivot your strategy to create similar content that'll make the juice worth the squeeze. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to look at some better alternatives to the expert roundup-style content that's become extremely popular on the web. There are a few reasons why it's popular. So let's talk about why SEOs and content marketers do so many expert roundups, why this became a popular content format. Why do SEOs and content marketers even use \"expert roundups?\" Okay. It turns out if you've got a piece of content that's like \"75 Experts Share Their Favorite Constitutional Law Cases,\" maybe you interviewed a bunch of constitutional laws scholars and you put together this article, there's a bunch of nice things that you actually do get from this, which is why people use this format, right?You kind of get automatic outreach, because if you talk to these people, you've had a connection with them. You've built a little bit of a relationship. There's now something of an incentive to share for these folks and the potential for a link. All of those are sort of elements that people are looking for, well, that marketers are looking for from their content.The nice thing is you've got this long cadre of individuals who have contributed, and they create the content, which means you don't have to, saving you a bunch of time and energy. They become your amplifier so you can kind of sit back and relax when it comes time to broadcast it out there. You just tell them it's ready, and they go and push it. They lend your content credibility. So even if you don't have any credibility with your brand or with your website, they deliver it for you. You don't have to do that. There are a few big problems with this kind of content. Those are all really nice things. Don't get me wrong. I understand why. But there are some big, big problems with expert roundup-style content. 1. Like many easy-to-replicate tactics, expert roundups become WAY overdone. First one, like many of the easy to replicate tactics, expert roundups have gottens spammy. They became way, way overdone. I get emails like this. \"Dear Fishkin, I roundup. You write. Do this. Then share. Okay. Bye, Spammy McSpams-A-Lot.\"Look, Mr. McSpams-A-Lot, I appreciate how often you think of me. I love that every day there are a couple of offers like this in my inbox. I try to contribute to less than one every two or three weeks and only the ones that look super credible and real interesting. But jeez, can you imagine if you are truly an expert, who can lend credibility and create lots of amplification, you're getting overwhelmed with these kinds of requests, and people are probably getting very tired of reading them, especially in certain market segments where they've become way too overdone. 2. It's hard for searchers to get valuable, useful info via this format — and search engines don't like it, either. But even if it's the case that you can get all these experts to contribute and it's not overdone in your market space, there are two other big problems. One, the content format is awful, awful for trying to get valuable and useful information. It rarely actually satisfies either searchers or engines. If you search for constitutional law cases and you see \"75 Experts Share Their Favorite Constitutional Law Cases,\" you might click. But my god, have you gone through those types of content? Have you tried to read a lot of those roundups? They are usually awful, just terrible.You might get a nugget here or there, but there's a bunch of contributions that are multiple paragraphs long and try to include links back to wherever the expert is trying to get their links going. There's a bunch of them that are short and meaningless. Many of them overlap. It's annoying. It's bad. It's not well-curated. It's not well-put together. There are exceptions. Sometimes people put real effort into them and they get good, but most of the time these are real bad things, and you rarely see them in the search results. BuzzSumo did a great analysis of content that gets shares and gets links and gets rankings. Guess what did not fall into it — expert roundups. 3. Roundups don't earn as many links, and the traffic spike from tweets is temporary. Number three. That's number three. The links that the creators want from these roundups, that they're hoping they're going to get, it doesn't end up there most of the time. What usually happens is you get a short traffic spike, some additional engagement, some additional activity on mostly Twitter, sometimes a little bit Facebook or LinkedIn, but it's almost all social activity, and it's a very brief spike. 5 formats to try instead So what are some better alternatives? What are some things we can do? Well, I've got five for you. 1. Surveys First off, if you're going to be creating content that is around a roundup, why not do almost exactly the same process, but rather than asking a single question or a set of questions that people are replying to, ask them to fill out a short survey with a few data points, because then you can create awesome graphs and visuals, which have much stronger link earning potential. It's the same outreach effort, but for much more compelling content that often does a better job of ranking, is often more newsworthy and link worthy. I really, really like surveys, and I think that they can work tremendously well if you can put them together right. 2. Aggregations of public data Second, let's say you go, \"Oh, Rand, that would be great, but I want to survey people about this thing, and they won't give me the information that I'm looking for.\" Never fear. You can aggregate public data. So a lot of these pieces of information that may be interesting to your audience, that you could use to create cool visuals, the graphs and charts and all that kind of thing and trend lines, are actually available on the web. All you need to do is cite those sources, pull in that data, build it yourself, and then you can outreach to the people who are behind these companies or these organizations or these individuals, and then say, \"Hey, I made this based on public data. Can you correct any errors?\" Now you've got the outreach, which can lead to the incentive to share and to build a link. Very cool. 3. Experiments and case studies So this is taking a much smaller group, saying, \"I'm only going to work with this one person or these couple of people, or I'm going to do it myself. Here's what Seattle's most influential law firm found when they challenged 10 state laws.\" Well, there you go. Now I've got an interesting, wholly formed case study. I only had to work with one expert, but chances are good that lots and lots of people will be interested in this. It's also excellent for newsworthiness. It often can get lots of press coverage in whatever industry you're in. 4. Seeking out controversial counter-opinions on a topic Fourth, if you're going to do a roundup-style thing and you're going to collect multiple opinions, if you can find a few points or a single subject around which multiple experts have different opinions, that could be just two people, it could be four or five, it could be seven or eight, but you're basically trying to create this controversy. You're saying like, \"Here are these people on this side of this issue. Here are these people on this side of this issue, Wil Reynolds versus Rand Fishkin on link building.\" I think we did a presentation like that in Minneapolis last year or a couple years ago. It was super fun. Wil and I got up on stage, and we sort of debated with each other. There were no losers in that debate. It was great. This leverages the emotional response you're seeking of conflict. It creates more engaging content by far, and there's more incentive for the parties who participate to link and share, because they're sort of showing off their opinion and trying to make counterpoints. You can get a lot of good things. 5. Not just text!Number five. If you've decided, \"You know what? None of these formats or any others work. I really, really want to do a roundup. I think it can work for me,\" okay. But do me a favor and try something that is not just text, not just text.Muzli is a newsletter I subscribe to in the design world that does lots of roundup-style content, but the roundups are all visuals. They're visuals. They're like UI interactions and GIFs and animations and illustrations. I actually really love those. Those get great engagement, and they rank, by the way. They rank quite well. Many of the ones that they link to in the newsletter do well. You can do this with visuals. You can do it with data. You could do it with revenue numbers. You could do it with tools. You could do it with products, whatever it is. I would suggest thinking a little more broadly than, \"Dear Fishkin, I roundup. You write.\" I think that there's a lot more opportunity outside of the pure expert roundup space, and I hope you'll share your creative ideas with us and the successes you've seen.We look forward to seeing you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Better Alternatives to \"Expert Roundup\"-Style Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Better Alternatives to \"Expert Roundup\"-Style Content"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Why do SEOs and content marketers even use \"expert roundups?\""
    },
    {
      "level": "H2",
      "text": "There are a few big problems with this kind of content."
    },
    {
      "level": "H3",
      "text": "1. Like many easy-to-replicate tactics, expert roundups become WAY overdone."
    },
    {
      "level": "H3",
      "text": "2. It's hard for searchers to get valuable, useful info via this format — and search engines don't like it, either."
    },
    {
      "level": "H3",
      "text": "3. Roundups don't earn as many links, and the traffic spike from tweets is temporary."
    },
    {
      "level": "H2",
      "text": "5 formats to try instead"
    },
    {
      "level": "H3",
      "text": "1. Surveys"
    },
    {
      "level": "H3",
      "text": "2. Aggregations of public data"
    },
    {
      "level": "H3",
      "text": "3. Experiments and case studies"
    },
    {
      "level": "H3",
      "text": "4. Seeking out controversial counter-opinions on a topic"
    },
    {
      "level": "H3",
      "text": "5. Not just text!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}