{
  "url": "https://moz.com/blog/beware-of-google-adwords-keyword-tracking-proven-to-be-misleading",
  "slug": "beware-of-google-adwords-keyword-tracking-proven-to-be-misleading",
  "title": "Beware of Google AdWords - Keyword Tracking Proven to be Misleading - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've always been a fan of Google Adwords.  I was excited when they updated the AdWords interface this year with a plethora of new features and vastly improved the user experience.  You can imagine my surprise and dismay when I found out that the tracking right in the Google AdWords account…",
  "content": "Beware of Google AdWords - Keyword Tracking Proven to be Misleading Paid Search Marketing (PPC) W By: William Elward November 10, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! W By: William Elward November 10, 2009 Beware of Google AdWords - Keyword Tracking Proven to be Misleading Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've always been a fan of Google Adwords. I was excited when they updated the AdWords interface this year with a plethora of new features and vastly improved the user experience. You can imagine my surprise and dismay when I found out that the tracking right in the Google AdWords account interface is completely misleading. Here is the problem: The Google interface says we received 1,000 clicks on the keyword phrase \"red widgets\". But upon closer analysis, we found that Google conveniently aggregates many, many keywords under that single keyword phrase when it reports out on clicks, impressions and cost. To see if this is happening to your paid search campaign, try this: Login into your account and view a ad group that contains several keywords. Click on the checkbox that appears before one of the more popular terms Then select \"see search terms...\" and choose \"selected\" from the drop down. The impact of this is tremendous to anyone trying to optimize campaigns. We thought \"red widgets\" was the term that was being clicked by the user -- but in reality there were dozens or more terms that actually accounted for most of those clicks. According to Google's note within the interface, \"Your ads appeared when people searched on the terms below. These search terms were matched to your ads based on the keywords in your ad groups.\" Their note goes on to state that \"use this reporting feature to see every user search query that triggered your ad. Whether your ad is triggered depends on the search term a web user submits when searching on a site within the Google Network and your keyword match settings. You can add search terms from the list to your ad group keyword list, or add the terms as negative keywords to ensure your ad stops triggering for the keyword.\" What is most alarming about this whole thing is that I was concurrently running other campaigns and ad groups that contained some of the same exact terms that Google decided to match to \"red widgets\". I can get over the fact that the Google reporting is screwy (well, not really), but to top it all off, I checked some of my other campaigns that contained these Google-matched terms. I found the max CPCs I had entered for those same terms in my other campaigns was well below the max CPC of \"red widgets\". The net was that I was paying twice as much for these keywords (since it was attributing the clicks to the term \"red widgets\"). I can understand if this was happening because the other campaigns had reached their daily max budget - but they hadn't. So what’s next? I assumed that I could turn off this feature via the \"Settings\" tab in the campaign interface. There is an advanced feature called \"automatic matching\" that I apparently had opted into. But even after making this change, I was still seeing more than a dozen terms when I expanded that one keyword phrase. I then figured that I could control this by changing the match type from \"broad\" to \"exact\". But even that didn't work. Finally I resorted to adding negative keywords to the ad group too. While that seemed to help, I'm still seeing additional terms tied to my keyword phrase. Google should make this expended matching into an opt-in feature. The fact that Google is doing this broad-matching is unacceptable in my eyes. Here’s the kicker - even the conversion tracking data that we are seeing in our Web Analytics tool is skewed by this. Here's what I mean: When a user searches Google.com for \"yellow widgets\", and they click on our ad, we expect that Google would pass into our web analytics that there was a search on \"yellow widgets\". Surprisingly, that's not the case if Google decided that “yellow widgets” is related to “red widgets”. So instead you'll see a click registered in Google and in your web analytics tool for \"red widgets.\" Even more annoying is that our custom conversion tracking is giving credit to “red widgets” for driving sales that should rightly be attributed to “yellow widgets”. My recommendation is two-fold: (1) Be hyper aware of how you configure your campaigns and ad groups; be sure to use broad matching carefully; disable automatic matching at the campaign level (2) Don’t believe everything you see in Google AdWords in terms of clicks, impressions and cost at the keyword level. Be sure to check at the keyword level to see if there are other terms that are being lumped under the umbrella of another term. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Beware of Google AdWords - Keyword Tracking Proven to be Misleading"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Beware of Google AdWords - Keyword Tracking Proven to be Misleading"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "William Elward\n          \n            William Elward\n          \n            William Elward"
}