{
  "url": "https://moz.com/blog/beware-payperperformance-contracts-sem-sues-pop-phenomena-the-secret-for-unpaid-share-of-web-revenue",
  "slug": "beware-payperperformance-contracts-sem-sues-pop-phenomena-the-secret-for-unpaid-share-of-web-revenue",
  "title": "Beware Pay-Per-Performance Agreements: SEM Sues Pop Phenomena 'The Secret' for Unpaid Share of Web Revenue - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nIn November 2007 I blogged about a wacky lawsuit involving the movie/book/TV phenomena called \"The Secret\" and an SEO, Dan Hollings. Several months have gone by and both parties have been busy.\n\n\n...",
  "content": "Beware Pay-Per-Performance Agreements: SEM Sues Pop Phenomena 'The Secret' for Unpaid Share of Web Revenue E-Commerce SEO By: Sarah Bird August 25, 2008 Table of Contents Copied! By: Sarah Bird August 25, 2008 Beware Pay-Per-Performance Agreements: SEM Sues Pop Phenomena 'The Secret' for Unpaid Share of Web Revenue E-Commerce SEO May It Please the Mozzers, In November 2007 I blogged about a wacky lawsuit involving the movie/book/TV phenomena called \"The Secret\" and an SEO, Dan Hollings. Several months have gone by and both parties have been busy. Background Summary The Secret (and all the international conglomerations and people that have a finger in ownership of The Secret) sued Hollings for trademark infringement and violations of his alleged duty of loyalty. The Secret's Complaint accuses him of profiting off The Secret's trademarks by selling his own merchandise under the brand, cutting unauthorized side-deals with vendors of authentic merchandise, and generally using his SEO knowledge for personal gain. Hollings denies all the allegations against him in his answer to the complaint. It is worth noting that Hollings and The Secret had been engaged in a dispute about money before The Secret filed suit. Hollings had informally accused The Secret of withholding compensation that he was owed. It is possible, although unprovable, that The Secret proactively filed a suit against Hollings to pressure him to drop his informal complaints about unpaid compensation. If that was its intention, it didn't work. Hollings filed a lawsuit against The Secret in May 2007. Hollings' Allegations Against The Secret Hollings filed a lawsuit against The Secret in May 2007 alleging that he was supposed to be paid 10% of gross margins from the web-based marketing campaign. The parties did not have a signed contract. However, Hollings claims to have an email written from Rhonda Byrne, one of the key people in The Secret conglomeration, promising to pay him: US$8,000.00 per month to broadcast plus a share of 10% of gross margins of all revenues from The Secret website. The revenues you will receive from this, in fact, will exceed the Nine Network's revenues as they have 10% of Prime Time's net profits, which will come after your share. Hollings claims he never received his 10% share of \"gross margins of all revenues\" (whatever that means), an amount that he believes is over three million dollars. Hollings also alleges that The Secret sent \"numerous communications\" assuring him that his portion of the gross margin would be forthcoming and instructing him to set up an LLC to receive the large sums of money. Concluding Thoughts: Beware Pay-Per-Performance Contracts It goes without saying that I don't know who is telling the truth in this matter. However, I do know that both parties are spending a fortune on legal fees. There have been extensive jurisdiction and discovery disputes. Is The Secret trying to outspend Hollings? Did Hollings get greedy? I don't know. But I do know the lawyers are doing quite well. I've written before about the dangers involved in commissions-based or pay-per-performance contracts. There is tremendous potential for gain, but also tremendous risk. If you decide to take the plunge, make certain you have a solid written and signed contract. If the SEM in this case had a signed contract, he might not be in his current unenviable situation. Remember to get it in a signed writing! There haven't been any rulings in the case yet about whether Hollings owed a duty of loyalty to The Secret by virtue of his relationship with the company. Generally, an SEO/M probably isn't an agent or fiduciary of his or her client. However, it is possible for an SEO/M to become an agent with special duties of loyalty depending on the nature of the relationship and the agreement between the parties. To avoid unintentionally having a duty of loyalty to a client, expressly state in your contracts that you are an independent contractor, not the client's fiduciary or agent. Clarifying your relationship with clients helps them understand that you can work with their competitors and have no legal obligation to further their interests to the exclusion of others. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Beware Pay-Per-Performance Agreements: SEM Sues Pop Phenomena 'The Secret' for Unpaid Share of Web Revenue"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Beware Pay-Per-Performance Agreements: SEM Sues Pop Phenomena 'The Secret' for Unpaid Share of Web Revenue"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}