{
  "url": "https://moz.com/blog/beyond-good-and-evil-in-seo-11331",
  "slug": "beyond-good-and-evil-in-seo-11331",
  "title": "Beyond Good and Evil in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I recently heard a story about a local SEO shop whose customers, overnight, almost ALL lost ranking in Google. Apparently, the shop had been engaging in “black hat” techniques. I’m pretty sure the teller of the tale made a “tsk tsk” sound at the end to help emphasize this as another instance where…",
  "content": "Beyond Good and Evil in SEO Blogging D By: DragonSearch November 17, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: DragonSearch November 17, 2010 Beyond Good and Evil in SEO Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I recently heard a story about a local SEO shop whose customers, overnight, almost ALL lost ranking in Google. Apparently, the shop had been engaging in “black hat” techniques. I’m pretty sure the teller of the tale made a “tsk tsk” sound at the end to help emphasize this as another instance where people who do evil get their just desserts. But I think there is a fundamental disjoint in even using the phrase “black hat” – as it does infer a big gap in morality. And ‘black hats’ aren’t going around stealing the life savings of pensioners, killing kittens, or committing other dastardly deeds. What they are doing is gaming the system. In Italy, there is a word for when someone uses audacity to gain advantage: “Furbo”. And it is, in a way, considered a virtue. In many cultures, it isn’t a bad thing at all to be a “player”. So how is it, in my own circle of SEO experts, black hat is spoken of with such disdain? Mind you, I’m not advocating black hat seo tactics – as I’ll explain in more detail in a bit. But by framing the black/white hat discussion in terms of morality, we might be distorting the real meaning behind the concepts. What IS happening in Black Hat What IS happening in black hat is the gaming, or the attempt at gaming the system. And in this case, the system is usually Google. Now, Google, we hope, wants to present the best search results to its users. I’m not always sure about that, and not at all sure that the reality isn’t that Google wants to present the best results to its users that helps Google make the most money. If we’re going to discuss ethics, there is a whole topic for discussion in that. In a way, as a professional SEO, what we want to do is get Google to see our page as being more relevant to a topic than our competitor’s page. And who is to say it isn’t? Google, as we know, has an algorithm, albeit a SECRET algorithm – and we can all find countless examples of where Google does not provide the best results. So, we’re asking, is Google a better arbiter of best results? Let’s consider a black hat tactic I recently heard discussed at SMX East, the acquisition of an old well-indexed website, and then peppering it with back links to our web page. Those link’s were NOT part of the original content of the site – and perhaps not even relevant to the content of that old well-indexed site – so in essence, the black hat is using Google’s system to sort of cheat a little. By the way; there are some interesting studies (http://blog.ted.com/2009/03/13/dan_ariely_offe/ ) that show that MOST people WILL cheat in small incremental ways if they believe that can go undetected. It’s just a little cheat. In game theory, this is an aspect of the “Tragedy of the Commons” – people will take a little bit from the group if their actions benefit themselves a lot, but only hurt the group a little. The problem is, of course, that all those little hurts to the group add up. Now, isn’t it true that emphasizing a key phrase in meta tags, H1’s, links, etc, is ALSO gaming the system? Maybe it is gaming the system but in a lesser way than acquiring a mothballed site. But if we’re talking about ethics, can we really talk degrees of ethics, and where do we score the little measures? Mrs. Google Imagine a classroom where the teacher up front is Mrs. Google, and all of the students are us SEO’s. Mrs. Google asks a question, “who is the most relevant student here to answer this question”? And we all raise our hands – each one of us wants her to notice ME, we want to her to pick ME! And sometimes, to get noticed, maybe we sort of bounce up and down in our seats, to help influence her choosing. But should the student doing the most bouncing up and down in their seat be chosen? Are they really the most relevant? Now, maybe one student not only bobs up and down in his seat, but emits a small chirping sound! Is the chirper a black hat? Isn’t he using a method of getting called-on that has nothing to do with the fairness of his being chosen? So; what I’m suggesting is that black hats are simply taking their methods of being noticed FURTHER than white hats – and in comparison to most SEO professionals, is only doing what is done by everyone, just in greater degrees. Beyond Good and Evil As an SEO, I discourage the use of so-called black hat techniques. Simply put, they can result in a web site’s being perceived as deserving a Google purgatory. It would be irresponsible to put a website at risk in that way. It’s a risk management issue, not a moral issue. The SERP has been dying a long and painful death. Every so often, a new Google enhancement causes SERP to be less relevant – instant search, local results, etc. In other words, DYNAMIC results based on the searcher’s demographics or behavior. Cool. And by focusing more on creating content that is rich in relevant clouds of words and phrases, we’re not simply trying to be perceived as being more relevant, we’re focusing on BEING more relevant. It takes the entire discussion outside of the black hat/white hat. About Ric Dragon Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Beyond Good and Evil in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Beyond Good and Evil in SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "DragonSearch\n          \n            DragonSearch"
}