{
  "url": "https://moz.com/blog/beyond-link-building-using-links-and-content-to-hit-business-goals",
  "slug": "beyond-link-building-using-links-and-content-to-hit-business-goals",
  "title": "Beyond Link Building - Using Links and Content to Hit Business Goals - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building has undergone an incredible transformation over the last few years, but we've still got a long way to go before the link building process is viewed as quality, creative online marketing. In today's post, Paddy Moogan shares his thoughts on how we can transition link building from a…",
  "content": "Beyond Link Building - Using Links and Content to Hit Business Goals Link Building By: Paddy Moogan February 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan February 4, 2013 Beyond Link Building - Using Links and Content to Hit Business Goals Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Few would argue that 2012 changed the SEO industry. In April, we saw the release of Penguin and, for the first time, aggressive penalization of low-quality link building tactics at a huge scale by Google. As an industry, we needed this. We were on borrowed time with these tactics and, let's be honest, they shouldn't have worked in the first place. I know a lot of SEOs who add huge amounts of value to the businesses they work with through quality, creative online marketing. This is what we should be recognised for rather than using low-quality tactics and tricks that have been labelled by others as a \"dark art.\" Link building certainly fits into this bucket because it is one of the areas where low-quality tactics worked for a long time (some still do) and were far from creative. The 5,000 article syndation links and 10,000 directory submissions you've done was hardly us at our best. I want to share some thoughts on how we can transition link building from a numbers game into genuine online marketing that adds value to a business, beyond increasing their link counts. Start with why Last year, I read a book by Simon Sinek called Start with Why. If you haven't read the book, here is a video of a talk he did at Ted: The basic message is that successful companies know why they exist, and they use this to guide the decisions they make. They also focus on why they exist when marketing themselves and selling to customers. Rather than getting customers to buy into the what, they get them to buy into the why. The reason I mention this in the context of link building is because I don't think we ask this question enough. The temptation when a client asks for our help is to dive in and start building links as quickly as we can, but why are we doing it? Are they the right types of links? Are they going to make a difference to the business? Is an infographic really going to help bring more customers? Instead of this approach, I believe we should be a bit smarter and far more strategic with our recommendations. Yes, links help rankings and infographics (as an example) help get links. But is that the best we can come up with? Can't we build links that not only help with rankings, but also drive real customers to the website? There is already talk of Google reducing the effectiveness of links built via infographics and guest blogging. Wouldn't it be nice to not have to worry about whatever update Google comes out with next? Why does this business exist? Whether a client comes to you for link building or not, I think this should be the starting point for an online marketing campaign. To work with a client long-term, you need to really dive into their business and understand it as much as you can. I'm not saying that you necessarily need to become an expert on their products or their market, but getting a deep understanding of how they work and why they do what they do is important. If you can do this, it will make your job much easier with the following: Understanding their industry and what makes this business different Knowing how to get things done internally by understanding what matters to the company Defining a strategy that is in line with their business goals You can talk the same language and they will trust you because of that - once you have trust, it's a lot harder to fire you, too :) There is another subtle benefit here, too - if you're pitching to win their business, you're far more likely to win if you show a genuine understanding of their business. Why do they need SEO? There are a few answers to this question that I would not be happy with, and would push for a further explanation: More links More traffic More content These are all good things to have, don't get me wrong. But in isolation, they don't mean much. If you hear this as an answer, you need to ask - why? Why do you need more links? Why do you need more traffic? Why do you need more content? These will get you closer to the answer you want to hear. Or you can rephrase to be something like this: What matters to your business? How do you make money? What drives your profits every year? The answer you're looking for is the one that makes the business survive, and the answer will be in line with why the company exists. This is the starting point that we need because from here, every decision we make is driven by it. This is why it is important to start with these questions. Once you've got this clear, you're in a much better position to start defining a strategy that will not only deliver links, but links that will help the business hit its goals. Don't measure success by links built Some may not agree, but this is what I feel about link building right now: The deliverable of a project isn't links; the deliverable is a clear improvement in what matters to the client - revenue. I'm not keen on working on the basis of building x number of links per month, with little or no thought as to why. Why do you need 50 links each and every month? What type of links are they? If you build them every month, will you improve revenue for your client? Let's look at a quick example. You're hired by the Head of SEO at a mid-level company and you agree a target of 50 links per month to be built and a three month contract. At the end of three months, you've built 150 links, so you go in for another meeting to discuss the project and declare it a success. At this meeting is the CEO of the company who hears that you've hit your target. They ask how much extra revenue you've generated as a result of these links. The Head of SEO doesn't know, and neither do you. The CEO then asks how your work has helped improve the brand image of their company. You look at the list of 150 guest posts on unrelated blogs and stay quiet. See the problem? If we want to be taken more seriously as an industry, we need to be able to confidently deliver results that the CEOs of large companies will relate to and understand. The CEO doesn't care if Open Site Explorer or Majestic SEO shows an improvement in your backlink profile. They care about paying the salaries of their employees on time, paying the office rent, and making a profit. Links alone, with no thought or strategy behind them, will not do this. They used to work when link building was a commodity and less risky, but no longer can we think like this. We're hired to make more revenue for the company, if we can do this by building 50 links a month and it happens, that's great. But we start with why we're doing what we're doing - not starting with links as the default answer. It may not always be as straight forward as though and I know that it isn't simple to get to this point. So here are a few ways to take steps towards it. Focus on the metrics that matter to your client If your client doesn't make direct revenue from their website, you need to find an alternative. Imagine you're working with a B2B website who doesn't sell online. In this case, your work should be measured on leads/inquiries which lead to revenue. The bottom line is that your deliverables should make a difference to the business you're working for. Figure out the key metric, then figure out how to improve it. Real example: I used to work with a SaaS client in the UK who were B2B. A single sale of their service could give them £100k+ revenue a year, but a conversion would take many months to complete. I could track enquiries from organic search, but I wouldn't necessarily know if they converted into a customer, so I made a point of having face-to-face meetings with the Marketing Manager each month to see how good those leads were. She was able to tell me if they were on the way to converting into real customers or not. This communication let me see that we were adding huge amounts of value to their business through search. Try not to sell short-term projects To be able to focus on this as a metric that you're measured by, you need to agree on being given enough time to make it happen. Doing a one-off piece of link bait that lasts four weeks is probably not going to help, whereas agreeing a contract for at least six months of activity is much more likely to lead to you having the chance to improve the bottom line. The only time I think that a short-term project can work is when you're working on a very specific problem, such as lifting a penalty or training an internal team. I don't think it is a good idea to take on very short-term link building projects because it encourages short-term thinking. Choose a strategy that helps you improve the bottom line This is where it all comes together. By this point, you may decide that to improve revenue for your client, you need to come up with a good link building strategy. You then choose the tactics that fit into this strategy. You should see the clear difference between this approach and just saying, \"We need links,\" within a few minutes of talking to your client. When we pick the link building tactics in this way, we're choosing ones that will help us improve revenue for the client - not ones that will just let us deliver 50 links per month. If we're driven by pure number of links, our standards naturally drop, and we will be happy to get any types of links we can just to hit the target we've been set. Examples of getting it right Let me give you a direct example of a smarter approach: Turning Link Building into Audience Profiling by Richard Baxter. This is link building, but it is driven by a smart strategy that means the links built will mean much more to the company they point to. They will hit that sweet spot where the potential customers of a business hangout and absorb content online. What about guest blogging? There has been lots of talk about this as a tactic, and it can be a great tactic. But it is also easy to scale, which naturally reduces the quality of the output. Instead of scaling guest blogging, what about doing something like this. This was a guest post that drove more sales of a book than TV and newspaper coverage. Infographics that matter No, they're not dead, but they will become less effective if they're not good quality and worth sharing. Rather than creating a regular tower graphic and visualizing things that should never be made into an image, why not create something relevant and helpful to your customers? Like this: What about content marketing for consumers? The new SEO buzzword that has actually been around for years and years. Instead of producing a piece of content where the goal is just to get links, what about producing a piece of content that is useful to your real customers? I have a great example here from Swissotel, hat tip to the guys at SEOgadget for showing me this one: What about content marketing in B2B markets? I have two great examples here, starting with American Express who work with a lot of small businesses. They have the Open Forum that publishes content that small businesses will find useful: Simply Business have done the same with their guides for small business owners: Both of these companies are creating content that fits with why they exist - to service small businesses. This is smarter than creating an infographic on a random topic just to get a few links that month. The CEO test Next time you build a piece of content, ask yourself, \"What would the CEO think of this?\" This can be a good way to sense check what you're doing and to make sure that it is in-line with the business and will help them hit their goals. Will the CEO be proud of seeing the content on their website? Will they be proud to see the external websites where they're mentioned? Conclusion Yes, links matter - a lot. This isn't changing anytime soon and our clients need links more than ever. But I'd love to see our industry step up and build links that stand the test of time, and not waste time being worried about Google updates. This isn't easy to do - I'm not 100% there yet myself. It involves quite a big change in thinking for a lot of people. But I firmly believe that if we can alter our approach so that we become focused on the goals of a business rather than purely looking at links, the following will happen: You will win more business because the clients will see that you focus on what matters to them You will be forced to use the tactics that really make a difference to the bottom line You will be able to demonstrate that you've increased a key metric for a business, not just number of links or rankings which most CEOs don't worry about Overall, SEOs will start to be taken seriously as we're being measured on the right business metrics - not pure rankings or number of links we manage to build. On a related note, I've just released an eBook focused 100% on building links. At 65,000 words, it covers the whole link building process (including a fair amount of information on this topic) and discusses kicking projects off on the right foot to establish business goals early. I hope you enjoyed this post - please leave your thoughts in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Beyond Link Building - Using Links and Content to Hit Business Goals"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Beyond Link Building - Using Links and Content to Hit Business Goals"
    },
    {
      "level": "H2",
      "text": "Start with why"
    },
    {
      "level": "H2",
      "text": "Don't measure success by links built"
    },
    {
      "level": "H2",
      "text": "Choose a strategy that helps you improve the bottom line"
    },
    {
      "level": "H2",
      "text": "Examples of getting it right"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}