{
  "url": "https://moz.com/blog/beyond-pagerank-five-alternative-factors-for-evaluating-outreach-prospects",
  "slug": "beyond-pagerank-five-alternative-factors-for-evaluating-outreach-prospects",
  "title": "Beyond PageRank: Five Alternative Factors for Evaluating Outreach Prospects - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here are five less conventional factors you should take into account when assessing sites for outreach purposes.",
  "content": "Beyond PageRank: Five Alternative Factors for Evaluating Outreach Prospects Link Building By: Will Stevens July 23, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Will Stevens July 23, 2013 Beyond PageRank: Five Alternative Factors for Evaluating Outreach Prospects Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Imagine receiving this pitch \"Hi there blogger, I've set up a site but I don't fancy writing any of the content for it myself. As such I'm reaching out to people to ask them to produce articles for me. I'm not paying, but you will get a link back to your site.\" Chances are you'd delete the message as soon as you'd finished reading it - the proposition offers very little value for the writer. So why are so many people working in the world of outreach happy to accept such an arrangement so long as it's them doing the pitching? The simple answer is that many people still see volume of links acquired as the ultimate measure of success and care little for anything else. To escape this trap you need to stop thinking of a link as something that has inherent value. If a link possessed value by virtue of its existence alone, then setting up a load of new WordPress.com blogs and dropping links back to your main site would be a viable SEO technique. In reality, you'd just end up with a ton of links that have no value at all. Start with the assumption that getting a link on a site will be fundamentally worthless and then look for signs that disprove your supposition. If you find those signs, begin the process of obtaining a link and if you don't, ignore the site. So what factors should you consider? Traditionally SEOs have used PageRank, Domain Authority and similar metrics to judge the potential value of acquiring a link and although they're exceedingly useful, we should be throwing other things into the mix to get a fuller picture. Here are five less conventional factors you should take into account when assessing sites for outreach purposes. 1 - Social Interactions When it comes to judging the potential reach of a guest post a quick glance at Twitter followers and Facebook fans isn't enough. Head over to each social network they're on and check out what they're doing on their and who's listening. Have they got 50,000 follows but no one replies to their tweets? Use this tool from Status People to check if they've been buying fake followers. Just authorise the app and input their Twitter handle and you'll quickly get a good idea of how real their followers are. You'll see something like this... Or like this... There's no equivalent tool for Facebook, but as a general rule of thumb if their page has a lot of likes and no one is interacting with their posts, it's not a good sign. Once you're satisfied everything is legit, dig deeper into their past posts and see how many shares they have clocked up. Sites with a strong social presence tend to be pretty keen to blow their own trumpet, so there should be share counters by the side of each article. If they're regularly getting 100+ shares across the platforms they use then you're going to get some pretty good exposure. You should also pay attention to the number of comments on each post; real comments show people are reading and engaging with the site, which is exactly what you're looking for. 2 - Links to Articles When evaluating a site for outreach, it's tempting just to stick the URL in Open Site Explorer, quickly check the domain authority, have a glance at the site's links and anchor text to make sure they're not doing anything dodgy and leave it at that. But clicking on the \"Top Pages\" tab can give you an even better idea of the worth of getting coverage on a site by showing you how likely your article is to pick up links in its own right. Now obviously the linkability of an article is dependent on its quality, but even the best content will remain linkless if it's presented to an audience that is unwilling or unable to reference it in other articles. So have a dig through the Top Pages tab to see if the site's blog posts are picking up a significant number of links. If they're not it's probable any coverage will be of less worth than you might have imagined both in terms of link value and engagement. 3 - Guest post ratio How many blogs do you read on a regular basis that are 100 per cent dedicated to guest posts? I'm willing to bet the answer is zero. There's no surer sign that a site owner doesn't give a two figs about his readership than a blog that is wholly or largely given over to guest authors. If a site owner doesn't care about his readers, then you shouldn't care about him. Why? Because fundamentally the way good outreach works is this - you're there to impress the blog's readers because they're the people who are going to visit your site, buy your product or sign up to your newsletter. If a site is dedicated to low quality guest posts then even if you produce great content you'll still be talking to a low-quality audience (or no audience at all). You're either looking for blog where guest posts are comfortably in the minority or a site that uses a wide spread of contributors with strong editorial controls. If that's not what a site is offering, it's unlikely to offer you much value. 4 - Who syndicates them? How does a UK-based domain name registrar get a mention on the website of a major US daily newspaper? Through syndication. As part of an outreach campaign for 123-reg I wrote an article for Brazen Careerist which was later picked up by the Chicago Tribune. Without syndication, this would have been nigh on impossible. Syndication is still something of a dirty word in SEO circles because of its association with spun articles and thin content, but it's a reputable practice which is older than the internet. Pretty much every major newspaper syndicates content from one source or another so it's not something you should be frightened of per se. Don't rely on getting your articles syndicated as part of your outreach programme, but if a site has built up strong links with major publications it's a strong sign they care about building a quality website. 5 - Create an ubermetric Imagine you set a lower limit of DA 40 for sites you'll approach. Are you really going to filter out all DA 39 sites? What about DA 39 sites with 5,000 engaged Twitter followers? The potential value of a guest post can't be dictated by a single metric and it's only by considering several factors that you'll be able to get a good idea of whether it's worth fostering a relationship with a site. So take all your metrics and use them to create your own site scoring system - you'll end up with something that looks a little bit like this. You can weigh each factor based on your personal preferences, and you'll probably want to come up with a more nuanced outcome matrix. However, the bottom line is implementing a site scoring system that's fixed and followed by everyone involved in your outreach projects helps remove the temptation to build links for links' sake. Bonus takeaway - using the above metrics to guide content creation As well as helping you decide whether a site is worth approaching, three of the above factors can also be used to develop content ideas which you can then base your pitches on. Here's how. Social: What has proven popular once will is likely to prove popular again. Look for articles that have received plenty of likes and retweets and use that as a starting point for a brainstorming session. Use Social Crawlytics to identify popular posts without having to trawl through a profile manually. However, you can't just rehash an idea and pitch it back to the site owner - you need to work out how you and the resources you have at your disposal can add extra value to the topic. Links: As with social, if something has attracted a lot of links, it's popular and pitching similar content is likely to go down well with site owner. For example, Mike Arnesen's Author Rank post on Moz attracted 1,716 links from 483 root domains so it's fair to surmise it's a topic the site would be keen to revisit and by targeting it, you could boost your chances of getting a post published on YouMoz. Of course, it often pays to be contrary especially on sites with a varied editorial output so you might want to try offering to write a response to an article with which you disagreed. This technique scored me an article on the website of a national UK paper. Syndication: Checking out the kinds of articles that are being syndicated by your target site's biggest partners will help you a) identify the sort of pieces the site owner is most proud of and b) increase the chances of your content being republished. Quality breeds quality, so make sure its a factor you take into account throughout the outreach process. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Beyond PageRank: Five Alternative Factors for Evaluating Outreach Prospects"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Beyond PageRank: Five Alternative Factors for Evaluating Outreach Prospects"
    },
    {
      "level": "H3",
      "text": "1 - Social Interactions"
    },
    {
      "level": "H3",
      "text": "2 - Links to Articles"
    },
    {
      "level": "H3",
      "text": "3 - Guest post ratio"
    },
    {
      "level": "H3",
      "text": "4 - Who syndicates them?"
    },
    {
      "level": "H3",
      "text": "5 - Create an ubermetric"
    },
    {
      "level": "H3",
      "text": "Bonus takeaway - using the above metrics to guide content creation"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Stevens\n          \n            Will Stevens\n          \n            Will Stevens"
}