{
  "url": "https://moz.com/blog/big-changes-afoot-at-seomoz",
  "slug": "big-changes-afoot-at-seomoz",
  "title": "Big Changes Afoot at SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is a tough post to write. Not because I'm not excited and not because the news I want to share isn't positive, but simply because I feel like I've been keeping something from you for the past few weeks, and I hate doing that. Of course, it's nowhere near as tough as hiding my Super Bowl…",
  "content": "Big Changes Afoot at SEOmoz Moz News By: Rand Fishkin September 18, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 18, 2007 Big Changes Afoot at SEOmoz Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This is a tough post to write. Not because I'm not excited and not because the news I want to share isn't positive, but simply because I feel like I've been keeping something from you for the past few weeks, and I hate doing that. Of course, it's nowhere near as tough as hiding my Super Bowl engagement from Mystery Guest for 6 months, but I have those same pangs of guilt about keeping this all under wraps. Maybe by the end of this post, I'll feel a lot better. First up (yes, there's lots of big news) is that we've decided to go the outside investment route. We're giving up an undisclosed (but small) percentage of the company (sorry, had to keep that one piece under wraps) for precisely $1.1million in outside capital. After the strong emotions that came out when I asked for everyone's opinion on the subject back in August, I feel like I have to justify this decision - and that's OK. I should have to justify it. If I can't justify it to all of you, how can I possibly justify it to myself? So here goes: The decision was made based on the fact that we want to do more - and grow faster. The premium content stuff isn't just fun and interesting, it's something we love - something we're passionate about - something we think can make the web a better place by making search marketers smarter - better, stronger, faster. We literally have a hundred different ideas for tools, search analytics, tracking, guides, resources and more and we're in a position to recruit help from the best and brightest the industry has to offer... but, we can't do it alone. Let me make this totally clear - this money is going to change SEOmoz - it's going to change the quality of the services we provide, it's going to change the quality of the people we can attract, it's going to change our ability to market ourselves on a bigger stage, but (big, big but), it's not going to change our culture or our style or our approach to doing what we love to do - search marketing. The biggest outcry I felt from folks was the \"Noooo!! Don't sell out to the man,\" line. I promise you, we are doing anything but. First off, the \"man\" is actually Michelle Goldberg, a partner at Ignition, a VC firm based a few miles from SEOmoz in Bellevue, WA. You can't really get much further from the definition of \"the man\" than Michelle, but since she's agreed to be on our Whiteboard Friday series in a few weeks, you'll get to see her in person and find out why we like her so much. Michelle and Ignition are investing in us because they love what we do. They love the blog, the community, the culture, the crazy, comic-filled, over-disclosed, personal, grassroots style of SEOmoz and the world of SEO that we inhabit. Due to the small size of the investment and the small percentage of ownership, we're not being asked to grow at an uncomfortable pace. Instead, they're backing us by saying - we believe in you, we love the SEO space, we love the SEOmoz brand and we want to see where you can take this. Gillian and I have thought long and hard, and we've talked to some really, really smart people about the decision. I've personally had 40 or more phone calls in the last three weeks with people who've taken VC and had both good and bad experiences. We've shared the terms of our deal with a half dozen very experienced, fiercely loyal friends (including these guys) and received the same response every time - this is a good deal (and, with so many potential investors asking after us, we felt fairly confident that it would be). Michelle's also not the only investor - Ignition is actually partnering with a local, private investment firm called Curious Office for a share of the SEOmoz pie (if we were a flavor, we'd definitely be blackberry). The guys behind Curious (Kelly Smith & Adrian Hanauer) are similarly compelling people, and once again, they'll be part of a future Whiteboard Friday, so stay tuned. Naturally, there will be some formalization. We'll be building a board of directors, but Gillian and I will retain a controlling interest in that entity, so we're not losing control, we're getting help to guide our strategy, rather than a board that determines our moves. We've also been tasked to recruit an outsider to serve on the board, and a very good friend (despite her quiz criticism) is talking to us about that position, which we're thrilled about. And, of course, Gillian and I will start to take home real salaries, rather than taking pride in our positions as SEOmoz's two worst-paid employees :) I think I might just be able to afford that wedding to Mystery Guest next summer. So, what, specifically, are we going to do with the money? Good question - glad you asked :) Invest in people - people are our biggest resource, and with our staff getting competing job offers every other day, we need to make sure that we can compensate our team at market rates (we've been playing the scrimp and save game a long time). Attract great new talent - look for a blog post in the near future on our recruiting efforts. We're planning to go from 7 to 12 on the team full time over the next 6 months. Build better technology - the tools are great, and we're getting relatively good accuracy, but it's not good enough, and it certainly can't support the kind of growth we want to see. We want to build truly scalable technology to provide you with the information you need, updated when and how you need it. Market to a wider audience - I'm no fan of throwing money at marketing, especially when SEO & word of mouth have been so successful. However, I do think it's valuable to test the waters and see what works - print, radio, trade show booths, sponsorships and a serious push into business and partnership development. Take some chances - While we're planning to be conservative with the investment (none of the standard, blow-through-the-money-in-6-months then ask for more), we will be able to take some risks and invest in projects that don't have a guaranteed outcome. Developer time, analysis time and hardware resources will all be a part of what we do here, and hopefully a few of these projects will provide remarkable value (while others will help to serve as lessons of what not to do). One of the things we want to try - building our own search engine on a small scale :) Finally, when thinking about this investment, I was reminded by a friend to go with my gut. I can't say that I knew to go with the deal from the beginning, but I can say that my early impression of Michelle and Ignition felt right. If you've read Malcolm Gladwell's book - Blink - I'm sure you'll remember the part about how thinking a lot about a very complex issue often produces the wrong results, while following an instinctual, instantaneous reaction is more often right. I'll excerpt: How can thinking that takes place so quickly be at all useful? Don't we make the best decisions when we take the time to carefully evaluate all available and relevant information? Certainly that's what we've always been told. We live in a society dedicated to the idea that we're always better off gathering as much information and spending as much time as possible in deliberation. As children, this lesson is drummed into us again and again: haste makes waste, look before you leap, stop and think. But I don't think this is true. There are lots of situations--particularly at times of high pressure and stress--when haste does not make waste, when our snap judgments and first impressions offer a much better means of making sense of the world. I'm not saying we didn't think about this long and hard and with a lot of perspectives on the information. All I'm saying is that, at the end of the process, we did a gut check - we asked ourselves, without any caveats or qualifiers, is this the right partner, the right deal, the right terms, the right time? And the answers came up yes. Now a quick aside - the deal isn't finished yet. We're still going through the due diligence process (yes, I will have a long and in-depth blog post describing the entire VC path from pitch to funding once it's all over). The process should be wrapped up by the middle of October at the very latest. In the meantime, Gillian is handling all the paperwork and finances and discussions while I'm working with the team to set up our strategy for the future. To say we're busy is an understatement :) One final note on the outside investment - when we decided to accept this money, we took a step in a direction that will probably end with the sale of SEOmoz (as we're most likely not a target to go public). I think that this is one of the other big fears that members and commenters had - and I can completely empathize. However, I will say this - I'm in this for the long haul, and even though SEOmoz may, in 4-7 years, be part of another company, I'm going to do my damndest to make sure that all the great things about us get preserved. Gillian and I didn't want to make just another corporate services company and that's never been in the cards for us. If and when a buyer does decide they're interested, we retain the right to say yes or no (a rare privilege in most VC investments, but something that is written into our deal). I can promise that for the next few years, SEOmoz is going to be even more exciting and more valuable than it's been in the past - that's what we care about. The money is great, and an increase in profitability is certainly a good target for us as well, but that's NOT what SEOmoz is about. We are, and always have been about providing value to the community of search marketers who've given us so much. Above all else, this investment is a way for us to give back in a big way and, hopefully, to build a great business while we're at it. Unfortunately, along with this good news, there's some bad news. Our longtime friend and the talented architect of the SEOmoz website, Matt Inman, is leaving SEOmoz at the end of the month. He actually had decided to leave before we started down the VC route, so the two are, oddly, unconnected. Matt's been hankering to be his own entrepreneur and has finally taken the first step down that path. He's staying in the Seattle area and will continue to provide us with support and consulting a few hours a week as needed. One of my favorite photos of Matt - the SEOmoz team took a hike on Mt. Rainier where a local chipmunk (whom we affectionately named 'Pork Chop') was enamored of him (or his snacks; we're not sure which) Obviously, Matt's been an incredible asset to SEOmoz and has, through his tireless efforts on the design of our projects, the development of the SEOmoz tool suite and his frequent Digg-bait blog posts, made us who we are today. He'll be sorely missed. In his place, Jeff Pollard, who's been with us nearly two years now, will fill in as the leader of our development team. He's done some pretty exciting work as well, including a soon-to-be-launched section of the SEOmoz website that's new, different and (I think) incredibly valuable :) Jeff's been joined by our most recent full-time hire, Mel Gray, formerly of Austin, TX. Mel has a background in PHP, Perl and lots of heavy development, and he's as hard working and dedicated a guy as we could hope for. Mel is just getting into the swing of things here at SEOmoz, but he's already helping out with the tools, the servers and some of our SEO testing projects. Mel gives the universal sign indicating coding prowess, while Jane covers her laughter in the background (those Kiwis can be so mean) And, Mel's not the only addition to our team. We're also proud to welcome Lucas Ng, aka shor - some folks may remember that I did a video with him a few weeks back. Lucas works for Fairfax Digital, one of Australia's most respected media organisations and owners of websites like the Sydney Morning Herald, The Age and domain.com.au. He'll be contributing to SEOmoz part-time - giving up his nights and weekends to write blog posts, answer questions in Q+A and contribute to our general strategic direction. After spending a week with him here in Seattle, we found that we couldn't live without him :) Lucas, looking dapper at a meeting of SEOs Anonymous What's that? You want more news? You haven't had enough of us? Fine... Rebecca (who's off at Shop.org in Vegas) is blogging on Shoemoney today, answering dozens of questions about her job, SEO and her personal life (which mostly revolves around movies) :) Which segues nicely to the end of this post - I really liked the Q+A format that Shoemoney put together on his blog and I'd like to take a page from that book. Feel free to ask me anything you like in the comments below and I'll try to address the questions in a blog post tomorrow or Thursday. I'm guessing there might be some strong reactions to all of this, and I'm happy to be public about as much as I possibly can. p.s. Tomorrow I should be back to the business of normal blogging; tackling some site architecture issues and touching on the news of the recently banned directories. I've also got an interview with Marshall Simmonds from the NYTimes next week about the opening of their TimesSelect content, which should be very interesting. p.p.s. Quick stats for those who are interested - we've got 1287 premium members as of today, and 47,111 people who've signed up to use the free tools or leave a comment. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Big Changes Afoot at SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Big Changes Afoot at SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}