{
  "url": "https://moz.com/blog/bill-shakespeare-buttkicking-online-marketer",
  "slug": "bill-shakespeare-buttkicking-online-marketer",
  "title": "Bill Shakespeare: Butt-Kicking Online Marketer? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've made a few offhand comments here on others' posts about my theory that English majors make good search marketers.  I also recently commented on Lyndon's article which covers why companies need a social media consultant, that I believe certain personality types are pre...",
  "content": "Bill Shakespeare: Butt-Kicking Online Marketer? Public Relations K By: Kat French November 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kat French November 8, 2007 Bill Shakespeare: Butt-Kicking Online Marketer? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've made a few offhand comments here on others' posts about my theory that English majors make good search marketers. I also recently commented on Lyndon's article, which covers why companies need a social media consultant, that I believe certain personality types are predisposed to aptitude in the social media sphere. Specifically, I think that most of the top influencers online tend to be either enneagram Fours, or Myers-Briggs INFPs, or both. So what makes English majors, enneagram Fours, and INFPs good online marketers? I think it's a combination of four key traits: A facility with written language An instinctive understanding of human motivations A strong relational focus A passion-centered approach towards life The first trait seems like a no-brainer. For all the impact that podcasting and online video have made, the web is still primarily a text-based medium (and even those podcasts and videos are often scripted beforehand, at least minimally). The ability to communicate clearly, effectively, and persuasively in writing has always been a valuable skill in creating a powerful web marketing presence. In earlier days of online brand marketing, design often dominated copy--much as it often does in the print advertising world. However, with the advent of web 2.0, the web isn't viewed as a \"print marketing home delivery system\" anymore. Companies are now embracing the web for its potential as a powerful two-way communication and brand relationship-building tool. They are beginning to see the value of engaging in the conversation online--thus the need for those who can communicate persuasively in writing has never been higher. William Shakespeare, an INFP and enneagram 4, is widely considered to be the greatest writer of all time. He's earned this distinction not simply because of his gift with words, but because of his depth of understanding of the human condition. What shines through in all Shakespeare's writing is the authenticity and realism of his characters. Their speech patterns may be unnatural (I don't know about you, but I rarely converse in iambic pentameter lately). However, their motivations, behaviors and inner drives are all pitch-perfect and relatable. In search marketing and social media marketing, we're not simply communicating a factual message clearly. We're persuading. We're influencing and altering opinions. We're seducing people (and through them, search engines) with our words. In addition to being English majors, I wouldn't be surprised to find that many in search marketing and social media marketing were on the debate team in school. That inner radar for what motivates people is a key to success. Another central theme of Shakespeare's writing, and life as an INFP and/or enneagram 4, is an extremely high value on human connections and relationships. As online marketing becomes less about creating destinations and more about creating online communities, this strong desire to make, develop and enrich personal connections is going to be an undervalued but critical trait in guiding brands through that process. Lastly, Shakespeare's writing has held lasting appeal because of the intense passion woven throughout the material. The characters are intensely passionate about their goals. The situations and themes that repeat throughout his work are meaningful, intense and inspire a passionate response from the audience. Much of the daily work we perform as online marketers is pretty mundane. However, the best online marketers always manage to remain passionate about the work, about their clients, and about the web as a medium. We're genuinely excited about what we do, and that passion shows in the work and in the results we're able to achieve. In addition to noticing a trend among online marketers towards certain backgrounds and personalities, I have a related theory that C-levels and other decision-makers on the client side tend to come from a different set of personality types and backgrounds. Those differences can pose some interesting challenges in getting everyone on the same page. I plan on doing a follow-up article on that theory, along with some suggestions for getting over that hurdle. But for now, regardless of your college major or personality type, if you want to succeed in online marketing, I believe you need to cultivate those four qualities: strong written communication skills, an understanding of human motivations, a relational focus, and a passion for your work. In addition to their career value, they can also add a lot to your quality of life in general. A few handy resources, in the event that you've never explored your personality type: An Online Test to Find Your Type A Profile of Enneagram Fours Career Suggestions for INFPs An interesting video interview of Laura Thieme regarding personality types and gender in search Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bill Shakespeare: Butt-Kicking Online Marketer?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bill Shakespeare: Butt-Kicking Online Marketer?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kat French\n          \n            Kat French"
}