{
  "url": "https://moz.com/blog/birthdays-elephants-tools-booze-ses-london-day-3",
  "slug": "birthdays-elephants-tools-booze-ses-london-day-3",
  "title": "Birthdays, Elephants, Tools, & Booze: SES London Day 3 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Due to an unavoidable client meeting I had to miss the first session on the final day of SES London 2008; from speaking to a few people it sounds like I missed some good ones, so here's hoping the rest of the day keeps up the quality. Session 2: Dynamic Websites: Beyond The BasicsIf there's such a…",
  "content": "Birthdays, Elephants, Tools, & Booze: SES London Day 3 SEO Events C By: Ciaran Norris February 21, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris February 21, 2008 Birthdays, Elephants, Tools, & Booze: SES London Day 3 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Due to an unavoidable client meeting, I had to miss the first session on the final day of SES London 2008. From speaking to a few people, it sounds like I missed some good ones, so here's hoping the rest of the day keeps up the quality. Session 2: Dynamic Websites: Beyond the Basics If there's such a thing as an all-star team in SEO then the panel here probably fits the bill. Mikkel, Ralph, Jake (although it's so dark in the room this session is being held in that it takes me 20 minutes to realise that Jake seems to be missing), Mike, & Kristjan. As Mike points out, as well as years of experience they also bring a truly international perspective to the issues of SEO for dynamic sites. Mikkel starts with a quick overview of the problems that dynamic sites typically have and does so in a really nice, simple, visual manner. The point he really hits home is that requirements for dynamic sites are often put together by marketers and implemented by developers, with no consideration for SEO. Result? Overly complex sites with lots of barriers which end up keeping the spiders out. He points out that there are no inherent problems with using databases, using ? in URLs, or extension names; it's how they are used that cause problems. What should you look out for? Lots of stuff including, but not limited to: Unwieldy URLs Duplicate content Session IDs Engine unfriendly technology (AJAX) Spider traps Server downtime Flash, JavaScript Personalisation/GEO-targeting (make sure that you have generic versions of content as well) Forms and form-based navigation Mikkel sums this up by suggesting a process for working through this: Try to fix it; if you can't, add a bridge layer to your system; and if that doesn't work, see if you can replicate the content in a better fashion. After he finishes, Mike mentions that it's Mikkel's birthday - here's hoping that he gets something nice. Ralph covers the use of on-site links to optimise dynamic sites. This is an issue I think plays a huge part in issues that dynamic sites face, especially when pages show up in the supplemental index (even if Matt says it doesn't exist anymore), and Ralph seems to agree (and I'd pay more attention to him than to me). He suggests that the way to make sure you identify and fix such issues is to follow this process: Comprehensive site crawl - make sure that you let the tech team of a client know that you're going to do this and that you don't do it in such a way that it might overload them when they typically get traffic surges. In-depth linking analysis - look at how many pages there are, whether there are duplicate pages or URLs, orphan pages, as well as the number and type of links prevalent on the site and also the site structure and distribution of PageRank. Calculate alternate scenarios - take into account other factors such as usability/accessibility, design, & any CMS issues. You may end up having to decide on a compromise when these are taken into account. Recommendations - cover everything from the preferred link structure, URL optimisation, anchor text improvements, PageRank flow/bleed, how to handle links leaving the site, and anything else that crops up in your analysis. Decision taking - be sure to consult all relevant stake-holders: technical teams, system administrators, marketing, design, etc. Implementation - what it says on the tin! Ralph then runs through a series of potential structures which I'd be hard pushed to summarise here. Suffice to say you should look at as many potential ways of structuring links and analyse them all before you make your decision. Kristjan points out that the major engines now provide a lot of advice on issues relating to dynamic sites and also that it's not just about spiders. Which of the URLs below would you be more likely to click on? www.example.com/ghghghg&ghgt//*?y.asp www.example.com/stuff/really-interesting-stuff Yeah, me too. Kristjan then gives some incredible case studies showing how simple changes can have a huge impact on indexing, ranking, traffic, and sales.The level of information in this session was amazing and I almost certainly haven't done justice to it. It's a great example of how really tactical information, mixed with well explained case-studies, can give real value to the attendees. The case-studies also highlighted the fact that whilst a lot of this may seem obvious to anyone with a small amount of experience in SEO, there are still plenty of people who wouldn't even consider these issues, so there should be lots of work for all of us! Session 3: Search Marketing In Regulated Industries Frank Watson is heading up this panel and starts off by pointing out that not only are there issues with marketing companies in regulated issues, but also that these regulations can differ from country to country. Who ever said this stuff was easy? Li uses her experience of working in the tobacco industry to highlight some of the things that you can & can't do. Needless to say, it depends on where you're marketing to: the EU has very strict rules relating to all forms of advertising in relation to tobacco: this means that in the EU (inc. UK) & US, PPC is a no-no when it comes to cigarettes. She recommends checking out all of the regulations relating to the territories you're operating in, but essentially it's all about keeping it factual. Martin from interactive return explains that he's going to be talking about using search marketing in the alcohol industry. Wow - fags & booze, two of my favourite things covered in one session. He points out that whilst regulations relating to marketing alcohol vary from place to place, they also often tend to be self-regulating (i.e., the industry regulates its own marketing to ensure that the government doesn't feel the need to do so). He also highlights the fact that the lovely people at Google/YouTube are out to help us, and therefore regulate the promotion of booze. Beer & wine? Probably OK. Hard liquor? No way, José. Of course, as Martin points out, there's nothing to stop 'brand evangelists' putting TV ads for hard liquor companies onto YouTube, and when the ads are as good as this, who can blame them? One of the main issues with regards to SEO & alcohol is that in many countries there is a need to have an age verification page at the front of any site (like this). Whilst there are ways of getting around this, they do risk falling foul of the engines in terms of displaying the same content to engines and users. Martin suggests that the biggest opportunities for ethical marketing for alcohol products are in the areas of blog marketing & reputation management. This is certainly a tactic which we have had success with, by turning staff at a whiskey company into brand evangelists. As most of you reading this probably know, Google now bans ads for a large variety of gambling/gaming sites whilst Yahoo! has slightly less strict rules. I won't go into the rights & wrongs of Google making decisions like this, but Hannah from greenlight points out that it actually opened up opportunities as MSN & Yahoo, which often have more mature audiences and more varied media partners, offered new ways to continue these forms of marketing. She also points to Miva's contextual network. Hannah then goes on to talk about SEO in this sector. However, as she points out, there isn't much of a tail in gaming search terms and the head is highly competitive. She suggest that it's therefore important to concentrate on linking strategies. If you don't have tens of thousands to 'invest' in linking strategies, we've certainly found that in the gaming market, very targeted display and email marketing can result in very healthy returns. Frank points out that blogging and community building can be a very clever and successful method of driving traffic to these sort of sites. One sector which wasn't covered is the pharmaceutical industry, where a very particular problem is that if you carry out reputation or blog monitoring and come across a user who has suffered side effects from a product, the company has a duty to respond. It's probably a lot more complicated than that, but it's something to consider if you move into these areas. I ask whether, in sectors like gaming, link buying isn't the only way to come out on top of major terms and, probably unsurprisingly, the panel all shake their heads. I can appreciate that it's an uncomfortable subject (and one which I've even argued receives too much attention), but think that it's a rather large elephant in this session room when discussing ways of ranking for such competitive phrases. Still, Maile was at the back of the room, and she probably talks to Matt! One of the audience asks some very specific questions related to the pharmaceutical industry and asks why there wasn't anyone talking about that particular sector. To be fair, the organisers are never going to be able to cover every single sector, and the panel does a pretty good job of trying to answer his questions. Frank points to the forums where there are lots of people with experience in these areas who are often more than happy to help. Session 4: My SEM Toolbox Whilst Rand had asked me to avoid a live-blogging approach to covering SES, I think that for a session like this, where it's essentially lists of really nifty hints and tips, it's unavoidable. Sorry Rand! The lovely Thomas Bindl, who Jane & I shared a panel with at SMX London, kicks off with some excellent tools that can be used for PPC campaigns: Google Sets - great for brainstorming as it suggests related terms Digital Point - keyword tool querying WordTracker & Overture (in multiple markets) SEO Book keyword generator - not only does this generate lists, it also allows you to include multi-variants and makes uploading into PPC campaigns much easier Google Hot Trends - shows you what people are searching for (or where in the past): perfect for planning seasonal campaigns. The one issue with this is that it's just US data. Refined labs keyword tool - this is one of Thomas' own. Google Trends - similar to Hot Trends, but shows graphs over time (whereas Hot Trends is for a specific point in time - it's also not tied to the US) Thomas then ran through some other tools to make it easier to analyse and improve PPC campaigns, but I just couldn't type fast enough. He's a nice guy though, so he may well send them to you if you drop him a line. I do manage to type down Spy Fu, which provides estimates on how much sites are spending on PPC, and who is bidding on particular terms; Googspy which provides a similar service (although in a less eye-catching manner); and finally keyCompete, which is another tool for monitoring PPC campaigns. Whilst many of these are primarily US-data at the moment,Thomas assures us that they're slowly adding new territories. Maxine from Trellian dispels my fears when he stands up and starts recommending tools other than his own. Bravo! First up is SE Spider, which allows you to 'view' a site as a crawler does. For those who want to take this further, he suggests using the text browser Lynx; it doesn't support Flash, tables, frames, or any the other things that cause spiders so much trouble and so can be very eye-opening. The second half of his presentation covers search related add-ons for Firefox: Web developer toolbar: by allowing you to turn off images, frames, etc., this also allows you to view a page as an engine does. It also allows you to view headers, outline frames, and lots of other great little tricks. Document map: this displays the outline of a page structure in your sidebar Live HTTP headers: again, what it says on the tin MetaTags: Displays all the meta tags for a site in the sidebar Google webmaster tools: you don't need me to explain this, do you? Trellian's Keyword Discovery & Competitive Intelligence: don't worry Maxine, the rest were so useful I don't begrudge you these! Bruce Clay starts off by getting the audience on his side by offering 60 days free access to the tools on his site. Nice. He then goes on to list the tools he rates (WordTracker, Keyword Discovery, Google's AdWords tool, and the tools on SEOBook), before suggesting that everyone tries out a keyword density analyser. Crazyegg is next in his list of recommendations, which can visualise where clicks occur on a page. Whilst it may not be immediately obvious how this relates to SEO, Bruce points out that knowing where people are clicking can help you minimise bounce rate. He then teases us with a demonstration of a tool that visualises what an engine is likely to assume are the key themes on your site. Next up are link-analysers, including one from the W3 bods and a reminder that the link: command in Google is essentially meaningless; it's much better to use Yahoo's Site Explorer. He doesn't bother listing any rank monitors as he argues that, with the coming of personalisation, social, & universal search, rank as we know it will not have the same meaning. He then touches on behavioural search (the ultimate extension of personalisation) whereby two people searching for java, one interested in coffee, the other in code, would receive entirely different results. With this in mind, Bruce suggests that we all get into analytics in order to prove the worth of our work to clients/employers, so I'm glad I went to the session on the first day now. Session 5: Brand & Reputation Management After the excellent information offered in the last few sessions, I have high hopes for the final session of SES London 2008. Nan Dawkins, from Serengeti Communications, starts off by showing some examples of how negative PR can appear in search results. She highlights this with the famous example of the fuss that Jeff Jarvis started with his Dell hell posts. However, she doesn't mention the very positive stuff they've done since. Many people will talk about how you can use SEO to push negative content down in the SERPs, but as Nan points out, there is more than one search engine nowadays. For instance, people might be posting negative videos on YouTube: are you going to try to get rid of them? At the end of the day, if people are complaining about your products or services, you probably need to fix the things that people are complaining about, and then utilise social media to promote the fact that you've responded to consumer opinion. If you are looking to find and act on consumer comment, Nan suggests three stages: Data retrieval - use tools such as Technorati feeds to scour the internet for mentions of you, your products, services, etc. Sorting & analysis - you'll need to work out whether mentions are positive, negative, or meaningless. Tools in this space include BuzzLogic, Andiamo, Sentiment Metrics, & CyberAlert. However, Nan suggests that the really useful ones are Nielsen Buzz Metrics, Cymfony, Umbria, Brand Intel, & Motive Quest (although their prices reflect this). Translating data into action - this bit's up to you; work out what the problems (if there are any) are and plan a campaign to deal with the underlying issues. When he opened the session, Lee joked that Andy was here to plug his book and his rep management tool. He admits this, but Andy's a nice bloke and he doesn't dwell on it for more than two minutes. He also suggests that everyone get into his line of work because as he writes about business reputations, he tend to get free stuff and upgrades all the time so that he doesn't use his evil powers on them. Andy offers really useful advice on the following: how to minimise reputation damage (make sure that you've got plenty of information on your own site so that people looking for this don't end up going somewhere less positive); how to find the right bloggers to talk to (check Technorati, look at who ranks in the SERPs, & who is getting quoted by the press); how to make contact with bloggers (don't just spam them, participate on their blogs, & don't use them and then ditch them) how to run a corporate blog (Scoble covered this off nicely quite a while back) Andy takes in a whole load of other things, but concludes by summarising his whole philosophy to three little words: Sincerity, Transparency, & Consistency Greg Jarboe is, surprisingly, the first person I've heard today to mention universal search. He does so in reference to the fact that the arrival of this new way of displaying the search results means that it's now easier than ever for negative content to rank highly in a very short space of time. He also demonstrates this theory by referring to the eye-tracking studies carried out by enquiro, which showed that in blended results, the images attract the eye, even if they sit in the 4th position. He uses examples ranging from Derek Conway and Societe General/Jerome Kerviel to Shell to show how SEOs could now be held responsible for PR disasters (they were ranking for disgraced tory, rogue trader, and obscene profits, respectively). Basically, I think the learning from all three speakers is that you really ought to be thinking about reputation, and even crisis, management; if you don't, it'll be too late to do anything by the time you need to. I have to say that, overall, SES London has been thoroughly enjoyable, with a large number of really useful and interesting sessions. From the truly inspiring keynote from Frederick yesterday, to the tactic-packed sessions this afternoon, there's been something for just about anyone in the industry. And with the last session done until next year, I'm off to buy the beers at LondonSEO. Cheers! Ciarán heads up the SEO & Social Media department at online marketing agency Altogether Digital. He's very glad that he's finally been able to sponsor LondonSEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Birthdays, Elephants, Tools, & Booze: SES London Day 3"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Birthdays, Elephants, Tools, & Booze: SES London Day 3"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}