{
  "url": "https://moz.com/blog/blabbing-with-jessica-bowman-ses-inhouse-seo-and-noob-advice",
  "slug": "blabbing-with-jessica-bowman-ses-inhouse-seo-and-noob-advice",
  "title": "Blabbing with Jessica Bowman: SES, In-House SEO, and Noob Advice - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Before SES San Jose I interviewed Chris Winfield about the panel he was speaking on, social media, and other fun stuff. With SES Chicago just around the corner (December 8-12), I had the opportunity to interview another ...",
  "content": "Blabbing with Jessica Bowman: SES, In-House SEO, and Noob Advice Public Relations By: Rebecca Kelley December 4, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley December 4, 2008 Blabbing with Jessica Bowman: SES, In-House SEO, and Noob Advice Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Before SES San Jose I interviewed Chris Winfield about the panel he was speaking on, social media, and other fun stuff. With SES Chicago just around the corner (December 8-12), I had the opportunity to interview another SES speaker, Jessica Bowman. Not only is Jessica a great colleague and friend of SEOmoz, she's also very knowledgeable about SEO and has been a recognized name (and smile) in the industry for quite some time. She's presenting on in-house SEO next week, so I peppered her with various questions about agencies, conferences, and, of course, her desert island essentials. Enjoy! Jessica Bowman (pictured left) along with (l-r) Laura Lippay, Dafina Curtis, Lauren Vaccarello, Kim Krause Berg, your favorite blogger, and Danielle Winfield 1. Tell us a little about yourself: what sort of work you do, where you blog, all that good stuff. Until this year I have always been an in-house SEO, building in-house SEO programs at Yahoo!, Enterprise Rent-A-Car and Business.com. In mid-2008 I started SEOinhouse.com, a company dedicated to helping in-house SEOs get further faster, by not reinventing the wheel. I help companies implement SEO quickly and smoothly, through SEO consulting for in-house SEOs and building in-house SEO programs. I find there is a right approach to in-house SEO, and there's a long approach to in-house SEO because you are trying things out and aren't aware of what lies on the road ahead. Eventually you'll get to the same spot, but we can get there faster with a higher ROI and less frustration. I blog at SEMinhouse.com. 2. How did you get involved in the SEO/SEM industry? Like many search marketers, I fell into it. I was working at Enterprise Rent-A-Car and my position as a project manager was dissolved. I was interviewing for other positions in the company and during my free time went around looking for work. Someone said, \"We want to get into search engines, I think it's called search engine marketing.\" With that, I went away for 2 weeks and emerged with a 20 page document (my first SEO audit) that explained SEO, identified what we were doing right, what we were doing wrong and what we needed to fix. They asked if it was enough for a full-time position -- it was because it was enough work to keep us busy for 2 years. The rest, as they say, is history. 3. What's something you love and hate about the SEO industry? I love that there is always something new, which means there are constantly new opportunities to explore and maximize. I hate that it takes so much time to keep up with it all! It's a struggle to balance the workload and find the new innovative things in the media amidst all of the SEO content being written these days. 4. Do you run into any barriers being a woman in a typically male-centric industry? Surprisingly, no. There are a few male-only conversations or \"guys' nights,\" but the ladies have the same so it all balances out. As an in-house SEO I saw no more than you see at any large corporation. When I started out in search marketing my biggest barrier was youth, rather than the fact that I was female. 5. You're speaking at SES Chicago about \"In-House: Lessons Learned & Victories Won.\" What sort of struggles does an in-house marketer face that's unique or different than an agency? Where to begin! This is a novel unto itself. When you're at an agency you're expected to provide innovative ideas and a thorough list of what needs changed. When you're in-house you're the one who has to create that AND figure out how to pull it off amidst the opposition, politics and higher priorities. Some in-house SEOs are better than many of the consultants I've seen, yet they struggle to gain support and buy-in from people in the company. Many in-house SEOs recognize that they need to bring in a consultant to help sell ideas. In fact, a lot of my training and speaking engagements start off with a \"What do you need them to do and what is the opposition?\" discussion that guides the direction of everything that follows. 6. Are there specific pros and cons to working in-house vs. at an agency level? Most definitely there are pros and cons. When you're at an agency you're expected to really think outside the box and get credit for doing it. When you're in-house you have to reign yourself in or risk gaining the perception of always having wild ideas that can't be implemented in your organization. I find working at an agency a lot less stressful because you tell the client what they need to do and they have to figure out how to pull it off. I equip clients with many ideas and recommendations for doing that, but at the end of the day there is only so much the agency can do to help make that happen, unless we're coming in on-site and building rapport with the key players. On the flip-side, being in-house is very rewarding because the rankings and traffic growth are the result of your hard work and people in the company see that. If you play your cards right, SEO can be an extraordinarily visible position within the company - I've worked on projects for and presented to the COO, in-house corporate attorneys, CIO, etc. An agency can try to get this visibility, but when you're in-house you can definitely make it happen. 7. How do you think search will evolve in the next couple years in terms of awareness and in-house adoption by various companies? Especially in the rough economy, I anticipate more awareness for SEO and interest in investing SEO initiatives. We're going to see executives looking more at the analytics in the way they do for PPC and expect it for SEO. I was on the phone with a recruiter the other day who was looking for an analytics driven SEO, indicating it's already starting. (BTW...it's currently still available: a Director level in-house SEO position in San Francisco. Let me know if you're interested!) We're going to see more companies bring search marketing in-house, especially SEO, and particularly at big brands. Unfortunately, many of these companies will unknowingly hire the wrong talent, because what makes a successful in-house SEO is extremely different than what makes a successful agency SEO. 8. What search tip or tactic do you think will become obsolete in the next year or so? I hope the paid links in a list making up a \"sponsored sites\" section become obsolete. We know they can create issues, but so many people don't and get themselves into trouble. I'm hoping these become a thing of the past quickly. Truthfully, I think most of the SEO tactics will still be important, depending on the site. Just when I think a tactic is becoming a thing of the past, I run into a scenario where it's a solution that works really well and this tiny change can generate millions of dollars. 9. What do you think is the most overrated piece of SEO advice, and why? Similar to above, just when I think a tactic may be overrated, I find a company or scenario where it makes complete sense. I believe PageRank is overrated. It's important in some scenarios but people get hung up on their current PageRank, despite it being several months old - it can be insightful, but I think companies waste a lot of time and money dwelling on it. Now a replacement for that might be mozRank, which reflects more up to date data. ;) You guys did a great job with that tool [Linkscape]- we as an industry needed it. 10. What have been your favorite and least favorite panels you've spoken on, and why? My favorite panel was at SES Chicago a few years ago, I can't even remember what it was called, but I do remember it was about in-house SEO and building the expertise within your organization. Jeffrey Rohrs moderated and it was the first and only time I have ever seen the entire room productively involved in a single conversation - the audience contributed great ideas along with the panelists, and it wasn't your typical Question-and-Answer. My least favorite panels are about reputation management. For me the topic is tough because executing reputation management campaigns and digging up the material for a presentation is draining because it's all extremely negative. Years ago I was doing reputation management in-house and remember talking to the attorney about how draining we found it. But, it's got to be done because there are a lot of good companies in need of great advice on the topic. 11. In your opinion, what is the formula for a perfect search conference? Plenty of opportunities to meet new people, a great place at the hotel for people to congregate (part of why SES Chicago is my favorite SES conference), parties with standing room only so you're forced to talk to everyone you pass, sessions that start at 10 am and, most importantly, never-seen-before content. 12. What is one piece of advice you can give someone who has just started out in the SEO world? Get facilitated SEO training, whether it be an in-house SEO training that someone creates for your company, a training class that walks you through SEO 101 in a logical fashion, or SEO certification programs such as those offered by SEMPO and Market Motive. There is so much information out there right now that it's a challenge to get the big-picture understanding and list of action items in the same fashion as a structured training class. Once you have the basics down, you'll get even more value out of the conference sessions and articles that look at one single aspect of search marketing from many different angles. 13. What are some of your non-SEO hobbies? There's life beyond SEO??? :) I love to travel internationally and see how people live - the culture, customs and history. I once went to rural Russia and saw life in a way that I have never imagined - the heat and hot water shut off one day each week, even in the winter - that was in 2005 and I had a couple of unexpectedly cold days. I also dig museums -- French Impressionism is my favorite and the Musée de l’Orangerie in Paris is on my bucket list. 14. If you were stuck on an island with one DVD, one meal, one CD, and one website, what would they be? What a question - almost a trick question. For the website, my initial thought was Google, but then I couldn't access the information on the websites. Instead I'm thinking Google Books or Amazon, because I could access an entire library of anything I could ever need to know! For a DVD, it would have to be a custom made DVD with as many episodes of Are You Being Served? as possible (It's a BBC comedy from the 70's). One meal, wow, only one - it better be filling! One CD - again, it would have to be a custom CD, with the best-of-the-best, including 2 of my favs: That's Amore and Circle of Life from the Lion King - who can't smile with these two songs? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blabbing with Jessica Bowman: SES, In-House SEO, and Noob Advice"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Blabbing with Jessica Bowman: SES, In-House SEO, and Noob Advice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}