{
  "url": "https://moz.com/blog/black-hats-hiring",
  "slug": "black-hats-hiring",
  "title": "Black Hats Hiring - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's an opening for a \"Black Hat\" position with a company in Toronto, ON. It looks like they're desperate, as they've opened the position to candidates worldwide. Incubator has opened a thread at SEW on the subject and is requesting e-mails go to waynec_at_yellowmediainc.com. I'm not sure if…",
  "content": "Black Hats Hiring Public Relations By: Rand Fishkin August 2, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 2, 2005 Black Hats Hiring Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's an opening for a \"Black Hat\" position with a company in Toronto, ON. It looks like they're desperate, as they've opened the position to candidates worldwide. Incubator has opened a thread at SEW on the subject and is requesting e-mails go to waynec_at_yellowmediainc.com. I'm not sure if any of my readers lean that way, but it's certainly interesting to see job requests for this type of work - it clearly is profitable. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Black Hats Hiring"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Black Hats Hiring"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}