{
  "url": "https://moz.com/blog/blacklinking-part-ii",
  "slug": "blacklinking-part-ii",
  "title": "BlackLinking Part II - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "And here we go, diving into the other half of it!  So, let's get cracking...Question Six: What are the top 3 over-rated and under-rated criteria for determining how valuable an individual link will potentially be to your site’s search engine rankings? Over-rated - PR, location in a site, and the…",
  "content": "BlackLinking Part II Link Building By: Pete Watson-Wailes March 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pete Watson-Wailes March 19, 2007 BlackLinking Part II Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. And here we go, diving into the other half of it! So, let's get cracking... Question Six: What are the top 3 overrated and underrated criteria for determining how valuable an individual link will potentially be to your site’s search engine rankings? Overrated: PR, location in a site, and the content it's on. Underrated: Where it's coming from. Quality people, quality. When it's coming in. Spread out your campaign over time. Anchor text. For crying out loud, vary the damn thing. Otherwise it looks spammy. Question Seven: If you were in control of the search engine algorithm at Google, what are the top three changes you would make specific to how Google values/counts links? I'd discount any link from any social media site - MySpace, YouTube, Digg, Reddit, etc. They're too easy to game and to inflate. Trackbacks would all be discounted. Again, relatively simple to game, and thus black-hattable. Give more weight to links that have been pointing from one site to another for a long time (LinkTrust). Yes, I'm well aware that the these would counter black hat techniques. And that I'm supposed to be pointing out a black hat view here. But that's what I'd like to see. If you'd like to see a non-ethical view, reverse the above. Question Eight: What’s the most common mistake you see people making in their link building activities? Going after links from anywhere and everywhere, regardless of the site's theme, age, content, or anything else. Closely followed by not taking breaks to see how much of what is doing what. Track everything people, and see what different links are doing to your sites. Oh, and not spamming enough! :) Question Nine: How do you think that nofollow links and redirected links are treated by the various search engines and do you see any value in obtaining these types of links? I think they go to the site, and take the theme, but don't give it any weight. So if I'm linking to a site, the spider goes to that site and applies its normal logic about seeing theme, age, trust, PR... all that stuff. But it doesn't credit the link with anything. Nothing black hat to say about that, really. Question Ten: So many people complain about competitors who are ranking solely on reciprocal links. Do you believe reciprocal links still works as a complete strategy or do you believe age, trust and grandfathering (for lack of a better word) are taken into account? How important do you feel age is to a link? Depends. If you've got only reciprocal links, but they're from the BBC, Reuters, CNN, New York Times, Yahoo! and MSN, I'm guessing you'll do pretty ruddy well for news/current affairs terms. On the other hand, if you've got a thousand links from low power sites, it may well be a thousand, but someone with ten REALLY top quality links will still monster you. I'd say reciprocal links aren't dead; after all, a link is a link is a link. But as a spamming method? No, I wouldn't bother. Go after on topic links. Get better links. And rank that way. Rank for relevance. Always ask yourself, \"If I came across this link, and clicked on it, would I be happy?\" Whether you're spamming or not, you don't want to piss off your traffic. Go for relevancy. Anyway, I hope this and my other post have given you a little insight into how a black hat thinks. And maybe even some more ideas for white hat. After all, knowledge is power. So know everything you can. Any comments/thoughts are, of course, welcome :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "BlackLinking Part II"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "BlackLinking Part II"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pete Watson-Wailes\n          \n            Pete Watson-Wailes"
}