{
  "url": "https://moz.com/blog/black-or-white-seo",
  "slug": "black-or-white-seo",
  "title": "Black or White SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I will be frank here.I am quite new to SEO, optimization, web design and site creation, etc. I have a few of my own sites and I am working hard on them using the best optimization tools available. But I can see some trends here already.I have a few friends that use black seo like doorways,…",
  "content": "Black or White SEO? Blogging By: WelcomeDay December 26, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: WelcomeDay December 26, 2007 Black or White SEO? Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I will be frank here. I am quite new to SEO, optimization, web design and site creation, etc. I have a few of my own sites and I am working hard on them using the best optimization tools available. But I can see some trends here already. I have a few friends that use black SEO tactics like doorways, cloaking, you name them... They can easily make over $10,000/month with a 2 month old site and then they start another one because they are banned by search engines. So, they start it all over again and again using the same techniques...and make money. Some of my sites are over a year old. Original content only. And I use white SEO only. Most of them suck. Yes, I get some search engine traffic but my sites make me just $10-15 per month. See the difference? I know many of you will say that legal tactics work better in the long run. But how long? A year, two years? More? What are the quickest ways of getting your way through to the top? Which ones would you prefer - the ones that make you money right away or the ones that will bring you some pennies don't-know-when? I understand that some of you will advise to try both... This honorable SEOmoz site stands for white SEO, I know. Which one would YOU choose if you couldn't choose both, but rather just one of them? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Black or White SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Black or White SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "WelcomeDay\n          \n            WelcomeDay"
}