{
  "url": "https://moz.com/blog/blinking",
  "slug": "blinking",
  "title": "Blinking (Blogging + Linking) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the Mozzers delectation I am proud to present my inaugural post:  Blinking   That’s right, Blinking; a beautiful medley of blogging and linking. I run two ecommerce websites and this is a technique I’ve been trying out to build juicy links to the homepages. So far this will only work for sites…",
  "content": "Blinking (Blogging + Linking) Link Building By: Stuart P Turner August 27, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Stuart P Turner August 27, 2008 Blinking (Blogging + Linking) Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For the Mozzers' delectation I am proud to present my inaugural post: Blinking That’s right, Blinking -- a beautiful medley of blogging and linking. I run two e-commerce websites and this is a technique I’ve been trying out to build juicy links to the homepages. So far this will only work for sites that do not export their products overseas, although there may well be other ways to apply it. So, you will need: Ingredients 1 x Ecommerce website 1 x Blog (or more) Recipe Let’s take as an example an e-commerce website that sells cuddly toys: www.fuzzysnugglebear.co.uk. You've got a blog on your site at www.fuzzysnugglebear.co.uk/blog/. Some of the best sites to get links from are other ecommerce sites selling fuzzy snug -- I mean cuddly toys, but it is notoriously difficult to get one of your competitors to link to you when you are both trying to make money from the same products. In an attempt to avoid direct competition and promote international friendship amongst businesses, I decided to have a go at some mutual promotion. I searched other Googles (starting with .com) for my primary keyphrase, which for my imaginary site would be ‘buy cuddly toys’, and compiled a list of juicy ecommerce sites to contact. I then sent them an email along these lines: \"Dear Sir/Madam, My name is Fozzy Bear and I run a website, www.fuzysnugglebear.co.uk, selling cuddly toys in the UK. I came across you site whilst looking for cuddly toy suppliers in America. We have a blog on our site, which we are hoping to build into a comprehensive cuddly toy resource for both our customers in the UK and international visitors. We do not export cuddly toys overseas, so it would be beneficial to point any American visitors in the right direction! As such, I would like to write a post about your site and company; covering the products you offer, location, what area you deal in (or any information you feel is of interest), and add a link to your site from our blog. In exchange I only request a link back to www.fuzzysnugglebear.co.uk in return to help support us over in the UK! F Bear Managing Director Fuzzy Snuggle Bear Ltd” You can vary the email as much as you like, but the key thing is to make sure it does not sound like one of the millions of spammy link emails we all get (as noted in Rand’s recent post on SEO ignorance). You can then repeat this process, tailoring it to each country-specific Google, and if you have time, tailoring your email to each site you contact. In my opinion, the more generic your email sounds, the more likely it is to be deleted before even being read. As Fuzzy Snuggle Bear does receive a significant amount of US visitors, this will be of interest to some sites. Even if your site doesn’t receive a lot of visits from the country you are targeting, you can just push the fact that you are a cuddly toy geek – no lying or black hattery required! In an ideal world they will then link to www.fuzzysnugglebear.co.uk from their homepage, and you add your post/link to the blog at www.fuzzysnugglebear.co.uk/blog. What’s more realistic is that you will get a link from their links page to your homepage, and they get one from your blog to theirs. Key Benefits (1) You get an ethical juicy link, by giving something back <warm feeling inside> (2) The more relevant, varied content you get on your blog, the more valuable it will become in Google's eyes. This in turn aids your site, and you can always 301 this blog at a later date to your homepage. (3) While it may seem you are giving away more than you get, once you get someone interested you can more often than not negotiate where you want your link to go and what your anchor text will be. As you genuinely are promoting someone’s site, they tend to be much more receptive than to the ‘Hi can you add these links kthanksbye’ approach. Multiple Blogs A further development (or Super Secret Phase 2) is to set up multiple blogs (ideally on other domains you own) that are dedicated to one particular type of cuddly toy. You can then adopt a similar email campaign to that one, building up links for that particular product. Once you’ve got a good amount of link juice to your bear blog, you can then 301 to your product page and help build the strength of some inner pages. This will also help you out with the homepage. This is by no means a groundbreaking foolproof strategy, but it’s shown promise so far. It’s a simple but effective combination – like a warm scone and a cuppa tea. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blinking (Blogging + Linking)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Blinking (Blogging + Linking)"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stuart P Turner\n          \n            Stuart P Turner"
}