{
  "url": "https://moz.com/blog/blog-design-for-seo",
  "slug": "blog-design-for-seo",
  "title": "Blog Design for Killer SEO - Infographic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Before SEOmoz was a business, it was a blog. In fact, blogging is at the heart of everything this company stands for. A blog is so much more than pageview generator. It speaks in your voice, provides a gateway to your community, acts as your moral center and facilitates communication with the rest…",
  "content": "Blog Design for Killer SEO - Infographic Content Marketing By: Cyrus Shepard July 12, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard July 12, 2011 Blog Design for Killer SEO - Infographic Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Before Moz was a business, it was a blog. In fact, blogging is at the heart of everything this company stands for. A blog is so much more than a pageview generator. It speaks in your voice, provides a gateway to your community, acts as your moral center and facilitates communication with the rest of the world. And done right, it's an unbeatable marketing tool. As Blogpulse reports over 165 million identified blogs on the internet, it's safe to say that very few are \"done right.\" I asked my wife, a talented graphic designer, if she would help me develop my personal blog. Her effort developed into this infographic combining SEO and blog design. You probably know someone with a blog who can benefit from this information. Bookmark it and use it as a reference. It presents classic fundamentals as well as tips based on cutting edge research. 1. Beauty Counts With all due respect to Arngren.net, the overall design of your site is the first thing visitors see and it significantly influences bounce rate, pageviews and conversions. People who get scared by the idea of professional design often pay the price with a fast, cheap and mass-produced layout. Professional design doesn’t have to include the word expensive. For a \"trifecta\" of quality inexpensive design, I often use the following: A professional template from ThemeForrest. Price: $10-35 Contract a logo from 99designs. Price: $295 Customize your colors with ideas from Adobe’s Kuler. Price: Free Whatever design resource you choose, the goal is to set yourself apart while enticing your visitors to stay. 2. Search Box It should go without saying that every site needs a prominent search box. Not only does it provide a better experience for your visitors, but you can also mine the data for keyword discovery and user behavior. Your search box can be the most valuable element of your layout. Most blogging platforms come pre-equipped with a search box function. Google Custom Search is a stellar option used by SEOmoz. 3. RSS is Alive Every time a major website kills off its RSS feed, the blogosphere writes its obituary. In truth, adoption of RSS feeds has expanded every year, as shown by these surprising statistics from BuiltWith.com. RSS feeds not only encourage repeat visits, but the visitors are likely your best converters, brand evangelists, and self-motivated link builders. 4. Breadcrumbs Maybe because we call them “crumbs,” people forget how important they are. Breadcrumbs perform several essential functions including: Helping users to navigate Helping Search Engines to Categorize Content Increasing Crawling and Indexation If you're stuck for breadcrumb ideas that don't suck, check out these ideas for inspiration.. 5. Navigation Many development meetings and major wars have been fought over the “right” way to structure a website’s information architecture through navigation. Solve the problem by keeping it simple with these two basic rules for useful and optimized navigation. Strive for a flat site architecture by minimizing the number of “clicks” it takes to reach your content. Remember that almost any dropdown or flyout navigation requiring JavaScript or other complex programming can be substituted with a simple CSS substitution. Check out Stu Nicholls huge list of CSS navigation menus for inspiration. Although Google has gotten better at crawling Javascript links, classic HTML/CSS links work most consistently for both users and passing link juice. 6. Images One of the things I’ve noticed about the recent Google Panda updates is that many of the sites hardest hit contain tons of auto-generated content that lack unique images. Think EzineArticles or consider this screenshot from wiseGeek about Red Pandas. The stock image on the left appears on several other pages across the site, isn’t contained within the main body of text, isn’t topical and contains no alt text. Danny Dover made a great video worth checking out about optimizing images. The best thing you can do is include rich media every chance you get. 7. Keep It Above the Fold StatCounter Global Stats reports that the average browser height is 768 pixels. By placing your best content above this line, you ensure visitors see it without scrolling and increase the chance that search engines will crawl both your content and links. We’ve seen evidence that Google places less emphasis on content further down the page and sometimes seems to ignore it altogether. Test whether content falls above the 768 pixel height using this this tool from The Web Showroom. 8. Link to Your Best Content Take a look at any given page on Wikipedia. Although I wouldn’t recommend going to this extreme, Wikipedia is master of internal linking. Too often people write brilliant blog posts, then fail to ever link to it again. Eventually the post falls out of visibility as it becomes lost in a backlog of archives. The best practice is to place links within the body of your text when it is relevant and helpful to the reader. Other, somewhat less effective ways to link to your best content include: Popular Posts Widgets Tag Clouds Category Pages 9. Don’t Overdo Links Links may be good, but too many dilute link juice and may cause crawling issues. Without sufficient PageRank, Google only crawls so many links per page. How many is too many? It varies, but 100 is a good rule of thumb as explained here by Dr. Pete. If you do have a lot of links, place your important ones in the body of text. These carry more weight, and search engines may devalue links found in the header, sidebar and footer. 10. Watch Your Ad Space One of the most interesting findings from the 2011 Ranking Factors was the negative correlation between rankings and Google AdSense metrics. This in itself isn’t proof that ad spaces hurt your rankings, but couple this with the fact that a large number of sites hit by the recent Google Panda updates contained a large number of prominent ads above the fold, and you begin to see the damaging potential if overdone. Including ads on your blog is fine and even encouraged as the most legitimate way to monetize your content. Regardless, don’t let ads overshadow your original content in either placement or raw pixel area. 11. Encourage Comments At SEOmoz, we love comments! They provide one of the best, most prolific forms of UGC (User Generated Content) that we know of. Content generated by comments not only helps you to rank for long tail keyword traffic, but websites with lots of user interaction tend to perform better with search engines. A blog without comments is just plain lonely and sad. 12. Sharing for Everyone The statistics are staggering. Mark Zuckerberg recently announced that Facebook users share 4 billion pieces of digital content everyday on Facebook. This includes photos, videos, blog posts and news stories. Sharing now produces 10% of all Internet traffic. While way behind search, this number continues to grow. New services like Google+ only add to the mix. Test different locations on your blog to find where sharing buttons make the most sense. Don’t neglect them as the landscape changes fast. 13. Test for Speed There’s nothing worse than a blog that loads agonizingly slow. A recent study by Geoff Kenyon showed average page load speed to be 2.9 seconds and his findings appear right on the money. Page load times not only affect user experience, but slow sites can see a rankings dip as well. Watch this video to see how Wikipedia loads compared to Amazon. Can your site beat these times? Created by Webpagetest.org Unless you have the Domain Authority of Amazon, take steps to optimize your site for speed. 14. Crawl and Validate Once your site is built, you’ll be amazed at how many errors lurk unseen beneath the surface. “No matter how perfect you or your developers are, there’s always problems at launch – broken links, improper redirects, missing titles, pages lacking rel=canonical tags… files blocked by robots.txt, etc.” -Rand Fishkin from Launching a New Website Use free tools like Xenu’s Link Sleuth or paid applications like the SEOmoz Web App to check for common SEO problems. Be sure to test your site in different browsers using services such as the Adobe Browser Lab or Browser Shots. 15. Pick a Powerhouse Platform You’ll find a lot of these tips will be a lot easier to implement by choosing the blogging software and platform most appropriate to your needs. While services such as Blogger and Blogspot have fallen out of fashion, other platforms are constantly innovating. Some of our most reliable and recommended include: WordPress Posterous Tumblr The infographic above contains a complete list of recommended platforms, along with the domain authority of each one. Nothing in the world beats the satisfaction of a successful blog. These are only a few of the more important ways to optimize your platform and experience. Feel free to share your best tips in the comments below and let’s get blogging! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blog Design for Killer SEO - Infographic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Blog Design for Killer SEO - Infographic"
    },
    {
      "level": "H2",
      "text": "1. Beauty Counts"
    },
    {
      "level": "H2",
      "text": "2. Search Box"
    },
    {
      "level": "H2",
      "text": "3. RSS is Alive"
    },
    {
      "level": "H2",
      "text": "4. Breadcrumbs"
    },
    {
      "level": "H2",
      "text": "5. Navigation"
    },
    {
      "level": "H2",
      "text": "6. Images"
    },
    {
      "level": "H2",
      "text": "7. Keep It Above the Fold"
    },
    {
      "level": "H2",
      "text": "8. Link to Your Best Content"
    },
    {
      "level": "H2",
      "text": "9. Don’t Overdo Links"
    },
    {
      "level": "H2",
      "text": "10. Watch Your Ad Space"
    },
    {
      "level": "H2",
      "text": "11. Encourage Comments"
    },
    {
      "level": "H2",
      "text": "12. Sharing for Everyone"
    },
    {
      "level": "H2",
      "text": "13. Test for Speed"
    },
    {
      "level": "H2",
      "text": "14. Crawl and Validate"
    },
    {
      "level": "H2",
      "text": "15. Pick a Powerhouse Platform"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}