{
  "url": "https://moz.com/blog/blog-for-organic-search-conversion-funnel",
  "slug": "blog-for-organic-search-conversion-funnel",
  "title": "How to Align Your Blog with Your Organic Search Conversion Funnel - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How to Align Your Blog with Your Organic Search Conversion Funnel",
  "content": "How to Align Your Blog with Your Organic Search Conversion Funnel Blogging | Content Marketing By: Ann Smarty January 16, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ann Smarty January 16, 2023 How to Align Your Blog with Your Organic Search Conversion Funnel Blogging | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Business blogging is an interesting concept. Many businesses have a blog, and yet, in most cases, there isn’t much planning going into how those blogs fit into larger business goals. Someone on the team is just assigned to publish content regularly, and that’s what they do. A business blog is usually an island within a company: There’s likely, not much measuring, so no one has any idea if it is generating any traffic, sales, or rankings. And yet, despite a lack of planning or measuring, there may be some good traffic coming. Blogging is a good way to achieve “aссidental rankings” (those you didn’t necessarily plan for) and discover more search-driven sales channels. But many business owners or marketing managers have no idea what their blogs are ranking for. Consequently, there’s no buying journey set up for someone who lands on a blog post. Clicks may come, but a blog remains an island. So, how can you include your blog in your overall marketing strategy to convert those clicks? Step 1: Identify your blog’s current rankings that may bring sales In other words, let’s see if there’s anything to worry about in the first place. Normally, the good old 20/80 rule works for blogs as well: About 20% of your content will be bringing 80% of your traffic. So, you need to know what 20% of your blog content actually does bring traffic. Here’s a quick way to do that in Google’s Search Console: Navigate Performance > Create a filter to see all the pages that contain “blog” (or whatever domain or subdomain you have your blog at) and click on the “Pages” tab.The list is going to be sorted by the number of clicks your blog is driving. Don’t forget to use Moz Pro’s rank tracker to set up position monitoring of those pages that are driving organic traffic. Step 2: Plan your buying journeys from your blog Make sure your blog makes it clear that this is a business blog and you are selling something. Define the major conversion funnels for your readers to follow. At the very least, there should be a site-wide call to action (CTA) inviting readers to check your product or products, but the best idea is to create contextual CTAs and lead generation forms, which could better align with the searchers’ intent. Hubspot is a great example of contextual CTAs that differ in each article and engage readers by providing “upgrades” to the article content: There are many more content-based B2B lead generation strategies, but contextual CTAs work in e-commerce and retail as well. HomeDepot is another prime example of including contextual CTAs (and automating them). They always show related products right next to each of their guides. Not only are these products actually helpful for following the tutorial and solving the searcher’s problem, they also create the right expectation that this content has a business behind it: Look at your blog and open any individual article. Do you offer readers ways from that blog to follow the sales funnel? You may also want to set up a heat-map and button click tracking to better understand what your blog readers interact with on your blog post. Step 3: Revive lost rankings An important reminder: Blogs inevitably lose rankings. The essence of any blog is that the more content you add, the further your older content is moving down the archive, away from the home page. And gradually, but inevitably, that content is going to lose rankings. Thus, checking your blog’s traffic and rankings should be done regularly because blogs tend to lose rankings over time. You can do that using the same tools. Search Console has a “Compare” option allowing you to see pages losing clicks… Click the “Click difference” header twice to sort by pages that lost the most clicks. You can only go as far as 16 months back, though. And again, once you set up tracking, the Moz Pro rank tracker will tell you exactly which keywords are losing rankings. You can compare your current positions to what you had when we first started recording any particular keyword. So now that you have a list of articles that are losing rankings, what to do with those? Is this something that can be saved? First of all, figure out if this is something worth saving. There will always be rankings that you can just let go of. These include old news or press releases, articles that stand no chance of converting readers into buyers, expired product reviews or listicles, etc. Update the content If it looks like a page that is ranked for something with transactional potential, think about whether you should update that content to align it better to those keywords as well as relevant contextual CTAs. Maybe there’s a new video you created after writing that article, so now you can add it there. Also, study your organic competitors to see where they might be better. You can use IMN’s Side-by-Side Tool to see the content of pages that gained rankings that you lost. The tool will compare various important on-page elements like titles, subheadings, keyword usage, etc. This will give you lots of clues about what needs to be expanded, added to, and improved. SE Ranking on-page SEO checker is another great tool to see where your content needs to be updated and optimized better based on your competitor research: Using SEO change monitoring, you can also be on top of your competitors’ content updates so that you can timely update yours and avoid losing rankings. WebCEO is another cool tool that analyzes around 30 competing URLs for your target search queries and suggests what needs to be added for your content to catch up with your competitors: I’ve also done a very detailed guide on identifying and refreshing your old content with many more tips and tricks, and here are even more tips on conducting a content audit. Next, republish your refreshed content with a new date to push that article back to the top of your blog’s archive. For seasonal content, it’s especially important to time those content updates with the upcoming holiday or season. Depending on those keywords (i.e. their relevancy and search volume), you may want to make that page more evergreen and prevent it from ever getting lost in your blog’s archives. Internal linking is one way to do that. You can link to that page from relevant static landing pages that always remain at the same level in the site structure. Or include static site-wide or blog-wide “Featured guides'' sections linking to those important blog posts. Here’s an example of a product category page linking to related guides: Not only do these links help buyers make more informed decisions, they also help those linked guides maintain more consistent and long-term rankings. What if your blog has no traffic at all? But there’s another possibility, a bigger and broader one that probably deserves a separate discussion: What if your blog doesn’t rank at all, and there’s no organic traffic to convert? Sometimes those unexpected rankings never come, so what can you do? Ask yourself why you have a blog in the first place and what you’d like to achieve with it. Is it sales? Then research your keywords and create effective contextual CTAs. If it’s links and connections? Then research journalists in your niche and what they are interested in, to better create content for successful outreach. Researching your keywords and aligning your content to your goals is a huge topic, which is covered in-depth in Moz’s Keyword Research Master Guide, so start there. Make your blog part of your whole company The above steps help you revive and improve your blog’s rankings and utilize those clicks better. But without solving an underlying issue, you won’t see your blogging strategy succeed in the long run. You need to integrate blogging into your company’s life and marketing strategy. Let your whole company submit content ideas for your blog, encourage everyone to share those articles that go live, and invite your current employees to write articles and create graphics for your blog. Make sure your blog writers talk to your customer support and sales teams because those talk to your actual customers, so they will have a lot of insight into what those people are struggling with and how to help them. Give your blog writers access to your CRM to be able to assign certain clients’ questions and interactions to them as content ideas. Keep an eye on your blog’s metrics and share important milestones with your company. A blog can make a big difference to your company’s bottom line, but only if you are taking it seriously. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Align Your Blog with Your Organic Search Conversion Funnel"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Align Your Blog with Your Organic Search Conversion Funnel"
    },
    {
      "level": "H2",
      "text": "Step 1: Identify your blog’s current rankings that may bring sales"
    },
    {
      "level": "H2",
      "text": "Step 2: Plan your buying journeys from your blog"
    },
    {
      "level": "H2",
      "text": "Step 3: Revive lost rankings"
    },
    {
      "level": "H3",
      "text": "Is this something that can be saved?"
    },
    {
      "level": "H3",
      "text": "Update the content"
    },
    {
      "level": "H2",
      "text": "What if your blog has no traffic at all?"
    },
    {
      "level": "H2",
      "text": "Make your blog part of your whole company"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    }
  ],
  "author": "Ann Smarty\n          \n            Ann Smarty\n          \n            Ann Smarty"
}