{
  "url": "https://moz.com/blog/bloggers-acquisitions-how-to-finance-and-partner-with-an-existing-blog",
  "slug": "bloggers-acquisitions-how-to-finance-and-partner-with-an-existing-blog",
  "title": "Bloggers & Acquisitions: How to Finance and Partner with an Existing Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Purchasing or financing a blog can be a huge help in establishing and growing your brand. John-Henry Scherck outlines how to purchase a blog and how to follow through to make it a success for both your brand and the blogger.",
  "content": "Bloggers & Acquisitions: How to Finance and Partner with an Existing Blog Blogging By: John-Henry Scherck October 29, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John-Henry Scherck October 29, 2012 Bloggers & Acquisitions: How to Finance and Partner with an Existing Blog Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few months ago, Rand Fishkin wrote a post about the benefits of buying a blog. It's a tactic I have become a big fan of - it's effective, efficient, and scalable. By purchasing/financing a blog you can work hand-in-hand with an established site that already has an engaged readership and a social following. One thing to keep in mind, the end goal here isn't links. Do you get links? Sure! You get a ton! But this isn't a tactic to pump a contextually relevant blog full of anchor text links. This is a blueprint to align your site with an established publication, partner on content, and build your brand. This is a strategy to grow a business, not just a back link profile. Prospecting (Credit: Flickr user ToOliver2) Target a niche blog that pertains to your vertical - It's best to target a site that is about one very specific subject that pertains to your money site. If I was working on a site that sold beer brewing kits, I wouldn't go for a general beer blog. I would prospect for blogs that cover a specific aspect of beer, like home brew recipes or rare beers. (Credit: Flickr user Tim Patterson) Every site ranking for \"beer blog\" or other generic head terms that pertain to your industry is going to get hammered by link requests on a regular basis. When you target something niche, you are going to cut down on the amount of link requests they receive, and they may be more open to talking with you. I like to target sites that cover my secondary and long tail keywords. (Credit: Flickr user Tax Credits) Look for a blog that is not monetized - There is no point in trying to purchase a blog from someone who is guest posting, doing product reviews, and hosting giveaways several times a day. When prospecting, find a site that publishes a lot of original content for the sole purpose of benefiting their readership and sharing a unique perspective. Target a site with one writer - During the acquisition process, it will be easier to sell a single person on the idea of financing their blog. Also, managing workflow, deadlines, and payment is much easier with one person as opposed to a group of writers. Research the prospect with a microscope - If it's a serious prospect, I will read through the last four weeks of their blog and then do the following searches site:blogimresearching.com AND [client name] site:blogimresearching.com AND [head keyword] OR [secondary keywords] site:blogimresearching,com AND [CEOs name] OR [spokesperson name] I look for any inclination that the blogger has been exposed to the brand before. How do they feel about the industry and your client's executive officers? I read the posts for tone, which I admit takes a lot of time. This is going to be someone promoting your brand, so you need to pay attention. If the mentions aren't extremely favorable, move on to the next prospect. (Credit: Flickr user Victor Bezrukov) Go for something established, but not a powerhouse - You are not going to be able to sponsor or buy a top blog that pertains to your industry. In my experience, it's best to target up-and-comers. Don't be too picky. If they are a solid writer, I would take a Domain Authority of 35 or higher with 40 or more linking root domains. Outreach Phase The term \"buying a blog\" is scary, remove it from your vocabulary when communicating with target sites. I like to refer to it as a \"promotional partnership.\" Craft a quick personalized letter that comes off as professional and friendly, here's one of mine: Always ask for a phone call in the introductory email. It's imperative to become a real voice in their ear and not just another thread in their inbox. This shows the blogger that you are willing to invest your time and attention towards them. If they have posts that have been picked up by major publications, it wouldn't hurt to reference those achievements either. The Response Acquisition Phase Off the bat, I like to let them know that this proposed partnership isn't about links and anchor text, it's about driving traffic. Before you go any further, it's important to get a screenshot of their analytics, if they have no traffic there is no point in going through with the partnership. That's way better than I hoped for. To seal the deal, I offer to pay for their hosting and the time it will be taking them to work with us to grow their audience. It's critical to go over all of your expectations with them. Let them know that they are free to have other advertisers on their site, but that they shouldn't engage in advertising with any of your competitors. IMPORTANT: GET EVERYTHING IN WRITING! (Credit: Flickr user NobMouse) I recommend having the blogger agree to the following in writing Since our experts' opinions are useful and informative for your readership, we would like X amount of posts every month to feature them for an expert opinion or interview. These posts will link to relevant portions of the client's site in an effort to reinforce the overall message of your posts. One badge, with the client's branding that links over to the client's site with the alt image text of the client's choice shall be placed on the homepage for the duration of the partnership Site will be paid X on the 1st of the month as long as all publishing deadlines are met. Site will not engage in any advertising with the following sites: (list of competitors) Once that's signed, the real work begins. Mentoring Phase (Ongoing) Now you have to follow through on the promise to grow their audience. These recommendations can be time consuming for both of you. I like to make one recommendation per month to improve their blog. Here's a starter list of things you can do to help out your blogger. Clean Up Their Site - Run their site through Xenu and send them the broken link report. Have them download Check My Links for Chrome so they can easily find and clean up their 404s from the Xenu report. Help Them With Indexation - Look over their site and provide them with a new robots.txt file that blocks out unnecessary directories with duplicate content. (like /tag/ and /category/) Make Them an XML Sitemap - I like to use Screaming Frog for this, just make sure to take out any unnecessary pages. Send Them Guest Post Opportunities - Those HARO opportunities that might not be right for your client are probably perfect for your partner blog. Identify Influential Peers - Use Followerwonk to find influencers in their space. Encourage your blogger to interact and engage with the influencers you've identified through social media and insightful blog comments. Optimize Their Evergreen Content - Get a user account for their Google Analytics and see which old posts are still getting search traffic. Rewrite the title tags and meta descriptions of these evergreen posts for increased click through rates. Give them social media advice - My favorite social media guide for small business is The Social Media Workout Plan (TM) by @manamica. It's extremely actionable and very easy for anyone to follow, including bloggers. Teach Them About Google Alerts - Show them how to set up topical Google Alerts so they will have a constant stream of relevant news stories that could inspire their blog posts. Give Them an SEO Education - Blogs need SEO help too; the Beginner's Guide to SEO is the best entry level resource out there. Grow Their Commenting Community - Have the blogger implement Livefyre or DISQUS for increased commenting on their site. Content Creation Phase (Ongoing) Every month, your blogger should come to you with a new topic that they want to write about that pertains to your client's industry. It's your job to get a representative from your client's company to get you a quote in a timely manner. As long as you don't slow down the blogger's creative process, they should like working with you. After all, you are providing them with authoritative industry opinions for their content. If the blogger ever has writer's block, I like to use UberSuggest to create an evergreen post concept. If you need some tips on using the tool, Amanda Orson wrote a great post on how to use Followerwonk to create content. Although it's a lot of work at first, this beats the headaches that come with maintaining a flimsy microsite that could get penguinized at any moment. With this strategy you get a real site, with real readers, that are being exposed to your client's brand on a daily basis. It can drive conversions, educate consumers, and help build a loyal brand following. This isn't just and SEO strategy; it's a business strategy. (Credit: QuickMeme) This isn't the only marketing initaitive we have going for this client, so I can't say if this single strategy lead to undeniable success. There have been a lot of other efforts to push them into mainstream press. However, here is a screenshot from their analytics that shows the conversion rate of the traffic from the partner blog: This relationship is driving revenue. Our client is experiencing growth because of a real relationship that we have created with a trusted and authoritative site. Overall, their rankings have gone up, they are seeing more conversions, and they love that we are creating content that gets read by their target demographic and not some \"Top 10 Signs You Are...\" to place on a low level blog in exchange for a single link. Savvy clients are starting to care less and less about PR3 links on pay-to-play mom blogs or infographics you have to throw down $150 to post on the equivalent of a content directory. As an industry, our clients are relying on us more to be real marketers. Inserting our client into a target demographics’ preferred and trusted media source has helped grow their business, brand, traffic, and trust. This may not be traditional SEO, but it's working. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bloggers & Acquisitions: How to Finance and Partner with an Existing Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bloggers & Acquisitions: How to Finance and Partner with an Existing Blog"
    },
    {
      "level": "H2",
      "text": "Prospecting"
    },
    {
      "level": "H2",
      "text": "Outreach Phase"
    },
    {
      "level": "H2",
      "text": "Acquisition Phase"
    },
    {
      "level": "H2",
      "text": "Mentoring Phase (Ongoing)"
    },
    {
      "level": "H2",
      "text": "Content Creation Phase (Ongoing)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John-Henry Scherck\n          \n            John-Henry Scherck\n          \n            John-Henry Scherck"
}