{
  "url": "https://moz.com/blog/blog-infected-by-the-linkbait-monster",
  "slug": "blog-infected-by-the-linkbait-monster",
  "title": "Blog Infected by The LinkBait Monster - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Alan Bellows' Damn Interesting is practically an entire collection of pure linkbait articles - the kind that not only make for good reading, but have to be linked to, emailed, and searched for at friend's houses in order to show them what they're missing. Just a quick dissection of how he does it…",
  "content": "Blog Infected by The LinkBait Monster Moz News By: Rand Fishkin February 6, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 6, 2006 Blog Infected by The LinkBait Monster Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Alan Bellows' Damn Interesting is practically an entire collection of pure linkbait articles - the kind that not only make for good reading, but have to be linked to, emailed, and searched for at friend's houses in order to show them what they're missing. Just a quick dissection of how he does it so well: It's not just him - there's a whole team of folks on the blog writing staff Great initial material - good subjects that have speculation, controversy, intrigue and surprise Clean presentation - large fonts, readable, usable interface and a familiar blog structure Broad audience appeal - subjects that fascinate everyone, thus targeting a very large market The last piece is the only one that may not serve well - an untargeted blog doesn't make for a great business model, though it can bring excellent traffic stats. We'll have to ask the Performancing crew what they think... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blog Infected by The LinkBait Monster"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Blog Infected by The LinkBait Monster"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}