{
  "url": "https://moz.com/blog/boost-your-content",
  "slug": "boost-your-content",
  "title": "3 Creative Ways to Give Your Content Efforts a Boost — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We know that content is our doorway to earning countless SEO benefits for our sites. Admittedly, though, it’s too easy to get stuck in a rut after one too many content marketing campaigns. In this 2017 holiday edition of Whitebeard Friday (see what we did there?), Rand offers three novel ways to…",
  "content": "3 Creative Ways to Give Your Content Efforts a Boost — Best of Whiteboard Friday Content Marketing | Whiteboard Friday | SEO Basics By: Rand Fishkin December 11, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 11, 2020 3 Creative Ways to Give Your Content Efforts a Boost — Best of Whiteboard Friday Content Marketing | Whiteboard Friday | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We know that content is our doorway to earning countless SEO benefits for our sites. Admittedly, though, it’s too easy to get stuck in a rut after one too many content marketing campaigns. In this 2017 holiday edition of Whitebeard Friday (see what we did there?), Rand offers three novel ways to add sparkle to your content creation efforts. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to a special Christmas edition of Whitebeard Friday. This week, I wanted to try and help with just a few tactical suggestions on some creative ways to pump up those content marketing campaigns. I've seen that many, many folks in the SEO world, of course, naturally, are investing in content marketing because content is the path to links and amplification and search traffic. Sometimes those content campaigns can feel a little stale or repetitive. So I have some creative ideas, things that I've seen some people executing on that I think we might be able to leverage for some of our work. 1. Niche groups First one, if you can identify in your community these sort of small but vocal niche groups that are . . . when I say your community, it doesn't have to be people you already reach. It can be people inside the community of content generation and of topical interest around your subject matter. Then help them to amplify their voices or their causes or their pet projects, etc. So I'll use the example of being in the foodie and gourmand world. So here's a bunch of foodies. But this particular tiny group is extremely passionate about food trucks, and, in particular, they really hate the laws that restrict food truck growth, that a lot of cities don't allow food trucks to be in certain spaces. They have to jump through a bunch of hoops to get licensed. They are not permitted to be permanently in a place for a whole week. Whatever it is, whatever those legal restrictions are. So by serving this small group, you might think that content is way too niche. The wonderful part is that content is the kind that gets amplified very loudly, very repetitively, that can help you earn links and traffic to this small community. If that community is small and loud and feels like their voices aren't being heard elsewhere, you can build some great brand advocacy inside that group as well. By the way, I would urge you to be authentic, choose causes that you or your company also care about. Don't just pick something at random. 2. Products and services Second, if you can, try and seek out products and services that your audience uses or needs, but that doesn't actually directly conflict with your business. Then create a resource that lists or rates or ranks and recommends those top choices. We've actually done this a few times at Moz. I have this recommended list of agency and consultant providers, but Moz does not compete with any of those. But it's a helpful list. As a result of listing those folks and having this sort of process around it, many of those people are pumping up that content. Now here's another example. Foodie Moz, Foodie Moz sounds like a great domain. I should go register that right after this hat stops hitting me in the back of the head. I don't know how Santa deals with that. So Foodie Moz presents the best cookbooks of 2017. Now, Foodie Moz might be in the food and recipe world. But it turns out, the wonderful part is cookbooks are something that is used by their audience but not directly conflicting with them. Since it's not self-promotional, but it is useful to your audience, the likelihood that you can earn links and amplification because you seem like a non-self-interested party is much greater. You're providing value without asking anything in return. It's not like anyone buying these cookbooks would help you. It's not like you have some ulterior motive in ranking this one number one or that one number two. You're merely putting together an unbiased set of resources that help your audience. That is a great way to get a piece of content to do well. 3. Content creators Third, last but not least here, if you can, find content creators who have been very successful. You can recruit them, the people who have had hit pieces, to create content for your brand. In a lot of ways, this is like cheating. It's almost like buying links, except instead of buying the links, you're buying the time and energy of the person who creates content that you have high likelihood or high propensity for being successful in that content niche with what they create because of their past track record and the audience they've already built. Pro-tip here. Journalists and media contributors, even contributors to online media, like a BuzzFeed or something like that, are great targets. Why? Well, because they're usually poorly paid and they are desperate to build a portfolio of professional work. Some of these folks are insanely talented, and they already have networks of people who have liked their work in the past and have helped amplify them. So if you can use a tool like BuzzSumo — that would be generally what I'd recommend, there's a few others, but BuzzSumo is really great for this — you can search for, for example, recipes and see the most shared content in the recipe world in, say, the last three months. Then we can identify, \"Oh, here we go. This person wrote the hardest recipe challenge gifts. Oh, all right. That did really, really well. I wonder if we can see who that is. Oh look, she does freelance work. I bet she can write for us.\" It's like cheating. It's a great hack. It's a great to way to recruit someone who you know is likely to have a great shot at their work doing well, give them the freedom to write what they want, to create what they want, and then host it on your site. A great way to do content creation, for a decent price, that has a high likelihood of solid amplification. All right, everyone, look forward to some of your thoughts and tactics. For those of you who celebrate Christmas, a Merry Christmas from all of us at Moz. For those of you who celebrate Hanukkah, happy belated Hanukkah. I know that I'm filming this during Hanukkah, but it's probably after Hanukkah that you're seeing it. For those of you who are celebrating any other holiday this year, a very happy holiday season to you. We look forward to joining you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "3 Creative Ways to Give Your Content Efforts a Boost — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "3 Creative Ways to Give Your Content Efforts a Boost — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Niche groups"
    },
    {
      "level": "H2",
      "text": "2. Products and services"
    },
    {
      "level": "H2",
      "text": "3. Content creators"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}