{
  "url": "https://moz.com/blog/boost-content-linkability",
  "slug": "boost-content-linkability",
  "title": "How to Boost Content Linkability Without Wasting Your Marketing Budget - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Regardless of how good your content is, how well structured and valuable it may seem, it has nearly zero chances of getting attention in today’s overcrowded digital space. ﻿﻿",
  "content": "How to Boost Content Linkability Without Wasting Your Marketing Budget Content Marketing | Link Building By: Alexandra Tachalova July 23, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Alexandra Tachalova July 23, 2019 How to Boost Content Linkability Without Wasting Your Marketing Budget Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I’m always fascinated with the marketing budgets of enterprise-level companies that are ready to pay astronomical sums to contractors. A recent shmooze in the community was thanks to Hertz that paid 32M to Accentura agency, which (so far) hasn't resulted in any substantial changes to their site. Though I personally don't work with client’s who throw around millions of dollars, that doesn’t affect the quality of services that I provide. My average client wants to get the maximum by spending as little as possible. It might sound like a tough job for me and indeed it is, but I love the challenges that a small budget brings, as it helps me stay creative and reach new professional heights. So while the budget isn't a challenge, changing my client's mindset is, and that's because all of my clients are victims of one of the biggest misconceptions about content marketing: They think that once they start publishing content pieces regularly, inbound traffic will hit their site like a meteorite. And it’s not just the traffic — links are a subject to a similar misconception. Each time I share studies like the one by Brian Dean that clearly shows that links don’t come on its own, there’s always someone that's going to say: “That’s because their content’s just not good enough.\" When I have a call with clients that ask for quality content with zero focus on links. The bottom line is, traffic and links don’t just show up out of thin air. Regardless of how good your content is, how well structured and valuable it may seem, it has nearly zero chances of getting attention in today’s overcrowded digital space. In this post, I want to share with you five bulletproof tactics that help me boost content linkability without having a big fat budget to waste. A note on content and modern-day link building Before we dive into the best ways to boost your content without breaking the bank, it's important to touch on what link-building is today. Links are a digital marketing currency — which you need to earn and spend wisely. And to earn them, you need to build relationships. A while ago, I noticed a shift in a client’s mindset: After a few projects delivered together, they started to ask for in-depth forms of content like how-to’s, case studies, and guides — which (according to Brian's research) is exactly the type of content that has the highest chances of getting links. But that’s not necessarily the number one reason why people allocate links. Links are inherently relationships. And if you agree that linking to a strategic partner brings more benefits compared to referring to a random stranger, then you'll find appreciate Robbie Richards methods. Robbie’s roundups are a textbook definition of highly linkable content. A post about the best keyword research tools published not that long ago on his blog attracted nearly 300 referring domains and a decent organic traffic share: What’s his secret? Robbie made sure to target the experts within his business circle. In a nutshell, his roundup posts work as part of a well-delivered outreach strategy that has a strong focus on gaining links by leveraging existing relationships. This is the key to modern-day link-building — a combination of content, links, and partnerships. Without further ado, let’s talk the best ways to promote content that doesn’t involve any where-do-I-get-the-money-for-it drama. 5 bulletproof ways to blow up your content without breaking the bank If you're creating quality content with zero focus on links, you won't be getting optimal traffic. The only chance to make your content stand out is to focus on its potential linkability even before you actually start writing it. Here are some of favorite ways to get your content seen. 1. Adding expert quotes Quoting an expert is one of my favorite ways to boost content linkability and shareability. It’s quick, easy, and doesn’t require a significant time investment. When you write out of your expertise area, adding a quote of a thought-leader grants your content more credibility and value, not to mention boosting its linking potential. Depending on how influential your company is, you can either select an existing quote or reach out to the experts and ask for a new one. Here’s a tip: If you decide to go with a pre-existing quote, contact the expert in advance to confirm it. This way, you can make sure that they still stand by that opinion, plus, they’re okay with you quoting them. Remember, while quoting experts is a good idea, you also need to find the right expert and the right quote. Here's how to do that: If your brand has a big audience, I recommend starting by checking your current followers and subscribers across various channels, including social media. You might not know it, but there’s a good chance you’ll find real influencers among people who follow your brand’s pages. To speed up the process of spotting influencers among your Twitter followers, you can use Followerwonk. This tool allows you to export all your followers to a list and sort them by the size of their audience. Another way is to analyze the websites that link back to your site. To do that, you can use Moz Link Explorer that will show the list of URLs that are referring to your site. Chances are, some of those authors are pretty influential in their niche. Finally, you could use BuzzSumo to find relevant influencers to contact. For example, you could export a list of bloggers who are contributing to the industry-leading blogs. The last option is less suitable for link building purposes, as the influencers that you find have no idea of your business existence and are hard to get on board. However, it’s not impossible. Before getting in touch, make sure to scratch their backs: Share their content on your social media, sign up for their newsletter, etc. To find the influencer’s most recent pieces, search on BuzzSumo Content Analyzer by “Author: [INSERT NAME].” This helps build a bridge and create the right first impression. Don’t forget that expert quotes need to be allocated in content with special formatting which means you need to involve a designer/developer. Here are a few examples that I personally find quite visually appealing: From: How to Win a Featured Snippet Like a Boss And another one: From: How to Leverage Influencer Outreach to Build a Better Blog Post 2. Strategically linking back to blogs that you’re interested in Strategic link building is like playing poker while blindfolded. A strategic approach always pays off in the long run in almost any area, but when applied to link building, it depends on how well you can spot linking opportunities. Based on this, your chances of acquiring links are either very high or very low. If you want industry leaders to link back to your content someday, you have to prove that your content deserves their attention. The best way to get your foot in the door is to link back to them. You need to find the right experts to link back to. How do you do that? The mechanic behind finding the right sites to refer to is similar to the one that I shared in a section about expert quotes. However, there’re a few more strategies that I want to add: Are you a part of any industry groups on Facebook? If so, go and check the members of those groups and find people that are also involved in link building. Now, you have a legit reason to contact them (since you’re both a part of one group on Facebook/LinkedIn) and ask whether they’re interested in getting a link in your upcoming post. Please note, that you shouldn’t skip this step, as by this you’re making them aware that you’re expecting for the favor to be returned. Have you ever participated in any roundups? If yes, then reach out to the experts that were also featured in this post. Finally, check your current blog subscribers, clients, and partners. The chances that they’re also interested in partnering up on a link building side are quite high. 3. Adding good images/GIFs and hiring a designer for professional-looking visuals In 2019, using stock images in your content is a big no. After all, they are easily recognizable for their abstract nature and give away the fact that the author didn’t invest much into creating custom visuals. However, there is a way to adapt it to your unique brand style and still make it work. And to do it, you don’t even need to hire a designer right away. The drag-&-drop tools like Vengagge, Canva, or Visme make it easy to create pretty nice graphics. For example, Canva has a lot of great grids and predefined templates, which makes the whole design process really fast. What you need to do is take a good-looking cover image, for example, like the ones we use in our blog, and cheer it up with custom-made designs in Canva. You can add your picture, your brand’s logo, or anything else your heart desires. Such an approach allows us to maintain our own unique style while staying within the budget. Static images are not the only way to pretty up your content. One of my favorite visual elements is GIFs. They are perfect for visualizing step-by-steps and how-tos and can easily demonstrate how to perform something in a digital tool. You can even use them to tell a story. At one of my recent presentations, I used a GIF to explain why simply posting on Twitter is not enough to get attention to a brand. I saw many posts that were able to acquire loads of links and social shares thanks to good graphics, for instance, this post that featured the SEO experts in Halloween costumes. Without a doubt, this requires a little bit of a budget, but I’d say it’s 100 percent worth it because it's creating value. The last time our company did something like this for a client, we hired a designer who charged us $30 USD for one image. It’s not too bad since custom-made images make it way easier to pitch your posts to other blogs to get more links! Hint: When you’re looking for custom graphics that won’t make your wallet cry, you can always find freelancers on sites like Upwork or on freelancing Facebook groups. 4. Delivering email outreach by targeting the “low hanging fruits” We’ve done a lot of email outreach campaigns here at Digital Olympus, and so, I’ve noticed that we have a fast turnaround rate when our outreach targets are in the “right state of mind,\" meaning they're interested in cooperating with us. There are many reasons why they might show interest. For example, perhaps they’ve recently published a piece and are now invested in promoting it. To spot content marketers and authors like these, you can use Pitchbox. Pitchbox lets you create a list of posts that were published within the last 24 hours based on the keywords of your choice. The biggest bonus of Pitchbox is that it not only pulls together a list of content pages but it also provides contact details. In addition to this, Pitchbox automates the whole outreach process. Another tool that can pull together a list of posts published within the last 24 hours is Buzzsumo. Here’s a great piece by Sujan Patel that shows how to deliver outreach the right way. There can be many speculations about which email outreach techniques work and which don’t, but the truth remains: It’s a very hard time-consuming job that requires lots of skill and practice. In one of my recent posts, I write about proven email outreach techniques and how to master them. 5. Adding stats that don’t involve a huge time investment You’ve heard that a picture is worth a thousand words. How about this: A number knocks out 10 thousand words. By adding statistics to your piece, you can simply mark out the whole process of having to refer to another page. But fresh, relevant stats don’t grow on trees. You need to know where you can find them. The easiest and the cost-efficient way of adding numbers to your piece is by running Twitter polls. They can collect up to 1k results for only $100 USD of properly paid promotion efforts. The biggest plus of running polls on Twitter is that you can create a specific list of people (aka a tailored audience) that will see your ad. For a detailed explanation on how to work with tailored audiences, I recommend checking this post. Besides running Twitter polls, you can use survey tools that will help you collect answers for a fee: Survata will show your survey across their online publisher's network with the average cost per answer starting from 1 USD;Surveymonkey market research module starts from $1.25 for 200 complete responses. As you can see from a screenshot below, it allows you to set up a more laser-targeted group by selecting a particular industry. Another quick hack that I use from time to time is comparing already existing data sets to reveal new insights. Statista is a great site for getting data on any topic. For instance, on one graph you can show the revenue growth on the major SMM platforms as well as the growth of their audience. Plus, don’t forget that while the numbers are good, the story is key. Statistics tend to be dry without a proper story that they are wrapped in. For inspiration, you can use this great post that shares many stories that were built on numbers. It doesn’t always have to be serious. Numbers draw more attention than written copy, so you can create a fun poll, for example, whether your followers are more into dogs or cats. Conclusion Creating captivating content is hard work and often a hella lot of money, but there are ways to spare a few bucks here and there. By utilizing the strategies that I shared, you can make sure that your content gets the audience it needs without time waste, huge costs, and stress. The amount of backend work you put into research and advertising is what makes your audience not only scroll through your content but actually read it. This is what will differentiate your piece from millions of similar ones. Create a strategy and go for it! Whether it’s polling, graphics, emails, quotes, or backlinks, make a game plan that will promote your content the right way. Then your site will rock. Do you have any other tips or suggestions? Tell me below in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Boost Content Linkability Without Wasting Your Marketing Budget"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Boost Content Linkability Without Wasting Your Marketing Budget"
    },
    {
      "level": "H2",
      "text": "A note on content and modern-day link building"
    },
    {
      "level": "H3",
      "text": "What’s his secret?"
    },
    {
      "level": "H2",
      "text": "5 bulletproof ways to blow up your content without breaking the bank"
    },
    {
      "level": "H3",
      "text": "1. Adding expert quotes"
    },
    {
      "level": "H3",
      "text": "2. Strategically linking back to blogs that you’re interested in"
    },
    {
      "level": "H3",
      "text": "3. Adding good images/GIFs and hiring a designer for professional-looking visuals"
    },
    {
      "level": "H3",
      "text": "4. Delivering email outreach by targeting the “low hanging fruits”"
    },
    {
      "level": "H3",
      "text": "5. Adding stats that don’t involve a huge time investment"
    },
    {
      "level": "H1",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alexandra Tachalova\n          \n            Alexandra Tachalova\n          \n            Alexandra Tachalova"
}