{
  "url": "https://moz.com/blog/brainstorming-on-gov-links",
  "slug": "brainstorming-on-gov-links",
  "title": "Brainstorming on .gov links  :-) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "OK...  I will share one of my best ideas for getting a .gov link if the folks who read it will share one of their best ideas.  Your idea can be proven to work or one that you \"think\" will work.  If you think it will work I might try it.In one of my previous careers I spent quite a few years as a…",
  "content": "Brainstorming on .gov links :-) Link Building E By: EGOL August 18, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL August 18, 2006 Brainstorming on .gov links :-) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. OK... I will share one of my best ideas for getting a .gov link if the folks who read it will share one of their best ideas. Your idea can be proven to work or one that you \"think\" will work. If you think it will work I might try it.In one of my previous careers I spent quite a few years as a manager at a governemnt agency. Government agency heads like positive press as much as anyone. It helps them spread the word of their works and they can point to that press when they meet with legislators during budget hearings.I occasionally review government publications and projects on one of my websites. When I have a positive message about a specific agency I always send a quick email to their webmaster and to the agency head. This email contains the URL of my review and a positive note about their work. This usually does not generate a link but it frequently does - especially if they have a \"News\" or \"PR\" page on their website - here they will link directly to your review. If they don't link to your review they will sometimes add your site to their \"recommended websites\" list. So, next time you see some nice info on a .gov site or in a .gov publication that matches the theme of your website, think about writing a review and letting them know that you appreciate their work.There's my contribution to this brainstorming session.... Now it's your turn to add an idea. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Brainstorming on .gov links   :-)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Brainstorming on .gov links   :-)"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}