{
  "url": "https://moz.com/blog/brand-as-publisher",
  "slug": "brand-as-publisher",
  "title": "The Brand as Publisher Masterplan - Reinventing Content Marketing for the Next Decade - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content marketing is big business, but are brands taking it far enough? Here Simon Penson argues that Brand as Publisher is the next step.",
  "content": "The Brand as Publisher Masterplan - Reinventing Content Marketing for the Next Decade Content Marketing | Blogging | Public Relations By: Simon Penson March 24, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Simon Penson March 24, 2016 The Brand as Publisher Masterplan - Reinventing Content Marketing for the Next Decade Content Marketing | Blogging | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 20 minutes] Introduction and background The how-to process Setting up your team Free downloads and help guide Content marketing has an image problem. Like all potentially transformational opportunities, the world sees something glistening and jumps in head first to claim a piece of the next \"goldmine.\" The ensuing digital gold rush that follows often creates a stampede to be first, rather than best, and normally strategic thinking is usurped and instead replaced with a brain-out approach to delivery. And in the case of the content marketing revolution, the result has been an outpouring of disconnected content that adds little value and serves very few, leaving many with nothing more than a handful of \"failed\" content campaigns to show for the effort. It’s something I see every day, and it is incredibly saddening. Content marketing, you see, is not the answer to those prayers. It's simply part of a much broader strategic picture that I call the \"Brand as Publisher\" play; a reset of the core principles behind the content marketing charge. This piece is designed to explain precisely how you can take the \"Brand as Publisher\" approach, what it is, and how it can help your business succeed with content. I’ve even created a unique Brand as Publisher Toolkit for you to download to help in that quest! Click the banner below (or at the bottom of the post) to grab a copy. Defining the opportunity So, what exactly is \"Brand as Publisher?\" Put simply, it's changing your mindset to put content at the forefront of your business, almost before the products or services that you sell. As controversial as that may seem, the idea is that you're able to build an engaged, loyal audience of value for your brand... an audience you can then monetize later. It’s a long-term play, without doubt, and one that requires consistent investment in both time, resources, and cold hard cash — but it creates \"cast-in-granite\" value that your competitors will find impossible to steal away from you. Those who take the time and effort to do it will beat you in the long run, and there will be little you can do about it! Changing mindsets Now, before you close your browser, let me add a dose of reality. The suggestion is NOT that you start a magazine or newspaper for a living, but instead take the value from that business model and leverage it for your gain. In many ways, you must start to… “Imagine yourself as THE leading consumer magazine for your market.” The easiest way to do that is to imagine your business as a magazine, as the leading publication for your specialist market and THE place anyone with even the slightest interest in your area of expertise goes to expand their knowledge. Think about it for a second. In the same way that newspapers and magazines create \"value\" by sharing quality content on their specialist area and then building an audience around it, so can you. Where they then monetize that audience by selling ad space, you may do the same by selling related products or services, or capturing leads. The ability to create what I call \"target audiences of value\" in this way is how value has always been created. And with those eyeballs now focused online more than ever before, there has never been a better time to capture it. The challenge is that few understand how to make content work long-term. While many brands (and agencies, for that matter) make a song and dance about delivering amazing campaigns, there is a very real need to get back to the basics and build, not just a campaign plan, but a longer-term brand content plan. This excellent piece for Adage does a great job of arguing why we really do now need to focus on \"proper content strategy\" and not just on delivering content, particularly from agencies. Recreating it online This post is designed to share the secrets honed by the magazine industry over the last six decades; to share the principles that will maximize your chance of success with a content-led strategy. To make that more digestible, the approach is broken down into a series of integral \"pillars,\" the first of which focuses on audience insight. Pillar One: Audience understanding This process starts and ends with people, with a pure understanding of who that already is and, critically, who you want to consume your content. Traditionally, the process of gathering insight would have been carried out by running reader focus groups, an often fascinating series of meetings with existing readers and those who currently don’t purchase but are very much \"in the market.\" It's a process I ran as editor of a British specialist car magazine called Max Power, visiting six different locations across the country to meet between four and twelve existing and potential readers. Those candidates were selected by our own subscriptions team and from the wider industry events we attended on a regular basis in order to \"stay close to the audience.\" A budget then allowed us to work with a professional research agency to run structured Q&A sessions with them. In reality, however, you can do the same meeting at a bar, providing you prepare the right questions beforehand. Every business will have different insight needs. One way of determining which questions to ask is to first capture the key outputs you wish to come away with: 1. Who is currently buying your product or service? 2. Why are other people not buying it? 3. What general trends are affecting these people's lives at the moment? 4. Where would people buy your product or service from? 5. When, where, and how would they use or consume it? 6. Why would they buy it? What need do they want to satisfy? 7. Who is your real competition? 8. What image do people have of your brand vs. your competitors? 9. What do they think about the different aspects of your product or service (name, packaging, features, advertising, pricing...)? 10. What improvements could be made to your product or service to meet people's needs even better? 11. What is the single most important benefit your brand should be seen to be offering? 12. How can you best communicate that benefit to the people you're interested in attracting? 13. What is the right price to charge? 14. What other new products or services could your brand offer people? Questions can then be crafted to capture that information easily, and you'll go to those research meetings armed and ready. Digital insight That real-world data can be further improved with the addition of digital insight. I have written several times about my process for extracting useful customer information from Facebook and also how you can use paid-for tools such as Global Web Index to form an understanding of how your audience interacts with your brand and wider market. Combing both the qualitative information you collect in the focus group meetings and the quantitative data you can access digitally will allow you to create data-informed personas for your brand as publisher strategy. Pillar Two: Personas Having a clear view on who you wish to target helps steer and shape everything you do editorially. If I rewind back to those Max Power days, we went as far as painting those personas clearly on meeting room walls and in the main office so we were constantly reminded of whom we were there to work for. How you pull personas together is the subject of a lengthy post in its own right, but there are guides like these will help you do just that:Personas: The Art and Science of Understanding the Person Behind the VisitKeyword-Driven PersonasThe point is to put a human face on the data you have bundled into audience segments. By doing so, it enables not just the team pulling the information together to understand who they are and how their needs differ, but also the wider business. It is also a very good idea, as I've written previously, to try to align those personas to celebrities. This really lifts each persona into a living, breathing character that everyone can understand in much greater detail. We all know, for instance, how Beyoncé talks, holds herself, and may be portrayed attitudinally. Pillar Three: Editorial mission statement With the audience piece complete, the next stage is to then create your \"Editorial/Content Mission Statement\": the crystallisation of your content value and objectives. Any good content team will have this burnt into their retinas, such is the importance of having a statement that outlines what you stand for. This is your guiding light when creating content, focusing on who your audience is and how you’ll serve them. It should be the measuring stick by which you evaluate all of your content. A great example of this done well can be found hidden within the wider brand documentation for a brand like Sports Illustrated: \"Sports Illustrated covers the people, passions and issues of numerous sports with the journalistic integrity that has made it the conscience of all sport. It is surprising, engaging, and informative, and always with a point of view that puts its readers 'in the game.'\" It's a good example for several reasons because it captures all the key focal points for the brand succinctly. Below we can see how they have managed to cover the key pillars in their editorial strategy: Our positioning on Max Power was also captured in a similar mission statement, succinctly defined as: “The definitive guide to arsing [sic] around in cars.” Editorially, we ensured we injected \"attitude,\" \"fun,\" and \"entertainment\" into every issue, while also maintaining our stance as \"experts\" and \"trend setters\" in what was a fast-moving youth market. Pillar Four: Content flow We knew that by staying close to our audience, we would continue to lead the market due to our reach. But we also knew that as we covered a wider audience of car enthusiasts, we needed to ensure that our publication was reflective of the audience/readership. This meant thinking very hard about the \"flow\" of the magazine; what mix of content we included and how it was delivered over time. Content flow is a process I have written about previously here, but it's worth covering again, such is its importance. Getting it right is the difference between campaign delivery and truly connected content strategy. The basis of flow is having the right mix of content to deliver from page-to-page, or day-to-day in the case of digital. The best way of doing this is via a process known as \"flatplanning,\" a print publishing technique that also lends itself well to digital planning. Pillar Five: Flatplanning and regulars (reinventing the wheel) So, how does flatplanning work? The concept is a very simple one for print publications: you recreate the pages you wish to fill with lovely content schematically in a document that looks a little like the one below. You’ll see that I have started populating this to give you an idea of how it worked in the Max Power example we've been using. Above, you’ll see how each element, or content idea, has been added to the plan. Doing it this way it makes it very easy to visualize how the strategy ebbs and flows in terms of the variation of pace afforded by the different types of content you include. Take, for instance, the first couple of pages here. You can quickly see that we kick-start with some shorter-form, faster-paced news on page 1–12 before we then change pace and move into a four-page longer-form piece on pages 13–16 before going back to a two-page piece. Obviously, in the print world the ONLY variation you can play with is length of article and style of writing, but when it comes to digital the opportunities are endless. Flow In the online world you have a plethora of media types to play with to add extra zing to your content strategy. The key to getting the \"flow\" correct is to use this flatplan technique, with the pages being hours, days, weeks, or whatever other measurement of time is relevant for your plan. We often refer to the brilliant Smart Insights content matrix as part of this content type planning process. You can see below that it includes all of the key content types and adds insight into which part of the customer purchase and intent cycle they sit. I've created a new resource to help further with this process, based on the same principles. The Content Flow Matrix helps you understand which content types to use based not only on where they may sit within the purchase funnel (upright axis) but also the relative \"size\" of the content. By choosing a mix of content types AND a mix of content \"sizes,\" you end up with the right mix of variation to ensure your content audience remains engaged and that they come back for more. Pillar Six: Front cover insight But while variation is a great thing, it's also very important to make clear what the cornerstones of that strategy are, and to consistently and clearly reinforce and deliver that for your audience. The way this works in print is to utilize the cover \"sells\" to deliver consistent messaging. One of the very best exponent of this is Men's Health magazine, a media brand that very much understands its readership and where and how it can add value. Below you can see a randomly selected front cover highlighting what I call the \"Editorial Pillars\" of the brand — the cornerstones of its strategy. Every single month, the cover will feature content that offers to help you improve your mind, body, or sexual performance: Digital content strategy requires the same focus. Part of your overall strategic planning process should include a session to establish what those pillars are for your brand. Below, you can see how a template front cover may look, complete with spaces for your editorial pillar planning. I have also included a copy of this in the free Brand as Publisher Toolkit download bundle created specifically for this piece to help you build your own strategy. What might that look like for my agency, Zazzle Media? Here’s a fun example created by our designers to give you an idea of how it might be pulled together: Getting it right will mean greater engagement, more return visitors, and more sharing of and linking to your content. Marketing and incentivising purchase So, with a clear proposition and great content delivered with variation and clear messaging, you're ready to roll, right? Almost, but not quite. Often the key difference between a magazine being successful and just being \"OK\" was the quality of its marketing strategy. If anything, this is even truer in the digital sphere. Thinking about how you reach your audience is what this blog is all about. The challenge, digitally, is that while access to your audience is faster and easier, it means that the barriers to entry that protected traditional media for so long are no longer there. And that means competition, and lots of it. In print, the only truly effective ways of growing market share was to improve distribution (be in more stores), optimize your position on the newsstand (be more visible), or invest in gifting (giving away free stuff on the cover). These strategies translate nicely to digital in the following ways: Ensure you have a strategy for all relevant channels (social, search, influencer channels) to maximize reach. Optimise all channels to maximize effectiveness (SEO is especially important here) Incentivize. This will look different for all businesses; for example, in ecommerce this may be money-off codes. One final area of investment for publisher brands is live events. This is, again, a cornerstone of a brilliant brand as publisher play. For those dealing with specialist markets (and that is exactly what we all do online), it has always been absolutely critical to stay close to the audience. One of the very best ways of doing that is to create, and run, semi-regular live events. What they look like is completely dependent upon what market you're in, but if you truly understand your customers, you'll almost always be able to add some experimental value. For some, it may not be possible to do this in person. Where this is the case, regular Hangouts and/or webinars can fill the void. Max Power was always famous for running regular meets throughout the UK for people to bring (and show off) their cars. It was a forum that kept us connected to the loves and hates of the market, and allowed us to establish strong relationships with the key influencers amongst them. Events can be seen as the icing on the cake to many, but in reality they are one of the most important slices of the marketing cake. Pillar Seven: The long tail Another underestimated area of opportunity can be found within your regular content, the pieces you put out every day and that serve to stick together your bigger-bang campaign content. In magazines, these pieces help create variation of pace as you turn the page. In the digital world, they can do much more. Designing your long tail strategy in a way that takes advantage of long tail search opportunity is something I have covered as a standalone subject here at Moz previously, and I'd urge you to read the post to get the most out of your idea planning. The added bonus now is also taking advantage of Google Answer Boxes. By designing regular content to answer key questions that your audience is asking (I use Answer the Public and a keyword tool like Keyword Studio to help me understand this), you're not only adding value to regular visitors’ lives — you're also creating the opportunity to jump to the top of the SERPs. Claiming those boxes requires real focus on article structure and good use of headlines, as this amazing study by Razvan at Cognitive SEO explains. If you achieve it, in our experience you can expect to see a 15% increase in traffic from that keyword, versus even being first in the normal SERPs. Outside of the \"content-for-long-tail-search\" opportunity, regular content also serves to provide interaction opportunity. Using those \"regular\" slots to run polls, quizzes, more brand-led pieces and so on will enable you to not just provide variation but also improve brand understanding, resonance, and reach. Pillar Eight: \"Big Bang\" content For many, the campaign content end of the spectrum is where most content strategists concentrate. This is a mistake. While Big Bang pieces can undoubtedly provide greater reach and attract more links, they alone do not constitute a strategy. That said, they can certainly provide value — and like a magazine full of short-form content only, without them, you lose readers quickly. The \"features\" in a magazine — those articles that span four+ pages — are the print Big Bang equivalent. They often fit within those brand as publisher pillars we discussed earlier. For Max Power, these would often take the form of a car road test, road trip, or interview — but in digital, the world is your oyster. For instance, we've recently produced content campaigns as diverse as a vegetable cookbook, to a supermarket shopping challenge, to the Classroom of the Future, to give you a taste of what that means. Content types that lend themselves to Big Bang campaigns include: Tools Games Data visualizations Guides Surveys and reports Video The key, once again, is ensuring there's variation, even in your Big Bang output. So many brands will find a hit with one type and then stick with it, but that's missing the point. As with every part of your strategy, variation will always win. That's how you stand out from the crowd in the long run. Pillar Nine: Team structure and resourcesCreating this variation is not an easy task. It requires a greater focus than ever on available skill sets. You may think that what's needed now from a team perspective is much more demanding than it was before, but that view isn’t necessarily correct. To give you a view on what it took to pull together an issue of Max Power, we employed the following. I also explain, briefly, their role within the whole: Editor – Responsible for the overall positioning and editorial strategy. Takes a longer term view to issue planning and liaises with commercial and publishing teams to maximize sales opportunities and sales. Works closely with all. Publisher – Commercial-focused P&L owner responsible for distribution deals, production costs, and sales (the number of magazines sold AND ad revenue from it). Deputy editor – Day-to-day ownership of the flatplan. Ensures content is delivered on time and to standard. The editor’s right-hand man/woman. Production editor – Responsible for ensuring everything is produced on time. Liaises with the printers to ensure production standards are upheld. Art editor – Leads the design team and is responsible for upholding design rules and the adoption of brand values throughout. Designers – Layout and design all pages, and will artistically direct shoots to ensure that the design vision for individual features is carried through. News/Features/Section editors – Lead a mini-team of specialist writers and are responsible for their output and the quality of their sections. Writers – On-the-ground journalists who are out and about more than they're in-office working on the individual articles and features. Photographer – More often has a focus on photos, but may also have video skills. Web team – In the early days of the net, this team ran separately to the \"main\" print team and often reconstituted print content for the web, ran communities, etc. Advertising team – Responsible for selling all advertising space in the magazine (a key way of monetizing the audience). Production team – Produce the adverts that the advertising team sells and supplies them to the designer team. As you can clearly see, the cost of a great editorial product has always been high — that will never change — but the value it creates will outweigh the cost if you get the strategy right. The big question, of course, is what should the right digital version of this team look like? This is something I have spent a great deal of time looking at in my current role; here's a view on what a small, medium, and large business could base a setup on. Obviously this looks different for everyone, as different markets demand different areas of focus, but this can be a start point for discussion: Small business In this scenario, we're ideally looking for multidiscipline people. In an ideal world, your journalist will be able to write and PR their written work, leaving you with the possibility of also including someone to focus on paid promotion across search, social, and native. As with all of these example team structures, the MD/CEO of the business should own the brand as publisher plan, bringing it to the very centre of focus for the business. In larger businesses, that may ultimately be taken on by the CMO, but in any business of hundreds of people or less this needs to have priority focus. In a small team the focus has to start with owned and earned media, hence the balance of people here. With a writer and designer you can create lots of different types of content, while the PR person focuses on building key relationships and leveraging those connected audiences. Medium enterprise In a slightly larger organization with more budget to play with, things start to get much more interesting as roles become more specialized. In this model (and read each specialty as being scalable with multiple people in each of those teams) we can create more variation. Video and data start to creep in, allowing you to not only create a wider range of content, but also understand who your audience is, where they are online, and what they consume right now. Interestingly, we find that those who have traditionally sat in SEO roles make for very good data analysts in helping to forge a data-driven strategy, while their abilities in ensuring platforms are still \"fit for purpose\" means they can fulfill a dual and extremely valuable role. We then also have the ability to split out PR and blogger relations. That way, there's focus on both the niche and the big traffic media brands within the distribution plan. At this level, it's also critical to have some specialist paid media focus to ensure that the content distribution plan includes a cohesive paid media element. Large brand For large-scale enterprises, the sky is the limit! We can go much further in bringing in further data specialists and also how the wider CRM play may come in to include specialists dedicated to best using the whole Inbound Marketing Suite. We also add in multilingual capability, especially important to international brands, as well as other specialties to give more focus to the overall strategy, ensuring it's scalable. The sky is the limit here. Help is here!We’ve covered a great deal of ground in this post on a subject matter that asks wider questions of all brands and businesses. To help you on a more practical level to work through it, we've created an all-encompassing Brand as Publisher Toolkit. In it, you’ll find: Flatplan template Magazine cover template Content campaign planner Editorial calendar Persona template A copy of our Content Flow Matrix Content Style Planning Guide Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Brand as Publisher Masterplan - Reinventing Content Marketing for the Next Decade"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Brand as Publisher Masterplan - Reinventing Content Marketing for the Next Decade"
    },
    {
      "level": "H3",
      "text": "Defining the opportunity"
    },
    {
      "level": "H3",
      "text": "Changing mindsets"
    },
    {
      "level": "H3",
      "text": "Recreating it online"
    },
    {
      "level": "H2",
      "text": "Pillar One: Audience understanding"
    },
    {
      "level": "H3",
      "text": "Digital insight"
    },
    {
      "level": "H2",
      "text": "Pillar Two: Personas"
    },
    {
      "level": "H2",
      "text": "Pillar Three: Editorial mission statement"
    },
    {
      "level": "H2",
      "text": "Pillar Four: Content flow"
    },
    {
      "level": "H2",
      "text": "Pillar Five: Flatplanning and regulars (reinventing the wheel)"
    },
    {
      "level": "H3",
      "text": "Flow"
    },
    {
      "level": "H2",
      "text": "Pillar Six: Front cover insight"
    },
    {
      "level": "H3",
      "text": "Marketing and incentivising purchase"
    },
    {
      "level": "H2",
      "text": "Pillar Seven: The long tail"
    },
    {
      "level": "H2",
      "text": "Pillar Eight: \"Big Bang\" content"
    },
    {
      "level": "H2",
      "text": "Pillar Nine: Team structure and resources"
    },
    {
      "level": "H2",
      "text": "Small business"
    },
    {
      "level": "H2",
      "text": "Medium enterprise"
    },
    {
      "level": "H2",
      "text": "Large brand"
    },
    {
      "level": "H2",
      "text": "Help is here!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Penson\n          \n            Simon Penson\n          \n            Simon Penson"
}