{
  "url": "https://moz.com/blog/brandthinking-and-ppc-campaign-management",
  "slug": "brandthinking-and-ppc-campaign-management",
  "title": "Brand-Thinking and PPC Campaign Management - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you've done any Pay-Per-Click campaign management, you know how expensive PPC can be. Additionally, PPC campaigns can require a significant time investment, as you must constantly be tweaking your ad text, keywords and bids in order to maximize your advertising dollars. And nothing is more…",
  "content": "Brand-Thinking and PPC Campaign Management Paid Search Marketing (PPC) E By: Eric Bryant January 15, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! E By: Eric Bryant January 15, 2009 Brand-Thinking and PPC Campaign Management Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. If you've done any Pay-Per-Click campaign management, you know how expensive PPC can be. Additionally, PPC campaigns can require a significant time investment, as you must constantly be tweaking your ad text, keywords and bids in order to maximize your advertising dollars. And nothing is more frustrating in PPC campaign management than doing all that work, spending all that money, and getting very few clicks or a poor Clickthrough Rate. A Traditional PPC Management Approach Traditional PPC ad formation and campaign management suggests that you begin by selecting keywords in your market for which you wish to advertise. After selecting your target keywords, you then build your ads around them. While this can be an effective approach, we are finding an approach that is much more effective for our business, and which costs significantly less than the traditional method. Thinking About Your Brand(s) Instead of beginning with an assortment of industry keywords, we tried beginning with our brand identity - or the brand idea(s) we wished to convey. By utilizing Google’s Webmaster Tools, we discovered that we receive as many, if not more, visitors to our website through name and/or brand name searches than for the generic “target keyword” searches. In other words, people were finding our business as much by searching directly for our name, our products or our services as they were for any other generic keyword. This has everything to with brand awareness. Ads Fashioned Around Brands So, what we did was pretty simple. We launched an online advertising campaign utilizing our brands themselves as keywords for our ads! And we constructed our ad text and appearance around those brand keywords. No longer did we take the conventional approach of trying to make our ad text “sexy” or “juicy”; we didn’t try to “sell” anything to the potential visitor. We simply let the ad text be a natural expression of our brand identity. We were astonished at the results. Our ads received a much higher Clickthrough Rate. For one particular brand-keyword, the CTR was 22% after the first week! And on the date of this writing, our PPC team scored a 100% CTR for one keyword across the search network (content network excluded). What astonishes me about these stats is that we have a very small nj multimedia firm, with brands which aren't even well known (outside our office - or so we thought!) and for which we are still working to get registered service marks! And it still works! Why Brand-Thinking Works in PPC Not only was our CTR much higher when using the brand-identity-approach to ad campaign management, but our Cost Per Click (CPC) was dramatically lower! This is due, in part, to the fact that our brands - unlike generic keywords - are uniquely our own. No other business is really apt to use them. This means there is much less competition driving the keyword price up than for generic keywords. In addition, the landing pages for those brand-keywords are, as it were, perfectly crafted for those brand names. Thus, our Quality Score for those keywords is higher, thus bringing down the cost we have to pay per per click. Thinking about your brands, trademarks or service marks offers a fresh approach to Internet advertising and can greatly enhance your online marketing results. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Brand-Thinking and PPC Campaign Management"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Brand-Thinking and PPC Campaign Management"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Bryant\n          \n            Eric Bryant\n          \n            Eric Bryant"
}