{
  "url": "https://moz.com/blog/brand-seo-strategy-whiteboard-friday",
  "slug": "brand-seo-strategy-whiteboard-friday",
  "title": "How to Create a Brand SEO Strategy — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Miracle shares valuable insights on establishing your brand's online identity and dominating the SERPs in this informative Whiteboard Friday.",
  "content": "How to Create a Brand SEO Strategy — Whiteboard Friday Whiteboard Friday | Branding By: Miracle Inameti-Archibong September 29, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miracle Inameti-Archibong September 29, 2023 How to Create a Brand SEO Strategy — Whiteboard Friday Whiteboard Friday | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Miracle shares valuable insights on establishing your brand's online identity and dominating the SERPs in this informative Whiteboard Friday. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi, everyone, my name is Miracle Inameti-Archibong. I'm the head of SEO at John Lewis Finance. Welcome to \"Whiteboard Friday.\" Today I am going to be speaking to you about how to create your brand SEO strategy. Why do you need a brand SEO strategy? Now, why are we talking about brand SEO strategy? I mean, it's 2023. Traditionally, SEOs have always been after generic keywords, and that's not a bad strategy. I mean, that's where the search volume is, isn't it? However, if we're all competing in the same crowded space, then it gets really tricky to gain visibility. We've all seen the SERP evolutions. I mean, since 2000, there's been 233 major algorithm updates and it feels like Google and all search engines are constantly chasing the goalpost. And rather than running after them, why not get your customers to come directly to you? Now, I'm not saying don't go after the generic space. Please do, but we need to diversify our audience. In case there's an algorithm update, in case something changes, we have something to fall back on. Now, except you've been living under a rock, you've heard of AI. And we've all seen how search engines are integrating AI into the SERPs. And that means that visibility is going to get harder and harder, because with personalization, the data's gonna get brought back, and it's only the top brands that will most likely be included in that SERP. So we want to make sure that people are searching for us and they're coming directly to our content. Another thing is the increase in competition. Have you ever done a search? I mean, I did a search for hope, like a poem about hope, and I got over four million results. And all of the page titles look very, very similar. And it became really, really difficult for me to distinguish between which one I wanted. And so at the end of the day, I just went for a brand, a newspaper brand that I knew. And that brand identification helped me to identify what I wanted to see. And that's why we're talking about brand SEO because we want to make sure that your brand stands out in the SERP and people can come to you. How to start creating a brand SEO strategy Now, how do we start with this strategy? Become an entity The first thing is to make sure that your brand is a recognized entity. Google your brand. Does it trigger a knowledge panel? How do you get your brand to trigger a knowledge panel? How do you get Google to understand that that name is a brand, this is the product we sell, and this is who we target? First things first is to make sure that you are using a consistent naming convention. Across all your brand assets, your social medias, your platforms, make sure. The amount of times I've seen websites migrate or change their name, and although instead of like changing the name of their social media platform, they just abandon that one or close it down and create a new platform or a new entity. What you need to do is to make sure that you're being consistent across, you're taking ownership of any old assets you want, and you're pointing it in the right direction. Do you have a Wikipedia page? I know they're notoriously hard to get, but Google takes at least 70% of its content for the knowledge panel from there, so you want to make sure that you have one. Establish relationships between entities The next thing to do is to establish relationships between all of these identities. Now, when you search for, say, dresses, 'cause I've got a lovely dress on, when you search for dresses, what makes Google recommend, and maybe I search for Zara dresses, what makes Google recommend Forever 21 or H&M? What makes Google understand that all of these brands have a similar profile? So what you want to do is establish those links. There is a tool called TextRazor where you can take some of your content, put it in, and Google shows you some of the links and the associations that it's making with that content. So what you need to do is think about where you're building links, where you're getting citations, and make sure that you are targeting similar brands with competition that you want. Utilize schema markup Another thing to do is give a markup. Now, Google can crawl the web, they can understand content, but what you want to make sure you're making your content super clear. You want to make sure you're tagging up your organization schemas, your product, whatever you're doing that just makes it easier for search engines to understand what your content is about. Engage with your local audience Again, if your content is local, make sure that you're engaging with your local audience. Now, this is not just about starting off your GMB profile and feeling like, \"No, I'm done.\" This is about creating an engagement strategy. So responding to reviews, creating a review collection strategy, making sure that you're engaging with your audience so much that they want to like post about you, they want to take pictures and share with search engines. Because at this point, search engines value more what your consumers are saying about you than what you're saying about yourself. So you want to make sure that you're using all of the features, the post features, the promotion features, you're keeping everything up-to-date, you're answering questions, and you're really engaging with that audience. Dominate your brand’s SERP Again, are you dominating your brand's SERP? Now, I did a search. Traditionally, everyone just thinks that if your brand name is in that search, in the keyword when someone searches, you will rank position one. But that's wrong, as more brands are ignoring their brands and chasing after generic keywords. So I did a search for how to book a flight on Expedia. And surprise, surprise, Expedia, even though it's a big brand, was not in position one. Now, the site that was in position one is called Techboomer. They had a full article step-by-step guide, screenshots from Expedia's website on how to book a flight. They also had a video as well to accompany that, and that was what was in position one and two. Now, I went to Expedia's website and I tried to look for this content. I couldn't find it. And to make matters worse, Expedia is bidding on that keyword. So they are paying for their own brand traffic when they could have just been targeting it right by content, using content. Create a plan to maintain a positive brand reputation Again, we talked about reviews when you're part of local search. You want to make sure that you're doing the same, even though you're not in the local space. Where are people engaging with your content? What forms are people having chats about your brand, your products, whether you're doing well? You want to make sure that you're on there, you're getting all of that feedback, and you're targeting them with content that makes it easier for them to understand your product. You want to make sure that if you're on Trustpilot or whatever review tool you're using, that you're actively seeking to collect reviews and you're responding as quickly as possible. Build a top-of-funnel content strategy Again, you want to build a top-of-the-funnel content strategy. Now, a lot of SEOs shy away from this because it's really hard to measure, but if you're really intentional on the purpose of this and you work with the right channel, so this is not just an SEO strategy. You have to work with brand, social media, the product team to bring this into life. And the key to this is establishing your brand's online identity. Now, you want to give your brand, you want to position your brand so that it has a distinctive, unique identity. For instance, what makes someone an Apple? What makes someone an Android? And those two users, \"Well, I can never use the other product.\" And that's what you're trying to do. Establish who your brand is for and who you're targeting with your top-of-the-funnel content strategy. There's something called social identity theory, which states that if you can do this for your brand, people get like a boost of self-confidence when they associate with a brand because they feel like that brand understands them. And they became your marketers. They recommend your brand to other people. They advocate for your brand in the world. And that's what you want to do with your brand SEO strategy. Now, I'll finish on this note. If we are all targeting the same keywords, we are competing in a very, very crowded space. Your brand's online identity is your beacon. So make them come to you. Thank you. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create a Brand SEO Strategy — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create a Brand SEO Strategy — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Why do you need a brand SEO strategy?"
    },
    {
      "level": "H2",
      "text": "How to start creating a brand SEO strategy"
    },
    {
      "level": "H3",
      "text": "Become an entity"
    },
    {
      "level": "H3",
      "text": "Establish relationships between entities"
    },
    {
      "level": "H3",
      "text": "Utilize schema markup"
    },
    {
      "level": "H3",
      "text": "Engage with your local audience"
    },
    {
      "level": "H3",
      "text": "Dominate your brand’s SERP"
    },
    {
      "level": "H3",
      "text": "Create a plan to maintain a positive brand reputation"
    },
    {
      "level": "H3",
      "text": "Build a top-of-funnel content strategy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Miracle Inameti-Archibong\n          \n            Miracle Inameti-Archibong\n          \n            Miracle Inameti-Archibong"
}