{
  "url": "https://moz.com/blog/branding-success-how-to-use-ppc-to-amplify-your-brand",
  "slug": "branding-success-how-to-use-ppc-to-amplify-your-brand",
  "title": "Branding Success: How to Use PPC to Amplify Your Brand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You may be surprised to know that branding and PPC go hand-in-hand. Find out how to leverage your PPC campaigns to strengthen your brand and win conversions and loyalty from your customers.",
  "content": "Branding Success: How to Use PPC to Amplify Your Brand Paid Search Marketing (PPC) | Branding By: Purna Virji February 21, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Purna Virji February 21, 2017 Branding Success: How to Use PPC to Amplify Your Brand Paid Search Marketing (PPC) | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Here’s a question for you: Do you think a brand can influence your behavior outside of purchase preference? Put another way, will seeing the North Face logo make you want to take up hiking in the snow? A few years ago, researchers at Duke University conducted an experiment with 341 students. Their goal? Studying what makes a brand powerful and how we’re influenced by brands. As part of this study, the students were asked to complete what they were told was a visual acuity test. During this test, either an Apple logo or IBM logo flashed on the screen for a second, so quickly that the students were unaware they had been exposed to the logo. The participants then completed a task designed to evaluate how creative they were, listing all the uses they could think of for a brick. Are you surprised that students exposed to the Apple logo came up with not just more uses, but more creative uses? The experiment was also done using the Disney Channel logo and the E! logo – and the students were tested on their degree of honesty and dishonesty. Which logo exposure led to more honesty? If you thought Disney, you’re right. This is evidence that subliminal brand exposure can cause people to act in specific ways. Branding matters. For those of us who work in paid search, this whole “branding” thing, with its unintuitive KPIs, can seem nebulous and not something for us to worry about. We PPC-ers have specific goals and KPIs, and it’s easy for us to be seen as only a bottom-funnel channel. But we’re far more powerful than that. Here’s the truth: Brand advertising via PPC does impact the bottom line. I’ll share three key ways to build a framework for branding: Make choosing you easier.Show your customers you care.Make it easy to be a loyal customer. Chances are you’re taking some of these steps already, which is fantastic. This framework can guide you to ensure you’re covering all the steps of the funnel. Let’s break down how PPC can support all three of these key points. 1. Make choosing you easier Top brands understand their audiences really well. And what’s true of pretty much every audience right now is that we’re all looking for the fast fix. So if a brand can make it easy for us to find what we need, to get something done – that brand is going to win our hearts. Which is why getting your ad messaging right is critical. Something I notice repeatedly is that we’re so focused on that next advanced tactic or the newest feature that we neglect the simple basics. And that is how we get cracks in our foundation. Most accounts I look at perform brilliantly with the complex, but routinely make avoidable errors with the basics. Ad copy Ads are one of those places where the cracks aren’t just visible, they’re also costly. Let’s look at a few examples of ads with sitelink extensions. Example 1: What not to do What do you think of this ad? It’s a decent ad. It’s just not great. What’s hurting the ad is that the sitelinks are a broad – even random – mix of different paths and actions a person can take. We have a mix of product, social media, and spokesperson content. This is not likely to make anyone’s life easier. Even if I had been interested in the makeup, I might be distracted by the opportunity to meet Carrie Underwood, reducing the odds of a conversion. In trying to please too many different audiences, this ad doesn’t do a particularly strong job of pleasing anyone. Example 2: Sitelinks organized according to stage of interest Why not organize your sitelinks according to your customer’s stage of interest instead, like Clinique did here? This is brilliant. Clinique is acknowledging that some shoppers are here just to buy the makeup they always order – so “Shop Makeup” is the first sitelink offered. But other visitors have come to see what’s new, or to do research on the quality of Clinique skincare, and probably everyone is looking for that discount. Organizing sitelinks by your customer’s stage of interest also boosts brand by showing your customer that you care. We’ll talk more about that piece later. Example 3: Sitelinks organized according to customer’s need Here’s something smart: Organizing sitelinks according to what you already know your customers need. Harley Davidson knows that a potential customer coming to their website wants more than pretty pictures of the bike. They’re ready to schedule a test ride or even estimate payments, so these options are right at the top. They also understand that Harley Davidson is an aspirational product. I may want to estimate a payment or find information about my local dealer even before I know how to ride a bike. It’s part of the dream of joining the Harley lifestyle. They know this and make their customers’ lives easier by sharing links to learn-to-ride classes. Example 4: Give them multiple ways to choose you For brands targeting by geography and who have a local presence, including call extensions and location extensions is a must. As searches move from desktop to mobile, we know that local searches take the lead – and conversions on a local search happen within five hours of the search (source: Microsoft Internal research). Including call and location extensions helps shorten that conversion cycle. What I especially love about this ad is that they give you two different buying options. You can visit the store at the physical address, or if that is deemed out-of-the-way by the searcher, the ad entices them to shop Sephora with a discount code for an online purchase. This increases the odds that the shopper will choose Sephora as opposed to visiting a more conveniently located competitor. Indirect brand terms When people are looking for your service but not necessarily your brand, you can still make their lives easier by sharing answers to questions they may have. Of course, you’re already showing up for branded searches or searches directly asking for your product. But what about being helpful to your customers by answering their questions with helpful information? Bidding on these keywords is good for your brand. For example, Neutrogena is doing a great job at showing up for longer-tail keywords, and they’re also working to build the association between gentle makeup removers for sensitive skin and their brand. And here, Crest is doing a fantastic job in using their ad copy to make themselves stand out as experts. If anyone has questions about teeth whitening, they’re showing that they’re ready to answer them: This also helps you show up for long-tail queries, which are another increasingly critical aspect of voice search. 2. Show your customers you care If you can anticipate issues and show up when your customers are venting, you win. Professor Andrew Ehrenberg of South Bank Business School says that people trust strong brands more. They forgive your mistakes more easily. They believe you will put things right. And what better way to show your customers you care than by anticipating their issues? Be there when they want to complain Where’s the first place you go when you want to look something up? Most likely a search engine. Showing up well in the SERPs can make a big difference. Let’s look at an example. I did a search for complaints related to Disney, a brand with a strong positive sentiment. Surprisingly, the SERPs were filled with complaint sites. What could have helped Disney here would be if they ran ads on these keywords, with the message that they were keen to make things right, and here’s the best number to call and chat. Wouldn’t that diffuse the situation? Best of all, keywords like this would be very low-cost to bid on. What about showing up when potential customers are complaining about the competition? You could consider running ads for keywords related to complaints about your competition. I’d advise you to be careful with this approach since you want to come across as being helpful, not gloating. This strategy also may not lead to very many conversions – since the searcher is looking to complain and not to find alternative businesses – but given the low cost, it may be worth testing. Cross-channel wins As PPCs, we’re more powerful than even we give ourselves credit for. Our work can greatly help the PR and SEO teams. Here’s how. PR: As noted earlier, the search engine is the first place we go when we want to look up something. This is so very impactful that, as reported in the New York Times, Microsoft scientists were able to analyze large samples of search engine queries that could in some cases identify Internet users who were suffering from pancreatic cancer, even before they have received a diagnosis of the disease. This all goes to show the power of search. We can also harness that power for reputation management. Broad-match bidding can help PR with brand protection. Looking through broad-match search term reports, a.k.a search query reports (SQRs), can help to spot trends like recalls or a rise in negative sentiment. PPCs can send the PR folks a branded SQR on a regular basis for them to scrub through to spot any concerning trends. This can help PPC stand out as a channel that protects and monitors brand sentiment. SEO: Content marketing is a key way for brands to build loyalty, and PPC is an excellent way to get the content to the audience. Serving ads on key terms that support the content you have allows you to give your audience the info they really want. For example, if your SEO teams built a mortgage calculator as value-add content, then you could serve ads for queries such as “How much house can I afford?”: Taking this concept a step further, you can use high-value content to show up with ads that match the research stage of the customer’s interest. As PPCs, we’re often keen to simply show an ad that gets people to convert. But what if they’re not ready? Why should we either ignore them or show up with something that doesn’t match their goal? Take a look at these ads that show up for a research-stage query: The first ad from Sears – while very compelling – seems mismatched to the search query. Now look at the third ad in the list, offering 50 kitchen idea photos. This is a much better match to the query. If it were me searching, this is the ad I would have chosen to click on. What happens to the conversion? Well, the landing page of the “50 ideas” ad could feature some type of offer, say like what the Sears ad has to offer, and here it would be much more welcome. In this way, we could use higher-funnel ads as lead gen, with KPIs such as content impressions, lead form fills, and micro-conversions. This is such a win-win-win strategy: You’ve shown your customers you care for them and will be there for themYou’ve helped your colleagues get more exposure for their hard workYou’ve earned yourself cost-effective new leads and conversions. Boss move. Want more ideas? Wil Reynolds has some fantastic tips on how SEOs can use PPC to hit their goals. 3. Make it easy to be a loyal customer Growing customer lifetime value is one of the most worthwhile things a brand can do. There are two clever ways to do this. Smarter remarketing You liked us enough to buy once – how would you like to buy again? Show your customers more of what they like over time and they’ll be more attuned to choosing your brand, provided you’ve served them well. What about remarketing based on how long it’s been since the purchase of a product? This tactic can be seen as helpful as opposed to overtly sales-y, building brand loyalty. Think of how Amazon does it with their emails suggesting other products or deals we may be interested in. As a result, we just keep going back to Amazon. Even if they don’t have the lowest price. For example, what if a sports nutrition company knew that most customers took three months to finish their box of protein shake powder? Then around the middle of month two, the company could run an ad like this to their list of buyers. It features an offer and shows up just at the right time. The customer will probably think they’ve lucked out to find a special offer just at the right time. We know that it’s not luck, it’s just smarter remarketing. Want more ideas? Check out Sam Noble’s Whiteboard Friday on how paid media can help drive loyalty and advocacy. Show up for the competition Remember when the iPhone 6s launched? Samsung ran very clever PPC ads during the launch of the iPhone 6s, and again when Apple was in the news about the phones bending. Samsung used humor – which, importantly, wasn’t mean-spirited – and got a lot of attention and goodwill, not to mention a ton of PR and social media attention. Great for their brand at the time! You can use the same tactic to run ads on competitors’ brand names with ads that showcase your USP. This works especially well for remarketing in paid search (or RLSA) campaigns. Here, Chevy capitalized on the Tesla Model 3 announcement-related search volume spike. They ran ads that reminded users that their cars were available in late 2016, with the unstated message that it’s much sooner than when the Tesla Model 3 cars are expected to arrive. Give back Engaging with the customer is the best way to make it easy for them to be loyal to your brand. Enhance that by showing them you care about what they care about for added impact. Here’s one way to give back to your customer, and this particular effort is also a huge branding opportunity. I love how L’Oréal is associating themselves with empowering women – and most of their customers will like this as well. They’re giving back to their customers by honoring the women they care about. To create loyal customers, the best brands give back in meaningful ways. Wrapping up One of my favorite Seth Godin quotes is, “Marketing is no longer about the stuff that you make, but about the stories that you tell.” PPC is a wonderful channel to shape and create stories that will engage and delight your customers. And now we come full circle, to that place where we started, wondering how in the world PPC can impact brand. Your paid search campaigns are a chapter in your brand’s story, and you have an unlimited number of ways to write that chapter, and to contribute to the brand. Branding isn’t just for the birds. Have you found a way to use PPC to help grow your brand? I’d love to hear your ideas in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Branding Success: How to Use PPC to Amplify Your Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Branding Success: How to Use PPC to Amplify Your Brand"
    },
    {
      "level": "H2",
      "text": "1. Make choosing you easier"
    },
    {
      "level": "H3",
      "text": "Ad copy"
    },
    {
      "level": "H4",
      "text": "Example 1: What not to do"
    },
    {
      "level": "H4",
      "text": "Example 2: Sitelinks organized according to stage of interest"
    },
    {
      "level": "H4",
      "text": "Example 3: Sitelinks organized according to customer’s need"
    },
    {
      "level": "H4",
      "text": "Example 4: Give them multiple ways to choose you"
    },
    {
      "level": "H3",
      "text": "Indirect brand terms"
    },
    {
      "level": "H2",
      "text": "2. Show your customers you care"
    },
    {
      "level": "H3",
      "text": "Be there when they want to complain"
    },
    {
      "level": "H3",
      "text": "Cross-channel wins"
    },
    {
      "level": "H4",
      "text": "PR:"
    },
    {
      "level": "H4",
      "text": "SEO:"
    },
    {
      "level": "H2",
      "text": "3. Make it easy to be a loyal customer"
    },
    {
      "level": "H3",
      "text": "Smarter remarketing"
    },
    {
      "level": "H3",
      "text": "Show up for the competition"
    },
    {
      "level": "H3",
      "text": "Give back"
    },
    {
      "level": "H2",
      "text": "Wrapping up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Purna Virji\n          \n            Purna Virji\n          \n            Purna Virji"
}