{
  "url": "https://moz.com/blog/brands-take-to-instagram-for-marketing",
  "slug": "brands-take-to-instagram-for-marketing",
  "title": "Brands Take to Instagram for Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Almost two and a half years after Instagram's initial launch and one year after Facebook’s acquisition of the mobile app, it boasts 100 million monthly active users. Instagram’s numbers are astounding, and brands have taken note. Few early adopter brands began using the app in 2011, but lately…",
  "content": "Brands Take to Instagram for Marketing Branding By: Nicole Small May 29, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nicole Small May 29, 2013 Brands Take to Instagram for Marketing Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Brands Captivate Users with Photo Sharing Instagram: The Hot New Marketing Channel Instagram began as a mobile app similar to Foursquare, but the creators stripped many of the original features to develop the app we know and love today: a space to share, like, and comment photos. Within the first three months of existence, the app’s community grew to over a million users. Now, almost two and a half years after the app’s initial launch and one year after Facebook’s acquisition of the mobile app, Instagram boasts 100 million monthly active users. Instagram’s numbers are astounding, and brands have taken note. Few early adopter brands began using the app in 2011, but lately there has been a noticeable increase in companies using the app for contests, giveaways, and other marketing tactics. Instagram boasts 40 million photos per day with upwards of 8500 likes and 1000 comments per second. Most Instagram users are regular people, posting pictures from their day-to-day lives, but a growing trend is emerging with brands taking to Instagram to boost their social media management. More brands are beginning to not only have an account in Instagram, they are posting upwards of 20 or more times per month, which is helping to increase engagement and followers. The Best Industries for Instagram Marketing Intel has proven that even seemingly mundane industries can have an interesting Instagram profile, but it is definitely easier for some industries than for others. Companies with a visually-driven product or service offering will have a much easier time using Instagram to its fullest. In addition, brands or celebrities who want to showcase a “behind the scenes” look will also do very well on the app. Some of the best industries include: Food and Beverage Hospitality Entertainment Fashion Design Who is Using Instagram? Many brands have begun to use Instagram to market their company image, and a handful of these brands are doing an excellent job. The following four brands have gathered tens to hundreds of thousands of followers because they use interesting tactics to engage with their fans: Starbucks With over 1.2 million followers, Starbucks (http://instagram.com/Starbucks) uses user-submitted photos mixed with behind the scenes photos of coffee roasting, their equipment, the original pike place location, and other creative photos to engage their followers. Red Bull Red Bull’s (http://instagram.com/redbull) Instagram following has grown to over 701,000. The energy drink company posts exciting, high-energy photos depicting various adventures and stunts. These photos support the brand’s tagline, “Red Bull Gives You Wings.” adidas Originals The adidas Originals (http://instagram.com/adidasoriginals) Instagram account has over 630,000 followers. This account differs from the adidas company account because it showcases photos of new merchandise alongside photos of the various ways that Adidas customers use their merchandise, like mismatched adidas shoes, wearing them out, or celebrities who support the brand. These photos make this specific account more exciting than the adidas company account, which posts many general and commercial-looking photos of their products, yet this account still has 237,000+ followers. American Express (AMEX) American Express (http://instagram.com/americanexpress) has capitalized on their card rewards by using their Instagram account to showcase “exclusive experiences, news and rewards,” as stated in their account tagline. Their photos show off the food and entertainment side of American Express rewards as well as behind the scenes at the American Express HQ, like take your daughter/son to work day. Their charming and exciting photos have resulted in over 27,000 followers. Benefits of Instagram for Brands Instagram is one of the most popular apps for many people; users spend time browsing pictures, and if a brand’s photo is one of the pictures in their feed, then the use of Instagram successfully keeps the brand’s name on the user’s mind. This could lead to the user following the brand’s Instagram account if they aren’t already, and further engaging with the brand on Instagram. Call to Action One of the biggest benefits of using Instagram as a brand is the ability to plug a Call to Action (CTA) into many posts. Brands are taking advantage of this by promoting sales, promo codes, new products, contests, events, and other related topics, and followers are responding. Brands that attach deals to their Instagram photos may see an increase in their followers, and some muse that it may be a good way to retain followers as well. Instagram provides multiple opportunities to add links and Calls to Action. In the account summary of every Instagram profile there is an option to provide a URL which shows in clickable form on the brand’s Instagram profile. Unfortunately, Instagram does not currently support clickable links in captions and comments of individual photos, but the app does support hashtags, which are words or phrases preceded with the # symbol. Humanize a Brand Like social media, Instagram has the huge benefit of humanizing a brand. Many times brands can be seen as unreachable or objectified, but brands have been slashing through this ideology by posting pictures of “behind the scenes” in offices, studios, and on the go. By doing so, Instagram users get a better idea of what a company is really about. Fashion brands have uploaded photos backstage of runway shows and photo shoots, big corporations have shown peeks into day-to-day office life, and the trend keeps growing. This shows Instagram users that these brands are actually approachable and that real people are behind the shiny logos. Social Media Integration To further this effort, brands are using Instagram’s built-in social sharing, which allows the same photos on Instagram to be shared on the company’s Facebook, Twitter, Tumblr, Flickr or Foursquare. The two most commonly used of these are Facebook and Twitter. Even though Twitter doesn’t support Instagram photos in the convenient way that it used to, social sharing has become one of the best benefits for brands using Instagram. Instagram takes it one step further and allows the option to share photos on any Facebook page that the user is an admin of. To activate this, go to Settings which is the gear icon on your profile page. Then scroll down and select “Share Settings,” then “Facebook,” then “Share photos to,” and allow it to authorize posting on your behalf. You will now have the option to select a personal timeline or a Facebook page (company page or otherwise). Once you have set this up, all of your photos that you choose to share to Facebook will automatically post on the page that you select in the settings. After setup, this option is also available for photos that have already been posted; to do so simply select a photo from your profile and tap the “…” icon next to the like and comment buttons. Select “Share Photo” and choose which social networks you would like to share to. By setting up Instagram to share photos on the company’s Facebook page, brands can seamlessly link these social accounts together. Instagram Brand Marketing Techniques There are many different marketing strategies that can be instrumental when using Instagram for brands. Some of these include photo enhancement, hashtag use, contests and social sharing. Photo Enhancement Instagram draws users in with the vintage look and feel of the filters available. The app currently features 20 different photo filters, all designed to give users’ pictures a vintage or analogue photography form. The app also offers the ability to add blur and to adjust the contrast. The statistics for filter use among brands shows that about 50% of brands don’t use any sort of filter for their photos while the other 50% do use filters to enhance the picture. The most popular filter for brand photos is L0-fi3. Hashtags Hashtags, as previously stated, are words or phrases preceded by the # symbol. They act as categories on Instagram, similar to their purpose on Twitter. Hashtags can be used to tag a brand, a specific product line, or virtually any word or phrase imaginable. It serves as a way to search for different categories, like #nature, #happyhour, or #style. Many user-created hashtags have been made popular on the app and are used daily, like #instagood. The best way for brands to engage in this trend is to create their own hashtag and give their fans an incentive to use it. For example, Red Bull uses the hashtag #GivesYouWings, and BMW uses #SheerDrivingPleasure. These hashtags can be used by anyone on any photo, but the best way to encourage their use is with a contest. Contests Contests are one of the best ways to engage current fans and gain new ones. Most contests are centered on a specific hashtag that is created by the brand for the specific contest. The prizes for these contests vary; some brands offer one prize per week and then a grand prize at the end of a time frame, and others just offer one grand prize. One example of a current contest is RA Sushi’s #RAShoutOut program: RA Sushi RA Sushi (http://instagram.com/rasushi) is a little newer to Instagram, and they recently rolled out an Instagram contest. To enter, Instagram users simply have to follow @RAsushi on Instagram, take a photo at any RA restaurant and post it using the hashtag #RAShoutOut. Each week one winner is chosen and granted a $25 gift certificate to RA. There are many past contests that have gotten a lot of fan attention. Here are a few of them: T.J.Maxx Last month T.J.Maxx (http://instagram.com/tjmaxx) held a contest for “maxxinistas” everywhere. For the month of April, T.J.Maxx encouraged Instagram and Twitter users to shop at T.J.Maxx and create a designer outfit. Then users could post a picture of them wearing their new outfit with the tag #MaxxStyle, along with the designer name and how much they paid. Not only did fashion-focused fans get to be featured on T.J.Maxx’s Facebook page, each week T.J.Maxx rewarded one person with a $50 gift card and a grand prize winner got a $500 gift card to the store. GE Instagrapher Contest General Electrics (GE) (http://instagram.com/generalelectric) hosted a contest to select the next GE “Instagrapher,” the brand’s next Instagram photographer. Users were encouraged to post pictures using the hashtag #GEinspiredME on photos based around the four ways that GE works: building, powering, moving and curing. Over 4,000 images came pouring in, all with the goal of winning the grand prize: to be the next GE Instagrapher with the chance to be flown to the UK to photograph a GE jet engine plant. Social Sharing As previously mentioned, Instagram makes it incredibly easy to link to a brand’s various social media accounts. After a quick and easy setup, brands (and regular users) can post their Instagram pictures to Facebook, Twitter, Tumblr, Flickr and Foursquare. They can also add a location to tag a specific store, restaurant, office or otherwise to further enhance the brand’s image. With so many options for sharing, brands would be smart to take advantage of this built-in feature. New Instagram Feature Instagram has just launched the preview version of its new feature, Add People. This feature enables tagging pictures, similar to Facebook’s tagging. A person or brand can tag any Instagram user, whether it is a brand’s profile or a person’s. This feature is available for immediate use in the new Instagram updates 3.5 and 3.5.1. The Add People feature could be a great tool for brands to promote, via contest or otherwise, to encourage Instagram users to tag their account. These photos differentiate from hashtags because they will appear on a special new tab on the brand’s profile. This feature will go live on May 16th, 2013. Until then, Instagram users are encouraged to play with the feature and tag themselves and friends. (editor's note: this post was submitted before the feature went live) A Great Tool for Brands Instagram is a great tool for brands to market their business. More and more brands are catching on to these tactics and creating new techniques to engage followers and to enhance their marketing efforts. Mobile marketing is becoming more critical each day, and Instagram offers a fun, fresh integration while keeping the public involved. The beauty of Instagram marketing is that brands don’t force their message on people; the people choose to engage with the brand, and therefore, the brand’s marketing message. If only all aspects of marketing were this easy! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Brands Take to Instagram for Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Brands Take to Instagram for Marketing"
    },
    {
      "level": "H2",
      "text": "Brands Captivate Users with Photo Sharing"
    },
    {
      "level": "H3",
      "text": "Instagram: The Hot New Marketing Channel"
    },
    {
      "level": "H3",
      "text": "The Best Industries for Instagram Marketing"
    },
    {
      "level": "H3",
      "text": "Starbucks"
    },
    {
      "level": "H3",
      "text": "Red Bull"
    },
    {
      "level": "H3",
      "text": "adidas Originals"
    },
    {
      "level": "H3",
      "text": "American Express (AMEX)"
    },
    {
      "level": "H3",
      "text": "Benefits of Instagram for Brands"
    },
    {
      "level": "H3",
      "text": "Call to Action"
    },
    {
      "level": "H3",
      "text": "Humanize a Brand"
    },
    {
      "level": "H3",
      "text": "Social Media Integration"
    },
    {
      "level": "H2",
      "text": "Instagram Brand Marketing Techniques"
    },
    {
      "level": "H3",
      "text": "Photo Enhancement"
    },
    {
      "level": "H3",
      "text": "Hashtags"
    },
    {
      "level": "H3",
      "text": "Contests"
    },
    {
      "level": "H3",
      "text": "RA Sushi"
    },
    {
      "level": "H3",
      "text": "T.J.Maxx"
    },
    {
      "level": "H3",
      "text": "GE Instagrapher Contest"
    },
    {
      "level": "H3",
      "text": "Social Sharing"
    },
    {
      "level": "H3",
      "text": "New Instagram Feature"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nicole Small\n          \n            Nicole Small\n          \n            Nicole Small"
}