{
  "url": "https://moz.com/blog/bring-back-link-ninjas-jim",
  "slug": "bring-back-link-ninjas-jim",
  "title": "Bring Back Link Ninjas, Jim - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A couple months ago, Jim Boykin and crew at WeBuildPages launched a training seminar called \"Link Ninjas\". In my opinion, not only was this a damn cool idea, it was well executed and a good way to get training in that most difficult of SEO ...",
  "content": "Bring Back Link Ninjas, Jim SEO Events By: Rand Fishkin December 30, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 30, 2005 Bring Back Link Ninjas, Jim SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A couple months ago, Jim Boykin and crew at WeBuildPages launched a training seminar called \"Link Ninjas\". In my opinion, not only was this a damn cool idea, it was well executed and a good way to get training in that most difficult of SEO areas - link building. In fact, I thought it was so cool, Kat (our new employee) is going to the intitial seminar on Jan. 18 and staying for the second $2K day on Jan. 19th. Today, though, I discovered that Jim is cancelling the program! In it's stead he want to start an SEO gathering called the SEO Powwow. I got an invitation, but sadly cannot attend (already have way too many trips planned for 2006). RISE UP: I want to save Jim's Link Ninjas program - I think it's a great idea and just needs to get rolling with some promotion, so let's band together and post futiley in the comments to show our disdain for the cancellation!!! Not that anyone's reading the blog on the Friday before New Year's Eve :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bring Back Link Ninjas, Jim"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bring Back Link Ninjas, Jim"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}