{
  "url": "https://moz.com/blog/browser-compatibility-what-really-matters",
  "slug": "browser-compatibility-what-really-matters",
  "title": "Browser compatibility - what really matters? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let me start by saying I am not a web designer. I am an SEO consultant, and as such, I have been a part of many site redesigns.  Recently, while working on a new launch for an existing site, the discussion of browser compatibility came up.  Of course, the designers all weighed in with the Mac /…",
  "content": "Browser compatibility - what really matters? Design By: Anthony Kirlew September 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Anthony Kirlew September 20, 2007 Browser compatibility - what really matters? Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Let me start by saying I am not a web designer. I am an SEO consultant, and as such, I have been a part of many site redesigns. Recently, while working on a new launch for an existing site, the discussion of browser compatibility came up. Of course, the designers all weighed in with the Mac / Safari votes (no ill intent, just making the Mac / design connection) and the lead designer assured the team that the site would be cross platform and cross browser compatible. When we went to demo the site, I was told that it works in every browser except for IE 6.0, which may not seem like a problem to some. But here was my problem; the stats showed that the number one browser used to view this site was... you guessed it - IE 6.0. Safari, which everyone was up in arms about, was viewed by less than 0.5% of the site visitors (and I think most of that usage was from those same designers lobbying for it). So the moral of the story is \"what really matters\" is what your audience is using. Just as in life, you can't be everything to everyone or make everyone happy. Make sure you are looking out for your primary audience and you usually won't go wrong. I am not saying to avoid the rest of the browesrs, but if your site is a few pixels off in a browser that 8 out of every 10,000 people use and you are investing a day of your teams time trying to fix it, that may not be the most efficient use of resources. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Browser compatibility - what really matters?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Browser compatibility - what really matters?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Anthony Kirlew\n          \n            Anthony Kirlew\n          \n            Anthony Kirlew"
}