{
  "url": "https://moz.com/blog/bug-me-not",
  "slug": "bug-me-not",
  "title": "Bug Me Not - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "BugMeNot is a nifty tool that acts either as a one-time viewer for content sites or a plug-in that lets you surf through without entering a username or password. It reminds me most of the grocery store checkers who simply swipe the store copy of the \"...",
  "content": "Bug Me Not SEO Analytics By: Rand Fishkin October 18, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 18, 2005 Bug Me Not SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. BugMeNot is a nifty tool that acts either as a one-time viewer for content sites or a plug-in that lets you surf through without entering a username or password. It reminds me most of the grocery store checkers who simply swipe the store copy of the \"savings card\" for you, rather than forcing you to dig in your pocket to get your own. As much as I like them, I thought that among these very reasonable statements, the one I've bolded is more than a little ignorant: Why not just register? It's a breach of privacy. Sites don't have a great track record with the whole spam thing. It's contrary to the fundamental spirit of the net. Just ask Google. It's pointless due to the significant percentage of users who enter fake demographic details anyway. It's a waste of time. It's annoying as hell. Imagine if every site required registration to access content. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bug Me Not"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bug Me Not"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}