{
  "url": "https://moz.com/blog/building-a-local-marketing-strategy-franchises",
  "slug": "building-a-local-marketing-strategy-franchises",
  "title": "Building a Local Marketing Strategy for Franchises [Guide Sneak Peek] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Franchises know how to market at the national level, but often lack the tools for reaching their local consumers. What they need is marketing plan capable of scaling from national priorities to hyperlocal customers — this excerpt from our guide explains how.",
  "content": "Building a Local Marketing Strategy for Franchises [Guide Sneak Peek] Local SEO By: Miriam Ellis November 13, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 13, 2019 Building a Local Marketing Strategy for Franchises [Guide Sneak Peek] Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A roller is a good tool for painting a house in big, broad strokes. But creating a masterpiece of art requires finer brushes. Franchises face a unique challenge here: they know how to market at the national level, but often lack the detailed tools for reaching their local customers at a granular level. Google has stated that localization of search results is the greatest form of personalization they currently engage in. For franchises, where local sensitivity is lacking in the marketing plan, opportunity is being lost. Don’t settle for this. Know that less-motivated competitors are losing this opportunity, too. This creates a large, blank canvas for a franchise you’re marketing to paint a new picture which takes state, regional and community nuances into account. One famous example of localized marketing is McDonald’s offering SPAM in Hawaii and green chile cheeseburgers in New Mexico. For your franchise, it could revolve around customizing content for regional language differences (sub sandwich vs. po’ boy), or knowing when to promote seasonal merchandise at which locations (California vs. North Dakota weather). What you need is marketing plan capable of scaling from national priorities to hyperlocal customers. Want the complete strategy now? Get The Practical Guide to Franchise Marketing From paint roller to sumi-e brush: A franchise marketing plan Today, we’ll explore the basics of getting to know your local customers, so that your national franchise can customize how you serve them. Build a strategy around the following: Your step-by-step guide to how to create a local marketing strategy Finding your target audience First, you need to understand who your customers are. If you have an existing franchise, you can do this fairly easily by simply observing or asking them. You might run an online survey, or you might do some quick spot interviews right in your place of business. What you want to work out is: Demographics: What are the common ages, genders, income levels, and other relevant characteristics of your customers. Psychographics: How do your customers think? What are their attitudes, behaviors and beliefs as they relate to your franchise?Pain points: What problems do your customers have that you could potentially solve? Maybe they want to eat healthy but have no time. Maybe they want a gym that will help them become better athletes. Consumption habits: How do your customers decide where to buy? Are they online? Do they have smartphones? Do they prioritize reviews/recommendations? Do they like video, or podcasts? Which social platforms do they frequent? What events do they attend? Understanding the customer’s journey Marketers spend a lot of time thinking about what we call the “customer journey.” This is just another way of saying we want to understand what happens between us and customers before they know our brand exist, after they discover it, up until they buy, and then beyond. The best way to do this is to divide that experience into steps, understanding that some people will drop out of the process at every stage. Most corporate franchisers will recognize this as the “sales funnel.” Here’s a simplified version of a sales funnel. Take the time to determine what happens at each stage in your own customers’ experience, and you’ll be a long way toward understanding how you can influence and help customers from one step to the next. Mapping a sales funnel AwarenessThis is where a customer first discovers you exist and starts to form an opinion about you based on what they see. Often, this is managed by the activities being conducted by corporate franchisors (like a national TV ad campaign). But, it can also happen through franchisee-generated references and referrals (like a searcher discovering you via a Google Maps search on their phone).DiscoveryThis is where a customer has already absorbed information about you and your product and begins to actively try to learn more about it. This stage often encompasses online research. It local word-of-mouth queries between potential customers and their friends and family.EvaluationThis is where a customer has decided to probably purchase something similar to what you offer, but is trying to decide where to buy. They might stop by your business in this stage, or they may give you a call. They might visit your online website or listings to look at your hours, or menu or price list. This stage is influenced by both franchisor and franchisee activity.IntentNow the customer has decided to buy from you — which means they are your customer to lose. Franchisors can lose them at this stage through misinformation in the brand’s local business listings — like incorrect hours or bad directions that lead customers to the wrong place and cause them to give up. Franchisees could lose the business through poor on-premises experiences — like uncleanliness, long wait times, low inventory, pricing, or poor customer service.PurchaseThis is where the transaction takes place, and is generally entirely within the control of the franchisee.LoyaltyThis stage determines whether the customer will return to buy again, and whether or not they will become an advocate for your business, give you good reviews, or rate you poorly. Again, this is typically within the control of the franchisee unless the issue is a decision made at the franchisor level, such as product/menu, pricing or policy. Sometimes this whole funnel can take place in the time it takes to spot a sign for ice cream and purchase a double scoop sundae. Sometimes it may take weeks, as your customers labor over the right financial advisor to choose. Understanding how your customer is thinking and what goes into making the decision to use you is important and will guide decision-making and sales activity at both the franchisor and franchisee levels. Scoping out the competition Most brands have already worked out their positioning with regard to other national brands, so this one is mainly for franchisees. Take some time to figure out who your direct competitors are in your local market. They might be other big brands, but there will also probably be local SMBs that are not on the corporate franchisor’s radar. Understand: Where they are stronger or weaker, compared to youWho they attract, compared to youHow they are marketing their business Having this information should help you to position yourself to win a bigger piece of the local pie. Is your competitor a gym that has better weight training and machines than you? Are they marketing mainly to younger men and athletes? Are they advertising on local radio? Perhaps you should double down on your cardio and yoga classes and try to attract more women or older clientele. Maybe adding some nutrition classes will encourage people trying to lose weight. And so on. Building your authority Once you’ve figured out who your customers are, how they buy, and how you plan to position your franchise in the local market, it’s time to put that plan into action by creating some content to support it. For franchisors at corporate this means putting in the time to create an informative, interesting brand website with dynamic, engaging content. Your content should aim to educate, inform and/or entertain, rather than only sell. The more points of engagement your website offers to customers, the more reason they have to read, share, and link to your content, building authority. Your most valuable content will, of course, be the elements or pages that directly convert visitors into customers. The content you put out over social media should follow this same precept, and lead back to your site as often as possible. Experts suggest that “60% of your posts you create should be engaging, timely content, 30% should be shared content, and only 10% should be promoting your products & services.” (Medium) Invest some time in link building, in order to show Google’s algorithm how influential your site is and boost your authority and ranking. Here are a few tips: Use Moz’s “Find Opportunities” feature to locate sites which are linking to your competitors and not you (yet).Look for people who are already referencing your site and ask them to hyperlink to you.Do a little PR or news-making and ask articles to link to your site. (This is something local franchisees can excel at.)Ask for links from local trade organizations, community organizations or commerce groups.Sponsor events and ask for a link.Start a scholarship and post it on local .edu sites. Find out more about link building and unstructured citation and how to increase them in The Guide to Building Linked Unstructured Citations for Local SEO. Managing channels and budgets efficiently Armed with good, authoritative content and an effective website, you’ll want to focus on how you manage all the channels available to you. This also includes managing your budget effectively. Most franchisor budgets are focused on the brand, and many franchisees don’t have a lot left over for local marketing, but here are some things to think about. Listings first: Your listings aren’t expensive to manage, but they give your marketing it’s biggest overall value — in some cases literally guiding people to your registers. Make great local business listings your top priority.Claim everything: Franchisors, be sure you are the one in control of your directory listings and social profiles. Complete your Google My Business profile and establish a presence on key social media and review platforms like Facebook and Yelp. Budget wisely: Do the strategy work to understand who your customers are and how best to reach them before you allocate your franchisor or franchisee marketing dollars. Pointillism for franchises Adept franchise marketing requires the eye of Seurat: the ability to see life in hundreds of tiny points, making up a masterpiece. For you, franchise pointillism includes: Points representing each customerPoints for the customer’s community, as a wholePoints representing your locations on the mapPoints across the web where engagement happensPoints offline where engagement happensPoints of resource at all levels of the franchise, from franchisor to franchisee Ready for expert help from Moz in seeing the finer points? Download your copy: The Practical Guide to Franchise Marketing Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Building a Local Marketing Strategy for Franchises [Guide Sneak Peek]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Building a Local Marketing Strategy for Franchises [Guide Sneak Peek]"
    },
    {
      "level": "H3",
      "text": "From paint roller to sumi-e brush: A franchise marketing plan"
    },
    {
      "level": "H2",
      "text": "Your step-by-step guide to how to create a local marketing strategy"
    },
    {
      "level": "H3",
      "text": "Finding your target audience"
    },
    {
      "level": "H3",
      "text": "Understanding the customer’s journey"
    },
    {
      "level": "H3",
      "text": "Mapping a sales funnel"
    },
    {
      "level": "H3",
      "text": "Scoping out the competition"
    },
    {
      "level": "H3",
      "text": "Building your authority"
    },
    {
      "level": "H3",
      "text": "Managing channels and budgets efficiently"
    },
    {
      "level": "H2",
      "text": "Pointillism for franchises"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}