{
  "url": "https://moz.com/blog/building-links-with-digital-pr",
  "slug": "building-links-with-digital-pr",
  "title": "Building Links with Digital PR Is Hard - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn about why building links with digital PR is so hard, and understand what you can do to take the pressure off.",
  "content": "Why Building Links with Digital PR Is Hard — And That’s OK! Public Relations | Link Building By: Jo O'Reilly Edited By: Emilie Martin February 14, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jo O'Reilly Edited By: Emilie Martin February 14, 2024 Why Building Links with Digital PR Is Hard — And That’s OK! Public Relations | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Digital PR is hard. Now we’ve got that one irrefutable fact out of the way; don't let anyone tell you otherwise. I appreciate that it can sometimes look deceptively easy. A digital PR team pulls some data, pastes it into a press release, sends an email to a few journalists, and then suddenly (as if by magic!) those mythical 90+ DA links start rolling in. I promise you that it might look easy, but what you're seeing is just the tip of the iceberg. There is an awful lot of experience, skill, knowledge, timing, and even luck required each time a digital PR link is built. Everybody hates link building OK, look, I know this is a crass generalization. Not everyone hates link building. Plenty do, though; in fact, I was talking to someone the other day who said, “I just hate link building in general, PTSD from when I was a PR, I think.” I suspect this extreme response was partly to do with the expectation of SEOs just being expected to pick up a little light digital PR on the side. As if it is something that they can easily bolt on to their other responsibilities, but we'll cover that further down. The reason people hate link building is because it's hard, time-consuming, and often, speculating on the ROI feels out of reach of mere mortals. The point is building links is consistently voted as the least favorite SEO activity, and I’ve seen multiple x (or Twitter) polls showing that, including this one from Brodie Clark back in 2021. Yes, almost two years later and digital PR hasn’t gotten any easier. In fact, it seems digital PR is getting harder. This poll by US Digital PR Specialist Dominica D'Ottavio shows that over 75% of us are finding it harder to build links with digital PR in 2023 than we were previously. What's so hard about it anyway? Well, everything, apparently. I asked SEO and digital PR Twitter what they found hard about it, and these were the results: Results were mixed, but as a rule, most people found ideation and outreach the most difficult. Outreach Outreach is difficult, and understanding what journalists want and don’t want is difficult, especially for those new to the game. Try to figure this out for yourself, and you’ll be inundated with conflicting information from both your peers and from journalists themselves. The game is incredibly subjective, and no two journalists, PRs, or publications are the same. Knowing when to appropriately slot your client into a story both effectively and tastefully takes a lot of understanding of the media landscape. The kind that can only be learned by interacting with the media on an ongoing basis. My own ‘news sense’ is something I’ve honed after years of working in and consuming the media. There is no quick fix to level up your media literacy. It takes consistent consumption of news content to be a good digital PR. That said, it's the kind of job where being ‘very online’ can be as good as a degree. Much like SEO, some of the best digital PRs I've worked with have never studied digital marketing and learned their trade on the job. Ideation The next most difficult thing is ideation. I am not surprised; one of the most challenging things in this role is constantly coming up with new and fresh ideas. To get a client's website in front of the press in a way that makes them want to write about and crucially link back to the webpage is, at times, exhausting. Having to be a constant source of new and fresh ideas in a world of high-pressure link KPIs can sometimes feel like too much, especially when asked to do it on the spot in a meeting. Nearly all of my best ideas come to me when I am not sitting at my desk or in a meeting room. Instead, they happen when I am out for a walk, in the supermarket, or when I am doom scrolling TikTok late at night. Also, we don’t help ourselves by only talking about our successes. You will rarely catch us sharing the hundreds of unopened emails and disheartening unsubscribes on LinkedIn. We don’t share the campaigns that have just failed to launch, no matter how we try to realign or re-pitch them. This, unfortunately, leads to a huge amount of imposter syndrome within the industry, as this poll from freelance Digital PR Thea Chippendale shows. Link-building gurus and easy HARO Links But wait a minute — I’ve seen people say they have had loads of digital PR success building links in top publications like with HARO for free; how hard can it really be? Despite what you might see on LinkedIn and/or Twitter (are we calling it X yet?), it’s not that easy to build decent HARO links. The platform is saturated, and coverage is not guaranteed; many people find this out early on and get discouraged after spending hours crafting responses to hear nothing back. There are more than a million sources signed up to HARO, and that number grows daily. In order to cut through the noise, you have to have a really good understanding of what makes the media and journalists tick. After all, HARO is an acronym for Help A Reporter Out. So go into it with that mindset. You need to be providing quality, topical insights and opinions, from a real and reputable source who is either experienced in or an expert on the topic. You can do all this and still never receive an acknowledgment, let alone a link. Disheartening for sure. Automation is not the answer There are plenty out there who will tell you that AI is the solution to the labor-intensive task of responding to HARO and other journalist requests in order to build links. These people claim they have a tried and tested solution to automate the entire HARO process, from selecting niche-appropriate requests to crafting a reply and sending it to the journalists. All without an iota of human oversight or a second of your time. Naturally, these people want you to believe this works because they want you to pay for this service. But using it in this way is honestly not going to end well; you can imagine how frustrating it must be for a journalist to put out a request asking for comments from an expert and to be inundated with hundreds of automated responses, not from experts but from AI-generated website authors. You can almost guarantee that 99% of them will look the same since they’re all putting the same prompt into ChatGPT. It’s becoming a genuine ethical issue in the digital PR industry and one I’ve written about before here. AI, when used ethically and correctly, is brilliant, but it is not the quick fix to link building you may have been told it is. Square pegs, round holes It’s confession time. I would make terrible tech SEO. Yes, I know, this is an SEO blog. I know that I am here in this space writing about SEO as a subject matter expert; however, I am writing about digital PR, which is a very specific niche within SEO. I do not have any of the skills, experience, or qualities required to be an effective tech SEO specialist. You could teach me some very basic tech SEO tasks, and I could hopefully complete them without no-indexing your entire website. I make no promises that I could do any of it without crying, however. It will never be my specialty, and that’s OK. That’s OK because it is very unlikely a client would come to me and ask me to get involved in their tech SEO. If they ever did, I would signpost them to one of the many wonderful tech SEO experts I know. In fact, in my career, both in-house and agency side, no one has ever come to me and expected that because I was a digital PR who could do a little tech SEO as well. Put simply, it’s just not expected of us. So why, then, should SEOs be expected to build links on the side of their already full plates? The value of specialists in SEO Now, I need to caveat this; of course, there are some unicorns out there who are incredible tech SEOs and also very good digital PRs. I know one or two of these people, and I'm jealous. However, that does not apply to most of us in the industry, nor should it. We should be looking at digital PR and SEO as two interconnected but different channels and respecting the skill, time, and effort that both take. The two channels should inform and complement each other, and collaboration between both can often be what sets apart the winners in the SERPs, especially in the post Helpful Content landscape, where brand has an increased value in search. I’m not sure why so many tech SEOs are tasked with building links via HARO or other digital PR tactics such as newsjacking and sending press releases to the media. At best, it will be an inefficient use of their time, and at worst, it can go very wrong. An example recently shared by Washington Post journalist Katie Deighton of a press release she had received from an SEO company is a terrible example of how wrong things can go. The release compared content marketing to a real-life conflict where real people are losing their lives. Tasteless doesn't begin to cover it, and I suspect this is not the way they wanted to go viral. You wouldn’t hire a plumber to fix your lights or an electrician to fix your pipes, yet both are integral to the running of your home, and if you’re building a house from scratch, you’d definitely want to consult both. This holds true for your website. Ultimately, SEO and digital PR are both highly specialized skill sets. If you want to build quality links using digital PR, speak to an expert and let SEOs focus on doing what they do best. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H2",
      "text": "Everybody hates link building"
    },
    {
      "level": "H2",
      "text": "What's so hard about it anyway?"
    },
    {
      "level": "H3",
      "text": "Outreach"
    },
    {
      "level": "H3",
      "text": "Ideation"
    },
    {
      "level": "H2",
      "text": "Link-building gurus and easy HARO Links"
    },
    {
      "level": "H2",
      "text": "Automation is not the answer"
    },
    {
      "level": "H2",
      "text": "Square pegs, round holes"
    },
    {
      "level": "H2",
      "text": "The value of specialists in SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H3",
      "text": "When Not to Use Artificial Intelligence in Digital PR"
    }
  ],
  "author": "Jo O'Reilly\n          \n            Jo O'Reilly\n          \n            Jo O'Reilly"
}