{
  "url": "https://moz.com/blog/build-a-meaningful-brand",
  "slug": "build-a-meaningful-brand",
  "title": "How You Can Build a Meaningful Brand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A brand isn't really a brand unless it leaves a lasting impression. In this post, Hannah explores how to build a brand that truly means something to people, offering many examples of success along the way.",
  "content": "How You Can Build a Meaningful Brand Content Marketing | Link Building | Branding H By: Hannah Smith December 15, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! H By: Hannah Smith December 15, 2014 How You Can Build a Meaningful Brand Content Marketing | Link Building | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Psychology Of Sharing Links And Content 2019 Earlier this year I wrote a post about the future of marketing. In it, I made a handful of predictions; arguably the most 'out there' of which was this: in the future, only brands which 'mean something' to consumers will survive. In today's post I'll be exploring what it takes to become a meaningful brand, and how you might go about building one.SEO is not dead Just so we're clear, I'm not saying SEO is dead, or that organic search is not an important channel :) These stats speak for themselves: However, what we're being asked to do as SEOs is constantly evolving. It used to be that you could build a very successful business online just by being great at SEO. But today, the SERPs are changing, and ranking first doesn't mean what it used to: The BBC still rank first organically for 'weather'—but their listing is pushed beneath the fold. Plus, given the that the information the searcher is seeking is displayed right there in the SERP, I'm guessing they're not receiving as much traffic from this term as they once were. But it's not just informational queries: Skyscanner still rank first for the term 'flights to paris', but again here their organic listing is pushed beneath the fold thanks to paid search listings and the proprietary Google flight product. Google is even going so far as to show its proprietary products against branded searches (hat-tip to Barry Adams for pointing this out): MoneySuperMarket's organic listing is above the fold, but Google is nonetheless being very aggressive. As a consequence of these changes, as SEOs, we're being asked to do different things. Clients of yesteryear used to say things like: Get us links! But today they're saying things like: Get us press coverage, social shares and exposure [links] on sites our target audience reads. Whilst they may not explicitly be asking us to build a brand, nonetheless much of what we do today looks a lot like brand building. But where do we start? What does 'brand' mean? Before we kick off I think it's worth exploring what brand really means. We have a tendency to use 'brand' and 'company' or 'organisation' interchangeably, but in reality they are two distinctly different things. Here's a definition: brand - to impress firmly; fix ineradicably; place indelibly Therefore a brand is not a brand unless it leaves a lasting impression, and of course, it needs to be a favourable impression. Essentially companies or organisations need to build brands that mean something to people. However, right now companies and organisations are struggling to do this effectively: \"In Europe and the US, consumers would not care if 92% of brands ceased to exist\" ~ source That means that consumers would only miss 8% of brands. Clearly we have a mountain to climb. How do we go about building meaningful brands? Particularly on SEO retainer budgets?You can learn a lot by deconstructing the success of others Like many in the search industry, I'm a fan of taking stuff apart to figure out how it works. So, when trying to figure out how to go about building a meaningful brand, I started by looking at what meaningful brands are doing right now. I uncovered three core principles—some meaningful brands do all three; some just do one or two—I'll deal with them each in turn.1) Meaningful brands find opportunities to delight customers Most people's interactions with brands suck. But great interactions stand out and are shared. Let's take a look at some examples: @smartcarusa Here's how @smartcarusa responded when someone suggested that a single bird dropping would total one of their cars: Now the takeaway here is not to rush out and make a bunch of infographics on disparate topics. Out of context, the infographic is neither remarkable, nor particularly interesting, and I don't think it would have garnered coverage had it not been created in response to this tweet. But I think a lesson we can take from this is that going the extra mile to respond in a novel way can yield out-sized returns. @ArgosHelpers This is how @ArgosHelpers responded to a customer asking when PS4s would be back in stock: The takeaway here is not people love brands who use slang—I think this is actually a very artfully worded response. See how the brand has taken care to use the same language as their customer without being in any way condescending? That's what you need to shoot for.@TescoMobile This is how @TescoMobile responded when someone described their network as a 'turn off': Whoa! The lesson here is definitely not 'be a dick to people who are dicks to you'; I think the lesson here is that a well-judged, cheeky response can travel. Ultimately you need to tread carefully if you want to use this type of tactic. I think @TescoMobile got away with this one—but it is really close to the line. To do this sort of thing you need to have a deep understanding of your audience—what's considered funny and what's just plain rude? This can vary hugely depending on the niche you're working in and the public perception of your brand. Moreover, if you're a brand engaging in this sort of activity, you need to consider not only your own response, but the potential response from your audience, too. Some brands have an army of loyal advocates. But if brands aren't careful, they may unwittingly encourage said army to attack an individual with a response like this. Of course it's not just interactions that have the capacity to delight—sometimes being nimble is enough:@Arbys When Pharrell turned up to the GRAMMYs wearing *that hat* here's how @Arbys responded: The takeaway here is not that you need a bit of luck, instead it's that you need to be ready, willing and able to take advantage of opportunities as and when they arise. I think that if @Arbys hadn't tweeted that, then someone else would have done and their brand wouldn't have benefited. Hopefully you can see where I'm going with this; let's move on to principle two:2) Meaningful brands give people the ability to define themselves to others Have you ever thought about why you share what you share on social media? Most of us don't think about it too much, but The New York Times did a study (Updated Resource: The Psychology Of Sharing Links And Content [2019]) on the psychology of sharing in which 68% of respondents said they share things via social media to give others a better sense of who they are and what they care about. For example, I might share an article from hbr.org because I want you to think I'm the sort of person who reads Harvard Business Review. Or I might share an Oatmeal comic because I want you to think I have an excellent sense of humour. I might share something about the Lean In movement because I want to let you know where I stand on important issues. If you're seeking to create a meaningful brand, this can be an excellent space to play in because brands can give people the ability to define themselves to others. Now I don't necessarily mean by creating content like this which literally allows people to define themselves: Brands can also help people define themselves by creating things people 'look good' sharing—let's take a look at some examples:GE's #6SecondScience The takeaway here is to create things which are tangentially related to your brand, that people 'look good' sharing. When people shared this content they were sharing stuff that was more than just 'cool'—by sharing this content they were also able to express their enthusiasm for science. In a similar vein meaningful brands create commercials that don't feel like commercials—again, these are things that people 'look good' sharing:Wren's First Kiss This film definitely got people talking. To date it's received over 94 million YouTube views and coverage on over 1300 sites. But this isn't just a video content play...Oreo When Oreo turned 100, they created 100 pieces of content over 100 days: This campaign got over 1m Facebook 'likes' and thousands of pieces of press coverage. But actually, I think the smartest thing about this campaign was that it was highly topical content which put the cookie right in the centre of people's conversations without being self-serving. Still with me? Let's move on to principle three:3) Meaningful brands stand for something above and beyond their products or services This is difficult to explain in the abstract, so I'm going to shoot straight to some examples.BrewDog BrewDog is a craft beer company. Their brand values are drawn from punk subculture—they're anti-establishment and believe in individual freedom. So when Dead Pony Club ale was 'banned' because the phrase \"rip it up down empty streets\" was printed on the label, their response was to issue a press release apologising for 'not giving a shit' over the marketing rules breach. Their fans loved their response: The takeaway here isn't that sweary press releases get attention (although they undoubtedly do)—by refusing to take the ruling lying down BrewDog showed people they were a brand which stood for something beyond great beer. Nike A core value for Nike is \"if you have a body, you are an athlete\", and these values have inspired incredible creative like this: I think that this advert is powerful because Nike isn't talking about how their trainers enhance your performance, they're talking about celebrating everyone's athletic endeavours. It's about more than just their products. OKCupid I think that taking the decision to stand for something is perhaps most potent when it could actually cost a brand customers. When Mozilla appointed a new CEO, OKCupid showed this message to Firefox users: They went on to say: The takeaway here is not 'align your brand with a cause and win the the Internet', but rather, taking a bold stance on a relevant issue, even if it could actually hurt your business, can create a lasting impression. What do I mean by 'actually hurt your business'? Sadly, not everyone believes in equal rights for gay couples, as such, taking this stance could cost OK Cupid.Using these principles day-to-day The reality for me is that right now, much of this I can't affect—sadly no clients have dropped several million into my lap and asked me to create them an ad like Nike's :) That said, I do think that it's helped me to clarify my thinking on what it means to be a meaningful brand and how to figure out how to get there. At Distilled (the company who is good enough to employ me), the place we play most frequently is principle two—we create content which allows people to define themselves to others; things that people 'look good sharing'. Perhaps more importantly, we're taking the time to understand the companies we're working with better so that our creative work is better aligned with their brand values. And so, dear reader, over to you—I'd love to hear what you think it takes to build a meaningful brand, and what's working (and not working) for you, do let me know via the comments. This post is based on a session I presented at SearchLove; those who are interested can view the full deck below: Existential Crisis Management - SearchLove 2014 from Hannah Smith Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How You Can Build a Meaningful Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How You Can Build a Meaningful Brand"
    },
    {
      "level": "H3",
      "text": "SEO is not dead"
    },
    {
      "level": "H2",
      "text": "What does 'brand' mean?"
    },
    {
      "level": "H3",
      "text": "You can learn a lot by deconstructing the success of others"
    },
    {
      "level": "H3",
      "text": "1) Meaningful brands find opportunities to delight customers"
    },
    {
      "level": "H4",
      "text": "@smartcarusa"
    },
    {
      "level": "H4",
      "text": "@ArgosHelpers"
    },
    {
      "level": "H4",
      "text": "@TescoMobile"
    },
    {
      "level": "H4",
      "text": "@Arbys"
    },
    {
      "level": "H3",
      "text": "2) Meaningful brands give people the ability to define themselves to others"
    },
    {
      "level": "H4",
      "text": "GE's #6SecondScience"
    },
    {
      "level": "H4",
      "text": "Wren's First Kiss"
    },
    {
      "level": "H4",
      "text": "Oreo"
    },
    {
      "level": "H3",
      "text": "3) Meaningful brands stand for something above and beyond their products or services"
    },
    {
      "level": "H4",
      "text": "BrewDog"
    },
    {
      "level": "H3",
      "text": "Nike"
    },
    {
      "level": "H3",
      "text": "OKCupid"
    },
    {
      "level": "H3",
      "text": "Using these principles day-to-day"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Hannah Smith\n          \n            Hannah Smith\n          \n            Hannah Smith"
}