{
  "url": "https://moz.com/blog/build-the-right-traffic-metrics-dashboard-2016-whiteboard-friday",
  "slug": "build-the-right-traffic-metrics-dashboard-2016-whiteboard-friday",
  "title": "How to Build the Right Traffic Metrics Dashboard for 2016 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What you measure is what you're able to improve. Setting yourself up for success involves measuring your traffic metrics the right way, so you can identify areas to work on and implement the right actions. In the first Whiteboard Friday of 2016, Rand explains what you need to include when building…",
  "content": "How to Build the Right Traffic Metrics Dashboard for 2016 SEO Reporting | Whiteboard Friday By: Rand Fishkin January 1, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 1, 2016 How to Build the Right Traffic Metrics Dashboard for 2016 SEO Reporting | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What you measure is what you're able to improve. While there's no one magic solution that works for everyone, setting yourself up for success involves measuring your traffic metrics the right way, so you can identify areas to work on and implement the right actions. In the first Whiteboard Friday of 2016, Rand explains what you need to include when building your own traffics metrics dashboard in the new year. Click on the whiteboard image above to open a high resolution version in a new tab! Update: Klipfolio Has Created a Live Version of This Dashboard in Their AppYou can find a customizable version on Klipfolio's site here: The Rand Fishkin Dashboard.Thanks to Klipfolio team for turning this into a reality!Video TranscriptionHowdy, Moz fans, and Happy New Year. Welcome to 2016. It's going to be a very exciting year in search, in all things digital, in the web marketing world. We have an incredible year ahead of us. I want to help this year by celebrating some of the success of 2015, but also by assisting you in measuring and being able to answer critical questions about your success in 2016.To do that, one of the things we need is a better metrics dashboard. Now look, there is no perfect solution out there. There's no plug-and-play, one-size-fits-all. What I'm going to give you here is a methodology for how you can set your team and yourself up for success, in 2016, with a great metrics dashboard that shows you how things work through your funnel. But you're going to have to tweak this. What I'm going to show you today is not going to be perfect. It's not going to apply to you or to everyone. It's going to need some personalization on your behalf. So what I want to give you is the framework to do this and some of the ways that we think about funnel and web traffic here at Moz. Let's start with awareness We've got our classic web marketing funnel here. It goes from awareness to \"I've heard of your brand. I know something about who you are. I first visit your website. I make returning visits to your site. I make a conversion at some point.\" Then what happens from there is very individually tailored, and so I won't get into retention marketing and retention analytics here. But if you have a great dashboard that can show you these phases and give you the numbers to walk through, you can do something that very few organizations can do, and that is answer the key four questions that always come up around performance: How are we doing? What are we doing? What are we doing means how many people visited this? Did that change perform well for us? Are we improving over last month? Are we improving quarter-over-quarter or year-over-year? How much did we grow or shrink in what capacities? When did it happen? And the most important part — why? If you build this dashboard correctly, you can answer all of those. It's really a beautiful thing. So let's start at the awareness phase. When I talk about awareness from a web traffic perspective, what we want to try and center in on is things that are happen largely outside of our site or our properties before people get to us, like how are they hearing about us and potentially getting to us?Social mediaSo, from that perspective, some of the metrics we could think about are things like social media, your social media mentions. You could potentially put followers in here and fans in here and things like that. Press and brand mentionsI use Moz's Fresh Web Explorer for this and sort of get a count of mentions that I have, both in the Fresh Web as a whole and then in only sources that are in Google News. I like that. Mention.com is another good one for this. Referring linksYou can get that through something like an Open Site Explorer. You could use Google Webmaster Tools. You could use just your Google Analytics numbers in there and branded search volume. I say branded search volume because what I'm trying to measure are things before they get to me. So I want to know how many people are searching for my specific branded terms and phrases. How many people are looking for Moz and for Open Site Explorer and are looking for Moz Analytics or Followerwonk or those kinds of things? Next, build your dashboardNow, what you want to do from there is build a dashboard with the numbers that you need. You can determine what those are. For some folks, they might even want to get bigger and broader in here. So you might say, \"Hey, I want to get statistics on how many keywords SEMrush saw us ranking for.\" So I'm going add that in and I'm going have my numbers — the number of tweets about me, Facebook posts, brand mentions, new links, referring links, etc. — for each of the months and then have a column in there that's giving me a percentage increase and hopefully some year-over-year numbers. You could do that quarterly. You could do that monthly.Now that I have this, if somebody says, \"Hey, we saw traffic decline this month,\" you can say, \"Actually, we didn't just see traffic decline, we also saw our brand efforts fall down.\" We can tie that back to, \"You know what? We did a lot less press and PR this quarter than we did last quarter. You know what? We did a lot more advertising dollar spend here and a lot less tradeshow. It looks like that did not equate to what we were hoping, which is more stuff at the very top of the funnel building more awareness. It looks like tradeshows were actually a great thing for us.\"You can't make these perfectly because these numbers don't tie exactly to every offline kind of activity and word of mouth. But this will give you a baseline, and this will tell you indicatively: What's going on with our brand on the web? How are people thinking about it? How much are people thinking about us versus some competitor? I do like that you can do this competitively. So I could take these numbers. I can replicate this for a few competitors, and then I can compare myself, me versus XYZ, and see who's doing well and who's doing how well.Total visits and total new visits I like seeing total visits & I like seeing total new visits. Then I want to look at visits by channel. So channel could be search, and I could split that out into paid and organic. I want to look at social. I want to look at referring links. Maybe I want to look at email, whatever it is that are the channels that are sending traffic to me. One of the really important things here that I strongly suggest you do is define some metric of engagement, a minimum metric of engagement.So, for example, I like seeing engaged versus non-engaged. For Moz, that might be something like, \"Hey, did they browse at least three pages on our site during that visit?\" Either that or they spent four minutes. So it could be three pages per visit or a four-minute duration time on site equals engaged. Then I can measure by each channel, \"Did I get non-engaged versus engaged visits from that channel in new visits?\" Then I can see over time, like, for example, this happens all the time. We'll see a huge spike in social and referral traffic to a page that sort of had some viral component to it. Maybe it was a particularly salient article. It got lots of broad tech media attention. It didn't really send us lots of SEO professionals, folks like yourselves who are in the web marketing field who are deeply interested in the products that Moz has to offer. So maybe that's low converting traffic. It's low engaged traffic. But we see a big spike and we go, \"Hang on a sec. What's going on there?\" Well, now we can say, \"Aha, that was from social. It was non-engaged. That was jumping up our visit counts, but it's probably not going be an indication of converting traffic later on down the line.\" We'll probably see nice brand mentions and press and that kind of stuff. That could lead to things further on. Now we know whether we should keep investing in that type of broad targeted content or whether it's not worth it at all. Great for being able to do that. My returning visits...that's my community!My first-time visits, those are new people in my funnel, new people I could potentially reach. My returning visits, this is like my crowd. That's my community. These are people that I'm reaching with my content and my tools, my software, whatever my product is. People that I know are interested, they're coming back 2 to 10 plus times. I actually like segmenting these out. So I've got in here that I like seeing total returning and then broken down — second, third time, four through nine, ten plus. Google Analytics actually makes this really easy. So does Omniture if you're using that. In addition to this, I want to see two key metrics about engagement levels, and that is browse rate and average time on site.Browse rate meaning pages per visit. If I see that start to decline overall or in one of these groups, that tells me something interesting. That tells me that maybe I've made a navigation change that was poor and now I'm not driving people from one section of my site to others. Maybe I've changed calls-to-action inside my content. Maybe I'm not linking to my own stuff as much as I used to with the new content I've been publishing, whatever it is. Then I can start to reverse engineer and say, \"Aha, that's why these things are happening.\" If I don't have these kinds of metrics, I can't even answer the question of, \"Well, what are some hypotheses about what could have happened?\" If you have this, you're in good shape.And then, finally, conversions This is the most unique part. These three, there's some variation in top of funnel awareness stuff. These two really, really consistent across almost very site if you follow these models. But conversion, that's going to be totally dependent on what you are converting someone to do. If it's an email signup that's very different from an ecommerce process, which is very different from a subscription product which is going to be pretty different from an advertising-based site where your conversion might just be a page load or a number of page loads in a visit, those kinds of things.What I like to do is I like to segment out the places where conversion events happen on your site. For the purposes of this Whiteboard Friday, let's call that the product pages. So I want visits to the product pages. I might choose to do new and returning, again split out. I want to see the checkout completion rate, meaning the people who make it through whatever conversion process that is. Maybe that's just a form field for an email capture. Maybe it's checking out through a shopping cart, whatever that is. Then I want to see new versus retuning customers, different than visits. This is anyone whose email address or organization I previously have in my customer database so I know that, \"Aha, this is a new customer. This person has never converted with me in the past.\" Or, \"Oh, I've seen them before. They're coming back and doing something with me again.\" Then I want total revenue. You can break this down. I would break this down something like product page visits, the completion rate of whatever it is that the conversion event is, new buyers, retuning buyers, average revenue per buyer, total transactions, and total revenue. That might be a reasonable ecommerce type of approach. It will change if you're SaaS. It will change if you're email lead capture, but this is fine. What's great about this is if you set this up now, if you set this up and you have this data for January, you can set it up any way you want — a Google spreadsheet and you manually fill some stuff in, you pull in some stuff through APIs, you ask one of your developers to build something for you, great. It's very imperfect, but you can set up a custom Google Analytics dashboard that gets close-ish, approximate-y, depending on how much sophistication you need. You won't be able to get any of this stuff in the awareness side from GA, but the rest of it you can get close to.If you do this in January and you measure it throughout the year and you can get year over year data, go back to 2015, or at least in 2017 be able to look back at 2016, you will set yourself up for so much more success than was ever possible before you measured things. I tend to find that what we measure is what we were able to improve. If you measure this stuff, you'll be improving the right stuff. All right, everyone. Congratulations on making it through 2015. I'm looking forward to a great 2016 with you and lots of great Whiteboard Fridays to come. Take care and Happy New Year.\u0003Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Build the Right Traffic Metrics Dashboard for 2016"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Build the Right Traffic Metrics Dashboard for 2016"
    },
    {
      "level": "H2",
      "text": "Update: Klipfolio Has Created a Live Version of This Dashboard in Their App"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Let's start with awareness"
    },
    {
      "level": "H3",
      "text": "Social media"
    },
    {
      "level": "H3",
      "text": "Press and brand mentions"
    },
    {
      "level": "H3",
      "text": "Referring links"
    },
    {
      "level": "H2",
      "text": "Next, build your dashboard"
    },
    {
      "level": "H2",
      "text": "Total visits and total new visits"
    },
    {
      "level": "H2",
      "text": "My returning visits...that's my community!"
    },
    {
      "level": "H2",
      "text": "And then, finally, conversions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}