{
  "url": "https://moz.com/blog/building-brand-value-and-customer-loyalty-videos-from-moztalk-in-philly",
  "slug": "building-brand-value-and-customer-loyalty-videos-from-moztalk-in-philly",
  "title": "Building Brand Value & Customer Loyalty: Videos from MozTalk in Philly - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With topics ranging from empathetic customer service to tailored PPC ads to the battle between authority and trust, the latest MozTalk was chock full of info to help boost your brand value. Couldn't attend? Fear not — we've got the run-down and all the videos here, for free!",
  "content": "Building Brand Value & Customer Loyalty: Videos from MozTalk in Philly Branding By: Danielle Launders May 19, 2016 Table of Contents Copied! By: Danielle Launders May 19, 2016 Building Brand Value & Customer Loyalty: Videos from MozTalk in Philly Branding [Estimated read time: 3 minutes] In April, we hopped on a plane to go visit our friends in the City of Brotherly Love to share an evening of learning, networking, and, of course, eating, for our latest MozTalk. Wait, what’s a MozTalk, you ask? Well, let me tell you! MozTalks are after-work events, featuring two-four speakers, focusing on topics relevant to online marketing. These one-night events are a way to engage and share ideas amongst the community, meet old friends and new (that’s you!), and learn great tips from some brilliant minds. Oh, did I mention there is food and some awesome swag? Yes, let’s not forget the most important parts. Our most recent MozTalk focused on innovative strategies for building brand value and keeping your customers coming back. Topics ranged from human interaction through customer service to tailoring PPC ads to keep your customers coming back for more. We had a lineup of four outstanding speakers: Adam Melson from Seer Interactive, Erin McCaul from Moz, Purna Virji from Microsoft, and Wil Reynolds from Seer Interactive. Watch the presentations below for the full scoop: Adam Melson: Branding & Revenue Wins That Ignore Traditional SEO Top takeaways Fixing broken customer experiences should be a priority; make sure to measure everything. By doing so, you may find new key opportunities to enhance the customer experience and gain loyalty. Look past the basic search results; more and more people are using websites outside of Google to search, including Reddit. Erin McCaul: Customer Engagement: Why Your Help Team Should Have a Seat at the Table Top takeaway Excellent customer service is about empathy and should be the foundation of any good brand. Purna Virji: Clever Ways the World’s Most Valuable Brands Use PPC Top takeaways Build your brand with PPC by focusing on making the customer's life easier, showing them that you care, and making it easy to be a loyal customer. With the increase in the use of voice search, be prepared for search results with misspellings. Make sure to account for that as a brand and in PPC. Utilize sitelink extensions by focusing on the stage of interest of a customer or according to the customer's needs. Wil Reynolds: A Modern SEO’s View on Authority vs. Trust Top takeaway Don’t confuse popularity with trust, and remember, rankings don’t equal trust or equal money. Missed the previous talks? Now that your brand value is at all-time high and your customers love you, it’s time to level up even more. Our first MozTalk covers Need-to-Know SEO and Making Your Blog Audience Fall in Love with Rand Fishkin and Geraldine DeRuiter, while our second MozTalk dives into 5 Years of SEO Changes and Better Goal-Setting with Rand Fishkin and Dr. Pete Meyers. Join us for the next one! We are excited to announce that we are headed to Denver for our next MozTalk on July 19th to learn all things content. Join us for a night full of learning, networking, and fun. Keep an eye on our Events page for more details to come, and we hope to see you there! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Building Brand Value & Customer Loyalty: Videos from MozTalk in Philly"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Building Brand Value & Customer Loyalty: Videos from MozTalk in Philly"
    },
    {
      "level": "H2",
      "text": "Adam Melson: Branding & Revenue Wins That Ignore Traditional SEO"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Top takeaways"
    },
    {
      "level": "H2",
      "text": "Erin McCaul: Customer Engagement: Why Your Help Team Should Have a Seat at the Table"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Top takeaway"
    },
    {
      "level": "H2",
      "text": "Purna Virji: Clever Ways the World’s Most Valuable Brands Use PPC"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Top takeaways"
    },
    {
      "level": "H2",
      "text": "Wil Reynolds: A Modern SEO’s View on Authority vs. Trust"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Top takeaway"
    },
    {
      "level": "H2",
      "text": "Missed the previous talks?"
    },
    {
      "level": "H2",
      "text": "Join us for the next one!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danielle Launders\n          \n            Danielle Launders\n          \n            Danielle Launders"
}