{
  "url": "https://moz.com/blog/building-community-with-value",
  "slug": "building-community-with-value",
  "title": "Building Community with Value - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At the heart of community building strategy, there is a need to share and provide something of value to others. Check out these tips to ensure you're spending time and resources on types of content that are valuable to potential community members you're hoping to attract.",
  "content": "Building Community with Value Social Media By: Mackenzie Fogelson January 15, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson January 15, 2013 Building Community with Value Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Building a community around your company is hard work. Just like SEO, there are no tricks. Nothing you can buy in bulk. There really is no ‘easy’ way to do it. Even when you’re working with an agency, you can’t just put in an order for a large community at the drive thru window and expect it to happen over night. You’ve got to do the work. Building community is about building awareness, and that involves a cohesive blend of many crucial components, including SEO, content, and social media marketing. If you want to effectively use social media to grow your company, then you have to build a community around it. At the heart of building community is sharing and providing something of value. What is value? Simply put, value is something that holds worth. Something that is important to someone. Something that serves a purpose. Something that has significance to someone for one reason or another. In the world of content and social media marketing, value can translate to a video, a photo, a blog post, a checklist, a whitepaper. With value, beauty is in the eye of the beholder, so you’ve got to know what constitutes value for your audience. If you’ve got music lovers on your hands, maybe that’s the latest soundbite or leaked video. If it’s engineers, maybe it’s an infographic that beautifully lays out all the data they need to quickly digest (rather than, perhaps, a narrative or a spreadsheet). Value is something good. But if you only remember one thing about this post, make it this: Value is not all about you. Focusing on the customer vs. focusing on you People like to talk about themselves, and when you’re a company who has something to sell, it’s easy to think that the more you talk about yourself (specifically on social media), the more people will see you, hear you, and want to buy from you. I’m thinking...not so much. There is a HUGE difference between sharing value and self-promotion. When you’re promoting yourself 100% of the time, the focus is, of course, on you, which means you’re basically saying that you’re the most important part of the company/customer equation. That gets old. It doesn’t leave you with a whole lot to talk about or share in the social space, leaves no room for growth, and certainly doesn’t provide much value for your customer. When you focus on the customer and you think about what their interests are, what they need, and what they’re challenged by, suddenly the opportunities and choices for sharing value and making a connection with them are much greater. Growing your online community with value You can grow your online community (and transform your business) simply by focusing on your customer and sharing some value with them. Take MailChimp for example. They have developed a plethora of resources on their website that help their customers do email marketing. Their guides cover everything from getting started with their product, to managing your list and using Google Analytics with your email marketing. These guides don’t directly make them any money, but they are focused on the customer and provide them with value. These are the perfect things for MailChimp to share on social media. Even though they are indirectly promoting their own product, they are still focused on offering tremendous value to their customer. Simply Business is another great example. Maybe this is an easy one for them because their sole purpose is to be a source of knowledge for UK businesses, but all Simply Business does all day long is provide a whole boat load of value: from resources on business insurance and fitness tips for business owners to the Small Business Guide to Google Analytics. All focused on the customer and all focused on providing value. But wait, there’s more All of this high quality content that both MailChimp and Simply Business creates is awesome, but I know first hand that this stuff takes a ton of time, energy, and a good amount of budget to generate. There is one simple, additional thing that both MailChimp and Simply Business could do that would serve their own customers and grow their community, but wouldn’t cost them a thing (except for a little bit of time). They could leverage the communities of other companies. What the heck does that mean? Well, Simply Business was almost on to it here: They’re asking their community if they have anything of value to share. This is a great start, but what if Simply Business took the initiative to find for themselves the valuable content that’s out there, connected with the businesses generating it, and made this a part of their normal community management routine? In addition to asking their customers for valuable things that they’d like to share, what if every few days Simply Business shared value from other companies that they respect, trust, and believe in? Wouldn’t this help their customers and build community? I’m thinking...yes. Tap into neighboring communities with value and the 80/20 rule Now this is where we get to the good part. You can try a new routine that will do several things: Save you from always having to originate quality content. Provide your customers with additional (and diverse) value. Cultivate and grow your online community and your relationships with other awesome people and businesses. Win. Win. Aaaaand more win. Here’s how you do it: 80% of the time, share value that you did not actually generate That’s right. The deal with this is that if you’re spending 80% of your time on social media working to share other people’s value, you’ll end up building relationships, a more satisfied community, more fans, and bigger brand advocates. That means more supporters and more people who want to spread the word (i.e. do the work) about you (for free!). Your quest is to find other people or companies online that you like, that may hold similar values or have a similar approach, and that produce good content. Get to know them. Read what they write. Share their stuff. Become their friend. It's not what's in it for you, it's what's in it for your customer and your community. Even if the companies and people you are seeking out are a so-called competitor, if they align with your personal and company values (and have valuable content to share), they will appreciate you featuring their stuff, your customers will benefit from it, and they will want to become friends too (which means eventually they will return the favor). You can help each other learn and grow each other’s communities. It’s real easy to do on Twitter: And even more beneficial (for SEO reasons) on Google+: But in order to do this and make it work, you’ve got to read. A lot. Sharing value means you’ve got to be reading and learning. All the time. In addition to making friends with other companies, putting them on your radar and reading their blogs, make sure you’re following people on Twitter who are continually sharing value, or circle in people on Google+ who share good stuff. Find all of the useful information that you can get your hands on (the stuff that you know your community would love). The benefit of this, of course, is that you will always have something useful (and valuable) to share with your community, and you will discover new niches and opportunities (i.e. other neighboring communities to tap into). If you don’t have time to read the stuff you’re collecting during your day, use Pocket and save it for later. Then, make sure you’re setting time aside at least a couple times a week to read all the good stuff that you’re collecting so that you can then share that valuable content with your community on social media. Bottom line, just make it part of your routine to share other people's valuable content approximately 80% of the time. 20% of the time, share stuff that you yourself created When you’re focusing on sharing your own content, make sure it’s good. Real good. And remember, the stuff that you originate and share on your own blog and social media outlets should serve your community, not you. And here’s a great tip that I stole from Rob Ousbey that will make an even bigger impact in your community and reach more people with your value: before you even create it, try asking for feedback. Interview your customers, survey them, ask them questions about their challenges, anxieties, and pain points. This helps you to get buy-in even before the effort is spent, and you’re ensuring that you’re developing something that really matters to them. Then, once the content you’ve been working on is ready, show those people who provided you with feedback what you created. Now you have fostered trust because they were a part of the process. So when you go to do outreach and get the word out on social media, you’ve already got someone who is personally invested and wants to help you with outreach. It's not that you want to avoid promoting your company or helping people understand what you do. It's that blatant self-promotion won't get you anywhere, and it certainly won't help build a community. When you are promoting yourself, make sure it's backed by value. Always bring it back to value No matter what, make the commitment to share value (and again, not just your own). Maybe your ratio isn’t 80% other people’s stuff and 20% your own (though that’s been the ratio that has worked best for us). Maybe it’s 60/40 or 70/30. Whatever the balance is, always share value and try (seriously, try hard, kids) not to make it all about you (at least a little bit of the time). Play around with it. Test it out and find the right mix for your customers and your community. When in doubt, think about your customer first. How can you really be of service to them? If you can’t, refer them to someone else who can. They may not become your customer, but they will always be your fan, support your community, and refer you to their friends. That’s what cultivating community with value is all about. Take the 80/20 challenge People like to share. When you focus on other companies (and people) and not always on yourself, it will naturally catch on and those people and companies will start sharing your stuff. But the ‘trick’ to this whole thing is that you have to start with value. So try it out for yourself and see what happens. Chances are, you’re going to become a lot smarter (with all of that hard core reading you're gonna do), you’re going to help others, and you’re going to grow your business (with a seriously awesome community). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Building Community with Value"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Building Community with Value"
    },
    {
      "level": "H2",
      "text": "What is value?"
    },
    {
      "level": "H2",
      "text": "Focusing on the customer vs. focusing on you"
    },
    {
      "level": "H2",
      "text": "Growing your online community with value"
    },
    {
      "level": "H2",
      "text": "But wait, there’s more"
    },
    {
      "level": "H2",
      "text": "Tap into neighboring communities with value and the 80/20 rule"
    },
    {
      "level": "H2",
      "text": "80% of the time, share value that you did not actually generate"
    },
    {
      "level": "H2",
      "text": "20% of the time, share stuff that you yourself created"
    },
    {
      "level": "H2",
      "text": "Always bring it back to value"
    },
    {
      "level": "H2",
      "text": "Take the 80/20 challenge"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}