{
  "url": "https://moz.com/blog/bum-rush-the-seomoz-tools",
  "slug": "bum-rush-the-seomoz-tools",
  "title": "Bum Rush the SEOmoz Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're nearing completion of the fixes, error removals and problems associated with the SEOmoz tools, but we need your help. When the tools get slammed is when they're at their most vulnerable, so we invite you today to run all the reports you've been putting off and see how accurate our data is -…",
  "content": "Bum Rush the SEOmoz Tools Moz News By: Rand Fishkin July 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 15, 2005 Bum Rush the SEOmoz Tools Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We're nearing completion of the fixes, error removals and problems associated with the SEOmoz tools, but we need your help. When the tools get slammed is when they're at their most vulnerable, so we invite you today to run all the reports you've been putting off and see how accurate our data is - some tools are still returning bad results, but keyword difficulty should be back on track as is sandbox detection and the site comparison tool. If you find massive errors, don't worry about reporting them - we'll be manually reviewing the data (but not your private entries or terms) this evening to see how it's gone and what still needs work. Thanks for your help! On Monday, all members and registered users from the Quiz will receive the formal e-mail update I've been promising. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Bum Rush the SEOmoz Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Bum Rush the SEOmoz Tools"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}