{
  "url": "https://moz.com/blog/businessweek-seo-can-help-revenues",
  "slug": "businessweek-seo-can-help-revenues",
  "title": "BusinessWeek: SEO Can Help Revenues... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Although the obviousness of this article is killing me, it's a decent look at the results of a successful SEO campaign. Sadly, the naming of SEO related articles is still completely tragic - How SEO Upped the Revenues:\n\nThat's when I deci...",
  "content": "BusinessWeek: SEO Can Help Revenues... User Experience (UX) By: Rand Fishkin July 6, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 6, 2006 BusinessWeek: SEO Can Help Revenues... User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Although the obviousness of this article is killing me, it's a decent look at the results of a successful SEO campaign. Sadly, the naming of SEO related articles is still completely tragic - How SEO Upped the Revenues: That's when I decided to pay for a professional redesign of our Web site, which I had created myself, and have it optimized so it would show up prominently in online search results at places like Google (GOOG). What's been the result?Over the last 18 months, our customer demographics have completely changed and our revenues are up 45%. Our customer makeup is now 33% from California, 66% from other U.S. states, and we've done 55 international transactions. We've made sales in every state except Vermont, and all these new clients are finding us through the Web site, which we now have in English and Spanish. Keep in mind that I'm not doing any substantial advertising—online or off. It's all been the search engine optimization and some low-budget, pay-per-click ads I've placed on certain industry terms at Google. At the very least, articles like this are helpful in promoting our industry and helping to legitimize fears that it's \"voodoo.\" Oddly enough, the name of the SEO used in the article never came up. They come close, but continually skirt the issue: I had to pick the right search engine optimization specialist and be willing to learn what she would do and how I could help. If I had just hired somebody to optimize my site and then wiped my hands of it, I'm not sure how great the results would've been. She had to learn everything about my industry in order to do her job right, and I had to stay involved with the process minute by minute. I'm thinking one of a few things here - either the SEO company declined to be mentioned, Businessweek didn't want to mention them (and push their services), or there was some type of fear of backlash from the engines. Looking at the site, it doesn't appear to use any prohibited techniques, though the keyword stuffing is on the heavy side. What I really love, though, is how few links it took to rank so well. I wish I could grow a business on the back of 400-odd links :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "BusinessWeek: SEO Can Help Revenues..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "BusinessWeek: SEO Can Help Revenues..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}