{
  "url": "https://moz.com/blog/business-side-of-seo",
  "slug": "business-side-of-seo",
  "title": "SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Britney Muller walks us through a bevy of smart tips and considerations that will strengthen your SEO negotiation skills, whether you're a seasoned pro or a newbie to the practice.",
  "content": "SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday Marketing Industry | Whiteboard Friday By: Britney Muller July 10, 2020 Table of Contents Copied! By: Britney Muller July 10, 2020 SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday Marketing Industry | Whiteboard Friday SEO has become more important than ever, but it isn't all meta tags and content. A huge part of the success you'll see is tied up in the inevitable business negotiations. In this helpful Whiteboard Friday from August of 2018, our resident expert Britney Muller walks us through a bevy of smart tips and considerations that will strengthen your SEO negotiation skills, whether you're a seasoned pro or a newbie to the practice. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, Moz fans. Welcome to another edition of Whiteboard Friday. So today we are going over all things SEO negotiation, so starting to get into some of the business side of SEO. As most of you know, negotiation is all about leverage. It's what you have to offer and what the other side is looking to gain and leveraging that throughout the process. So something that you can go in and confidently talk about as SEOs is the fact that SEO has around 20X more opportunity than both mobile and desktop PPC combined. This is a really, really big deal. It's something that you can showcase. These are the stats to back it up. We will also link to the research to this down below. Good to kind of have that in your back pocket. Aside from this, you will obviously have your audit. So potential client, you're looking to get this deal. Get the most out of the SEO audit ☑ Highlight the opportunities, not the screw-ups You're going to do an audit, and something that I have always suggested is that instead of highlighting the things that the potential client is doing wrong, or screwed up, is to really highlight those opportunities. Start to get them excited about what it is that their site is capable of and that you could help them with. I think that sheds a really positive light and moves you in the right direction. ☑ Explain their competitive advantage I think this is really interesting in many spaces where you can sort of say, \"Okay, your competitors are here, and you're currently here and this is why,\"and to show them proof. That makes them feel as though you have a strong understanding of the landscape and can sort of help them get there. ☑ Emphasize quick wins I almost didn't put this in here because I think quick wins is sort of a sketchy term. Essentially, you really do want to showcase what it is you can do quickly, but you want to... ☑ Under-promise, over-deliver You don't want to lose trust or credibility with a potential client by overpromising something that you can't deliver. Get off to the right start. Under-promise, over-deliver. Smart negotiation tactics ☑ Do your research Know everything you can about this clientPerhaps what deals they've done in the past, what agencies they've worked with. You can get all sorts of knowledge about that before going into negotiation that will really help you. ☑ Prioritize your terms So all too often, people go into a negotiation thinking me, me, me, me, when really you also need to be thinking about, \"Well, what am I willing to lose?What can I give up to reach a point that we can both agree on?\" Really important to think about as you go in. ☑ Flinch! This is a very old, funny negotiation tactic where when the other side counters, you flinch. You do this like flinch, and you go, \"Oh, is that the best you can do?\" It's super silly. It might be used against you, in which case you can just say, \"Nice flinch.\" But it does tend to help you get better deals. So take that with a grain of salt. But I look forward to your feedback down below. It's so funny. ☑ Use the words \"fair\" and \"comfortable\" The words \"fair\" and \"comfortable\" do really well in negotiations. These words are inarguable. You can't argue with fair. \"I want to do what is comfortable for us both. I want us both to reach terms that are fair.\" You want to use these terms to put the other side at ease and to also help bridge that gap where you can come out with a win-win situation. ☑ Never be the key decision maker I see this all too often when people go off on their own, and instantly on their business cards and in their head and email they're the CEO. They are this. You don't have to be that, and you sort of lose leverage when you are. When I owned my agency for six years, I enjoyed not being CEO. I liked having a board of directors that I could reach out to during a negotiation and not being the sole decision maker. Even if you feel that you are the sole decision maker, I know that there are people that care about you and that are looking out for your business that you could contact as sort of a business mentor, and you could use that in negotiation. You can use that to help you. Something to think about. Tips for negotiation newbies So for the newbies, a lot of you are probably like, \"I can never go on my own. I can never do these things.\" I'm from northern Minnesota. I have been super awkward about discussing money my whole life for any sort of business deal. If I could do it, I promise any one of you watching this can do it. ☑ Power pose! I'm not kidding, promise. Some tips that I learned, when I had my agency, was to power pose before negotiations. So there's a great TED talk on this that we can link to down below. I do this before most of my big speaking gigs, thanks to Mike Ramsey who told me to do this at SMX Advanced 3 years ago. Go ahead and power pose. Feel good. Feel confident. Amp yourself up. ☑ Walk the walk You've got to when it comes to some of these things and to just feel comfortable in that space. ☑ Good > perfect Know that good is better than perfect. A lot of us are perfectionists, and we just have to execute good. Trying to be perfect will kill us all. ☑ Screw imposter syndrome Many of the speakers that I go on different conference circuits with all struggle with this. It's totally normal, but it's good to acknowledge that it's so silly. So to try to take that silly voice out of your head and start to feel good about the things that you are able to offer. Take inspiration where you can find it I highly suggest you check out Brian Tracy's old-school negotiation podcasts. He has some old videos. They're so good. But he talks about leverage all the time and has two really great examples that I love so much. One being jade merchants. So these jade merchants that would take out pieces of jade and they would watch people's reactions piece by piece that they brought out. So they knew what piece interested this person the most, and that would be the higher price. It was brilliant. Then the time constraints is he has an example of people doing business deals in China. When they landed, the Chinese would greet them and say, \"Oh, can I see your return flight ticket? I just want to know when you're leaving.\" They would not make a deal until that last second. The more you know about some of these leverage tactics, the more you can be aware of them if they were to be used against you or if you were to leverage something like that. Super interesting stuff. Take the time to get to know their business ☑ Tie in ROI Lastly, just really take the time to get to know someone's business. It just shows that you care, and you're able to prioritize what it is that you can deliver based on where they make the most money off of the products or services that they offer. That helps you tie in the ROI of the things that you can accomplish. ☑ Know the order of products/services that make them the most money One real quick example was my previous company. We worked with plastic surgeons, and we really worked hard to understand that funnel of how people decide to get any sort of elective procedure. It came down to two things. It was before and after photos and price. So we knew that we could optimize for those two things and do very well in their space. So showing that you care, going the extra mile, sort of tying all of these things together, I really hope this helps. I look forward to the feedback down below. I know this was a little bit different Whiteboard Friday, but I thought it would be a fun topic to cover. So thank you so much for joining me on this edition of Whiteboard Friday. I will see you all soon. Bye. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Get the most out of the SEO audit"
    },
    {
      "level": "H3",
      "text": "☑ Highlight the opportunities, not the screw-ups"
    },
    {
      "level": "H3",
      "text": "☑ Explain their competitive advantage"
    },
    {
      "level": "H3",
      "text": "☑ Emphasize quick wins"
    },
    {
      "level": "H3",
      "text": "☑ Under-promise, over-deliver"
    },
    {
      "level": "H2",
      "text": "Smart negotiation tactics"
    },
    {
      "level": "H3",
      "text": "☑ Do your research"
    },
    {
      "level": "H3",
      "text": "☑ Prioritize your terms"
    },
    {
      "level": "H3",
      "text": "☑ Flinch!"
    },
    {
      "level": "H3",
      "text": "☑ Use the words \"fair\" and \"comfortable\""
    },
    {
      "level": "H3",
      "text": "☑ Never be the key decision maker"
    },
    {
      "level": "H2",
      "text": "Tips for negotiation newbies"
    },
    {
      "level": "H3",
      "text": "☑ Power pose!"
    },
    {
      "level": "H3",
      "text": "☑ Walk the walk"
    },
    {
      "level": "H3",
      "text": "☑ Good > perfect"
    },
    {
      "level": "H3",
      "text": "☑ Screw imposter syndrome"
    },
    {
      "level": "H2",
      "text": "Take inspiration where you can find it"
    },
    {
      "level": "H2",
      "text": "Take the time to get to know their business"
    },
    {
      "level": "H3",
      "text": "☑ Tie in ROI"
    },
    {
      "level": "H3",
      "text": "☑ Know the order of products/services that make them the most money"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}