{
  "url": "https://moz.com/blog/but-wait-theres-more-what-can-online-marketers-learn-from-infomercials",
  "slug": "but-wait-theres-more-what-can-online-marketers-learn-from-infomercials",
  "title": "But Wait, There's More! What Can Online Marketers Learn from Infomercials? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I started to see that certain aspects of infomercial strategy have a lot in common with successful online marketing. And that, in amongst all that cheese and \"But Wait, There's More!\" there are solid marketing lessons to learn. Here are eight lessons online marketers can learn from infomercials:",
  "content": "But Wait, There's More! What Can Online Marketers Learn from Infomercials? Branding M By: Millie Vingrys October 11, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Millie Vingrys October 11, 2013 But Wait, There's More! What Can Online Marketers Learn from Infomercials? Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The other night I was up late waiting for an international skype call with my family on the other side of the world. I was a bit bored reading my book, so decided to see what was on TV. And for the first time in many years (I don't make a habit of watching TV at 2am), I happened to catch an infomercial. A tubby man and a very cheery lady were trying to sell me a blender. The blender had exactly two gazillion attachments and could whizz food, dice vegetables, make juice, clean itself, balance a chequebook and solve world hunger. It was pretty impressive. I might've even bought one, but I don't use a chequebook, so it seemed a bit pointless. But being a marketer by trade, I couldn't help analyzing while I watched. The infomercial was low budget, but funny, light-hearted and convincing. Even though infomercials have been around since the 1970s, in the age of value-added, \"content-focused\" marketing, this cheesy, hard sell format still works. I was curious why. Watching the company roll out customer after customer who raved about the life-changing properties of this particular blender, I started to see that certain aspects of infomercial strategy have a lot in common with successful online marketing. And that, in amongst all that cheese and \"But Wait, There's More!\" there are solid marketing lessons to learn. Here are eight lessons online marketers can learn from infomercials: 1. Tout the Benefits, Not the Features Lose 30Lbs in 30 days with the Abdomaster! The thing infomercials absolutely excel at, more than perhaps any other form of marketing, is selling the benefits of a product. They don't waste your time rattling off a list of function buttons or explaining what \"duel-action\" or \"micro-electric technology\" mean – they spend 99% of their allotted time demonstrating how their gizmo can save you time, save you money, make you rich, help you lose weight or change your life in other amazing ways. Before a person buys a product, they need to know if that product or service will help them accomplish one of four things: Will it make me rich? Will it make me beautiful? Will it make me happy? Will it save me time? And if you can do all four at the same time – that's even better. How do you demonstrate the benefits of your products like an infomercial? Drill down to the core of why someone would purchase your product. What is the problem they're trying to solve? Talk about that problem using real emotional triggers – fear, desperation, anger, desire. Make that problem real. Run through every conceivable question a potential customer might have? Behind each question, figure out what they're really asking? For example, when people say, \"How will I know this product will bring me success?\" what they often actually mean is, \"I'm afraid I'm being suckered in. Show me this is for real.\" Answer that question on your sales page, and you'll increase your ROI. 2. Be the Best \"One of a Kind! Never to Be Repeated! The Best! The Biggest!\" What intrigues me most about infomercials is the total dedication they show to a product. The team behind the infomercial seemed to honestly believe they're selling something remarkable. I've never seen such enthusiasm about a blender! Infomercials shout as loud as they can how amazing, remarkable, life altering and revolutionary. They seem genuine in their belief that their sole duty on this earth is to share this amazingness with you so that you don't miss out. How can bloggers and online marketers show this same enthusiasm? Why are you the best at what you do? Why should someone listen to you over an A-list blogger or famous author in your niche? Know what sets you apart from your competition. Create a mission statement for your website/company that encompasses your values and value proposition. Display this prominently on your site. Support this claim with testimonials. Highlight those testimonials that demonstrate the skills you want to be known for. Don't just say you're an expert on a topic – demonstrate your expertise through blogging, writing for publications, guest blogging, gaining qualifications, obtaining testimonials and interviewing other experts. Invite other experts in your niche to guest post on your site – this gives you more social proof that you're someone who knows what they're doing. 3. Back Up Your Claims with Data \"Studies Have Shown the AbdoMaster gives an 80% improvement in muscle tone.\" \"This new scientifically-proven formula offers 100% better coverage than ordinary concealer.\" Sure, sometimes these \"scientific studies\" sound too good to be true, but that doesn't mean using hard data isn't a good marketing technique. Data provides your audience with social proof – that's why infomercials always bring on real people to talk about the products. The audience is much more likely to believe the claims made about a product if they see facts and figures, or hear stories from satisfied customers. Infomercial advertisers know they can't just TELL you their product is the best – you're not going to believe them. But if they show you … well, who could argue with all that proof? How you can use data in online marketing: Add testimonials from satisfied customers. You can never have too many testimonials. If you can't fit them all on your sales page, sprinkle them throughout your site or make a dedicated page for them. Create blog posts around surveys, studies and other factual data. Use the results as a jumping-off point to create great content. I did this recently in a post about Freelancers, Permalancers, Temps and FTE Staff at Agencies – facts from a study into staffing in creative teams provided the starting point for the article, which then focused on strategies. Tell people how many books you've sold, how many visitors your site has, and who is buying your products and why – give them the solid numbers or they will wonder why you're being so coy. 4. Tell a Story Storytelling is a powerful tool in marketing, and infomercials use it to great effect. We see a woman who led a miserable life and had no friends because she was overweight drop three dress sizes thanks to the amazing machine and suddenly she's hanging out at bars and dating some hot C-grade celebrity. We see frazzled housewives transformed into glowing beauties thanks to the awesome powers of an all-in-one blender, and bloated computer programmers turned into male models through revolutionary diet pills. Stories create a context by which customers can understand a product. When they see real people, \"just like them\" whose lives are transformed, they want the same results for their own life. Stories present essential information about a product in a way that is engaging and emotionally resonant. How can you use stories on your website? We all know how powerful storytelling can be in promoting and solidifying a brand. Use stories on your blog, on your website pages and on your social media to frame your business values, products and mission statement into emotionally-resonant content. Testimonials are mini-stories from real-life clients who believe in what you do. You can never have too many testimonials. Use stories to provide examples to explain concepts, especially in training material such as e-courses Stories don't have to be written – they can be visual (images, video) or use audio (podcasts, recordings, music). Explore different ways of telling your brand's story. 5. Add Value through Multiple Uses The most popular infomercials are for kitchen, beauty and fitness products. Why? These products don't only perform – a machine that grates, slices AND blends. An exercise machine that trims fat WHILE toning muscle. A foundation that is also a concealer, bronzer, moisturizer and sunscreen … While most blogs only really serve one purpose – providing information, that information might be useful for multiple audiences. But how can you demonstrate multiple uses for your content online? For me, this comes through broadening the audience of your blog. Think of what other industries might benefit from your content, and re-slant some of your content to attract them. On our blog, we focus on several different verticals, and we've found this increases – rather than decreases – our audience. Are you selling an info-product? Perhaps with a bit of tweaking, you can create the same info-product multiple times that is aimed at different markets: E.g. Blogging Tips for Lawyers, Blogging Tips for Accountants, etc. Publish content on different platforms – try selling an ebook on Amazon, selling photography to stock sites and creating a YouTube channel. 6. Repeat Yourself I know. I know. To you, repeating the same information again and again gets boring. You think, \"Surely people must be aware of this by now?\" But you'd be surprised how often people miss things, or only started reading your blog five days ago and haven't bothered to go through the archives. Most infomercials run for 30-60 minutes. Now, no one is going to sit there and watch a full 60 minute commercial – at least, I hope not. But they are going to notice the infomercial at different times: maybe flick over 10 minutes in, or maybe only catching the last seven minutes. Repeating information also helps the brain to remember it. That's why infomercials use lots of cheesy puns, jingles and catchphrases – they're trying to make their content easy-to-remember. The more information you remember about the product, the more likely you are to buy it. Despite duplicate content being a bad idea, online marketers can still gleam some insights about repetitive content: Use your blog to explain the same basic concepts over again, using different examples, case studies and formats to get your point across. Far from being boring, this helps people to understand the concept in a well-rounded way. Using language features with repetitive sounds and words, like alliteration, rhyming, and assonance, makes concepts, ideas and products easy to remember. A snappy catchphrase, pun or mission statement can be used throughout a blog to bring articles back to your core theme and values. If certain topics are particularly popular on your site, don't be afraid to rewrite, republish and update old posts with new information. Make sure your content stays up-to-date and relevant. 7. Compare and contrast In the blender infomercial, I saw this amazing device blend alongside a \"typical\" household blender. The amazing blender did everything … amazingly, while the \"typical household blender\" made a big mess everywhere, took ages to put together and pull apart for cleaning, had sharp blades that could cause some serious harm if you got your finger in the way, and it was definitely implied that this \"typical household blender\" was personally responsible for most mass genocides in the entire history of the planet. Seeing one product go head-to-head against another is a powerful form of proof. No matter that many of the situations are contrived, and the \"typical household blender\" probably doesn't represent an actual product at all – by demonstrating the shortcomings of another product, the infomercial blender instantly starts looking like an amazing deal. This comes back to the point I made in 1. – It's easy to \"claim\" something is the best – but if you want people to really believe you, you've got to show them. How can online marketers use comparative marketing? Get your clients and customers to compare their results after using your product with their results after using a product or course they've tried before. You shouldn't disclose the names of these products in your advertising (in my country, that's against the law) but you can definitely demonstrate that your product gets results. Use graphs and tables to demonstrate ROI for one of your clients before and after using your products/techniques. Use video to show exactly how your methods differ from other popular methods. 8. Act Now! Infomercials create a sense of urgency for the viewer – they push a \"special introductory offer\" that's only available for the duration of the program. They may also have \"Limited stock available!\" Some infomercials even have a countdown clock in the corner of the screen. This is known as marketing scarcity and is one of the oldest ways of creating a compelling call-to-action for a product. After all, no one likes to miss out on amazing blenders. How can you create scarcity with online marketing? Obviously, info-products like ebooks can have an infinite amount of copies, and claiming otherwise is creating false scarcity, which will backfire in your face. Instead, put products on the market for a limited amount of time, or offer a special price only for a specified number of days. Online courses are a great opportunity to use scarcity tactics, as you can limit the course size to a number you are comfortable teaching. Use bold graphics and big typography to let your viewers know there's a sale. Offer bonuses for people who act on a special offer – extra info-products, coaching, more content, an extra month free, etc. Send out an email to your list within a few hours of your sale/launch closing, quickly explaining the time limit and providing a means to sign up. This should generate some additional sales. Obviously, infomercials and online marketing are different formats, designed to appeal to different audiences. The infomercial formula is considered outdated and a little bit \"low-budget\". But infomercials are still extremely successful, and there are many marketing techniques used to sell those blenders and vacuum cleaners and real estate courses that can be adopted for your blog, online courses or info-products. While seeing \"But wait, there's more!\" on a blog is likely to put most of us off, the world of infomercials can definitely teach us a thing or two about marketing products to our audience. What other lessons can we learn from infomercials? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "But Wait, There's More! What Can Online Marketers Learn from Infomercials?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "But Wait, There's More! What Can Online Marketers Learn from Infomercials?"
    },
    {
      "level": "H2",
      "text": "1. Tout the Benefits, Not the Features"
    },
    {
      "level": "H2",
      "text": "2. Be the Best"
    },
    {
      "level": "H2",
      "text": "3. Back Up Your Claims with Data"
    },
    {
      "level": "H2",
      "text": "4. Tell a Story"
    },
    {
      "level": "H2",
      "text": "5. Add Value through Multiple Uses"
    },
    {
      "level": "H2",
      "text": "6. Repeat Yourself"
    },
    {
      "level": "H2",
      "text": "7. Compare and contrast"
    },
    {
      "level": "H2",
      "text": "8. Act Now!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Millie Vingrys\n          \n            Millie Vingrys\n          \n            Millie Vingrys"
}