{
  "url": "https://moz.com/blog/but-will-it-google",
  "slug": "but-will-it-google",
  "title": "But Will It Google? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm about to bring up something I've written about before (one month ago today, actually), but today I've taken part in an interesting task that further highlights the disconnect between advertising and search engine marketing. I saw a funny ad on the bus today while I was on my way to work. I…",
  "content": "But Will It Google? Online Advertising By: Jane Copland January 30, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland January 30, 2008 But Will It Google? Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. UPDATE: Since the composition of this post, the website in question has be redesigned and is now far more SEO-friendly! I'm about to bring up something I've written a little bit about before, but today I've taken part in an interesting task that further highlights the disappointing disconnect between advertising and search engine marketing. I saw a funny ad on the bus two days ago while I was on my way to work. It was for a condominium building in central Seattle and the ad was situated in the great advertising spot in between the tops of other people's heads and the ceiling of the bus. Everyone likes that spot: it's the exact place where you don't have to look anyone in the eye. The text of the ad said, \"Beautiful New York-style flats starting in the mid-$300Ks. And one ugly one for $289,950.\" EDIT: It actually says \"with one ugly one at $289,950.\" I've been riding Seattle buses on a semi-regular basis for eighteen months. Never before have I seen an ad that I will remember after I leave the bus. Later in the day, I wondered if I could find an online version of the ad and visit the company's website. I remembered that there had been a URL on the ad itself. However, like many people who don't have Internet-equipped mobile phones and who do have dodgy memories, the company's name and its website had escaped me. Of course, this presented a fantastic opportunity. Could I find this company on the Internet, using only the information I had from their ad? I even remembered the street on which the building was located. Surely it would take a pretty horrifying SEO effort not to rank for your ad's contents and your address. Before I even began my research, I figured that if I couldn't find the website, very few other people would be able to, either. I had no luck whatsoever. I tried a number of different searches using the content of the ad, such as and one ugly one seattle flats, and one ugly one, seattle bus advertisement \"and one ugly one\", plus a string of other queries, some more sensible than others. I included the street, the city, and the ad's keywords in multiple search phrases. The best result I got was this site, which links to the author's Twitter update about the ad. The update is from over two weeks ago, meaning that the ad has been live for over fifteen days. This process had taken up way more time than most people would have bothered to waste on such a task, and I gave up quickly thereafter. However, I was back on the bus this morning and I saw the ad again. I tried to take its picture with my phone, but the lighting was bad and the photo is blurry. I did, however, manage to convince all my fellow bus-riders that I was a very strange person. I also managed to commit the ad's URL to memory. Click through with your speakers off and discover why the Carbon56 condominiums' site will never rank for anything aside from its own name. Am I just lucky to have stumbled across an example of bad SEO? Would most ads' sites have been nearly as devoid of searchable content? Every single search-engine-friendly practice is blatantly missing. The site displays no meta information, no H1 tags, no H2s, no meaningful title tag, and absolutely no written content. There is only one page, as all the content is presented in Flash. The page source is truly painful. Generally, even the most poorly-optimised sites will contain something for search engines to read. When we complete site reviews, we usually end up including instructions on how to improve current features: I've never before looked at a commercial site and found it totally lacking. I am not sure where the company believes its traffic is going to come from if not through search. They are mistaken if they think that their offline marketing is going to draw the highest number of people possible to the site, due to the aforementioned tendency for people to forget URLs. The company who built the site have similar problems on their own domain, including this rather low-rent hidden text: <body bgcolor=\"#999999\"> Seattle based creative and advertising firm specializing in brand development and brand management, advertising, design, web design and web marketing, radio and video production, pr, and much more. </body> They've not used sIFR or any other text-replacement mechanism to display the words that are actually included in Flash, just as they haven't included anything similar on Carbon 56's site. The current state of the housing market means that selling condos in downtown Seattle is a bit tougher than it used to be. Yet the descriptive text Google is displaying with the site's result refers to the building's previous status, as an apartment complex where units were for rent, not for sale. I would have thought that SEO would have infiltrated the advertising industry more than it seemingly has, if this is indicative of multiple offline campaigns that attempt to draw people to websites. I like the ad. It's not earth-shatteringly fantastic, but it's far cuter than every other ad I've seen on city buses. It clears the first hurdle of advertising, easily acquiring my attention for long enough to make an impact. However, it's hard for me to become a converting customer when I can't even find a website. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "But Will It Google?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "But Will It Google?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}