{
  "url": "https://moz.com/blog/buyers-journey-and-user-intent-whiteboard-friday",
  "slug": "buyers-journey-and-user-intent-whiteboard-friday",
  "title": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday",
  "content": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday Whiteboard Friday | Keyword Research By: Rejoice Ojiaku August 25, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rejoice Ojiaku August 25, 2023 Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday Whiteboard Friday | Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Rejoice takes you through how to map your keywords to both the buyer’s purchasing journey and the relative user intent. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi. So I'm Rejoice. I'm an SEO account manager for SEO Sherpa, and welcome to this edition of Whiteboard Friday. So I will be talking to you about how to map your keywords to your user intent and the buyer's journey, so showing you a good framework to use when you're building out your strategy, doing your keyword research, and sort of want to give that extra added value to your clients so they fully understand the whole point of keyword research. So I'll be taking you through the diagram. So we understand that we have the buyer's journey, which is the journey the buyer takes from the start to the end in terms of how they can sort of build and create and solve their problems. Awareness Stage So if we start with awareness, we all understand that awareness is when your buyer identifies that they have a problem. So they become aware that they have a problem, and they need to find a solution. So within awareness, essentially any content you make or any keyword research you are doing, you want to find the type of keywords that would help your users or your users might search for them to either explain or be informed about something. So what kind of keywords can we sort of look into? So there are something called keyword modifiers. Now we all know keywords can be short-tail, it can be long-tail, but the modifiers are sort of what helps us figure out the intent of a keyword or the purpose. So within awareness, the modifiers that we can have are what, how, where, and who. So these can be modified to let us know that the buyer is within the awareness stage because that's the type of keywords that they're using. But furthermore, the intent behind it would be informational, because we all know informational keywords are utilized when users sort of want to be informed about something, again going back to the purpose of awareness. So that's informational- based keywords. Now we don't necessarily always talk about the goal. Of course, we definitely know that awareness brings about explaining, brings about the informational intent behind it. But if we want to talk about the goals in which the user wants, we can classify it as Know and Know Simple. So Know just means your users are trying to know an information. Know Simple would be those queries that they want the answers quickly. So what is Beyoncé's age? That would be a Know Simple query because Google will just bring up her actual age without the user having to go into any website to look at that. So that is awareness. So it's pretty simple, pretty basic, very easy to understand. Consideration Stage But when our buyer moves across to consideration, now consideration is why they're in this stage is because they know their problem. So they have a better understanding of what the problem could be, but they're just trying to find the best solution for it. So that's why it's called consideration. They're considering their options. Again, in this stage, you will still need to explain to them what their options are, and sometimes you might have to demonstrate because this is where your users are going to look for options. So here we can maybe see content such as explainer videos or comparison guides as such. So the keyword modifiers that you tend to find are the best foundation for dry skin, or a review about Canon cameras versus this, or a review about iPhone versus iPad, all of those things. You might start to see affordable. So now they know what the problems are, they might be looking for the best affordable option. So they might do a cost comparison. So these are the kind of modifiers that you can see and look up and know that, okay, these are what we need to serve to our users' user intent. We come down to it being commercial because they might be looking to investigate further into products and services. That is why they're sort of trying to consider their options. So it would be commercial. But what's the goal? The goal can be they want to be led to the right site. So a goal of sites just means that they are looking for that particular site that will help them, I guess, decide, help them move across to the decision stage. But the whole point of this is you want to kind of create the kind of content that are sort of making sure that you're targeting that user intent, that query that they're looking for. So our buyer, they have the options. They're looking at it, and they've picked the one best solution. So, of course, the next stage is going to be the decision stage. Decision Stage So in the decision stage, they want to, again, just find the best price. I know what provider I want. I know where I need to sort of go to to get this one solution. So again, you're still going to explain. You're still going to demonstrate. But how can you demonstrate within the decision stage? That's easy -- FAQs. So we have FAQ pages answering key questions. So they land on your site. They know I want you to be that service provider for my problem. So I need FAQs. I need maybe case studies for me to read about other people's things. I need reviews. I want to review products. I actually want to see what people's experiences are. So for that keyword modifiers, don't be surprised when you start to see deals. When people know the products they want to find, they want discount codes. I do it all the time when I know I want to shop in like ASOS, so I want to find an ASOS discount code. Thus, I've already made my decision. So you might see test. You might see, if you're a service-based client, book now, so they want to book a particular service with this particular site. That intent will be transactional because they're looking to either make a purchase, sign up, book a service, buy, or download something. So they're already at the stage where that's their final decision. I've picked you, so there will be a transactional intent. Then we call this, in terms of goal-wise, Do. So they're ready to take an action. Across all of these stages, you can absolutely put different calls to action. So awareness you can do, if it's a blog for awareness, read more, discover more. Those are calls to action. Consideration, it would be still explore more because you have that explainer guide. Here, it could be sign up, buy now. All of those things are calls to action that you can attribute across different stages. So when you're creating your strategy, this is a very clear way to sort of tell your clients or explain to managers how you've kind of gone about to map out all these keywords, put them into the right categories, and explain it. I think that way you start to track and understand consumer behavior better because you now know the purpose why your consumers are utilizing certain keywords and where they exactly are within the buyer's journey. Even if you have to take a wild guess, categorizing it this way just provides a lot more clarity for you. So that is essentially how you map your keywords to the buyer's journey and then back to the user intent. So I hope this helps and gives you a better idea of how to sort do it and how to play about it and build your Excel sheet and build your strategy to kind of help you. So thank you, and hope to see you soon again on another Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Awareness Stage"
    },
    {
      "level": "H2",
      "text": "Consideration Stage"
    },
    {
      "level": "H2",
      "text": "Decision Stage"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Rejoice Ojiaku\n          \n            Rejoice Ojiaku\n          \n            Rejoice Ojiaku"
}