{
  "url": "https://moz.com/blog/buying-links-is-shallow-buying-blogs-now-thats-a-strategy",
  "slug": "buying-links-is-shallow-buying-blogs-now-thats-a-strategy",
  "title": "Buying Links is Shallow, Short-Term Thinking. Buying Blogs? Now that's a Strategy. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been running an experiment with some dark-hatted links for several months, consistently hoping Google will catch them and remove their value. So far... Nothing. Well, except top 3 rankings for all the anchor text pointed at those pages. Google's webspam team has all the incentive, brainpower…",
  "content": "Buying Links is Shallow, Short-Term Thinking. Buying Blogs? Now that's a Strategy. Blogging By: Rand Fishkin February 21, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 21, 2012 Buying Links is Shallow, Short-Term Thinking. Buying Blogs? Now that's a Strategy. Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been running an experiment with some dark-hatted links for several months, consistently hoping Google will catch them and remove their value. So far... Nothing. Well, except top 3 rankings for all the anchor text pointed at those pages. Google's webspam team has all the incentive, brainpower and money in the world, yet their bets seem to be centered firmly on Google+ and the social graph eventually subsuming the \"natural\" results with those biased to what our friends and connections share/+1. Fine. I get it. Link buying isn't going away, no matter how much we wish it would. Even if link buying is working in the short-term and webspam's being less aggressive, I still think it's a waste of money for three reasons: Rankings are tactical: Earning your way to the top rankings is awesome, because it brings with it the branding, familiarity, trust, social sharing and dozens of other positive marketing signals that \"earned\" links carry. Spam and paid links just give you some more traffic (and not even as much as a trusted brand could earn in the same position). Conversion rates are lower than your peers, and the secondary traffic benefits from other sources, word-of-mouth, etc. never come into play. It's Overpriced: My wife's travel site gets offers for several hundred dollars to put in a few links on a single post, and that's not even an efficient market like those created by professional link sellers and link platforms. Playing the link buying game in the big leagues takes thousands to tens of thousands of dollars each month There's Always Risk: You're already familiar with the horrific pain of Google's Kafka-esque penalties, but maybe you're banking on not getting hit, given their relative ineffectiveness over the past couple years. Problem is, Google+ has created two new kinds of risk for link spammers. The first is that social search results, which have virtually no ties to the link graph, will overwhelm \"natural\" results and make those purchased links largely useless. The second is that Google+ gains enough momentum and data to leverage for webspam analysis. If you've been pointing lots of links at sites and pages that earn no social traction, get ready to feel some pain. Maybe you're risk-tolerant enough to scoff off both of these, but I don't think Google+ is going anywhere, and I give them even-odds to have a social content/sharing graph big enough to pull off both within 24 months. \"Blah, blah, blah, I've heard your white hat evangelism before, Rand\" Yeah, you have. Fair enough. So how about instead of just warning about what not to do, I give you somewhere to spend all those earmarked-for-spam dollars. Here's some rough calculations on link purchasing in a moderately competitive vertical: Ranking goal: single keyword phrase plus some slight modified phrases Required: minimum of 50 unique root domains 35 will be one-time payments, but are relatively low quality, $100 is the average price (like I said, low quality) 15 will require ongoing payments to maintain the link, $100/month (on average) will probably do it Total cost over 12 months: ($100*35)+($100*12*15) = $21,500 So, for $21,500, you can probably buy your way into the top 3 rankings for a moderately competitive phrase in a vertical like niche travel, low-volume e-commerce products, etc. Many black hats I know would argue they can get it cheaper, and they can, but that's usually because they own networks and properties or have relationships for which they wouldn't pay directly. A marketing guy working in-house at a brand has none of the connections, no networks of spamfarms, nothing except dollars and a business model that can turn $21.5K in spammy links into $100K in CLTV at 50% margins for a net of $28.5K. Now let's try an alternative: Buying a blog. Say you're LastWear Clothing (a site one of my favorite Moz engineers, Marty, particularly likes). They could buy some links to key pages (in spite of all the many good reasons not to) and try to get rankings for queries like men's hakama or womens underbust corset. There's a small amount of existing search query demand, and they're one of the only sources on the web selling those precise garments, so there's a good chance that would turn into sales. But, let's try another thought experiment. I'll head over to Google Reader and run a search for \"steampunk\" (the aesthetic of LastWear's clothing): The second site that pops up has a blog with 6,647 subscribers... And it's talking about the fashion of steampunk! I think we're on to something. The Steampunk Workshop blog has thousands of subscribers, and they're already clear proponents of LastWear (I know, at this point you're thinking I planned all this from the start, but I swear, it just fell into place as I was searching/writing). That Workshop site is also running ads on the sidebar and between posts, which suggests an attempt at monetization. While not every site like this is a potential option, many are likely to be interested in an acquisition. Here's one way I might structure it: Steampunk Workshop moves their blog to LastWear.com/blog They continue blogging about all the things they normally would - no editorial interference or direction needed LastWear helps with a more professional design, subscription buttons, some marketing polish, etc. to help the blog earn more traffic, visibility and fans In exchange for the move, LastWear offers a monthly stipend to the blogger(s) and a lump sum payment at the end of 3 years. After those 3 years, they own the blog and the content therein, and both parties can decide how they'd like to proceed with the relationship. If LastWear went down this road, I can promise two things; #1) they'll get far greater short and long term ROI than buying links and #2) it will be less expensive in the long run. To my mind, this is a no-brainer. When you buy a blog or any form of online community, you're not simply acquiring links, you're getting: An engine for brand building and indirect customer acquisition An ongoing methodology to pull in links, tweets, shares, +1s, likes, etc. Brand evangelists who will help expand your reach and credibility A PR opportunity like few others, even in fields where PR is hard to come by (acquisitions are talked-about, blogged-about, and make the news, even those of relatively small blogs) Content that's already been proven to attract an audience All the organic signals that search engines love to see - from links to social to usage to content to branding I honestly don't understand why this problem exists: It makes you want to yell, \"Why don't you just go get married already?!\" Here's five questions I'd ask brands considering online marketing to answer before choosing link purchasing tactics over a blog investment strategy: Which is more likely to be scalable in the long term? Which is more likely to work across multiple channels (content, social, SEO, referring links, etc)? Which carries a greater risk->reward ratio? Which is more likely to increase conversion rate and customer lifetime value? Which is more likely to earn you accolades from your community and which is more likely to earn you a rankings penalty one morning when you really need to hit your quarterly traffic numbers? To be fair, there's plenty of challenges and hoops to jump through in these types of transactions and some won't work out. But, I see a huge disconnect between those who are naturally earning all the signals engines say they want (blogs and online communities) vs. those need them (commercial sites) and no reason the two can't co-mingle. If you're a marketer looking to invest dollars into earning a presence in the search, social and web world, you can either build it yourself or you can buy it. I hope to see lots of dollars flowing to the content pioneers who've already proven themselves effective earners of inbound marketing signals -- the bloggers. p.s. In the future, I hope to cover this topic in more depth and detail and provide tools and methodologies to structure discovery, transactions, value-creation, etc. but for now, I hope this post offers at least a little inspiration and an alternative use for capitol that can do far more good in the hands of bloggers than fly-by-night spam operations. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Buying Links is Shallow, Short-Term Thinking. Buying Blogs? Now that's a Strategy."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Buying Links is Shallow, Short-Term Thinking. Buying Blogs? Now that's a Strategy."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}