{
  "url": "https://moz.com/blog/calculating-estimated-roi-for-keywords",
  "slug": "calculating-estimated-roi-for-keywords",
  "title": "Calculating Estimated ROI for a Specific Site & Body of Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Calculate the potential impact that making critical keyword changes could have on your or your client's site to be able to communicate to key stakeholders the value that SEO could bring to the table.",
  "content": "Calculating Estimated ROI for a Specific Site & Body of Keywords On-page SEO | SEO Consulting By: Shannon Skinner July 21, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Shannon Skinner July 21, 2014 Calculating Estimated ROI for a Specific Site & Body of Keywords On-page SEO | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the biggest challenges for SEO is proving its worth. We all know it's valuable, but it's important to convey its value in terms that key stakeholders (up to and including CEOs) understand. To do that, I put together a process to calculate an estimate of ROI for implementing changes to keyword targeting. In this post, I will walk through that process, so hopefully you can do the same for your clients (or as an in-house SEO to get buy-in), too! Overview Gather your data Keyword Data Strength of your Preferred URLs Competition URLs by Keyword Strength of Competition URLs Analyze the Data by Keyword Calculate your potential opportunity What you need There are quite a few parts to this recipe, and while the calculation part is pretty easy, gathering the data to throw in the mix is the challenging part. I'll list each section here, including the components of each, and then we can go through how to retrieve each of them. Keyword data list of keywords search volumes for each keyword preferred URLs on the site you're estimating ROI current rank current ranking URL Strength of your preferred URLs De-duplicated list of preferred URLs Page Authorities for each preferred URL BONUS: External & Internal Links for each URL. You can include any measure you like here, as long as it's something that can be compared (i.e. a number). Where the competition sits For each keyword, the sites that are ranking 1-10 in search currently Strength of the competition De-duplicated list of competing URLs Page Authorities, Domain Authorities, BONUS: External & Internal Links, for each competing URL. Include any measure you've included on the Strength of Your Preferred URLs list. How to get what you need There has been quite a lot written about keyword research, so I won't go into too much detail here. For the Keyword data list, the important thing is to get whatever keywords you'd like to assess into a spreadsheet, and include all the information listed above. You'll have to select the preferred URLs based on what you think the strongest-competing and most appropriate URL would be for each keyword. For the Preferred URLs list, you'll want to use the data that's in your keyword data under the preferred URL. Copy the preferred URL data from your Keyword Data into a new tab. Use the Remove Duplicates tool (Data>Data Tools in Excel) to remove any duplicated URLs Once you have the list of de-duplicated preferred URLs, you'll need to pull the data from Open Site Explorer for these URLs. I prefer using the Moz API with SEOTools. You'll have to install it to use it for Excel, or if you'd like to take a stab at using it in Google Docs, there are some resources available for that. Unfortunately, with the most recent update to Google Spreadsheets, I've had some difficulty with this method, so I've gone with Excel for now. Once you've got SEOTools installed, you can make the call \"=MOZ_URLMetrics_toFit([enter your cells])\". This should give you a list of URL titles, canonical URLs, External & Internal links, as well as a few other metrics and DA/PA. For the Where the competition sits list, you'll first need to perform a search for each of your keywords. Obviously, you could do this manually, or if you have exportable data from a keyword ranking tool and you've been ranking the keywords you'd like to look at, you could use either of these methods. If you don't have those, you can use the hacky method that I did--basically, use the ImportXML command in Google Spreadsheets to grab the top ranking URLs for each query. I've put a sample version of this together, which you can access here. A few caveats: you should be able to run MANY searches in a row--I had about 850 for my data, and they ran fine. Google will block your IP address, though, if you run too many, and what I found is that I needed to copy out my results as values into a different spreadsheet once I'd gotten them, because they timed out relatively quickly, but you can just put them into the Excel spreadsheet you're building to make the ROI calculations (you'll need them there anyway!). From this list, you can pull each URL into a single list, and de-duplicate as explained for the preferred URLs list to generate the Strength of the Competition list, and then run the analysis you did with the preferred URLs to generate the same data for these URLs as you did for the preferred URLs with SEOTools for Excel. Making your data work for you Once you've got these lists, you can use some VLOOKUP magic to pull in the information you need. I used the Where the competition sits list as the foundation of my work. From there, I pulled in the corresponding preferred URL and its Page Authority, as well as the PAs and DAs for each URL currently ranking 1-10. I then was able to calculate an average PA & DA for each query, and could compare the page I want to rank to this. I estimated the chances that the page I wanted to rank (given that I'd already determined these were relevant pages) could rank with better keyword targeting. Here's where things get interesting. You can be rather conservative, and only sum search volumes of keywords you're fairly confident your site can rank, which is my preferred method. That's because I use this method primarily to determine if I'm on the right track--whether making these recommendations are really worth the time to get implemented. So I'm going to move forward assuming I'm counting only the search volumes of terms I think I'm quite competitive for, AND that I'm not yet ranking for on page 1. Now, you want to move to your analytics data in order to calculate a few things: Conversion Rate Average order value Previous year's revenue (for the section you're looking at) I've set up my sample data in this spreadsheet that you can refer to or use to make your own calculations. Each of the assumptions can be adjusted depending on the actual site data, or using estimates. I'm using very very generic overall CTR estimates, but you can select which you'd like and get as granular as you want! The main point for me is really getting to two numbers that I can stand by as pretty good estimates: Annual Impact (Revenue $$) Increase in Revenue ($$) from last year This is because, for higher-up folks, money talks. Obviously, this won't be something you can promise, but it gives them a metric that they understand to really wrap their head around the value that you're potentially brining to the table if the changes you're recommending can be made. There are some great tools for estimating this kind of stuff on a smaller scale, but for a massive body of keyword data, hopefully you will find this process useful as well. Let me know what you think, and I'd love to see what parts anyone else can streamline or make even more efficient. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Calculating Estimated ROI for a Specific Site & Body of Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Calculating Estimated ROI for a Specific Site & Body of Keywords"
    },
    {
      "level": "H2",
      "text": "Overview"
    },
    {
      "level": "H2",
      "text": "What you need"
    },
    {
      "level": "H2",
      "text": "How to get what you need"
    },
    {
      "level": "H2",
      "text": "Making your data work for you"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Shannon Skinner\n          \n            Shannon Skinner\n          \n            Shannon Skinner"
}