{
  "url": "https://moz.com/blog/call-tracking-is-missing-from-the-uk",
  "slug": "call-tracking-is-missing-from-the-uk",
  "title": "Call Tracking is Missing from the UK - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the key considerations raised at the recent SMX even in Seattle, was the need to track all conversions, especially those taken from telephone calls.  This is a process we have long been pondering, not least because clients are never forthcoming with the information if you ask them.         …",
  "content": "Call Tracking is Missing from the UK SEO Analytics S By: SteveWitt25 June 13, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: SteveWitt25 June 13, 2008 Call Tracking is Missing from the UK SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One of the key considerations raised at the recent SMX event in Seattle was the need to track all conversions, especially those taken from telephone calls. This is a process we have long been pondering, not least because clients are never forthcoming with the information if you ask them. Given that up to 63% of all sales are occurring offline (Jupiter Research), as an SEM agency, it's important we know not only that the sale originated as a result of the web, but which keywords/campaign generated the sale. With this information available to us, not only can we attribute possibly twice as many sales to web-based activities, but we are able to refine our marketing to a much greater level and therefore have greater control over budget and ROI. There are a great number of tools available which can automate this process. ClickPath is one such tool which provides a full stand alone service, and mongoosemetrics.com is a great tool which integrates with existing analytics packages. However, my research into call tracking has identified a gap in the market for analytics within the UK and the rest of Europe. It would seem that there are no providers offering similar services within these markets. I'd be interested to hear if anyone else has managed to source solutions which work in the UK, or a solution which doesn't require integration with a phone company (although quite how that would work, I'm not sure!!!) Separate to this, I'd be interest to hear how many people go the extra mile and attribute telephone sales back to the keyword or online campaign which generated them and if the benefit of doing this is actually proving economic to calculate. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Call Tracking is Missing from the UK"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Call Tracking is Missing from the UK"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "SteveWitt25\n          \n            SteveWitt25"
}