{
  "url": "https://moz.com/blog/can-you-admit-failure",
  "slug": "can-you-admit-failure",
  "title": "Can You Admit Failure? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " \nCan You Admit Failure?\nThis is a topic close to my heart. \n\nI remember interviewing for several sales related job positions when I got discharged from the Navy. One of the most important questions every one of them asked was, “how do you handle being rejected?” In sales, being rejected - failure…",
  "content": "Can You Admit Failure? Online Advertising M By: Matthias Hager September 30, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Matthias Hager September 30, 2010 Can You Admit Failure? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This is a topic close to my heart. I remember interviewing for several sales related job positions when I got discharged from the Navy. One of the most important questions every one of them asked was, “how do you handle being rejected?” In sales, being rejected - failure - is part of the job. If you can’t take that rejection, learn from it, and move on, then you are not fit for the job. Failure is not limited to only sales jobs. Everyone should be prepared to fail, no matter their position or specialty. Even the mighty Google fails occasionally. As the story goes, the Great Inventor Thomas Edison failed 1,000 times before finally nailing it on the head with the light bulb. His response: “I didn’t fail 1,000 times. The light bulb was an invention with 1,000 steps.\" He truly was a man that understood how to fail gracefully. He would have made a great salesman. Google, even with all of its failures, continues to move forward and progress on to bigger and better things. When it comes to the SEM industry, not every endeavor is going to be a success. I’m not referring to the sales aspect of this, although some of the same principles might apply. I’m talking about actually marketing for a website. As much as you might consider yourself an expert or a guru, there are some undertakings which just don’t pan out. Some websites don’t take off. While we are neither inventing something new nor trying to make a sale, as Professionals we ought to be prepared to not only accept failure, but admit it. Failure comes in many forms for us. We really do have 1,000 steps until we “invent our lightbulb.” There is keyword research to be done, narrowing it down into a workable list, segmenting to cover all variations, on-site optimization, information architecture, URLs, title tags, image optimization, conversion optimization, social media. I don’t think I need to go through the entire list of various aspects that go into SEM. I don’t think I could nail down every area from memory. It almost always boils down to 1 Ultimate Goal, increasing conversions for the client. For most websites, this is sales. Maybe it’s advertisement clicks for some clients, or blog subscriptions. Often times, I think SEOs get narrowminded. We focus heavily on 1 aspect, like keyword rankings, for so long that we lose sight of the endgame. When we make a big push to get a certain competitive keyword phrase ranking on page 1, we’re so exuberant that we run off and brag about it to the client without really looking at its impact on the Ultimate Goal. Maybe we even were so focused on that keyword that we didn’t notice another one had slipped out of the #1 position which resulted in a big loss of traffic. Or that conversion rates have been steadily slipping for several months. Link builders might be too busy trying to get some high profile links that they neglect a plethora of lower hanging fruit. When Thomas Edison failed, the results were right in front of him. Google looked at the data and realized Wave wasn’t receiving the user base they expected. Even the salesman gets a blunt “no” most of the time. As SEMs, our failure is not really our failure. What I mean by that is we are not failing for ourselves, we’re failing for the client. When conversions don’t go anywhere, it is the client that is hurt by it. Most contracts are not written on the principle of returns. We get paid whether or not their sales increase. Clients don’t understand SEM. If they did, they wouldn’t need us to do it for them. When you come to them excited about the leaps and bounds the keyword ranking made, they get excited too. They know it is a good thing because you tell them it is a good thing. In the same regard, they don’t know when something negative happens unless you explain it to them. When your keyword goes up at the expense of other rankings dropping, they only see what you tell them. Yes, the client should be able to see their final sales numbers. What they don’t typically see or understand on their own is how those numbers come to be. That is the job of the consultant to explain to them. If your reporting to them only shows them keyword rankings and work performed, perhaps you need to rethink this. If sales went up by 12% over the last quarter, don’t wave a top 20 ranking chart in front of their face and say “looky here, we dun good!” Find out where that 12% came from and give credit where it is due. In the same regard, if sales dropped by 12%, the cause needs to be identified. If it was a failure on your part, accept the blame. Since the clients don’t understand any more than what the consultant tells them, it’s typically easy to pull the wool over their eyes. Maybe you aren’t doing it intentionally. It is so easy to get caught up in one aspect of the job that you lose sight of the Ultimate Goal. When trouble comes, you’re so proud of your results in that one area that you don’t even realize it or don’t understand why it’s happening. SEM is an unregulated industry. There are no standards. No schooling. It’s highly subjective and theoretical. Don’t use this non-domesticated nature of the business to smooth over your flaws and failures. Confucius said, “Our greatest glory is not in never failing, but in rising every time we fall.” In these times where failure comes, it’s a natural instinct to try to shirk it off. No one wants to be at blame for failure, especially when it hurts someone else. It might mean losing a big client when we can’t deliver results. I believe every SEM agency should have a Failure Plan. Failures will happen at some point. If they are not accounted for, more damage will be dealt to the client than is necessary. Accept failure gracefully. Your client will appreciate it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can You Admit Failure?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can You Admit Failure?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthias Hager\n          \n            Matthias Hager\n          \n            Matthias Hager"
}