{
  "url": "https://moz.com/blog/can-a-site-gain-international-traffic-with-links-to-babel-fish-translations",
  "slug": "can-a-site-gain-international-traffic-with-links-to-babel-fish-translations",
  "title": "Can a Site Gain International Traffic with Links to Babel Fish Translations? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I spotted a site recently that had different language versions. Nothing particularly new there, lots of big international sites have this functionality - such as Apple and most airport websites.",
  "content": "Can a Site Gain International Traffic with Links to Babel Fish Translations? Local SEO E By: Edward Sexton May 8, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! E By: Edward Sexton May 8, 2009 Can a Site Gain International Traffic with Links to Babel Fish Translations? Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I spotted a site recently that had different language versions. Nothing particularly new there, lots of big international sites have this functionality - such as Apple and most airport websites. . However, the difference was that this site (www.bcpc.org) was just linking to Yahoo! Babel Fish versions of their site (I don't work for this site or anything, although I do work on international events websites which is how I stumbled across it). Appearing in Foreign Search Engines Now, to state the obvious, there are of course search issues with doing it this way as opposed to the Apple way in that the Babel fish pages can't be indexed. Google, for example, doesn't index third party translation pages held either on Yahoo! Babel Fish or Google Translate. For obvious reasons - If they did, you could multiply Google's current index of unique pages by the amount of languages that exist in the world. What's a trillion times 6,912? (I’m being rhetorical, don't put 6,912,000,000,000,000 as a comment).Translation isn't vital as we all know; web pages do appear in the index of search engines in other languages provided they are relevant enough. For example, the first result for me on Google.co.uk for \"French Newspaper\" is the French language site Le Monde. The other method which my examples of Apple and Heathrow use is to to create your own site in different languages, which means Google effectively sees this other site as a completely different website. Search for Apple in Google.co.uk to find the English language (UK) Apple site http://www.apple.com/uk/, and search for Apple in Google.fr to get the French language Apple site, http://www.apple.com/fr/ (searching for pomme won't return the Apple site, unfortunately). And just so I cover all aspects of this, having your site hosted or appearing on the relevant top level domain also will help listing in local search. Benefit for Users / Increased Traffic? The main point of this post is to get your opinions on whether doing this Babel Fish translation method is worthwhile if you want to attract more foreign visitors but don't have the time or resources to build multi-language sites. Are many websites missing a trick by not doing this simple method of helping international visitors? I'd quite like to trial it on some websites I work on but have a niggling feeling there's something really stupid about doing this that I’m missing. It won't directly affect SEO as mentioned above, but surely if you make things easier for foreign users then you're encouraging links. Yes, visitors could just use Google Translate themselves (as I often do if on a foreign website), but providing a link reduces their thinking time and presumably drop off. The only other reason I can think for not doing this is that the translation will be rubbish. However, on looking at Le Monde via Google translate, I was surprised to see it was actually reasonably intelligible. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can a Site Gain International Traffic with Links to Babel Fish Translations?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can a Site Gain International Traffic with Links to Babel Fish Translations?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Edward Sexton\n          \n            Edward Sexton\n          \n            Edward Sexton"
}