{
  "url": "https://moz.com/blog/can-301ing-a-banned-domain-hurt-a-site",
  "slug": "can-301ing-a-banned-domain-hurt-a-site",
  "title": "Can 301ing a Banned Domain Hurt a Site? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you have several doorway/spam domains that Google has decided to gray out the PR on, can you hurt a site who's rankings and reputation are solid by 301ing those penalized domains to the trusted one?\nThis is the question asked by adamclark at SEW. Ian Mcanerin chimes in with some good advice:\n...",
  "content": "Can 301ing a Banned Domain Hurt a Site? Blogging By: Rand Fishkin October 12, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 12, 2005 Can 301ing a Banned Domain Hurt a Site? Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you have several doorway/spam domains that Google has decided to gray out the PR on, can you hurt a site who's rankings and reputation are solid by 301ing those penalized domains to the trusted one? This is the question asked by adamclark at SEW. Ian Mcanerin chimes in with some good advice: ...A 301 officially tells a search engine that the old site is now the new site - for better or worse. If these sites have not been banned, are not members of a bad neighbourhood, etc then 301'ing them can only help you. If, however, they are considered to be untrustworthy and then you tell the search engine that this untrustworthy site is now someplace else with a different name, then how that is handled is up to the search engine - but that is what you are telling them... But, bhartzer contradicts that idea: I don't agree. If you 301 a banned domain to a domain that ranks well and is not banned the banned domain will not hurt the other domain. If that were the case, then I could get one of my domains banned, 301 it to my competitor and hurt their site and their rankings. I'm on the fence. Google (and the other SEs) have been known to do shoddier things than this. It could be trouble for the unsuspecting site. If anyone's done testing on this, I'd be very interested to hear about it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can 301ing a Banned Domain Hurt a Site?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can 301ing a Banned Domain Hurt a Site?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}