{
  "url": "https://moz.com/blog/can-you-disavow-out-of-penguin-whiteboard-friday",
  "slug": "can-you-disavow-out-of-penguin-whiteboard-friday",
  "title": "Discussion: Can You Disavow out of Penguin? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A rumor is spreading that you can get out of a Penguin penalty with a simple disavow file. In today's Whiteboard Friday, Josh Bachynski deconstructs that argument and starts a realistic discussion we hope you'll join in order to get at an answer.",
  "content": "Discussion: Can You Disavow out of Penguin? Link Building | Whiteboard Friday | Advanced SEO By: Josh Bachynski January 2, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Josh Bachynski January 2, 2015 Discussion: Can You Disavow out of Penguin? Link Building | Whiteboard Friday | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Whew! This one generated a fair bit of controversy in the SEO community. Be sure to check out the comments below the post for a holistic picture of the debate at hand. Carry on! Penguin is back at the forefront of many marketers' minds now that the third iteration of the algorithm update has been released, and a rumor has begun circulating that you can weasel your way out of a Penguin penalty by simply submitting a disavow file. In today's Whiteboard Friday, Josh Bachynski breaks down that argument and starts a realistic discussion to find the answer. While we (and, as you'll see, Josh) don't have definitive answers, we hope you'll join in with your thoughts in the comments! For reference, here's a still of this week's whiteboard! Video transcription Hi. Welcome to Whiteboard Friday, and I'm your guest host for this week, Josh Bachynski. This week I'd like to talk about whether or not it is true that you can disavow your way out of the dreaded Penguin algorithm. So there is a hypothesis going around the SEO community that it is possible that you can just use a disavow file to get out of Penguin. Now, for those of you who don't know, the disavow file is a feature that Google implemented a couple years ago where you can upload your spammy links into a file, very similar to robots.txt, and they will apparently remove those links out of your link graph or have them not count against you or something along those lines. However, the hypothesis is -- and Google has confirmed this both by John Mueller and Matt Cutts -- that apparently if someone sends you bad links or you make bad links, however the link showed up, you can just disavow those links, you can put them in your disavow file, and this will help you get out of the Penguin algorithm. So this is the hypothesis, and not only does Google claim this is the case, but many SEOs claim this is the case as well. In fact, they go so far as to claim to have succeeded doing this for themselves or for clients, that they have just taken links and put them in the disavow file and those clients, on a Penguin refresh, have been saved from the terrible Penguin. It would be a large problem if this was not the case, because, as I mentioned, it is possible for people to simply buy a Fiverr blast -- I don't want to list off too many options to give you negative SEO ideas -- but you could imagine scenarios where it's pretty easy to build these spammy links pointing at sites and possibly get Google to notice them and then to milk those sites when Penguin 3 comes around or Penguin 4, the next iteration of Penguin. It would be very good if the disavow file worked. Personally, I'd like the disavow file to work if I could prove that it did. It is a problem, in a lot of ways, that it's not, which I'll get to in a second. However, if this is true, then there should be no recovery with link loss. For example, if this is true, that you can just disavow your way out of Penguin, then we should be able to find sites that escape on the Penguin date, but have deleted no links or we can tell have had no link loss whatsoever. That way, we can know that it was just a disavow file and not some combination of either deleting links on the disavow file or something else entirely. So if that is the case, that this hypothesis is true, then we can use a scientific method to determine that we should be able to find exemplars of the hypothesis. On the last Penguin 3, when it was released October 18th, for those people who claimed that they recovered and claim they did it only from a disavow file, I asked them to send me examples. I said, \"Fine. Send me your URL, and I'd like to check it.\" I tested over 12 sites altogether who claimed to have both recovered from Penguin on that date and to only use the disavow file or claimed to only use disavow file to do so. However, I found something rather striking, that every single one that I checked, they all had link loss. In either Majestic or Ahrefs or using the Moz tools, I found that they all had links that they lost a few months prior to the release of Penguin. Now whether they deleted the links and just lied to me, or whether they forgot they deleted the links, or whether the links just dropped off the link graph because, of course, web pages on the Internet change. For all we know, these could have been just scraper sites scraping them, giving them links that they didn't even want, and those sites just disappear. However the links were lost, the links were lost. So, what does that tell us? Well, unfortunately, it tells us that I cannot confirm the hypothesis. After 12 tries, the hypothesis that you can just use the disavow file to escape Penguin, I was not able to confirm that hypothesis. The examples, the evidence that people sent me trying to prove this hypothesis proved to be false. So I say myth busted or at the very least myth not confirmed. I was not able to confirm it after 12 plus tries to do so. At best, all I can say after doing the testing and, of course, I just want to add this note in now, if anybody out there, anybody seeing this video claims to have recovered from Penguin and just done it solely from the disavow file and they didn't delete any links and they didn't lose any links, please, by all means, send it to me, because as I said, it'd be lovely. It'd be wonderful if that's the way it worked, because then if someone is sending you a negative SEO attack, all you have to do is watch your backlinks on a daily basis and throw in there any ones that seems suspect. But as I said, I could not confirm that's the way it works. At best, all I can confirm is that deletion of links or loss of links still apparently has to be required in some way, and then two, this experiment, of course, has absolutely no bearing whatsoever on the manual penalty process, which I won't even get into, which the disavow file may or may not help with. I'm not talking about that for this Whiteboard Friday. The question then you'll ask me is, \"Josh, why, why, why, oh why, do people perpetuate this myth?\" Well, I'm afraid there is a number of plausible reasons why they might perpetuate this myth, both Google and other SEOs. One is because it's easy. An SEO who knows half of what they're doing can get a list of links and put them in a disavow file and give them to a client in about five minutes to upload. In fact, there are programs that will do it for you very quickly. Are they selling snake oil? I don't know, but I could not prove that the disavow file helped in any way, shape, or form for trying to get out of Penguin. Two, there is another reason why Google might possibly -- I'm just putting it out there for your consideration -- perpetuate the myth -- as far as I can tell it's a myth -- that the disavow file will help you escape from Penguin is because you're feeding their machine learning. Every link you put in there, it's entirely possible they can run through their algorithms, which Matt Cutts has admitted, at SMX Advanced 2013, they might just think of doing at some point in future, so they can tell what these badder spammy links are. And finally, propaganda. People are very afraid of negative SEO, with good reason. Whether or not it works or not, it definitely is a scary concept, and so it would be very reassuring for Google to tell people that, \"Hey, we have this nifty disavow file. So if you get scared, if you see some suspect links pointing to you, all you have to do is put them in your disavow file, and you don't have to worry about it at all whatsoever.\" However, I'd love that to be true, but I was not able to prove that being the case. So I'm going to say that I think the myth is busted. If anybody has any counter evidence to send to me, by all means I am all ears to look at it. All I need to do is plug it into a Majestic SEO or Ahrefs and see if there are any deleted links before the last Penguin release and say, \"No, you lost links, and so we cannot say that it is the disavow alone.\" To confirm that hypothesis, I would have to see no links lost in Majestic and no links lost in Ahrefs whatsoever, and, of course, I'd have to see an uptick on a declared Penguin date for me to say, \"Well, jeez, the evidence looks like they have released on Penguin, and they had no deleted links.\" Then I'll take your word for it that you submitted a disavow file, because, of course, I can't see that. Only the site owner can see that, or you can give me your login whatever. You can trust me. Until that time, I'm saying the myth is busted. The disavow file alone does not help you escape from Penguin, maybe in combination with deleting links, I'm not sure. I'm saying the disavow file is, unfortunately, the opiate of the masses. It is a safe myth we believe in because it makes us feel warm and snuggly at night. But I'm afraid that, after scientific testing, I cannot prove that that is case. I've come away from that with two more suggestions that I would recommend. One, I would stop paying for it. I would stop buying it. I would stop paying people to simply make you a disavow file and upload it. I would tell SEOs to stop selling that as a service alone. Of course, in conjunction with other services, fine. But that as a tactic alone, that's not going to do anything at all, because the evidence, so far that I've seen, doesn't suggest that it will. Furthermore, a more general point, it might be a good idea to think about stop selling and stop buying from-the-hip SEO, where SEOs are selling services based merely on hearsay and as much as we can, in our industry, triangle more for science based SEO or data based SEO. If anyone recommends any service to you or any suggestion or any SEO tactic to you, the first question you should ask is, \"Where did you come by this information? Do you have any data to prove that this is a good thing to do?\" That is my Whiteboard Friday for this week. If you have any questions at all or you want to e-mail me, yell at me, contradict me by all means, or please send me more sites I can test that may have sites that didn't delete any links, but did see an uptick on Penguin. By all means, join in the comments below, or e-mail me at JoshBachynski@gmail.com with that or any other questions. With that, I bid you adieu, and we'll see you again next time. Bye-bye. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Discussion: Can You Disavow out of Penguin?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Discussion: Can You Disavow out of Penguin?"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Josh Bachynski\n          \n            Josh Bachynski\n          \n            Josh Bachynski"
}