{
  "url": "https://moz.com/blog/can-rands-backlink-analysis-tool-be-gamed",
  "slug": "can-rands-backlink-analysis-tool-be-gamed",
  "title": "Can Rand's Backlink Analysis Tool Be Gamed? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So before you read this post - be sure of two things. The first, I'm no SEO blackhat so I could be wrong about this (or i may just have missed something) and 2) I'm just making SEOmoz aware of this issue and inviting members of the community to help me get my head round whether this is gameable or…",
  "content": "Can Rand's Backlink Analysis Tool Be Gamed? SEO Tools By: Richard Baxter January 17, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Richard Baxter January 17, 2008 Can Rand's Backlink Analysis Tool Be Gamed? SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Before you read this post, be sure of two things. First, I'm no SEO blackhat, so I could be wrong about this (or I may just have missed something), and secondly, I'm just making SEOmoz aware of this issue and inviting members of the community to help me get my head around whether this is gameable or not. The backlink anchor text analysis tool from SEOmoz is great, extremely useful, and a nice bit of code. It even gives you a handy little URL so that you can share your results with a friend. You could also share your results with the world! For example, here's one I ran earlier: https://moz.com/backlink-analysis/index/d390b04f0a6866e8df0b54bb44ec0d8ef648709b Now, first of all, I know there's no Google cache of this page, so there's not going to be much page rank! That's not to say I couldn't do a bit of link building to this URL to get it indexed. A bit of page rank and a few backlinks later and I've got some links with the right anchor text pointing straight back to a website of my choice from an extremely authoritative domain! There are a few pages like this indexed in Yahoo and Google already. Most of these backlink analysis pages have no link juice except this page - but I'm sure it could be taken advantage of. I suppose a small change to the coding on this tool to introduce a nofollow tag to every link created on the page would solve any potential future spamming issues. That, or add a rule to the robots.txt on the site. SEOmoz, I'd love to hear your thoughts! Have i just barked very loudly up a very large tree? Cheers, richardbaxterseo Richard Baxter is Founder and Director at SEOgadget.co.uk - a UK based SEO company with a passion for helping people and organisations to succeed in search. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can Rand's Backlink Analysis Tool Be Gamed?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can Rand's Backlink Analysis Tool Be Gamed?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}