{
  "url": "https://moz.com/blog/can-we-predict-anything-about-2021",
  "slug": "can-we-predict-anything-about-2021",
  "title": "The Best-Laid Plans: Can We Predict Anything About 2021? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How can we possibly plan for 2021 after the events of 2020? Dr. Pete reviews known Google events, what the COVID-19 timeline might look like, and how to prepare for re-opening.",
  "content": "The Best-Laid Plans: Can We Predict Anything About 2021? Marketing Industry | SEO Analytics | SEO Events By: Dr. Peter J. Meyers January 19, 2021 Table of Contents Copied! By: Dr. Peter J. Meyers January 19, 2021 The Best-Laid Plans: Can We Predict Anything About 2021? Marketing Industry | SEO Analytics | SEO Events I've deleted this introduction twice. To say that no one could've predicted how 2020 unfolded seems trite since we're not even a month into 2021, and this new year has already unraveled. Our challenges in the past year, across the globe, have gone far beyond marketing, and I doubt any of us ended the year the way we expected. This graph from Google Trends tells the story better than I can: The pandemic fundamentally rewrote the global economy in a way none of us has ever experienced, and yet we have to find a path forward. How do we even begin to chart a course in 2021? What do we know? Let's start small. Within our search marketing realm, is there anything we can predict with relative certainty in 2021? Below are some of the major announcements Google has made and trends that are likely to continue. While the timelines on some of these are unclear (and all are subject to change), these shifts in our small world are very likely. Mobile-only indexing (March) Mobile-first indexing has been in progress for a while, and most sites rolled over in 2020 or earlier. Google had originally announced that the index would fully default to mobile-first by September 2020, but pushed that timeline back in July (ostensibly due to the pandemic) to March 2021. If you haven't made the switch to a mobile-friendly site at this point, there's not much time left to waste. Keep in mind that \"mobile-first\" isn't just about speed and user experience, but making sure that your mobile site is as crawlable as your desktop. If Google can't reach critical pages via your mobile design and internal links, then those pages are likely to drop out of the index. A page that isn't indexed is a page that doesn't rank. Core Web Vitals (May) While this date may change, Google has announced that Core Web Vitals will become a ranking factor in 2021. Here's a bit more detail from the official announcement ... Page experience signals in ranking will roll out in May 2021. The new page experience signals combine Core Web Vitals with our existing search signals including mobile-friendliness, safe-browsing, HTTPS-security, and intrusive interstitial guidelines. Many of these page experience signals already impact ranking to some degree, according to Google, so the important part really boils down to Core Web Vitals. You can get more of the details in this Whiteboard Friday from Cyrus, but the short version is that this is currently a set of three metrics (with unfortunately techie names):(1) Largest Contentful Paint (LCP)LCP measures how quickly the largest, visible block of your page loads. It is one view into perceived load-time and tries to filter out background libraries and other off-page objects. (2) First Input Delay (FID)FID measures how much time it takes before a user can interact with your page. \"Interact\" here means the most fundamental aspects of interaction, like clicking an on-page link. (3) Cumulative Layout Shift (CLS)CLS measures changes to your page layout, such as ads that appear or move after the initial page-load. I suspect the update will apply mostly to abusive or disruptive layout shifts.While these metrics are a narrow slice of the user experience, the good news is that Google has defined all of them in a fair amount of detail and allows you to track this data with tools like Google Lighthouse. So, we're in a unique position of being be able to prepare for the May algorithm update. That said, I think you should improve site speed and user experience because it's a net-positive overall, not because of a pending 2021 update. If past history — including the HTTPS update and mobile-friendly update — is any indicator, Google's hope is to use the pre-announcement to push people to make changes now. I strongly suspect that Core Web Vitals will be a very minor ranking factor in the initial update, ramping up over a period of many months. Passage indexing/ranking (TBD) In October 2020, Google announced that they were \"... now able to not just index web pages, but individual passages from the pages.\" They later clarified that this wasn't so much passage indexing as passage ranking, and the timeline wasn't initially clear. Danny Sullivan later clarified that this change did not roll out in 2020, but Google's language suggests that passage ranking is likely to roll out as soon as it's tested and ready. While there's nothing specific you can do to harness passage ranking, according to Google, I think this change is not only an indicator of ML/AI progress but a recognition that you can have valuable, long-form content that addresses multiple topics. The rise of answers in SERPs (especially Featured Snippets and People Also Ask boxes) had a side-effect of causing people to think in terms of more focused, question-and-answer style content. While that's not entirely bad, I suspect it's generally driven people away from broader content to shorter, narrower content. Even in 2020, there are many examples of rich, long-form content that ranks for multiple Featured/Snippets, but I expect passage ranking will re-balance this equation even more and give us increased freedom to create content in the best format for the topic at hand, without worrying too much about being laser-targeted on a single topic. Core algorithm updates (TBD) It's safe to say we can expect more core algorithm updates in 2021. There were three named \"Core\" updates in 2020 (January, May, and December), but the frequency and timing has been inconsistent. While there are patterns across the updates, thematically, each update seems to contain both new elements and some adjustments to old elements, and my own analysis suggests that the patterns (the same sites winning and losing, for example) aren't as prominent as we imagine. We can assume that Google's Core Updates will reflect the philosophy of their quality guidelines over time, but I don't think we can predict the timing or substance of any particular core update. Googlebot crawling HTTP/2 (2022+) Last fall, Google revealed that Googlebot would begin crawling HTTP/2 sites in November of 2020. It's not clear how much HTTP/2 crawling is currently happening, and Google said they would not penalize sites that don't support HTTP/2 and would even allow opt-out (for now). Unlike making a site secure (HTTPS) or mobile-friendly, HTTP/2 is not widely available to everyone and may depend on your infrastructure or hosting provider. While I think we should pay attention to this development, don't make the switch to HTTP/2 in 2021 just for Google's sake. If it makes sense for the speed and performance of your site, great, but I suspect Google will be testing HTTP/2 and turning up the volume on it's impact slowly over the next few months. At some point, we might see a HTTPS-style announcement of a coming ranking impact, but if that happens, I wouldn't expect it until 2022 or later. When will this end? While COVID-19 may not seem like a marketing topic, the global economic impact is painfully clear at this point Any plans we make for 2021 have to consider the COVID-19 timeline, or they're a fantasy. When can we expect the pandemic to end and businesses to reopen on a national and global scale?Let me start by saying that I'm not a medical doctor — I'm a research psychologist by training. I don't have a crystal ball, but I know how to read primary sources and piece them together. What follows is my best read of the current facts and the 2021 timeline. I will try to avoid my own personal biases, but note that my read on the situation is heavily US-biased. I will generally avoid worst-case scenarios, like a major mutation of the virus, and stick to a median scenario. Where are we at right now? As I'm writing this sentence, over 4,000 people died just yesterday of COVID-19 in the US and over 14,000 globally. As a data scientist, I can tell you that every data point requires context, but when we cherry-pick the context, we deceive ourselves. What data science doesn't tell us is that everyone one of these data points is a human life, and that matters. There is a light at the end of the tunnel, in the form of viable vaccines, including (here in the US and in the UK) the Pfizer-BioNTech, Moderna, and Oxford-AstraZeneca vaccines. These vaccines have been approved in some countries, have demonstrated promising results, and are in production. Here in the US, we're currently behind the timeline on distribution, with the CDC reporting about 10 million people vaccinated as of mid-January (initial goal was 20 million vaccinated by the end of 2020). In terms of the timeline, it's important to note that, for maximum effectiveness, the major vaccines require two doses, separated by about 3-4 weeks (this may vary with the vaccine and change as research continues). Is it getting better or worse? I don't want to get mired in the data, but the winter holidays and travel are already showing a negative impact here in the US, and New Year's Eve may complicate problems. While overall death rates have improved due to better treatment options and knowledge of the disease, many states and countries are at or near peak case rates and peak daily deaths. This situation is very likely to get worse before it gets better. When might we reopen? I'm assuming, for better or worse, that reopening does not imply full \"herd immunity\" or a zero case-rate. We're talking about a critical mass of vaccinations and a significant flattening of the curve. It's hard to find a source outside of political debates here in the US, but a recent symposium sponsored by Harvard and the New England Journal of Medicine suggests that — if we can adequately ramp up vaccine distribution in the second quarter of 2021 — we could see measurable positive impact by the end of our summer (or early-to-mid third quarter) here in the US. Any prediction right now requires a lot of assumptions and there may be massive regional differences in this timeline, but the key point is that the availability of the vaccine, while certainly cause for optimism, is not a magic wand. Manufacturing, distribution, and the need for a second dose all mean that we're realistically still looking at a few months for medical advances to have widespread impact. What can we do now? First, let me say that there is absolutely no one-size-fits-all answer to this question. Many local businesses were decimated, while e-commerce grew 32% year-over-year in 2020. If you're a local restaurant that managed to stay afloat, you may see a rapid return of customers in the summer or fall. If you're a major online retailer, you could actually see a reduction in sales as brick-and-mortar stores become viable again (although probably not to 2019 levels). If your e-commerce business was lucky enough to see gains in 2020, Miracle Inameti-Archibong has some great advice for you. To inadequately summarize — don't take any of this for granted. This is a time to learn from your new customers, re-invest in your marketing, and show goodwill toward the people who are shopping online more because of the difficulties they're facing. If you're stuck waiting to reopen, consider the lead time SEO campaigns require to have an impact. In a recent Whiteboard Friday, I made the case that SEO isn't an on/off switch. Consider the oversimplified diagram below. Paid search is a bit like the dotted gray line — you flip the switch on, and the leads starting flowing. The trade-off is that when you flip the switch off, the leads dry up almost immediately. Organic SEO has a ramp-up. It's more like the blue curve above. The benefit of organic is that the leads keep coming when you stop investing, but it also means that the leads will take time to rebuild when you start to reinvest. This timeline depends on a lot of variables, but an organic campaign can often take 2-3 months or more to get off the ground. If you want to hit the ground running as reopening kicks in, you're going to need to start re-investing ahead of that timeline. I acknowledge that that might not be easy, and it doesn't have to be all or none. In a recent interview, Mary Ellen Coe (head of Google Marketing Solutions) cited a 20,000% increase during the pandemic in searches from consumers looking to support local businesses. There's a tremendous appetite for reopening and a surge of goodwill for local businesses. If you're a local business, even if you're temporarily closed, it's important to let people know that you're still around and to keep them up-to-date on your reopening plans as they evolve. I don't expect that the new normal will look much like the old normal, and I'm mindful that many businesses didn't survive to see 2021. We can't predict the future, but we can't afford to wait for months and do nothing, either, so I hope this at least gives you some idea of what to expect in the coming year and how we might prepare for it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best-Laid Plans: Can We Predict Anything About 2021?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best-Laid Plans: Can We Predict Anything About 2021?"
    },
    {
      "level": "H2",
      "text": "What do we know?"
    },
    {
      "level": "H3",
      "text": "Mobile-only indexing (March)"
    },
    {
      "level": "H3",
      "text": "Core Web Vitals (May)"
    },
    {
      "level": "H3",
      "text": "Passage indexing/ranking (TBD)"
    },
    {
      "level": "H3",
      "text": "Core algorithm updates (TBD)"
    },
    {
      "level": "H3",
      "text": "Googlebot crawling HTTP/2 (2022+)"
    },
    {
      "level": "H2",
      "text": "When will this end?"
    },
    {
      "level": "H3",
      "text": "Where are we at right now?"
    },
    {
      "level": "H3",
      "text": "Is it getting better or worse?"
    },
    {
      "level": "H3",
      "text": "When might we reopen?"
    },
    {
      "level": "H2",
      "text": "What can we do now?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}