{
  "url": "https://moz.com/blog/can-the-longtail-hurt-your-ppc-campaign",
  "slug": "can-the-longtail-hurt-your-ppc-campaign",
  "title": "Can the Long-Tail Hurt Your PPC Campaign? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yes, the long-tail can kill your pay-per-click campaign -- especially on Google.The problem, in AdWords, is the minimum bid. You minimum bid is determined by your account history, Quality Score, and the history of the search vertical (the industry associated with your phrases). If you are high…",
  "content": "Can the Long-Tail Hurt Your PPC Campaign? Paid Search Marketing (PPC) C By: Carlos del Rio October 10, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Carlos del Rio October 10, 2007 Can the Long-Tail Hurt Your PPC Campaign? Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Yes, the long-tail can kill your pay-per-click campaign -- especially on Google. The problem, in AdWords, is the minimum bid. You minimum bid is determined by your account history, Quality Score, and the history of the search vertical (the industry associated with your phrases). If you are a high volume click buyer with no history of poor advertisement you can buy anything at a reasonable rate. I know this particular search is offering valid ads, but sometimes the eBays and BizRates of the world show up for strange things. Discovering that BizRate has bargain prices on \"Carlos!\" is heartwarming, but strange. Especially since a proper name is not a highly lucrative term, in most cases. Right now, for Halloween, Target bids on peter to sell costumes, but through much of the year such bids seem strange. Target, eBay, etc. don't pay a very high cost per click. Small companies, on the other hand, do have to pay a higher cost. I am expected to pony up $0.20 for my name, even though it gets a Good or Great quality score. Why is it that a big company like eBay or Amazon can make such a killing off the long-tail? Because they have time. One thousand clicks that do nothing don't leave much of a dent in a campaign that generates tens of thousands of clicks per hour. But if you only generate one thousand clicks per month, the long-tail can be a death by tiny cuts. If you have too many phrases that only generate a few clicks per week/month, their combined cost can overwhelm a small budget. The important thing to remember is that organic search and paid search have a major difference: organic visibility lasts as long as your website exists, but paid only lasts 'til you run out of money. If you are running a small to medium campaign you may find better results from running large groupings of negative words rather than from a long list of long-tail phrases. A secondary concern while using the long-tail in paid search is that the more obscure your phrase, the less likely that you will achieve a high quality sore, unless you are targeting the phrase in your copy. If you have a low quality score, even an on-topic phrase may cost more than it is worth in the long run. Remember, paid and organic search are not the same game. They have different costs and benefits, so they should be played differently. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Can the Long-Tail Hurt Your PPC Campaign?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Can the Long-Tail Hurt Your PPC Campaign?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carlos del Rio\n          \n            Carlos del Rio\n          \n            Carlos del Rio"
}