{
  "url": "https://moz.com/blog/canada-quebec-local-search",
  "slug": "canada-quebec-local-search",
  "title": "Canada / Quebec local search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Eh! This has been a crazy 2 weeks... SES Toronto, and our business, NVI, just exploded recently! Been pretty busy trying to get all of this together and going through the amazing learning curve of turning NVI into an intense seo/sem research and analysis company. Oh, by the way, if you want to read…",
  "content": "Canada / Quebec local search Online Advertising E By: Ella_D May 6, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ella_D May 6, 2006 Canada / Quebec local search Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Eh! This has been a crazy 2 weeks... SES Toronto, and our business, NVI, just exploded recently! Been pretty busy trying to get all of this together and going through the amazing learning curve of turning NVI into an intense seo/sem research and analysis company. Oh, by the way, if you want to read an awesome book on management, I strongly recommend \"Good To Great\" from Jim Collins, one of the best management book (I bought the 5 audio CDs, they are incredible although I prefer to read usually... fits perfectly in a car for a 1h-2h ride...)Today I'm here to talk about local search in Canada. There is a huge difference between USA and Canada and I think the major factors are:-Population density-Brand recognition-Strategic SEO/SEM decisions taken by the nationwide leader to stay on top of the local search market (PagesJaunes.ca // YellowPages.ca).-Strong direct force marketing and telemarketing from the nationwide leader, especially across the Quebec province.Those factors directly impact the relevance of the directories. On paper, everyone knows the \"YellowPages / PagesJaunes\". And the same thing also happens on the Internet. In Canada, every single YellowPages / PagesJaunes listing is ALSO included in Google Local, a smart move from them. Also, announced for mid-april (although they will probably officialy launch in mid-june), their new research method: keyword-based research! Although I have some strong concerns about their search engine depth and quality of queries, I'm more than willing to give it a try.I've already mentioned that the YellowPages.ca are responsible of 36% of local search across Canada and ~50% across Quebec province. I think that the synchronization of Google Local with them really helped them get to a valuable position. For my part, I can even say that searching online on the YellowPages is way simpler / faster than using their paperbased version.As for visibility / traffic, I can use our company as a great example. They offer, since a couple months, a great online product called \"Interactive Banner\" on their site. What does it means? It means that you can pick up to 3 different categories on their directory and it will show you as a \"national or provincial leader\" for your industry. Indeed, if you search for any of the 3 following categories (Internet - Web Page Design, Internet Consultants or Internet Electronic Solutions provider), no matter where you did your query across the Quebec province (nationwide or city-limited packages are also available). This has generated several leads through calls to our office and visits/conversions on our website. Also, they provide a monthly report on your trafic and statistics (they partnered up with WebSideStory) to offer a detailed report. Don't get me wrong, this advertizing is expensive, although I think that for B2B and B2C local services, it can deliver great results if your industry is often queried through YellowPages and alike. Another major player in Canada (Quebec province for most of its audience) is the search engine + local directory \"La toile du Québec\". This search engine kinda replace all the minor search engines that we see in the US but that are pretty much invisible in Canada, especially in Quebec. Studies vary but it has been reported that it is responsible of 4-10% of the trafic, and that its conversion rates seem to be higher because the audience was more targeted. For our business, it is an important consideration... and it can bring 200-500 targeted visitors to your site every month (if you go for the VIP option which cost 69,95$/year) while providing a worthy backlink (basically, its a good referrer AND a good backlink, which is rare these days!). On my next post: I will focus on local/niche directories which are not considered mainstream, but more focused on specific industries, like real estate, jobs, freelance, trade centers. Any suggestions of topics you would like covered? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Canada / Quebec local search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Canada / Quebec local search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ella_D\n          \n            Ella_D"
}