{
  "url": "https://moz.com/blog/cannibalization",
  "slug": "cannibalization",
  "title": "Cannibalization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In today's episode of Whiteboard Friday, Moz SEO expert Tom Capper walks you through cannibalization: what it is, how to identify it, and how to fix it.",
  "content": "Cannibalization Whiteboard Friday | Technical SEO | SEO Basics By: Tom Capper September 17, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Capper September 17, 2021 Cannibalization Whiteboard Friday | Technical SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In today's episode of Whiteboard Friday, Tom Capper walks you through a problem many SEOs have faced: cannibalization. What is it, how do you identify it, and how can you fix it? Watch to find out! Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Happy Friday, Moz fans, and today we're going to be talking about cannibalization, which here in the UK we spell like this: cannibalisation. With that out of the way, what do we mean by cannibalization? What is cannibalization? So this is basically where one site has two competing URLs and performs, we suspect, less well because of it. So maybe we think the site is splitting its equity between its two different URLs, or maybe Google is getting confused about which one to show. Or maybe Google considers it a duplicate content problem or something like that. One way or another, the site does less well as a result of having two URLs. So I've got this imaginary SERP here as an example. So imagine that Moz is trying to rank for the keyword \"burgers.\" Just imagine that Moz has decided to take a wild tangent in its business model and we're going to try and rank for \"burgers\" now. So in position one here, we've got Inferior Bergz, and we would hope to outrank these people really, but for some reason we're not doing. Then in position two, we've got Moz's Buy Burgers page on the moz.com/shop subdirectory, which obviously doesn't exist, but this is a hypothetical. This is a commercial landing page where you can go and purchase a burger. Then in position three, we've got this Best Burgers page on the Moz blog. It's more informational. It's telling you what are the attributes to a good burger, how can you identify a good burger, where should you go to acquire a good burger, all this kind of more neutral editorial information. So we hypothesize in this situation that maybe if Moz only had one page going for this keyword, maybe it could actually supplant the top spot. If we think that's the case, then we would probably talk about this as cannibalization. However, the alternative hypothesis is, well, actually there could be two intents here. It might be that Google wishes to show a commercial page and an informational page on this SERP, and it so happens that the second best commercial page is Moz's and the best informational page is also Moz's. We've heard Google talk in recent years or representatives of Google talk in recent years about having positions on search results that are sort of reserved for certain kinds of results, that might be reserved for an informational result or something like that. So this doesn't necessarily mean there's cannibalization. So we're going to talk a little bit later on about how we might sort of disambiguate a situation like this. Classic cannibalization First, though, let's talk about the classic case. So the classic, really clear-cut, really obvious case of cannibalization is where you see a graph like this one. So this is the kind of graph you would see a lot of rank tracking software. You can see time and the days of the week going along the bottom axis. Then we've got rank, and we obviously want to be as high as possible and close to position one. Then we see the two URLS, which are color-coded, and are green and red here. When one of them ranks, the other just falls away to oblivion, isn't even in the top 100. There's only ever one appearing at the same time, and they sort of supplant each other in the SERP. When we see this kind of behavior, we can be pretty confident that what we're seeing is some kind of cannibalization. Less-obvious cases Sometimes it's less obvious though. So a good example that I found recently is if, or at least in my case, if I Google search Naples, as in the place name, I see Wikipedia ranking first and second. The Wikipedia page ranking first was about Naples, Italy, and the Wikipedia page at second was about Naples, Florida. Now I do not think that Wikipedia is cannibalizing itself in that situation. I think that they just happen to have... Google had decided that this SERP is ambiguous and that this keyword \"Naples\" requires multiple intents to be served, and Wikipedia happens to be the best page for two of those intents. So I wouldn't go to Wikipedia and say, \"Oh, you need to combine these two pages into a Naples, Florida and Italy page\" or something like that. That's clearly not necessary. Questions to ask So if you want to figure out in that kind of more ambiguous case whether there's cannibalization going on, then there are some questions we might ask ourselves. 1. Do we think we're underperforming? So one of the best questions we might ask, which is a difficult one in SEO, is: Do we think we're underperforming? So I know every SEO in the world feels like their site deserves to rank higher, well, maybe most. But do we have other examples of very similar keywords where we only have one page, where we're doing significantly better? Or was it the case that when we introduced the second page, we suddenly collapsed? Because if we see behavior like that, then that might, you know, it's not clear-cut, but it might give us some suspicions. 2. Do competing pages both appear? Similarly, if we look at examples of similar keywords that are less ambiguous in intent, so perhaps in the burgers case, if the SERP for \"best burgers\" and the SERP for \"buy burgers,\" if those two keywords had completely different results in general, then we might think, oh, okay, we should have two separate pages here, and we just need to make sure that they're clearly differentiated. But if actually it's the same pages appearing on all of those keywords, we might want to consider having one page as well because that seems to be what Google is preferring. It's not really separating out these intents. So that's the kind of thing we can look for is, like I say, not clear-cut but a bit of a hint. 3. Consolidate or differentiate? Once we've figured out whether we want to have two pages or one, or whether we think the best solution in this case is to have two pages or one, we're going to want to either consolidate or differentiate. So if we think there should only be one page, we might want to take our two pages, combine the best of the content, pick the strongest URL in terms of backlinks and history and so on, and redirect the other URL to this combined page that has the best content, that serves the slight variance of what we now know is one intent and so on and so forth. If we want two pages, then obviously we don't want them to cannibalize. So we need to make sure that they're clearly differentiated. Now what often happens here is a commercial page, like this Buy Burgers page, ironically for SEO reasons, there might be a block of text at the bottom with a bunch of editorial or SEO text about burgers, and that can make it quite confusing what intent this page is serving. Similarly, on this page, we might at some stage have decided that we want to feature some products on there or something. It might have started looking quite commercial. So we need to make sure that if we're going to have both of these, that they are very clearly speaking to separate intents and not containing the same information and the same keywords for the most part and that kind of thing. Quick tip Lastly, it would be better if we didn't get into the situation in the first place. So a quick tip that I would recommend, just as a last takeaway, is before you produce a piece of content, say for example before I produced this Whiteboard Friday, I did a site:moz.com cannibalization so I can see what content had previously existed on Moz.com that was about cannibalization. I can see, oh, this piece is very old, so we might — it's a very old Whiteboard Friday, so we might consider redirecting it. This piece mentions cannibalization, so it's not really about that. It's maybe about something else. So as long as it's not targeting that keyword we should be fine and so on and so forth. Just think about what other pieces exist, because if there is something that's basically targeting the same keyword, then obviously you might want to consider consolidating or redirecting or maybe just updating the old piece. That's all for today. Thank you very much. Video transcription by Speechpad.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Cannibalization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Cannibalization"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is cannibalization?"
    },
    {
      "level": "H3",
      "text": "Classic cannibalization"
    },
    {
      "level": "H3",
      "text": "Less-obvious cases"
    },
    {
      "level": "H3",
      "text": "Questions to ask"
    },
    {
      "level": "H4",
      "text": "1. Do we think we're underperforming?"
    },
    {
      "level": "H4",
      "text": "2. Do competing pages both appear?"
    },
    {
      "level": "H4",
      "text": "3. Consolidate or differentiate?"
    },
    {
      "level": "H3",
      "text": "Quick tip"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Capper\n          \n            Tom Capper\n          \n            Tom Capper"
}