{
  "url": "https://moz.com/blog/car-dealership-seo",
  "slug": "car-dealership-seo",
  "title": "Automotive SEO: How to Optimize Car Dealership Websites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While most verticals require different SEO strategies, car dealerships face particularly complex challenges. What special considerations does this vertical require, and how can they effectively optimize their sites and GMB listings?",
  "content": "How to Optimize Car Dealership Websites Local SEO | SEO Basics By: Sherry Bonelli July 3, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sherry Bonelli July 3, 2018 How to Optimize Car Dealership Websites Local SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Getting any local business to rank high on Google is becoming more and more difficult, but one of the most competitive — and complex — industries for local SEO are car dealerships. Today’s car shoppers do much of their research online before they even step into a dealership showroom. (And many people don’t even know what type of car they even want when they begin their search.) According to Google, the average car shopper only visits two dealerships when they’re searching for a new vehicle. That means it’s even more important than ever for car dealerships to show up high in local search results. However, car dealerships are more complex than the average local business — which means their digital marketing strategies are more complex, as well. First, dealers often sell new vehicles from several different manufacturers with a variety of makes and models. Next, because so many people trade in their old cars when they purchase new cars, car dealers also sell a variety of used vehicles from even more manufacturers. Additionally, car dealerships also have a service department that offers car maintenance and repairs — like manufacturer warranty work, oil changes, tire rotations, recall repairs, and more. (The search feature on a car dealer’s website alone is a complex system!) Essentially, a car dealer is like three businesses in one: they sell new cars, used cars, AND do vehicle repairs. This means your optimization strategy must also be multi-faceted, too. Also, if you look at the car dealerships in your city, you will probably find at least one dealership with multiple locations. These multi-location family of dealerships may be in the same city or in surrounding cities. Additionally, depending on that family of dealerships, they may have one website or they might have different websites for each location. (Many auto manufacturers require dealers to have separate websites if they sell certain competitors’ vehicles.) So if you’re helping car dealers with SEO, you must be thinking about the various manufacturers, the types of vehicles being sold (new and used), the repair services being offered, the number of websites and locations you’ll be managing, manufacturer requirements — among other things. So what are some of the search optimization strategies you should use when working with a car dealership? Here are some SEO recommendations. Google My Business Google My Business has been shown to have a direct correlation to local SEO — especially when it comes to showing up in the Google Local 3-Pack. One important factor with Google My Business is making sure that the dealership’s information is correct and contains valuable information that searchers will find helpful. This is important for competitive markets — especially when only a handful of sites show up on the first page of Google search results. Here are some key Google My Business features to take advantage of: Name, address, and phone number Ensure that the dealership’s name, address and phone number is correct. (If you have a toll-free number, make sure that your LOCAL area code phone number is the one listed on your Google My Business listing.) It’s important that this information is the same on all local online directories that the dealership is listed on. Categories Google My Business allows you to select categories (a primary category and additional categories) to describe what your dealership offers. Even though the categories you select affect local rankings, keep in mind that the categories are just one of many factors that determine how you rank in search results. These categories help connect you with potential customers that are searching for what your car dealership sells. You can select a primary category and additional categories – but don’t go overboard by selecting too many categories. Be specific. Choose as few categories as possible to describe the core part of your dealership’s business. If the category you want to use isn’t available, choose a general category that’s still accurate. You can’t create your own categories. Here are some example categories you could use:Car DealerUsed Car DealerBMW dealerKeep in mind that if you’re not ranking as high as you want to rank, changing your categories may improve your rankings. You might need to tweak your categories until you get it right. If you add or edit one of your categories, you might be asked by Google to verify your business again. (This just helps Google confirm that your business information is accurate.) Photos Google uses photo engagement on Google My Business to help rank businesses in local search. Show photos of the new and used cars you have on your dealership’s lot — and be sure to update them frequently. After you make a sale, make sure you get a photo consent form signed and ask if you can take a picture of your happy customers with their new car to upload to Google My Business (and your other social media platforms.) If you’re a digital marketing agency or a sales manager at a dealership, getting your salespeople to upload photos to Google My Business can be challenging. Steady Demand’s LocalPics tool makes it easy for salespeople to send pictures of happy customers in their new cars by automatically sending text message reminders. You simply set the frequency of these reminders. The LocalPics tool automatically sends text messages to the sales reps reminding them to submit their photos: All the sales reps have to do is save their customers’ photos to their phone. You set up text message reminders to each sales rep and when they get the text message reminder, the sales team simply has to go into their smartphone’s pictures and upload their images through the text message, and the photos are automatically posted to the dealership’s Google My Business listing! (They can also text photos to their Google My Business anytime they want as well — they don’t have to wait for the reminder text messages.) Videos Google recently began allowing businesses to upload 30-second videos to their Google My Business listing. Videos are a great way to show off the uniqueness of your dealership. These videos auto-play on mobile devices — which is where many people do their car searching on — so you should include several videos to showcase the cars and what’s going on at your dealership. Reviews Online reviews are crucial for when people search for the right type of car AND the dealership they should purchase that car from. Make sure you ask happy customers to leave reviews on your Google My Business listing and ensure that you keep up by responding to all reviews left on your Google My Business listing. Questions & Answers The Google My Business Q&A feature has been around for several months, yet many businesses still don’t know about it — or pay attention to it. It’s important that you are constantly looking at questions that are being asked of your dealership and that you promptly answer those questions with the correct answer. Just like most things on Google My Business, anyone can answer questions that are asked — and that means that it’s easy for misinformation to get out about your dealership and the cars on your lot. Make sure you have a person dedicated on your team to watch the Q&As being asked on your listing. Also, be sure to frequently check your GMB dashboard. Remember, virtually anyone can make changes to your Google My Business listing. You want to check to make sure nobody has changed your information without you knowing. Online directories (especially car directories) If you’re looking for ways to improve your dealership’s rankings and backlink profile, online automotive directories are a great place to start. Submitting your dealership’s site to an online automotive directory or to an online directory that has an automotive category can help build your backlink profile. Additionally, many of these online directories show up on the first page of Google search results, so if your dealership isn’t listed on them, you’re missing out. There are quite a few paid-for and free automotive online directories. Yelp, YellowPages, Bing, etc. are some of the larger general online directories that have dedicated automotive categories you can get listed on for free. Make sure your dealership’s name, address, and phone number (NAP) are consistent with the information that you have listed on Google My Business. Online reviews Online reviews are important. If your dealership has bad reviews, people are less likely to trust you. There are dedicated review sites for vehicle reviews and car dealership reviews. Sites like Kelley Blue Book, DealerRater, Cars.com, and Edmunds are just a few sites that make it easy for consumers to check out dealership reviews. DealerRater even allows consumers to list — and review — the employees they worked with at a particular dealership: If they have a negative experience with your dealership — or one of your employees — you can bet that unhappy customer will leave a review. (And remember that reviews are not only left about your new and used car sales — they are also left about your repair shop as well!) There are software platforms you can install on your dealership’s site that make it easier for customers to leave reviews for your dealership. These tools also make it simple to monitor and deflect negative reviews to certain review websites. (It’s important to note that Google recently changed their policies and no longer support “review gating” — software that doesn’t allow a negative review to be posted on Google My Business.) NOTE: Many automotive manufacturers offer dealerships coop dollars that can be used for advertising and promotions; however, sometimes they make it easier for the dealers to get that money if they use specific turnkey programs from manufacturer-approved vendors. As an example, if you offer a reputation marketing software tool that can help the dealership get online reviews, the dealership may be incentivized to use DealerRater instead because they’ve been “approved” by the manufacturer. (And this goes for other marketing and advertising as well — not just reputation marketing.) Select long-tail keywords Selecting the right keywords has always been a part of SEO. You want to select the keywords that have a high search frequency, mid-to-low competitiveness, ones that have direct relevance to your website’s content — and are keyword phrases that your potential car buyers are actually using to search for the cars and services your dealership offers. When it comes to selecting keywords for your site’s pages, writing for long-tailed keywords (e.g. “2018 Ford Mustang GT features”) have a better chance of ranking highly in Google search results than a short-tailed and generic keyword phrase like “Ford cars.” Other car-related search keywords — like “MSRP” and “list prices” — are keywords you should add to your arsenal. Optimize images According to Google, searches for \"pictures of [automotive brand]\" is up 37% year-over-year. This means when you’re uploading various pictures of the cars for sale on your car lot, be sure to include the words “pictures of” and the brand name, make, and model where appropriate. For instance, if you’re showing the interior of the 2018 Dodge Challenger, you may want to name the actual picture image file “picture-of-dodge-challenger-2018-awd-front-seat-interior.png” and use the alt tag “Pictures of Dodge Challenger 2018 AWD Front Seat Interior for Sale in Cedar Rapids.” As with everything SEO-related, use discretion with the “pictures of” strategy. Don’t overdo it, but it should be a part of your image optimization strategy to a certain extent on specific car overview pages. Optimize for local connections One thing many car dealerships fail to realize is how important it is to make local connections — not only for local SEO purposes but also for community trust and support as well. You should make a connection on at least one of the pages on your site that relates to what’s going on in your local community/city. For instance, on your About Us page, you may want to include a link to a city-specific page that talks about what’s going on in your city. Is there a July 4th parade? And if so, are you having a float or donating a convertible for the town’s mayor to ride in? If you sponsor a local charity or belong to the Chamber of Commerce, it’d be great to mention it on one of these localized pages (mentioning your city’s name, of course) and talk about what your dealership’s role is and what you do. Is there an upcoming charity walk or do you donate to your local animal shelter? Share pictures (and be sure to use alt tags) and write about what you’re doing to help. All of this information not only helps beef up your local SEO because you’re using the city’s name you’re trying to rank for, but it also creates good will for future customers. Additionally, you can create links to these various charities and organizations and ask that they, in turn, create a link to your site. Local backlinking at its best! Schema If you want to increase the chances of Google — and the other search engines — understanding what your site’s pages are about, using schema markup will give you a leg-up over your competition. (And chances are your car dealership competitors aren’t yet using schema markup.) You’ll want to start by using the Vehicle “Type” schema and then markup each particular car using the Auto schema markup JSON-LD code. You can find the Schema.org guidelines for using Schema Markup for Cars on Schema.org. Below is an example of what JSON-LD schema markup looks like for a 2009 Volkswagen Golf: Listen to the SEO for Car Dealerships podcast episode to learn EVEN MORE! If you want to learn even more information about the complexities of car dealerships and search optimization strategies, be sure to listen to my interview on MozPod’s SEO for Car Dealerships. In this podcast we’ll cover even more topics like: What NOT to include in your page’s title tagHow to determine if you really own your dealership’s website or notHow to handle it if your dealership moves locationsWhy using the manufacturer-provided car description information verbatim is a bad ideaDoes “family owned” really matter?How to handle car dealers with multiple locationsHow to get creative with your Car Service pages by showing off your employeesWhy blogging is a must-do SEO strategy and some topic ideas to get you startedWays to get local backlinksTips for getting online reviewsWhat other digital marketing strategies you should try and whyAnd more Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Optimize Car Dealership Websites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Optimize Car Dealership Websites"
    },
    {
      "level": "H2",
      "text": "Google My Business"
    },
    {
      "level": "H3",
      "text": "Name, address, and phone number"
    },
    {
      "level": "H3",
      "text": "Categories"
    },
    {
      "level": "H3",
      "text": "Photos"
    },
    {
      "level": "H3",
      "text": "Videos"
    },
    {
      "level": "H3",
      "text": "Reviews"
    },
    {
      "level": "H3",
      "text": "Questions & Answers"
    },
    {
      "level": "H2",
      "text": "Online directories (especially car directories)"
    },
    {
      "level": "H2",
      "text": "Online reviews"
    },
    {
      "level": "H2",
      "text": "Select long-tail keywords"
    },
    {
      "level": "H2",
      "text": "Optimize images"
    },
    {
      "level": "H2",
      "text": "Optimize for local connections"
    },
    {
      "level": "H2",
      "text": "Schema"
    },
    {
      "level": "H2",
      "text": "Listen to the SEO for Car Dealerships podcast episode to learn EVEN MORE!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sherry Bonelli\n          \n            Sherry Bonelli\n          \n            Sherry Bonelli"
}