{
  "url": "https://moz.com/blog/case-study-following-rands-advice-on-virality",
  "slug": "case-study-following-rands-advice-on-virality",
  "title": "Case Study - Following Rand's Advice On Virality - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently Rand did a great Whiteboard Friday video on how to increase the chances that content will go viral. We used that video as a guide when publishing an infographic on AdChop.com.",
  "content": "Case Study - Following Rand's Advice On Virality Content Marketing By: Justin May 9, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Justin May 9, 2012 Case Study - Following Rand's Advice On Virality Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently Rand did a great Whiteboard Friday video on how to increase the chances that content will go viral. We used that video as a guide when publishing an infographic on AdChop.com. The following Google Analytics chart shows you the effect that Rand's advice had on our traffic in the short term. This chart shows our overall site traffic for the past month: Here's how we did it... The Right UI/UX Based on Rand's suggestions in the video, we: Decided to publish some ad design tips and split testing ideas in infographic format Ensured that the page containing the infographic had only minimal advertising or clutter Chose a simple URL Included a few compelling images that users could choose as thumbnails when sharing on Facebook & Google+ (we used \"og:image\" metadata to include some additional thumbnail options that weren't actually visible on the page itself) Getting Buy-In From Influencers Part of Rand's strategy involved making well-known influential people more likely to share your content by asking for their input before (\"not during, not after, but BEFORE\") publishing it. So we did exactly that... We asked a total of 100 influencers in our industry for their feedback on the initial draft of the infographic that we had created. (We didn't actually aim for a nice round number like 100... it just worked out that way). We'd been in touch with a few of those influencers in the past, but the vast majority we contacted by sending a \"cold\" email. Of those 100 people, 34 responded to our email and provided input. Of those 34, at least 19 did something to actively promote the infographic after we told them it was live - a tweet, a blog post, etc. The 34 who responded gave us great feedback that we incorporated into the final version of the infographic - making it a more effective infographic, thus more likely that those influencers - and everyone else - would want to share it. To further increase the chances that these influencers would share the infographic, we gave them credit for their input in the infographic itself, and linked back to their website on the page where we published it. Having 19 influencers spreading the word was a great way to \"seed\" the viral campaign! Oh, and since Rand mentioned that Tuesday to Thursday are generally best for launching this type of thing, we published the infographic on a Tuesday. The Results We did almost nothing to promote the infographic aside from telling the 34 influencers that we had published it. Eight days later, on top of the dramatic and sustained increase in traffic to our site (see analytics chart above), these were number of social shares of the infographic: Those numbers may not look huge, but for a relatively new website that had never had never received more than 10 likes and 15 tweets on any other piece of content, we're quite satisfied. In addition to the social shares & initial burst of traffic that we received, we also got backlinks from 42 different root domains to the infographic (that we've discovered so far), which will help with SEO and bringing in more traffic in the long-term. Unanticipated Benefits Pinterest When we published the infographic I didn't have a Pinterest account (still don't, actually!) - I'd glanced at Pinterest a couple of times in the past, noticed that it didn't have any categories related to business or marketing, and therefore assumed it couldn't be of much use to me. A day or two after publishing the infographic we were looking at our analytics and noticed that one of the top referrers was Pinterest. So we quickly added a \"Pin It\" button alongside the Like, Tweet, and +1 buttons on the page containing the infographic. It turned out that the infographic has received more Pins than all of the Likes, Tweets, and +1s combined! The lesson is obvious - Pinterest can be a great traffic generator even for niches like online marketing. Networking We're always looking for new sources for case studies to publish on AdChop, so we were happily surprised to notice that many of the people who had posted/tweeted/etc about the infographic were the type who would likely be interested in the free exposure they could get on AdChop through sharing a case study of their own. Since these people had already shared the infographic they are warm leads, so we have an opener - \"Hey, thanks for tweeting our infographic - want to share a case study?\" These contacts may also become affiliates, or we may be able to offer each other value in other ways. It'll Be Easier Next Time Next time we put together some sort of \"contributor-generated\" content intended for virality, it will no doubt be easier - we already have contacts who we've already worked with on a similar project, and we can point out the success of this last one to new potential contributors. What Could We Have Done Better? In hindsight, I think we should have contacted a few popular websites in our niche ahead of time to suggest that they might like to publish our infographic when it was ready. I contacted those types of site as an afterthought a few days after we published the infographic, but I think that was too late. What do YOU think we could have done better? If you'd like to check out our infographic yourself, it is here - http://adchop.com/ad-design-tips-infographic/ Thanks to Rand for the great ideas! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study - Following Rand's Advice On Virality"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study - Following Rand's Advice On Virality"
    },
    {
      "level": "H1",
      "text": "The Right UI/UX"
    },
    {
      "level": "H1",
      "text": "Getting Buy-In From Influencers"
    },
    {
      "level": "H1",
      "text": "The Results"
    },
    {
      "level": "H1",
      "text": "Unanticipated Benefits"
    },
    {
      "level": "H2",
      "text": "Pinterest"
    },
    {
      "level": "H2",
      "text": "Networking"
    },
    {
      "level": "H2",
      "text": "It'll Be Easier Next Time"
    },
    {
      "level": "H1",
      "text": "What Could We Have Done Better?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Justin\n          \n            Justin"
}