{
  "url": "https://moz.com/blog/case-study-using-industry-authorities-for-link-building",
  "slug": "case-study-using-industry-authorities-for-link-building",
  "title": "Case Study: Using Industry Authorities for Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I’m going to explain the thought process, execution and results of this link building project so that you can hopefully replicate our successes within your own niche.",
  "content": "Case Study: Using Industry Authorities for Link Building Content Marketing | Link Building By: Sam Miranda September 10, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Sam Miranda September 10, 2014 Case Study: Using Industry Authorities for Link Building Content Marketing | Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Link building in 2014 has become increasingly people focused. Blogger outreach, PR commenting and relationship building with authority figures in relevant industries are amongst the most legitimate and successful link building strategies. In my experience, partnering up with a figure of authority in a particular niche can be a very powerful approach. To be clear, I don’t mean firing industry experts a tweet to request a share; I’m talking about collaboration over an evergreen content asset. Piggybacking on the prestige and authority of specialists is one of the best ways to get cited in a premium publication and the benefits can be mutual, as I will demonstrate. Here’s a case study from the gambling industry – traditionally one of the toughest niches in which to acquire white-hat links. A few months ago, my company formed an editorial relationship with an authority figure on a single content asset, which led to a lot of positive outcomes for us (some of them quite unexpected). I’m going to explain the thought process, execution and results of this link building project so that you can hopefully replicate our successes within your own niche.The challenge In April, my company launched RightCasino.com: a casino comparison and gambling information portal. Drawing inspiration from comparison services in niches such as travel and insurance, we aimed to create a legitimate, trusted brand in a notoriously shady industry. As you might expect, we faced a few roadblocks. Many webmasters remain hesitant to link to gambling material (unless there’s a financial incentive) and since casino gaming is a pretty insular activity, there isn’t really a community at which to direct your content marketing initiatives. We also had difficulty planning our on-site content. While there is plenty of potential for useful, innovative gambling content (casino game guides, online poker tutorials and sports-betting tipster videos etc.) little of this is conducive to attracting links, despite being great for the user. As a partial solution to this problem, we developed RightCasino.com’s news section as a repository for linkable assets, rather than emulating the shoddy company blogs you see on many gambling websites. We killed two birds with one stone by consistently populating our news section with high-quality, sector-relevant content. A blog post by Jason Acidre cites Zeph Snapp (CEO of Altura Interactive) recommending this approach for steadily growing traffic, bringing more eyeballs to your site and attracting organic links. Initially, we lacked an original, ‘flagship’ asset to seal our authority and attract premium links. I felt that the best way to achieve this was to approach an authoritative figure in our niche for an interview.Step 1: Identify and approach the authority figure Taking a leaf out of Matt Barby’s book, we used BuzzSumo to find popular industry content, and then analysed the authors to identify potential collaborators. Ultimately, we settled on Dr. Mark Griffiths: a lecturer at Nottingham Trent University, co-founder of GamCare (the UK’s leading gambling addiction charity) and an international expert on gambling psychology and addiction. As a potential interviewee, Dr. Griffiths had a lot going for him. He was a prolific and influential industry commentator, having received national media coverage through the BBC – pretty rare for a gambling specialist. I also felt that interviewing an expert on gambling addiction would be on-brand for RightCasino.com. By providing Dr. Griffiths a platform, we would reinforce a message of social responsibility and promote our reputation as a credible information hub. Before making initial contact, we researched Dr. Griffiths’ footprint to gauge his online presence – we were not disappointed. After using Open Site Explorer to assess the backlinks to Dr. Griffiths’ blog (see below) and finding it referenced on domains such as The Guardian and The Independent it became apparent that Dr. Griffiths was an extremely authoritative web persona. When making the first move in any kind of outreach, I find it’s always a good idea to demonstrate enthusiasm and knowledge regarding your target’s work (you could call this ego-baiting). Therefore, in my initial outreach to Dr. Griffiths (conducted via a website form on his blog), I explained that I was a gambling journalist and writer looking to pick his brains about some of the industry’s most contentious topics, having read his weekly blog on Psychology Today. This was Dr. Griffiths’ response: Over the course of a short email correspondence, we arranged to conduct an interview using the University’s own audio-visual equipment. Dr Mark would grant us an audience as long as his time was paid for (Nottingham Trent was charging £150 per hour). In the interim, my content team and I collaborated on a set of interview questions that we felt would generate controversial responses. We decided to divide the interview into seven parts, organised by topic, touching on relevant or contentious aspects of commercial gambling. In a previous Moz post, I explained that you can generate crossover appeal from a single niche subject by focusing on different sub-topics. This provides long-form assets with cross-industry appeal and also ameliorates the problem of always having to market your content to websites from your own niche. Here’s a diagram from a presentation I gave at the 2014 London Affiliate Conference to demonstrate what I mean. As you can see, there’s plenty of scope for creativity: Our seven subject areas included:Gambling’s treatment by the British media Gambling in popular culture Casino games on social media Land-based casinos Gambling psychology UK gambling policy Problem gambling and addiction Though not standard journalistic practice, I sent these questions to Dr. Griffiths in advance, giving him adequate time to consider his responses and to confirm that he was satisfied with our proposed areas of discussion. This concluded the initial phase of outreach. Costs and projected profits Once Dr. Griffiths had consented to our proposal, our attention turned to financials. As a bare minimum – in addition to Dr. Griffiths’ time - we needed to take three members of staff (our interviewer, our site manager and myself) off their normal duties for an entire day, transport them to Nottingham (and back) and feed them on company expenses. Add to this the time, resources and energy of content creation and marketing once our interview was complete. Below is an updated (but still approximate) breakdown of our costs:Dr. Griffiths’ time: £150 per hour, for three hours = £450 Transport: three off-peak return tickets from London to Nottingham = £100 Amenities: lunch etc. = £60 Design and video editing: 32 hours of designer’s time = £384 Content creation: 10 hours of content team’s time = £120 Outreach: 9 hours of content strategist’s time = £108 Transcriptions: three hours of footage = £45 This comes to a total expenditure of around £1,417. Weighing up the potential return on investment was tricky: how could we assign a cash value to hypothetical links? After all, there’s no precise formula for determining whether X links will guarantee X ranking improvements, Y traffic figures or Z conversions. Therefore, we had to look at the market price. In our sector, many competitors purchase links from mediocre websites, which can set them back between £150 and £200. Given this figure, we needed a minimum of 6/7 medium-quality links to justify the basic cost of the project. With this in mind, we decided to proceed based on the following:We would be able to obtain links from high quality websites and publications: links that cannot be purchased, and if they were to be purchased, would far exceed the £200 mark. We would have an extensive, linkable asset with the potential for a passive stream of links from journalists, students and other interested parties researching the subject areas covered in the interviews. We would have a flagship piece of content that re-enforced our brand’s ethos. We would forge a long-term relationship with Dr. Mark, with the potential for more links, shares and original quotes. We wouldn’t need to buy links, keeping us firmly within Google’s Quality Guidelines. Step 2: Content Creation When the interview date came around, two colleagues and I hopped on a train to Nottingham to meet Dr. Griffiths in his office at Nottingham Trent University. After introducing ourselves, we set up a digital camera and recorded roughly three hours of footage. While it was clear that the raw material we obtained wasn’t going to win any Emmys, it was more than sufficient for our purposes. Dr. Griffiths proved an exceptional interviewee, offering up fascinating and contentious views on gambling in the United Kingdom. Among these, his condemnation of casino-style games on Facebook as “the number one risk factor for adolescent gambling,” was particularly headline-worthy. After returning to London, we immediately allocated roles for publishing and marketing our evergreen asset:Our designer was delegated editing duties, using Adobe Premier Pro. Our content, development and design teams would work together on producing landing pages for the seven parts of the interview, in addition to a central hub page for navigation (which can be found here). These pages were to contain bespoke imagery and full transcripts, similar to the style of Moz’ Whiteboard Fridays. I would develop a list of outreach targets in Buzzstream (made up of former contacts and fresh linking opportunities) and develop our overall marketing strategy. Our content manager and I would collaborate on developing ‘satellite’ articles, based around and referencing our on-site interview videos. These would then be marketed to my outreach targets. We minimised costs and ensured quality by keeping as much work as possible in-house: only the transcriptions were outsourced. In addition to publishing on RightCasino.com and through our social channels, we simultaneously released our videos through multiple distribution networks (including YouTube, Wistia, Vimeo and Dailymotion), thus spreading our net as wide as possible. Step 3: The Link Building Process As I mentioned, we had already split our interview into seven subject areas that collectively covered such diverse topics as politics, celebrity sponsorship and the psychology of slot machines. Because every section of the interview had its own landing page, we were able to market them individually. Wringing as much variety as possible from the same pool of content made it easier to target a number of sources outside of the gambling sector. Before commencing outreach, we compiled a list of 80 targets in Buzzstream. Several of these were ‘reliable’ sites where I had already contributed work and developed an editorial relationship with the webmasters. In my outreach emails, I introduced myself and Dr Mark, then detailed some of the most controversial takeaways from our interview. I also offered to provide webmasters with a personalised write up for their sites. Meanwhile, our content team worked independently on several ‘satellites’ that cited the video interviews on RightCasino.com as sources. A couple of examples include a controversial news article titled: “GamCare co-founder says “Less than 1% of Britons are problem gamblers,” and an op-ed on super casinos that implied Dr Griffiths was in favour of a ‘British Vegas.’ These satellites were submitted to the most desirable domains in our list of targets. I find it’s always preferable to approach authoritative websites with a finished product rather than a standard pitch. Results The Mark Griffiths project has acquired high calibre links that are hard to come by for any small affiliate brand, let alone one from the gambling sector. To date, we can boast links from the following domains: The Conversation (PR8): “Screenagers Face Troubling Addictions From An Early Age” Nottingham Trent University (PR7): “Dr Mark Griffiths on Gambling” Gamasutra (PR7): “Liberty Bell, Liberty Bell…Cherry: Gaming, Gambling and the Near Miss” And also… Sbs.com.au (PR8) DigitalJournal.com (PR6) Sabotagetimes.com (PR5) CalvinAyre.com (PR5) CasinoAffiliateProgrammes.com (PR5) CasinoLifeMagazine.com (PR4) GamesIndustry.com (PR3) Wikipedia.com The impact of these links on our rankings has been substantial. In the three months since launch, we’re seeing week on week improvements in our rankings for casino brand and review terms. There is direct correlation between some of the links above going live and our organic search traffic improving. Note: I should point out that these interviews were never meant to be pieces of viral content: they were intended as evergreen, linkable assets. They act as powerful, original sources for anybody who might be investigating Dr. Griffiths’ research or the topics covered in our discussion. Additionally, this content provides RightCasino.com with greater authority and credibility as an information hub. Furthermore, Dr. Griffiths has proven an extremely useful contact, having repeatedly shared our content through his social channels, furnished us with original quotes and lent his expertise to co-authored contributions to external sites. Quid quo pro, this arrangement has helped publicise Dr Griffiths’ work and driven fresh traffic to his personal blog. Conclusion I’ll conclude by reviewing the triumphs and downfall of our collaborative outreach project… Pros: We received quality links from strong domains (11 to date). This was our primary goal. Our up-front investment of around £1400 was relatively small. Putting this in context, some link-builders in the gambling industry are paying in excess of £150-£200 per link from inferior domains. We currently host the most comprehensive interview with Dr. Griffiths on the subject of gambling. In terms of a long-term strategy, there is every reason to assume that our content will be used as a source for anyone researching Dr Griffiths or the topics he discussed in the future. We have developed a strong relationship with a powerful figure in our niche. We have already approached Dr Griffiths for original quotes and – yes – thrown him the occasional tweet requesting a share. In turn, our content manager has used Dr. Griffiths as a source in contributions to popular websites, providing him free exposure, further nurturing our relationship. As intended, we have developed a credible, on-site resource that complements our brand ethos. By contrast, some gambling sites focus purely on link-bait for on-site content. For instance, a popular bingo site produced this ‘Selfie’ infographic. Whilst successful and very creative, this content is not necessarily relevant to the company’s product or brand identity. Cons: We have not been able to gain links to our ‘money pages’. However, link juice is still passed on, providing a strong link profile for our new website. Inspired by James Agate’s post, we tried to target several .edu domains with gambling resource sections. We haven’t had much success – tracking down the university webmaster on top of the relevant subject department is always a challenge. Currently, none of our content has received a natural pick-up from a journalist: arguably this is because the interviews are not sufficiently outrageous to curry citation from a news source. While we could have twisted Dr. Griffiths’ words for a shocking angle, we felt it was not worth risking our editorial rapport for a quick win. While we received respectable referral traffic, the bottom line is that users who visit RightCasino.com to view Dr. Griffiths’ interviews are unlikely to sign up and gamble. That being said, there is every reason to expect that interested users will share the interviews within their social circles. TakeawaysIf you’re working in a niche industry where acquiring natural links is difficult, it can definitely be worth investing some time, money and energy in linkable assets on-site. As you can see from our financial breakdown, the initial overheads are quickly justified when you start receiving links from PR8 websites. As ever, creativity is paramount. Tailor your content for crossover appeal and controversy. This means that, when you come to outreach, you will be able to target sources outside of your niche. You’d be surprised at how open industry experts and authority figures are to talking about their specialism. Don’t be intimidated by their reputation – remember, experts will benefit reciprocally from the free exposure. BuzzStream is extremely useful for project management and updating progress with leads. If you’re committing to a sizable content marketing campaign, it can be a real life-saver. In my industry, I need to create my own artillery for other people’s websites – PR commenting and outreach to journalists alone is just too scattershot to provide a reliable approach to link-building. I often need to approach editors with a complete article. Do you agree with me? Perhaps you’ve already collaborated with authority figures in your niche and had more/less success? If anybody in the Moz community has any experiences or tips they’d like to share, I’d love to hear them! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: Using Industry Authorities for Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: Using Industry Authorities for Link Building"
    },
    {
      "level": "H2",
      "text": "The challenge"
    },
    {
      "level": "H2",
      "text": "Step 1: Identify and approach the authority figure"
    },
    {
      "level": "H3",
      "text": "Costs and projected profits"
    },
    {
      "level": "H2",
      "text": "Step 2: Content Creation"
    },
    {
      "level": "H2",
      "text": "Step 3: The Link Building Process"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Pros:"
    },
    {
      "level": "H3",
      "text": "Cons:"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Miranda\n          \n            Sam Miranda"
}