{
  "url": "https://moz.com/blog/case-study-controversial-content-earned-hundreds-links",
  "slug": "case-study-controversial-content-earned-hundreds-links",
  "title": "Case Study: How We Created Controversial Content That Earned Hundreds of Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your safe content isn't getting results, it may be time to go risky. Kelsey Libert shows how you can wield the power of controversy in content marketing — responsibly.",
  "content": "Case Study: How We Created Controversial Content That Earned Hundreds of Links Content Marketing | Link Building By: Kelsey Libert July 28, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert July 28, 2016 Case Study: How We Created Controversial Content That Earned Hundreds of Links Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content marketers, does the following scenario sound familiar? You’re tasked with creating content that attracts publicity, links, and social shares. You come up with great ideas for content that you’re confident could accomplish these goals. However, any ideas that push the envelope or might offend anyone in the slightest get shot down by your boss or client. Even if a provocative idea gets approved, after feedback from higher-ups and several rounds of editing, you end up with a boring, watered-down version of what you originally envisioned. Given the above, you're not surprised when you achieve lackluster results. Repeat this cycle enough times, and it may lead to the false assumption that content marketing doesn’t work for the brand. In this post, I’ll answer two questions: How can I get my boss or clients to sign off on envelope-pushing content that will attract the attention needed to achieve great results? How can we minimize the risk of backlash? Why controversy is so powerful for content marketingTo get big results, content needs to get people talking. Often times, the best way to do this is by creating an emotional reaction in the audience. Content that deals with a controversial or polarizing topic can be a surefire way to accomplish this. On the other hand, when you play it too safe with your content, it becomes extremely difficult to ignite the emotional response needed to drive social sharing. Ultimately, you don't attract the attention needed to earn high-quality links. Below is a peek at the promotions report from a recent controversial campaign that resulted in a lot of high-quality links, among other benefits. Overcoming a client’s aversion to controversyWe understand and respect a client’s fierce dedication to protecting their brand. The thought of attaching their company to anything controversial can set off worst-case-scenario visions of an angry Internet mob and bad press (which isn’t always a terrible thing). One such example of balancing a sensitive topic while minimizing the potential risk is a recent campaign we created for apartment listing site Abodo. Our idea was to use Twitter data to pinpoint which states and cities had the highest concentration of prejudiced and tolerant tweets. Bigotry in America is an extremely sensitive topic, yet our client was open to the idea. Want to get a contentious idea approved by your boss or client? Here’s how we did it. 1. Your idea needs to be relevant to the brand, either directly or tangentially. Controversy for the sake of controversy is not going to provide value to the brand or the target audience. I asked Michael Taus, VP of Growth and Business Development at Abodo, why our campaign idea got the green light. He said Abodo’s mission is to help people find a home, not to influence political discourse. But they also believe that when you're moving to a new community, there's more to the decision than what your house or apartment looks like, including understanding the social and cultural tone of the location. So while the campaign dealt with a hot topic, ultimately this information would be valuable to Abodo’s users. 2. Prove that playing it safe isn’t working. If your “safe” content is struggling to get attention, make the case for taking a risk. Previous campaign topics for our client had been too conservative. We knew by creating something worth talking about, we’d see greater results. 3. Put safeguards in place for minimizing risk to the brand. While we couldn’t guarantee there wouldn’t be a negative response once the campaign launched, we could guarantee that we’d do everything in our power to minimize any potential backlash. We were confident in our ability to protect our client because we’d done it so many times with other campaigns. I’ll walk you through how to do this throughout the rest of the post. On the client’s end, they can get approval from other internal departments; for example, having the legal and PR teams review and give final approval can help mitigate the uncertainty around running a controversial campaign. Did taking a risk pay off? The campaign was a big success, with results including: More than 620 placements (240 dofollow links and 280 co-citation links) Features on high-authority sites including CNET, Slate, Business Insider, AOL, Yahoo, Mic, The Daily Beast, and Adweek More than 67,000 social shares A whole lot of discussion Beyond these metrics, Abodo has seen additional benefits such as partnership opportunities. Since this campaign launched, they were approached by a nonprofit organization to collaborate on a similar type of piece. They hope to repeat their success by leveraging the nonprofit’s substantial audience and PR capabilities. Essential tips for minimizing risk around contentious contentWe find that good journalism practices can greatly reduce the risk of a negative response. Keep the following five things in mind when creating attention-grabbing content. 1. Presenting data vs. taking a stance: Let the data speakRather than presenting an opinion, just present the facts. Our clients are usually fine with controversial topics as long as we don't take a stance on them and instead allow the data we’ve collected to tell the story for us. Facts are facts, and that's all your content needs to offer. If publishers want to put their own spin on the facts you present or audiences see the story the data are telling and want to respond, the conversation can be opened up and generate a lot of engagement. For the Abodo campaign, the data we presented weren’t a direct reflection of our client but rather came from an outside source (Twitter). We packaged the campaign on a landing page on the client’s site, which includes the design assets and an objective summary of the data. The publishers then chose how to cover the data we provided, and the discussion took off from there. For example, Slate called out Louisiana’s unfortunate achievement of having the most derogatory tweets. 2. Present more than one side of the storyHow do you feel when you watch a news report or documentary that only shares one side of the story? It takes away credibility from the reporting, doesn’t it? To keep the campaign topic from being too negative and one-sided, we looked at the most prejudiced and least prejudiced tweets. Including states and cities with the least derogatory tweets added a positive angle to the story. This made the data more objective, which improved the campaign’s credibility. Regional publishers showed off that their state had the nicest tweets. And residents of these places were proud to share the news. Pleased WI was one of the top-10 least nasty places for pejorative tweets! Stay away from Louisiana. https://t.co/ijoAMsmKao— Sam Million-Weaver (@millionweaver) March 9, 2016 If your campaign topic is negative, try to show the positive side of it too. This keeps the content from being a total downer, which is important for social sharing since people usually want to pass along content that will make others feel good. Our recent study on the emotions behind viral content found that even when viral content evokes negative emotions, it’s usually not purely negative; the content also makes the audience feel a positive emotion or surprise. Aside from objective reporting, a huge benefit to telling more than one side of the story is that you’re able to pitch the story for multiple angles, thus maximizing your potential coverage. Because of this, we ended up creating 18 visual assets for this campaign, which is far more than we typically do. 3. Don’t go in with an agendaBe careful of twisting the data to fit your agenda. It's okay to have a thesis when you start, but if your aim is to tell a certain story you’re apt to stick with that storyline regardless of what the data show. If your information is clearly slanted to show the story you want to tell, the audience will catch on, and you'll get called out. Instead of gathering research with an intent of \"I'm setting out to prove XYZ,\" adopt a mindset of \"I wonder what the reality is.\" 4. Be transparent about your methodologyYou don’t want the validity of your data to become a point of contention among publishers and readers. This goes for any data-heavy campaign but especially for controversial data. To combat any doubts around where the information came from or how the data were collected and analyzed, we publish a detailed methodology alongside all of our campaigns. For the Abodo campaign, we created a PDF document of the research methodology which we could easily share with publishers.Include the following in your campaign’s methodology: Where and when you received your data. What kind and how much data you collected. (Our methodology went on to list exactly which terms we searched for on Twitter.) Any exceptions within your collection and analysis, such as omitted information. A list of additional sources. (We only use reputable, new sources ideally published within the last year.) For even more transparency, make your raw data available. This gives publishers a chance to comb through the data to find additional story angles. 5. Don’t feed the trollsThis is true for any content campaign, but it’s especially important to have an error-free campaign when dealing with a sensitive topic since it may be under more scrutiny. Don’t let mistakes in the content become the real controversy. Build multiple phases of editing into your production process to ensure you’re not releasing inaccurate or low-quality content. Keep these processes consistent by creating a set of editorial guidelines that everyone involved can follow. We put our campaigns through fact checking and several rounds of quality assurance. Fact checking should play a complementary role to research and involves verifying accuracy by making sure all data and assertions are true. Every point in the content should have a source that can be verified. Writers should be familiar with best practices for making their work easy to fact-check; this fact-checking guide from Poynter is a good resource. Quality assurance looks at both the textual and design elements of a campaign to ensure a good user experience. Our QA team reviews things like grammar, clarity (Is this text clearly making a point? Is a design element confusing or hard to read?), and layout/organization. Include other share-worthy elementsAlthough the controversial subject matter helped this campaign gain attention, we also incorporated other proven elements of highly shareable content: Geographic angle. People wanted to see how their state or city ranked. Many took to social media to express their disappointment or pride in the results. Timeliness. Bigotry is a hot-button issue in the U.S. right now amidst racial tension and a heated political situation. Comparison. Rankings and comparisons stimulate discussion, especially when people have strong opinions about the rankings. Surprising. The results were somewhat shocking since some cities and states which ranked “most PC” or “most prejudiced” were unexpected. The more share-worthy elements you can tack onto your content, the greater your chances for success. Have you seen success with controversial or polarizing content? Did you overcome a client’s objection to controversy? Be sure to share your experience in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: How We Created Controversial Content That Earned Hundreds of Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: How We Created Controversial Content That Earned Hundreds of Links"
    },
    {
      "level": "H2",
      "text": "Why controversy is so powerful for content marketing"
    },
    {
      "level": "H2",
      "text": "Overcoming a client’s aversion to controversy"
    },
    {
      "level": "H4",
      "text": "1. Your idea needs to be relevant to the brand, either directly or tangentially."
    },
    {
      "level": "H4",
      "text": "2. Prove that playing it safe isn’t working."
    },
    {
      "level": "H4",
      "text": "3. Put safeguards in place for minimizing risk to the brand."
    },
    {
      "level": "H3",
      "text": "Did taking a risk pay off?"
    },
    {
      "level": "H2",
      "text": "Essential tips for minimizing risk around contentious content"
    },
    {
      "level": "H3",
      "text": "1. Presenting data vs. taking a stance: Let the data speak"
    },
    {
      "level": "H3",
      "text": "2. Present more than one side of the story"
    },
    {
      "level": "H3",
      "text": "3. Don’t go in with an agenda"
    },
    {
      "level": "H3",
      "text": "4. Be transparent about your methodology"
    },
    {
      "level": "H3",
      "text": "5. Don’t feed the trolls"
    },
    {
      "level": "H3",
      "text": "Include other share-worthy elements"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}