{
  "url": "https://moz.com/blog/case-study-part-2-how-to-beat-google-again-for-viagra-14008",
  "slug": "case-study-part-2-how-to-beat-google-again-for-viagra-14008",
  "title": "Case Study Part 2 - How To Beat Google Again For Viagra - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I wrote a YouMoz Post two years ago titled \"Case Study - How To Beat Google and Rank #2 for Viagra\" and have been meaning to write a follow-up to that post. After doing some research online, I found another fantastic example of how to continue to beat Google...",
  "content": "Case Study Part 2 - How To Beat Google Again For Viagra Blogging S By: Stu Price September 19, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Stu Price September 19, 2011 Case Study Part 2 - How To Beat Google Again For Viagra Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I wrote a YouMoz Post two years ago titled \"Case Study - How To Beat Google and Rank #2 for Viagra\" and have been meaning to write a follow-up to that post. After doing some research online, I found another fantastic example of how to continue to beat Google and keep Ranking for Viagra. So I began my searches with a couple of keyword variations, such as this http://bit.ly/gxknL0 and noticed one site in particular kept popping up - onlinepharmacycr DOT com. It looks like you can purchase anything from Viagra to Paxil here...Not to mention that it's illegal to sell these medications online since they are in the generic form. Which means, they are not FDA-approved and could have ingredients that can cause harm to people taking it. This comes at a time when Google just paid out 500 million for allowing illegal online Canadian pharmacies to advertise drugs to U.S. consumers. I tend to follow the space a bit, as I always want to keep up with the latest shades of tactics. Sites do come and go and usually Google does a good job at keeping the spam out. This site in particular has begun to stick (seems to have been there for 1-YR+), so I wondered what made them stick and will they last? I do the basic \"backlink check\" in Open Site Explorer and notice they have about 3,500 links....Pretty good for a Viagra site :-) First few websites I looked at seemed a bit \"paid\" like here, here and here, but it's a little hard to prove that as a competitor could put that there. How about we try something different: Let's look and see if they have \"Google Analytics\" and maybe their other GA accounts are tied in with each other: Here is the Google Analytics account by using Spy on Web As you can see they have 40 Domains tied to the one account Let's look into some of the Domains they own/control the Google Analytics for: 1) Itcorp.com – Looks like a company that sells \"Imaging Technology\". So, I went ahead and called the phone number listed on the website to see if they still exist and to let them know that they are now promoting – Cuban cigars, poker, valium and Viagra. When I called the phone number a gentleman (lawyer from Boulder, CO) picked up who just took over the phone number a few months ago and has no affiliation with the company. 2) Greece-hotels-tours.com - Looks like it might have been an old company that promoted tours of Greece and has now turned into a walking Ad for – Cuban cigars, cheap Viagra, and a play poker billboard. 3) ldams.org – Which is a site for Learning Disabilities Association of Mississippi. I did go to the home page of Learning Disabilities Association of America and it does link to Idams.org, as the Association of Mississippi. From what I can tell, Idams.org is the legitimate association of Learning Disabilities of America, but the chapter closed down. I was able to find a phone number for them and tried to call and the number has been disconnected. So they are using a closed down learning disabilities chapter to push Cuban cigars, Xanax and Viagra....Pretty low! 4) Madridforcongress.com – Looks like a website that once belonged to Patricia Madrid who was running for congress in New Mexico. I did try to contact the phone numbers on the website and they were both out of service. Take a look at the links they have and you will get a good laugh! 5) Tortureawareness.org – It’s a site about \"Torture Awareness\" and did exist back in '06 according to Wayback Machine. It’s now chock-full of cigars and Viagra links.... Overall Summary on how to rank high in Google: It seems all you have to do is buy out a lot of websites that DID exist back in the day and put lots of content/footer links with the exact anchor text. If you don't have a conscience you can take over Political, Non-Profit and Association Websites like these guys did and promote your products. Hope you enjoyed the case –study! Comments welcomed.... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study Part 2 - How To Beat Google Again For Viagra"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study Part 2 - How To Beat Google Again For Viagra"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stu Price\n          \n            Stu Price\n          \n            Stu Price"
}