{
  "url": "https://moz.com/blog/case-study-media-company-grew-400-using-seo-acquired",
  "slug": "case-study-media-company-grew-400-using-seo-acquired",
  "title": "Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bottom line: quality content based on strategic keyword research that satisfies searcher intent and aligns back to business goals is essential to growth.",
  "content": "Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired Advanced SEO | Marketing Industry By: Gaetano DiNardi August 8, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gaetano DiNardi August 8, 2019 Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired Advanced SEO | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Disclaimer: I’m currently the Director of Demand Generation at Nextiva, and writing this case study post-mortem as the former VP of Marketing at Sales Hacker (Jan. 2017 - Sept. 2018). Every B2B company is investing in content marketing right now. Why? Because they all want the same thing: Search traffic that leads to website conversions, which leads to money. But here’s the challenge: Companies are struggling to get traction because competition has reached an all-time high. Keyword difficulty (and CPC) has skyrocketed in most verticals. In my current space, Unified Communication as a Service (UCaaS), some of the CPCs have nearly doubled since 2017, with many keywords hovering close to $300 per click. Not to mention, organic CTRs are declining, and zero-click queries are rising. Bottom line: If you’re not creating 10x quality content based on strategic keyword research that satisfies searcher intent and aligns back to business goals, you’re completely wasting your time. So, that’s exactly what we did. The outcome? We grew from 19k monthly organic sessions to over 100k monthly organic sessions in approximately 14 months, leading to an acquisition by Outreach.io We validated our hard work by measuring organic growth (traffic and keywords) against our email list growth and revenue, which correlated positively, as we expected. Organic Growth Highlights January 2017–June 2018 As soon as I was hired at Sales Hacker as Director of Marketing, I began making SEO improvements from day one. While I didn’t waste any time, you’ll also notice that there was no silver bullet. This was the result of daily blocking and tackling. Pure execution and no growth hacks or gimmicks. However, I firmly believe that the homepage redesign (in July 2017) was a tremendous enabler of growth. Organic Growth to Present Day I officially left Sales Hacker in August of 2018, when the company was acquired by Outreach.io. However, I thought it would be interesting to see the lasting impact of my work by sharing a present-day screenshot of the organic traffic trend, via Google Analytics. There appears to be a dip immediately following my departure, however, it looks like my predecessor, Colin Campbell, has picked up the slack and got the train back on the rails. Well done! Unique considerations — Some context behind Sales Hacker’s growth Before I dive into our findings, here's a little context behind Sales Hacker's growth: Sales Hacker’s blog is 100 percent community-generated — This means we didn’t pay “content marketers” to write for us. Sales Hacker is a publishing hub led by B2B sales, marketing, and customer success contributors. This can be a blessing and a curse at the same time — on one hand, the site gets loads of amazing free content. On the other hand, the posts are not even close to being optimized upon receiving the first draft. That means, the editorial process is intense and laborious. Aggressive publishing cadence (4–5x per week) — Sales Hacker built an incredible reputation in the B2B Sales Tech niche — we became known as the go-to destination for unbiased thought leadership for practitioners in the space (think of Sales Hacker as the sales equivalent to Growth Hackers). Due to high demand and popularity, we had more content available than we could handle. While it’s a good problem to have, we realized we needed to keep shipping content in order to avoid a content pipeline blockage and a backlog of unhappy contributors. We had to “reverse engineer” SEO — In short, we got free community-generated and sponsored content from top sales and marketing leaders at SaaS companies like Intercom, HubSpot, Pipedrive, LinkedIn, Adobe and many others, but none of it was strategically built for SEO out of the box. We also had contributors like John Barrows, Richard Harris, Lauren Bailey, Tito Bohrt, and Trish Bertuzzi giving us a treasure trove of amazing content to work with. However, we had to collaborate with each contributor from beginning to end and guide them through the entire process. Topical ideation (based on what they were qualified to write about), keyword research, content structure, content type, etc. So, the real secret sauce was in our editorial process. Shout out to my teammate Alina Benny for learning and inheriting my SEO process after we hired her to run content marketing. She crushed it for us!Almost all content was evergreen and highly tactical — I made it a rule that we’d never agree to publish fluffy pieces, whether it was sponsored or not. Plain and simple. Because we didn’t allow “content marketers” to publish with us, our content had a positive reputation, since it was coming from highly respected practitioners. We focused on evergreen content strategies in order to fuel our organic growth. Salespeople don’t want fluff. They want actionable and tactical advice they can implement immediately. I firmly believe that achieving audience satisfaction with our content was a major factor in our SEO success. Outranking the “big guys” — If you look at the highest-ranking sales content, it’s the usual suspects. HubSpot, Salesforce, Forbes, Inc, and many other sites that were far more powerful than Sales Hacker. But it didn’t matter as much as traditional SEO wisdom tells us, largely due to the fact that we had authenticity and rawness to our content. We realized most sales practitioners would rather read insights from their peers in their community, above the traditional “Ultimate Guides,” which tended to be a tad dry. We did VERY little manual link building — Our link building was literally an email from me, or our CEO, to a site we had a great relationship with. “Yo, can we get a link?” It was that simple. We never did large-scale outreach to build links. We were a very lean, remote digital marketing team, and therefore lacked the bandwidth to allocate resources to link building. However, we knew that we would acquire links naturally due to the popularity of our brand and the highly tactical nature of our content. Our social media and brand firepower helped us to naturally acquire links — It helps A LOT when you have a popular brand on social media and a well-known CEO who authored an essential book called “Hacking Sales”. Most of Sales Hacker’s articles would get widely circulated by over 50+ SaaS partners which would help drive natural links.Updating stale content was the lowest hanging fruit — The biggest chunk of our new-found organic traffic came from updating / refreshing old posts. We have specific examples of this coming up later in the post.Email list growth was the “north star” metric — Because Sales Hacker is not a SaaS company, and the “product” is the audience, there was no need for aggressive website CTAs like “book a demo.” Instead, we built a very relationship heavy, referral-based sales cadence that was supported by marketing automation, so list growth was the metric to pay attention to. This was also a key component to positioning Sales Hacker for acquisition. Here's how the email growth progression was trending. So, now that I’ve set the stage, let’s dive into exactly how I built this SEO strategy. Bonus: You can also watch the interview I had with Dan Shure on the Evolving SEO Podcast, where I breakdown this strategy in great detail. 1) Audience research Imagine you are the new head of marketing for a well-known startup brand. You are tasked with tackling growth and need to show fast results — where do you start? That’s the exact position I was in. There were a million things I could have done, but I decided to start by surveying and interviewing our audience and customers. Because Sales Hacker is a business built on content, I knew this was the right choice. I also knew that I would be able to stand out in an unglamorous industry by talking to customers about their content interests. Think about it: B2B tech sales is all about numbers and selling stuff. Very few brands are really taking the time to learn about the types of content their audiences would like to consume. When I was asking people if I could talk to them about their media and content interests, their response was: “So, wait, you’re actually not trying to sell me something? Sure! Let’s talk!” Here’s what I set out to learn: Goal 1 — Find one major brand messaging insight.Goal 2 — Find one major audience development insight.Goal 3 — Find one major content strategy insight.Goal 4 — Find one major UX / website navigation insight.Goal 5 — Find one major email marketing insight. In short, I accomplished all of these learning goals and implemented changes based on what the audience told me. If you’re curious, you can check out my entire UX research process for yourself, but here are some of the key learnings: Based on these outcomes, I was able to determine the following: Topical “buckets” to focus on — Based on the most common daily tasks, the data told us to build content on sales prospecting, building partnerships and referral programs, outbound sales, sales management, sales leadership, sales training, and sales ops. Thought leadership — 62 percent of site visitors said they kept coming back purely due to thought leadership content, so we had to double down on that. Content Types — Step by step guides, checklists, and templates were highly desired. This told me that fluffy BS content had to be ruthlessly eliminated at all costs. Sales Hacker Podcast — 76 percent of respondents said they would listen to the Sales Hacker Podcast (if it existed), so we had to launch it! 2) SEO site audit — Key findings I can’t fully break down how to do an SEO site audit step by step in this post (because it would be way too much information), but I will share the key findings and takeaways from our own Site Audit that led to some major improvements in our website performance. Lack of referring domain growth Sales Hacker was not able to acquire referring domains at the same rate as competitors. I knew this wasn’t because of a link building acquisition problem, but due to a content quality problem. Lack of organic keyword growth Sales Hacker had been publishing blog content for years (before I joined) and there wasn’t much to show for it from an organic traffic standpoint. However, I do feel the brand experienced a remarkable social media uplift by building content that was helpful and engaging. Sales Hacker did happen to get lucky and rank for some non-branded keywords by accident, but the amount of content published versus the amount of traffic they were getting wasn’t making sense. To me, this immediately screamed that there was an issue with on-page optimization and keyword targeting. It wasn’t anyone's fault - this was largely due to a startup founder thinking about building a community first, and then bringing SEO into the picture later. At the end of the day, Sales Hacker was only ranking for 6k keywords at an estimated organic traffic cost of $8.9k — which is nothing. By the time Sales Hacker got acquired, the site had an organic traffic cost of $122k. Non-optimized URLs This is common among startups that are just looking to get content out. This is just one example, but truth be told, there was a whole mess of non-descriptive URLs that had to get cleaned up. Poor internal linking structure The internal linking concentration was poorly distributed. Most of the equity was pointing to some of the lowest value pages on the site. Poor taxonomy, site structure, and navigation I created a mind-map of how I envisioned the new site structure and internal linking scheme. I wanted all the content pages to be organized into categories and subcategories. My goals with the new proposed taxonomy would accomplish the following: Increase engagement from natural site visitor explorationAllow users to navigate to the most important content on the siteImprove landing page visibility from an increase in relevant internal links pointing to them. Topical directories and category pages eliminated with redirects Topical landing pages used to exist on SalesHacker.com, but they were eliminated with 301 redirects and disallowed in robots.txt. I didn’t agree with this configuration. Example: /social-selling/ Trailing slash vs. non-trailing slash duplicate content with canonical errors Multiple pages for the same exact intent. Failing to specify the canonical version. Branded search problems — “Sales Hacker Webinar” Some of the site’s most important content is not discoverable from search due to technical problems. For example, a search for “Sales Hacker Webinar” returns irrelevant results in Google because there isn’t an optimized indexable hub page for webinar content. It doesn’t get that much search volume (0–10 monthly volume according to Keyword Explorer), but still, that’s 10 potential customers you are pissing off every month by not fixing this. 3) Homepage — Before and after Sooooo, this beauty right here (screenshot below) was the homepage I inherited in early 2017 when I took over the site. Fast forward six months later, and this was the new homepage we built after doing audience and customer research… New homepage goals Tell people EXACTLY what Sales Hacker is and what we do. Make it stupidly simple to sign up for the email list. Allow visitors to easily and quickly find the content they want.Add social proof. Improve internal linking. I’m proud to say, that it all went according to plan. I’m also proud to say that as a result, organic traffic skyrocketed shortly after. Special Note: Major shout out to Joshua Giardino, the lead developer who worked with me on the homepage redesign. Josh is one of my closest friends and my marketing mentor. I would not be writing this case study today without him! There wasn’t one super measurable thing we isolated in order to prove this. We just knew intuitively that there was a positive correlation with organic traffic growth, and figured it was due to the internal linking improvements and increased average session duration from improving the UX. 4) Updating and optimizing existing content Special note: We enforced “Ditch the Pitch” Before I get into the nitty-gritty SEO stuff, I’ll tell you right now that one of the most important things we did was blockade contributors and sponsors from linking to product pages and injecting screenshots of product features into blog articles, webinars, etc. Side note: One thing we also had to do was add a nofollow attribute to all outbound links within sponsored content that sent referral traffic back to partner websites (which is no longer applicable due to the acquisition). The #1 complaint we discovered in our audience research was that people were getting irritated with content that was “too salesy” or “too pitchy” — and rightfully so, because who wants to get pitched at all day? So we made it all about value. Pure education. School of hard knocks style insights. Actionable and tactical. No fluff. No nonsense. To the point. And that’s where things really started to take off. Before and after: “Best sales books” What you are about to see is classic SEO on-page optimization at its finest. This is what the post originally looked like (and it didn’t rank well for “best sales books). And then after… And the result… Before and after: “Sales operations” What we noticed here was a crappy article attempting to explain the role of sales operations. Here are the steps we took to rank #1 for “Sales Operations:” Built a super optimized mega guide on the topic. Since the old crappy article had some decent links, we figured let’s 301 redirect it to the new mega guide. Promote it on social, email and normal channels. Here’s what the new guide on Sales Ops looks like… And the result… 5) New content opportunities One thing I quickly realized Sales Hacker had to its advantage was topical authority. Exploiting this was going to be our secret weapon, and boy, did we do it well: “Cold calling” We knew we could win this SERP by creating content that was super actionable and tactical with examples. Most of the competing articles in the SERP were definition style and theory-based, or low-value roundups from domains with high authority. In this case, DA doesn’t really matter. The better man wins. “Best sales tools” Because Sales Hacker is an aggregator website, we had the advantage of easily out-ranking vendor websites for best and top queries. Of course, it also helps when you build a super helpful mega list of tools. We included over 150+ options to choose from in the list. Whereas SERP competitors did not even come close. “Channel sales” Notice how Sales Hacker’s article is from 2017 still beats HubSpot’s 2019 version. Why? Because we probably satisfied user intent better than them. For this query, we figured out that users really want to know about Direct Sales vs Channel Sales, and how they intersect. HubSpot went for the generic, “factory style” Ultimate Guide tactic. Don’t get me wrong, it works very well for them (especially with their 91 DA), but here is another example where nailing the user intent wins. “Sales excel templates” This was pure lead gen gold for us. Everyone loves templates, especially sales excel templates. The SERP was easily winnable because the competition was so BORING in their copy. Not only did we build a better content experience, but we used numbers, lists, and power words that salespeople like to see, such as FAST and Pipeline Growth. Special note: We never used long intros The one trend you’ll notice is that all of our content gets RIGHT TO THE POINT. This is inherently obvious, but we also uncovered it during audience surveying. Salespeople don’t have time for fluff. They need to cut to the chase ASAP, get what they came for, and get back to selling. It’s really that straightforward. When you figure out something THAT important to your audience, (like keeping intros short and sweet), and then you continuously leverage it to your advantage, it’s really powerful. 6) Featured Snippets Featured snippets became a huge part of our quest for SERP dominance. Even for SERPs where organic clicks have reduced, we didn’t mind as much because we knew we were getting the snippet and free brand exposure. Here are some of the best-featured snippets we got! Featured snippet: “Channel sales” Featured snippet: “Sales pipeline management” Featured snippet: “BANT” Featured snippet: “Customer success manager” Featured snippet: “How to manage a sales team” Featured snippet: “How to get past the gatekeeper” Featured snippet: “Sales forecast modeling” Featured snippet: “How to build a sales pipeline” 7) So, why did Sales Hacker get acquired? At first, it seems weird. Why would a SaaS company buy a blog? It really comes down to one thing — community (and the leverage you get with it). Two learnings from this acquisition are: 1. It may be worth acquiring a niche media brand in your space 2. It may be worth starting your own niche media brand in your space I feel like most B2B companies (not all, but most) come across as only trying to sell a product — because most of them are. You don’t see the majority of B2B brands doing a good job on social. They don’t know how to market to emotion. They completely ignore top-funnel in many cases and, as a result, get minimal engagement with their content. There’s really so many areas of opportunity to exploit in B2B marketing if you know how to leverage that human emotion — it’s easy to stand out if you have a soul. Sales Hacker became that “soul” for Outreach — that voice and community. But one final reason why a SaaS company would buy a media brand is to get the edge over a rival competitor. Especially in a niche where two giants are battling over the top spot. In this case, it’s Outreach’s good old arch-nemesis, Salesloft. You see, both Outreach and Salesloft are fighting tooth and nail to win a new category called “Sales Engagement”. As part of the acquisition process, I prepared a deck that highlighted how beneficial it would be for Outreach to acquire Sales Hacker, purely based on the traffic advantage it would give them over Salesloft. Sales Hacker vs. Salesloft vs Outreach — Total organic keywords This chart from 2018 (data exported via SEMrush), displays that Sales Hacker is ranking for more total organic keywords than Salesloft and Outreach combined. Sales Hacker vs. Salesloft vs Outreach — Estimated traffic cost This chart from 2018 (data exported via SEMrush), displays the cost of the organic traffic compared by domain. Sales Hacker ranks for more commercial terms due to having the highest traffic cost. Sales Hacker vs. Salesloft vs Outreach — Rank zone distributions This chart from 2018 (data exported via SEMrush), displays the rank zone distribution by domain. Sales Hacker ranked for more organic keywords across all search positions. Sales Hacker vs. Salesloft vs Outreach — Support vs. demand keywords This chart from 2018 (data exported via SEMrush), displays support vs demand keywords by domain. Because Sales Hacker did not have a support portal, all its keywords were inherently demand focused. Meanwhile, Outreach was mostly ranking for support keywords at the time. Compared to Salesloft, they were at a massive disadvantage. Conclusion I wouldn’t be writing this right now without the help, support, and trust that I got from so many people along the way. Joshua Giardino — Lead developer at Sales Hacker, my marketing mentor and older brother I never had. Couldn’t have done this without you! Max Altschuler — Founder of Sales Hacker, and the man who gave me a shot at the big leagues. You built an incredible platform and I am eternally grateful to have been a part of it. Scott Barker — Head of Partnerships at Sales Hacker. Thanks for being in the trenches with me! It’s a pleasure to look back on this wild ride, and wonder how we pulled this off. Alina Benny — My marketing protege. Super proud of your growth! You came into Sales Hacker with no fear and seized the opportunity. Mike King — Founder of iPullRank, and the man who gave me my very first shot in SEO. Thanks for taking a chance on an unproven kid from the Bronx who was always late to work. Yaniv Masjedi — Our phenomenal CMO at Nextiva. Thank you for always believing in me and encouraging me to flex my thought leadership muscle. Your support has enabled me to truly become a high-impact growth marketer. Thanks for reading — tell me what you think below in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired"
    },
    {
      "level": "H2",
      "text": "Organic Growth Highlights"
    },
    {
      "level": "H3",
      "text": "January 2017–June 2018"
    },
    {
      "level": "H2",
      "text": "Organic Growth to Present Day"
    },
    {
      "level": "H2",
      "text": "Unique considerations — Some context behind Sales Hacker’s growth"
    },
    {
      "level": "H2",
      "text": "1) Audience research"
    },
    {
      "level": "H2",
      "text": "2) SEO site audit — Key findings"
    },
    {
      "level": "H3",
      "text": "Lack of referring domain growth"
    },
    {
      "level": "H2",
      "text": "Lack of organic keyword growth"
    },
    {
      "level": "H3",
      "text": "Non-optimized URLs"
    },
    {
      "level": "H3",
      "text": "Poor internal linking structure"
    },
    {
      "level": "H3",
      "text": "Poor taxonomy, site structure, and navigation"
    },
    {
      "level": "H3",
      "text": "Topical directories and category pages eliminated with redirects"
    },
    {
      "level": "H3",
      "text": "Trailing slash vs. non-trailing slash duplicate content with canonical errors"
    },
    {
      "level": "H3",
      "text": "Branded search problems — “Sales Hacker Webinar”"
    },
    {
      "level": "H3",
      "text": "3) Homepage — Before and after"
    },
    {
      "level": "H3",
      "text": "New homepage goals"
    },
    {
      "level": "H2",
      "text": "4) Updating and optimizing existing content"
    },
    {
      "level": "H3",
      "text": "Special note: We enforced “Ditch the Pitch”"
    },
    {
      "level": "H2",
      "text": "Before and after: “Best sales books”"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "5) New content opportunities"
    },
    {
      "level": "H3",
      "text": "“Cold calling”"
    },
    {
      "level": "H3",
      "text": "“Best sales tools”"
    },
    {
      "level": "H3",
      "text": "“Channel sales”"
    },
    {
      "level": "H3",
      "text": "“Sales excel templates”"
    },
    {
      "level": "H3",
      "text": "Special note: We never used long intros"
    },
    {
      "level": "H2",
      "text": "6) Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “Channel sales”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “Sales pipeline management”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “BANT”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “Customer success manager”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “How to manage a sales team”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “How to get past the gatekeeper”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “Sales forecast modeling”"
    },
    {
      "level": "H3",
      "text": "Featured snippet: “How to build a sales pipeline”"
    },
    {
      "level": "H2",
      "text": "7) So, why did Sales Hacker get acquired?"
    },
    {
      "level": "H3",
      "text": "Two learnings from this acquisition are:"
    },
    {
      "level": "H3",
      "text": "Sales Hacker vs. Salesloft vs Outreach — Total organic keywords"
    },
    {
      "level": "H3",
      "text": "Sales Hacker vs. Salesloft vs Outreach — Estimated traffic cost"
    },
    {
      "level": "H3",
      "text": "Sales Hacker vs. Salesloft vs Outreach — Rank zone distributions"
    },
    {
      "level": "H3",
      "text": "Sales Hacker vs. Salesloft vs Outreach — Support vs. demand keywords"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gaetano DiNardi\n          \n            Gaetano DiNardi"
}