{
  "url": "https://moz.com/blog/case-study-why-it-makes-sense-to-optimize-your-site-for-near-me-searches",
  "slug": "case-study-why-it-makes-sense-to-optimize-your-site-for-near-me-searches",
  "title": "Case Study: Why it Makes Sense to Optimize Your Site for ‘Near Me’ Searches - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you updated your website's content to take advantage of ‘near me’ searches? Case Study: Why it Makes Sense to Optimize Your Site for  Searches",
  "content": "Case Study: Why it Makes Sense to Optimize Your Site for ‘Near Me’ Searches Advanced SEO | Search Engines | Mobile SEO By: Colleen Harris August 26, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Colleen Harris August 26, 2016 Case Study: Why it Makes Sense to Optimize Your Site for ‘Near Me’ Searches Advanced SEO | Search Engines | Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. May 2015 was full of big change in the search world. First, Google announced that, “More Google searches take place on mobile devices than on computers in 10 countries, including the US and Japan.” Then Google followed that up with the news that, “Search interest in ‘near me’ has doubled since last year with 80% of those searches occurring on mobile devices.” In response to these trends, Google updated the local extensions for AdWords, allowing businesses to bid on keywords that deal with “near me” searches. These announcements led us to ask a question: Can content that includes “near me” terms help gain impressions and clicks for those queries in organic search?Our methods to study this question were simple:We tested 82 websites (41 as the control group; 41 as the test group) Within the test group, we updated the hour and directions page title, description, and H1 to utilize the phrases 'franchise dealer near me' and 'nearest franchise dealer.' These franchises included a wide range of auto manufacturers, with the physical locations dispersed throughout the United States. We then spent five months looking at mobile impressions and click-through rates for both groups Noteworthy changes after testing After five months, we started to see a few trends across these websites, including an increase in mobile impressions and clicks for all the “near me” searches. In the test group’s first month, we saw a 27% increase in mobile impressions for “near me” phrases, and the clicks increased from 11 to 40. By comparison, the control group had just a 20% increase in mobile impressions, and click-throughs only increased from 13 to 23.These trends continued every month we looked at the data. In month three, the test group’s “near me” impressions rose another 15%, compared to the 8% increase of the control group’s impressions. Similarly, the click-through rate for the test group almost doubled that of the control group, with 37 and 19 clicks, respectively. By the last month, the test group’s websites saw their mobile impressions for “near me” more than double since the start to total 8,833 impressions and 46 clicks. This is in contrast to the control group, whose “near me” impression share only rose 11% since the start and had just 21 clicks. There were a few other observations we made in our research: Locations in urban and metro areas saw more impressions and clicks compared to rural locations 'Near me' impressions grew from franchises-related searches to include broader phrases, including 'nearest oil change' What this tells usOverall, our results started to give us the answer that, yes, updating your website and content for the appropriate “near me” phrases can have a positive impact on the impressions and clicks for those phrases. This is just the start for a small business website, as mobile search and search intent will only continue to become more important. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: Why it Makes Sense to Optimize Your Site for ‘Near Me’ Searches"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: Why it Makes Sense to Optimize Your Site for ‘Near Me’ Searches"
    },
    {
      "level": "H2",
      "text": "Noteworthy changes after testing"
    },
    {
      "level": "H2",
      "text": "What this tells us"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Colleen Harris\n          \n            Colleen Harris\n          \n            Colleen Harris"
}