{
  "url": "https://moz.com/blog/case-study-payday-loan-penalty-and-the-road-to-recovery",
  "slug": "case-study-payday-loan-penalty-and-the-road-to-recovery",
  "title": "[Case Study] Payday Loan Penalty And The Road To Recovery - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On July 3rd, Peachy.co.uk was penalized by the payday loan update, which resulted in a 81% loss in organic traffic. This blog explains how, within three weeks, we were able to lift the penalty and recover organic traffic.",
  "content": "[Case Study] Payday Loan Penalty And The Road To Recovery Advanced SEO By: Steven Macdonald September 25, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Steven Macdonald September 25, 2013 [Case Study] Payday Loan Penalty And The Road To Recovery Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Synopsis On July 3rd, Peachy.co.uk was penalized by the payday loan update, which resulted in a 81% loss in organic traffic. This blog explains how, within three weeks, we were able to lift the penalty and recover organic traffic. Background On May 22nd, Penguin 2.0 was rolled out. Considering the impact of Penguin 1.0, Penguin 2.0 made a lot less noise. However, three weeks later Matt Cutts announced that payday loan and porn sites were being targeted by Google and over the next 1-2 months the update would roll out. Impact Peachy organic traffic was between 8,000 to 10,000 visits per week when the update hit. The impact was immediate and the following week resulted in only 2,000 organic visits. Here is the impressions chart from Google Webmaster Tools Here is the organic traffic chart from Google Analytics What you will notice about both of these charts is the peaks. Peachy received an unnatural links warning email at the beginning of June. Links were removed using the disavow tool and traffic resumed. Shortly after, we were issued a search quality guidelines email, and then on July 3rd, we were hit by the payday loan update – three penalties in 15 days. Reasons for the penalty Prior to June, Peachy had never been penalized by Google. After we were hit by the first penalty, branded terms were pushed back to pages five and six in Google. Branded terms account for 50-60% of organic traffic and approximately 30% of income. We knew why we were penalized. Peachy were involved in every tactic possible in an attempt to manipulate search engines, which included the following: Website directories Article marketing Paid links Thin content Keyword stuffing Duplicate content With techniques like these, it was only a matter of time before we were hit. We were also guilty of having broken links and missing Metadata on the site. Getting started On 25th July, Peachy CEO, Kristjan Novitski shared a message on LinkedIn asking if anyone could help Peachy with their SEO problems. I met Kristjan more than a year ago so sent him a message with some ideas based on a brief visit to the site. By the 2nd August, I had met the Marketing Director and we agreed that I would perform an SEO audit. Normally, an audit would a week or two to perform. Given that Peachy was ready to launch a TV campaign in the UK on 15th August, we needed to perform an SEO audit, implement the findings, and then submit a reconsideration request to Google, while fully aware that they usually take at least five days to respond. This gave us exactly eight days (which included two weekends!). Key focus areas Given the fact that we were short on time, we focused on three key areas that we needed to address before we submitted a reconsideration request: 1. Links We had a lot of low quality links pointing towards the site that needed to be analyzed. 2. Content Poorly written and thin content meant we needed to review the entire website. 3. Usability We had a poor user experience and the site was built for search engines, not humans. Removing low quality links Our first task was the look at the links pointing to the Peachy website. Using the Google Webmaster Tools ‘Links to your site’ report, we exported the list into excel. This allowed us to analyze each link – which we ran through Open Site Explorer – to identify the quality and relevance of the link. Google Webmaster Tools reported 188 linking domains. We ran each domain through OSE and analyzed each link. The links overview in Excel included: Domain authority PageRank Inbound links Linked pages Links removed manually Blocked via disavow tool Link still active Taking this approach allowed us to understand which links we wanted to keep and links that needed removing, whether through contacting webmasters through email or using the disavow tool. Here’s a screenshot of the link profile overview We needed to be strict when it came to links. We drew a line in the sand, and anything less than a good/ relevant link was removed. Contacting webmasters was difficult – they were either unresponsive, or asked for payment! In the end, we used the disavow tool to remove approximately 60% of total linking domains. Creating high quality and engaging content Peachy launched a blog earlier in the year. The blog posts were short, and stuffed with keywords. As a payday loan site, the content they shared on social networks talked about Google Analytics and video editing and content on their website was created with only one thing in mind – search engines. We had to start at the beginning, which meant a lot of content was archived/ redirected an almost all of the content on the site was rewritten (luckily the site only has 28 pages). We made sure that content shared was on topic to lending/ finance and that each webpage had a unique title tag and Meta description that wasn’t focused on keywords such as payday loans, or short-term loans. The blog posts were previously published by the author “Peachy loans”, but it now has real people behind it and is connected to their Google+ profiles. Before After We’ve also set up a content strategy for the next 3-6 months that focuses on education. There’s a lack of education in the short-term lending industry, and we want to help you manage your finances as best as you can. Improving the user experience Focusing on the user experience was key. We shifted our focus to humans, not search engines and browsed the website to pick out areas we could improve. This included fixing broken images and broken links and redirecting the user to a relevant page. We also noticed that our mobile site was being indexed by Google. A desktop user clicking on a mobile search result won't deliver a great user experience so we implemented rel=canonical on the mobile page so that a desktop user would only find our desktop website. Peachy is a certified lender in the UK and included logos of organizations in the footer of the website. We used to link out to the home page of these websites, but a better way to gain trust from the user is to link to our profile page on these websites. Reconsideration request We got things done and within 8 days, we were ready to create the reconsideration request. 5 hours, 1,000 words and three drafts later, we had our final copy ready. The reconsideration request included the following: Who we are What the company does Accepting why we were penalized What we have done to improve the website Google docs spreadsheet – link analysis Google docs spreadsheet – disavowed links Asking for the penalty to be removed Signing off as a real person Here’s a link to the Google docs spreadsheet \"Google docs spreadsheet – Link analysis\" that was shared in the reconsideration request. https://docs.google.com/a/kingspoint.no/spreadsheet/ccc?key=0AppQeg1xe574dFhhSXFDYjNWeEI1ODNQOFpDRGhuOWc#gid=0 The results On August 15th, we submitted the reconsideration request and within five days, Peachy received an email from Google that the penalty had been lifted. Branded terms are now ranking in the top position of Google and organic visits have started to increase. Here’s is the organic search report between the drop in traffic and recovery Conclusion If you use techniques that are against Google’s guidelines, you will eventually get caught and your website will lose traffic and sales. The steps above are what worked for us but may not work on your website. If your website has been penalized, make sure you are strict and remove all low quality links and remove search engines from the equation. Instead, focus on a great user experience – it’s what Google recommends. From start to finish, it took us 18 days to audit the site, fix the problems, submit the reconsideration request and have the penalty lifted. And it took a lot of commitment, prioritization and implementing like hell. It was a great team effort and with a content strategy in place, we can look forward to not having to worry about a Google penalty again. Disclaimer: I am not an advocate of payday loans or short term lending. I was hired to help Peachy remove the manual penalty and did not partake in any techniques that go against Google’s search guidelines. Have you recovered from a manual penalty? What steps did you take to ensure the penalty was lifted? Feel free to like, share or comment below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "[Case Study] Payday Loan Penalty And The Road To Recovery"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "[Case Study] Payday Loan Penalty And The Road To Recovery"
    },
    {
      "level": "H2",
      "text": "Synopsis"
    },
    {
      "level": "H2",
      "text": "Background"
    },
    {
      "level": "H2",
      "text": "Impact"
    },
    {
      "level": "H2",
      "text": "Reasons for the penalty"
    },
    {
      "level": "H2",
      "text": "Getting started"
    },
    {
      "level": "H2",
      "text": "Key focus areas"
    },
    {
      "level": "H3",
      "text": "1. Links"
    },
    {
      "level": "H3",
      "text": "2. Content"
    },
    {
      "level": "H3",
      "text": "3. Usability"
    },
    {
      "level": "H2",
      "text": "Removing low quality links"
    },
    {
      "level": "H2",
      "text": "Creating high quality and engaging content"
    },
    {
      "level": "H2",
      "text": "Improving the user experience"
    },
    {
      "level": "H2",
      "text": "Reconsideration request"
    },
    {
      "level": "H2",
      "text": "The results"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Steven Macdonald\n          \n            Steven Macdonald\n          \n            Steven Macdonald"
}