{
  "url": "https://moz.com/blog/case-study-the-interconnectedness-of-local-seo-and-exact-match-domains",
  "slug": "case-study-the-interconnectedness-of-local-seo-and-exact-match-domains",
  "title": "Case Study: The Interconnectedness of Local SEO and Exact Match Domains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Is it possible that exact match domains and partial match domains are still given priority by Google?",
  "content": "Case Study: The Interconnectedness of Local SEO and Exact Match Domains Local SEO By: Mark Preston August 15, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Mark Preston August 15, 2016 Case Study: The Interconnectedness of Local SEO and Exact Match Domains Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Before we get into this article, I just want to say that if you are wanting to build a brand, doing it through exact match domains is not the best idea. I selected an exact match domain for myself, however, as I wanted to build up my personal brand. What has happened was purely an accident, but proves that exact match domains (EMDs) or partial match domains (PMDs) really do work — and work very well. My story Back in April 2016, after spending 15 years building digital marketing agencies, I decided to strike out on my own and promote my personal brand as a freelance SEO consultant. I registered the domain markprestonseo.com and launched my small website with the intention of writing weekly blogs. Things did not turn out the way I planned, and work now eats up all my time. When my site went live, I performed all of the usual on-page tweaks and published it on HTTPS. I then set up Google My Business, became verified, and created a few citations on the top UK directory sites and data aggregators. Since then, I have not really done much to promote my site and have not yet got around to doing any natural link building. The only links I have are from citations that use my domain as the anchor text. After a couple of months, I checked my links through Ahrefs and noticed that, to my astonishment, the site was ranking on the first page for Preston SEO. Why is this astonishing? Because my business address, the address on my website, my Google account, and citations all state that my business is located in Blackpool, not Preston. The towns are about 17 miles, or 27km, apart. I started to research the reason my website was outranking SEO agencies that were actually located in Preston and concluded that it was likely due to my domain name.The citations I had submitted all link to my site using the anchor text markprestonseo.com and the words \"Preston SEO\" are in my domain name. It appeared Google was ranking me in a town unrelated to my location because of exact match anchor text which, by pure accident, happened to be identical to my domain name. I took this as proof EMDs still work very well despite widespread belief to the contrary. I shared the discovery with Rand Fishkin via email. He replied: “I think Google is confusing mentions of your brand name with the keyword itself and thus you're benefiting in their rankings/visibility. I'm not saying exact match anchor text/EMDs don't work, just that it's a conflation on Google's part when they work in these sorts of fashions, not an intentional element of Google's ranking goals.” So, Google is just getting mixed up. I personally think Google is working how Google does: looking at the anchor text and ranking my site accordingly. Something else in my favor: I don’t use a telephone number linked to a specific area code; I use my mobile phone number. Also, my postal business address is in Blackpool; my telephone number is not. Local SEO means local It's widely known that getting a website ranked for a location not attached to your business address (or within a small radius) is nearly impossible these days. But it appears that I have managed to do just that. What happened next totally shocked me.On a recent morning, when I was looking further into this situation, I typed in the term \"Preston SEO\" and nearly fell off my chair when I saw my site ranking in the No.3 spot on the maps and in the No.5 spot organically. How on earth is this even possible when I don’t have an address in Preston and not a single citation relates to the town of Preston? Does this mean we can just set up exact match domains relating to different areas outside one's physical location and get listed organically and on the maps? Personally, I think not.Armed with this new finding, I set about reaching out to a few top SEO and marketing pros to ask for their comments. The response was fantastic and here is what they had to say on the subject: “The distance from your location to Preston is 13 miles. I don’t find it odd that it would locate you. If you were perhaps much further away, say Birmingham, sure. But this doesn’t look odd to me at all.” — Danny Sullivan, founding Editor at Marketing Land and Search Engine Land So, Danny thinks that this is very normal, even if they are two totally different towns. He does point out that my freelance office is on the outskirts of Blackpool on the Preston side. “My only comment on your finding is that it is based on very limited data. Just a test of one EMD. I tend to agree with Rand’s comments. Google’s algorithm is not perfect. We run into strange things all the time. But I would say that Google gets it right way more often than they get it wrong.” — Arnie Kuenn, CEO of Vertical Measures I have been preaching ethical SEO for over a decade now and do believe Google gets it right way more often than not. “I agree with Rand. From my background in text analytics, I suspect that Google is identifying Preston as an entity — a proper noun in this case — but it can't tell the difference between your name and the place name. It is possible that your physical proximity to Preston even adds to this confusion. I suspect that exact match domains help a bit in the algorithm, but I believe that they don't work as well as they did years ago.” — Mike Moran, founder, Biznology I do agree that EMDs are not as powerful as they once were, but with the launch of all the Local SEO-related updates, I would have thought Google would not rank sites outside the physical location. I can also see that it may be the case that Blackpool and Preston are only 17 miles apart, but I noticed this same thing the other day when I was doing some competitive analysis for a client. Now they are also ranking in Preston because of an exact match domain, but their physical location is 51 miles, or 82 km, apart. “1) If search queries have limited volume and limited competition then they are often quite easy to rank for. But since almost nobody is searching for them, there is little financial incentive to rank for them. 2) The value of an EMD decreases EXPONENTIALLY as other signals get folded into rankings for highly competitive keywords, particularly for terms which heavy advertising billion dollar brands target. It would probably be almost impossible to sustainably rank for [auto insurance] or [car insurance] in the US market leveraging an EMD at this point. An industry trade organization might be able to do it, but just about everyone else would be guaranteed to fail due to algorithmic ranking mix shift and the brand strength of competitors.” — Aaron Wall of SEOBOOK. I agree that the search volume is not great, but Google is clearly ranking me for a town that my business is not located in. To me, this shows that local is all messed up or Google is seeing \"Preston SEO\" as a keyword, and not a location, so they are ranking me based on the keyword anchor text which just happens to be part of my domain. “Nothing to add really above what you and Rand have said. It looks like a combination of Google not understanding that Preston in this context is your surname (and not a location) + the citations + the word in the domain. The Google Maps listing is evidence of Google not understanding the context of the word Preston. We still see keywords in domain names helping, just not to the same extent they used to in years gone by. :) \" — Paddy Moogan, Co-Founder of Aira So, from Paddy’s comment, it does appear that Google is just getting things mixed up here... or is it that exact match anchor text is more powerful than the citations related to the physical address? “I just took a quick look but you have Preston SEO in your title tag, copy, domain and anchor text. It is likely a combination of factors along with the fact that the monthly volume for Preston SEO is 140 searches per month (low volume) that are leading to you ranking quickly for it. If you look at the Moz Local local ranking survey https://moz.com/local-search-ranking-factors you still seem to check several key boxes. Business title, on page keyword use, and anchor text are significant ranking factors so I can see why they would rank you locally. I don’t think this would work in a more competitive local environment, though.” — AJ Ghergich, founder of Ghergich & Co I have to agree that it would probably be a different story if my name just happened to be \"Mark London.\" What is crazy, though is this: I rank at No. 5 for \"Preston SEO\" organically, but for \"Blackpool SEO\" (the town my business and all my citations are associated with), I am way down in position No. 38 (for now) organically. Again, this is another sign that EMDs with exact match anchor text work well or that Google would naturally rank me in Blackpool as well as Preston. “First of all, you must remember that Local Search and Universal Search have two different ranking algorithms, hence the local box weirdness and the organic search issues almost surely have different reasons. If I remember well, then, the 'center centric' local ranking factor is not such anymore, in the sense that — depending on the industry niche — Google doesn't calculate anymore the geographical distance from the downtown of a city for determining the relevance of a local result, but it can consider a different kind of center. For instance, this is true for things like malls or car dealers, which usually are in the suburbs of the cities. In the Preston specific case, it seems as if Google considered as 'center' an undetermined place between Preston and Blackpool because it is not showing any agency of Blackburn, which is closer to Preston than Blackpool. Overall it is a very normal SERP, IMHO... which indicates that all the other SEO agencies are doing very bad in Local Search if you are present in the local box (or other non-Preston agencies).” — Gianluca Fiorelli of ILoveSEO.net Note: The above is just a snippet of what Gianluca actually sent me as he went into some detail. I did like his comment though that I am ranking because all the other SEO agencies who are actually based in Preston are not very good. “I agree with you — exact match domains still work quite well. I've been wanting to do an article on it for a long time. BUT, usually, the moment you write something like that, magically, they'll stop working. Especially if your article gets a lot of notice. So, if you want it to keep working for you, you might want to keep it under wraps.” —Kristi Hines, a freelance writer at kristihines.com. Truthfully, it's not an issue of whether or not I want to keep it working for me. I'm simply trying to understand what's happening. I have to say that I’m glad that someone is thinking along the same lines as me, though. “It looks to me like Google is confusing your last name with the location. While I haven’t done a detailed backlink analysis for your site, I suspect that it’s further proof of the power of anchor text, as Google sees “preston” in some of your backlinks, and “seo” in others of those links. It may even recognize that “preston” is a proper name, but not know the difference between your last name and the city. Of course, you also use your name a lot on your site too!” —Eric Enge of Stone Temple Consulting Let’s turn this on its head a little: Imagine Google is confusing my name with the town of Preston Imagine that I was not ranking based on exact match anchor text links Why is it then that I rank in the No. 3 spot on the maps and No. 5 organically for the term \"Preston SEO\" when the term \"SEO Preston\" is ranking me in the No. 14 position on maps and in the No. 52 position organically? This, to me, suggests Google is looking at the phrase \"Preston SEO\" as a keyword and using exact match anchor text to rank it, but is looking at the term \"SEO Preston\" from a local perspective. This is certainly something worth discussing. “I don't think Google have become mixed up at all — exact match DOES work... as mentioned in Bryan Dean's post here. I've witnessed it myself in the past; seeing EMDs with little valuable content and minimal (visible) inbound links, yet high ranks gained in the SERPs. It's another quality control thing. Whatever Google tell you not to do — that's the stuff that usually works and can manipulate rankings.” — Sam Hurley of Optim-Eyez Now here is someone who thinks the same as me as to the reason my site is ranking for a term unlinked to my actual location: \"This case study suggests that Google uses text within a domain and/or anchor text to determine a site's location.\" — Brian Dean of Backlinko.com Short, sweet, and to-the-point. “I wouldn't really count this as an exact match domain as that would just be prestonseo.com (hence the exact part). But yes, they do work. Diyhomeenergy.com ranks for 'diy home energy'. Pottytrainingin3days.com ranks for potty training in 3 days. And so on... :) ” — Glen Allsopp of Viperchill.com OK, my own website may not technically be an exact match domain but, rather, a part-match domain. Well, if my PMD can secure local rankings outside its own town, then EMDss can do so much more through exact match anchor text. “A very nice case, mate! That is something that I've discussed in my \"on page seo\" post. I mean having keywords in your domain or URL doesn't have a direct impact on your ranking, but since many people link with a raw URL, you kind of get a pretty targeted anchor text from the words in your domain and your URL.” — Tim Soulo of Ahrefs. This is the exact point I am trying to make. “These things do happen. Google is far from perfect. The domain name definitely plays a role in it I think, but I suspect the bigger story here is how local search is screwed up big time at the moment. I've seen several occasions where businesses in other cities rank better on local searches.” — Bas van den Beld of State of Digital I do agree that I am seeing first hand that local is all messed up at the moment. I thought it was supposed to be a lot harder to get ranked outside the immediate area your business is located! “This is definitely a curiosity. I don’t know what to think since it’s a single instance — I haven’t seen anything like this previously.” — Alan Bleiweiss of AlanBleiweiss.com I, on the other hand, see this same thing on nearly a daily basis within my day job, and often it is conflicting with over 50 miles of distance from the location. \"I wasn't sure if it was exact match domain that was boosting the ranking or if it was click-through rate. If your domain was Preston seo, people might click on that when searching for it because the domain name appears relevant. And we know higher CTR = higher rankings.\" — Larry Kim of WordStream. Larry might be on to something here. I can confirm that since I started to reach out to all these top marketing pros, my organic ranking for \"Preston SEO\" has now increased to position two, as seen in the screenshot below. “I discussed the future of the new gTLDs in an article here (which may be an interesting read). You are right that exact match domains still matter, but not necessarily because of matching your domain to the search query by search engines, but rather because of matching your domain to the search query by users. External links with the domain in anchor text, CTR, and related user signals play an important role and as such this may help rankings when utilizing an exact match domain. In your post your location is also close enough to the other town, while using the town keyword in the page title and matching the query more precisely in your page title unlike the competitor (Preston SEO vs. SEO ... Preston), that you become a potential relevant search result.” —Fili Wiese of SearchBrothers.comThe words above come from a former Google guy. Basically, I am ranking for Preston SEO because Google has deemed I am the best fit for the user. Now that sounds good to me. Conclusion Now that you have read my little case study about my personal belief that exact match domains or even partial match domains still work very well, but maybe for less competitive terms only, I'd like to hear your thoughts on the subject. Please share in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: The Interconnectedness of Local SEO and Exact Match Domains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: The Interconnectedness of Local SEO and Exact Match Domains"
    },
    {
      "level": "H2",
      "text": "My story"
    },
    {
      "level": "H2",
      "text": "Local SEO means local"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Preston\n          \n            Mark Preston\n          \n            Mark Preston"
}