{
  "url": "https://moz.com/blog/cc-tld-domain-study",
  "slug": "cc-tld-domain-study",
  "title": "Study: How Searchers Perceive Country Code Top-Level Domains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Should you use a ccTLD? Do people even know what they are? This study offers some surprising answers for SEOs and business owners who aim to connect with an international audience.",
  "content": "Study: How Searchers Perceive Country Code Top-Level Domains International SEO By: Eli Schwartz December 22, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eli Schwartz December 22, 2014 Study: How Searchers Perceive Country Code Top-Level Domains International SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The decision to focus your site on an international audience is a big step and one fraught with complexities. There are, of course, issues to deal with around language and user experience, but in addition there are some big technical choices to make including what domains to use. Any authoritative international SEO guide will elaborate on the differences between the options of subdirectory, subdomain, and country-code top level domain (CCTLD). One of the most common suggestions is for a site to opt to use a ccTLD (e.g. domain.co.uk) as the domain extension. The reasoning behind this is the theory that the ccTLD extension will \"hint\" to search engines and users exactly who your target audience should be versus the other, less explicit options. For example, a search engine and human user would know, even without clicking into a site, that a site that ends with .co.uk is targeting a user looking for UK content. We have solid data from Google that a ccTLD does indicate country targeting; however, when it comes to users there is only an assumption that users even notice and make choices based on the ccTLD. However, this is a fairly broad assumption that doesn't address whether a ccTLD is more important than a brand name in the domain or the quality of a website's content. To test this theory, we ran a survey to discover what users really thought. User knowledge of TLDs Even before trying to understand how users related to ccTLDs it is essential to validate the assumption that users even know that general TLDs exist. To establish this fact, we asked respondents to pick which TLD might be the one in use by a non-profit. Close to 100% of respondents correctly identified a TLD ending with .org as the one most likely to be used by a non-profit. Interestingly, only 4% of people in the US stated that they were unsure of the correct TLD compared to 13% of Australians. Predictably, nearly all marketers (98%) chose the .org answer. Another popular TLD is the .edu in use by educational assumptions, and we wanted to understand if users thought that content coming from a .edu domain might be more trustworthy. We asked users if they received an unsolicited email about water quality in their town whether they would place more trust in a sender's email address that ended with .edu or .com. 89% of respondents in the US chose the .edu as more trustworthy, while only 79% said the same in Australia. Quite interestingly, the marketer responses (from the survey posted on Inbound.org were exactly the same as the Australians with 79% declaring the .edu to be more trustworthy. If users can identify a .org as the correct TLD for a non-profit, and a .edu as a TLD that might be more trustworthy, it is likely that users are familiar with the existence of TLDs and how they might be used. The next question to answer is if users are aware of the connection between TLDs and locations. Country relationship awareness Next, we asked respondents to identify the location of a local business using a .ca TLD extension. The majority of respondents across all three surveys correctly chose Canada; and nearly all marketers (92%) got this correct. Oddly, more Australians (67%) correctly identified Canada than Americans (62%). We would have thought Americans should have been more familiar with the TLD of a neighboring country. Additionally, more Americans (23%) fell for the trick answer of California than Australians (15%). Regardless, we were able to conclude that most Internet users are aware of TLDs and that they are tied to a specific country. To really gauge how much users know about TLDs and countries, we asked users to pick the right domain extension for a website in another country. In the US survey, we asked users to pick the correct TLD for an Australian company, and in the Australian survey we used a British company. In each of the questions we gave one correct answer possibility, one almost correct, and two entire wrong choices.For example, we gave .co.uk and .uk as answer choices to Australians. In both the US and Australia, the majority of respondents chose the correct TLD, although Americans seem to have been confused by whether Australia's TLD was .AU (35%) or .com.AU (24%). There is a common practice of using country-code domain extensions as a vanity URL for content that is not geotargeted. For example, .ly is the domain extension for Libya, but it is frequently used on domains that have a word that ends with \"ly.\" Additionally, .me is the domain extension for Montenegro; however, the TLD is used for many purposes other than Montenegro content. We wanted to understand if users noticed this type of TLD usage or if they thought the content might still be related to another country. We asked respondents what might be on a website that ended with .TV which is the TLD for the island nation of Tuvalu and is also a popular TLD for TV show websites. 51% of US respondents thought it might be a TV show and 42% chose the \"it could be anything\" answer. In Australia, 43% thought the site would be a TV show, and 44% said \"it could be anything\". One of the answer options was that it could be a website in Tuvalu and interestingly twice as many Australian (9%) chose this option vs US respondents (4.5%). This question was one of the areas where marketers' answers were very different from those in the US and Australia. 77% of marketers chose the TV show option and only 19% said it could be anything. Based on the these three results, it is apparent that users recognize TLDs, know that they are from other countries, and appear to make some judgments around the content based on the TLD. Decision making using TLDs Since users know that TLDs are an important part of a URL that is tied to a country of origin, it is important to understand how the TLD factors into their decision-making processes about whether or not they visit certain websites. We asked users whether they thought medical content on a foreign TLD would be as reliable as similar content found on their local TLD. In the US, only 24% thought the content on the non-local TLD (.co.uk) was less reliable than content on a .com. In Australia, the results were nearly identical to what we saw in the US with only 28% answering that the non-local TLD (.co.uk) was less reliable than the content on a .com.au. Even 24% of marketers answered that the content was less reliable. The remaining respondents chose either that the content equally reliable or they just didn't know. Based on these results, the TLD (at least as long as it was a reputable one) does not seem to impact user trust. Digging into the idea of trust and TLD a bit further, we asked the same reliability question about results on Google.com vs Google.de. In the US, 56% of respondents said that the results on Google.de are equally reliable to those on Google.com, and in Australia, 51% said the same thing when compared to Google.com.au. In the marketer survey, 66% of respondents said the results were equally reliable. The fact that the majority of respondents stated that results are equally reliable should mean that users are more focused on the brand portion of a domain rather than its country extension. CcTLD's impact on ecommerce Making the decision to use a ccTLD on a website can be costly, so it is important to justify this cost with an actual revenue benefit. Therefore the real test of TLD choice is how it impacts revenue. This type of answer is of course hard to gauge in a survey where customers are not actually buying products, but we did want to try to see if there might be a way to measure purchasing decisions. To achieve this result, we compared two different online retailers and asked respondents to choose the establishment that they thought would have the most reliable express shipping. In the US survey, we compared Amazon.co.jp to BestBuy.com. In the Australian survey, we compared Bigw.com.au (a well known online retailer) to Target.com. (Interesting fact: there is a Target in Australia that is not affiliated with Target in the US and their website is target.com.au) The intent of the question was to see if users zeroed in on the recognizable brand name or the domain extension. In the US, while 39% said that both websites would offer reliable shipping, 42% still said that Best Buy would be the better option. Australians may have been confused by the incorrect Target website, since 61% said both websites would have reliable shipping, but 34% chose Big W. Even marketers didn't seem oblivious to domain names with only 34% choosing the equally reliable option, and 49% choosing Best Buy. The data in this question is a bit inconclusive, but we can definitively say that while a large portion of users are blind to domain names, however, when selling online it would be best to use a familiar domain extension. New TLDs Late last year, ICANN (the Internet governing body) announced that they would be releasing dozens of new GTLDs, which opened up a new domain name land grab harkening back to the early days of the Internet. Many of these domain names can be quite expensive, and we wanted to discover whether they even mattered to users. We asked users if, based solely on the domain name, they were more likely to trust an insurance quote from a website ending in .insurance. 62% of Americans, 53% of Australians, and 67% of marketers said they were unlikely to trust the quote based on the domain alone. Based on this result, if you're looking to invest in a new TLD simply to drive more conversions, you should probably do more research first. A new gTLD is probably not a silver bullet.Methodology For this survey, I collaborated with Sam Mallikarjunan at HubSpot and we decided that the two assumptions we absolutely needed to validate where 1) whether users even notice ccTLDs and 2) if so do they really prefer the TLD of their country. While we received 101 responses from a version of the survey targeted at marketers on an Inbound.org discussion, we primarily used SurveyMonkey Audience, which allowed us to get answers from a statistically significant random selection of people in both the United States and Australia. We created two nearly identical surveys with one targeted to a US-only audience and the other targeted to an Australian-only audience. A proper sample set is essential when conducting any survey that attempts to draw conclusions about people's general behavior and preferences. And in this case, the minimum number of respondents we needed in order to capture a representative example was 350 for the U.S. and 300 for Australia. Additionally, in order for a sample to be valid, the respondents have to be chosen completely at random. SurveyMonkey Audience recruits its 4-million+ members from SurveyMonkey's 40 million annual unique visitors, and members are not paid for their participation. Instead, they are rewarded for taking surveys with charitable donations, made on their behalf by SurveyMonkey. When tested against much larger research projects, Audience data has been exactly in line with larger sample sizes. For example, an Audience survey with just 400 respondents about a new Lay's potato chip flavor had the same results as a wider contest that had 3 million participants. SurveyMonkey's survey research team was also able to use SurveyMonkey Audience to accurately predict election results in both 2012 and 2013. With a US sample size of 458 respondents and an Australian one of 312 all drawn at random, our ccTLD user preferences should reliably mirror the actual reality. Summary There will be many reasons that you may or may not want to use ccTLDs for your website, and a survey alone can never answer whether a ccTLD is the right strategy for any particular site. If you are thinking about making any big decisions about TLDs on your site, you should absolutely conduct some testing or surveying of your own before relying on just the recommendations of those who advise a TLD as the best strategy or the others that tell you it doesn't matter at all. Launching a PPC campaign with a landing page on a ccTLD and measuring CTRs against a control is far cheaper than replicating your entire site on a new TLD. Based on our survey results, here's what you should keep in mind when it comes to whether or not investing your time and money in a ccTLD is worth it: Users are absolutely aware of the TLDs and how they might relate to the contents of a website Users are aware of the connection between TLDs and countries Users do make decisions about websites based on the TLD; however there are no absolutes. Brand and content absolutely matter. As to whether a ccTLD will work for you on your own site, give it a try and report back! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Study: How Searchers Perceive Country Code Top-Level Domains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Study: How Searchers Perceive Country Code Top-Level Domains"
    },
    {
      "level": "H2",
      "text": "User knowledge of TLDs"
    },
    {
      "level": "H2",
      "text": "Country relationship awareness"
    },
    {
      "level": "H3",
      "text": "Decision making using TLDs"
    },
    {
      "level": "H2",
      "text": "CcTLD's impact on ecommerce"
    },
    {
      "level": "H2",
      "text": "New TLDs"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "International SEO — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Build a Business Case to Get an International SEO Investment Approved for 2024"
    },
    {
      "level": "H3",
      "text": "Going International: 15 SEO Steps for a Successful Expansion"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eli Schwartz\n          \n            Eli Schwartz\n          \n            Eli Schwartz"
}