{
  "url": "https://moz.com/blog/challenges-in-automated-traffic-reporting",
  "slug": "challenges-in-automated-traffic-reporting",
  "title": "Challenges in Automated Traffic Reporting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "...or, \"How I learned to stop worrying and love all the Dashboards.\"",
  "content": "Challenges in Automated Traffic Reporting SEO Reporting By: Benjamin Estes September 25, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Benjamin Estes September 25, 2011 Challenges in Automated Traffic Reporting SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently I had a client who (generally for the enlightenment of their executive branch) wanted traffic information reported in an easy-to-digest format. The idea was that while they had consistently used Google Analytics for some time, there were people in the company who had an interest in knowing certain traffic data, but were too far from the day-to-day running of the website to be spending a lot of time sifting through Analytics reports. Enter the Dashboard. It sounded like the perfect solution: a screen full of nice, big numbers! Lines going up and to the right! Charting all the things! But lo! my dream was short-lived. There were so many solutions to choose from, and each had different integrated services and custom data reporting methods. Most of them were explained quite well through documentation, but it was all so time consuming. I would have to trial services, only to determine one-by-one that they were somehow not a match for the client's needs. So here I am to save you some time by letting you know some of the pros and cons of various services, as some insights I had along the way. There is probably a service out there that's right for you, but it may or may not be the first one you look at. I should point out that my concern here is with monitoring organic traffic data specifically. There are many services apart from those listed here which excel at reporting ranking data, and of course some services which walk a line between the two. There are several services which revolve primarily around ranking data instead of traffic, such as Authority Labs and Conductor Searchlight; I can say from experience that these are both great products (NB: Searchlight does provide Analytics integration but I'm not personally familiar with that aspect of their service). With services that revolve around tightly-integrated analytics data, the pain point is usually getting actual lists of keywords sending traffic reported back to you. Google Analytics For monitoring organic traffic data, my instinct is always to go straight to the source. For most of us, that means Google Analytics. And indeed Google Analytics has built in dashboard functionality. The crucial factor which favors Analytics is that, unlike other solutions I have assessed there is no need to depend on a service providers integration of the Analytics API or to have your own dev team spend time building out a custom solution. I mentioned above that some solutions have problems reporting keywords sending traffic; obviously Analytics is not among these, because its dashboard will report just about anything you care to know. Breakdowns by country, for instance, are quite easy to set up in Analytics but are hard to come by outside of the proper Analytics interface. If all you want is traffic data, you really can't go wrong with sticking to Analytics. The only management issue I've run into is that you can't share dashboards across user accounts at the moment. On the other hand this is a very robust service; there is never a concern about about whether or not a certain report can be integrated into your dashboard. All available traffic information is at your fingertips. Plus, Analytics is free as in beer, which is the best kind of free. PRO: It's got all the traffic information EVER. CON: No other SEO related info... SEOmoz PRO Campaigns Disclaimer: This is being written on SEOmoz's blog (duh). I don't work for the 'moz, but you could say we're buds. Regardless, I promise the following represents only my own opinion. Hopefully you're all familiar with SEOmoz's toolset. I'm usually using SEOmoz's campaign tool anyway for clients, so it isn't much of a stretch to start using their Analytics integration to look at traffic data. The three metrics that SEOmoz's Analytics integration reports are the three that I find myself lost without: Organic Visits, Number of Organic Landing Pages, Number of Organic Keywords. It's a sparse set of metrics to be sure, but in my time at Distilled these metrics have been the three that we always return to and those that we most commonly report to clients as an indication of a site's health. If I wanted to share this information directly it might be awkward, but if I was advising the client on setting up their own monitoring solution I think that this would work out fairly neatly. And of course, there are any number of other benefits to using SEOmoz's campaign tool (competitive analysis, rank tracking, etc.) but that's a bit beyond what I'm looking at here. No custom data reporting like StatsMix and Geckoboard (below), but then again those services don't hold a candle to SEOmoz in terms of ease-of-use and built-in analysis. PRO: Super-relevant traffic data, awesome supplementary metrics. CON: No customization, no keyword specific Analytics integration. StatsMix StatsMix has the capacity to store data over time that you submit to it, which is unique amongst all of the dashboard solutions. This can be easily accomplished in any number of contexts; the service provides examples in various programming languages, but all that you need to do ultimately is make a POST request to their servers with the information you want to submit. It will be stored in a table that is even manually editable through the web interface. This obviously requires a certain amount of dev commitment, but it really is pretty neat, and it allows you to do things that no other dashboard service does. External and internal metrics can be brought together. But the Analytics integration that your team would have to do to monitor organic search related metrics is non-trivial, so unless your company is going all the way, this service might be a little too much for SEO-related monitoring. Also, all metrics must be \"number-over-time\" in nature, so no keyword-based metrics! I can also say that I've talked to the StatsMix support team and they've been exceedingly helpful in helping me with any questions I might have. PRO: Awesome customization possibilities. CON: No intrinsically relevant SEO widgets, everything must be built ground-up. Metrics must fit number-over-time format. Geckoboard Unlike StatsMix, Geckoboard does not have the capacity to store your data over time; custom information that it retrieves from your data sources must be presented exactly how you want the information to be displayed. There are many built-in widgets that are very handy, including server monitoring and Analytics widgets, but some of the defaults are a wee bit underpowered when it comes to customization I think Geckoboard's strength lies in its powerful custom widgets. As I said, these require you to either locate or more likely build an API to deliver data. Distilled has done this internally and has been very pleased with the results. One consequence of this extensibility is that with the proper Analytics integration in your infrastructure it would be possible to report a list of top organic keywords or similar data, which is impossible with, for instance, StatsMix. PRO: Great customizability in its own way, cool built-in widget set. CON: Not necessarily SEO monitoring friendly. Needs a custom API on user's end to explore full potential. GinzaMetrics GinzaMetrics seems to strike a fairly good balance between keyword tracking and traffic assessment. There is definitely some cool stuff going on with funnel monitoring, especially as you can filter the data by tracked keywords. Ultimately I find that the data provided by the service is somewhat less useful than SEOmoz's. GinzaMetrics' graphs present a lot of information, but it isn't necessarily actionable or diagnostic in the format in which it is presented. I mean, there are some freaky graphs you can find in here. They would give me data-nightmares, but I can see that they might turn some data-folk on. I do appreciate that GinzaMetrics pulls in Analytics data for tracked keywords, but as I've been consistently lamenting throughout this post, I wish it were the other way around; that the service would discover keywords based on the traffic they were sending your site. Overall a good service, definitely SEO-centric without much customization outside of that. PRO: Pretty OK mix of keyword tracking and analytics. CON: OMG numbers everywhere.NB: After publishing this Ginzametrics brought to my attention that their service does provide for keyword discovery. Might be worth chatting with them if this is on your radar. Closing Thoughts I'm not going to declare a winner. I'm using one solution for a client today, and when another client comes along with their own needs, I'll use one appropriate for them. But digging through the many alternatives and learning what is possible really helps me be flexible to respond to these requests when they are made. I've mentioned that some of these services benefit from a certain level of customization. For anyone interested in building an \"API\" or automated tool to push data to a dashboard, I highly recommend brushing up on your Python skills and checking out Google App Engine or a Django-based solution (they function very similarly). App Engine probably isn't the most secure solution, but it's dead easy and ridiculously fast, as Will Critchlow demonstrated in his brilliant post on automated link building tools (which I inevitably cite in every blog post I publish). This is hardly a comprehensive, just my meditations on the services I've run into. So, any of y'all have your own methods or tools? Dashboards? Generated reports? Let's hear about it 'em! Follow @BenjaminEstes Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Challenges in Automated Traffic Reporting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Challenges in Automated Traffic Reporting"
    },
    {
      "level": "H2",
      "text": "Google Analytics"
    },
    {
      "level": "H2",
      "text": "SEOmoz PRO Campaigns"
    },
    {
      "level": "H2",
      "text": "StatsMix"
    },
    {
      "level": "H2",
      "text": "Geckoboard"
    },
    {
      "level": "H2",
      "text": "GinzaMetrics"
    },
    {
      "level": "H2",
      "text": "Closing Thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Benjamin Estes\n          \n            Benjamin Estes\n          \n            Benjamin Estes"
}