{
  "url": "https://moz.com/blog/champion-animals-in-local-seo",
  "slug": "champion-animals-in-local-seo",
  "title": "8 Ways to Champion Animals in Your Local Business Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The majority of American households now include pets, and recent global quarantines have only brought us closer to them. In today’s blog, Miriam outlines eight ways you can honor the relationships your customers have with their animals, plus tips for weaving those efforts into your local business…",
  "content": "8 Ways to Champion Animals in Your Local Business Marketing Strategy Local SEO | Marketing Industry By: Miriam Ellis May 31, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis May 31, 2021 8 Ways to Champion Animals in Your Local Business Marketing Strategy Local SEO | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: Yoshihide Nomura If you’ve ever had the privilege of being present for a baby’s first joyful encounter with a household pet, you’ll have noticed the profound wonder and excitement of the little one’s reaction. Once upon a time, that was each of us beaming and bouncing up and down with the thrill of meeting our first dog or cat. Don’t lose that joy — be like these Canadian women watching whales from their garden: From our earliest days, most of us have simply loved animals. We fill children’s books with tales of them and choose them as life companions. In many cultures, animals are sources of sacred power, and in all parts of the world, wildlife is absolutely essential to balanced ecosystems. 67% of American households now include pets — that’s the majority of your consumer base signalling just how much animals matter to them. When local business owners and marketers communicate with most customers about animals, shared affinity is ready-built into the exchange, drawing on feelings of warmth, admiration, responsibility, concern, and happiness. These dearly-held sentiments can be sturdy building blocks of benefit for other-than-human creatures, communities, and your business. This is deeply good marketing, which can yield personal satisfaction, press, links, citations, loyalty, and positive social change. Today, we’ll consider eight options for honoring the love both you and your customers have in common when it comes to animals, plus tips for weaving your efforts into your local business marketing strategy. All animal-centric activities, great and small Almost any local business will find one or more actionable ideas here to demonstrate care for animals. 1. Expand your welcome to customers’ pets Where local health codes and business models permit, make provisions for pets at your place of business. Before the pandemic, dog-friendly dining patios, water stations, lodgings, and shopping center-based dog parks were on the rise and can return once safety does. Put a bowl of dog treats outside your storefront to make your business a memorable highlight of neighbors’ daily dog walks, keep a stash of them behind the counter if pets are permitted indoors, and take note of the dairy delivery drivers who toss snacks to dogs when bringing groceries to customers in the pacific northwest. A kiosk of free doggy cleanup bags could be a draw to your door and a boon to the neighborhood. Bring customers inside when it’s safe again to do so with a feature wall of local pet photos. Hold contests that center pets or feature pet-centric prizes, or host a pet-based event. Meanwhile, if your business is located in a neighborhood far from large pet supply stores, consider whether a pet section makes sense in your inventory. 2. Make a place for staff pets Image credit: Groupon Every year, new studies are published indicating that when pets interact with people, humans benefit from lowered cortisol and blood pressure levels and a variety of improvements in states of whole body well-being. As a shopper, I can say that my household loves visiting businesses with resident pets. Prior to stay-at-home orders, some of our most memorable shopping excursions were to the nursery with the noble-looking Australian shepards, the craft store with the little terriers, and the farm stand with the dachshunds. To-do lists sounded like this: “We need to buy mulch. Oh, and we’ll get to see Pushkin the little red dog!” Companies are always seeking out methods of creating memorable experiences, and friendly cats and dogs on-site can be instant magic in this regard. At Moz, even before we were working remotely, honored staff pets added calm and pleasure to company meetings, with an established policy for animal etiquette and safety practices Mozzers agreed to in order to bring their companions to the office. Even at companies that can’t have animals on the premises as a regular thing, bring-your-pet-to-work days can signal to staff that a brand is sensitive to work/life balance once it becomes safe again for people to return to offices. Evaluate how a company you’re marketing might safely incorporate animal companions into the workplace for the happiness of both staff and customers. 3. Expand your welcome to wildlife Image credit: Theresa_Gunn Many businesses have the space to hang a bird feeder and water dish or set up a bird bath. Nesting boxes for birds and bats are small and can be fitted into all sorts of nooks and eaves around your building in any spot where droppings won’t be a nuisance. If your business is lucky enough to have the space, planter boxes can provide flowers, fruit, seeds, nectar, pollen, and nesting materials for birds, butterflies, bees, and other pollinators. Call a local nursery to ask which native plants will fit in your containers and support winged visitors. If you have more space and can plant a hedge, you’ll be making a home for many types of birds and insects, and may even offer protection to rabbits, raccoons, possums, and other small animals. Well-planned Main Streets and shopping districts can provide more than just sidewalks for humans and streets for cars — they can be places where hummingbirds sip from flower to flower, bees gather pollen, butterflies migrate, and herbivores find forage. Take your seat at city planning meetings and become an advocate for green space in commercial areas, bird-friendly windows, accessible waterways, and other ecological development strategies. 4. Sponsor wildlife crossings, corridor, and rescue programs Millions of domestic and native animals lose their lives on our roads every year, but wildlife corridors that create safe roaming paths through fragmented areas can reduce animal-related car accidents by as much as 80%. If your heart sinks every time you see a dead animal on the highway, talk to your city council about planning wildlife crossings and corridors in your community and then either help build them or have your brand sponsor their construction. Extra credit to you if you can get your customers involved, too. Meanwhile, if you’ve ever had to call a wildlife rescue and rehabilitation number after encountering an injured animal on the road, having a bird stun itself by crashing into a window, or finding unfledged nestlings on the ground, you know what a lifeline these programs can be. Do some research on agencies and groups in your community that contribute to this vital work, and offer volunteer hours or financial support. 5. Sponsor guide dog and companion animal programs Image credit: Zelda Richardson Dogs that act as the guides, protectors, and friends of differently-abled people are heroes, and it takes a great deal of care, time, and money to train them for their work. Additionally, many communities have programs that bring pets to children’s hospitals, elder care homes, and other centers for the important benefits humans can experience just from interacting with a loving, friendly animal. If you’re looking for a sponsorship opportunity that can make a world of difference in people’s everyday lives, research these types of programs and volunteer or sponsor them. 6. Sponsor no-kill animal shelters When animal lovers seek pet adoption, many insist on visiting only no-kill shelters in order to make a statement consistent with their humane values and to avoid the trauma of having to choose among animals who may be killed if not brought home. If your region has a no-kill shelter, it’s not only a good thing to contribute to, but can also be a source of fostering community goodwill when you allow these programs to place donation jars at registers. 7. Offer plant-based and cruelty-free options There’s a reason even fast-food franchises are offering veggie burgers now, and I see the source of it in my own family where 65% of the young people are vegetarians or vegans. Meanwhile, nearly all of them actively seek out self-care products labeled as cruelty-free. Even if your business isn’t staffed by herbivores or animal rights activists, you can include them in the welcome you’re building so that all community members have something to eat, drink, and purchase. Nielsen found in 2018 that 39% of Americans are upping the amount of plant-based dishes in their diets, and it’s my belief that these numbers will continue to rise. Now is the time to be sure you’re not overlooking this growing consumer base who will reward your care for their needs with patronage. 8. Protect water Image credit: Mark Giuliucci If a deep regard for animals is shared by your company and customers, there is likely no better cause to support than the protection of all forms of water, on which we all depend for life. Cleaning up and defending the future of streams, rivers, ponds, wetlands, lakes, and oceans is challenging, vital work for us all. Take an active role, and invite customers to learn and change with you, in removing pollutants and plastics from water sources, abandoning oil pipelines in favor of green energy, replacing forever-products with biodegradable ones, replacing many ecologically-disastrous man-made dams with biodiverse beaver dam habitat, encouraging local water boards to include Indigenous leadership in sustainable community planning, protecting remaining wetlands from development, and providing safe drinking water to all communities. Be a vocal advocate for very good reasons Image credit: Tim Sackton In some cultures and faiths, acts of private charity and kindness are meant to be kept secret. At a corporate level, though, social good can be exponentially expanded when brands are willing to take public stands on matters of conscience. The larger your business, the louder your voice inviting participation in works and causes that honor animals. Once you’ve determined how you’ll be incorporating care for other creatures into your business plan, here are 10 ways to get the word out to the community you serve: Publish optimized website content, based on keyword research and community interest, to explain your brand’s animal-centric activities.Ask the organizations you support to interview someone at your company to explain why your staff/customers are volunteering/donating to this particularly worthy cause. These groups will also likely be looking for content opportunities. Volunteering to be the subject of an interview can expand their reach and hopefully deliver a good link or two to your website, as well.Reach out to local reporters to let them know that this is an angle of your business operations that the public might enjoy reading about; we could all use some good news these days in the local paper!If appropriate, get unstructured citations on local blogs or structured citations on specialty directories. For example, HappyCow.net offers a directory of restaurants where plant-based diners can find a meal. If appropriate, create image and video content about company pets, wildlife stewardship, and local ecological efforts, demonstrating your business’s participation and inviting customers to enjoy taking part.Promote content that you and others have published about your activities on your social media channels.Partner with other local business owners with similar policies and programs to share work and send customers to one another.Write some animal-centric Google posts on your Google Business ProfileAssess whether Google My Business Categories or attributes could be added to your listing to represent animal-related features of your business. Add photos of staff pets or wildlife features at your location to your GMB listing if they add to the welcoming ambiance of your place of business. Wag more Watch the above video by a local business and you’ll see how almost any company can make memorable, emotional connections with the people they serve thanks to a widely-shared love of animals. Actions that celebrate, rather than exploit, our animal relations surely fall under the phenomenon of kindness as currency with multiple studies showing how people are more apt to act with generosity of spirit when they see others do so. When you’re tasked with marketing, you’re always looking for that extra reason to be chosen by customers. 73% of people say they care about the company they buy from, not just the product. The furry paw poised on your knee right now, the purr emanating from behind your laptop, the songs of birds outside your window could be calling you to connect with customers in an authentic new way, over your joint, abiding care for animals. These days, who wouldn’t welcome a chance to wag more? Looking for more authentic local search marketing tips to make your community a better place to live and work? Read The Essential Local SEO Strategy Guide. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Ways to Champion Animals in Your Local Business Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Ways to Champion Animals in Your Local Business Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "All animal-centric activities, great and small"
    },
    {
      "level": "H3",
      "text": "1. Expand your welcome to customers’ pets"
    },
    {
      "level": "H3",
      "text": "2. Make a place for staff pets"
    },
    {
      "level": "H3",
      "text": "3. Expand your welcome to wildlife"
    },
    {
      "level": "H3",
      "text": "4. Sponsor wildlife crossings, corridor, and rescue programs"
    },
    {
      "level": "H3",
      "text": "5. Sponsor guide dog and companion animal programs"
    },
    {
      "level": "H3",
      "text": "6. Sponsor no-kill animal shelters"
    },
    {
      "level": "H3",
      "text": "7. Offer plant-based and cruelty-free options"
    },
    {
      "level": "H3",
      "text": "8. Protect water"
    },
    {
      "level": "H2",
      "text": "Be a vocal advocate for very good reasons"
    },
    {
      "level": "H2",
      "text": "Wag more"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}