{
  "url": "https://moz.com/blog/changes-to-the-algorythm",
  "slug": "changes-to-the-algorythm",
  "title": "Changes to the Algorithm - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I think there has been a change in the Google algorthym which is upgrading older pages and downgrading newer pages. I am basing this statement on the 14 websites I run. These websites are of different age and sit on different servers, registered under different name.We have a strategy than when…",
  "content": "Changes to the Algorithm Search Engines B By: britishblue September 10, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: britishblue September 10, 2007 Changes to the Algorithm Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I think there has been a change in the Google algorithm which is upgrading older pages and downgrading newer pages. I am basing this statement on the 14 websites I run. These websites are of different age and sit on different servers, registered under different name. We have a strategy that when have new content, it must be totally unique. We research the topic and include totally original copy. None of our copy would appear using a copyscape check. We are also very careful about the page name, keeping in mind long tail searches. This helps significantly in SERPs. In the last few weeks we have noticed a number of existing, older pages rising. However pages that are less than a couple of months old, that had jumped straight into high positions, are now dropping. While it is quite normal for new pages to get a boost and then drop, these drops have been higher given the unique content and this is against a background of older pages. This seems to be affecting pages that are less than 3 months old. Has anyone else had this experience? I wonder whether Google is applying a sandbox approach to web pages as well as websites. It would entirely make sense given the amount of spam that is generated. However, the content that this now appears to be effecting is totally unique content. Here are some of my examples: \"Garden conservatories\" and \"Kitchen conservatory\" have jumped from around 10 to second or third place and numerous other terms like \"Listed property conservatory\" have jumped to number one. On the other websites there have also been a number of jumps. However, new pages like \"Conservatory advice\" have dropped. Given the amount of unique content this has this should be strengthening each week. Google has a sandbank for new websites that seems to last a minimum of three months. I wonder whether they are now applying this to new pages as well? Any thoughts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Changes to the Algorithm"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Changes to the Algorithm"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "britishblue\n          \n            britishblue"
}