{
  "url": "https://moz.com/blog/chart-of-googles-asdf-phenomenon",
  "slug": "chart-of-googles-asdf-phenomenon",
  "title": "Chart of Google's -asdf Phenomenon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOmoz has put together a small chart analyzing the top 20 results for two searches at Google, one a normal 2-word phrase, and the other with much discussed -asdf filter (done by appending 15 -asdf onto the back of the query). The two unique results sets have been a...",
  "content": "Chart of Google's -asdf Phenomenon Search Engines By: Rand Fishkin January 28, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 28, 2005 Chart of Google's -asdf Phenomenon Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEOmoz has put together a small chart analyzing the top 20 results for two searches at Google, one a normal 2-word phrase, and the other with much discussed -asdf filter (done by appending 15 -asdf onto the back of the query). The two unique results sets have been analyzed using every known method of SEO measurement, including links, theme, age, etc.In the future, we hope to be able to add more searches onto the chart, but the analysis is very time-consuming. See the current page - chart of Google's -asdf filter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Chart of Google's -asdf Phenomenon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Chart of Google's -asdf Phenomenon"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}