{
  "url": "https://moz.com/blog/charting-the-google-algorithm",
  "slug": "charting-the-google-algorithm",
  "title": "Charting 10 Years of The Google Algorithm - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Explore a decade of Google's ever-evolving algorithm, revealing over 30,000 changes and a surge in updates, as we delve into the intricate dance between human-driven decisions and machine learning's influence on search rankings.",
  "content": "Charting 10 Years of The Google Algorithm Search Engines | Marketing Industry | Algorithm Updates By: Dr. Peter J. Meyers Edited By: Emilie Martin March 28, 2024 Table of Contents Copied! By: Dr. Peter J. Meyers Edited By: Emilie Martin March 28, 2024 Charting 10 Years of The Google Algorithm Search Engines | Marketing Industry | Algorithm Updates If you pay close attention to Google, it might feel like you wake up to a new change every day. In reality, it’s more like thirteen changes. Google reported an astonishing 4,725 “launches” in 2022, up dramatically from 350 — 400 in 2009. Since 2009, when Matt Cutts first discussed this data publicly, Google has made over 30,000 changes and has run millions of search quality tests. While many of these changes are small or isolated to a single market, the pace of change is undeniable, and it can be overwhelming for search marketers. How can we hope to disentangle it all? The algorithm is heating up (2014 — 2023) Thanks to our MozCast research project, we now have an entire decade of daily Google algorithm flux to compare. The chart below is a bird’s-eye view of those ten years, with “hotter” days representing more day-over-day fluctuations in page-one rankings: Download a printable PDF version On average, the algorithm is getting hotter, but the pattern of rising temperatures is complicated. Google confirms and names only a handful of major updates every year, leaving us in the dark on many changes. For example, to this day, we have no confirmed explanation for the volatility in the summer of 2017. Often, we’re forced to speculate. It’s also important to remember that search results are a real-time phenomenon. They would change every day even if Google didn’t touch the code because the internet is constantly changing. One vivid example is the WHO declaration of COVID-19 as a global pandemic in March 2020. The pandemic drastically changed search behavior, including huge shifts in e-commerce vs. brick-and-mortar shopping. This naturally impacted search results. The past two years (2022 — 2023) clearly show a return to hotter temperatures, including a historically overheated summer of 2023. Google also released a record four core updates in 2023. Is this heatwave the new normal? Let’s take a closer look. Core updates are a big deal (2018 — 2023) In early 2018, Google officially confirmed the existence of broad “core” updates and started publicly reporting those updates. Since then, there have been 18 named core updates (not counting the March 2024 Core Update, which arrived a bit too late for this post). Here are the ten hottest core updates (according to MozCast) so far: The four core updates in 2023 took the top two spots and half of the top eight. The August 2018 Core Update (AKA “Medic”) sits in the #3 spot. While it’s hard to separate the temperature of a core update from the background radiation of the algorithm, it’s clear that 2023 was a tumultuous year, and these core updates brought about substantial changes. While core updates, in general, seem to bring outsized ranking fluctuations, Google usually provides little detail or guidance. This lack of transparency is, in part, to keep people from gaming the system. Practically, though, these updates are also complex and multipart and may be complicated by the use of machine learning in the core algorithm(s). Put simply, even Google may not be able to interpret or explain all of the moving pieces. The future belongs to the machines… In October 2015, Google revealed RankBrain, a machine learning algorithm that had probably been running since at least spring of that year. This represented a philosophical shift within Google from a historically strong reliance on human-vetted rules/heuristics. A lot has happened since then, and Google has at least three core deep-learning components in play: RankBrain, DeepRank, and RankEmbed. In spring of 2023, Google launched the Search Generative Experience (SGE), built on Bard (recently rebranded to Gemini). SGE uses Large Language Models (LLMs) to try to answer natural-language queries by combining information from multiple websites. Here’s a recent example: This begs the question: did SGE drive the unprecedented summer ranking flux of 2023 (that has barely subsided even in early 2024)? The short answer is “no”. Since SGE was only open to limited, logged-in users, and MozCast uses depersonalized search results, there’s no reason to believe that SGE would materially impact our measurements. The long answer is a lot more complicated. First, it’s possible that the launch of SGE as a feature brought with it other new machine-learning components built on Bard. I think there’s something bigger at play here, though. LLMs like Bard and ChatGPT opened up an AI arms race in content marketing, making it easier than ever to churn out automated content cheaply and at better quality than previously available. It’s entirely possible that the churn we saw across 2023 is a result of opening Pandora’s box of machine-generated content. It’s also possible that the four 2023 core updates were, at least in part, an attempt to close that box. That push and pull would cause ranking fluctuations in both directions. This is a plausible explanation, but it is very difficult to prove. …but people are still pulling the levers Ultimately, Google’s “weather” isn’t a natural phenomenon — it’s driven by human choices, reactions, and, occasionally, mistakes. Whether the changes are heuristic or machine-driven, they’re all driven by the same core philosophy and business models. SGE is a perfect example. We’re still waiting on a wide rollout, suggesting that Google doesn’t entirely like what they see. It’s easy to nitpick the quality of any given generated result. Still, across the big picture, Google has to consider the impact on overall quality, ad revenue, speed/latency, and the considerable cost of rolling out these models. Even the very existence of SGE was driven by the pressure of OpenAI’s public success and partnership with Microsoft’s Bing, accelerating Google’s previously conservative timeline. These decisions go well beyond the algorithm itself and even Google’s technological capabilities. To understand the future, we have to understand all of these pressures. We can learn a lot from the past ten years, but ultimately, we have to be able to adapt. The only guarantee is that — as long as people need to find information, people, places, and things, both search engines and search marketing will continue to exist. For a full list of major algorithm updates back to 2003’s “Boston” update, check out our Google algorithm update history. For daily data on Google rankings flux and SERP feature trends, visit our MozCast SERP tracking project. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Charting 10 Years of The Google Algorithm"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Charting 10 Years of The Google Algorithm"
    },
    {
      "level": "H2",
      "text": "The algorithm is heating up (2014 — 2023)"
    },
    {
      "level": "H2",
      "text": "Core updates are a big deal (2018 — 2023)"
    },
    {
      "level": "H2",
      "text": "The future belongs to the machines…"
    },
    {
      "level": "H2",
      "text": "…but people are still pulling the levers"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon ticket!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}