{
  "url": "https://moz.com/blog/cheers-to-building-brand-personality-whiteboard",
  "slug": "cheers-to-building-brand-personality-whiteboard",
  "title": "Cheers to Building Brand Personality [whiteboard] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What makes some brands simply average and others extraordinary? Why do some brands instantly stick in your mind and others draw a blank? Although there are a handful of factors that contribute to an extraordinary brand, there is one that is absolutely critical; humanizing your brand through…",
  "content": "Cheers to Building Brand Personality [whiteboard] Branding By: Luke Summerfield June 4, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Luke Summerfield June 4, 2013 Cheers to Building Brand Personality [whiteboard] Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. What makes some brands simply average and others extraordinary? Why do some brands instantly stick in your mind and others draw a blank? Although there are a handful of factors that contribute to an extraordinary brand, there is one that is absolutely critical; humanizing your brand through building brand personality. In my YouMoz whiteboard we are going to cover why building brand personality is so important to establishing relationships and community, being sticky and build brand advocates. Ultimately what we are talking about is what your brand needs to do in order to survive the future. Make sure to leave your questions and comments below. We’d love to hear how you create personality within your brand. Note: In this video I talk mainly about the names of your business, however, please note that developing branding is much more than simply your name. Building brand personality is routed in everything you do from colors, headlines, images, mascots, customer service emails, etc. It's important to have your brand personality brought through in everything you do (not just your name). [editor's note: this post was made before SEOmoz rebranded to Moz] Additional Great Resources on Branding: Why Building an Inspiring Brand Is Critical to Your Success Whiteboard Friday - The Renewed Value of Branding 15 Businesses to Admire for Consistent, Stellar Branding How To Brand Your SEO Agency Transcription: \"Don't attempt to check your dial. I am actually, in fact, not Rand Fishkin. My name is Luke Summerfield and I'm the Inbound Marketing Specialist at Savvy Panda and Master Inbound. We're actually coming today from the land of beer and brats, Milwaukee, Wisconsin. I'm here to talk to you today about a concept that's been on my mind for a number of years now, and I think it's coming through a lot more in the inbound marketing industry as we move through the future. That concept is brand personality. I think there's so many brands that are just stuck, that are completely non-memorable, that really don't come across, and just don't stick. Today, we're going to try and explain why that is and how you can have that not happen to yourbrand. This is a pretty common SEO . . . I'm going to pick on the marketing brands a little bit here, pretty typical SEO company. We got Top SEO, we have Xcel Marketing, and they've got a little creative with putting the big X there. We have Connexion Technologies. You know what these all sound like to me? These all sound like this guy. This is John Doe. John Doe's the guy you meet at the party that says, \"My name's John Doe,\" and he just sits there and really doesn't connect or talk, so you end up walking away and talking to another group. That's not going to be the person that you're going to remember six months, one year, two years down the road, and that's what all these brands are. These two are actually fictitious brands. If they're actually out there in the Moz world, if there actually is a Top SEO or Xcel Marketing, I apologize, but maybe this is a time to talk about rebranding. Connexion Technologies actually is or was a real brand. That's what Savvy Panda's brand used to be. Probably about four years ago, I spearheaded a process of rebranding for the agency, and that's why a lot of this has come forth. I've seen how to successfully do this, and I want to try and share some of that with you. Why would anyone want to create a brand? Why would anyone want to create a brand personality, I should say? It's not all for kicks-and-giggles; it builds relationships with a potential customer and with just your audience. The reason is that when you meet someone, you don't want to meet this John Doe guy. This is the guy that you meet, and really, you're like, \"Okay. I got to get out of here and go talk to someone more interesting.\" It opens the door and invites people in to start talking, to start developing that relationship. Ultimately what that does, is that's the first piece of the puzzle for developing trust, and trust is so huge. Trust is huge for marketing, it's huge for sales, and going forward in the future it's going to be really huge. This is really important for your sales team. If you want a great book, Chris Brogan, if you haven't read his book, 'The Trust Agents', that's a really great book to read on that. Next, it helps people connect. Again, going back to Chris Brogan, I just finished his book 'The Impact Equation', and in there he talks about how he always references Dungeons and Dragons in his blog. The thing is there's a small part of his audience that can relate to that. There's a small part of his audience that connects with him because of that. That's what starts building, again, builds that relationship with that connection. People can hear what you're doing, understand your humor, and understand what you're talking about. Next, community: Community is huge, and this is one of the things that everyone in the marketing world is talking about how important community's going to be in the future. Without a strong brand personality, I think it's going to be a lot harder for some of these brands to start creating a community around their ideas and around their messaging. I know Jen from SEOmoz, the Community Manager here, has some really great webinars. If you're more interested in how to actually build the community, I'm sure she talks all about it in those. Check those out in the Mozinar section. Lastly, fun: Everyone wants to have fun. No one wants to sit at work and work, and just not have any fun. This is a great way; having fun things and having a brand personality is a great excuse to have some fun; to be posting funny pictures, to be creating events that really just don't make any sense other than you just want to do it to have fun and build some brand personality. How many Harlem Shake videos came out right after that just because it was something quirky and fun to do? Those types of things are fun, not only for your fans, but also for your employees. Ultimately, who doesn't like to have fun and have happy employees? All of this is great. This is great stuff, but how does this relate to business? The hard part is that it really does not have any set key metrics that say, \"If we build a brand personality, that's going to lead to X-amount of sales.\" I think that's maybe one of the reasons that brand personality isn't on the top of people's priority lists, and maybe really isn't a focus. It does; indirectly is does. Let me get on this side so you can see. Indirectly it does. It will, ultimately, give you a competitive advantage. Think about it; if you are in a bucket locally with a handful of other competitors and you're establishing all of this stuff: The relationship, that trust, that connection, and none of your competitors are, guess which company is going to stand out and guess which company is going to be the first one they want to talk to when they start taking to different agencies? Yours. Ultimately, it will give you a competitive advantage, as long as you're really doing a good job of it. Next, it'll help with sales. As we talked about earlier, how important . . . to any of Mozers out there that do anything with sales, you know how important sales are then how important trust is with sales. Having that trust and having that relationship and the connection built on the onset, way before they even start talking to you about buying your product, is going to make the sales process not only shorter but a lot easier.< Lastly, this is one of the key things that you need to have in order to build brand advocates. We are huge at Savvy Panda about building brand advocates and getting people to really just eat, sleep, breathe, and just bleed your brand. I feel it's really important to have a strong brand personality in order to connect enough with the customers to build and convert them into advocates. This is all great stuff. We've established why we want to do it. We established how that affects our business, but how do we actually do this thing called brand personality? I'm going to just cover a few of them; I'm not going in huge depth with this. If you look below this video, I'm going to have some good resources and additional links you can read about for how to do this a little bit more. The first key thing is to be transparent, to show transparency not only in your day-to-day, like snapping photos around the office, taking videos, showing people events you go to, things like that, but I think just being transparent in your business itself. I love that SEOmoz showed all about when they were trying to raise capital and once they did, how much their raised. How their sales had been going before that. I think showing part of the business makes you feel like you're part of the business, at least a little bit if you're in that community. Then that also translates into their brand personality of just trusting their clients and trusting their audience with that information. Next, be a little quirky and fun. As we talked about, it's all about having fun. Granted, you have to tailor this for your personas. If you are a financial industry or you're in the law firm industry, you might not be posting hilarious memes or football blooper reels, or whatever. Tailor to your personas, but find ways to find some quirky things that you can do to have fun. For instance, I introduce myself from The Land of Brats and Beer in Milwaukee, Wisconsin, and I got my little picture of Roger here sipping on a beer and eating his brat. It builds a little personality about where I come from and who I am; little quirky things you can do like that. I love how SEOmoz always refers to their headquarters as The MozPlex and all their audience are The Mozers; those kind of little, fun things and all the fun little graphics they do with Roger are really great ways to build personality. Next, have your employees and encourage your employees to develop personal brands. Gary Vaynerchuk's book 'Crush It' is all about building personal brands. I think even as an employee, you can build personal brands, and HubSpot is actually doing an awesome job of this. They require all of their employees to have their own personal blogs, to blog about anything they want personalized. I've really developed some deep relationships with some of the people and deep knowledge of some of the people we work with at HubSpot because I read their blogs, because I connect with them, and all of that ties into the personality that I see behind HubSpot. Next, get out and about. We live in this world where we're sitting on a computer typing for 8 hours a day, 9 hours a day, 10 hours a day. I think sometimes we forget there's an actual, physical world when you walk out of that office. Get out and find opportunities to build personality and connect outside. That could be things like getting involved in a user group or starting a user group. We're the user group for both Joomla CMS and for HubSpot here in Milwaukee, and it's great. We get to connect with a ton of different people. It could be things like speaking at events or going to events. It could be . . . even if you're in the virtual world, hosting a webinar. Those types of things gets you in front of someone and physically talking to them, which again, bring across that brand personality. Yes, it's you, but you are part of your brand personality, ultimately. Next, build socially. Again, Gary Vaynerchuk's book 'The Thank You Economy'; if you haven't read it, it's awesome. He talks all about how to use social network to connect with people and to show you really care. Doing those types of things are really going to help with developing that brand personality: Talking to people, interacting with them. Not on a business, I don't want to shove sales messages in your face. See what they're doing, see what they're about, and connect with them. You see them in Colorado and go, \"I was in Colorado last year. Make sure you check out this great restaurant.\" You won't see Pepsi saying that to any of their people. Maybe, I don't know, I haven't been on the Pepsi Twitter lately. You won't see a lot of big, corporate, faceless brands doing that. If you can do it, that's where you can start developing that personality and that relationship. Lastly, show and be yourself. That's exactly why I decided to make this a video, because I could write all day long, but I think videos, I think pictures, I think those types of things do such an awesome job of bringing across someone's personality and really telling you who they are, what kind of humor they have, and I think it helps you connect. I'd really encourage you to start getting more into video, to get more into pictures, and just show who you really are. If you put on a suit and you're not a suit kind of guy, and you're trying to act that role, people's BS meters are way up here and they're going to know that that's not who you are. You go to a business conference and everyone's in these suit and ties and talking a certain way. If that's how you are, great, but if you're not, don't try and act that part. Ultimately, your audience and your customers are human and they just want to connect with other humans, so be human and be yourself. Hopefully, you got some good ideas on this. You can take a step back and look at your brand and the brands you work with, and try and see how you can make some of these concepts come about. What I want you to do is I want you to go down into the Comment section and let me know. If you're a brand that's done a really great job building brand personality, let me know what you done: What are some things that have worked? What are some things that have not worked? What are some quirky, fun things you did that you didn't think it was going to be anything, all of the sudden everyone loved it? Do that. Next, also in the Comments section, tell me brands that are doing a great job. We all know SEOmoz is phenomenal and all this, but there's a million other brands that do a really great job. I love MailChimp. MailChimp does another really great way; great brand personality. Go down there and tell us about some brand that you know of that are doing this great job. Again, thank you. Hopefully, I'll see you on another Youmoz Video Whiteboard. \" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Cheers to Building Brand Personality [whiteboard]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Cheers to Building Brand Personality [whiteboard]"
    },
    {
      "level": "H3",
      "text": "Additional Great Resources on Branding:"
    },
    {
      "level": "H3",
      "text": "Transcription:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Luke Summerfield\n          \n            Luke Summerfield"
}