{
  "url": "https://moz.com/blog/chicks-dont-dig-analytics-so-dont-toss-out-the-tv-just-yet",
  "slug": "chicks-dont-dig-analytics-so-dont-toss-out-the-tv-just-yet",
  "title": "Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There was a time, can't quite remember when, that I stopped watching TV and started watching web analytics.It may sound sad and most of my friends have not been backward in telling me so.But I see the bright side. The Analytics tickle me pink. I can watch them all day long. As I grow more confident…",
  "content": "Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet SEO Analytics S By: Stuart McIlreavy March 25, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Stuart McIlreavy March 25, 2008 Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There was a time (I can't quite remember when) that I stopped watching TV and started watching web analytics. It may sound sad, and most of my friends have not been backward in telling me so. But I see the bright side. The analytics tickle me pink. I can watch them all day long. As I grow more confident in my passion, I'm starting to tell people that they should be doing the same. Let me give you three good reasons to turn off your TV and see what's happening in your analytics account: There is always something good on analytics. The time I lost interest in TV is about the time when I lost the ability to tell the difference between one legal drama and the other. All the same really, isn't it? Web analytics are never the same. Getting the chance to ply through a new client's analytics report is a treat every time. New graphs to plot. New conclusions to draw. More advice to give. Your TV is shallow. Web analytics are a deep and bottomless pit of meaningful metrics. I've been watching my analytics for years now, but still haven't got to the bottom of it all. It seems that every other week I stumble upon another meaningful metric that can enlighten and empower my corporate counterparts. Its not hard to find something new on analytics. Web analytics are developing so fast and changing all the time. I turn on the analytics and there is always something new. Last week I was chuffed to find industry standard benchmarking. Then I went to see what was on TV. Another legal drama. Boring! I'm not going to try and convince you it's not a hard road to walk down. There is a downside...but only one seriously worth mentioning: Chicks don't dig analytics! I first discovered this when I was at a party and decided to check my analytics report. A girl looked at me in horror and asked \"What are you doing?\" \"Just checking my traffic reports,\" I replied. \"Yeah, like that's normal,\" she said sarcastically and walked off, disinterested. Chicks at parties don’t want to talk analytics, and all of my analytics-inspired pick up lines go down like a brick at the cocktail bar. I've decided to keep the Analytics fetish for in between office hours and during TV time. One day chicks will see the sexy side of analytics like I do, like Avinash does. And that day will be a marked turning point in the love lives of SEOs everywhere. This is one SEO, patiently waiting. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stuart McIlreavy\n          \n            Stuart McIlreavy"
}