{
  "url": "https://moz.com/blog/christmas-is-coming-time-to-make-your-wallets-fat",
  "slug": "christmas-is-coming-time-to-make-your-wallets-fat",
  "title": "Christmas Is Coming - Time To Make Your Wallets Fat! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Christmas period can be make-or-break for many in the retail business, regardless of whether they are online only, or also have a presence on the high street. As marketers, we should all see it as our duty to try and have as much of a positive impact at this time of the year for our clients or…",
  "content": "Christmas Is Coming - Time To Make Your Wallets Fat! Online Advertising By: Jonathan Walker November 15, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jonathan Walker November 15, 2012 Christmas Is Coming - Time To Make Your Wallets Fat! Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Christmas period can be make-or-break for many in the retail business, regardless of whether they are online only, or also have a presence on the high street. As marketers, we should all see it as our duty to try and have as much of a positive impact at this time of the year for our clients or our bosses and by encompassing as many forms of Online Marketing into your strategy as possible, you’ll have the best chance of doing so. The Christmas Purchase Process I’m sure there are plenty of articles that go into all levels of depth about the mindset of a Christmas shopper, however to break it down simply: Researchers Buyers and Panic Buyers Sale Researchers Sale Buyers Researchers When? From late October. The first stage is the research stage where well prepared shoppers are deciding upon what they would like to purchase. The chances of rushing these people into purchasing are slim, however it is important to get these potential shoppers familiar with your website and brand. Buyers and Panic Buyers When? Late November to the last possible moment! These shoppers have researched and or decided what they want to buy, now they are looking to do so either at the best price, or somewhere they are familiar with and trust. Panic Purchasers have left it a little bit late in the day to buy presents, however they are keen to buy and if you can make it easy for them, they will be glad to purchase from you! Sale Researchers and Sale Buyers When? Before Christmas Day to mid-January. During the run up to Christmas, many shoppers will take the time to research products they are interested in, hoping that they will be available at a cheaper price during the Sale Period. Sale Purchasers tend to have similar traits to Purchasers and Panic Purchasers – in an ideal world they’ll purchase from somewhere they are familiar with and trust. So how do you capture these shoppers? Pay Per Click Great for targeting: Buyers Pay Per Click (i.e Adwords) is an amazing way of increasing the amount of traffic you can get to your website, if you have the budget, you can have the visitors! Increasing your budget at the times when people are interested in purchasing makes perfect sense. In terms of keywords, adding terms such as “buy” and “gifts” can bring you cheaper, yet more targeted clicks. If you're not keen on paying to help people research their products, add terms such as “review”, “best”, “advice” and “top” to your negative keyword list. If you are interested in trying to leverage the researchers to your website, using the display network can be very effective, just image having your advert display on the same page where your products are being reviewed or recommended? That can be pretty powerful, using remarketing can also help “bring back” those who had found, but not purchased from your website. In terms of Ad copy, creating Christmas themed ad text also works well as it taps into the mindset of searchers. If you also have a high street presence, create a separate mobile campaign targeting customers in your area. Imagine a shopper looking on their phone and finding you, they see you are close by and that they can call you instantly – that can be a great way of making sales. Top tips Depending on your product range, use the display network during the research stage, also incorporate remarketing Increase your budget during the buying and panic buying stage Create Christmas orientated ads If you have a high street store, create a separate mobile ad campaign, use the “click to call” and Location ad extensions. Organic Great For Targeting: Researchers, Buyers The amount of real estate the organic search results has declined a lot over the past few years, the “(not provided)” can also make attributing sales and leads incredibly difficult. That being said there are many business’ that rely on organic traffic and there are still plenty of visitors to be gained! Google craves content, as do shoppers in the research stage. Give them both what they want – create quality content – give reviews and insights. I’d even suggest going one step further and creating “best” and “top” lists of products on your blog, as well as dedicated review posts. Get Creative! If you can make video content and upload it to your youtube channel and your video should also appear in the search results. I’d always suggest that if your website is going to have a “Christmas offer” or “Christmas gifts” section, have it there permanently (just remove it from the main navigation after the festive period is over, or you could always 302 redirect them to the homepage). You can build up authority on these pages by earning links & social shares to them. Then the next year, you won’t be starting from scratch from an organic perspective. Top tips Create permanent pages for your Christmas gifts and offers – get links and social shares Create unique content for your product pages Create useful blog content – reviews & top lists Create video content E-Mail Marketing Great for targeting: Existing Customers Bizarrely I find that e-mail marketing is something that is horribly under used and underutilised by many business who have an extensive database of customer details. E-mail marketing can prove to be really powerful and it's pretty inexpensive to add to your Online Marketing arsenal. Top Tips Use festive graphics – tap into their festive emotions! Send a mailshot aimed at the researchers – tell them what you have to offer, list your recommendations Offer a festive discount – these are existing customers (or have expressed an interest in your brand), they are quite likely to shop with you, give them something to clinch the sale! Target the panic buyers – tell them when they can order and what delivery dates to expect Send a sale based mailshot, again offer additional discount. Social Selling products (and more so doing it effectively) is a whole topic in itself, so I’m not going to even attempt to cover it! However from a festive perspective, change your profile pictures & backgrounds to reflect the season. This is likely to be the time that you will get asked a lot more questions from potential customers so keep on top of your social presences, respond quickly and be helpful! Top Tips Link to any useful content you have created, i.e reviews & top lists Respond to customers (and potential customers) promptly Remind customers of last order dates and delivery options Use & promote discount voucher codes Your Website! Great For: Generating Sales and Enquires Bidding on keywords or sending fancy e-mails may not be enough to ensure that you make a sale. Increasing the amount of sales your website generates (CRO) is an art form itself, but basic principles can be applied to just about every website which in turn can significantly increase your chances of making a sale. The first would be to show that your website is in the spirit of the festive period, make a few graphical changes to your website, for example many companies will decorate their logos and add call to actions using festive colours or graphics. You want to be able to answer as many questions shoppers may have as you possibly can with your website, but failing that include your phone number, make it bold and in an obvious place (the top right hand side of the page is quite common!). If you also have a high street presence, include your shops address and opening days and hours. Make your contact forms easy to find, concise and most importantly – respond quickly! One of the main concerns panic buyers will have when looking to order is “will this arrive in time?!” so do them and yourself a favour: Tell them! Make it glaringly easy to find the last date a shopper can order from you before Christmas and what the delivery options (and costs) are? Many websites will include a “countdown to last order” message on their website, just so shoppers won’t have to double check their calendar! Top Tips Include a phone number Include your stores address & opening hours Include last delivery/order dates Add clear call to actions Add a Christmas “theme” to your website Tell customers about any discount codes you have, even pre-populate the discount voucher text area! Measuring So if you have convinced your client or boss (or yourself!) that investing in more Online marketing is a good idea you’ll need to be prove that it was! How can you do this? Well any sales via the website can be attributed fairly easily (apart from our favourite “(not provided)” keyword!), measuring a value per enquiry can be tricky and when a high street store is also entered into the equation, things can get even harder to assign a value to! For enquiries you’ll need to work out an average value for each enquiry received. In basic maths, if your average sale value is £100, and historically around 1 in 5 enquires result in a sale, each enquiry could be given a value of perceived £20. Using similar logic, if the average sale value is £100, and historically around 1 in 4 phone calls received result in a sale, then a phone call could be given a perceived value of £25. The Adwords call extension keeps a track of calls being made, there is also plenty of ways of displaying separate phone numbers to different users, depending on how they arrived at the website if you really wanted to know where callers arrived from. It gets difficult for you to prove that your Online Marketing was responsible for an increase in customers finding you online and then purchasing from a store in the high street. Realistically you can’t, unless a customer is asked as they walk through the door, however let’s look at the bigger picture, if your client or boss is making more sales then they should be happy! More and more stores are looking to blur the lines between their online and high street offerings, for example the other week Argos revealed positive results using their website to drive customers to their stores. So there you have it, I hope I’ve given you plenty of ideas and maybe even some inspiration for your Christmas Online marketing campaigns. The clock is ticking though – get strategising! Christmas Image Credit: George Eastman House This article is written by Jonathan Walker an Online Marketer from Cardiff with over six years industry experience. Jonathan leads the Online Marketing services that Cardiff based Digital Agency Spindogs offer.Jonathan on Twitter Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Christmas Is Coming - Time To Make Your Wallets Fat!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Christmas Is Coming - Time To Make Your Wallets Fat!"
    },
    {
      "level": "H2",
      "text": "The Christmas Purchase Process"
    },
    {
      "level": "H3",
      "text": "Researchers"
    },
    {
      "level": "H3",
      "text": "Buyers and Panic Buyers"
    },
    {
      "level": "H3",
      "text": "Sale Researchers and Sale Buyers"
    },
    {
      "level": "H2",
      "text": "Pay Per Click"
    },
    {
      "level": "H2",
      "text": "Organic"
    },
    {
      "level": "H2",
      "text": "E-Mail Marketing"
    },
    {
      "level": "H2",
      "text": "Social"
    },
    {
      "level": "H2",
      "text": "Your Website!"
    },
    {
      "level": "H2",
      "text": "Measuring"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Walker\n          \n            Jonathan Walker\n          \n            Jonathan Walker"
}