{
  "url": "https://moz.com/blog/christopher-walken-escapes-sandboxing-in-under-2-weeks",
  "slug": "christopher-walken-escapes-sandboxing-in-under-2-weeks",
  "title": "Christopher Walken Escapes Sandboxing in Under 2 Weeks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My understanding is that the website Walken2008 is a joke and nothing more. However, it has the distinct privilege of being the fastest site I've ever observed coming out of Google's notorious sandbox. Despite being r...",
  "content": "Christopher Walken Escapes Sandboxing in Under 2 Weeks Blogging By: Rand Fishkin August 23, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 23, 2005 Christopher Walken Escapes Sandboxing in Under 2 Weeks Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My understanding is that the website Walken2008 is a joke and nothing more. However, it has the distinct privilege of being the fastest site I've ever observed coming out of Google's notorious sandbox. Despite being registered only 12 days ago - Aug. 11 according to records, the site is now ranking #3 for the remarkably competitive term - Christopher Walken. Although I don't have the screenshots to prove it, I personally checked the site last week when it came out and noticed it had been boxed - it wasn't ranking in the top 100 for Christopher Walken, and was only page two for \"Walken 2008\" at Google, while being top 5 across the board at the other SEs and for the allin searches (for both phrase variations). Naturally, a dozen or more sites linking to it were in front. The number of news items on the site probably pushed it out. Another interesting note is that the Walken site was previously hosted at www.walkenforpres.com, which still shows in the Google results and hasn't been 301'd to the new domain... Very odd indeed. I think this can be good circumstantial evidence that Google really does live up to their promise of \"releasing\" sites that are \"topical phenomena\". I'm, naturally, interested in watching more sites that follow this pattern to see if and for how long they too are boxed. To that end, I'm working on a list of sites to monitor over the next few weeks to watch their performance in the SERPs and how Google handles them. With a little luck, no one from the 'plex will see this post. Here's my current short list: MaverickMums.co.uk - They recently launched, and should gain quite a few links. They're currently not in the top 400 for the title tag \"Buy and sell nearly new child & baby things\" and even in quotes, they rank considerably behind their own directory listings._ ActionProfiles.com - Which hasn't done a good job of SEO in any sense, but will probably receive a high number of on-topic links regardless thanks to its connections and content. I'm watching them for the phrase \"Action Profiles\" for which they're currently #1 at MSN and at GG for allinanchor. I don't think they're \"boxed\" yet, but I suspect they might be soon. If you have any good ideas to contribute, please post them below and I'll add the to the watchlist. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Christopher Walken Escapes Sandboxing in Under 2 Weeks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Christopher Walken Escapes Sandboxing in Under 2 Weeks"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}