{
  "url": "https://moz.com/blog/clearing-up-digital-marketing-confusion-among-smbs",
  "slug": "clearing-up-digital-marketing-confusion-among-smbs",
  "title": "Clearing Up Digital Marketing Confusion Among SMBs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "42% of small business owners said their top priority for using Facebook was customer acquisition. It struck me that business owners might have a similarly-large misconception when it comes to their expectations of loads of other digital marketing options, so I came up with a graphic to help them…",
  "content": "Clearing Up Digital Marketing Confusion Among SMBs Local SEO By: David Mihm December 19, 2012 Table of Contents Copied! By: David Mihm December 19, 2012 Clearing Up Digital Marketing Confusion Among SMBs Local SEO Following up on last week’s post inspired by ILM West, one of the most striking statistics presented by BIA Kelsey’s analysts in L.A. a couple weeks ago was this one: 42% of small business owners said their top priority for using Facebook was customer acquisition. In the audience that day, I allowed myself a discreet LOL and shook my head. Seriously? I can’t remember ever purchasing anything on Facebook after reading a comment in my news feed from my friends or even directly from businesses that I’ve liked. As a digital marketer, I’m usually a bit of an outlier when it comes to consumer behavior, but according to a Reuters/Ipsos survey earlier this year, that behavior puts me in an overwhelming majority of Facebook users. Even taking ads into account, only 20% of the population has ever bought anything as a result of seeing it on Facebook. The ever-voluble-and-astute Mike Blumenthal beat me to the punch somewhat with his column highlighting this disconnect between business owners and consumers. Citing a client-commissioned study of consumer behavior in searching for a lawyer, forget 20% -- only 2% think of any social network when they're looking to hire an attorney. Let alone the singular network of Facebook. While Facebook has recently started to offer an extremely efficient two-step ad product to help business owners get more Likes, and future products related to Nearby might be extremely compelling for SMB’s, it’s hard to conceptualize Facebook in its current iteration as a primarily transactional platform. It struck me that business owners might have a similarly large misconception when it comes to their expectations of loads of other digital marketing options. For instance, although most business owners who run daily deals expect a fire hose of new customers, one frequently-cited study from Rice and Cornell Universities finds that 78% of daily deal purchasers were already customers of the business from which they purchased the deal. And while mobile apps are all the rage right now, few business owners realize that just having an app doesn’t mean it will automatically pop up on Apple or Android’s recommended list to be seen by oodles of new prospects. The linked graphic in the paragraph above attempts to help business owners prioritize the marketing strategies they choose based largely on the time-vs.-money spectrum. If you work with small businesses, though, perhaps it would be helpful to take one step back and first ask them about their primary goals for their digital marketing campaigns, whether or not you offer the services to meet those goals. My hope is that this follow-up graphic (below) makes that discussion a whole lot easier for you as a marketer. And if you're a small business owner trying to figure this stuff out for yourself, I hope it helps you prioritize your marketing efforts based on your higher-level business goals. What do you guys think? Are you more or less confused about digital marketing than you were before? Do you have any suggestions for how to improve the graphic (besides fixing the title so it doesn't end with a preposition)? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Clearing Up Digital Marketing Confusion Among SMBs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Clearing Up Digital Marketing Confusion Among SMBs"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}