{
  "url": "https://moz.com/blog/clever-buttons",
  "slug": "clever-buttons",
  "title": "Clever Buttons - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I like the idea behind this button site. From buttons for sushi and coffee to wishlists, geographies and politics, they've got a very wide selection. Take this concept, apply it to other graphics, text, content, games, programs, etc. and you've go...",
  "content": "Clever Buttons Design By: Rand Fishkin February 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 11, 2006 Clever Buttons Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I like the idea behind this button site. From buttons for sushi and coffee to wishlists, geographies and politics, they've got a very wide selection. Take this concept, apply it to other graphics, text, content, games, programs, etc. and you've got an instant throttlehold on your market. After all, once you know about this site, why would ever go anywhere else for blog buttons? That's exactly the question we all want applied to our sites. Thanks Taylor - great work. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Clever Buttons"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Clever Buttons"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}