{
  "url": "https://moz.com/blog/click-tracking-tools-101",
  "slug": "click-tracking-tools-101",
  "title": "Click tracking tools 101 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Both Rand and Egol have recently discussed about MyBlogLog, and I am about to joing the group. I admit that MyBlogLog is nice tool, but for professional marketing specialist there are loads of similar, or even more advanced tools avai...",
  "content": "Click tracking tools 101 Design M By: mozUser1469147917838 October 31, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 October 31, 2005 Click tracking tools 101 Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Both Rand and Egol have recently discussed about MyBlogLog, and I am about to joing the group. I admit that MyBlogLog is nice tool, but for professional marketing specialist there are loads of similar, or even more advanced tools available. After all, click tracking is something large eCommerce sites have used from the day one. Most advanced log analysis tools like Urchin have several inbuilt or add-on features for click path analysis. Below are some standalone tools and building blocks I find worth trying: ClickTracks is one amazing out-of-the-package tool for click track analysis. _ Do-it-yourself people will love phpOpenTracker combined with GraphViz - you can get some amazingly nice stats when you combine these two. _ If you prefer to build a totally homemade solution, then you might want to try Apache mod_tracking - a personal favourite of mine. The common nominator for all click tracking tools is that they provide a change to view detailed demographics about user behaviour and usability within a site. Something many web site owners, developers and marketing should focus - after all, getting traffic is the easy part. Making them stay and buy on site is the hard one. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Click tracking tools 101"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Click tracking tools 101"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}