{
  "url": "https://moz.com/blog/click-here-seo",
  "slug": "click-here-seo",
  "title": "Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The past year, we've seen a strange trend develop in the world of SEO: The rise of the “generic link.” Generic links are bland phrases that avoid using keywords that search engines use to determine the context of what you are linking to. Google’s official SEO Starter Guide actually discourages…",
  "content": "Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links Link Building By: Cyrus Shepard February 12, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard February 12, 2013 Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You may also like:Anchor Text Best Practices for SEOShould I use \"click here\" for links?How Google Values Links Over the past year, we've seen a strange trend develop in the world of SEO: the rise of the “generic link.” Generic links are bland phrases that avoid using keywords that search engines use to determine the context of what you are linking to. These include links like: “Visit website” “Read more” “Useful site” And, of course, “click here” Google’s official SEO Starter Guide actually discourages webmasters from using generic links. Google published this guide in 2010. Is it still relevant today? Why some SEOs use generic links After Google rolled out their Penguin update and over-optimization penalties in 2012, many SEOs discovered that too much exact-match anchor text was now a bad thing. Research suggests that successful backlink profiles actually contained a wide variety of anchor text including exact match, partial match, URL links, and even nofollow links. To compensate for over-optimized backlink profiles, SEOs started to “balance” their link profiles with generic anchors like “click here.” For some, the trick seemed to work, a little. Recently, my wife’s site was attacked by a black hat spambot. Take a look at the bot's link distribution: The profile was exactly 30% generic links! Yes, it’s a huge improvement on using all keyword-rich anchors, but this also creates obvious patterns that any search engine could easily sniff out. It’s also evident these links were produced at scale in a non-editorial way. As a result, these bots must build 1,000s of links to only rank a few days at a time. We can do better Aside from issues of usability, the reason Google advises folks to use descriptive words when linking is because this passes relevancy signals to the page you link to. If you link to this page with the phrase \"SEO\", search engines may determine this page is about SEO, and rank it higher in search results for that term. In fact, there's evidence through various patent filings, and the experience of countless webmasters, that links using generic or off-topic anchor text pass potentially much less value than descriptive links. - Bill Slawski, 10 Most Important SEO Patents, Part 5 Let's be clear: Google does likely devalue over-optimized anchor text, but there is no evidence anywhere of Google penalizing a website for not having enough generic “click here” links. Instead, we should seek out links that enhance context and usability for not only our readers, but search engines as well. The best links are the ones where you don't control the anchor text, but in cases where you do control the anchor text, strive for variety. 1. Related text and Co-occurrence links Instead of requiring exact match anchor text to achieve rankings, Google has proposed many methods of passing value through anchor text that don't require the exact keyword at all. One of these methods uses the idea of co-occurrence, documented here by Bill Slawski. Put simply, search engines may judge relevance not only on the anchor phrase, but also on the \"related phrases\" found in both documents. In Google's own patent example, the anchor phrase \"Australian Shepard\" is related to several other words: Even though the second URL doesn't contain the words \"Australian Shepard,\" it may still rank for this term if there are enough related phrases present. This helps closely related pages to pass more ranking relevance, while weakening unrelated anchor text (coincidentally, a lack of related phrases is how search engines fight Google Bombs). 2. Party at Synonym City Search for \"funny pics\" and search engines return results for \"funny photos\" and \"funny pictures\" instead. This gives us several possible alternatives to exact-match links. One great way to find synonyms is through using Google's tilde (~) operator. The tilde tells Google to \"search for pages that are synonyms or similar to the term that follows.\" When combined with other operators, such as the negative (-), this gives you a powerful keyword research tool. In the example above, the search query \"~inexpensive -inexpensive\" returns \"low cost\", \"cheap,\" and \"affordable.\" All are synonyms for inexpensive. Use synonyms in your anchor text for greater meaning. 3. Partial match – Variation for the reader A partial match anchor uses at least one of your main keywords, without using the whole phrase. Matt Cutts gives a hilariously bad example of how not to construct text. In short, what he describes is... Consider this anchor text: “Best Car Accident Law Firm Fort Worth.” If we saw this on a page, we would cringe in embarrassment for the SEO. Natural anchor text is not stuffed with keywords, but is instead useful for the reader while accurately describing what the text links to. Better, more appropriate partial match anchors might include: “… meet Ben Shallot, an experienced attorney running Fort Worth’s most recognized law firm. \"....the group of attorneys known best for their work with uninsured auto accidents. \"...says he's leaving his firm after a disagreement with his partners. Like anything else, partial match anchors can be abused quickly. Use with care. 4. Company names and brands Company and branded names make great links when called up. People can link to SEOmoz, Molly Moon's Ice Cream, or Lava Lamp all day long! However, be careful when your business name matches highly commercial anchor text, such as \"Los Angeles Flowers,\" for example. In this case, there's almost no line between branded anchor text and over-optimized, exact-match anchor text. This might send confusing mixed signals to search engines - as if you're trying to game the system. If you're a smaller company without much branded visibility, it might be best to stick to other methods until you can build your brand credibility. 5. Get personal with names Dan Shure provides the next tip from his NoBoard SEO series: link to people. People's names (like your CEO, for instance) are rarely overused. Dan suggests attracting named-based links by creating strong \"about\" and profile pages for people in your company. Dan's best quote: \"People like to link to people.\" 6. URL links In general, URLs are NOT ideal anchor texts. They're non-descriptive, clumsy to write, and pass very few relevancy signals to search engines. That said, it's possible to use URLs for perfectly normal reasons, such as when you describe changing a website address, i.e. \"The new URL is https://moz.com.\" URL links don't always include the full address: www.seomoz.org seomoz.org/blog/top-tips seomoz.org Although they don't pass few relevancy signals, URL links do offer marginally more value than generic anchors, so are offered here as a measure of last resort. 7. Link for the most important person - The reader This post offers a number of linking examples, but for the most part the links flow as a natural part of the text, without artificial manipulation. The #1 priority of good content is not trying to outsmart the search engines, but creating usefulness and usability. Shortcuts taken by scaling and repeating the same anchors over and over – even when they’re partial match or otherwise - are bound to get you in trouble. Instead, craft each and every link you write to be as unique as the content holding it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links"
    },
    {
      "level": "H3",
      "text": "Why some SEOs use generic links"
    },
    {
      "level": "H3",
      "text": "We can do better"
    },
    {
      "level": "H2",
      "text": "1. Related text and Co-occurrence links"
    },
    {
      "level": "H2",
      "text": "2. Party at Synonym City"
    },
    {
      "level": "H2",
      "text": "3. Partial match – Variation for the reader"
    },
    {
      "level": "H2",
      "text": "4. Company names and brands"
    },
    {
      "level": "H2",
      "text": "5. Get personal with names"
    },
    {
      "level": "H2",
      "text": "6. URL links"
    },
    {
      "level": "H2",
      "text": "7. Link for the most important person - The reader"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}