{
  "url": "https://moz.com/blog/client-seo-maturity",
  "slug": "client-seo-maturity",
  "title": "SEO Maturity: Evaluating Client Capabilities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Clients aren't always knowledgeable about SEO, and that lack of understanding can get in the way. In this Whiteboard Friday, learn how to score your clients' search maturity and start moving past what's keeping you from doing your best work.",
  "content": "SEO Maturity: Evaluating Client Capabilities Whiteboard Friday By: Heather Physioc September 14, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Heather Physioc September 14, 2018 SEO Maturity: Evaluating Client Capabilities Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Clients aren't always knowledgeable about SEO. That lack of understanding can result in roadblocks and delay the work you're trying to accomplish, but knowing your client's level of SEO maturity can help. In today's Whiteboard Friday, we welcome the brilliant Heather Physioc to expound upon the maturity models she's developed to help you diagnose your client's search maturity and remove blockers to your success. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription What up, Moz fans? My name is Heather Physioc. I'm Director of the Discoverability Group at VML. We are in Kansas City. Global ad agency headquartered right in the middle of the map. Today we're going to talk about how to diagnose the maturity of your SEO client. I don't mean emotional maturity. I mean maturity as it pertains to SEO capabilities, their ability to do the work, as well as their organizational search program maturity. Now a lot of times when a client signs a contract with us, we make the assumption that they're knowledgeable, they're motivated, they're bought in to do the search work. So we go dumping all these recommendations in their lap, and we're trucking full speed ahead. But then we're surprised when we start hitting blockers and the work doesn't go live. I actually surveyed over 140 of our colleagues in the search industry, and they reported running into blockers, like low prioritization and buy-in for the work, limited technical resources for developers or budgeting for copywriters, low advocacy, high turnover, and any number of different things that stand in the way. I didn't just ask about the problems. I asked about the solutions, and one of the tools that came out of that was the ability to diagnose the client's maturity. So a maturity model is intended to evaluate an organization's capability to continuously evolve in a practice. The point, the purpose of this is to understand where they stand today, where they want to go, and the steps it's going to take to get there. The SEO Capabilities matrix Let's talk about the SEO capabilities first, the technical ability to do the job. Harmful On the low end of the scale, a client may be engaging in spammy, outdated, or harmful SEO practices that are doing more harm than good. Tactical From there, they may be tactical. They're doing some super basic SEO, think title tags and meta description tags, but nothing earth-shattering is happening here, and it's not very strategic or aligned to brand goals. Strategic From there, the brand moves into the strategic phase. They're starting to align the work to goals. They're starting to become a little more search savvy. They're getting beyond the titles and metas, and they're more thorough with the work. While good stuff is happening here, it's not too advanced, and it still tends to be pretty siloed from the other disciplines. Practice From there, the organization might move into a practice. Search is starting to become a way of life here. They're getting significantly more advanced in their work. They're starting to connect the dots between those different channels. They're using data in smarter ways to drive their search strategy. Culture Then from there, maybe they're at a level of culture for their SEO capabilities. So search here is starting to become a part of their marketing DNA. They're integrating across practices. They're doing cutting edge. They're testing and innovating and improving their SEO implementation, and they're looking for the next big thing. But these groups know that they have to continually evolve as the industry evolves. So we don't just look at their whole SEO program and figure out where the client goes on the map. ✓ Data-driven We actually break it down into a few pieces. First, data-driven. Is the organization using information and analytics and combining it with other sources even to make really smart marketing decisions? ✓ SEO for content Next is content. Are they doing any SEO for content at all? Are they implementing some SEO basics, but only during and after publication? Or are they using search data to actually drive their editorial calendar alongside other data inputs, like social listening or web analytics? ✓ Mobility From there, mobility. Do they have no mobile experience at all, or do they have a fully responsive and technically mobile friendly site, but they're not investing any more in that mobile optimization? Or are they a completely mobile-first mindset? Are they continuously iterating and improving in usability, speed, and content for their mobile users? ✓ Technical ability Beyond that, we could look at how technically savvy they are. Do they have a lot of broken stuff, or are they on top of monitoring and maintaining their technical health and accessibility? ✓ On-page/off-page SEO Then some standard SEO best practices here. Are they limited or advanced in on-page SEO, off-page SEO? ✓ Integrating across channels Are they integrating across channels and not having search live in a silo? ✓ Adopting new technology Are they adopting new technology as it pertains to search? Some clients have a very high appetite for this, but they chase after the shiny object. Others have a high appetite and a high tolerance for risk, and they're making hard choices about which new technology to invest in as it pertains to their search program. You may also want to customize this maturity model and include things like local search or international search or e-commerce. But this is a great place to start. So this does a very good job of choosing which projects to begin with for a client, but it doesn't really get to the heart of why our work isn't getting implemented. The Organizational Search Maturity matrix I developed a second maturity model, and this one is more traditional and you see it across other industries as well. But this one focuses on the search program inside the organization. This is the squishy organizational stuff. ✓ People This is people. Do they have the necessary talent within the organization or within their scope? That might not just mean SEOs. That means are they scoping appropriately for content and development needs? ✓ Process What about process? Are they actually using a defined and continuously improving process for the inclusion of search? Now I don't mean step-by-step best practices for implementing a title tag. This isn't instructions or a tutorial. This is a process for including organic search experts at the right moments in the right projects. ✓ Planning What about planning? A lot of times we find that clients are doing search very reactively and after the fact. We want to reach a point with an organization where it's preplanned, it's proactively included, and it's always aligned to brand, business, or campaign goals. ✓ Knowledge Next is knowledge. We know that this industry is complicated. There are a lot of moving pieces. We want to know how knowledgeable is the organization about search. That doesn't necessarily mean how to do SEO, but perhaps the importance or the impact or the outcomes of it. How committed are they to learning more through reading or trainings or conferences? At the very least, the organization they're hiring to do search needs to be extraordinarily knowledgeable about it. ✓ Capacity Then capacity. Do they have the prioritization within the organization? Are they budgeting appropriately? Do they have the resources and the means and the capacity to get the work done? Initial When we've evaluated a client against these criteria, we could find them in an initial phase where the program is very new, they're not doing any search at all... Repeatable ...to repeatable, meaning they're starting to include it, but it's not super cohesive yet. They're not enforcing the process. They don't have super dedicated resources just yet. Defined Up into defined, where they actually are documenting their process. It's continuing to iterate and improve. They're becoming more knowledgeable. They're dedicating more resources. They're prioritizing it better. Managed We can move up into managed, where that's continuing to improve even further... Optimized ...and into optimized. So again, this is where search programs are part of the organization's DNA. It's always included. They are always improving their process. They are maintaining or even increasing the talent that they have dedicated to the work. They're planning it smarter and better than ever before, and they have adequate capacity to keep iterating and growing in their search program. With that, the steps to complete this process and figure out where your client falls on either of these maturity models, I want to be clear is not a one-sided exercise. This is not a situation where you're just punching numbers into a spreadsheet and the agency is grading the client and our job is done. This needs to be a conversation. We need to invite stakeholders at multiple levels, both on the client side and on the agency side, or if you're in-house, just multiple levels within the organization, and we should ask for opinions from multiple perspectives to paint a more accurate picture of where the client stands today and agree on the steps that we need to take to move forward. When you do these maturity assessments, this isn't enough. This is step one. This isn't a finish line. We need to be using this as a springboard for a dialogue to uncover their pain points or the obstacles that they run into, inside their organization, that are going to keep you from getting that work done. We need to have honest and frank conversations about the things we need to clear out of the way to do our best work. With that, I hope that you can try this out. We've got a great article that we published on the Moz blog to get into more detail about how to implement this. But try it out in your organization or with your client and let us know. Peer review this and help us make it better, because this is intended to be a living process that evolves as our industry does. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Maturity: Evaluating Client Capabilities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Maturity: Evaluating Client Capabilities"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The SEO Capabilities matrix"
    },
    {
      "level": "H3",
      "text": "Harmful"
    },
    {
      "level": "H3",
      "text": "Tactical"
    },
    {
      "level": "H3",
      "text": "Strategic"
    },
    {
      "level": "H3",
      "text": "Practice"
    },
    {
      "level": "H3",
      "text": "Culture"
    },
    {
      "level": "H3",
      "text": "✓ Data-driven"
    },
    {
      "level": "H3",
      "text": "✓ SEO for content"
    },
    {
      "level": "H3",
      "text": "✓ Mobility"
    },
    {
      "level": "H3",
      "text": "✓ Technical ability"
    },
    {
      "level": "H3",
      "text": "✓ On-page/off-page SEO"
    },
    {
      "level": "H3",
      "text": "✓ Integrating across channels"
    },
    {
      "level": "H3",
      "text": "✓ Adopting new technology"
    },
    {
      "level": "H2",
      "text": "The Organizational Search Maturity matrix"
    },
    {
      "level": "H3",
      "text": "✓ People"
    },
    {
      "level": "H3",
      "text": "✓ Process"
    },
    {
      "level": "H3",
      "text": "✓ Planning"
    },
    {
      "level": "H3",
      "text": "✓ Knowledge"
    },
    {
      "level": "H3",
      "text": "✓ Capacity"
    },
    {
      "level": "H3",
      "text": "Initial"
    },
    {
      "level": "H3",
      "text": "Repeatable"
    },
    {
      "level": "H3",
      "text": "Defined"
    },
    {
      "level": "H3",
      "text": "Managed"
    },
    {
      "level": "H3",
      "text": "Optimized"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Heather Physioc\n          \n            Heather Physioc\n          \n            Heather Physioc"
}