{
  "url": "https://moz.com/blog/client-business-goals-whiteboard-friday",
  "slug": "client-business-goals-whiteboard-friday",
  "title": "Aligning SEO Strategy with Client Business Goals — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In SEO agencies, we get too caught up in the SEO and forget that there's a client. Understand what they want in order to align your SEO strategy with their goals. Learn more in this episode of Whiteboard Friday.",
  "content": "Aligning SEO Strategy with Client Business Goals — Whiteboard Friday Whiteboard Friday | Marketing Industry | SEO Consulting By: Anthony Barone Edited By: Emilie Martin April 5, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Anthony Barone Edited By: Emilie Martin April 5, 2024 Aligning SEO Strategy with Client Business Goals — Whiteboard Friday Whiteboard Friday | Marketing Industry | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In SEO agencies, we get too caught up in the SEO and forget that there's a client. Understand what they want in order to align your SEO strategy with their goals. Learn more in this episode of Whiteboard Friday. Click on the whiteboard image above to open a high-resolution version! Hello, everyone. I'm Anthony from StudioHawk. We are an SEO specialist agency, and I'm here to talk about SEO and brands, brands, and SEO. So as an agency, we're dealing with brands all the time, and we've learned a fair bit over the journey to see what makes them tick, what do they always want, what stops them, and what are the big things that you want to focus on as an SEO agency because you want to match up the business goals with SEO strategy. What tends to happen sometimes in SEO agencies is that we get too caught up on the SEO and forget that there's a client at the end paying the bills. So what we want to do and what we're going to talk about today is: What do they usually want? What's stopping them, and what can you do? So let's start. What do brands usually want? Beating competition Well, in our experience, they always want to beat the competition. Using competitors to try and motivate them is always a good starting point, and seeing what SEO strategy their competitors have got, how well they're doing, and using that as a benchmark. More organic traffic Second, of course, they always want more organic traffic. Who doesn't? They always want to get more users through their website. Less reliance on more expensive channels They want to have less reliance on more expensive channels, like PPC or social or just open up another stream that they didn't really tap into before, such as SEO. Better rankings Obviously, they want better rankings. They want their shiny number-one rankings, to be at the top. Better branded and non-branded search And things like better branded and non-branded search, so getting people who don't know who they are, but then also improving their branded search because other competitors might be also trying to bid on some of their brands from the PPC perspective so they can try and organically rank a bit better for their brand. So there are some of the things that they usually want, in our experience. Obviously, there could be more. But in our experience, here are some of the top-level things that they usually want. As a brand, personally, depending on who you're dealing with, if you're dealing with a CMO or a marketing manager or an exec, sometimes they just want to be made to look good. So you as an agency have to make them look good and work with them to make their numbers better, and find out what their goals are. What is stopping them? So that leads to what's stopping them. So what are some of the things that could impact the ability for a business and you as an SEO to get that strategy going? Poor SEO Now, in our time, some of the biggest things are that they've already got poor SEO, poor technical foundations, or just a poor understanding of SEO. So they don't really buy into it. They don't really understand. They don't really get it. So you're really starting at the back of the pack, having to try and educate them on what SEO is and the impact that that can have and matching up with their business goals. Lack of goals and prioritization Second, it's just a lack of goals and prioritization. So like they don't know where to begin. They want to try and do everything, but they do nothing. They let perfection get in the way of progress. They want everything to be perfect, or it has to be a certain way rather than just actually getting things done, whether that's you as an agency getting things done or you working together with the business, say they have an internal team, or they have developers to get things done because they just have no prioritization. They don't know where to begin, and they don't understand SEO. So there are no real goals. They just have like we need more money. We need more traffic. All right, cool. But there's no actual plan and no clear goals and stepping stones as to how to actually get there. Understand marketing Just trying to understand marketing and where SEO fits in their actual marketing plan. A lot of businesses, if they're startups, they won't have the patience for SEO. They won't have the patience, so we'll have to work on things like social or PPC or other quick impact sort of lead generation channels that will provide them the money and the revenue now. Now, ideally, you'd have a bit of a balance there, where you're starting the SEO while you're getting the traffic coming through from those other channels. But sometimes that isn't how it happens. With understanding marketing, sometimes they also think that SEO is in a vacuum, that nothing in the world affects SEO at all. SEO runs itself. There are no external factors. There's nothing that can affect SEO. Well, SEO is not in a vacuum, just like the rest of the world isn't in a vacuum. SEO is affected by other things as well. So sometimes you'll find brands that will absolutely be hot under the collar because they're like, \"Well, where's our SEO? Where's this? Where's that?\" While failing to understand that there are a lot of things that make up the demand. Like I can't control the demand for your product. If search volumes have gone down in 12 months and they've gone down by half for your product or your service, there's not much I can do about that if the market just isn't there for your product. You can improve your SEO for that. But if the overall demand is gone or dampening for your product or service, that's not only going to affect SEO. It's going to affect a fair few things. So that's some of the things that are stopping them. What can you do? Now what can you do about it? Now, again, there's no one silver bullet. If you do all these things, I hope that these would help. These have helped us to be able to get things across, to be able to get things implemented, to be able to work with the stakeholders, to be able to make the campaign actually viable and get some value out of it. But these are some of the things, in our experience, that we try and do. Proactively getting things done So proactively getting things done. Now that's not a one-size-fits-all approach with that. Again, depending on the size of your business, you will have a lot of stakeholders. You will have internal dev teams, specially custom-built CMSs, where you might not be able to get things done on the technical front. But what I mean by this is if you have the ability or the opportunity to jump into the website and get things done, you have the ability to create content, you have the ability to get ahead on certain things and showcase you're actually trying to provide value, what's the worst that can happen? They're going to complain that you're trying to provide them value, and you're trying to give them a return on the investment on their SEO? Now, again, don't be stupid with that. If you work with a big brand that's got a custom CMS and they've got a few legalities in there and you've got a few things, just don't jump into the website. You don't want to just rip down ASOS in a day, okay? But with certain brands, if you've got the ability to just get things done and showcase your proactivity within reason, again, I like that because it showcases that you're actually trying to get things done. You're showcasing to the business, hey, we're trying to make this work. You're not just paying us, and we're just going to sit around and do nothing. We're actually trying to actively make your SEO help you to achieve your business goals. Prioritizing key services or products Prioritizing key services or products. Now SEOs tend to get caught up in just doing SEO, which is fine. But they again forget that there's a business on the other side paying the bills and wanting to see results. So one of the things we want to do is focus on prioritizing the most important services that they offer or the products. What I mean by that is: What are the ones that they make the best margin on? What are the ones that they want to push? What are the ones that drive the most revenue or are the most popular? Focus on working your SEO strategy initially on those key services and products instead of just focusing on the privacy policy page or some random product that they might sell one of because it's got great search volume. That won't mean anything to the bottom line of a business. Focus on the key services or products. Simple reporting and updating on ‘why’ Now another thing is simple reporting and updating on the why, and this probably goes in with the clear communication to stakeholders as well. SEO is intangible. It's just numbers in the air to these people. They don't actually know. Yes, there will be vanity metrics, or yes, they'll see number one on Google, right? But what happens when you're not number one yet? Well, because it is intangible, the only tangible thing that they get is a report, is your team, is that call, is that strategy? Are those documents the things that they can see, then hold, and hear because SEO is intangible? There are all the things happening in the background, but yet your marketing manager, CFO, and CMO just want to see the results. They want to see the number go up. That's what they want to see. So simple reporting, Data Studio. Maybe there are custom tools out there. You can just detail what the SEO numbers mean, but match it up with their business goals. So don't use like non-branded queries. To you and I, we know what that means. But to the average Joe working in the business, they might not know what non-branded means. So you really have to explain as to what that means. So you'd use certain keywords that they would know. Sometimes a client will be like, \"We want to be known for these keywords.\" So you use those keywords that they want to be known for, their goals to explain what branded or non-branded means. Showcasing revenue, money. You might have fixed like 10 title tags, but they don't know what the hell a title tag is or care, right? What does that actually mean? Well, hey, client, we have done all this metadata optimization to improve people clicking on our results. Therefore, we can lead that to more traffic and potentially more revenue or more leads. So you want to try and explain those really SEO-y things in a way that matches up with their business goals so that they understand. Otherwise, they're just going to be with a very confused look on their face. Clear communication with stakeholders Clear communication with stakeholders. Again, using things like Docs or Sheets or Word, explaining it clearly. Explain it to them like they're 5. Showcasing, use Slack, use emails. Have a call. Sometimes it's easier just to call them up and explain on the phone because there's no turnover email. You can have 50 long chain emails, and everyone forgets what happened. Matching your SEO strategy to business goals Matching the SEO strategy to the business goals, so that's the encompassing bit where we're going to be like, hey, the client comes to you and says, \"We want to be number one for this. We want more revenue, and we want more leads.\" Great. Those SEO-y things have to then match up to get those goals. So how are you going to get more revenue? All right, we're going to focus on those key services and products. We're going to focus on E-E-A-T. We're going to focus on the technical health of the website. But when you're saying E-E-A-T, they don't know what that is. So you're going to say something like, \"We are creating these about us pages and team pages because we want to create your own Wikipedia and your own LinkedIn on your own website so that you can showcase to Google and users, hey, we know our stuff. These are the legitimate people behind this business.\" Reaffirming goals — showcase the impact of SEO And reaffirming those goals. Showcase the impact of SEO. Showcase those graphs, showcase those ranks. Have like catch-ups with them to be to be like, \"Are we still on track? What's going on in the business? How are the products going?\" Essentially ask them some financial questions like, \"How is the business performing? What are the goals this week?\" Sometimes you might not get that information. But if you get enough context to be like, \"Are we hitting our goals this month or are we not,\" you can then tweak your SEO strategy to be like, oh, actually, it's a bit of a down quarter coming up. What can we do? All right, and then you can make that adjustment. Because if things are happening in the business and you're not aware of them, they get that report or they get that call and go, \"This means nothing to me. What does this mean? There's no money coming in.\" Ah, but we had to do X, Y, Z on this project for this. \"Who cares? There's no money coming in.\" You're sort of a bit screwed. What is most important to them? And last but not least, always remember what is most important to them. Now to you, as an SEO, you're going to be like, yes, doing the work is great, or fixing metas and getting internal links in there and doing backlinks and all this stuff is important to you as an agency, which is great. That's how we showcase value, yes. But at the end of the day, the client is paying the bills. What is most important to them? If it is something like just getting more organic traffic, all right, fine. You, as an SEO, have to explain why that's fine as a goal, but then also continually educate them as to some of the other parts that make up SEO. Yes, okay, traffic is only the first bit. But are you getting the right traffic? Are they converting? And it leads you on to many more questions, which can then shape your strategy. But always remember the why and what is most important to them, and then you get that information. Then you can craft your strategy and you can craft your work and your dedicated time to achieving those goals. What should happen, now, again, it doesn't always happen this way, but what should happen is the business should be appreciative that you're trying to actually leverage and use the channel of SEO and the power of SEO to help them achieve those goals. So that's everything for today in terms of SEO and brands, brands and SEO, matching up the business goals with SEO strategy. Remember, what do brands usually want? More organic traffic, less revenue, better branded or non-branded search, better rankings, beating the competition. What is stopping them? Poor SEO, poor education, lack of goals and prioritization, understanding marketing, resources, ego. And what can you do? Being proactive. Sometimes, depending on the situation, it's better to ask for forgiveness than permission. Prioritizing key services or products, focus on the things that will make them money. Clear communication with stakeholders via simple reporting and updating on the reasons why we are doing this. Reaffirming their goals. Continually understanding what their goals are, and showcasing the impact of that SEO through simple reporting and clear communication. Matching that SEO strategy to the business goals, and always remembering what is most important to them. What is the why? Impact over vanity metrics essentially. So that's everything. I'm Anthony from StudioHawk. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Aligning SEO Strategy with Client Business Goals — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Aligning SEO Strategy with Client Business Goals — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "What do brands usually want?"
    },
    {
      "level": "H3",
      "text": "Beating competition"
    },
    {
      "level": "H3",
      "text": "More organic traffic"
    },
    {
      "level": "H3",
      "text": "Less reliance on more expensive channels"
    },
    {
      "level": "H3",
      "text": "Better rankings"
    },
    {
      "level": "H3",
      "text": "Better branded and non-branded search"
    },
    {
      "level": "H2",
      "text": "What is stopping them?"
    },
    {
      "level": "H3",
      "text": "Poor SEO"
    },
    {
      "level": "H3",
      "text": "Lack of goals and prioritization"
    },
    {
      "level": "H3",
      "text": "Understand marketing"
    },
    {
      "level": "H2",
      "text": "What can you do?"
    },
    {
      "level": "H3",
      "text": "Proactively getting things done"
    },
    {
      "level": "H3",
      "text": "Prioritizing key services or products"
    },
    {
      "level": "H3",
      "text": "Simple reporting and updating on ‘why’"
    },
    {
      "level": "H3",
      "text": "Clear communication with stakeholders"
    },
    {
      "level": "H3",
      "text": "Matching your SEO strategy to business goals"
    },
    {
      "level": "H3",
      "text": "Reaffirming goals — showcase the impact of SEO"
    },
    {
      "level": "H3",
      "text": "What is most important to them?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Anthony Barone\n          \n            Anthony Barone\n          \n            Anthony Barone"
}