{
  "url": "https://moz.com/blog/closing-thoughts-on-smx-social-media-2007",
  "slug": "closing-thoughts-on-smx-social-media-2007",
  "title": "Closing Thoughts on SMX Social Media 2007 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm back in Seattle after a short trip to NYC for SMX Social Media. I live-blogged a couple of sessions on Tuesday and tried to live blog the \"Evangelist - The Marketer's Role...",
  "content": "Closing Thoughts on SMX Social Media 2007 SEO Events By: Rebecca Kelley October 19, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley October 19, 2007 Closing Thoughts on SMX Social Media 2007 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm back in Seattle after a short trip to NYC for SMX Social Media. I live-blogged a couple of sessions on Tuesday and tried to live blog the \"Evangelist - The Marketer's Role in SMM\" session, but I lost my post before I published it. (And no, I didn't save it. Yes, I am dumb.) I did cover Rand and Liana Evans' presentations for the Micro Communities session for Search Engine Land, plus there are lots of other recaps there and throughout the web. I think that overall the conference was a success, especially considering it's the first conference I've been to that was explicitly dedicated to social media tips and tactics. Most of the sessions were quite interesting and engaging, with only a couple of presentations that felt a bit overlapping. I got a lot of positive feedback on my presentation, with people telling me that I \"woke them up,\" which I relish in a bit more knowing that Rand spoke before I did. Take that, boss! (Note: I'm joking. Presenting first thing in the morning sucks. I've done it before, and the audience is pretty stiff, so I'm thankful I didn't get Rand's slot. He did get some laughs and kudos, and I am of the opinion that he's definitely a helluva better speaker than I am.) Anyway, I thought the keynote Q&A with Joshua Schachter of del.icio.us and Garrett Camp of StumbleUpon was a bit disappointing--it felt more like a tutorial on how to use their sites and less like honest, valuable feedback for attendees and the questions they posed. I really hate when company spokespeople answer questions with \"We'll look into that\" or \"We can't tell you right now, but it's something I can research,\" etc. A friend of mine felt that the conference was great for marketers who haven't yet gotten into social media but not as valuable for those who already do social media marketing and want more advanced or expert tips, and I agree with her. A lot of the sessions (mine included) were a great overview of why certain social media approaches (link bait, bookmarking, social media news sites, etc) are valuable to your marketing and branding campaigns. For future social media-centric conferences, I would really like to see more specific or advanced sessions thrown in with the \"An Introduction to Such and Such\" panels. I have to close by saying that I am extremely proud of my good friend and fellow lady in SEO, Tamar Weinberg. Danny made her speak on the \"Extra! Extra! The Social News Sites\" panel virtually against her will. I know how nervous she was, but clearly the audience deduced that she knows her stuff because every time I saw her she was answering an attendee's questions about social media tactics. I bet she snagged a ton of business cards. Way to go, Tamar--you've certainly made a name for yourself in the past year, and I'm very happy and excited for you. If you attended SMX Social Media, I'd love to hear your thoughts and opinions. What did you like? What didn't you like? What would you like to see more of for the next conference? What would you like to see that's new? How gross was it that while I was in NY my allergies rendered one of my nostrils completely plugged up and the other one inexplicably mucus-free? Did I actually just type that? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Closing Thoughts on SMX Social Media 2007"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Closing Thoughts on SMX Social Media 2007"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}