{
  "url": "https://moz.com/blog/cognitive-bias",
  "slug": "cognitive-bias",
  "title": "Cognitive Biases in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover the impact of cognitive bias on SEO and how to leverage the psychology of your audience to improve rankings, click-through rates, and brand reputation.",
  "content": "The Psychology Behind Search: Cognitive Biases in SEO Marketing Psychology | Marketing Industry By: Garrett Sussman Edited By: Emilie Martin May 15, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Garrett Sussman Edited By: Emilie Martin May 15, 2024 The Psychology Behind Search: Cognitive Biases in SEO Marketing Psychology | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Our brains are funny little things. They play tricks on us. As SEOs, we get stuck in a bubble. If we’re not conducting interviews, looking at data, and stepping out of our own digital worlds, we can forget how people search. Search behavior is one of the most fascinating practices in modern society. Chances are your search history is either spectacularly mundane or filled with some quirks that you’d never want to see the light of day. And that’s okay. I know mine is wild. You’ll see everything from toddler activities to Edison lamps to Garrett Sussman. Yeah. I Google myself. You don’t? In-person tickets are 95% sold out; grab yours now while you can! Save $300 with our Night Owl tickets, ending on May 17. But Google is going through an identity crisis right now. AI has got them puzzled. The Search Generative Experience experiment has been suspect. They’re rolling out more updates than ever, and they’re trying to use their algorithms to figure us out. Have you seen the Google Algorithm Update History over the past ten years (Shoutout, Dr. Pete!)? It’s Death Valley hot. Meanwhile, in the DOJ versus Google lawsuit, we find out that user behavior influences rankings. SEOs are twisted like licorice and need to wind it back to the fundamentals: understanding your audience. How do we figure out our audience? The psychology of the search journey. The tricky reality is that our audience brings a lot of context to the table. Our experiences, backgrounds, social lives, and beliefs — they all inform the way we search and how we choose information. In this article, I’m going to dive into a small sliver of cognitive biases that influence us, along with some tactics that SEOs can use to earn visibility and be selected by your audience. Understand cognitive biases Did you get the brain instruction manual? Our brains work hard. When things are going well, we’re at ease. Our brains relax. When we have to think, make decisions, pay attention, switch between tasks, search online– our brains stress out. It’s like when you lose your phone or have to choose what to eat for lunch. Nobody likes being stressed out. What does our brain do? Shortcuts. An adaptive set of little tricks to make brain processing a bit easier. Sometimes, these shortcuts save us time and effort without consequence. You can’t play detective on every mundane detail of your life. Nobody has time for that. Other times, they get us into trouble. That’s where cognitive biases rear their faces. And there are a LOT of them. Wikipedia Source (Designed by John Manoogian III) Cognitive biases are the get-rich-quick schemes of the brain. They’re mental processes that mess with our memory, play tricks on our eyes, or make quick judgments about people, brands, or situations that aren’t always fair or accurate. As an SEO, it’s valuable to learn these potential biases that your audience uses in their searches, interpretations of your content, and evaluations of your message. You can use this to inform your SEO and content strategy. Cognitive biases can appear in three distinct ways throughout the search journey: The searches that we makeThe results that we chooseThe impact of content on our continued search journey The way that we search Words matter. Topics matter. Relationships matter. Google has become increasingly capable of understanding natural language as algorithms like BERT and MUM are integrated into search. It understands synonyms, entities, and relationships between words based on placement and context. Google can deliver more nuanced results that satisfy our search intent. But that doesn’t prevent us searchers from inserting our own contexts, prejudices, and biases into the way we phrase our queries. Let’s take the most polarizing example in the history of humankind — who makes better pets: cats or dogs? Now, if I’m a dog person (which I am), I’m going to ask Google, “Why dogs are better pets than cats?” and I’ll get back this beautiful result: And if I were a confused and sorely mistaken individual, I’d ask, “Why cats are better pets than dogs?” and I’d get this inaccurate result: This is confirmation bias and search engine bias at work. Confirmation bias is the preference for information that confirms our existing beliefs.Search engine bias: Top results are often taken as the best answer to a query despite potential editorial bias either based on how different factors are weighted, quality rater guidelines are written, quality raters rate results, or a number of other complicated reasons. Whether we’re assigned a responsibility at work to find a new email marketing tool or we don’t know where to start learning how to code, our personal experiences shape how we enter the journey in Google. The language we use in our searches influences the results we receive. In a recent study by Varol Onur Kayhan, we see the process that people use to infuse their searches with preexisting beliefs. Our attitudes color the information we are looking for, and Google supplies the information to reinforce that belief. They found that the specific keywords used by searchers influenced the results they selected. We insert our own context, beliefs, and personal experiences into our searches. We want to confirm the way we see the world because changing that view impacts our identity. People don’t like to have their identities threatened. What can SEOs take from this study? Despite your focus on a given topic, your word selection matters. As SEOs, we prefer to target keywords that have a large search volume to capture the most traffic. But the better we know our audience, the more specific we can get in creating content that resonates with the people we want to engage. SEO action item Conduct interviews and surveys with customers and in-market audiences and identify the terms they use. Try to pinpoint specific phrases, slang, and jargon. They might differ by various group attributes: Education levelDemographics (like gender and age)FirmographicsGeography Anyone hungry? Hoagies on me. Wait… you’ve never had a hoagie? Oh. You call it a sub? Grinder? Po’ Boys? Hero? What’s most popular? A great source for geographic insights is Google Trends. I’m not saying you’re wrong. But I’m from New Jersey. We may be a small contingent, but mighty. When you incorporate those phrases into your content, speaking the language of your audience drives connection and loyalty. It’s difficult to change someone’s mind, but confirmation bias could prevent your content from showing up and being visible to your audience in the first place if you’re not using the terms that your audience does. But say you do show up. What does it take to be selected in an ocean of sameness? The results that we choose There’s too much competition for attention in the search results. AdsFeatured snippetsImage packsVideo packsPeople also askSERP-specific carousels and rich snippetsAnd a couple of organic links… Soon, we’ll likely be blanketed by Google’s AI-powered search Generative Experience. When you look at click-through rate studies, the drop-off for organic result clicks as positions go down the page is precipitous. Additionally, they need to be segmented by industry and updated with modern SERP features. If you look at the modern SERPs, you can see why click-through rates might be dropping. To complicate your challenges as an SEO, cognitive biases are present throughout the SERPs. If you can leverage the psychology of your audience, you can earn a chance at making a good first impression. Once your brand and content get a shot at your visitors, then you run into a different series of marketing challenges. We’ve already addressed confirmation bias. Unless people are genuinely looking for a balanced perspective (which does not happen all of the time), they select results that support their preconceived notions. What does that look like? Recently, I found out that I have high cholesterol in my family. I went to my doctor for recommendations on a heart-healthy diet. She told me to avoid the standard recommendations like red meat and egg yolks, but she also mentioned avocados. I had always heard that avocados were a ‘healthy’ fat. So I searched and found myself clicking on links that supported my belief that avocados were a great selection for lowering (bad) cholesterol. I’m an SEO and someone obsessed with consumer psychology and marketing. I do it. Everyone succumbs to confirmation bias subconsciously. But what other cognitive biases are at play in the way we choose? Salience bias Squirrel! We’re all easily distractable. We live in a world with too many stimuli. We’re also excessively visual and susceptible to novelty. Salience bias demonstrates this in search. We’re much more likely to have our attention drawn to something that stands out. Salience bias is the tendency to focus on items or information that are more noticeable or emotionally striking, often at the expense of other, less prominent information. Imagine that you run a vinyl record business and are launching a content marketing campaign. You’ve done your keyword research via Moz Pro for a list to target. The best SEOs always go to the current SERPs to see what appears. You look for the keyword “colored vinyl.” This is what you see in the search results: In this result alone, we see image carousels, a side widget with dropdowns, and people also ask. It’s crowded. In fairness, most SERPs aren’t like this. But it highlights the importance of actually looking at the search results to see what you’re up against and how you need to compete. Andy Crestodina put together a fantastic presentation on this very issue at MozCon 2022. Watch how he analyzes and commentates on the various attention-stealing features in the SERP. You can expect Google to continue to add these features that seem to satisfy your searcher’s intent. It’s important to monitor as they impact the salience bias of your audience. You’re also likely to see themes depending on your industry and audience. E-commerce, entertainment, cooking, and hospitality: More image carousels.Younger audience: More short videos.Local: More Review Snippets. SEO action item If you have the opportunity to stand out in the SERP visually based on your target keyword’s features, you should capitalize on it. You can keep an eye on your keyword list at scale with MozPro’s SERP Feature tracker. If you are trying to rank for local or e-commerce queries, leverage online reviews to visually stand out in the SERPs. When it comes to local SEO, read anything by Miriam Ellis on the Moz blog. She’s the expert on local business psychology and best practices. Invest in high-quality images for your products, venues, and dishes for valuable keywords that have opportunities for image carousels. Combine your YouTube SEO strategy with your organic search strategy to appear in video carousels. Google has been including more TikTok results, but YouTube still dominates. Diversify when appropriate. Pro tip: Focus primarily on the platform that you’re publishing first. Many video SERPs reward newer content unless it’s an evergreen topic. Implement sitelinks for branded queries to get more SERP real estate. Authority bias Google (and SEOs) have been obsessed with four types of content that Google values according to their Search Rater Guidelines: Experience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T). We trust authorities to steer us in the right direction. We trust brands and personalities that have established themselves as market leaders and as authorities on a specific topic. Authority bias is when we give an authority figure an extended amount of goodwill in their opinions, recommendations, or direction. Earned or perceived credibility can influence our decisions. A classic example of this bias being exploited was in the 80s — Vicks Formula 44 used to run commercials with actor Chris Robinson from the daytime soap opera General Hospital dressed in his full doctor’s costume. In his book Influence, Dr. Robert Cialdini reveals that people were influenced by the authority bias created in the ad despite Robinson not being an actual doctor. But many times, authority symbols are earned, especially for searches that impact your money or your life (YMYL). Think domains that end in .gov, .org, and .edu. Authority symbols frequently show up in search results for health queries when you see a hospital website because they are the authority on health. Who are you more likely to click on here? Mayo Clinic or Healthline? We trust you because you or your brand has a reputation for being reliable, educational, ethical, and honest. You can assess your Brand AuthorityTM on Moz Pro. They’ve calculated a metric that aligns with those trust signals that can evaluate the trustworthiness and authoritativeness of a brand. Let’s see what that looks like for a website like Wells Fargo. I’d expect it to be higher than other publications. And it is. SEO action tip Use power words in your titles and meta descriptions. Don’t overdo it, but see if you can sprinkle in words that give off trust signals: AccreditedCertifiedProvenReputableSecureExperiencedSafe Make sure that they’re appropriate for your industry. On a bigger, strategic level, the best thing you can do for your authority: Build your brand. Don’t roll your eyes. It’s what you need to do! SEO is one channel in a bigger marketing strategy. All of the platforms should work together to compound the results. Easier said than done. Your brand and your recognition as the leader in your space drives your authority. If you’re a smaller business you typically need to develop visibility across your channels with consistency and quality. Or find organic viral opportunities to accelerate your brand reputation. Bigger brand? You might have everything in place, tons of resources, but working across silos is a challenge. It’s not easy to get the editorial calendar of your colleagues in other teams across the marketing department. Regardless, brand development is a longer play. It’s not something that you can build overnight. Start small, follow your North Star branding principles, and allow your brand and customers to guide you where you can leverage authority bias. Familiarity bias, mere exposure effect, and the halo effect Speaking of brands, we trust what we know. It’s safe and reliable. Familiarity Bias highlights how we frequently choose the recognizable option regardless of whether it’s the best. I’m actually not going to focus too heavily on this bias because Giulia Panozzo recently covered the psychology behind familiarity bias and the mere exposure effect extensively, whereas Myriam Jessier provides a series of smart tactics to implement it at the local level for your SEO and content programs. What’s important to remember with the familiarity bias is that you need to consistently maintain a presence for your audience at multiple touch points across the internet. Whether people encounter you via social media, influencer marketing, advertising, or any other channel, when they do see your brand appear in an online search during their search journey, they’re more likely to click on your organic listing. It’s one of the reasons that Forbes is so effective on Google. People are incredibly familiar with the brand. So even when they appear for a surprising result like “Best Mattresses 2024”, people still click on the result because they know the brand. Considering that we now know that Google uses behavior signals like click-through rate and UX metrics to influence rankings (as a result of the aforementioned DOJ lawsuit against Google), familiar brands most likely benefit with higher rankings. Additionally, we have the halo effect. In essence, it’s leveraging the positive feelings associated with another person or brand. We tend to attribute good feelings when we connect two entities like that. In addition to Forbes, the New York Times also benefits from the halo effect. The New York Times has enhanced its brand via halo effect-powered, mutually beneficial acquisitions. In 2016, NYT purchased product review website Wirecutter. Between Wirecutter’s impressive content in the affiliate marketing space, the sub-brand got an additional boost from NYT’s credibility and reputation.In 2022, The NYT purchased the internet phenomenon Wordle. The universally adored game boosted NYT’s already much-loved crossword puzzle and games section of its digital publication. Both acquisitions married two positively associated brands, force-multiplying the brand equity in new and established arenas. While you might not be able to grow your brand with acquisitions, you can leverage familiarity, mere exposure effect, and the halo effect with brand partnerships. Igloo Coolers has partnered with brands and people like Snoopy, Green Day, and Naruto. Fortnite has partnered with a range of entertainment brands, including Lego, Teenage Mutant Ninja Turtles, and Lady GaGa. SEO action tip You might not have the capital or leverage to partner with multi-million dollar IPs, but you can still benefit from the Halo Effect. The key is to identify partnership opportunities that are complimentary to your industry or offering. Local party venue? Partner with community events, kids' hairdressers, or toy stores.SEO SaaS tool? Partner with amazing leading SEO agencies.Sell home decor? Partner with social media influencers. Each of these partnerships can benefit your appearances in the SERPs for brand and relevant searches. A second tip? Get on best-of lists. This strategy is known as surround sound SEO or barnacle SEO. By appearing on another brand's round-up of the top X products or services in your industry, not only are you getting an endorsement, you’re likely to get search visibility. There’s nothing Google loves more these days than listicles. The impact on our continued search journey The marketing funnel isn’t linear anymore, and not all searches are created equal. Searching for your next car is a slightly bigger decision than your next toothbrush. Searching for medical symptoms has different life consequences than apple pie recipes.Searching for fun activities is a bit more general than searching for water activities in the summer for a toddler.Searching for a list of US presidential pets is different than the latest advancements in Generative AI. We can’t always satisfy our search intent at the moment. But throughout that messy search journey bouncing back and forth between Google and various websites, we have an opportunity to plant seeds for our audience. We can win them in the SERPs and on our websites. Confirmation bias, familiarity bias, salience bias. There are hundreds of cognitive biases that impact how we search online. They’re a natural part of how we think. They trick our hardworking brains. But as SEOs, we need to get intimately familiar with our audience, the way they think, and the way they search. The next time you’re tackling your SEO strategy, meeting with the content and social media team, or searching for your personal needs, think about the cognitive biases at play. Understanding human behavior and psychology is one of the single most important pieces of knowledge you can invest in to level up your SEO career. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Psychology Behind Search: Cognitive Biases in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Psychology Behind Search: Cognitive Biases in SEO"
    },
    {
      "level": "H2",
      "text": "Understand cognitive biases"
    },
    {
      "level": "H2",
      "text": "The way that we search"
    },
    {
      "level": "H3",
      "text": "SEO action item"
    },
    {
      "level": "H2",
      "text": "The results that we choose"
    },
    {
      "level": "H3",
      "text": "Salience bias"
    },
    {
      "level": "H4",
      "text": "SEO action item"
    },
    {
      "level": "H3",
      "text": "Authority bias"
    },
    {
      "level": "H4",
      "text": "SEO action tip"
    },
    {
      "level": "H3",
      "text": "Familiarity bias, mere exposure effect, and the halo effect"
    },
    {
      "level": "H4",
      "text": "SEO action tip"
    },
    {
      "level": "H2",
      "text": "The impact on our continued search journey"
    },
    {
      "level": "H2",
      "text": "Learn from the best in the industry."
    },
    {
      "level": "H2",
      "text": "Learn from the best in the industry."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    }
  ],
  "author": "Garrett Sussman\n          \n            Garrett Sussman\n          \n            Garrett Sussman"
}