{
  "url": "https://moz.com/blog/combat-serp-volatility",
  "slug": "combat-serp-volatility",
  "title": "How to Combat SERP Volatility - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What is SERP volatility? How can you combat SERP volatility to maintain important keyword rankings? Get the full overview here! Map out the best course of action and plow full steam ahead.",
  "content": "How to Combat SERP Volatility Search Engines | On-page SEO By: Adriana Stein July 5, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adriana Stein July 5, 2023 How to Combat SERP Volatility Search Engines | On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Have you ever lost keyword rankings and felt a sudden wave of panic? If so, you’ve likely been on the wrong end of SERP volatility, meaning periods of extreme fluctuation in keyword rankings. But before you go into optimization overdrive without any concrete strategy, the most important thing to remember is to take a deep breath and not panic. In fact, SERP volatility is a normal part of today’s highly competitive world of SEO. So once you’ve collected yourself, take time to analyze your data, pinpoint the cause, and make changes to content (or sometimes not), with full confidence. To help you understand how to do such an analysis and optimize content with the best possible chance of stabilizing keyword rankings, let’s now take a deep dive into SERP volatility. What is SERP volatility in SEO? SERP volatility occurs when SERPs change based on various contexts. Occasionally, extreme fluctuations in both the positive (a higher ranking) and the negative (a lower ranking) direction can occur. It’s extremely normal nowadays, because there are millions of websites competing for top ranking positions. To make things simple, think of SERP volatility similar to stock market volatility. It can all change even within a single day and that’s not necessarily something to automatically fret about. Why SERP volatility impacts SEO performance While one small loss in keyword rankings might not have a major impact on SEO KPIs and performance, if things start to add up and many keyword rankings are lost - especially if they’re revenue-driving keywords - that’s when you’ll want to take a deeper look at the data. When this happens, your entire business objective to generate traffic and increase revenue from SEO grinds to a halt. If pages don’t rank, you don’t get the clicks or the conversions, leading to losses in new leads and sales. Here’s a visual summary to give you a better understanding: So as you can see, keeping an eye on changes that are needed is crucial, which is why content optimization is so important for long-term SEO success. 8 Reasons for SERP volatility and how to combat it to maintain keyword rankings The best possible way to combat SERP volatility is to review data to determine the root cause. When reviewing data, ask yourself: What keywords are experiencing the most volatility? What content is ranking, and then not ranking for those specific terms? Are there any underlying technical errors that are impacting SERP results? Try to drill down and pinpoint what is causing all the instability in your rankings. Then, you can implement the appropriate changes and monitor how those changes affect performance. Now, let’s break down some of the most common issues that trigger SERP volatility and ranking fluctuations, as well as proposed solutions for how to fix them. Reason 1: Mixed search intent, SERP variety Mixed or vague search intent means that the search engine is unclear how your content addresses the query in the search bar. Let’s use the example of a B2B tech firm called Healthcare IT. When entering the query “healthcare IT” into search engines, here’s the top result that appears on the page: News search intent: Consulting search intent: Government database search intent: So you can see from these examples that many types of content appear (SERP variety) because Google isn’t precisely sure what the user is searching for (mixed search intent). How to combat SERP volatility for mixed or vague search intent Mixed search intent is one of the most common reasons for SERP volatility. The good news is that it can be resolved entirely, so unstable keyword rankings don't become a recurring issue. The solution involves specifying intent through your own keywords within the content. For example, if your page is all about “healthcare IT news,” specify that on-page by using keywords that include 'news' rather than just having 'healthcare IT'. This way, it’s easier for Google to determine the type of intent you’re targeting so that it can show the correct content to the user. In order to identify and monitor whether you’re impacted by this issue, consider if the keyword and the intent behind that keyword has changed. Keep track of keyword ranking averages across 3 - 6 months to monitor how people search for and engage with queries in SERP results. Remember that daily fluctuations in results are inevitable, so a better strategy is to monitor monthly fluctuations to identify trends. Additionally, always keep an eye on new SERP competitors. Are there new players in the market with compelling reasons to rank for those same terms? If so, you may need to implement a content refresh as explained above to get your rankings back on track. Reason 2: High keyword difficulty This is another common reason for SERP volatility. There are billions of web pages competing for top SERP positions and the organic traffic they deliver. This high level of competition creates “keyword difficulty.” If you’re targeting keywords with high difficulty, it can be relatively easy for competitors to bump you down from high-value positions without warning. Have a look at this example of a search for this high difficulty keyword: “SEO beginner guide.” The data is pulled from Moz. Now, here’s a list of some of the sites that appear in the results. They’re constantly changing positions from week to week, largely due to content refreshes. How to combat SERP volatility for high difficulty keywords Similar to this example, check to see if your competitors have recently optimized or refreshed their content. Furthermore, you also need to consider the authority of your own website. If your keyword rankings were high, but have stayed at a constant low later on, consider if your domain has the authority to own the search term as competition has grown. A great way to check this is with Moz's Keyword Explorer tool, which allows you to compile lists of keywords where you can compare keywords against each other by search volume and difficulty. So if you see that a keyword has become too difficult due to high competition, you may consider using a lower difficulty keyword that’s easier to rank for. Ultimately you’ll also need to decide how much of a priority ranking for that term is important for your business. If it’s of high value, try optimizing your own content to gain greater visibility. If it’s not of high value, it’s probably worth letting that one go. Reason 3: High market competition This is a similar challenge to the previous one. Your competitors, with directly or indirectly competitive products, may be investing a lot into new content creation. As they produce new fresh content, signals are sent to search engines that their sites have something of value to provide to audiences. Due to the frequency and quality of their publishing strategy, they’re constantly gaining topical authority around the subject matter. Over time, the cumulative effects of their content strategy translate into higher topical authority that helps to elevate their site rankings. How to combat SERP volatility for high market competition The solution here is a simple matter of monitoring your competitors and what they’re doing. Identify what content they’ve recently published that seems to be gaining the most traction. Then, determine how you can create something of a similar nature but with a unique spin that provides even greater value to your competing audience. In the example above, this came in the form of regular content refreshes related to industry trends and algorithm updates. You’ll also want to ensure that your entire content architecture works together to build topical authority over time, which will help you stably rank for high difficulty keywords. Reason 4: Trending topic Let’s use a very topical example to explain this one. Recently, the search term King Charles gained a lot more search volume, which is understandable in light of the recent coronation. However, prior to his ascension to the throne, the term King Charles had more to do with dogs rather than the newly crowned king. Notice the change in intent? Sometimes, a trending topic can cannibalize the focus of a particular keyword. You either need to come up with a whole new SEO strategy to shift the focus and recapture the intent of that term, or you need to decide if it’s still worth the effort. How to combat SERP volatility for trending topics Work around the hijacking of that specific term by instead investing in long-tail keywords. While long-tail keywords do have less search volume than broader generic terms, the intent behind long-tail queries is much more specific on the part of the audience. Someone who searches for a phrase like “how do I use technology to manage healthcare” is looking for a more specific answer than someone who simply searches for “healthcare IT.” Decide if playing the long-tail game is worth shifting focus away from shorter head keywords. Keep in mind that this approach could drop your organic traffic volume. On the other hand, it should drive up CTRs and conversion rates because those who do find you want what you can offer. So in the end, focusing on long-tail will result in stronger revenue results from SEO. Reason 5: Indexing issues Here’s where we get into more technical SEO challenges. Sometimes, your on-page SEO could be top-notch, and the content you’re creating is fully optimized for the appropriate keywords. Yet, despite your best efforts, the results aren’t coming through. If this is the case, you likely have some technical problems with your site, and your indexing issues could be where the trigger for SERP volatility lies. How to combat SERP volatility for indexing issues The first step to solving this challenge is to run an audit using GSC or another SEO tool, such as Moz Pro’s Site Crawl. Identify the pages that are being improperly indexed so that you can isolate them from the search engines. These technical glitches typically occur during a site migration, page optimization, or site structure changes. If you’ve recently undergone one of these technical updates, speak with your developers to figure out how best to fix the problems. Reason 6: Google A/B testing SERPs Sometimes, the direct cause of SERP volatility has little to do with your SEO or your business model. In certain periods of time, Google is simply reevaluating what appears in specific SERP results. This is particularly common when trending topics emerge for certain search terms. A perfect example is the term “ChatGPT.” Since its launch in 2022, there have been thousands of news articles written about the impact the AI algorithm will have on content creation. Each one of those news updates receives higher ranking authority because it’s discussing the latest trend about a new market offering. Google will run A/B tests on its own SERP parameters to ensure audiences receive the most relevant information as new updates are announced. How to combat SERP volatility for Google’s A/B SERP testing The best approach is to monitor rankings using your site analytics. Keep track of keyword ranking averages over a span of three to six months and evaluate the impact of the fluctuations on performance. If you notice a big change, that’s a signal that your site content needs to be optimized to regain authority for the appropriate terms. If the impact is minor, you may just need to take a wait-and-see approach. Watch the changes carefully and see if Google pushes you back up to the top of the rankings. Also, remember to check your analytics data to determine if the UX could be a cause for reduction (for example, look at bounce and exit rates to see if people are abandoning your site as soon as they arrive). Reason 7: Algorithm changes or penalties Periodically, Google and other search engines will announce sweeping changes to their search engine ranking algorithms. Some of these updates, like Google Panda, can change the entire nature of how search engines index and rank specific websites. Others are minor tweaks to the algorithm with less permanent SERP volatility. If you’ve noticed trending topics on social media about search engine algorithm updates, look for discussion threads about the recent changes. Another nifty way to monitor algorithm updates is by keeping an eye on the Moz Google Algorithm Update page. You’ll be able to determine if the problem lies with your site or if this is an algorithmic update that’s affecting everyone. Here’s an example of a site that was negatively impacted by the overuse of AI generated content. Important note for this example: Using AI to write content doesn’t automatically mean you’ll get a penalty - but spamming does. How to combat SERP volatility for algorithm updates or penalties Do a little research into the algorithmic update itself. Try to ascertain what specific feature the new algorithm is impacting to get a better sense of how your site will fare. You may find technical problems with your site that impact performance, such as: Site speedTopical authorityDomain authorityQuality of inbound linksEtc. Also, remember to go back into GSC and run your own site audit to see if there’s anything specific that may be weighing you down. Find the culprit and erase it, so you can get yourself out of “Google Jail.” Reason 8: Cannibalization If you’ve created content with headings that are similar to each other and have focused on the same intended search terms, you may be sending confusing signals to search engines about what content to feature for the appropriate keywords. This is when the concept of “content cannibalization” comes into play, meaning where multiple pages could rank for the same keyword, and Google is unsure about which one to show. A perfect example is if a CMS brand tries to rank for “headless CMS.” They used the phrase “headless CMS” on: The homepage (to describe their product)A blog with the URL blog/what-is-headless-cms (a more insightful piece on the topic)A blog with the URL blog/headless-cms-advantages (a second thought leadership piece about the same theme) Where the issue lies is the fact that they have used multiple pages to cover similar topics, so the keyword rankings for these pages were constantly changing. How to combat SERP volatility for cannibalization Make sure you always refer to your keyword map when building out new pages. Your keyword map should be your singular source of truth to help you build out and connect different web pages around an umbrella topic. Ensure that you’re not creating duplicate content or targeting similar search terms with multiple variations of content. Keep things structured and organized so that you avoid ending up on the wrong side of Google’s algorithm updates. If you do find content that’s live and is cannibalizing, like the avoid example, consider condensing the pages into one or doing a redirect to the primary page to rank. To combat SERP volatility: don’t panic, review the data, and optimize with confidence Remember that the best thing you can do when you notice keyword rankings suddenly drop is not to panic. Take the time to analyze the situation and drill down to the root cause. Panic optimizations help no one and can even cause more harm than good. Once you dive into the data, you’ll know what changes are appropriate (if any). Map out the best course of action and plow full steam ahead to get the ship back on course. When you keep important keyword rankings, your SEO performance stays strong, and so too are the conversions generated from it! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Combat SERP Volatility"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Combat SERP Volatility"
    },
    {
      "level": "H2",
      "text": "What is SERP volatility in SEO?"
    },
    {
      "level": "H2",
      "text": "Why SERP volatility impacts SEO performance"
    },
    {
      "level": "H2",
      "text": "8 Reasons for SERP volatility and how to combat it to maintain keyword rankings"
    },
    {
      "level": "H2",
      "text": "Reason 1: Mixed search intent, SERP variety"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for mixed or vague search intent"
    },
    {
      "level": "H2",
      "text": "Reason 2: High keyword difficulty"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for high difficulty keywords"
    },
    {
      "level": "H2",
      "text": "Reason 3: High market competition"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for high market competition"
    },
    {
      "level": "H2",
      "text": "Reason 4: Trending topic"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for trending topics"
    },
    {
      "level": "H2",
      "text": "Reason 5: Indexing issues"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for indexing issues"
    },
    {
      "level": "H2",
      "text": "Reason 6: Google A/B testing SERPs"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for Google’s A/B SERP testing"
    },
    {
      "level": "H2",
      "text": "Reason 7: Algorithm changes or penalties"
    },
    {
      "level": "H2",
      "text": "How to combat SERP volatility for algorithm updates or penalties"
    },
    {
      "level": "H2",
      "text": "Reason 8: Cannibalization"
    },
    {
      "level": "H3",
      "text": "How to combat SERP volatility for cannibalization"
    },
    {
      "level": "H2",
      "text": "To combat SERP volatility: don’t panic, review the data, and optimize with confidence"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Adriana Stein\n          \n            Adriana Stein\n          \n            Adriana Stein"
}