{
  "url": "https://moz.com/blog/combat-5-infuriating-seo-problems-whiteboard-friday",
  "slug": "combat-5-infuriating-seo-problems-whiteboard-friday",
  "title": "How to Combat 5 of the SEO World's Most Infuriating Problems - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When SEOs with the best of intentions are stymied by things out of their control, it can make us absolutely crazy. In today's Whiteboard Friday, Rand offers some clarity and a way forward.",
  "content": "How to Combat 5 of the SEO World's Most Infuriating Problems Technical SEO | Whiteboard Friday By: Rand Fishkin May 15, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 15, 2015 How to Combat 5 of the SEO World's Most Infuriating Problems Technical SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. These days, most of us have learned that spammy techniques aren't the way to go, and we have a solid sense for the things we should be doing to rank higher, and ahead of our often spammier competitors. Sometimes, maddeningly, it just doesn't work. In today's Whiteboard Friday, Rand talks about five things that can infuriate SEOs with the best of intentions, why those problems exist, and what we can do about them. For reference, here's a still of this week's whiteboard. Click on it to open a high resolution image in a new tab! What SEO problems make you angry?Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about some of the most infuriating things in the SEO world, specifically five problems that I think plague a lot of folks and some of the ways that we can combat and address those.I'm going to start with one of the things that really infuriates a lot of new folks to the field, especially folks who are building new and emerging sites and are doing SEO on them. You have all of these best practices list. You might look at a web developer's cheat sheet or sort of a guide to on-page and on-site SEO. You go, \"Hey, I'm doing it. I've got my clean URLs, my good, unique content, my solid keyword targeting, schema markup, useful internal links, my XML sitemap, and my fast load speed. I'm mobile friendly, and I don't have manipulative links.\"Great. \"Where are my results? What benefit am I getting from doing all these things, because I don't see one?\" I took a site that was not particularly SEO friendly, maybe it's a new site, one I just launched or an emerging site, one that's sort of slowly growing but not yet a power player. I do all this right stuff, and I don't get SEO results.This makes a lot of people stop investing in SEO, stop believing in SEO, and stop wanting to do it. I can understand where you're coming from. The challenge is not one of you've done something wrong. It's that this stuff, all of these things that you do right, especially things that you do right on your own site or from a best practices perspective, they don't increase rankings. They don't. That's not what they're designed to do.1) Following best practices often does nothing for new and emerging sitesThis stuff, all of these best practices are designed to protect you from potential problems. They're designed to make sure that your site is properly optimized so that you can perform to the highest degree that you are able. But this is not actually rank boosting stuff unfortunately. That is very frustrating for many folks. So following a best practices list, the idea is not, \"Hey, I'm going to grow my rankings by doing this.\"On the flip side, many folks do these things on larger, more well-established sites, sites that have a lot of ranking signals already in place. They're bigger brands, they have lots of links to them, and they have lots of users and usage engagement signals. You fix this stuff. You fix stuff that's already broken, and boom, rankings pop up. Things are going well, and more of your pages are indexed. You're getting more search traffic, and it feels great. This is a challenge, on our part, of understanding what this stuff does, not a challenge on the search engine's part of not ranking us properly for having done all of these right things.2) My competition seems to be ranking on the back of spammy or manipulative linksWhat's going on? I thought Google had introduced all these algorithms to kind of shut this stuff down. This seems very frustrating. How are they pulling this off? I look at their link profile, and I see a bunch of the directories, Web 2.0 sites -- I love that the spam world decided that that's Web 2.0 sites -- article sites, private blog networks, and do follow blogs.You look at this stuff and you go, \"What is this junk? It's terrible. Why isn't Google penalizing them for this?\" The answer, the right way to think about this and to come at this is: Are these really the reason that they rank? I think we need to ask ourselves that question.One thing that we don't know, that we can never know, is: Have these links been disavowed by our competitor here?I've got my HulksIncredibleStore.com and their evil competitor Hulk-tastrophe.com. Hulk-tastrophe has got all of these terrible links, but maybe they disavowed those links and you would have no idea. Maybe they didn't build those links. Perhaps those links came in from some other place. They are not responsible. Google is not treating them as responsible for it. They're not actually what's helping them.If they are helping, and it's possible they are, there are still instances where we've seen spam propping up sites. No doubt about it.I think the next logical question is: Are you willing to lose your site or brand? What we don't see anymore is we almost never see sites like this, who are ranking on the back of these things and have generally less legitimate and good links, ranking for two or three or four years. You can see it for a few months, maybe even a year, but this stuff is getting hit hard and getting hit frequently. So unless you're willing to lose your site, pursuing their links is probably not a strategy.Then what other signals, that you might not be considering potentially links, but also non-linking signals, could be helping them rank? I think a lot of us get blinded in the SEO world by link signals, and we forget to look at things like: Do they have a phenomenal user experience? Are they growing their brand? Are they doing offline kinds of things that are influencing online? Are they gaining engagement from other channels that's then influencing their SEO? Do they have things coming in that I can't see? If you don't ask those questions, you can't really learn from your competitors, and you just feel the frustration.3) I have no visibility or understanding of why my rankings go up vs downOn my HulksIncredibleStore.com, I've got my infinite stretch shorts, which I don't know why he never wears -- he should really buy those -- my soothing herbal tea, and my anger management books. I look at my rankings and they kind of jump up all the time, jump all over the place all the time. Actually, this is pretty normal. I think we've done some analyses here, and the average page one search results shift is 1.5 or 2 position changes daily. That's sort of the MozCast dataset, if I'm recalling correctly. That means that, over the course of a week, it's not uncommon or unnatural for you to be bouncing around four, five, or six positions up, down, and those kind of things.I think we should understand what can be behind these things. That's a very simple list. You made changes, Google made changes, your competitors made changes, or searcher behavior has changed in terms of volume, in terms of what they were engaging with, what they're clicking on, what their intent behind searches are. Maybe there was just a new movie that came out and in one of the scenes Hulk talks about soothing herbal tea. So now people are searching for very different things than they were before. They want to see the scene. They're looking for the YouTube video clip and those kind of things. Suddenly Hulk's soothing herbal tea is no longer directing as well to your site.So changes like these things can happen. We can't understand all of them. I think what's up to us to determine is the degree of analysis and action that's actually going to provide a return on investment. Looking at these day over day or week over week and throwing up our hands and getting frustrated probably provides very little return on investment. Looking over the long term and saying, \"Hey, over the last 6 months, we can observe 26 weeks of ranking change data, and we can see that in aggregate we are now ranking higher and for more keywords than we were previously, and so we're going to continue pursuing this strategy. This is the set of keywords that we've fallen most on, and here are the factors that we've identified that are consistent across that group.\" I think looking at rankings in aggregate can give us some real positive ROI. Looking at one or two, one week or the next week probably very little ROI.4) I cannot influence or affect change in my organization because I cannot accurately quantify, predict, or control SEOThat's true, especially with things like keyword not provided and certainly with the inaccuracy of data that's provided to us through Google's Keyword Planner inside of AdWords, for example, and the fact that no one can really control SEO, not fully anyway.You get up in front of your team, your board, your manager, your client and you say, \"Hey, if we don't do these things, traffic will suffer,\" and they go, \"Well, you can't be sure about that, and you can't perfectly predict it. Last time you told us something, something else happened. So because the data is imperfect, we'd rather spend money on channels that we can perfectly predict, that we can very effectively quantify, and that we can very effectively control.\" That is understandable. I think that businesses have a lot of risk aversion naturally, and so wanting to spend time and energy and effort in areas that you can control feels a lot safer.Some ways to get around this are, first off, know your audience. If you know who you're talking to in the room, you can often determine the things that will move the needle for them. For example, I find that many managers, many boards, many executives are much more influenced by competitive pressures than they are by, \"We won't do as well as we did before, or we're losing out on this potential opportunity.\" Saying that is less powerful than saying, \"This competitor, who I know we care about and we track ourselves against, is capturing this traffic and here's how they're doing it.\"Show multiple scenarios. Many of the SEO presentations that I see and have seen and still see from consultants and from in-house folks come with kind of a single, \"Hey, here's what we predict will happen if we do this or what we predict will happen if we don't do this.\" You've got to show multiple scenarios, especially when you know you have error bars because you can't accurately quantify and predict. You need to show ranges.So instead of this, I want to see: What happens if we do it a little bit? What happens if we really overinvest? What happens if Google makes a much bigger change on this particular factor than we expect or our competitors do a much bigger investment than we expect? How might those change the numbers?Then I really do like bringing case studies, especially if you're a consultant, but even in-house there are so many case studies in SEO on the Web today, you can almost always find someone who's analogous or nearly analogous and show some of their data, some of the results that they've seen. Places like SEMrush, a tool that offers competitive intelligence around rankings, can be great for that. You can show, hey, this media site in our sector made these changes. Look at the delta of keywords they were ranking for versus R over the next six months. Correlation is not causation, but that can be a powerful influencer showing those kind of things.Then last, but not least, any time you're going to get up like this and present to a group around these topics, if you very possibly can, try to talk one-on-one with the participants before the meeting actually happens. I have found it almost universally the case that when you get into a group setting, if you haven't had the discussions beforehand about like, \"What are your concerns? What do you think is not valid about this data? Hey, I want to run this by you and get your thoughts before we go to the meeting.\" If you don't do that ahead of time, people can gang up and pile on. One person says, \"Hey, I don't think this is right,\" and everybody in the room kind of looks around and goes, \"Yeah, I also don't think that's right.\" Then it just turns into warfare and conflict that you don't want or need. If you address those things beforehand, then you can include the data, the presentations, and the \"I don't know the answer to this and I know this is important to so and so\" in that presentation or in that discussion. It can be hugely helpful. Big difference between winning and losing with that.5) Google is biasing to big brands. It feels hopeless to compete against themA lot of people are feeling this hopelessness, hopelessness in SEO about competing against them. I get that pain. In fact, I've felt that very strongly for a long time in the SEO world, and I think the trend has only increased. This comes from all sorts of stuff. Brands now have the little dropdown next to their search result listing. There are these brand and entity connections. As Google is using answers and knowledge graph more and more, it's feeling like those entities are having a bigger influence on where things rank and where they're visible and where they're pulling from.User and usage behavior signals on the rise means that big brands, who have more of those signals, tend to perform better. Brands in the knowledge graph, brands growing links without any effort, they're just growing links because they're brands and people point to them naturally. Well, that is all really tough and can be very frustrating.I think you have a few choices on the table. First off, you can choose to compete with brands where they can't or won't. So this is areas like we're going after these keywords that we know these big brands are not chasing. We're going after social channels or people on social media that we know big brands aren't. We're going after user generated content because they have all these corporate requirements and they won't invest in that stuff. We're going after content that they refuse to pursue for one reason or another. That can be very effective.You better be building, growing, and leveraging your competitive advantage. Whenever you build an organization, you've got to say, \"Hey, here's who is out there. This is why we are uniquely better or a uniquely better choice for this set of customers than these other ones.\" If you can leverage that, you can generally find opportunities to compete and even to win against big brands. But those things have to become obvious, they have to become well-known, and you need to essentially build some of your brand around those advantages, or they're not going to give you help in search. That includes media, that includes content, that includes any sort of press and PR you're doing. That includes how you do your own messaging, all of these things.(C) You can choose to serve a market or a customer that they don't or won't. That can be a powerful way to go about search, because usually search is bifurcated by the customer type. There will be slightly different forms of search queries that are entered by different kinds of customers, and you can pursue one of those that isn't pursued by the competition.Last, but not least, I think for everyone in SEO we all realize we're going to have to become brands ourselves. That means building the signals that are typically associated with brands -- authority, recognition from an industry, recognition from a customer set, awareness of our brand even before a search has happened. I talked about this in a previous Whiteboard Friday, but I think because of these things, SEO is becoming a channel that you benefit from as you grow your brand rather than the channel you use to initially build your brand.All right, everyone. Hope these have been helpful in combating some of these infuriating, frustrating problems and that we'll see some great comments from you guys. I hope to participate in those as well, and we'll catch you again next week for another edition of Whiteboard Friday. Take care. \u0003Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Combat 5 of the SEO World's Most Infuriating Problems"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Combat 5 of the SEO World's Most Infuriating Problems"
    },
    {
      "level": "H2",
      "text": "What SEO problems make you angry?"
    },
    {
      "level": "H4",
      "text": "1) Following best practices often does nothing for new and emerging sites"
    },
    {
      "level": "H4",
      "text": "2) My competition seems to be ranking on the back of spammy or manipulative links"
    },
    {
      "level": "H4",
      "text": "3) I have no visibility or understanding of why my rankings go up vs down"
    },
    {
      "level": "H4",
      "text": "4) I cannot influence or affect change in my organization because I cannot accurately quantify, predict, or control SEO"
    },
    {
      "level": "H4",
      "text": "5) Google is biasing to big brands. It feels hopeless to compete against them"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}