{
  "url": "https://moz.com/blog/coming-to-mozcon-tips-for-your-conferencing",
  "slug": "coming-to-mozcon-tips-for-your-conferencing",
  "title": "Coming to #MozCon? Tips for Your Conferencing. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Coming to MozCon? Here are some tips to help you make the most of your experience.",
  "content": "Coming to #MozCon? Tips for Your Conferencing. Moz News By: Erica McGillivray July 23, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray July 23, 2012 Coming to #MozCon? Tips for Your Conferencing. Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm so excited to meet all of you coming out for MozCon this week. Like many of you coming for MozCon, it's my first one too. Here are some n00b tips (and a few refreshers for those long-time MozCon attendees) to help you out. Welcome to the PacificNorthwest You're probably wondering what to pack in your suitcase. Should you bring an umbrella and rain jacket? Should you pack shorts and sunglasses? My recommendation: both. This week's weather is predicted to range from mid-50s to the 80s. In Seattle, bringing something for the rain is never a bad idea. Plus, you'll be indoors at the Westin -- hotels are some of the few places in Seattle with air conditioning -- so you'll want to factor that in. Don't worry, we'll have a coat check on the fourth floor for your stuff. If you're wondering about dress code, it's true that we wear flannel and blue jeans 365-days a year. Dress in what makes you comfortable around your industry peers. Whether you're tailored to perfection like Joan Holloway or look more like a lumberjack, you'll fit right in. I'll be wearing jeans and my staff shirt for all three days. Make New Friends, Connections, and Meet the SEOmoz Staff There are going to be ~750 people at MozCon this year. Bigger than ever! One of the most wonderful things about MozCon is the chance to meet other SEOs and inbound marketers. Whether you're saying hi to someone you only knew on Twitter or making a new friend while tossing a bowling ball, you'll find yourself rubbing elbows with geniuses all week long. Plus, there will be SEOmoz staff a-plenty for you to chat with. Feel free to ask anyone wearing an \"I'm with Roger\" t-shirt what it's like to work at the Mozplex or just where lunch is. These people are here to help you! Great Content Automatically Available for You We're super excited this year to use our MozCon Live site: https://moz.com/mozcon-live. (Sorry, friends, this isn't quite ready for you to see!) Here, you will be able to see agenda, find out more information about parties and the speakers, watch the Twitter hashtag #MozCon, and download the speakers' slide decks as they present. Also, you can ask your q&a questions for the speakers here! For those community members who can't make it, you can join in a bit of the fun and knowledge. Check-in Here Our Registration area is located on the second floor of the Westin. There you'll be able to pick up your MozCon badge and swag. All you need is a print out of your ticket or photo ID. Bacon, Bacon, Bacon: We Feed You Your MozCon ticket comes with breakfast, lunch, and two snacks. Due to popular demand, there will be bacon for breakfast one morning. We should have plenty of options for all sorts of people: carnivores, vegetarians, vegans, lactose intolerant, etc. Or those who only eat ice cream and cupcakes. Breakfast and lunch will be located on the second and first floors of the Westin. (The main hub of activity, including the main show, is on the fourth floor.) Additionally, at our night meetup on Wednesday at the Hard Rock, we'll be providing appetizers. On Thursday for the big Garage bash, we'll have food, drinks, karaoke, bowling, and more. Got Social Media? On the Twitters, we're #MozCon. Don't forget to RSVP on our Google+ event page. Meet Roger and Hug the Cuddliest Robot Around! Roger will be making appearances so you'll be able to get a photo op with him. Don't be shy as Roger's thrilled to meet you. Give him a hug! His photo booth is located on the fourth floor, and there will be a sign with all the times for his appearances, so you won't miss him. Wireless Connections, Oh My! Those of you who went last year probably remember that we had issues with wi-fi. We're working to make wireless happen, but we need your help. To make our wifi connection strong and out of courtesy for other attendees, please only hook 1 device up to our wifi. Also, refrain from using mifis, hotspots, or any other personal wireless network creator as with over 1,500 wireless devices in the room, these signals may work for you, but degrade the main wifi signal for everyone else. If you are having a problem connecting to our wifi signal -- and you seem to be the only one -- please ask any SEOmoz staffer to assist you. There will be table tents with wireless network and password information. Overflow Room: 5th Avenue Need to do some heads down work? On the fourth floor, we'll have the 5th Avenue room open for you. There will be a live feed of what's happening on the main stage. But if you need a break or a corner to tuck in for a while, this is a great place. Listen to Laura The fabulous Laura Lippay from How's Your Pony? will be emceeing MozCon. She'll be introducing our wonderful speakers, sorting through q&a, and generally keeping the show running. If she asks you to jump, time to jump. Have a Wonderful Time in Seattle! Check out Jon's recommendations for coffee shops and Rand's recommendations for food. Seattle is ridiculously amazing. Photos of SEOmoz events by Rudy Lopez. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Coming to #MozCon? Tips for Your Conferencing."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Coming to #MozCon? Tips for Your Conferencing."
    },
    {
      "level": "H3",
      "text": "Welcome to the PacificNorthwest"
    },
    {
      "level": "H3",
      "text": "Make New Friends, Connections, and Meet the SEOmoz Staff"
    },
    {
      "level": "H3",
      "text": "Great Content Automatically Available for You"
    },
    {
      "level": "H3",
      "text": "Check-in Here"
    },
    {
      "level": "H3",
      "text": "Bacon, Bacon, Bacon: We Feed You"
    },
    {
      "level": "H3",
      "text": "Got Social Media?"
    },
    {
      "level": "H3",
      "text": "Meet Roger and Hug the Cuddliest Robot Around!"
    },
    {
      "level": "H3",
      "text": "Wireless Connections, Oh My!"
    },
    {
      "level": "H3",
      "text": "Overflow Room: 5th Avenue"
    },
    {
      "level": "H3",
      "text": "Listen to Laura"
    },
    {
      "level": "H3",
      "text": "Have a Wonderful Time in Seattle!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}