{
  "url": "https://moz.com/blog/communicating-in-constantly-changing-seo-landscape",
  "slug": "communicating-in-constantly-changing-seo-landscape",
  "title": "Communicating to Clients & Stakeholders in a Constantly Changing SEO Landscape - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Setting the right expectations early can help manage client and stakeholder anxiety when change happens. This 11-point checklist will help you develop highly effective, good-sense strategies for better communication!",
  "content": "Communicating to Clients & Stakeholders in a Constantly Changing SEO Landscape SEO Consulting | SEO Basics By: Kameron Jenkins February 11, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins February 11, 2019 Communicating to Clients & Stakeholders in a Constantly Changing SEO Landscape SEO Consulting | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When your target is constantly moving, how can you keep your clients informed and happy? Raise your hand if you’ve ever struggled to keep up with all the changes in our industry. Go ahead, don’t be shy! Even the most vigilant SEOs have been caught off guard by an algorithm update, changes to the SERP layout, or improvements to the tools we rely on. It can be tiring trying to keep up with a constantly moving target, but it doesn’t even stop there. SEOs must also explain those developments to their clients and stakeholders. Work at an agency? Your clients will want to know that you’re helping them stay relevant. During my agency years, I can’t tell you how many times clients emailed in with a link to an article on the topic of a new development asking, “Do we need to be worried about this? How can we use this for our SEO?” Keeping apprised of these changes and informing your client how it applies to them is a critical component of not just campaign success, but customer loyalty. Work in-house? The main difference here is that your client is your boss. Whereas at an agency you might lose a client over communication lapses, in-house SEOs could lose their jobs. That’s obviously the worst-case scenario, but if you’re in a budget-conscious, SEO-immature company, failing to stay relevant and communicate those changes effectively could mean your boss stops seeing the value in your position. Anticipating changes and mitigating anxiety There are some changes we know about ahead of time. For example, when Google announced the mobile friendly update (remember #mobilegeddon?), they did so two months ahead of the actual rollout, and they had also been encouraging the use of mobile-friendly design long before that. Google announced HTTPS as a ranking signal back in 2014 and had been advocating for a secure web long before that, but they didn’t start adding the “not secure” warning to all non-HTTPS pages in Chrome until July 2018. Big changes usually warrant big announcements ahead of the rollout. You need time to prepare for changes like this and to use that time to prepare your clients and stakeholders as well. It’s why Moz put so much effort into educational materials around the rollout of the new DA. But in order to mitigate the anxiety these changes can cause, we have to know about them. So where can we go to stay up-to-date? If you’ve been in the SEO industry for any length of time, these sources likely won’t be new to you, but they’re some of the best ways to keep yourself informed: The Google Webmaster Central Blog: Official news on crawling and indexing sites for the Google index. The Keyword: Google’s main company blog — good for staying up-to-date with company news and product updates. Industry blogs like Search Engine Roundtable and Search Engine Journal or local-specific SEO blogs like Mike Blumenthal’s and LocalU (there are tons more). Paying attention to notices and updates from your SEO software/services providers. Experience! When you’re in the trenches every day, you’re bound to discover something new. If you know a change like this is coming, be proactive! Inform your clients of what the change is, how it affects them, and what you plan on doing about it. For example: Hey [client]! One of the metrics that we include in your reporting, Domain Authority (DA), will be changing next month, so we wanted to let you know what you can expect! Moz is changing how they calculate DA, and as a result, some DA scores may be higher or lower. Rest assured, we’ll be monitoring your DA score to see how it changes in relation to your competitors’ scores. Here are some helpful slides for more information on the update, or feel free to call us and we’ll be happy to walk you through it in more detail. When you’re able to proactively communicate changes, clients and stakeholders have less cause to worry. They can see that you’re on top of things, and that their campaign is in good hands. What about the changes you didn’t see coming? Plenty of changes happen without warning. What are SEOs supposed to do then? To answer that question, I think we need to back it all the way up to your client’s first day with your agency (or for in-housers, your first few days on the job). Even with unexpected changes, preventative measures can help SEOs react to these changes in a way that doesn’t compromise the stability of their client or stakeholder relationship. What are those preventative measures? Give them a brief overview of how search works: Don’t venture too far into the weeds, but a basic overview of how crawling, indexing, and ranking work can help your clients understand the field they’re playing on. Explain the volatile nature of search engines: Google makes changes to their algorithm daily! Not all of those are major, and you don’t want to scare your client into thinking that you’re flying totally blind, but they should at least know that change is a normal part of search. Prepare them for unannounced changes: Let your client know that while there are some changes we can see coming, others roll out with no prior notice. This should prevent any upset caused by seeing changes they weren’t informed about. By setting the stage with this information at the outset of your relationship, clients and stakeholders are more likely to trust that you’ve got a handle on things when changes do occur. Just make sure that you respond to unexpected changes the same way you would prepare your client for a planned change: tell them what the change was, how it affects them (if at all), and what you’re doing about it (if anything). Your communication checklist Whether you’re an SEO at an agency or in-house, you have a lot on your plate. Not only do you have to be a good SEO — you also serve as a sort of professional justifier. In other words, it’s not only about how well you did, but also how well you communicated what you did. Like I said, it’s a lot. But hopefully I have something that can help. I put together this list of tips you can use to guide your own client/stakeholder communication strategy. Every one of us is in a unique situation, so choose from the checklist accordingly, but my hope is that you can use this brain dump from my years in an agency and in-house to make the communication side of your job easier. ✓ Set the stage from the beginning SEO can be a bumpy ride. Lay the foundation for your campaign by making sure your client understands the volatile nature of the industry and how you’ll respond to those changes. Doing so can foster trust and confidence, even amidst change. ✓ Never be defensive Sometimes, clients will bring something to your attention before you’ve had a chance to see it, whether that be a traffic dip, a Google update, or otherwise. This can prompt a concerned “What’s going on?” or “Why didn’t I know about this?” Don’t try to spin this. Own up to the missed opportunity for communication and proceed to give the client the insight they need. ✓ Be proactive whenever possible Aim to make missed communication opportunities the exception, not the rule. Being proactive means having your finger always on the pulse and intuitively knowing what needs to be shared with your client before they have to ask. ✓ Acknowledge unexpected changes quickly If you encounter a change that you weren’t prepared for, let your client know right away — even if the news is negative. There’s always the temptation to avoid this in hopes your client never notices, but it’s much better to acknowledge it than look like you were hiding something or totally out of the loop. Acknowledge the change, explain why it happened, and let your client know what you’re doing about it. ✓ Always bring it back to the “so what?” For the most part, your clients don’t have time to care about the finer points of SEO. When sharing these updates, don’t spend too long on the “what” before getting to the “how does this impact me?” ✓ Avoid jargon and simplify SEO has a language all its own, but it’s best to keep that between SEOs and not let it bleed into our client communication. Simplify your language wherever possible. It can even be helpful to use illustrations from everyday life to drive your point home. ✓ Add reminders to reports Communicate with your clients even when you’re not calling or emailing them! By adding explanations to your clients’ reports, you can assuage the fears that can often result from seeing fluctuations in the data. ✓ Keep updates actionable and relevant Search changes constantly. That means there’s tons of news you could be sending to your client every day. Do you need to send it all? Not necessarily -- it’s best to keep updates relevant and actionable. Instead of “Hey there was an update [link to explainer post]” it’s much more relevant to say, “Hey, there was an update relevant to your industry and here’s what we’re planning on doing about it.” ✓ Put changes into perspective As humans, it’s in our nature to make mountains out of molehills. As the SEO manager, you can prepare for these types of overreactions by always being ready to put a change into perspective (ex: “here’s how this does/doesn’t impact your leads and revenue”). ✓ Adapt your communication to your client’s preferences and the nature of the change We all work with different types of clients and stakeholders. There are the “Can you call me?” clients, the “I have an idea” clients, the clients who never respond… you get the idea. The communication method that’s best for one client might not be well received by another. It’s also important to cater your communication method to the nature of the changes. Was there a big update? A phone call might be best. Small update? An email will probably suffice. ✓ Practice empathy Above all else, let’s all strive to be more empathetic. Because we know SEO so well, it can be easier for us to take changes in stride, but think about your clients or your boss. SEO might as well be a black box to many business owners, so changes can be even scarier when you don’t know what’s going on and your business is at stake. Putting it all into practice If DA is one of your reporting metrics, or something your client/stakeholder pays attention to, then our March 5th update is the perfect opportunity to put all of this into practice. We have a great DA 2.0 resource center for you so that you can prepare yourself, and those dependent on you, for the change. Here’s what’s included: An explainer video A Q&A forum A slide deck A white paper Russ Jones will also be hosting an entire webinar on this topic to help you understand these changes so you can speak intelligently about them to your clients and stakeholders. Join him on Thursday, February 21 at 10am PDT: Save my spot! Communicating with clients and stakeholders is a bit of an art form, but with empathy and preparedness, we can tackle any change that’s thrown our way. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Communicating to Clients & Stakeholders in a Constantly Changing SEO Landscape"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Communicating to Clients & Stakeholders in a Constantly Changing SEO Landscape"
    },
    {
      "level": "H2",
      "text": "When your target is constantly moving, how can you keep your clients informed and happy?"
    },
    {
      "level": "H2",
      "text": "Anticipating changes and mitigating anxiety"
    },
    {
      "level": "H2",
      "text": "What about the changes you didn’t see coming?"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Your communication checklist"
    },
    {
      "level": "H3",
      "text": "✓ Set the stage from the beginning"
    },
    {
      "level": "H3",
      "text": "✓ Never be defensive"
    },
    {
      "level": "H3",
      "text": "✓ Be proactive whenever possible"
    },
    {
      "level": "H3",
      "text": "✓ Acknowledge unexpected changes quickly"
    },
    {
      "level": "H3",
      "text": "✓ Always bring it back to the “so what?”"
    },
    {
      "level": "H3",
      "text": "✓ Avoid jargon and simplify"
    },
    {
      "level": "H3",
      "text": "✓ Add reminders to reports"
    },
    {
      "level": "H3",
      "text": "✓ Keep updates actionable and relevant"
    },
    {
      "level": "H3",
      "text": "✓ Put changes into perspective"
    },
    {
      "level": "H3",
      "text": "✓ Adapt your communication to your client’s preferences and the nature of the change"
    },
    {
      "level": "H3",
      "text": "✓ Practice empathy"
    },
    {
      "level": "H2",
      "text": "Putting it all into practice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}