{
  "url": "https://moz.com/blog/community-speakers-mozcon-2017",
  "slug": "community-speakers-mozcon-2017",
  "title": "Let’s Give It Up for the Community Speakers of MozCon 2017! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here they are — the 6 winning pitches for MozCon 2017's community speaker slots! From site migration tips to mining content ideas on Reddit to paid traffic so good you'll want to quit organic, these talks are sure to delight. Get your sneak peek (and your ticket!) now.",
  "content": "Let’s Give It Up for the Community Speakers of MozCon 2017! SEO Events | Advanced SEO | Moz News By: Ronell Smith May 10, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith May 10, 2017 Let’s Give It Up for the Community Speakers of MozCon 2017! SEO Events | Advanced SEO | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whew! That's the collective expression shared by the committee who perused this year's community speaker pitches for MozCon 2017, which will be held July 17–19 at the Washington State Convention Center in Seattle, WA. Let's just say, the entire group brought it. There were more than 120 people vying for six speaking slots. We've written in the past about how the committee whittles the submissions down, and then, before making the final selections from a group of about 20 people, we watch videos, peruse decks on SlideShare, and try to determine if a potential speaker would be successful on the stage. (Speaking in front of 1,500 people can be unnerving, even for the most accomplished speaker.) After all, we want everyone to walk away from MozCon feeling as though the event was a benefit. In general, during the final stages of the process, we're looking for/at three elements with regards to the submission alone: Strength of the pitch (e.g., value, relevance to the audience, etc.), Whether or not the info can reasonably be delivered in the time allotted, and Does it fit with overall programming (i.e., assuming it clears the two other hurdles, does it address a need for the event?) The winning pitches nailed each of the elements above; we're confident the talks will be well-received by the audience. Without further adieu, let's take a closer look at this spectacular group. [Eds. note: Pitches were were edited for length and to help speakers retain an element of surprise.] Daniel Russell@dnlrussell Daniel Russell is a director at Go Fish Digital. Part of the winning pitch: \"It almost seems too good to be true — online forums where people automatically segment themselves into different markets and demographics and then vote on what content they like best. These forums, including Reddit, are treasure troves of content ideas. I'll share actionable insights from three case studies that demonstrate how your marketing can benefit from content on Reddit.\" Jayna Grassel@jaynagrassel Jayna is the SEO manager at Dick's Sporting Goods and is the unofficial world's second-fastest crocheter. Part of the winning pitch: \"Site. Migration. No two words elicit more fear, joy or excitement to a digital marketer. When the idea was shared three years ago, the company was excited. They dreamed of new features and efficiency. But as SEOs, we knew better. We knew there would be midnight strategy sessions with IT. More UAT environments than we could track. Deadlines, requirements and compromises forged through hallway chats. ... The result was a stable transition with minimal dips in traffic. What we didn't know, however, was the amount of cross-functional coordination that was required to pull it off.\" Joel Klettke @joelklettke Joel is freelance conversion copywriter and strategist for Business Casual Copywriting. He also owns and runs Case Study Buddy, a done-for-you case studies service. Part of the winning pitch: \"If you want to write copy that converts, you need to get into your customers' heads. But how do you do that? How do you know which pain points you need to address, features customers care about, or benefits your audience needs to hear? Marketers are sick and tired of hearing 'it depends.' I'll give the audience a practical framework for writing customer-driven copy that any business can apply.\" Kane Jamison@kanejamison Kane is the founder of Content Harmony, a content marketing agency based in Seattle. Part of the winning pitch: \"The 8 Paid Promotion Tactics That Will Get You To Quit Organic Traffic: Digital marketers are ignoring huge opportunities to promote their content through paid channels, and I want to give them the tools to get started. How many brands out there are spending $500+ on a blog post, and then moving on to the next one before that post has been seen by 500 people, or even 50? For some reason, everyone thinks about Outbrain and native ads when we talk about paid content distribution, but the real opportunity is in *highly-targeted* paid social.\" Kathryn Cunningham @kac4509 Kathryn is an SEO consultant for Adept Marketing, although to many of her office mates she is known as the \"Excel nerd.\" Part of the winning pitch: \"How to build an SEO-intent based framework for any business: Everyone knows intent behind the search matters. In e-commerce, intent is somewhat easy to see. B2B, or better yet healthcare, isn't quite as easy. Matching persona intent to keywords requires a bit more thought. I will cover how to find intent modifiers during keyword research, how to organize those modifiers into the search funnel, and how to quickly find unique universal results at different levels of the search funnel to utilize.\" Matthew Edgar@MatthewEdgarCO Matthew is a web analytics and technical marketing consultant at Elementive. Part of the winning pitch: \"3 Event Tracking Tricks and Tips For Monitoring UX Details: Great SEO is increasingly dependent on having a website with a great user experience. To make your user experience great requires carefully tracking what people do so that you always know where to improve. But what do you track? In this 15-minute talk, I’ll cover three effective and advanced ways to use event tracking in Google Analytics to understand a website's user experience.\" Curiosity piqued? You could be in one of those seats yourself, watching them live: Grab your ticket now! Feel free to drop me a note in the comments below. I'm starting to get excited about MozCon 2017. I hope to see you there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Let’s Give It Up for the Community Speakers of MozCon 2017!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Let’s Give It Up for the Community Speakers of MozCon 2017!"
    },
    {
      "level": "H2",
      "text": "Daniel Russell"
    },
    {
      "level": "H2",
      "text": "Jayna Grassel"
    },
    {
      "level": "H2",
      "text": "Joel Klettke"
    },
    {
      "level": "H2",
      "text": "Kane Jamison"
    },
    {
      "level": "H2",
      "text": "Kathryn Cunningham"
    },
    {
      "level": "H2",
      "text": "Matthew Edgar"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}