{
  "url": "https://moz.com/blog/command-ampamp-conquer-your-long-tail",
  "slug": "command-ampamp-conquer-your-long-tail",
  "title": "Command and Conquer Your Long Tail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know blog authors loves to write a long and persuasive introduction before they get to the point. Well, we all need to show that we know what we're talking about before we bring some good value. I'm doing the same thing most of the time, but not this time. So let's get to the point, and…",
  "content": "Command and Conquer Your Long Tail SEO Tools T By: trafikant September 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! T By: trafikant September 29, 2009 Command and Conquer Your Long Tail SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Everybody knows what long tail stands for in SEO terms (just Google it...). Everybody tells you that regardless your hardcore keywords, which are very competitive, you need to find niches and other related keywords, with less or no competition, and rule them! So, I'm gonna suggest a quick way to do it, which fits best for websites with great fresh content like blogs. You need to do it on daily basis. It's short but very rewarding. Wake up, brush your teeth and check your analytics tool, but setup your reports to run on yesterday data only. Go to your keyword report, which shows you the searches that has been made by your visitors, before they have entered your site. Nice list, huh? Sort it by Visits. Locate all the new and surprising keywords (what? 10 visits just from visitors who searched \"the best marketing agency in the world\" ??) Run this keywords in any keyword tool, like Google Adwords keyword tool, and figure out how many searches are been made every month on this keywords, global and local. Can you find some surprising numbers with high potential? Great! Open google and search for any of this keywords with high search volume and mark your position. You probably on the first page, but you might be surprised how deep people might go. (yes...I'm talking about the third page.) Did you find some good position or position with good potential? Great! SEO those keyword to death and rule the world! What to do with a page about some old topic? Maybe your landing page for some keywords is just a blog post. It's not selling anything directly or talking high about your services. Now it's a great opportunity to take this post, and put some pre-sale content. Example: Old: \"In the end, KEYWORD KEYWORD is not simple as it seems.\" New: \"here in [your company name+Contact Us link] we know that KEYWORD KEYWORD is not simple as it seems.\" What to do with a page which is not relevant for my business anymore? What do you mean? are you gonna skip this opportunity? It's time to sell your traffic. Contact a company which offers those \"irrelevant\" services and: Offer them a link to their site from the post, for commission based on clicks ,leads or whatever. Or Reciprocal link. Offer them a 60x120 flash banner ad. Any more ideas? That's it guys. Just do it everyday and don't forget to check your old optimization for last week keywords. Please share your thoughts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Command and Conquer Your Long Tail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Command and Conquer Your Long Tail"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "trafikant\n          \n            trafikant"
}