{
  "url": "https://moz.com/blog/computationally-expensive-what-google-can-cant-do",
  "slug": "computationally-expensive-what-google-can-cant-do",
  "title": "Computationally Expensive - What Google Can & Can't Do - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Even the great and powerful Google is limited in the number of operations and complexity of calculations in the algorithm. Many SEOs often attribute far more power and subtlety to Google's ranking criteria and filtering technology than is technologically p...",
  "content": "Computationally Expensive - What Google Can & Can't Do Search Engines By: Rand Fishkin January 24, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 24, 2005 Computationally Expensive - What Google Can & Can't Do Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Even the great and powerful Google is limited in the number of operations and complexity of calculations in the algorithm. Many SEOs often attribute far more power and subtlety to Google's ranking criteria and filtering technology than is technologically possible, even with their recent growth to more than 100,000 servers (see NY Times Article). Google is indeed the powerhouse of the search engines and their algorithm undoubtedly contains more than 100 and possibly even 150 major ranking criteria. However, their ability to 'spy' on SEOs, filter out SEO link-building techniques (as opposed to naturally built links) and generally confound the search optimizers of the world are greatly over-estimated. As noted in the now-infamous Keyword Co-Occurence & Semantic Connectivity thread at SEW, just linking together ideas via keyword co-occurence is an expensive process that taxes Google's resources daily. Google may be too powerful, but the likelihood of some of the more outlandish theories about Google's ability to identify SEO tactics and penalize based on their use is still the realm of science fiction - at least for a few more years. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Computationally Expensive - What Google Can & Can't Do"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Computationally Expensive - What Google Can & Can't Do"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}