{
  "url": "https://moz.com/blog/competitor-and-site-analysis-using-opensiteexplorer-and-seomoz-tools",
  "slug": "competitor-and-site-analysis-using-opensiteexplorer-and-seomoz-tools",
  "title": "Competitor and Site Analysis Using OpenSiteExplorer and Other SEOmoz Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A new potential client calls and starts talking about how they don't rank and what can be done to help. Or...an existing client calls and says they want to rank for a new set of keywords. These are all familiar situations. As a SEOer, what's the first thing you do? That's right - jump in and figure…",
  "content": "Competitor and Site Analysis Using OpenSiteExplorer and Other SEOmoz Tools SEO Tools By: Susan Rust November 10, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Susan Rust November 10, 2010 Competitor and Site Analysis Using OpenSiteExplorer and Other SEOmoz Tools SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A new potential client calls and starts talking about how they don't rank and what can be done to help. Or...an existing client calls and says they want to rank for a new set of keywords. These are all familiar situations. As a SEOer, what's the first thing you do? That's right - jump in and figure out what's going on with the client's site and how competitive is their online market. We've all tried different tools and followed various metrics to help in our quest. In the past, I relied on topline metrics such as PageRank, Google Indexed content, Domain Age, Alexa Ranking, Inbound Links (Link Domain) and similar metrics, but over time these have proven to be too narrow and not sufficient to create a full picture. Lately I've been using more and more SEOmoz metrics and tools, which have proven very useful and predictive. After some trial and error, I've arrived at the following mix of metrics and process, mostly from OpenSiteExplorer & SEOmoz, for evaluating a website and the competitiveness of it's online market. To explain the process and tools, following is an example review of the highly competitive \"used college textbooks\" vertical. This illustration (i) identifies the key metrics used and why, (ii) reviews three data sets of results for three target keywords, (iii) determines the dominant trends of this particular vertical and (iv) identifies an initial SEO strategy based on these findings. I hope this post contributes to the overall quest to understand how and why different sites rank and are rewarded by Google. In addition, I welcome feedback and experiences from others. Ok, let's get started... Step 1) Key Metrics Used in Analysis Following are the specific metrics used and why, along with (skimpy) definitions. Please see SEOmoz.org and OpenSiteExplorer.org for more detail description of these tools. Page Authority (PA): 0 to 100 ranking that reflects the \"authority\" of a specific URL (or page). Page Authority gives a good picture of the relevancy and quantity of high quality sites and domains that link to the page. Domain Authority (DA): 0 to 100 ranking that reflects the \"authority\" of a root domain (e.g., mysite.com). Same as PA but for the entire domain. Unique Domains - Page: The number of unique domains with links that point to a specific URL or page (for example, multiple links from www.example.com count as one unique domain). This reflects the quality of inbound links as Google looks at specific linking domains and the quantity of unique domains tends to be a better predictor of site \"authority\" than simply the number of all inbound links (including multiple links from the same URL or domain). Unique URLs - Page: The number of unique URLs with links that point to a specific URL or page (for example, two links from the same URL count as one link). This reflects the true quantity of inbound links as Google looks at the specific linking URLs and domains. Unique Domains - Domain: Same as Unique Domains - Page but for the entire domain. Unique URLs - Domain: Same as Unique URLs - Page but for the entire domain. KW Relevance - Page: 0 to 100% score by SEOmoz's LDA tool that uses topic modeling to indicate how relevant a specific URL or page is for a specific keyword or phrase. Launched in summer of 2010, the LDA tool has proven a good predictor of search rankings. See SEOmoz.org/lab for more information on using this tool. KW in URL: 0 to 100% score that reflects how many of the target keywords are present in the ranking URL. In this example, \"textbooks\" is treated as two words so having \"textbooks\" in the URL is 66%. Step 2) Compile & Review SERP Data For this vertical, we already know that the three primary target keywords are \"used textbooks\", \"cheap textbooks\" and \"college textbooks\". This came primarily from a combination of industry knowledge and the keywords from high-ranking sites (as inferred from their on-page keyword targeting and organic & Adwords data from SEMrush, another helpful tool). Let's look at the results for the first keyword. #1 Used Textbooks - Following is the overview of primary SEO metrics for the top 10 sites ranking in Google for \"used textbooks\". Above lists all the data points for each of the top 10 sites on Google.com. With some trial and error, I decided to focus on Domain Authority, Page Authority, Keyword Relevance and Keyword in URL as primary ranking indicators. The following chart helps illustrate the relevancy of these separate data sets: From the above data, the following general patterns are identifiable: 1) KW in URL still very important - can boost rankings for URL with low Domain Authority and Page Authority. 2) KW Relevance matters - especially when coupled with high KWs in URL, high DA and high PA. 3) DA and PA significantly affect rankings, but when DA and PA are equal for all sites, KW Relevance and KWs in URL generally predict which sites rank. 4) Onpage KW Relevance still very important - as well as unique, highly relevant inbound linking domains. Ok, now let's look at a second example to see if the general patterns are still identifiable. #2 Cheap Textbooks - Following is the overview of primary SEO metrics for the top 10 sites ranking in Google for \"cheap textbooks\". The following chart highlights the primary ranking indicators of Domain Authority, Page Authority, Keyword Relevance and Keyword in URL. Let's see if the same general patterns are here too. As with \"used textbooks\", \"cheap textbooks\" shows similar trends (as listed above). OK, now let's look at the third keyword for this example. #3 College Textbooks - Following is the overview of primary SEO metrics for the top 10 sites ranking in Google for \"college textbooks\". Focusing on Domain Authority, Page Authority, Keyword Relevance and Keyword in URL, let's see if the same general patterns are present. Here too, the similar patterns are observable (as outlined above). Step 3) Identify Dominant Trends Now that we've pulled and reviewed the data, and identified the general patterns, lets go a little deeper and identify the dominant trends for this particular vertical. To do this, I like to identify the \"Best Case SEO Scenarios\" for ranking. This would be as if \"in a perfect world\" each site could change anything about their Domains, URLs, site structure, etc. While we know this is not always feasible or recommended (especially for high-ranking sites in competitive and lucrative verticals), I think it does help illustrate why some sites rank higher than others. Okay, drumroll please, for the \"used textbooks\" vertical, here's the Best Case SEO Scenarios, in descending order of impact on rankings: 1) High KW Rel and high KWs in URL, coupled with high Page Authority and Domain Authority is perfect recipe for high rankings. 2) High KW Rel and KWs in URL tend to be next best combination - this combo will push sites with low Page Authority and Domain Authority (and low inbound links) above higher Authority sites. 3) High KW Rel and no/low KWs in URL, coupled with high Page Authority and Domain Authority. 4) Low KW Rel and no/low KWs in URL, coupled with high Page Authority and Domain Authority - if competitors have equal or lower KW Rel and no/low KWs in URL, then site with higher Page Authority and Domain Authority will typically rank in top. To double-check myself, I compare this list to the results from the three keyword data sets. In general, these are all applicable. Please keep in mind that this is still first-step analysis. 4) Identify Initial SEO Strategy To illustrate this step let's look at BigWords.com. The site ranks on the bottom of page 1 Google.com for all three keyword searches. In addition, the site's homepage is the ranking page. BigWords.com Current Situation: Domain Authority - Relatively high at 61, but comparable sites like ecampus.com, alibris.com and abebooks.com have higher. Page Authority - Like Domain Authority, relatively high at 53 but other sites like alibris.com, campusbooks.com, half.ebay.com, abebooks.com and ecampus.com have higher. KW Relevance - For \"used textbooks\", BigWords.com scores 38% which places it among the three lowest sites in comparison to the other page 1 ranking sites. For \"college textbooks\" and \"cheap textbooks\" BigWords.com ranks in the mid 50's, which is the lower third among competitors. KW in URL - The homepage is the ranking URL for all of the example keywords. BigWords.com ranks 0% for all target keywords. What should BigWords.com do? The following recommendations come from comparing the Best Case SEO Scenarios to BigWords.com Current Situation to arrive at an initial strategy. Again, these recommendations are examples of how to approach the SEO for a site and are offered \"in a void\" without knowledge of BigWords.com's business model or operations. Without full knowledge of a website, the company, it's extant campaigns, etc. a sound recommendation can't really be offered. Even so, the site offers a good example of the evaluation process. 1) Keywords in URLs Create category URLs for target keywords that feature the keyword in the url. An example would be BigWords.com/cheap-text-books. For example, using the \"site:bigwords.com keyword\" search Google currently \"thinks\" the most relevant URLs for \"cheap textbooks\" are (i) homepage and (ii) /book. Creating a new category page for \"cheap textbooks\" that uses the term in the URL will give BigWords.com a high scoring Keyword in URL page. This strategy requires consistent internal linking for the target keyword as well as building inbound links to the category page. As with \"cheap textbooks\", Google \"site:bigwords.com keyword\" searches shows there are no URLs that include these keywords. As such, other category pages would be created depending on if the site currently has a category page for that keyword with the keyword in the URL. 2) Keyword Relevance In conjunction with KWs in URL (above), optimize pages in order to increase relevance of keywords. This is not simply adding more keywords but making a series of adjustments to boost the overall Keyword relevancy score, via the LDA Tool. As with above, this would be carried out for every target keyword and the target ranking page for each keyword. 3) Domain Authority The best way to increase Domain Authority is to increase the number of high-quality and relevant links to the entire site. This means not only the homepage, but also internal pages, including the target category pages, blogs, etc. Now we have a sense of how competitive the vertical is on Google, who the major players are, and a general understanding of what assets a site should have that wants to compete in this space -- in other words, the framework for an initial strategy. Now on to the next step...on-page analysis and keyword research...for which I highly recommend Lindsay Wassell's excellent SEO Scoreboard. Again, this came from my process or trial and error. What are some of the tools and process you've found helpful? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Competitor and Site Analysis Using OpenSiteExplorer and Other SEOmoz Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Competitor and Site Analysis Using OpenSiteExplorer and Other SEOmoz Tools"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Susan Rust\n          \n            Susan Rust"
}