{
  "url": "https://moz.com/blog/comparing-visit-data-for-shoemoney-seomoz-over-12-months",
  "slug": "comparing-visit-data-for-shoemoney-seomoz-over-12-months",
  "title": "Comparing Visit Data for Shoemoney & SEOmoz over 12 Months - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was completely blown away by Jeremy's recent release of his site statistics. Since coming to popularity in the Spring of this year, Jeremy has been one of the most succesful traffic-growth stories in the blogosphere and certainly the search community. Below, I've taken his numbers and added our…",
  "content": "Comparing Visit Data for Shoemoney & SEOmoz over 12 Months Content Marketing By: Rand Fishkin October 5, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 5, 2006 Comparing Visit Data for Shoemoney & SEOmoz over 12 Months Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was completely blown away by Jeremy's recent release of his site statistics. Since coming to popularity in the Spring of this year, Jeremy has been one of the most succesful traffic-growth stories in the blogosphere and certainly the search community. Below, I've taken his numbers and added our own: Shoe Visits Shoe Pg Views SEOmoz Visits SEOmoz Pg Views Nov 05 22,767 49,446 33,221 260,376 Dec 05 53,304 220,250 93,467 399,453 Jan 06 53,908 123,576 108,067 435,190 Feb 06 46,998 141,580 84,673 315,759 Mar 06 58,916 250,165 120,701 319,239 Apr 06 89,175 268,680 115,477 278,982 May 06 132,736 359,074 120,840 270,602 Jun 06 156,856 1,229,490 86,696 235,650 Jul 06 181,782 1,382,714 174,848 477,059 Aug 06 206,823 1,099,930 268,952 617,346 Sep 06 273,281 793,710 182,760 550,216 Oct 06 26,491 67,457 72,861 141,329 A few items on the list amazed me: In Jeremy's first month of blogging, he had 26K+ visits. In our first month (way back in October of 2004), we had around 6K visits (and that was after transferring an existing blog from another domain) Jeremy's visit numbers have a relatively steady climb (with the exception of a monstrous jump in May), but his page views jumped up 4X the previous month's numbers in June when he added only 20% or so to his visits The jump for Shoemoney from August to September added almost 50% to his visits, but page views shrank considerably - I have to wonder what caused page view inflation/deflation over the summer. Did he switch from full text to partial and back again? Another standout item that impressed me was a comparison of links. There's only two sources that are reliable for accurate link count numbers these days - Yahoo! and Technorati. The former measures all links on the web (that Yahoo!'s spidered) while the latter only reviews the blogosphere. According to Yahoo! Site Explorer's last page of results (which we find to be the most accurate): Shoemoney - 25,513 inlinks to the domain (excluding Shoemoney.com itself) SEOmoz - 178,269 inlinks to the domain (excluding SEOmoz.org itself) According to Technorati's count: Shoemoney - 6,111 links from 3,187 blogs SEOmoz - 8,998 links from 2,540 blogs I think we can identify one source of Jeremy's popularity as coming from his more diverse reach among the blogosphere. All in all though, he's clearly a brilliant self-marketer and someone who I'm anxious to learn from... Maybe we can score an interview with him in the near future. I think Jeremy is someone who has a very different perspective and different tactics from those that we discuss and his diversity could add a lot to our way of thinking. What do you say Shoemoney? Up for a few email exchanges? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Comparing Visit Data for Shoemoney & SEOmoz over 12 Months"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Comparing Visit Data for Shoemoney & SEOmoz over 12 Months"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}