{
  "url": "https://moz.com/blog/comparing-backlink-data-lies-damned-lies-and-statistics",
  "slug": "comparing-backlink-data-lies-damned-lies-and-statistics",
  "title": "Comparing backlink data – lies, damned lies, and statistics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In continuance with trust post I did few weeks ago, I decided to rant about backlink statistics various search engines so generously provide.  Without further ranting and blathering, let’s see some statistical tables!Lies… ...",
  "content": "Comparing backlink data – lies, damned lies, and statistics SEO Analytics M By: mozUser1469147917838 November 27, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 November 27, 2006 Comparing backlink data – lies, damned lies, and statistics SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In continuance with trust post I did few weeks ago, I decided to rant about backlink statistics various search engines so generously provide. Without further ranting and blathering, let’s see some statistical tables!Lies… Notice google.com backlink ratio between Google and Yahoo – Yahoo figure is nearly 163 times larger than Google’s own figure! And interestingly www.amazon.com is returning \" Your search - link:www.amazon.com - did not match any documents.\". Damned lies….Notice amazon.de – this time the backlink ratio between Google and Yahoo figures is amazing 1:1830. It is a well known fact that Google shows only a sampling, but selecting only 1 out of each approx. 2000 pages MUST BE fine art. I wonder what kind of algo Google uses to filter visible backlinks? …and nothing but liesNotice amazon.fr – Google says no backlinks, Yahoo finds only 719, AllTheWeb 485 backlinks - MSN whooping 103k. Interestingly the w/w subdomain count for MSN is exactly the same, which might indicate how MSN counts backlinks figures. And the truth? IMHO the really trustworthy backlink information can be analyzed only from log/referer data. Everything else is more or less a numbers game where the truth is in the eye of the beholder. As always, feel free to share your thoughts and comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Comparing backlink data – lies, damned lies, and statistics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Comparing backlink data – lies, damned lies, and statistics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}