{
  "url": "https://moz.com/blog/comparing-the-top-4-retargeting-companies",
  "slug": "comparing-the-top-4-retargeting-companies",
  "title": "Comparing the Top 4 Retargeting Companies, Adroll and More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the past year retargeting has been getting some serious attention. I've been fortunate enough to speak on it at a variety of shows, brainstorm over coffee with some cool companies and even blog about it a few times. No matter who I am talking with or what the venue the number one question asked…",
  "content": "Comparing the Top 4 Retargeting Companies Paid Search Marketing (PPC) By: Joanna Lord January 24, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord January 24, 2012 Comparing the Top 4 Retargeting Companies Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the past year retargeting has been getting some serious attention. I've been fortunate enough to speak on it at a variety of shows, brainstorm over coffee with some cool companies and even blog about how to use it and how to leverage it for SEO. No matter who I am talking with or what the venue the number one question asked is \"Who should I use for retargeting?\" Over the past two years some retargeting companies have really emerged as leaders. While we haven't used them all personally here at Moz, I thought it would be valuable to compare the companies in case any of our readers are considering retargeting. I really wanted to focus on what services each offer, what separates them from the pack and what they have planned for 2012. Luckily for us quite a few worked with us so we could really jump in with some great screenshots and specifics. For those that didn't reply to my tweet (ahem) or my email (double ahem) ... I tried to fill in best as I could based on my \"research via the Web\" skillz. Okay let's get on with it. Below I compared the following companies; AdRoll Retargeter Fetchback Chango If there is anyone you'd like to give feedback on that isn't on the list (or is for that matter) feel free to leave your thoughts in the comments! Who are they? Adroll has been around since 2007 rocking the display advertising world and pushing the limits on targeting capabilities. They have a hot shot team with decades of experience in optimization and creative strategy. They are based out of San Francisco, and have been making some serious waves in the retargeting space. What do they offer? On their basic plan they offer site retargeting with both contextual and behavioral targeting built in. They have a complete self-service interface, transparent conversion tracking, and excellent customer service. How much do they cost? Their Starter package has no minimum spend, if you are going to go with Plus (which gets you a dedicated account manager) you have to spend around 10k, and if you are going Pro with them (you get creatives, an engineer, and product development help) you need to be spending around 20k. What's their secret sauce? They are best known for their dashboard offerings and experienced team. They are truly focused on providing complete transparency into your campaigns (which a lot of other vendors are missing the mark on) and coupling it with lots of controls and options. Last year and the year before when many companies were still trying to make their platforms easy to use, AdRoll raised the bar by launching a platform chock-full of metrics and top-notch reporting options. AdRoll gets a lot of buzz because they are founded by targeting junkies who are striving to bring complex, sequence targeting capabilities to the masses. Impressive to say the least. What's the downfall? For those that are looking to do search retargeting this isn't really their bag. They focus mainly on site retargeting and contextual targeting (which is targeting based on category of your site and similar sites rather than search query). I also think it's worth noting unless you are spending at least 5k a month in media spend you don't get a dedicated account manager, much creative guidance, or A/B testing capabilities. All of these are available at the Plus and PRO levels, but those come with higher spends. For those just starting out if you go with AdRoll you'll need to do a lot of those things yourself. What's up for 2012? When I asked AdRoll what they were working on they sent over a laundry list of specific action items they have set their sights on. I really appreciate the transparency. These include - focusing on making their UI even more friendly, making the dynamic creative opportunities easier to use, adding more reports to keep up their high bar of transparency, and continuing to grow the team so each advertiser has the attention they deserve. Some screenshots for the curious cats out there... Excellent visibility into each ad's performance, and the data you need to succeed. Tons of options to help you intelligently build out audiences you can sequence. You can tell from the screenshots that AdRoll has done a great job of making the data the heart of the platform. As they continue to add features it will be interesting to see how they keep the platform uncluttered and streamlined. I think it could prove challenging. With that said, we currently use AdRoll and are loving the product and team. I think for the moderate to advanced paid marketer, AdRoll is a great option for retargeting. You have a robust product with an innovative team of minds behind it. Exciting to say the least. Disclaimer: SEOmoz does currently use AdRoll for our site retargeting efforts. Who are they? ReTargeter was founded in 2009 by Arjun Dev Arora, and in three short years they have really made a name for themselves. While their roots are in site retargeting they spent the last year really branching out and now offer services around social retargeting and email marketing. They also have chosen to integrate closely with a number of other big-name products out there like KISSmetrics, and SlideShare. Also based in San Francisco, the ReTargeter team has big hopes for 2012. What do they offer? They have two main packages -- one for site retargeting and one that is mostly display focused for visitors that are targeted via demographics, location, or content verticals. How much do they cost? Both packages start at $500, and scale up from there based on the number of visitors you target and impressions you serve up. What's their secret sauce? Time and time again when you hear their name come up you hear they have amazing customer service. Arjun and his team are best known for being available and willing to help you out every step of the way. In fact, every client, regardless of their spend level, will have access to a dedicated Account Manager. They have taken leaps and bounds this past year in product, but their bread and butter is their dedication to account management. You can see this reflected in this awesome Thank You Letter their CEO issued at the end of 2011. What's the downfall? I've actually used ReTargeter in the past and enjoyed working with the team, however I did have pain points with the platform. They lacked transparency into the revenue model on their side which left me leery. I know they've worked hard over the past year to build transparency into the platform, but they still have a little ways to go here. I should also mention their pricing is a bit off-putting. While they only start at $500 (which is great) they scale up very aggressively. For a site that has 50k visits a month you are at the $2,500 range. For bigger sites, you better be ready to spend some serious coin to be working with ReTargeter. What's up for 2012? I asked ReTargeter what they will be focusing on and was happy to hear they are hoping to streamline their display and retargeting services into one platform, for targeting multiple devices. Companies have told them how exasperated they are working with multiple online partners, dashboards, etc. and they are planning to give that issue some serious time this year. I, for one, am super excited to hear this. I know we see this quite a bit internally and we are always look for ways to be more efficient in our channel management. Okay here is some dashboard eye candy for you (please note this is there \"soon-to-be\" released dashboard): This is a great summary view, I wish there was some more cost data in there though. It's nice to see the different reporting and view options. Who are they? The Fetchback guys have been around since 2007 under the direction of Chad Little. They've been growing the brand steadily with lots of great content and conference appearances ever since. One of my favorite things from their site is this little nugget of gold: \"Let's be honest -- you don't put dogs all over your Website if you take yourself too seriously.\" I think that very much embodies their culture, and it's refreshing to see. They also pride themselves in working under seven pretty great core values, we of course can relate with out TAGFEE tenets here at Moz. *Highfive* FetchBack. What do they offer? They are all about site retargeting. They even have a patented technology named FIDO, which promises to analyze information on your visitors sent by smart pixels. Ohhh fancy. How much do they cost? You have to contact them to get a quote. I contacted them to get a ballpark range but they said they are so customized to the advertiser that would be a challenge. I have my doubts but they did say they have a variety of pricing models available, and they even work on rev-share if it makes sense. Sounds pretty flexible over there. What's their secret sauce? They are often praised for their full-funnel approach to campaign management. They take a pretty aggressive stance that retargeting works best when integrated with site behavior and full-picture strategy rather than just serving ads at the end of the sales cycle. They call this \"1 to 1 creative,\" which I can only assume means each creative is tailored for that specific visitor based on their behavior, location, etc. FetchBack is hyper focused on this detailed approach to management, which for more experienced marketers is a really exciting selling point. What's the downfall? First off, no pricing on their site. <rant> Man that gets under my skin. If you are going to sell a solution on the Web, you should allow me to research you in my discovery phase, instead of force me to call you guys or fill out a form. </rant> Other than that the only thing worth noting is they really have positioned themselves as an enterprise solution. For those just getting started or for those that never plan to invest too heavily into retargeting, Fetchback probably isn't for you. What's up for 2012? I reached out to hear what was on their 2012 horizons. I was a bit surprised to hear they will be focusing on \"As display grows from a direct response mechanism to include branding, we are focused on being able to provide solutions for not just conversion based campaigns, but also branding ones as well.\" Uhmm. Sounds a bit odd to me. In my experience display advertisers are too caught up in branding buys and maximizing impression share, while not focusing on conversions enough. It will be interesting to see how this strategy plays out in their services, and platforms. It could be useful for the ever growing social retargeting applications. I couldn't get you a screenshot but you can click here to watch a live demo. Who are they? Chango is a media buying platform that speclializes in Search Retargeting (rather than Site Retargeting like the above vendors). Want to know more about Search Retargeting? Here you go. Basically rather than target those who have come to your site already you are targeting visitors that have performed recent searches on Google, Yahoo, and Bing. They are based out of Toronto (eh?) with offices in NYC and San Francisco. What do they offer? Full-service search retargeting options, with limited site retargeting and engagement retargeting capabilities as well. How much do they cost? Unfortunately, you have to contact them for a quote as well. I did find out they minimum IO (including media costs) is 10k, and they have some clients spending up to 500k a month. Wowzers. What's their secret sauce? Well they really are the only end to end solution for search retargeting available right now. So there is that. At least I had a hard time finding one out there, let me know in the comments if I missed someone. They collect data, optimize, and bid on media at the keyword level which could make a strong argument for some really awesome targeting options. They also claim to have a 90% renewal rate on clients, with over 30 of the top 500 retailers out there. I'm gonna go ahead and give them a high five for that...speaks volumes about their product and service. When you ask the Chango what makes them special they all say \"the people working there.\" They've staffed the team with agency types with a passion for innovation. What's the downfall? Honestly for those considering search retargeting it sounds like Chango is one of the first places you should look. With that said, I often tell advertisers they should play in site retargeting before they jump into search retargeting. With site retargeting you get self-service platforms, data visibility, and the controls to test creatives and messages so much easier. Chango is a full-service option. There is no platform you log into, and you are putting a lot of trust in them. Before you commit your budget there I'd get more familiar with what works for audiences through site retargeting and walk into search retargeting with a better understanding of the landscape. What's up for 2012? While they do offer some site retargeting, Chango is committed to pushing the innovative limits on search retargeting options. They believe \"Search Retargeting 3.0\" is already here and their 2012 plans revolve around pushing targeting options, data reporting, and more. Also something cool they will be expanding is called \"Instant Search\" for Search Retargeting, which allows you to target individuals immediately after arriving from Google, Yahoo or Bing based on the search they just performed. Cool stuff huh? Me thinks so too. Since I couldn't get you a screenshot I thought I would get you something just as fancy--Chango's infographic on the Seven Types of Retargeting. They have advertising options for all of them, but focus mainly on (1) Search. How many of these are you trying? #getafterit So Let's Wrap It Up When it comes to picking the right retargeting solution for you there are a lot of great options out there. There are a number of questions you should be asking yourself. In fact there are so many, I have compiled a list of \"Interview Questions You Should Ask When Picking a Retargeting Agency/Vendor.\" This list can be your nudge to really investigate who is best for you. I cover topics like reputation, services, set-up, pricing, innovation, and resources. Hope you find it useful! Whatever your needs are around retargeting, there is an option out there for you. The industry has matured and its time to expect more from both the tools and the services. The four companies above are just a few of the companies out there, but they are great starts. If you have other questions about these companies feel free to leave them below. Also if I left out your favorite company, please add those too! I'm excited to hear what you are using and what is working for you. * It's worth mentioning I didn't run through Google Remarketing because we just launched this internally for a test and we are going to be posting some juicy good stuff soon enough. So sit tight! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Comparing the Top 4 Retargeting Companies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Comparing the Top 4 Retargeting Companies"
    },
    {
      "level": "H2",
      "text": "So Let's Wrap It Up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}