{
  "url": "https://moz.com/blog/competitive-link-analysis-tips-whiteboard-friday",
  "slug": "competitive-link-analysis-tips-whiteboard-friday",
  "title": "Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We all want to build up the reputation and authority of our websites and this week Rand discusses some competitive link analysis tips using Open Site Explorer. He talks about how to avoid some common pitfalls when trying to get similar links that your competitors have and give you a few good ideas…",
  "content": "Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday Whiteboard Friday By: Casey Henry May 26, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry May 26, 2011 Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all want to build up the reputation and authority of our websites and this week Rand discusses some competitive link analysis tips using Open Site Explorer. He talks about how to avoid some common pitfalls when trying to get similar links that your competitors have and give you a few good ideas on how you should be doing it. If you have any tips that you can share with the community on how you do competitive link analysis, please feel free to share those in the comments. Video Transcription Hi, everyone. Welcome to Whiteboard Friday. This week, we're going to talk about competitive link analysis tips. The thing is that a lot of people, when they're trying to build up their reputation and authority and the rankings of their website, one of the big things that they do is they look at who's linking to my competitors and can I get some of those links. This is a great practice, but there are a lot of pitfalls and there are also a lot great areas of unexplored opportunity. People typically do a very simple thing, which is just to look at who's ranking in the top 10, see who's linking to them, and try to get links. There's a little more depth. A tool that a ton of people use is Open Site Explorer. It's a tool that we here at SEOmoz use and tons of people like it. There are other opportunities. There are things like Majestic. There's Link Diagnosis. There's obviously Yahoo! Site Explorer, which is very popular, and a few others that are well known as well. Open Site Explorer is pretty simple, has a nice, easy-to-use interface. You can see here, I basically search for a URL up at the top, and it shows me all the places that Open Site Explorer, that the Linkscape Index knows about that link to that particular page. There are some filters up here and some different tabs. Basically, I get a list that looks like this. Here's the page. Here's the anchor text that's linking. Here's the page authority and domain authority. If I'm on the linking domains, it will also show me the number of linking root domains. It gives me some title information and that kind of stuff. Great. I can get some prospects here. I want to be careful about a few things when I'm looking through here. Number one, whose links are you looking at? One of the problems that we see a lot of the time is that the people who rank in the top 10, particularly in a short-term time frame, sometimes can be spammers or manipulative folks who have earned links that get them into the top 10 but only very briefly. By very briefly, I mean somewhere between 30 days and 3, even 6, months sometimes. If you're examining sites and you're looking at their links and you think to yourself, \"Boy, these are really scummy sites. The site quality is low. I don't know why anyone would organically want to link to this page,\" looking at their links may only help you in a really short-term scenario. You might find a ton of junky stuff, stuff you have to pay for, stuff that's manipulative, stuff that requires you to reciprocally link back to them, or jump through all these hoops. You don't necessarily want those. What you do want are folks who are long lasting in the top 10. If I look at a list of top 10 folks and I see oh, wow, this is a domain that's very well trusted and I've heard the name of the brand before, it's a popular and good brand, then I'm really interested in who's linking to this guy. If I see a three-hyphen domain.info, maybe I don't need to investigate his links. Or maybe I want to look at them, but I don't necessarily want to pursue them. I just want to be more careful about how I interpret those. The other thing is that folks will be really simplistic about this. As opposed to just looking at the top 10 of who's ranking here, I can go deeper into the results. I can go into the top 20 or 30. I can look at different keywords. I can look at keywords that are more broad. Let's say I'm trying to rank for \"used Toyota cars.\" I might look at used Toyotas. I might look at Toyota in general. Who's ranking in the top 50 or 60 for a super competitive phrase like Toyota? Who are those big important sites? There might be a bunch of places that are linking to other listings that could link to me. Or the people who are in the results themselves could be link opportunities. There's also the issue that when you do that kind of expansion, you'll just find that many more places that have diversity of links. Earning those can give you a step up on the competition, because when they look at your links, they're going to go, \"Wow. Where did they get all those? How did they find all those? It's amazing.\" The other thing I want you to pay attention to is, are these the links that matter? The same scrutiny that you give the websites in the top 10, I think we should all be giving that same scrutiny to the links that point in here. A lot of the time, there will be links that are fairly manipulative and low quality and temporary. They will appear in here because Open Site Explorer and Linkscape doesn't have anything like the sophistication of Google's webspam algorithm. Google webspam has a whole team working in a big building down in Mountain View. They're some of the best-paid and most highly talented scientists in the world. They're working on this problem of solving spam. Open Site Explorer has a few simplistic things. PA and DA, page authority and domain authority, use symmetrics to calculate how important we think it is. We get fooled all the time by spammers. The links that you see in here might not necessarily be the ones that count. You have got to use good judgment. There are two great ways to do this. Number one is does it rank? What I want you to do is look at this page itself, the linking page. Go to that page. Figure out the keywords that it's trying to target in the title or grab a snippet of 7 to 10 words in a sentence there. Put them in quotes and put it into Google. Does that page rank? If it's not ranking in Google, I'd be very suspicious about how it's doing. Number two, who does it link to? If it's linking to reputable sources and really good places, that's a very good sign. If it links to places that are very suspect and a lot of those places aren't ranking very well for their keywords, I'm usually a little more concerned. Those two things will really help you see whether this is the right link or not. Do pay close attention to another thing, the page and domain level metrics. If you see something that's like wow, this is a very low page authority but high domain authority, that might be a really good link opportunity. In fact, that domain might be a great link opportunity. I worry when I see folks who are like, \"Low page authority, I'm not interested.\" I wouldn't go that route. If domain authority is high, that means it's a big, important, powerful domain. I would much rather, in my SEO, have a link from a powerful, important domain than from a powerful page but on an unimportant domain. If it's the homepage of Mikes-House-of-Viagra.info, I totally don't care. I don't care that it's homepage. I don't care that he has a page rank of four or five on his homepage. I'm not interested. If it's some super deep page way down on the Scientific Americans website, wow. PA may only be a 35 or a 40 or something, but the domain authority is going to be like an 88 or 90. I'm looking for those links. I'd encourage you to do the same thing. You can actually resort in Open Site Explorer by DA. There's a little arrow there. You can resort your links if you want. You can also export. There's an export to Excel function. You can get the top 10,000 links. Then you can sort however you want inside Excel. The last thing I'm going to talk about is do be cautious. A lot of people will go right up to here and they'll use the filter that lets you exclude no-followed links. I wouldn't be too worried about that. Some of the time, maybe you only want to care about the followed links. A lot of the time, what we've seen is that no-followed links present link opportunities of their own. They're often social opportunities, opportunities in social media or on social sites for social profiles. Some of them are engagement and interaction stuff, like blog comments, forum participation. Those can actually be great places to do inbound marketing, get people aware, pay attention to the community, get opportunities for content, get opportunities to interact, and that will lead to good SEO things in the future. Hopefully, you've got some good competitive link analysis tips out of this. We look forward to seeing you again for another edition of Whiteboard Friday. Take care. Video transcription by SpeechPad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}