{
  "url": "https://moz.com/blog/competitive-research-suite",
  "slug": "competitive-research-suite",
  "title": "New Competitive Research Suite: Actionable Data to Drive Real Results - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We’re thrilled to announce Moz’s Competitive Research Suite, built from the ground up to drive targeted data and actionable insights about your competitors, your competitive keyword gap, and your content gap.",
  "content": "New Competitive Research Suite: Actionable Data to Drive Real Results Moz Tools | SEO Tools | Competitive Research By: Dr. Peter J. Meyers April 27, 2022 Table of Contents Copied! By: Dr. Peter J. Meyers April 27, 2022 New Competitive Research Suite: Actionable Data to Drive Real Results Moz Tools | SEO Tools | Competitive Research I once compared keyword research to an avalanche – it’s loud, exciting, and you’re likely to end up buried alive. Over the years, as I’ve tested new product ideas (even with enterprise SEOs), I’ve found that people don’t really want all the data. They want the right data. I’m thrilled to announce Moz’s Competitive Research Suite, built from the ground up to drive targeted data and actionable insights about your competitors, your competitive keyword gap, and your content gap. Instead of telling you, though, let us show you. Your keyword gap, reinvented I recently bought some sunglasses from Goodr. Let’s pretend I’m analyzing their competitive SEO landscape, and I’ve picked three targeted competitors in the online sunglasses market that specialize in active customers and sports sunglasses. I’d first enter the sites in the mini-wizard: You can choose your market and either Domain or Subdomain for the target site and each competitor. After some summary statistics about the sites, you’ll see the “Keywords to Improve” section, which looks something like this: Scroll horizontally to see our all-new Traffic Lift metric, Keyword Volume, Keyword Difficulty, your current ranking, and the ranking of each of your chosen competitors. More signal = actionable results If you did a traditional keyword gap analysis, you might look at each competitor individually and manually dig through the intersections. Let’s say we put SportEyes.com into our own Keyword Explorer. The first few results look something like this: This is perfectly useful data about one competitor’s rankings, except for one problem — Goodr doesn’t sell swim goggles or ski goggles. Even intersecting a couple of competitors could easily produce irrelevant results, competitors’ branded terms, or keywords where your site already outranks competitors and has very little to gain. Put simply, there’s a lot of noise. Keywords to Improve is a new way of thinking about the competitive keyword gap. We focus on keywords where your site ranks in the top 20 (you can easily expand this in the filters), but is outranked by one or more competitors. We also attempt — by analyzing on-SERP signals — to filter out branded and brand-like terms. We cut through the noise, boost your SEO signal, and surface actionable results. Lift your traffic, lift your ROI We SEOs love big keyword volume numbers, but here’s the hard truth — even if we could perfectly accurately estimate volume, it’s a bit of a fantasy. If you create a competitive keyword research spreadsheet with 10,000 keywords with an average volume of 1,000, are you going to guarantee your boss those 10 Million visitors? Of course not. What if you have no capacity to rank for that keyword? What if sites like yours (including your competitors) have a realistic ranking cap? SEO isn’t a process of going from no ranking to #1 on every keyword imaginable, and even #1 doesn’t get all the clicks. All of this is why we’re introducing Traffic Lift. The Traffic Lift column looks at what we think you could gain by moving from your current ranking to your competitors’ best current ranking. In part, it’s tough love. Living in a fantasy isn’t good for business. More importantly, it’s a way to prioritize. See the sample results below: Unlike swimming goggles, a product Goodr doesn’t even sell, cycling and running sunglasses are product categories that are very relevant and where they’re outranked by similar competitors. There is ample room for improvement here and real ROI. Traffic Lift finds the wins. Your competitors’ top content A little more tough love — keywords aren’t action. Keywords are potential. A mountain of keywords is more likely to bury you than benefit you. We can help you find the best keywords, but ultimately, we want to understand how those keywords are shaped into content. Our first-generation (and there’s much more to come) Top Competing Content report shows you how your keyword gap is being served by your competitors. Let’s look at the Goodr data: The “Top Ranking Keywords” are just a sampling, but here we can see, for example, how one competitor’s page is capturing multiple keywords related to “cycling sunglasses”. Now, you can start to see how those keywords function as a concept and you’ve got specific competitor pages to target. This is the next step of competitive keyword research — going beyond a pile of individual, unrelated, and even irrelevant keywords to a plan of action that includes targeted, high-lift keywords, targeted content, and a top-level view of the competitive landscape. If you want broader data or a different viewpoint, there’s a full range of filters and sorts to let you adjust our default settings. Of course, you can also export both Keywords to Improve and Top Content Competitors to carve through the pile as you please. True competitors, truer results In September of 2021, we launched True Competitor, and I promised that it was a first step in Moz’s new approach to competitive analysis. True Competitor is now more than a stand-alone tool — it’s a starting point to understanding your keyword and content gaps: From True Competitor, you can now easily select up to three competitors and run your Keyword Gap analysis. As you can see, this is how I kicked off my Goodr example, even though I had almost no knowledge of their competitive landscape. Imagine what you could do with your actual knowledge of your site, your customers, and even your prospects. Even for Goodr, this journey I took is just one possible journey. I chose to focus on sports sunglasses, but there are dozens of niches that they could explore, even as a relatively small site. Competitive analysis isn’t one and done — it’s a process of surfacing opportunities, acting on those opportunities, and re-evaluating as your competitors evolve. The Competitive Analysis Suite is now available to all Moz Pro customers, and we’d love to hear your feedback via the ‘Make a Suggestion’ button in the app. Sign up for a free trial to access the Competitive Research Suite! Already a Moz Pro customer? Log in now for instant access! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Competitive Research Suite: Actionable Data to Drive Real Results"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Competitive Research Suite: Actionable Data to Drive Real Results"
    },
    {
      "level": "H2",
      "text": "Your keyword gap, reinvented"
    },
    {
      "level": "H2",
      "text": "More signal = actionable results"
    },
    {
      "level": "H2",
      "text": "Lift your traffic, lift your ROI"
    },
    {
      "level": "H2",
      "text": "Your competitors’ top content"
    },
    {
      "level": "H2",
      "text": "True competitors, truer results"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}