{
  "url": "https://moz.com/blog/competitive-domain-analyses-educating-qualifying-clients-in-one-fell-swoop",
  "slug": "competitive-domain-analyses-educating-qualifying-clients-in-one-fell-swoop",
  "title": "Competitive Domain Analyses: Educating & Qualifying Clients in One Fell Swoop - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s common for potential clients to have unrealistic expectations or to have been misinformed somewhere along the way about SEO. It's time to take a stand and make it your job to educate potential clients about myths and realities of their web marketing needs.",
  "content": "Competitive Domain Analyses: Educating & Qualifying Clients in One Fell Swoop SEO Consulting By: Mackenzie Fogelson October 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson October 3, 2012 Competitive Domain Analyses: Educating & Qualifying Clients in One Fell Swoop SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It’s common for potential clients to have unrealistic expectations or to have been misinformed somewhere along the way about SEO. Because it has evolved so much in the last year, what it now takes to achieve desired rankings really goes beyond the former gold standard of keyword research. For the new complications, we heartily blame a guy named Panda, but after the finger-pointing is done, we’ve got our work cut out for us. SEOs need to keep up on all the latest and greatest to ensure proper integration and execution of SEO, and also to manage client expectations about success. That’s a pretty hefty job. However, just because a client doesn't have a proper understanding of SEO doesn’t mean they won’t be great to work with. Instead of being frustrated with their mainstream understanding, make it your job to dispel myths and educate them about the process so that they can make informed decisions about their web marketing needs. And make sure you do this before you're under contract. Otherwise, you’re locked into an uncomfortable situation with no easy way out. It's important to be picky about who you work with Qualifying and landing clients can take a lot of effort. When you’re in the acquisition phase (and you’re not yet under contract), you need an efficient process for determining eligibility and filtering prospects. One of the most effective ways we've found is by conducting a competitive domain analysis (CDA). After we've had an initial phone call to do a general qualification of the client, we put a CDA together for two reasons: It provides us with the opportunity to properly educate the client and help them understand where they rank (among their competitors of course), why, and what would need to be done in order to improve their standings. It allows us to showcase our knowledge, build trust, and get a feel for whether the client would be a good fit for us before we even bid the project. Domain authority is usually a wake up call You'll find that many clients are very keyword focused and want to rank #1 for some of the most competitive terms in their industry. That might be OK for a brand like Coke or Nike who have domain authorities in the 80s and 90s, but for businesses who are just starting out online (with a DA that’s less than 30), who may not have spent any time building links, brand awareness, or focusing on customer experience, and they want to go up against Amazon (DA of 97) for \"baby blankets,\" they’re in for a rude awakening. Instead of setting their expectations up for failure, I like to discuss domain authority right out of the gate so that the client fully understands that: There is a lot of work to be done (and it doesn’t just involve keywords). There is a lot more to competition than they've probably realized. They most likely will never beat Amazon (just sayin'). As you know, raw domain authority is less important than relative domain authority. The client doesn’t have to beat Amazon, or Apple, or Coke. They just have to measure up to their competition. Presenting them with a competitive domain analysis helps them to understand just how much work we need to do in order to close the gap. How to educate your client In case you’d like to give it a go, here is a solid process for running competitive domain analyses for potential clients: Schedule a meeting Once you’ve received a call from a potential client (and after you’ve qualified them into a second meeting), schedule the second meeting out a few days so that you have a chance to run this analysis. This will give you the opportunity to present your findings and convince them that you’re the one to go with. You can email the client this analysis ahead of your meeting, but make it a point to have a face-to-face (or a Google+ hangout) when you’re ready to review. Ask for some competitors Ask the potential client for a list of up to 4 competitors (and make sure they give you URLs so that you’re running the analysis on the right sites). Note: If the client serves different sectors in their industry, they may have a different set of competitors for those verticals. We offer to run one with up to 4 competitors at no charge of course. If you wanted, you could run another set for an additional fee. Go to Open Site Explorer (OSE) Go here: http://www.opensiteexplorer.org/ and enter the competitor URLs into OSE and let the SEOmoz tool work its magic. Prepare a Word Doc Once you’ve run the competitors in OSE, focus on the information that is showing on the “Compare Link Metrics” tab. Take screenshots of both domain authority and page authority. That is all we focus on for this analysis, but you can select additional information that you want to provide and analyze this as well. For the purpose of this post, I'm going to focus on the page specific metrics. Make sure you organize Our CDAs are usually about 10 pages, but don't let this freak you out. The introduction and the glossary of terms take up two pages and there's lots of screen shots taking up room. It's helpful to organize the document into four main sections: What is SEO? Domain Analysis Recommendations Moving Forward Glossary of Terms Here’s a breakdown of each section and what should be included: Section #1: What is SEO? Start the document with a brief explanation (two or three paragraphs) that describe the current climate on Google and what it really takes to rank these days (we usually link to a couple good posts that we want them to read). This just helps to reiterate all of the things that we’ve been discussing with the client thus far. It also puts it in writing so that they can refer back to it (as they are likely to forget). In this part of the document, make sure to point out a few things that are likely to make their website successful (you can go into a little detail about each one): Good content Good UX Being a good company, having a personality, and what it means to serve your customers Properly integrating SEO (on-page and off-page) Effectively utilizing social media Or, you could use an infographic like this: Now you've set the stage, so you're ready to show them the analysis of their domain compared to the competition. Section #2: Domain Analysis This is where you’re going to put those screenshots of the charts from OSE. But don’t just put the shots in there. Analyze them. The purpose of this document is to break down the metrics they are seeing on the chart and explain what they mean. Take the time to walk them through: Link stuff The importance of links. Provide the breakdown on the specific metrics provided from OSE so that they understand what they're looking at. Even a more technically savvy client won’t understand what these terms mean, so break it down for them without using industry jargon, talking about both quantity and diversity. The trust factor Make sure we explain what MozTrust means. Rand does a great job of explaining this concept in this video. MozTrust is based off a site’s linking distance from those highly authoritative worthies who qualify as “trusted sites.” Do you link directly to one? Do you link to a site that does? Or do you link to a site that links to a site that links to a site and so on? It’s the Kevin Bacon game, where domains like whitehouse.gov or harvard.edu are Kevin Bacon and you want the fewest possible degrees of separation between you and him. We explain that this is a contributing factor to total authority. Social impact When you look at the results of the domain analysis on the page authority level, you’ll see metrics that illustrate times shared and liked (and +1d) on Facebook, Twitter, and Google+. Because social signals may be associated with better rankings (even though it is inconclusive as to whether they cause them), don’t ignore the social factor in your analysis. If they have no social presence, that’s going to be something to recommend (see below in Section #3). As you’re walking the client through the breakdown of this analysis, reiterate the fact that domain authority is measured on a logarithmic scale and that it’s easier to move from 1 to 50 than 51 to 100. Even if you’re working with someone who’s doing pretty well, they’re not going to be able to skate along if they seriously want to improve. If anything, they may have to work harder. You’re not doing anyone any favors if you downplay what has to be done to boost their standing. (Though take a moment to congratulate them on a job well-done so far. Nobody likes a Negative Nancy). Remember that this is your opportunity to show the client your knowledge and expertise. Build some trust here and help them to get a feel for how great it would be to work with you. Section #3: Recommendations moving forward Hopefully, by this point, you’ve impressed them and you have their attention. Take advantage. Make the sale. In the CDA, include some basic recommendations for what we’d suggest to raise their domain authority moving forward. This is your opportunity to let them know that you are the SEO (or SEO company) who can help them do all of these things. This is also a great place to point out what they can do to get ahead of the competition (you can do a simple review of their competition’s websites and integrate those advantages here). Here are some common steps to recommend in this part of the CDA (and provide a paragraph or two on each): Currently... A very brief and general summary of what their link profile looks like at the moment: the types of links they have, any obvious gaps, etc. Improvements to website Usually your client will need to improve nav structure, content (make pages more engaging and valuable), UX, integrate a blog (for content marketing efforts), etc. But remember, you haven’t done a formal site audit yet, so don’t assign any numbers to anything and don’t make any promises. At this point, you’re just making generalizations about the things that you’re observing they’re going to need to do to raise their DA and rank better. SEO integration Mention both on and off page efforts in a nutshell. Explain what this means in mainstream speak. Content marketing strategy Provide a powerful sentence or two that explains how important it is that they are building value through memorable, universal content like blog posts, infographics, video, photo albums, etc. Social media strategy Clearly this is integrated with the content marketing strategy. We reiterate how important social is for desired rankings and how we approach it from the perspective of delivering value and building community. Implementation This is where the ongoing consulting work comes in. This is the phase where you're working alongside the client to guide them through the strategy and help them to generate remarkable content and forge strong relationships in their community. Section #4: Glossary of terms I recommend including a glossary of terms of all the terms featured in the OSE screen shots so that the client can look stuff up afterwards. As a bonus for making it through this post, you can download our glossary of domain authority specific terms here. Now what? Once you’ve presented this CDA to the client and both parties have decided the partnership is a good fit, the natural next step is to bid the project for them. Do a little more investigation before you bid your project by asking some more questions, performing a general site audit, and holding a team creativity session. Whatever your routine, make sure that before you leave this meeting, you define next steps. Let them know when you'll put a bid together and schedule another meeting to present that proposal to them face-to-face. Disclaimer of sorts Mack Web spends a great deal of time determining whether a client is a good fit. If you perform a CDA and it’s obvious that the client needs a company with a different skill set, or different values, then you have the opportunity to refer them to someone who can really provide what they need. This process will help you to get a pretty good understanding of a client’s personality when you’re educating them about how rankings actually work. It’s an opportunity to really “listen.\" Make it a point to observe how they receive the information you’re delivering. If your client is open and receptive to your approach in this part of the acquisition process, then you probably have a green light on bidding the project, and, if you get the work, chances are it will be a great partnership. If you’re getting red flags when it comes to general practices, unrealistic expectations of results, personality, or even culture fit at this stage in the game, it’s probably not going to be a client you want to land (or a high maintenance one that you’ll require a healthy budget buffer to deal with). Please note that using a competitive domain analysis is only one of the ways that we determine whether a client is a good match for us. It’s just one of the first steps; it’s not meant to be the end-all be-all of your client investigation. And, as mentioned, this is not meant to be a full blown site audit (for us anyway, that comes later). A CDA is a visual and data-driven way to illustrate to the client that there are layers of complexity to helping a company rank desirably. And it’s a nice little bonus that you’re getting a great feel for the client in the process before you get under contract. The bottom line Just because your client has spent a ton of money on a beautiful website doesn’t mean that they are naturally going to rank well. You know this, we know this. It is your unpleasant duty as an SEO to make sure that your client knows it, too. Driving home the reality of the time and effort required to successfully market their website online, build trust, and earn authority is just one of the crosses that an SEO must bear. We’ve discovered that a tool like our competitive domain analysis eases that burden a bit, helping us educate our clients and ensure that we’re working with the right ones. Give it a try and see if it works for you too. What processes do you use to qualify and educate potential clients? What tools have you found useful? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Competitive Domain Analyses: Educating & Qualifying Clients in One Fell Swoop"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Competitive Domain Analyses: Educating & Qualifying Clients in One Fell Swoop"
    },
    {
      "level": "H3",
      "text": "It's important to be picky about who you work with"
    },
    {
      "level": "H3",
      "text": "Domain authority is usually a wake up call"
    },
    {
      "level": "H3",
      "text": "How to educate your client"
    },
    {
      "level": "H3",
      "text": "Make sure you organize"
    },
    {
      "level": "H3",
      "text": "Now what?"
    },
    {
      "level": "H3",
      "text": "Disclaimer of sorts"
    },
    {
      "level": "H3",
      "text": "The bottom line"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}