{
  "url": "https://moz.com/blog/companies-playing-on-the-social-media-playground",
  "slug": "companies-playing-on-the-social-media-playground",
  "title": "Companies Playing on the Social Media Playground - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In participation of Social Media Month, I thought I would highlight an article over at Mashable that fueled (ok, only sparked) some interesting conversation. Adam Ostrow at Mashable wrote an article that posited the question “Is Social Media Making Corporate Websites Irrelevant?”",
  "content": "Companies Playing on the Social Media Playground Social Media I By: iGoMogul May 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! I By: iGoMogul May 29, 2009 Companies Playing on the Social Media Playground Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In participation of Social Media Month, I thought I would highlight an article over at Mashable that fueled (ok, only sparked) some interesting conversation. Adam Ostrow at Mashable wrote an article that posited the question “Is Social Media Making Corporate Websites Irrelevant?” To summarize, the article focused on Vitamin Water’s recent ad campaign featuring competing NBA stars LeBron James and Kobe Bryant on sites such as ESPN. Adam is quick to point out that the remarkable aspect of the campaign is the call to action: Visit facebook.com/vitaminwater. He goes on to deftly outline the pros and cons of such a campaign: PROS: reach engagement CONS: loss of marketing money to an audience not using SM anticipation for an uncertain outcome (James and Bryant may or may not face off in the playoffs) As the dynamics of the Web 2.0 continue to evolve, we will see more and more consumers not only expecting, but demanding to interact with companies and products. Corporate websites can sometimes be less than compelling and generally offer little to no interaction with their customers. John S. Robinson, of Yourmagz (www.twitter.com/Yourmagz), made a great point in the comments section there, stating that the corporate integration into a site he already uses daily makes it more likely for him to see or care about the brand. That seemed to be the general consensus of those who already use SM. Are we just waiting for the rest of those people who don’t use SM to catch up before corporate websites are obsolete, acting as antiquated librarians waiting to give information to random passersby? Perhaps a shift will come where corporate websites will become the forum for interaction rather than outside social networking sites. Is this possible? Do we even want that to happen? Relative to SEO, Facebook does nothing for a company. No link love. Nada. Integration with consumers’ daily activities is currently the best complement to standard marketing. But, are we reaching the point where reach and engagement are the Playoff Champions and corporate websites and SEO are the runners-up? What are your bets for next season? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Companies Playing on the Social Media Playground"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Companies Playing on the Social Media Playground"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "iGoMogul\n          \n            iGoMogul"
}