{
  "url": "https://moz.com/blog/conducting-effective-and-regular-oneonones",
  "slug": "conducting-effective-and-regular-oneonones",
  "title": "Conducting Effective and Regular One-on-Ones - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here's another post that drifts away from the usual SEOmoz blog posts, and instead offers a rich perspective into our culture and management. Read on to find out how Kate Matsudaira effectively and regularly conducts one-on-one's, and how her approach to these team meetings can improve attitude and…",
  "content": "Conducting Effective and Regular One-on-Ones SEO Copywriting L By: Leah Candelaria-Tyler September 20, 2011 Table of Contents Copied! L By: Leah Candelaria-Tyler September 20, 2011 Conducting Effective and Regular One-on-Ones SEO Copywriting There are a number of ways managers can ensure they are doing everything they can to keep their employees happy and therefore productive. Sometimes this requires the moon, and sometimes this requires a new chair. But sometimes, it only requires a good discussion and reassessment of goals - or, an hour of your time. What’s important is that you know what it takes, and how you can reach them, and that you take action. After my own one-on-one’s with Kate Matsudaira, and a few interviews, I was able to put down in writing her method of effective one-on-one’s, and personalized management. One-on-one’s, at SEOmoz, are a valuable asset to all of our employees. Quite simply, these meetings are consistently regular. The frequency and duration of the one-on-ones is at the manager’s discretion, however are typically weekly and at least 30 minutes long. All of the team managers at SEOmoz conduct one-on-ones, and therefore every employee has a guaranteed opportunity to voice needs and praise. They are also given the opportunity, most importantly, to assess their personal goals on a fairly frequent basis to ensure culture and happiness are in tune! Below are some useful ideas you may want to keep under your hat the next time you are in a review with one of your employees. In conducting one-on-ones, the goal is to move beyond your role as a manager, and be an available ear for your teammate. In a room, with the door closed and pen in hand, you are all ears and eyes while sitting across from your teammate, ready to discuss and resolve performance concerns, and just generally talk about work. Not only are you setting goals in these meetings, you are also tracking their progress in achieving these goals; making you their biggest fan! Image source here. One-on-ones also help you establish what kind of manager you are, and need to be. This is the time to talk about what you can do to be a better manager, and learn what habits you have that either are or are not conducive to a productive work environment. Therefore, the one-on-ones are meant to be exactly that - a push and pull meeting where goals, complaints and praises are heard and resolved. There are lots of things to pay attention to in these meetings and below is a list of considerations to help you make them more effective: Body Language: Present an open presence by sitting facing each other, don’t cross your arms or turn away – you want to physically appear open and receptive. Make eye contact. Don’t look at your phone or your watch, give them your undivided attention. If you are worried about time, then set an alarm on your phone or make sure you do it in a room with a clock. If your phone rings, don’t even look at it – the person across from you is your primary concern at that moment and they need to know it. In the times when you might be expecting an important call, set that expectation at the start so the person is aware - which will make the interruption less jarring. Take notes, not just because it helps you remember your conversation and follow ups, but because it shows that what they are saying is important. The Basics Although these sound like no-brainers, these points are so basic they are often overlooked. Punctuality, the Golden Rule, and Follow-up are seriously necessary in progressive one-on-ones. Punctuality: Showing up on time shows commitment. It also shows that you care about their schedule and time as much as your own. You wouldn’t be late for a meeting with an important client, so treat your teammates with that same level of courtesy. Golden Rule: Treat them with the same respect you would treat your boss, as well as the same respect you would want your boss to treat you. Make them feel like they are walking on sunshine! We should all feel like the dog in the picture below as often as possible, as well as make others feel the same way! Follow-up is almost as important as the actual meeting. You don’t want to give the impression that you are just following protocol by hosting the meeting. Even if this means a few sentences over email, be sure to thank your teammate for meeting with you, and for their candidness, especially if some tough topics were raised in the meeting. You should follow-up in more than one way - verbally and written, so that the hot points of your meeting are communicated effectively, and are transparent. That way you are on the same page, instead of just hinting at things. Suggestions can work with some people but not all people - use the Socratic Method as an example of how the conversation should flow. A lot of times employees will bring up things that bother them or that they would like you to help them solve. It is so important to make sure that you close the loop on these items. Doing so will help you build a productive relationship and show your teammate they can trust you to act on their concerns. In the event you aren’t able to fulfill their desires, then make sure you circle back and tell them why. Sometimes this can be done in your next one-on-one meeting, but sending a little note or email is also very effective. Hug me, Squeeze me, Kiss me, Kill me. Publicly praise, privately criticize. Never yell. I once worked for a man who threw paperclips at my head - not cool. People want to do well at their jobs - so if they are not doing well, something obviously is wrong, and there is a possibility that something in their personal life is going on, or that they don’t have a skill set that would make their job less challenging. If they aren’t doing their job, maybe there is a lack of motivation for personal reasons, or skill reasons. If it is motivation, they might not like their job anymore, or aren’t good at what they are doing, or simply, just bored. It is important to understand when and where they are faltering so that you can make adjustments. Maybe they want to be promoted, maybe their chair is uncomfortable, maybe they need a new stapler. Regardless of the reasons, make sure you take the time to ask questions and really listen to their responses. That way you can make changes or adjust before things escalate into major issues. Image source here. When I was 5, I wanted to be a horse trainer, not a secretary. An important thing to consider is “what do they want to be when they grow up”. Especially if they are new to your team, you will find that most people don’t know or may not be open enough to tell you yet. They might be uncomfortable telling you because they are so far from meeting that goal, or because it’s not aligned with where their career is right now. They might also worry that by telling you it will ruin their career trajectory. This is something you should always avoid - make sure your employee knows that they can be open and honest with you. For instance, a lot of people want to be in management but don’t have the skill-set and worry that they won’t reach it in the next two years. So, when presented with the “what do you want to be when you grow up” questions, they keep quiet, or they’ll say “I just want to be better at my job or learn new things.” Part of this statement may be true, and these are legitimate goals, but it doesn’t tell you what may be underlying. As their manager, you can still get the big picture and help the employee build those skills, but you have to ask the right questions. Here are questions / conversation topics to help draw these answers out: What do you think you are best at? What do you love about your job? What makes you tick? What is part of your job now that you wish you could change or do less of? Fill in the blank: You know it was a good day at work when ________. Think of a time you were happy in your job. The Weekly Meeting It’s good to share stuff about yourself in your meeting with a teammate, it’s a one-on-one, and you’re not just a manager on duty. When you open doors to conversation you build trust. For instance, tell them what you want to be when you grow up if you aren’t there yet. This can open the door to surprising conversation. Although in addition to free form conversation, it also helps to have a template, or format. Even if you meet once a week with a person, it is useful to use the same questions. That way you both know what you are going to ask, and they will be conscientious of this during the week between meetings, and maybe make a mental note of something that applies. This ensures you always cover the important topics and make the most of your time together. Of course these won’t (and shouldn’t) take up the whole time, so it is also good to have other questions or topics prepared for discussion. Listed below are questions that we like to ask on a weekly basis: What went well this week? What could have gone better? On a scale of 1-10, how happy are you? Why? What makes this week a ____. What would it take to make your week a 10? The questions above not only quantify their mood, but also give you something to work with. These questions will also help you understand what they do and don’t like about their job. It's also oklay to ask for specific feedback about certain projects that you know they are working on, especially if they are new. It's also good to ask questions if it is taking a long time for them to complete a project. If you take good notes, you can also keep track of the weekly, or even monthly quantifier, which will give you a sense of whether you are getting the most of one another.Gossip Can be Productive Image source here. Another great topic for these meetings is to talk about important events or challenges happening throughout the company. This can include things like changes in staff, company strategy, certain deals, or even changes in policies like benefits. Don’t tell them about it; ask them their opinion so that it’s conversational. And if they don’t understand it, they have the opportunity to ask for clarification right there and then. If you don’t know at that moment - always get back to them in an email after you have done some research, but do it shortly thereafter (ideally in the same day) so they feel important and heard. Ask for feedback on team members, and ask specifically, like “do you have any feedback for your teammates?\" (Here, it is good to encourage positive feedback, because sometimes employees see things you might miss giving you a great opportunity to praise someone else. If it is negative, this is a great time to coach them to help their teammates.) Specific questions often generate specific answers. If their answer is negative, try to get them to resolve the issue themselves. Encourage them to have one-on-ones with each other. It will force them to have those conversations with each other, and address those issues on their own. Additionally, in requesting feedback on their teammates, you become acquainted with their leadership potential, which could result in their promotion, and improve their happiness number. Awkwardness can lead to greatness: Image source here. While figuring out what makes your teammates tick, remember to ask them what you can do to make their job easier, or help them to be more productive - that’s why you are there, after all. But this is not an easy task - you could be setting yourself up for a very awkward meeting. So, in order to Rico-Suave informative and honest answers out of your teammate, it’s important that you don’t take time away from their sessions, especially if they have a lot to say, so leave these questions for the end of the one-on-one. Ask for feedback about yourself, not necessarily specific, but generally. These are hard questions for them to answer, but ask them, and be sure to wait patiently for their answers. Make a conscious effort to not react to bad feedback (that you asked for). Having them be a part of the solution will often help and always praise their idea before you criticize it. Here are some examples of questions you can ask: What is one thing that I can do differently? What was one thing that your last manager did that you like that I don’t do. What do I do that you don’t like. What can I be doing to help you more? Do you have any feedback for me? Is there anything I should start doing? Stop doing? How can I support you better? When you ask these kinds of questions, you will have to learn to get comfortable with awkward silence. And you have to learn to just sit there, do not say anything until they respond, which can be really hard. If you let them know you expect an answer and solicit feedback consistently, you may be amazed by what you hear. The Dreaded One on One Sometimes the hardest part of being a manager is delivering critical feedback. Start the meeting with praise of their idea (of issue), and then talk about the issue, then listen to what they have to say. People want to do well, which is why giving tough critical feedback is hard; so let them vent and hear what they have to say. Then hash it out - focusing on going forward. It’s also important to not disagree with them (even though you might), but focus on what they can do to remedy the situation. Also, be sure to always focus on the future so that the conversation remains productive. If diving right in doesn’t work with a particular teammate, try the “Oreo” concept: say something nice, give them the feedback, give them praise. In the event that the Oreo concept doesn’t work, it’s also okay to just dive right in and leave it at that – with some people being direct is the only way to get through to them. Once you have addressed the anxiety-ridden issue, have them come up with a plan, then move on. It allows you to continue the conversation, and then recap in an email. Sure, the paper trail can be helpful, but more than that, some people process things verbally, others like to see it written out. By following up in email it clearly communicates (and reiterates) the important point and new expectations to all parties. At the end of the one on one, thank them for being open, talk about the solution, and just recap the situation. And finally, in most cases it is helpful to make the feedback about the action or task, not the person, since it makes it less personal and more actionable. When you separate the two, you are inviting the involved party to create a solution, and therefore assess their own issues productively and responsibly. Ending on a positive note: Instead of a cheesy high-five, verbally state that you are happy with how the meeting went, or discuss something positive the meeting highlighted once again. Mixed signals and unnecessary meetings can make workers weary of their position, distract them from their priorities, and can make them dread their one-on-one’s. What you both take away from the meetings is equally important, but the underlying goal is to make sure you and your teammate trust one another, and can successfully communicate through problems and help each other reach career goals. If necessary, or if your last one-on-one ends on a bad note take them to lunch, or communicate that you are looking forward to the next one-on-one. If you are excited, they’ll be able to sense that, so utilize your outlook to influence theirs. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Conducting Effective and Regular One-on-Ones"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Conducting Effective and Regular One-on-Ones"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Anatomy of Addictive Content"
    },
    {
      "level": "H3",
      "text": "Humans vs. Robots: Picking the Best Audience for Your SEO Content"
    },
    {
      "level": "H3",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Leah Candelaria-Tyler\n          \n            Leah Candelaria-Tyler"
}