{
  "url": "https://moz.com/blog/confessions-of-an-seo-neophtye",
  "slug": "confessions-of-an-seo-neophtye",
  "title": "Confessions of an SEO Neophtye - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "About a year ago, I opened a webstore where I could sell my educational products. After a few years of selling on eBay, I was longing to break free of the high listing fees. I had no knowledge of SEO (I had never even heard the term) and my store reflected it. Pages had no titles, no headers, and…",
  "content": "Confessions of an SEO Neophtye Public Relations L By: Lori Bourne June 12, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: Lori Bourne June 12, 2007 Confessions of an SEO Neophtye Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. About a year ago, I opened a webstore where I could sell my educational products. After a few years of selling on eBay, I was longing to break free of the high listing fees. I had no knowledge of SEO (I had never even heard the term) and my store reflected it. Pages had no titles, no headers, and no quality content. I didn’t have many links and didn’t know how to go about getting them. For months, I was invisible to Google and my site never showed up in searches that I did for my chosen keywords. Then I hired a web designer to re-design the homepage of my store. I began to read her blog and saw that she recommended some posts by a “Rand” of “SEOmoz”. Who was this Rand, and what was a moz? My curiosity piqued, I clicked on one of the links and was taken to a post that outlined the factors that Google probably takes into account when ranking web pages. My site had none of the things listed, but at least now I had some idea of what to do to be noticed by search engines. I began to read the Beginner’s Guide to SEO, keeping one browser tab open to my store’s admin area at the same time. I went back and forth between SEOmoz and my store, and began to make changes based on what I was reading. Within a few weeks, my site started to show up in all the major search engines. I redoubled my efforts, joining discussion groups and social bookmarking sites to post links to my store. I created a page of informative articles to bring me traffic from longtail searches. I also started a blog and began offering free educational downloads as linkbait. After a few months, the verdict was in. I was now in Google’s top ten for many, many keywords related to my items. I had been a PowerSeller for two years straight on eBay, so my business was already quite successful, but sales have skyrocketed since I began to put effort into SEO and SEM. This past May was my biggest month so far, with an increase in sales of 240% over last year’s monthly average. When I first realized that my site needed some serious SEO help, I contemplated hiring someone else to do it. I’m friends with some of my competitors, and they had all hired people to handle that aspect of the business. My business could have supported the expense of some outside help. But my natural curiosity and self-motivation lured me into taking on the challenge of promoting my business myself. The other day, I received an email from SEOmoz saying that I had qualified for a free month of Premium Membership because of my contributions to the community. I was surprised and delighted by this news. As I started to browse the premium content, I realized that I had been making a flawed assumption. My assumption was that because I’m not a full time web designer or SEO, it wasn’t worth my while to sign up for Premium Membership. But truly, I was shortsighted. I might not have a roster of customers who depend on me to optimize their websites, but I do have one really important client: me. If I’m going to provide SEO services for my own website, and continue to remain competitive in the SERPs, I need to have the best info available. So thank you for the free month, SEOmoz, and for helping me with my business. If I had taken the path of hiring someone to do SEO for me, I would have missed out on a ton of interesting knowledge – but most of all, I would have missed out on hanging out with the most helpful, kind, and encouraging community I’ve ever come across. I’m pretty sure I made the right decision. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Confessions of an SEO Neophtye"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Confessions of an SEO Neophtye"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lori Bourne\n          \n            Lori Bourne"
}