{
  "url": "https://moz.com/blog/consumer-survey-reveals-the-efficacy-of-inbound-vs-outbound",
  "slug": "consumer-survey-reveals-the-efficacy-of-inbound-vs-outbound",
  "title": "Consumer Survey Reveals the Efficacy of Inbound vs. Outbound - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the growing resistance to interruptive marketing, it's clear that consumers are fed up with low-value, high noise marketing. But are some of these tactics and channels still an effective ingredient within a holistic marketing approach? Better yet, is inbound marketing any better in the eyes of…",
  "content": "Consumer Survey Reveals the Efficacy of Inbound vs. Outbound Marketing Industry By: Kelsey Libert September 1, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert September 1, 2015 Consumer Survey Reveals the Efficacy of Inbound vs. Outbound Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We've all heard the decades-old myth that the average consumer is bombarded with up to 5,000 ads a day. But if someone wanted to, he or she could get that number closer to zero. Just search for \"how to block ads\" and you'll find more than 700 million answers. Ad-avoidance is a growing issue for marketers and advertisers; recent data from Adobe made a stir due to their finding that 198 million people are blocking ads. Since ad blocking is mostly a desktop browsing phenomenon, there's a lot of room for it to become commonplace across all devices. For example, Apple's upcoming iOS9 will include support for ad-blocking extensions in Safari, so we may see a lot of people adopting ad blockers as part of their mobile browsing experience too. Additionally, a recent survey by Fractl and Moz found that 58% of respondents were using some form of ad-blocking software. With the growing resistance to interruptive marketing, it's clear that consumers are fed up with low-value, high noise marketing. But are some of these tactics and channels still an effective ingredient within a holistic marketing approach? Better yet, is inbound marketing any better in the eyes of the consumer? Fractl and Moz have once again teamed up for exclusive research, examining various marketing tactics' efficacy and efficiency. The first part of our research focuses on marketing efficacy. For this, we'll share consumer survey results regarding different traditional and digital marketing and advertising channels' ability to gain awareness, drive action, and influence purchasing decisions. For the second part, we'll look at the efficiency of these same media by breaking down what a $10,000 spend can achieve across several different channels. I. Efficacy: What Gets Results? Survey Methodology For this study, we went straight to the source: the consumer. In July 2015, we conducted an online survey of more than 1,000 people. Participants were asked 13 questions regarding their opinions on and recent engagement with various marketing and advertising media as well as tactics, including traditional advertising (TV, radio, print, billboards), direct mail, social media, content marketing, online search, display ads, ad retargeting, email marketing, paid search ads, mobile app ads, and sponsored story links. A few considerations: Within the survey questions, \"traditional advertising\" was defined as TV, radio, billboards, and print ads. We provided participants with visual examples of terms they may not have been familiar with, such as pay-per-click ads in the SERPs, retargeting, and sponsored story links. Participants skewed young; the majority were between 18 and 34 (73.2%). A majority of respondents were male (58.4%). Survey Overview Before we dive into the full survey results, here’s a glimpse into our findings: Most likely to have a positive influence on buying decisions: Customer reviews, search, online articles, traditional advertising, and direct mail Most likely to have a negative influence on buying decisions: Mobile app ads, display ads, paid search, and email marketing Most effective for attracting business: Direct mail, content marketing, and appearing in search results Popular methods for self-education: Search, visiting a company’s website, and customer reviews Most-noticed digital ads: Display ads, media ads, and mobile app ads Best outbound channels for grabbing attention: Traditional advertising, email marketing, and social ads The resulting findings are not an all-encompassing, all-knowing guide to which types of marketing people want. Rather, these insights may give you a new perspective on approaches you may not have considered before or may have believed to have dubious efficacy. For example, you may be just as surprised as we were to see how effective consumers find direct mail. Furthermore, these findings may simply reinforce the efficacy of your current marketing mix or what you already know about consumer behavior, especially the section about online discovery preferences. 1. Awareness of online advertising is high, but more than half of respondents are not engaging with these ads and/or actively preventing them from showing up. The majority of survey respondents are aware of and notice the various online ad formats. Around three-quarters noticed display ads within 30 days of being surveyed. The majority had noticed all of the ad formats we asked about. More than half (53.8%) reported they had not clicked on any ads within a week of being surveyed. Nearly a quarter (24.4%) clicked on a social media ad in the last week, the highest of any online ad. Somewhat surprisingly, sponsored story links were the second-most clicked, at almost 18%. More than 16% clicked on a display ad, which seems high considering a majority of respondents are using ad blockers (57.5%). Under 10% of respondents clicked on PPC ads. 2. Out of outbound and paid channels, traditional advertising, email marketing, and social media ads are most effective at grabbing attention. More than half of our respondents rate traditional advertising high for grabbing their attention. There is arguably no better way to reach a mass audience than through traditional advertising. Plus, studies show it remains effective for not only awareness but driving other KPIs. A study by Nielsen found that radio commercials are effective at driving brick-and-mortar traffic, with advertisers gaining an average $6 return for every $1 spent. And a recent MarketShare study rated TV as the most effective ad medium, citing \"TV is a major driver of indirect outcomes such as inbound calls, organic search query volumes, and website visits.\" With a direct line to consumers' virtual centers of attention – their inboxes – promotional emails were next best for grabbing users' attention, at 41.3%. Social media ads were the third-most attention-grabbing, catching the eye of 35.8% of respondents. Which ad formats aren't particularly attention-grabbing? PPC ads were found attention-grabbing by just under 10% of respondents. 16.5% found that mobile app ads grabbed their attention. Sponsored story ads were attention-grabbing for about 18%. 3. More than 88% use online search to seek out more information about a company, and greater than 93% had done so within a week's time. Online queries are a ubiquitous part of daily life, so it's not surprising that 88.3% of respondents use online search to research a product or company. Just over 85% visit a company's website and 81.9% read customer reviews to learn more. Other self-education methods are significantly less popular than using search, visiting a company's website, and reading reviews. More than a quarter (27.4%) follow a company's social media accounts to learn more about it, and 10.7% learn about a company by downloading content from its website. Asking respondents about their online behavior within the last week gave insight into how often they're seeking out information online – allowing companies to market to them – and consuming online content. A whopping 93.2% – almost the entire survey sample – used online search to find information about a company or product within the last week. Also within a week's time: 89% read an online article. More than half (50.8%) downloaded content from a website and gave a company their email address (50.2%). Over a quarter (28.5%) followed a company on social media. Notice almost just as many people downloaded content from a website as gave a company their email address, which may signal a relationship between handing over their email address in exchange for the content they downloaded. 4. Customer reviews, online search, and online articles have a positive effect on buying decisions for a majority of respondents. About 85% are positively influenced by customer reviews. 45% are significantly more likely and 40% are slightly more likely to buy something they hear about via customer reviews. More than three-quarters (77%) are positively influenced by online search. 25.7% are significantly more likely and 51.3% are slightly more likely to buy something they hear about via online search. More than half (56.7%) are positively influenced by online articles. 9.3% are significantly more likely and 47.4% are slightly more likely to buy something they hear about via online articles. Interestingly, email marketing was most likely to negatively impact buying decisions, with about 44% of respondents slightly less likely (22.9%) or significantly less likely (21.4%) to buy something they hear about via email marketing. Feelings tend to be neutral toward a company's social media posts and press releases, which don't affect purchasing decisions for 42.8% and 48.6% of respondents respectively. 5. Compared to other outbound and paid tactics, traditional advertising has the most positive effect on buying decisions, followed by direct mail. Traditional advertising has a positive effect on purchasing decisions for about two-fifths (42%) of respondents. 6.2% are significantly more likely and 35.8% are slightly more likely to buy something they hear about via traditional advertising. Direct mail positively impacts buying decisions for just over 30 percent. 4.2% are significantly more likely and 27.7% are slightly more likely to buy something advertised via direct mail. Still, it's worth noting traditional advertising and direct mail are significantly less impactful than hearing about a company or product through other sources such as customer reviews, online search, or online articles: Customer reviews are two times more likely to positively influence buying decisions than traditional advertising. Online articles' positive effect on buying decisions is 56% greater than direct mail. Hearing about a company through online search is 1.8 times more likely than traditional advertising to have a positive impact on purchasing decisions. On the other end of the spectrum, some ads have a negative effect on a person's likelihood to buy something. Mobile app ads, display ads, and paid search ads are more likely to have a negative effect on buying decisions, compared to other methods: More than half (54.3%) say mobile app ads have a negative influence. 31.4% are significantly less likely and 22.9% are slightly less likely to buy something advertised via mobile app ads. Nearly half (48.1%) are less likely to buy something advertised in display ads. 25.7% are significantly less likely and 22.4% are slightly less likely to buy something advertised via display ads. Paid search has a negative effect on just under half (49.4%). 25.3% are significantly less likely and 24.1% are slightly less likely to buy something advertised via pay-per-click ads in search engine results. 6. Direct mail, online content, and search are the most effective ways to attract customers. Direct mail and content marketing come out on top, with more than half of respondents rating these as smart ways to attract their business. Nearly half (48.3%) say showing up in search results when they have a want or need can help attract their business. Additionally: Well over a third of respondents consider traditional advertising (37.6%) and email marketing (34.6%) effective ways to win them over. About a quarter of respondents rate social media posts (27.4%) and social ads (24.8%) as smart tactics for attracting their business. Only 6.6% of respondents consider mobile app ads an effective tactic for earning their business. While our survey results tip in favor of inbound (search, content) and third-party endorsements (customer reviews), our respondents do find several outbound tactics effective, especially traditional advertising, for grabbing their attention and direct mail for attracting their business. But efficacy is only part of the marketing equation ... II. Efficiency: What's the Best Value? In addition to efficacy, the cost of getting results, or efficiency, should be given significant consideration for what to include in your marketing mix. Marketers are continuously tasked with doing more with less, so finding the most cost-effective methods for getting the greatest results is the holy grail for marketers. Cost Comparison of Various Marketing Channels Cost is typically touted as a large benefit of inbound marketing while being a barrier for choosing more costly outlets like TV and print media. To get a better sense of the efficiency of different channels, let's look at the potential costs of a campaign designed to generate awareness. CPM (cost per mille) is commonly used across a variety of ad mediums to measure the cost of a thousand impressions. CPM = (Cost of Ad x 1,000)/Audience Size In the ad-buying world, this is used to measure the efficiency of an ad medium. Focusing on this CPM makes sense for campaigns that want to achieve high awareness by getting a message in front of a substantial audience. Since so many variables impact the actual CPM rate you would pay for a given medium, the chart below should be used for informational purposes only. However, these figures do give an idea of the huge difference in the price you will pay to reach a certain audience size across various advertising and marketing channels. Direct Mail Pricing You'll notice direct mail is missing from the chart above. With a CPM of $583 for a letter-sized envelope direct mail piece, it didn't exactly fit nicely in our chart. Paid Search Pricing Although CPM is used in paid search, cost-per-click (CPC) is the more commonly used measurement, so we'll use that as our benchmark rather than CPM. Paid search costs can vary greatly depending on vertical, keywords, and targeting. While some keywords may only cost a handful of change per click, extremely competitive keywords can cost more than $5 per click. The chart below shows average CPC pricing data across nearly 700,000 keywords for a variety of verticals during 2014. Based on the figures above, the lowest CPC is $0.38 and the highest CPC is $4.41. This puts our median CPC at $2.40. The average CPC for this data set is $1.70. A note on CPC vs. CPM: Both are typically offered as options for paid search, display, and social ads. The chosen pricing model depends on campaign goals and budgets. CPM is often chosen for awareness-based goals and CPC is better for performance-based goals like traffic or conversions. What a $10,000 Budget Can Buy Based on the above pricing, let's look at how far a $10,000 budget would get you. Extremely High CPM: Direct Mail With a CPM of $583, for $10,000 you could send a letter-sized direct mail piece to 17,152 households. According to the Direct Marketing Association, the median ROI for direct mail campaigns using a prospect list is 12–14%, so this type of return on investment may be worth the high upfront costs. High CPM: Local Market Primetime TV A primetime spot TV commercial has the highest median CPM, at $33.85. (Spot TV means your commercial only plays for a local market, not a national market.) With a $10,000 budget, you can reach almost 300,000 local market viewers at that CPM rate. That's actually not such a bad deal – but keep in mind, it's for a one-time, 30-second spot and this is just the price to air the ad. Other cost considerations include producing the commercial, which may include script writing, editing, voiceover or acting talent, etc. Mid-CPM: Magazines Magazines fall somewhere in the middle of the pack, with a median CPM of $14.00. With a $10,000 budget, you could afford an ad in a magazine with a circulation of about 715,000 readers. Pricing varies based on the size of the ad, color or black and white, page position, and position within the magazine. Also consider the cost of the ad creative, such as copywriting and design. Low CPM: Facebook Ads With a CPM of $1.54, Facebook advertising is the most budget-friendly of the bunch. At that rate, $10,000 can pay for almost 6.5 million impressions. This budget would allow you to reach a ton of Facebook users at once or target the same people with multiple ads over a long period of time. Keep in mind, Facebook ad CPMs and CPCs typically become more expensive the more granular your targeting becomes. CPC: Paid Search A $10,000 campaign with a CPC of $2.40 would guarantee at least 4,167 clicks. The same amount spent for a $1.70 CPC would yield 5,882 clicks. For some perspective on how many people would see the ad, assuming a 5% click-through rate, the ad with a $2.40 CPC would get about 83,330 impressions and the $1.70 CPC ad would get about 117,640 impressions. The CPM of Content Marketing Content marketing is a little trickier to cost out since there's no industry-wide standard unit of measurement for things like impressions and costs-per-click, which makes an apples-to-apples comparison between the cost of outbound, paid, and inbound difficult. However, we do have a recent, relevant example of the price of content marketing versus TV. Content marketing can garner viewership similar to a sizable TV audience – but for a fraction of the price. We recently had a Fractl client campaign placed on BuzzFeed that achieved more than 3.2 million views within several days of publication. According to the rates above, you would have to pay around $75,000 for a 30-second TV spot on a primetime network TV to reach a similarly-sized audience. Add the additional viewership from syndications and social sharing, and the equivalent in terms of viewership is probably similar to what more than $200,000 would buy you for a TV commercial. Not to mention the SEO value derived from the content. With a Fractl campaign of this scope averaging $10,000 for end-to-end strategy, production, and promotion, that makes the CPM roughly $3.13. While a $10,000 Facebook ad spend can garner the most impressions, the same budget going toward a large-scale content marketing campaign can include benefits beyond exposure to a huge audience, such as increased rankings, syndication, and long-term visibility. Key Takeaways Choosing the right marketing mix depends not only on how well a given channel and tactic are for the KPIs you want to achieve, but also your available budget. Striking a balance between efficacy and efficiency is crucial for a long-term, sustainable marketing strategy. In summary, below are some of the main takeaways from our findings: Awareness: Traditional advertising Loudmouths digital advertising when it comes to grabbing attention. Email marketing and social media ads came in second and third, respectively, for grabbing viewers' attention. The majority of respondents used search engines and or read online content within a week of being surveyed, making these effective avenues for getting in front of your target audience. To learn more about a company, a majority of survey participants turn to search, the company's website, or customer reviews. Display ads were the most-noticed digital ads, but had low engagement. Conversions: More than half had downloaded content or given a company their email address within a week of being surveyed, which may be due to opting-in for content offers in exchange for their email. Customer reviews, search, and online articles have the most positive effect on buying decisions. Of the outbound channels, traditional advertising and direct mail were most likely to have a positive effect on buying decisions. Respondents rated direct mail as the most effective way to attract their business. Survey participants also said offering them free content or appearing in search results are some of the best ways to win their business. Cost: Based on our cost analysis, content marketing and Facebook advertising are the most cost-friendly ways to reach a wide audience. Want to see more data from our consumer survey? We've also filtered out the Millennial segment within the survey responses (18- to 34-year-olds) to extract additional insights. For our findings on how Millennials feel about various marketing tactics, be sure to download our free white paper. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Consumer Survey Reveals the Efficacy of Inbound vs. Outbound"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Consumer Survey Reveals the Efficacy of Inbound vs. Outbound"
    },
    {
      "level": "H2",
      "text": "I. Efficacy: What Gets Results?"
    },
    {
      "level": "H3",
      "text": "1. Awareness of online advertising is high, but more than half of respondents are not engaging with these ads and/or actively preventing them from showing up."
    },
    {
      "level": "H3",
      "text": "2. Out of outbound and paid channels, traditional advertising, email marketing, and social media ads are most effective at grabbing attention."
    },
    {
      "level": "H3",
      "text": "3. More than 88% use online search to seek out more information about a company, and greater than 93% had done so within a week's time."
    },
    {
      "level": "H3",
      "text": "4. Customer reviews, online search, and online articles have a positive effect on buying decisions for a majority of respondents."
    },
    {
      "level": "H3",
      "text": "5. Compared to other outbound and paid tactics, traditional advertising has the most positive effect on buying decisions, followed by direct mail."
    },
    {
      "level": "H3",
      "text": "6. Direct mail, online content, and search are the most effective ways to attract customers."
    },
    {
      "level": "H2",
      "text": "II. Efficiency: What's the Best Value?"
    },
    {
      "level": "H3",
      "text": "Cost Comparison of Various Marketing Channels"
    },
    {
      "level": "H3",
      "text": "What a $10,000 Budget Can Buy"
    },
    {
      "level": "H3",
      "text": "The CPM of Content Marketing"
    },
    {
      "level": "H2",
      "text": "Key Takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}