{
  "url": "https://moz.com/blog/constant-content",
  "slug": "constant-content",
  "title": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The State of Content Marketing Survey told us that 92% of marketers don't have a clear plan for content marketing. The only answer: the constant content approach.",
  "content": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy Content Marketing | Marketing Industry | SEO Basics By: Simon Penson April 5, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Simon Penson April 5, 2017 Constant Content: The Silver Bullet for Failing Content Marketing Strategy Content Marketing | Marketing Industry | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Incredible, isn’t it? Despite all the fanfare and pageantry that has followed content marketing over the last few years, fewer than 6% of marketers confidently claim to be executing content marketing strategies properly. It’s just one of a handful of eye-popping stats to come out of the State of Content Marketing Survey, a major new survey of senior UK marketers this month as part of a campaign to help create healthy debate around the misunderstood tactic. With more budget than ever before pouring into the approach (60% of those surveyed said they were opening the purse strings further in 2017) 92% admitted to not knowing exactly how they should execute. To check out all the results from the survey, click below (opens up in a new tab): The biggest pain point of all to come out of the State of Content Marketing survey? \"Producing engaging content, consistently.\" I had been reading all the results with mild interest until those words stopped me dead in my tracks. You may think the source of that concern stemmed from the fact that such a thing should be easy to manage, but it goes deeper than that. Success with content is predicated entirely on your ability to consistently produce content that engages, resonates and adds value to your audience’s lives. And if producing that is the single biggest barrier then we have a problem! You see, investment in content is a waste of money if you don’t have a well-designed plan to deliver constant content. It doesn’t matter how brilliant your campaigns are if your audience has no other content to come back to and engage with. And this is where the constant content plan comes in... Constant content The concept is a simple one: no content plan is complete unless it's based around delivering content consistently. To do this requires a focus on strategy, not just on a few blog posts and the odd bigger campaign. The best way to explain this is to visualize it in a different way. Below, you’ll see a simple diagram to throw light on my point. Here we can see how a campaign-led strategy exposes holes in your plan. While we have plenty of activity going on in both our owned and earned channels, the issue is what goes on between large content launches. Where do those people go during those periods of inactivity? How do we keep them engaged when there's no central content hub to pull them into? This kind of approach is something we see often, especially from larger brands where budgets allow for more creative content campaigns to be run regularly, and here’s why it doesn’t yield positive ROI. As human beings, we like variety. To keep us hooked, content delivery needs to reflect this. Campaigns need to be designed as part of a whole, becoming a peak content moment rather than the only content moment, pulling new audiences back to the constant content activity going on at the center of brand activity. You see it in the way magazines are organized, starting with an initial section of often short-form content before you then hit a four-plus-page feature. This is done to ensure we keep turning the pages, experiencing variation as we do so. This is something I like to call content flow. It’s a great strategic \"tool\" to help ensure you design your overall strategy the right way. The approach to strategy The key is actually very simple. It focuses the mind on the creation of a content framework that enables you to produce lots of high-quality regular content and the ideas that flow from it. I call it the \"Constant Content Plan.\" The right way to approach the content planning phase is to create a process that supports the building of layers of different content types, like we see below in our second diagram: In this example, you can see how we intersperse the bigger campaigns with lots of owned content, creating a blog and resources section that gives the new visitor something to explore and come back to. Without it, they simply float back out into the content abyss and onto someone else’s radar. That consistent delivery — and the audience retention it creates — comes from the smaller content pieces, the glue that binds it together; the strategy in its entirety. \"Smaller\" doesn’t mean lower-quality, however, and investing lots of time through the ideation phase for these pieces is critical to success. Creating smaller ideas To do this well and create that constant content strategy, a great place to start is by looking at the ideas magazines use. For example, these are the regular content types you often find in the best-crafted titles: What I've learnedAdvice piece from a heavy-hitter. Can sometimes be expanded to what I've learned in my 20s, 30s, 40s, etc. The dual interview Get two people together for an interview. Write an intro as to why they’re there, and then transcribe their chat. Bingo: unique content. Have you ever/What do you think of? Pose a question and ask ten people for their responses. Good reactive content to a particular event that might pertain to one of our clients. Cash for questionsGet an interviewee/expert and pose them a series of questions gathered from real-life members of the public. A day in the lifeWhat it says on the tin — an in-depth look at someone of interest's working day. Person vs person debate Start with a question or subject matter, get two people, put it to them, and record the results. Master xxxxxx in five minutes A short how-to — can be delivered in pictorial or video format. This style of regular series content lends itself well to online strategy, too. By running these regularly, you create both variety and the critical stickiness required to keep the audience coming back. Of course, with such variation it also then allows you to create better newsletters, social strategies, and even inbound marketing plans, maximizing that return on investment. The strategy allows for informative content as well as entertaining pieces. In doing so, it gives your brand the opportunity to build subject trust and authority, as well as capturing key opportunities in the purchase funnel such as micro-moments and pain points. This combination of informative and entertaining output ensures you're front and center when your customer eventually falls into the purchase funnel. Some examples One way of bringing this to life is to look at brands already executing well. One of the best blog strategies I have seen in some time is the one by Scotts Menswear. One of the key reasons for its quality is the fact it's run by a very experienced print editor. If we reverse-engineer what they’ve been doing on-page, we can clearly see that much thought has gone into creating variation, entertainment, and usefulness in a single well-rounded strategy. Take the last ten posts, for instance. Here's what we have and how it flows: Seven Films We're Looking Forward to in 2017 – Video-based entertainment/lifestyle piece. Key Pieces for Your January Fitness Drive – Trending content with useful advice. Style Focus – A great regular piece that jumps on trending \"news\" to discuss the implications for fashion. Updated Classics from Puma – A news article on a new trainer release. Polo Shirts: A Wardrobe Staple – An in-depth guide to a key piece of clothing (part of a series). Our Guide to Valentine's Day – Lifestyle guide that helps convey brand positioning, tonality, and opinion. Nail Your Valentine's Day Outfit – Helpful guide to getting it right on a key seasonal event in the audience’s calendar. Clearly, they see Valentine's as a sales peak. Get Your Overhead Jacket Kicks – Guide to a fashion staple. 5 Brands and Acts Tipped for Greatness – Lifestyle piece tapping into the music/fashion brand positioning. Our 5 Favorite Trainers Online Right Now – Great list feature to help the consumer buy smarter. You can clearly see how they're using structured thinking to create a blog of real variety and value. By combining this with a strong big-bang content plan that sucks in new visitors, you can build a hefty retained audience that improves critical metrics such as dwell time, returning visits, engagement, and sales. Building our own plan I know what you're thinking. \"Sounds great, for a brand in fashion. It’s cool and interesting. But I work in a 'boring' niche and this type of stuff just isn’t possible.\" While it could be a little more difficult that doesn’t mean it is impossible by any stretch of the imagination. To prove the point, let’s look at a fictional example for a company in the medical products sector. Here’s the deal: A2Z Medical is a company built up in the '60s and '70s. They have a huge B2B footprint but want to bring their marketing strategy into the current decade, in part because they are launching a consumer-facing brand for the first time. The new venture will offer medical kits for the general public and as such requires a proactive, content-led strategy to promote trust, awareness, and engagement alongside the obvious requirement for sales. Audience research The first step in building a content strategy is to understand your audience. We could go into the detail of that all day long, but for the sake of this example we already have detailed data that tells us there are two main groups of people interested in coming to and buying from the site. I've also written about the process I go through to define personas, and would always recommend this post too for background. James is an obsessive ailment Googler, worrying over every little thing that he or his family suffers. He’s a detail man and wants to be prepared for all eventualities. Chloe, on the other hand, has very different needs. She's a mum, works part-time to help pay the bills, and then devotes herself to her family and children. She's time-poor and takes a practical view on life to make it work. Her purchase behavior is based on distress or urgent need. Different need states It is abundantly clear from this very quick overview that each have very different purchase journeys and needs from a content perspective. We'll look at what this means for our content strategy a little later. Before we dive into that, though, we must also look at our understanding of the market opportunity. This data-dive helps us to understand what people are looking for now in the space, where they get it from currently, and where the gaps may be. The data-dive This work is carried out by one of our content strategists before any creative sessions take place. This ensures we can validate ideas back to what the data tells us. So, what does that process involve? Let’s look at each stage briefly now: Long-tail research Quora/Reddit/forum research Magazine research Pub beers! It's a well-covered subject area, but also a very important one; it often yields ideas that convert fastest to traffic and revenue. 1. Long-tail research Much has been written (including this piece I penned in 2015) on this subject area, and in much more detail than I aim to cover it here. Right now, let’s focus on some key tools and areas for opportunity. It's easy to get lost in this process, so the key is to keep it simple. To do this, I stick to a small handful of tools: SerpStat – Has a useful long-tail tool based on Google Suggest to give you lists of questions by keyword phrase. Keywordtool.io – A similar tool, but free to use. Slightly more clunky. Bloomberry – A new tool by the makers of Buzzsumo. Does a great job of finding opportunities from other sources, such as other sites and forums. It also has a nice data visualization view that gives you volume and key competitor info, the latter of which can be helpful for a later stage in the process. Here’s an example of a search for \"first aid\": Storybase – A free tool that pulls long-tail phrases from a variety of sources for content ideas and also includes some demographic data. This can be helpful when it comes to matching ideas to personas. For the sake of this process, we're not looking to build a full long-tail strategy, of course. This is solely about finding content ideas with search volume attached to them. By downloading from a bunch of sources (such as those above), it's then relatively easy to de-dupe them in Excel and create a master list of ideas to pull into your overall plan. It can make sense to segment or classify those ideas by persona, too. I do this via simple color coding, as you can see below. This allows you to create a shortlist of ideas that are on-brand and have the required level of opportunity attached. Working this way makes sure you're thinking hard about serving the needs and pain points of the personas. To further reinforce this point, it can work very well to include a mini-brainstorm as part of this stage, gathering a few people to talk specifically about the pain points experienced by each persona. In this session, it's also useful to talk through the various micro-moment opportunities by asking what questions they ask in each of the following scenarios: I want to go….I want to do…I want to know…I want to buy… You should end up with a list of content ideas per persona that covers pain points and interests. 2. Quora/Reddit/forum research Another great source of information is the world of forums and aggregator sites. As you might expect, this starts with sub-Reddit research. Within categories like those below lies a wealth of questions, the answers to which form brilliant article inspiration: If we pop into the /AskDocs/ forum, we see a plethora of medical challenges from people looking for help — perfect real-world examples of everyday ailments that a site like ours could help to answer. Q: I have a painful stomach when eating pork…? Q: Will I need less sleep if I’m on a good diet and active? Q: Swollen lymph nodes and nose bleeds. What could be going on? The answers to these questions often require much research and professional advice, but by working through them for the less-serious everyday issues you could soon help Chloe out and become a useful ally. The same is also true of Quora. You can play around with advanced search queries to drill into the juiciest boards by carrying out searches such as: Another fantastic area worthy of research focus is forums. We use these to ask our peers and topic experts questions, so spending some time understanding what's being asked within your market can be very helpful. One of the best ways of doing this is to perform a simple advanced Google search as outlined below: \"keyword\" + \"forum\" For our example, we might type: The search engine then delivers a list of super-relevant sites designed to answer medical questions and we can easily pick through them to extract ideas for popular content. And as an extra tip search for your keyword and “vBulletin” – a popular software used for forum sites. This will often surface rarely found sites with some real insight into particularly the older demographic, who are more likely to use traditional forums. 3. Magazine research Another very important area to explore is magazine research. They contain some of the most refined content strategies in existence; the level of expertise that goes into idea creation and headline writing is without equal. It makes sense, therefore, to find titles relevant to your niche (in our case, health and medicine) and look for great content opportunities. You can even do this online, to a degree. If you go to a site like magazines.com, greatmagazines.co.uk, other magazine subscription sites, or even perform a Google image search, you’ll find a myriad of headline ideas simply by looking at covers. In the example below I've Googled \"medical magazines\" and found numerous cover lines that would form great digital content. Here’s an example from just one, 4Health Magazine: 4. Pub beers And last but certainly not least, we have the tried and true \"chat-in-a-pub\" approach. It might sound like an excuse for a beer, but it’s actually very useful. If you can find a handful of people aligned to your personas, offer to buy them a few drinks and chat through their experiences and challenges. You’ll be surprised what you find out! Product range Of course, it pays to add some level of alignment to the plan by understanding which products offer the best margin or are most important to the business. This info should come out of your initial onboarding and overall strategy creation process, but it can also be found via Analytics (if set up correctly) by looking for the best-selling products and finding out their trade cost. The creative process By this point, you’ll be overflowing with data and ideas for content. The challenge, however, is ensuring that you can add variation to that ideas mix. I call this stage the \"Magazine and Hero Process.\" Magazine ideas To create that level of engagement and stickiness, we need ideas that are less practical and more entertaining. Any good content strategy should include a good mix of both informational and entertaining ideas; the first part of our creative brainstorm focuses on concepts that will achieve this balance. We follow a structure that looks loosely like the below: Stage one: We start by asking \"human\" questions about each of our personas. While we may have completed all the keyword research in the world, it's important to take a real-world view on pain points and so forth. From here we discuss the purchase funnel stage, ensuring that we have ideas not just for the top of the funnel but all the way through it, backed by a mix of content types to support that variation aim. That conversation will then be followed by a look at the brand's wider marketing plan and seasonal events to ensure we plan key periods of activity thoroughly. And the icing on the top is the quick look at our \"swipe file,\" a treasure trove of old ideas we've seen, to see if we can borrow a concept or two for our plan. Stage two: The second and final stage of our ideation is a forensic exploration into what magazines can offer. I am a voracious devourer of specialist magazines; it can really pay dividends to look for clever ideas or content series to bring into your plan before the massive validation process begins. This will sort the possible from the impossible. By following a set way of discussing ideas, you'll leave no stone unturned. The discussion around the purchase funnel often turns out to be incredibly important: it ensures you look not just for ideas that help with awareness, but also further down the funnel. It's also possible to tie content types in to this to ensure variation between the types of content you produce. To do this we use the Content Matrix I created specifically for this purpose; you can see it below: The idea here is that it makes it easier to decide what content types fit with which parts of the funnel best and also the relative size of that content in terms of the man hours required to create it. Working in this logical fashion will help with overall content mix. Hero ideas Once you've worked through that process, it's time to open up bigger ideas. These are important for one very simple reason: they help you find and reach new audiences to pull back into your sensational constant content plan. We won’t go into detail here as to how to come up with consistently good big-bang ideas, as the point of this post is to look at the more regular content strategy, but if you want to read more about it click here. For now, it's enough to note that you should also include time to think about campaigns and how they fit into your overall plan. Pulling it together – process + example By now, you should be swimming in great ideas of every kind imaginable, every one of which ties back nicely to your personas. In our example, we've been focusing on Chloe and James. The next job is to lay those ideas out based on what you know can be delivered. This process is broken into two parts: The laying out of the content based on ensuring variation and content flow. Fitting that plan into an operational format that's deliverable and based on available resources and/or budgets. Getting that to work is little more than trial and error, but the result should be a content calendar that delivers on the promise of a great mix of regular content ideas, entertaining pieces, and helpful content that makes both James and Chloe want to come back to again and again. Here’s an example of a two-week window to give you an idea of how just a portion of that regular content might play out: Free downloads Fancy giving it a go? You can use this free brand-as-publisher download to make the process easier. It contains all the tools and templates you need to ensure your output joins up the dots to maximize engagement and ‘stickiness’ from your regular content and to critically fix your issues with content marketing effectiveness. And for those of you that want to see the Content Marketing Survey results in full click on the banner above to claim your free results ebook, complete with commentary, or scroll below for the highlights... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Constant Content: The Silver Bullet for Failing Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Constant content"
    },
    {
      "level": "H2",
      "text": "The approach to strategy"
    },
    {
      "level": "H3",
      "text": "Creating smaller ideas"
    },
    {
      "level": "H3",
      "text": "Some examples"
    },
    {
      "level": "H2",
      "text": "Building our own plan"
    },
    {
      "level": "H3",
      "text": "Audience research"
    },
    {
      "level": "H3",
      "text": "Different need states"
    },
    {
      "level": "H3",
      "text": "The data-dive"
    },
    {
      "level": "H4",
      "text": "1. Long-tail research"
    },
    {
      "level": "H4",
      "text": "2. Quora/Reddit/forum research"
    },
    {
      "level": "H4",
      "text": "3. Magazine research"
    },
    {
      "level": "H4",
      "text": "4. Pub beers"
    },
    {
      "level": "H3",
      "text": "Product range"
    },
    {
      "level": "H2",
      "text": "The creative process"
    },
    {
      "level": "H3",
      "text": "Magazine ideas"
    },
    {
      "level": "H4",
      "text": "Stage one:"
    },
    {
      "level": "H4",
      "text": "Stage two:"
    },
    {
      "level": "H3",
      "text": "Hero ideas"
    },
    {
      "level": "H3",
      "text": "Pulling it together – process + example"
    },
    {
      "level": "H2",
      "text": "Free downloads"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Penson\n          \n            Simon Penson\n          \n            Simon Penson"
}