{
  "url": "https://moz.com/blog/content-engine-drives-revenue-whiteboard-friday",
  "slug": "content-engine-drives-revenue-whiteboard-friday",
  "title": "A Content Engine that Drives Revenue — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In today’s Whiteboard Friday, MozCon speaker and content marketing expert Ross Simmonds walks you through his method for creating a content marketing engine that will ultimately make you money, rooted in four simple steps: research, create, distribute, and optimize.",
  "content": "A Content Engine that Drives Revenue — Whiteboard Friday Content Marketing | Whiteboard Friday By: Ross Simmonds September 9, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ross Simmonds September 9, 2022 A Content Engine that Drives Revenue — Whiteboard Friday Content Marketing | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In today’s Whiteboard Friday, MozCon speaker and content marketing expert Ross Simmonds walks you through his method for creating a content marketing engine that will ultimately make you money, rooted in four simple steps: research, creation, distribution, and optimization. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hey, Moz friends. I'm Ross Simmonds, and today we're going to be talking about something that I hold really deep to my heart — the idea of using content to generate revenue, generate business results. We're going to be talking about how to create a content marketing engine that ultimately will make your money jiggle, jiggle, or fold, I don't know. But either way, what we're going to be talking about today is something that I really hope you can apply to your content marketing teams, that you can apply to your entire engine and ultimately shape the way that your content culture operates. And it's rooted in four simple steps — research, create, distribute, and optimize. And if you can embrace a culture that leverages those four things consistently, year after year, quarter after quarter, month after month, I am convinced that you will be able to see revenue results and the goals that you have set out to accomplish directly from your content engine. Let's dive into each of them. Research So the first one is research. This is essentially tactics, people, and timeline, and goals that are going to be applicable to each of these different categories. Tactics Community research When it comes to research, the tactics that you want to embrace upfront and initially are rooted in things like community research. What does that mean? It means you're going to go and find the communities that your audience is spending time on online. You're going to go into these communities and you're going to start to understand the trends and the types of content that they're consuming, the problems that they're talking about on a regular basis. You're looking for qualitative insight to understand the problems of the audience that you're trying to reach. Keyword research Then you're going to do things like keyword research. You're going to understand the search intent behind the words that your audience are going into Google and typing in to find problems, to find information, to solve problems that they're having on a day-to-day basis. Keyword research is a great solution and a great way to better understand the thinking and the things that people that you want to connect with are looking for. If you can understand this, if you can create content that services them as it relates to their informational intent or understand the way that they buy and whether or not they're looking for coupons or whether they're looking for things near me, and you can create content based off of this research, it will make it easier for you to be able to generate revenue off the back of your content. Backlink research You also want to do things like backlink research, which is going to inform backlink outreach. You want to do backlink research because it's going to give you insights into knowing what content you can create that is linkable. What is content that is being produced, the ideal publications that your audience is reading are linking back to? You want to use all of this to inform your own strategy. Social sharing and paid media research Social sharing research, paid media research. Look at the content that people in your audience are sharing on social. Look at your competitors and what information and resources they're promoting, because it's very likely that if they're running ads to a certain landing page, that it's probably generating some revenue. So you want to look at that and use it to inform your own strategy as well. People What type of people on your team do you want to have making these types of decisions and doing this research? It's pretty holistic. You want SEOs. You want social media managers. You want your community manager involved. You want your PPC folks involved. You want a strategist, an analyst, maybe even some developers involved. This is an important piece of the puzzle that oftentimes gets overlooked. When we think about our industry, content marketing, there's two words there — content and marketing. We forget about marketing actually being rooted in research. So you want to embrace the research side of things before you start creating content, and you want to have a holistic team doing this. Timeline This might take one to three months, and that's okay. It might take some time. But the key here is to understand that this investment in time is going to ultimately pay the bills. It's going to generate revenue for you. So be patient, embrace it, and use it. Goal The goal here is simple, folks. You want to unlock content market fit. What is content market fit? It's complete alignment between the content you create and the market that you're trying to connect with. And if you have content market fit, you're going to have content that is worth creating. Create So let's talk about that one. Creation. What type of content should you create? This is going to happen as the second step in your content marketing engine. Tactics You don't want to just start writing blog posts without intent. You don't want to start creating white papers without intent. You want to first understand the research and let that inform what you create. Should you develop blog posts? Should you develop research-based assets? Should you create infographics? Or maybe you should just create some memes and share them on Twitter and LinkedIn and Facebook, etc. Maybe that's the play for you. Every brand is going to be different. And every single type of asset that you create, every single type of asset that you invest in is going to have a different outcome and it's also going to have a different type of goal that you're aligning with it. You should determine which content you invest in based on the research. People After understanding your audience, you will have a better understanding of the types of content that you should create. And you're going to have a handful of different people involved in this process as well, but it's going to be rooted directly in the types of assets you create. Maybe you'll have writers. You'll definitely want to have an editor. You don't want typos and all that good stuff. You're going to want a designer maybe. If visual is the way that you're going to go, you might need a videographer. You might need a developer, an illustrator. There's so many different people who you might need involved to create a great content. And that is the goal. Timeline It might take one to four weeks, it might take even longer than that. Goal But the goal is simple. Create content that is worth reading, worth sharing, worth linking to, worth watching, etc. You have to have intent behind every single asset that you create, and you also have to recognize that not all assets are created equally. It might take a day to create a great meme. It might take months to create a research-driven asset that actually has some utility and functionality within it. And that, too, is okay. It's a different level of investment, which might mean it needs to deliver a different type of ROI and revenue, but at the same time, it's an investment worth making. Distribute All right, research and create, that's typically where most brands end. They create their content. They say, \"Yay, we're successful. We're writing content. We're creating content. This is it.\" But they forgot, again, as I mentioned earlier, content marketing. You actually have to market the content that you're producing. How do you do that? Distribution and optimization. These are two things that you actually have to do forever. Notice that, forever, forever? Create once, distribute forever. Create once, optimize forever. What does that mean? Tactics When it comes to distribution, these assets that you've created, you have to spread them. You have to ensure that they are reaching the audience that you want to connect with. Maybe that's through newsletters. Maybe that's through communities that they're already browsing in. Do you sponsor that new community? Do you go into that community and seed it yourself, where you actually start responding to people in that community with links to the content that you've created? On social media, maybe you're going to start injecting that content into threads on Twitter. You're going to share it on LinkedIn. You're going to go into Facebook groups and start to spread it in Facebook groups as well. You want to distribute your content where your audience is spending time. SEO And this might blow a few people's minds, but SEO is a distribution opportunity as well. When you're thinking about optimizing your content for search, search is a distribution channel. And you can optimize your content, not just from an SEO on the Google side, but also from a YouTube side, search from a Facebook side, from a TikTok side, from a Pinterest side. Search across the board is an opportunity to optimize your content to ensure it's being distributed. People Who's going to be involved with this process? Again, a handful of different people depending on the research that you did upfront. If the research tells you that you need to be in communities, maybe it's going to be a community manager. Maybe it's going to be a social media marketer. Maybe if you identified that sales team is going to play a key role in your distribution strategy, that it's your sales team that's actually going to be sending this to prospects and leads, that when that white paper goes live, you want your sales team empowered and in the loop so they can reach out to them. Maybe customer success is going to be involved and they're going to be sharing content and resources with people who have questions and problems with a product and a feature. Or maybe your product people need to be involved and it's going to actually be something that they can consume while they're using the product. Timeline Again, you create once, you distribute it forever. Goal The goal? Simple, you want to reach the ideal audience with your content, no matter where they're spending time. You want to make sure that that content is being distributed there. And if you have that underway, by all means, trust me, you're probably 20 steps ahead of most brands that you're competing with because most people think that content marketing just means creating content and calling it a day. If you start to distribute your content, you're 10 steps ahead. Congratulations. Optimize If you want to go 20 steps ahead, also optimize your content. What does that mean? Tactics It means that you are going to consider offsite optimization. You're going to consider onsite optimization. Ensure that the title tags, the H1s, all of those things are rooted in research. Make sure that if you have a piece of content, you're also cross-referencing the people also ask questions box on Google to inform what other content should we be adding into this piece. A piece of content that you published three years ago, that generated some backlinks, generated some organic traffic, and started to decline because more content on that topic started to show up doesn't mean it's no longer a good asset. What it means is it needs to be refreshed. It needs to be updated. So take the time to do that onsite optimization effort to make that content just as valuable today as it was three years ago. Invest the time in optimizing your content with new data, new information. You want to do that. You also want to ensure that the interlinking within your website between that asset and other assets' priority landing pages is happening. You want to optimize your content forever, but not just from a search lens. You also want to think about it from a conversion lens. Can these pieces get people closer to the money? Can they get closer to sign up, to an acquisition point, to that key conversion goal that you're setting out to accomplish? Those are the types of things that you want to be thinking about. People Who would be involved here? Everything from SEOs to CROs, to writers and strategists. You might even have some people on your team that are solely dedicated to running an in-depth audit and review of your content assets and then updating them on a regular basis. If you have billions of pages, maybe you need to involve the team that's running engineering, etc. and make sure that they are building essentially a model that will make updates to your content on a regular basis. Timeline These are the things that you want to be thinking about because you should be optimizing your content forever. Why? Because the ultimate goal is to extract value from the content that you're investing in. And you will notice that over the course of this video, I've referenced content specifically as assets consistently. Why? Because assets are things that you create, you invest in, because you expect to have a return. And when you're thinking about your content marketing engine, you want a return. You want a return on your investment. Goal And the goal with all of this, with all of the content that you create, with all of the research that you've done, all the stories that you've started to distribute, and the content assets that you've optimized over and over again, is to ensure that you're generating revenue, you're generating results. And if you can do that, then you're going to have a content marketing engine that could fundamentally change the way that business is done in your industry, in your niche, and within your content culture. So I encourage you to embrace it. Embrace a content engine that can drive results by researching, creating, distributing, and optimizing your content consistently. Thank you so much for your time. I hope you enjoyed this. You can find me on the internet. I'm all over the place. Love to connect with you there. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Content Engine that Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Content Engine that Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Research"
    },
    {
      "level": "H3",
      "text": "Tactics"
    },
    {
      "level": "H4",
      "text": "Community research"
    },
    {
      "level": "H4",
      "text": "Keyword research"
    },
    {
      "level": "H4",
      "text": "Backlink research"
    },
    {
      "level": "H4",
      "text": "Social sharing and paid media research"
    },
    {
      "level": "H3",
      "text": "People"
    },
    {
      "level": "H3",
      "text": "Timeline"
    },
    {
      "level": "H3",
      "text": "Goal"
    },
    {
      "level": "H2",
      "text": "Create"
    },
    {
      "level": "H3",
      "text": "Tactics"
    },
    {
      "level": "H3",
      "text": "People"
    },
    {
      "level": "H3",
      "text": "Timeline"
    },
    {
      "level": "H3",
      "text": "Goal"
    },
    {
      "level": "H2",
      "text": "Distribute"
    },
    {
      "level": "H3",
      "text": "Tactics"
    },
    {
      "level": "H4",
      "text": "SEO"
    },
    {
      "level": "H3",
      "text": "People"
    },
    {
      "level": "H3",
      "text": "Timeline"
    },
    {
      "level": "H3",
      "text": "Goal"
    },
    {
      "level": "H2",
      "text": "Optimize"
    },
    {
      "level": "H3",
      "text": "Tactics"
    },
    {
      "level": "H3",
      "text": "People"
    },
    {
      "level": "H3",
      "text": "Timeline"
    },
    {
      "level": "H3",
      "text": "Goal"
    },
    {
      "level": "H2",
      "text": "The MozCon 2022 Video Bundle is now available!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Ross Simmonds\n          \n            Ross Simmonds"
}