{
  "url": "https://moz.com/blog/contextual-search-arbitrage-pure-click-insanity",
  "slug": "contextual-search-arbitrage-pure-click-insanity",
  "title": "Contextual Search Arbitrage - Pure Click Insanity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let's take a walk together down a click-path that's become increasingly popular for less-savvy users. We'll start at MSN's search page, where the results for credit card offers are looking especially black-hat:\n...",
  "content": "Contextual Search Arbitrage - Pure Click Insanity Online Advertising By: Rand Fishkin September 24, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 24, 2006 Contextual Search Arbitrage - Pure Click Insanity Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let's take a walk together down a click-path that's become increasingly popular for less-savvy users. We'll start at MSN's search page, where the results for credit card offers are looking especially black-hat: First off, we can see that blogspot subdomain spam is still remarkably effective, despite the fact that MSN has been alerted to the issue for many months. I'm also curious about how the word \"assified\" is relevant (nevermind \"spatchcock\") to credit card offers, but I'm picky... Now let's follow that link (it's cloaked, so you actually get re-directed): This lovely site is serving contextual ads and since we don't want to be here any longer than we need to, we'll just follow the first one that suits our fancy: That's odd... It's another spammy-looking site serving AdSense and a variety of other contextual ads. We'll click another just to see if we can get to a real site: OK, this is getting ridiculous. Let's just click a few more times: And one more for good measure: That's all... I'm done, and I think we've illustrated the point. If one wanted to, one could follow a near-infinite loop of contextual ads pointing to pages serving contextual ads and attempting to re-monetize that traffic. The real question here is - who the heck is paying for all these clicks?!! This is the process of PPC arbitrage. Any click that earns a certain amount of money can, potentially, be re-monetized for another, higher amount by serving increasingly targeted and more expensive ads (and keeping the CTR at an acceptable ratio). If I'm site #1, paying $0.10 a click for traffic, and I make $0.35 per click (and convert 30% of my visitors into clicks), I'm making money, albeit a very small amount. The practice of click arbitrage exists in thousands of online markets and makes for an exceptionally low-quality surfing experience (as seen above). The real culprits here aren't the arbitrageurs - given the chance to buy traffic at $0.10 a click and make $0.12 per visitor, you have to expect that players will enter the market. Behind the veil is AdSense (and to a lesser extent, other contextual ad systems like Azoogle & Yahoo! Publisher Network). They could very easily shut down the practice of arbitrage (and thus, improve the quality of users' experiences across the web), but they choose not to. Why? Because contextual ads like this are a huge source of revenue. Those millions of clicks purchased by ad middlemen drives up the cost of ads and the return earned by the ad providers. It's not an issue that we deal with in-house, but it is something that a lot of people in the SEO and web property space confront daily. I do wonder how the more \"legitimate\" advertisers feel about this practice, though, as they're the ones paying the premiums that make the arbitrageurs and the contextual networks rich. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Contextual Search Arbitrage - Pure Click Insanity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Contextual Search Arbitrage - Pure Click Insanity"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}