{
  "url": "https://moz.com/blog/content-is-king-baby",
  "slug": "content-is-king-baby",
  "title": "Content is King, Baby! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the most important things you can do to help create a successful web site is to build a site that provides a remarkable experience.  If we look past the popular phrase \"linkbait\" (a term I don't like because of its negative connotations) we need to answer the question: \"why would someone…",
  "content": "Content is King, Baby! Content Marketing By: Eric Enge April 16, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge April 16, 2008 Content is King, Baby! Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Intro from Rebecca: Eric Enge is a guest blogger for SEOmoz and has contributed posts on topics like link building and APIs. Today he'll discuss the benefits of providing quality content on your site. One of the most important things you can do to help create a successful web site is to build a site that provides a remarkable experience. If we look past the popular phrase \"linkbait\" (a term I don't like because of its negative connotations), we need to answer the question \"Why would someone link to our site?\" When I first talk to a client I usually explain that I don't recommend buying links. I also don't recommend a heavy dependency on link swapping. Some swapping with strategic partners or others in your industry is fine, but you don't want 100% of your link profile (or even 50%) to depend on that. So that leaves you with an interesting problem. You want people to give you something, and you are prepared to offer nothing in return. Sounds daunting, doesn't it? But it's not so bad after all. The web is a medium built around the concept of hyperlinking. People who have built really valuable resource sites (or pages) care a lot about the quality of their user's experience on their site. And, if your site offers great complimentary resources, they will want to link to it. Almost all that needs to happen is that they learn about it. Better still, these are the types of sites that have the best links to offer. The search engines are pretty good at figuring out which sites are genuinely authoritative, and value those links more than other links. If you want to reach tens of thousands, hundreds of thousands, or even millions of visitors per day, you need these types of links. Quality Content Writing 25 articles on topics that hundreds of other have covered before might be better than nothing, and you may get some links to it, but you are not going to drive big time links to that type of content. The bottom line is that you or your company need to become an expert on the topic of your site, and you need to put it out there in some unique fashion that has not been done before (or at least not many times before). There are many schemes used by people who try to avoid this burden. For example, the term linkbait arose from the notion of developing content for the sole purpose of getting links. My discomfort with the term arises because it was interpreted by many to mean that the content's relationship to the topic matter of the site did not really matter that much. Note: I am NOT saying that everyone means the term that way! But, for example, you could develop an article solely for the purpose of promoting it on Digg, even though you would never otherwise put it on your site. This may be a viable strategy in the short term, but it will not stand the test of time. Note: I am a huge fan of social media promotion, and we do a lot of it, but we work hard to create things with a strong tie to the business of the client we are working with. Once you have the expertise, the rest of the story is very straightforward. You do need to choose how and when you will show off that expertise, and how much of it to show. For many web based businesses, sharing a lot of rich information is the way to the best results. Note that there may be some businesses where you need to keep some secret sauce hidden (e.g., Coke would not publish their recipe for their product). I wrote about the types of opportunities in my post So Many Ways to Pursue Links and So Little Time. Pursuing these links requires you to be remarkable. Someone has to go through the effort of placing it on their site. More often than not, they will not do that for yesterday's old news. Presentation Counts In addition to developing unique expertise, you also need to present it in a compelling way, but be careful about doing do artificially. For example, you might be able to create a great video, but your audience may not want to watch a video. They may prefer to print an article and read it while they are riding on the train. You might be able to develop the world's neatest widget, but they may not want to put the content on their site. They may just want to read or view something. I am a big fan of videos and widgets, but they just don't fit every situation. Sometimes a simple article, dressed up with pictures, screen shots, and/or tables is the right thing to do. Regardless of medium, make those first few seconds count. In a text article, make sure you capture the reader's attention in the first few sentences. In an a video, get their attention in the first 10 to 15 seconds, and so forth. Your readers/viewers, and the potential linkers, will have a really short attention span for you if you don't truly get their attention in short order. I spend time on the entire presentation of a piece of content too, but I spend the most time on the first few sentences. Where to Put it? If you have not yet established your (or your company's) expertise in the world, I'd recommend that you actively push your great content our into the world at large. You need to build that reputation first. But, don't push it all out to other web sites. You need to have something at home too. It's a great idea to have a section of your site loaded with high quality content. That way, when someone sees your great article that you published elsewhere, and then comes to your site they end up seeing more of it. Now you have a chance of getting them hooked into your site (and business) directly. With sites that are just beginning to embark on web promotion, we often recommend that they develop 20 to 30 pieces of content to start with, and plan on putting half on their own site, and half on the site of others. Of course, with widgets, you can potentially syndicate your content to others, and have no potential issues with duplicate content - a big bonus if that approach can work for you. Over time, as your reputation gets more established, you can tweak the mix. Perhaps only 20% of your content gets published elsewhere, and 80% goes on your own site. Plan on adjusting the mix as your web reputation matures. Summary Content is a weapon on the web. Use it to help you win market share. Just make sure you have something that is truly noteworthy, and that it communicates that effectively. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content is King, Baby!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content is King, Baby!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}