{
  "url": "https://moz.com/blog/content-curation-in-45-minutes-a-day-and-free",
  "slug": "content-curation-in-45-minutes-a-day-and-free",
  "title": "Content Curation in 45 minutes a day... and FREE - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I’m sure a lot of you guys have looked into curation and all the lovely softwares available, like Curata and Curation Soft. Obviously with the radically different price points they all do different things, but here’s the gist – a whole lot of this you can do for free. And I have total faith that…",
  "content": "Content Curation in 45 minutes a day... and FREE Content Marketing A By: Amie Marse April 3, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Amie Marse April 3, 2012 Content Curation in 45 minutes a day... and FREE Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I’m sure a lot of you guys have looked into curation and all the lovely software available, like Curata and Curation Soft. Obviously with the radically different price points they all do different things, but here’s the gist – a whole lot of this you can do for free. And I have total faith that anyone within the Moz Community can handle this and then some. Heck, I’d even suggest some of you perfect this and sell it as a service to your clients. Step One – Define your Parameters Are you posting your content to a blog? Maybe a few niche sites? Or a few social feeds? Or all that and then some? Define your parameters by where you want the goods to go. Make sure everything is accessible from the beginning so you can leverage your curated content efficiently from the start. Step Two – Choose your Weapons Timely.is is awesome if you want to post to various Twitter feeds. And yes, for those of you that already use Timely.is you know the short code is awe.sm so yeah, I made a funny. I suggest that both G+ and FB get manual additions, but I will go into that more later. This is because of the juice attributed these links on their system and how funky they are to third party posting services. Other than timely.is (or you can use Sprout Social or any number of other goodies) I just prefer the many windows at a time method. Step Three – Be Intentional with your Schedule I can’t speak to your industry/niche but I can tell you that when I do my curation at somewhere between 6 and 8am EST I find a goldmine of posts that are brand-flipping-new. I just thank Caffeine for making my life so easy. Your industry could be totally different but it seems everything I read on the subject says that early EST is a great time to get posts. Step Four – Be Crazy Time Sensitive I make sure to only curate content that is timely. And I mean incredibly timely. For example, I *rarely* and I mean maybe less than 1% of the time curate something more than 24 hours old. And I do this really easily: I literally open up a google search and type in “content marketing” at the beginning of my day, and set it to the last 24 hours. More often than not I don’t get past page two or three before I am done for the day. Here’s why: Timely content means I see it first. Timely content leverages exposure – if I am the first to comment, I’ll get more clickthroughs on popular blogs then if I waited to be comment #35. Usually there are three or four lesser known blogs in the super-timely results. I love results like this because they are domains I would never notice otherwise. I try to leave a memorable comment and make a social connection. I know I get tickled when people pay attention to my blog so I try to cultivate relationships during this quick curation process. Step Five – Be Consistent This has less to do with your schedule and more to do with your content. I don’t tend to travel too far away from “content marketing” because that’s the bread and butter of my business. And it’s a big enough term that I see a lot of results. Depending on your niche you will want to narrow that down or possibly have two or three terms. As long as you are curating the same general stuff over and over it will work for you. Notice: Steps 1-5 are all about the setup or protocol. Steps 6-9 are the actual daily work. Step Six – Prepare for Battle Every morning at around 7am I do my curation. I try to finish up everything before I am officially “open for business” at 8am. So I know this can be done in 45 minutes. I open windows to the following places: Google search Timely.is WP dashboard to my curation site Google + Facebook Twitter I also have a Word document open. Step Seven – Get Rolling I search for the term “content marketing” in the last 24 hours as shown above. I grab five or six posts that are relevant and I make tweets about them and put them on timely. I then pop over to Google + and post one or two to my personal and business profile. I take my top post and put it on Facebook. I take the post I have the most to talk about/reply to and use that in my curation feed. I may or may not use more than one a day. I go to my twitter feed and find two or three posts from those I follow that I like. I grab those and distribute via Timely.is or my WP feed or whatever. Some days I have a lot to work with, others I don’t. If I find a good bit of awesome info to share I put it on my word doc and mess with it later in the day. Between reading, commenting and curating I am done in about 45 minutes. Notice – I never waste a blog. If I find something that I don’t think is good enough for my curation feed I will at least leave a comment or try to hook up with that person via social. If I find a totally worthless piece of crap I just ignore it but I rarely get more than 100 words in before I realize that. So no harm, no foul. Step Eight – Natural Overflow I find that doing twitter first thing after curation is great for me. If you have the time, I suggest you do this as well. 20-30 minutes after you have your automated posts in place to interact with your feed, clean out the spam tweeps, follow back the real people, etc. Double cherry bonus of course if you can refer to one of the pieces you just curated. This will make you super helpful and sound crazy on top of it. And who doesn’t love that? At the end of my twitter time I tend to go back to G+ and see what there is to do there. Again, this is less curation and more pure engagement. I’m not a huge facebook person so I might post one more of the curated pieces I already shared via another feed on FB before I quit social for the morning. Most days I will have another round of social in the afternoon, but same days I don’t. And I never do the “curation mode” more than once a day. Step Nine – Use what you Learn Another stellar way to use your curation is as the basis for your own blogs. This doesn’t mean regurgitation, but rather letting your new-found knowledge fuel your next post. Or, if you are like me, add to the list of blog ideas you have on a running list somewhere. The point is that setting aside this 45 minutes a day to get the most relevant pieces of content your industry has to offer can not only fill your feeds, but it can also fuel your entire day. And it should, because you should be talking about the latest things in your industry. I hope this helps, and wasn’t too long or confusing. If you have a daily routine for your curation I would love to hear about it! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Curation in 45 minutes a day... and FREE"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Curation in 45 minutes a day... and FREE"
    },
    {
      "level": "H2",
      "text": "Step One – Define your Parameters"
    },
    {
      "level": "H2",
      "text": "Step Two – Choose your Weapons"
    },
    {
      "level": "H2",
      "text": "Step Three – Be Intentional with your Schedule"
    },
    {
      "level": "H2",
      "text": "Step Four – Be Crazy Time Sensitive"
    },
    {
      "level": "H2",
      "text": "Step Five – Be Consistent"
    },
    {
      "level": "H2",
      "text": "Step Six – Prepare for Battle"
    },
    {
      "level": "H2",
      "text": "Step Seven – Get Rolling"
    },
    {
      "level": "H2",
      "text": "Step Eight – Natural Overflow"
    },
    {
      "level": "H2",
      "text": "Step Nine – Use what you Learn"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Amie Marse\n          \n            Amie Marse\n          \n            Amie Marse"
}