{
  "url": "https://moz.com/blog/content-comprehensiveness",
  "slug": "content-comprehensiveness",
  "title": "Content Comprehensiveness for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When Google says they prefer comprehensive, complete content, what does that really mean? In this week's episode of Whiteboard Friday, Kameron Jenkins explores actionable ways to translate the demands of the search engines into valuable, quality content that should help you rank.",
  "content": "Content Comprehensiveness Content Marketing | Whiteboard Friday By: Kameron Jenkins December 7, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins December 7, 2018 Content Comprehensiveness Content Marketing | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When Google says they prefer comprehensive, complete content, what does that really mean? In this week's episode of Whiteboard Friday, Kameron Jenkins explores actionable ways to translate the demands of the search engines into valuable, quality content that should help you rank. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, guys. Welcome to this week's edition of Whiteboard Friday. My name is Kameron Jenkins, and I work here at Moz. Today we're going to be talking about the quality of content comprehensiveness and what that means and why sometimes it can be confusing. I want to use an example scenario of a conversation that tends to go on between SEOs and Google. So here we go. An SEO usually says something like, \"Okay, Google, you say you want to rank high-quality content. But what does that really mean? What is high quality, because we need more specifics than that.\" Then Google goes, \"Okay, high quality is something that's comprehensive and complete. Yeah, it's really comprehensive.\" SEOs go, \"Well, wait. What does that even mean?\" That's kind of what this was born out of. Just kind of an explanation of what is comprehensive, what does Google mean when they say that, and how that differs depending on the query. Here we have an example page, and I'll kind of walk you through it. It's just going to serve to demonstrate why when Google says \"comprehensive,\" that can mean something different for an e-commerce page than it would for a history of soccer page. It's really going to differ depending on the query, because people want all sorts of different kinds of things. Their intent is going to be different depending on what they're searching in Google. So the criteria is going to be different for comprehensiveness. So hopefully, by way of example, we'll be able to kind of walk you through what comprehensiveness looks like for this one particular query. So let's just dive in. 1. Intent All right. So first I'm going to talk about intent. I have here a Complete Guide to Buying a House. This is the query I used as an example. Before we dive in, even before we look into keyword research tools or anything like that, I think it's really important to just like let the query sit with you for a little bit. So \"guide to buying a house,\" okay, I'm going to think about that and think about what the searcher probably wanted based on the query. So first of all, I noticed \"guide.\" The word \"guide\" to me makes it sound like someone wants something very complete, very thorough. They don't just want quick tips. They don't want a quick bullet list. This can be longer, because someone is searching for a comprehensive guide. \"To buying a house,\" that's a process. That's not like an add-to-cart like Amazon. It's a step-by-step. There are multiple phases to that type of process. It's really important to realize here that they're probably looking for something a little lengthier and something that is maybe a step-by-step process. And too, you just look at the query, \"guide to buying a house,\" people are probably searching that if they've never bought a house before. So if they've never bought a house before, it's just good to remember that your audience is in a phase where they have no idea what they're doing. It's important to understand your audience and understand that this is something that they're going to need very, very comprehensive, start-to-finish information on it. 2. Implications Two, implications. This is again also before we get into any keyword research tools. By implications, I mean what is going to be the effect on someone after reading this? So the implications here, a guide to buying a house, that is a big financial decision. That's a big financial purchase. It's going to affect people's finances and happiness and well-being, and Google actually has a name for that. In their Quality Rater Guidelines, they call that YMYL. So that stands for \"your money, your life.\" Those types of pages are held to a really high standard, and rightfully so. If someone reads this, they're going to get advice about how to spend their money. It's important for us, as SEOs and writers crafting these types of pages, to understand that these are going to be held to a really high standard. I think what that could look like on the page is, because they're making a big purchase like this, it might be a good sign of trustworthiness to maybe have some expert quotes in here. Maybe you kind of sprinkle those throughout your page. Maybe you actually have it written by an expert author instead of just Joe Schmoe blogger. Those are just some ideas for making a page really trustworthy, and I think that's a key to comprehensiveness. 3. Subtopics Number three here we have subtopics. There are two ways that I'll walk you through finding subtopics to fit within your umbrella topic. I'm going to use Moz Keyword Explorer as an example of this. Use Keyword Explorer to reveal subtopics In Moz Keyword Explorer, you can search for different keywords and related keywords two different ways. You can type in a query. So you can type in something like \"buy a house\" or \"home buying\" or something like that. You start with your main topic, and what you'll get as a result is a bunch of suggested keywords that you can also incorporate on your page, terms that are related to the term that you searched. This is going to be really great, because you're going to start to notice themes emerge. Some of the themes I noticed were people tend to search for \"home buying calculator,\" like a can-I-afford-it type of calculator. A lot of people search financial-related things obviously, bad credit. I filed for bankruptcy, can I still buy a house? You'll start to see subthemes emerge. Then I also wanted to mention that, in Moz Keyword Explorer, you can also search by URL. What I might do is query my term that I'm trying to target on my page. I'm going to pick the top three URLs that are ranking. You pop them into Keyword Explorer, and you can compare them and you can see the areas of most overlap. So what you'll get essentially is a list of keywords that the top ranking pages for that term also rank for. That's going to be a really good way to mine some extra keyword ideas for your page to make it more comprehensive. 4. Questions Then here we go. We have step four. After we've come up with some subtopics, I think it's also a really good idea to mine questions and try to find what questions our audience is actually asking. So, for these, I like to use Answer the Public and Keywords Everywhere. Those are two really great tools that I kind of like to use in tandem. Use Answer the Public to mine questions Answer the Public, if you've never used it, is a really fun tool. You can put in a keyword, and you get a huge list. Depending on how vague your query is, you might get a ton of ideas. If your query is really specific, you might not get as many keyword ideas back. But it's a really great way to type in a keyword, like \"buying a house\" or \"buy a house\" or \"home buying\" or something like that, and get a whole, big, long list of questions that your audience is asking. People that want to know how to buy a house, they're also asking these questions. I think a comprehensive page will answer those questions. But it can be a little bit overwhelming. There's going to be probably a lot of questions potentially to answer. So how do you prioritize and choose which questions are the best to address on your page? Use Keywords Everywhere to highlight keywords on a page That's where the Keywords Everywhere plug-in comes in handy. I use it in Chrome. You can have it highlight the keywords on the page. I think I have mine set to highlight anything that's searched 50 or more times a month. That's a really good way to gauge, just right off the bat you can see, okay, now there are these 10 instead of these 100 questions to potentially answer on my page. So examples of questions here, I have questions like: Can I afford this? Is now the right time to buy? So you can kind of fit those into your page and answer those questions. 5. Trends Then finally here I have trends. I think this is a really commonly missed step. It's important to remember that a lot of terms have seasonality attached to them. So what I did with this query, I queried \"buy a house,\" and I wanted to see if there were any trends for home buying-type of research queries in Google Trends. I zoomed out to five years to see if I could see year-over-year if there were any trends that emerged. That was totally the case. When people are searching \"buy a house,\" it's at its peak kind of around January into spring, and then in the summer it starts to dive, and then it's at its lowest during the holidays. That kind of shows you that people are researching at the beginning of the year. They're kind of probably moving into their house during the summertime, and then during the holidays they've had all the time to move in and now they're just enjoying the holidays. That's kind of the trend flow that it follows. That's really key information, if you're going to build a comprehensive page, to kind of understand that there's seasonality attached with your term. Because I know now that there's seasonality with my term, I can incorporate information like what are the pros and cons of buying in peak season versus off-season for buying a house. Maybe what's the best time of year to buy. Those are, again, other ideas for things that you can incorporate on your page to make it more comprehensive. This page is not comprehensive. I didn't have enough room to fit some things. So you don't just stop at this phase. If you're really building a comprehensive page on this topic, don't stop where I stopped. But this is kind of just an example of how to go about thinking through what Google means when they say make a page comprehensive. It's going to mean something different depending on your query and just keep that in mind. Just think about the query, think about what your audience wanted based on what they searched, and you'll be off to a great start building a comprehensive page. I hope that was helpful. If you have any ideas for building your own comprehensive page, how you do that, maybe how it differs in different industries that you've worked in, pop it in the comments. That would be really good for us to share that information. Come back again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Comprehensiveness"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Comprehensiveness"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Intent"
    },
    {
      "level": "H2",
      "text": "2. Implications"
    },
    {
      "level": "H2",
      "text": "3. Subtopics"
    },
    {
      "level": "H3",
      "text": "Use Keyword Explorer to reveal subtopics"
    },
    {
      "level": "H2",
      "text": "4. Questions"
    },
    {
      "level": "H3",
      "text": "Use Answer the Public to mine questions"
    },
    {
      "level": "H3",
      "text": "Use Keywords Everywhere to highlight keywords on a page"
    },
    {
      "level": "H2",
      "text": "5. Trends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}