{
  "url": "https://moz.com/blog/content-syndication-case-study",
  "slug": "content-syndication-case-study",
  "title": "How Stacker.com Earned 1M+ Organic Monthly Visits Through Content Syndication [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One benefit of content syndication that marketers frequently overlook is the potential to improve a site’s SEO performance. But it’s difficult to test and implement a comprehensive syndication strategy, so there aren’t many resources about its SEO impact. In this case study, Amanda outlines the…",
  "content": "How Stacker.com Earned 1M+ Organic Monthly Visits Through Content Syndication [Case Study] Content Marketing By: Amanda Milligan July 7, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Milligan July 7, 2022 How Stacker.com Earned 1M+ Organic Monthly Visits Through Content Syndication [Case Study] Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Note: Amanda Milligan collaborated with Stacker’s SEO specialist, Sam Kaye, to create this case study. When a marketer is asked about the value of content syndication, they’ll typically list two main benefits: Increased brand awareness, as you’re reaching a wider audience.Improved engagement, as people can share and comment across multiple versions of the story. But one benefit of content syndication that marketers frequently overlook is the potential to improve a site’s SEO performance. While paid syndication (like press release distribution) can’t carry SEO value, developing strong content that’s appealing to publishers and their readers can generate massive amounts of link authority back to a publishing domain, and drive significant organic growth. But it’s difficult to test and implement a comprehensive syndication strategy, so there aren’t many resources about its SEO impact. In this case study, we: Outline the processes used by Stacker to syndicate content.Look into organic results on Stacker.com as a result of content syndication efforts.Discuss how content syndication can be used as part of a long-term organic growth strategy. The content creation and distribution methods used for Stacker.com are the same as those used for Stacker Studio brand partners, making Stacker.com’s organic success an excellent case study for the long-term effectiveness for content syndication strategies. The evidence of syndication’s impact Before digging into how syndication works for SEO, let’s begin by proving that content syndication works. Stacker.com has no proactive digital PR or backlinking strategies. Our growth strategy has been utilizing content syndication as a model to reach new audiences and drive valuable domain authority. The result has been Stacker accumulating 20K “dofollowed” referring domains and over one million unique backlinks over the last four years. Organic traffic growth Organic traffic: Google Search Console Over a period of 16 months, Stacker.com saw a significant acceleration in organic growth, increasing by approximately 500% — from fewer than 10K organic entries per day to more than 50K entries per day. (Our site used to be TheStacker.com, and you can see the exponential growth on that domain as well before migrating to Stacker.com.) Backlinks Backlinks: Google Search Console Backlinks that appear on pages including rel=canonical tags are processed and valued by search engines, as evidenced by the 8M+ links created by this method & identified in Search Console. The majority of these links are in-text dofollows from syndicated article pickups with rel=canonical tags. This is an excellent indicator that Google is crawling and valuing these links. Backlinks: Moz Pro (domain-wide) Backlinks created via content syndication are also being picked up by Moz Pro and other third-party reporting tools. Moz Pro reports a steady growth in the number of referring domains that correlates well with GSC link reporting metrics: Moz: individual links In addition to tracking account-wide backlinking growth, Moz also picks up individual instances of links created via content syndication, such as these syndicated SFGate pickups. Domain Authority: Moz Pro This accumulation of link authority over time has allowed Stacker to increase our Moz Pro Domain Authority score from 56 to 59 over the past year: Organic performance: Summary In 2021 alone, Stacker.com saw a 500% increase in referring domains, a 380% increase in organic traffic, and an improvement in domain authority from 56 to 59 due in large part to our content syndication efforts. These long-term trends of organic growth, paired with the fact that syndicated links are being picked up by both Google Search Console and Moz Pro, are a clear indication that content syndication is an effective way to drive organic traffic. How content syndication improves SEO authority Stacker’s syndication approach provides link authority in two ways: in-text dofollow backlinks and rel=canonical tags. An in-text backlink acts as a signal of source attribution, telling search engines that a particular piece of data or content has been taken from another source. A canonical tag does the same thing, except that it attributes the entire article, not just a piece of it, back to the original publisher. Both are signals of source attribution, and both indicate that a publisher trusts your content enough to feature and share the article on their website. When a piece of Stacker content is syndicated (re-published in its original form on another publisher’s site), the syndicated version includes a rel=canonical tag back to the publishers’ hosted version, as well as an in-text dofollow backlink in the content intro: Example rel=canonical tag from a syndicated piece Example of an in-text, dofollow backlink attributing authorship in a syndicated piece When a Stacker article is rewritten instead of syndicated, (e.g., a publisher creates a locally-focused variant using Stacker source data), we request a backlink citing us as the original provider of the study. Owned syndication vs. earned syndication In the same way the industry talks about owned and earned media, you can think of two types of syndication as “owned syndication” and “earned syndication.” Owned syndication involves reposting an article on multiple platforms by you. An example of this would be publishing an article on your blog and then republishing it on Medium, LinkedIn, and other accounts you run. While this might increase the number of people that see your article, the likelihood of driving organic traffic from these strategies reliably or at scale is virtually nil. Earned syndication involves the approval from another publisher that your content is valuable to their audience, so this type of syndication is harder to achieve. However, in addition to reaching a wider audience than with owned syndication, you get the authority signal of having your content hosted on another publisher’s domain. (Someone decided your content was worth republishing in full, and what’s a greater sign of trust than that?) Why isn’t everyone doing this? Because it’s not easy. For the first few years of our existence, Stacker did nothing but build publisher relationships and master the art of newsworthy content. Getting content pickups at scale requires building trust with large news publishers, as well as a large volume of content news publishers find uniquely interesting and relevant. Content syndication is built upon a foundation of content quality, publisher trust, and the technical capability to share content at scale, and these three components can take years to develop. Stacker journalists are committed to understanding the coverage needs of local news organizations and investing in stories that can drive meaningful value for their audiences. After five years of working with publishing partners, we’ve studied the data on pickups and audience reach to uncover insights into what stories can be most useful. We landed on some key earned syndication tenets: Contextualization is key Any type of publisher you come across will have their core editorial calendar established with key topics they know their audience cares about. They’re not looking for outsiders to contribute to the heart of their publication, so don’t approach it that way. Instead, explore topics they typically cover and perhaps even particular stories they’ve run and ask yourself: What other perspective can I add to this story to contextualize it? Perhaps a historical angle or other comparison Data always helps Some publishers don’t have access to data analysts, or if they do, they’re working on a ton of other projects and it’s hard to scale data-focused content. If you’re able to provide stories based on data that’s been distilled and presented with clear insights, many publishers would appreciate that. Additionally, just knowing your content is backed by data rather than opinion makes it easier to vet (and trust). Help publishers reach their goals Our direct line of communication with multiple publishers, both local and national, has led to fascinating conversations around their goals. To sum it up, every publisher has unique focus areas when it comes to audience acquisition and engagement. Some are focused on converting users to subscription while others are focused on pageviews or time on site. Explore their site, see how they monetize, and consider how your content can help them meet these goals. Let’s look at an example story Stacker created. This piece uses Major League Baseball data to determine the most successful postseason teams. With data being the basis for the ranking, publishers don’t have to worry about the validity of the order, which is a major advantage in vetting. This story offers original analysis in a way that can complement the local coverage of news organizations. While a sports beat writer might focus on the area team’s history, current team performance, or other local and newsy aspects of the story—this story offers contextual data analysis that can work for a variety of news organizations to augment their boots-on-the-ground reporting. All in all, the article earned more than 300 publisher pickups and more than 100,000 story impressions. That’s an incredible amount of payoff for one piece of content, and earned syndication is the vehicle that made it possible. The syndication takeaway Like so many other SEO tactics, not all syndication is created equal. Potential clients have often asked me how Stacker is different from services like press release distribution platforms, with which they didn’t see SEO results. Well, when you have sponsored or nofollow links, it’s never going to be the same as earned syndication. Getting white hat content pickups with consistency is difficult — it requires both top-tier content and the attention of journalists. So my advice? Consider whether there are high-authority publications in your niche. Study what they publish and ask yourself: Do you already publish content that they’d love? Can you make some tweaks to already existing content to better fit their editorial style?Can you create original research/reports that would interest their audience?Would getting brand awareness with their audience help us improve your brand reach? If the answer is yes to at least two of these questions, consider content syndication as a strategy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Stacker.com Earned 1M+ Organic Monthly Visits Through Content Syndication [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Stacker.com Earned 1M+ Organic Monthly Visits Through Content Syndication [Case Study]"
    },
    {
      "level": "H2",
      "text": "The evidence of syndication’s impact"
    },
    {
      "level": "H3",
      "text": "Organic traffic growth"
    },
    {
      "level": "H4",
      "text": "Organic traffic: Google Search Console"
    },
    {
      "level": "H3",
      "text": "Backlinks"
    },
    {
      "level": "H4",
      "text": "Backlinks: Google Search Console"
    },
    {
      "level": "H4",
      "text": "Backlinks: Moz Pro (domain-wide)"
    },
    {
      "level": "H4",
      "text": "Moz: individual links"
    },
    {
      "level": "H3",
      "text": "Domain Authority: Moz Pro"
    },
    {
      "level": "H3",
      "text": "Organic performance: Summary"
    },
    {
      "level": "H2",
      "text": "How content syndication improves SEO authority"
    },
    {
      "level": "H2",
      "text": "Owned syndication vs. earned syndication"
    },
    {
      "level": "H2",
      "text": "Why isn’t everyone doing this?"
    },
    {
      "level": "H3",
      "text": "Contextualization is key"
    },
    {
      "level": "H3",
      "text": "Data always helps"
    },
    {
      "level": "H3",
      "text": "Help publishers reach their goals"
    },
    {
      "level": "H2",
      "text": "The syndication takeaway"
    },
    {
      "level": "H2",
      "text": "Hear more from Amanda and our other amazing speakers in the MozCon 2022 video bundle!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Amanda Milligan\n          \n            Amanda Milligan"
}