{
  "url": "https://moz.com/blog/content-is-not-the-only-way-whiteboard-friday",
  "slug": "content-is-not-the-only-way-whiteboard-friday",
  "title": "No, Content is Not the Only Way - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Although content marketing is a powerful strategy, it's not the only way to win at inbound marketing. In this week's Whiteboard Friday, Rand shares some tips for staying competitive without needing to invest in content.",
  "content": "No, Content is Not the Only Way Whiteboard Friday By: Rand Fishkin November 9, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 9, 2012 No, Content is Not the Only Way Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few weeks ago, Rand spoke on the death of Link Building. While the idea of content marketing is a powerful idea, it's not the only way to win at inbound marketing. Rand spoke briefly at Distilled's SearchLove conference on content marketing and ways to earn your customers. In this week's Whiteboard Friday, he elaborates on his talk with some tips for staying competitive without needing to invest in content. Video Transcription \"Howdy, SEOmoz fans, and welcome to our first ever beardless version of Whiteboard Friday. I know it feels like I'm naked. I'm very embarrassed here. I shaved it off for a Halloween costume and also as part of Movember where we will be growing some moustaches in the SEOmoz offices. So I hope you don't mind my plain face, but that being said, I do want to address something that we talked about a few weeks back in Whiteboard Friday. So we did a Whiteboard Friday about the future of link building and how link earning was going to replace link building. I think that was actually a very important concept, something I definitely believe in. But one of the things that I saw, especially heavily in the comments, in the tweets, in the email replies to me was this idea from SEO folks and from folks who practice web marketing of all kinds that this seems almost a little unfair that the only way to do SEO in the modern era is to be a great content marketer, that I have to create great content, put it in front of people who will link to it and share it, and that's my only path for SEO? No, that's not the only path. It's a very powerful path, a very popular path. I expect to see a ton of it, and it's going to be hard to compete against the folks who are good at it. But it's not the only path. So I've got my Luke Skywalker up here. I want to be good at web marketing, but I don't want to invest in content. Then I hope you don't mind I drew a little orange Yoda. I probably should have done it in green, but other ways there are. That was a terrible Yoda. That's all right. We'll get over it. We'll get through this Whiteboard Friday together. So let's talk about what some of these are, and there's not a ton of different paths, but there are a few. So number one: Relationships, reputation, and word of mouth. There is Washington Partners here is Seattle, commercial real estate brokers. They are used by almost all the startups, including SEOmoz. Their web presence is not great. They don't create a lot of content. In fact, they create almost no content. They don't have blogs. They don't really have Twitter accounts. They're not investing in social media marketing. They're not doing any of the things that you might classically associate with being great at SEO. But they are ranking well, and they get almost everyone's business because they have great word of mouth. Whenever I talk about Clay Nielsen, who is one of the guys there, I rave about him. I've got a recommendation for him on my website. Whenever I talk to startups who are looking for space, I always mention those guys. They are number one and they are great. They'll take us around and drive us places, and they'll show us stuff. Whatever we want, whatever we like, they'll invest the time and energy. They'll give us the straight dope on places. They'll say, \"Well, this is a good spot, but the landlord is not great here. We have worked with them before on other properties.\" Because of that they develop a fantastic reputation, fantastic word of mouth and tons of links. If you look at their backlink profile, it is all people recommending them authentically. It's not because of content. It's because they do great work and they have great word of mouth. Number two: Phenomenal advertising. You can see this from a lot of the big sort of offline brands who do great advertising online and offline, and because of that they earn a lot of awareness and attention. Think of a big insurance company, think of big sports brands or consumer brands, even electronic brands. They're not necessarily investing very heavily in content. Some of them are, some of them aren't. But what they've turned into their content is their advertising, and that includes things like banners, it includes video, it includes classic things like billboards. The ones who are creative and inventive with those ads, the ones who get awareness and attention, the ones who have a million people who watch their advertising video on YouTube, those are the ones who are winning quite well, and they earn things like links and attention, awareness and traffic. Because they can monetize it at a good rate, they're able to have success on the web without necessarily needing to invest in content and SEO kinds of things. Number three: Inherently viral products and services. Let me give you my favorite example of this is SurveyMonkey, because SurveyMonkey, the first time that you use it is almost always because someone sent you a survey link. They sent you a link to a survey, and it says, \"Powered by SurveyMonkey. Want to create your own survey?\" Now they happen to rank very well because they've been around a long time, but they don't do a lot of content marketing. They don't invest in a ton of SEO kinds of things. They have an inherently viral product. Anyone who has been surveyed is likely to say, \"Oh, yeah, maybe I want to run a survey. I'll go back to SurveyMonkey.\" Think about the growth of things like a Pinterest or an Etsy or anything that's got a platform where repeated use and sharing is part of the platform. Those inherently viral products and services tend to do very well without having to invest in content themselves. Number four: Community building and engagement. I see multiple brands doing this quite well. They essentially don't produce a ton of content on their own site, but they do one of two things. They either invest in their community on and off their own site. So meaning through social, through Facebook and Twitter, through LinkedIn, through Quora, through forums, through blogs, they participate heavily in those other places, Hacker News all these kinds of places, and/or they actually have an engagement platform on their own site, a community of their own, where they are not really creating the content. They're just a user generated content platform. So a great example of this might be a Stack Exchange. Stack Exchange, they don't create a lot of stuff themselves. It's all created by their users, and then they occasionally participate. The moderators, the creators will participate in those communities. Because of this they build up a lot of content that's not self-created, and they get a lot of engagement from their community, which means they're getting lots of links, they rank very well all these kinds of things. GitHub is another great example of a platform where these things happen. If you're thinking that, hey maybe content is not the path that I can take, or it's the only path that Google has left available, not necessarily. I want you to ask, What are your strengths? What are your strengths from a marketing perspective, from a product perspective from a services perspective? What are you and your business uniquely good at? What do you love to do? Do you love writing blogs? Do you love participating on Twitter? Do you love commenting of forums? No? Choose another path. Do you love getting together with people in person and giving them a great customer service experience? That's a perfectly legitimate way to go. What are you able and allowed to do? For many folks there are restrictions and requirements around certain industries, or there are restrictions and requirements created by their management, their boss, their team. So you need to account for those and then ask, \"What are my competitors failing to execute on? Where are they not investing?\" It could be very well be, that in the world of SEO, in the world of content marketing, there are a lot of people saturating the space in content, but not in these other areas. Maybe those are places where you can invest and you can win, and it might not necessarily be through the classic, \"I've got good links with good anchor text pointing to my pages and so I rank number one.\" It could be in many other ways. Remember that the picture of marketing on the web is not just search and it's not just social and it's not just content. It's all of these things, and a lot of these can input and provide great, great return on investment if you're willing to invest in them. All right, everyone. I hope you've enjoyed this edition of Whiteboard Friday, and we will see you again next week. Take care.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "No, Content is Not the Only Way"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "No, Content is Not the Only Way"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}