{
  "url": "https://moz.com/blog/content-influencers-who-can-help-amplify-it-whiteboard-friday",
  "slug": "content-influencers-who-can-help-amplify-it-whiteboard-friday",
  "title": "How to Get Content into the Hands of Influencers Who Can Help Amplify It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Influencers in your industry can serve as megaphones for your content, but you have to earn their attention and appreciation first. In today's Whiteboard Friday, Rand shows you how.",
  "content": "How to Get Content into the Hands of Influencers Who Can Help Amplify It Whiteboard Friday | Public Relations By: Rand Fishkin August 28, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 28, 2015 How to Get Content into the Hands of Influencers Who Can Help Amplify It Whiteboard Friday | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Step 1: Create 10x content. Step 2: ??? Step 3: Massive flood of traffic.There's a bigger gap in step 2 than many marketers anticipate, and one of the best ways to fill it is getting your content in front of influential people who can help spread the word. You'll have to make it worth their while, though, and in today's Whiteboard Friday, Rand explains how to go about that. Click on the whiteboard image above to open a high resolution version in a new tab! Video transcriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about a problem that many of you have mentioned in comments, in tweets, in questions, and emails to me and to other folks here at Moz when we talk about content marketing and specifically content amplification like, \"Okay, I made some great content. But how do I actually get people to share it? In particular, how do I get content into the hands of the influencers who might amplify it?\" Look, this is very frustrating, right? If you're a small brand, a small site, have a small social account, content amplification often feels like this. You're like, \"I just made the most amazing thing ever.\" It sucks, and I get that pain. I totally get that pain. We have all been there. Moz has the wonderful privilege and opportunity of having this great content amplification channel. But when I started out, when I was making the blog in 2004/2005, nobody was listening. It was a very frustrating experience, and it took years before that content amplification lifecycle became to the point where I remember one year, I think it was 2008, and Greg Boser, who is legendary in the SEO world, was on a panel at a search engine conference. He's there and he says, \"Well, Rand just cheats. All he has to do is hit Publish.\" I was like, \"Oh yeah, all I have to do now is hit Publish.\" But it takes a long time to build that. Those folks who already have a following, a following on their blog, on their social account, on an email list, on a news site, whatever it is, have this outsized ability to spark virality, to help something that might be incredible, that you've made, become seen by a wide audience who will actually appreciate it. But it can be a frustrating process. Here's Ann Handley's account. Ann Handley, one of the best, most followed folks in the online marketing world, @MarketingProfs is her handle, and she tweets stuff all the time that gets a lot of retweets, a lot of engagement, and folks are thinking like, \"How do I reach her? I have something amazing that I want the marketing world to see. How could I get Ann to share my content?\" I have a few tactics for you that I hope will work.First off, this is going to sound tough, but... it is tough. 1) The simple nudgeThis is the thing that I think you should probably be using 80% or more of your time. The simple nudge is just like what it sounds like. \"Hi, Ann. I'm a big fan. I'm a long-time follower. We made this thing we think you're going to love. Let us know if you have any suggestions. We're going to be updating it for the next few weeks. Thanks, Rand.\" That could be through email. It could be a LinkedIn message. It could even be a Facebook message. It could be a tweet. That's a little bit long for a tweet, maybe a long series of VMs. But the thing that is going on here is the content and relevance have to be outstanding. It has to be something that is remarkable just as soon as you share it, as soon as you give the title of it, Ann's like, \"Oh wait, I have not seen one of those. I am super interested in that.\" How are you going to find something that you can nudge that influencer with, where they will think, \"That's so remarkable that even though I have never heard the name of this person before, I'm going to check it out and then I'm going to share it\"? That's hard to do. It's a very, very high bar. But that's the same high bar that you have for creating what I have been calling 10X content, the kind of content that people will actually amplify and share. I talk about this a lot. But I always urge folks to ask the question, \"Who will help amplify this and why?\" If you have a great answer to that question, the nudge should be all you need 80% of the time. Now, I do have two tools that I'm going to recommend. They are both used for email outreach, specifically finding folks' emails or getting connected to folks through email. Voila Norbert is a great tool for finding email that I have talked about on Whiteboard Friday before, and Conspire is a wonderful tool that will show you all of the people, who you have emailed, who have emailed that person. So if I hadn't emailed Ann directly, I could look in Conspire and I could see, \"Oh look, Cyrus Shepard has emailed Ann previously. Great, let me reach out to Cyrus, ask him for an introduction. He'll connect me up.\" So some good tools that can be helpful there. I'm reticent to promote it, but Followerwonk is also very useful for this discovery process, figuring out who those influencers are in the first place. 2) The inclusion mentionThis tactic can work, and it's a nice, subtle way to get folks involved, especially if you're not too frustrated when it doesn't work out. For example, let's say Ann had tweeted something around CRM software. Well, she did send a tweet around CRM software that I copied in there, but maybe she has expressed some frustration around CRM software. She is like, \"I don't know which vendors to choose. I wish there was a great resource.\" I can say, \"@MarketingProfs, your tweet about CRM frustration inspired us to make this.\" Cool. Now I'm sharing with her something that she has directly expressed an interest in, and I'm including her in there, again through Twitter. I could reach out through email. I could do it through LinkedIn. It could be through a lot of things. I think any time you have content that's inspired by or particularly inclusive of a person, brand, or a place, let them know. There's no harm in letting them know. It could be that this is ignored 9 times out of 10, but 1 time out of 10 you're going to get that extra amplification and that's a wonderful thing. I have found, by the way, that many times when it comes to a longer form content responding to a blog post, responding to a tweet, responding to something that's been shared, that professional, respectful, well thought out pieces that advance the conversation can work well even if we disagree about things. So if Ann's expressed something and I go, \"Hmm, I disagree with that. Let me explain why and the thinking behind it.\" But I'm going to be very professional, very respectful. I'm going to advance the conversation, like bring things forward, include non-obvious stuff that is helpful that makes this a better dialogue. I can write up that piece, and then I can share it with her. This can be especially effective if you share it with the person before you hit Publish. Again, a good reason for pre-content amplification outreach. 3) The reviewWell, the review is a tough one. I don't love it all the time. I especially don't love it when it's been done to death, which it has very often. But this is something like, \"We reviewed the latest guide from @MarketingProfs here.\" So we go check out MarketingProfs, and we download one of their guides. We really like it. We write up a review. This works when it's positive and when that positivity is clearly authentic and not just designed to get amplification. One of the things that happens that I see all the time, especially in the web marketing, but even in the technology world and a lot in the travel world is folks doing things like this with no intention other than hopefully getting a link or a retweet. They clearly have not put any authentic thought into it. It's not a quality piece. It's just designed to get that link. It's very transparent to the vast majority of influencers who get targeted with this stuff all the time. So if it's been done to death, probably don't bother. But the review system can work for other kinds of things, and if it's positive and authentic, and that's not why you did it, great. 4) The network effect It's frustrating because it's not always as effective. However, it can still be a small win even when you don't get the big win. So the idea would be I go and I check out, maybe potentially use Followerwonk. Or Little Bird is another one. It's paid and expensive, but very, very good. These four accounts tend to share things that major influencers later pick up. Hmm, interesting. So at such-and-such and at so-and-so, like these folks tend to be often much easier to target and to reach out to, much higher response rate, much more likely to reply to you and engage with you, and even if those major targets never come through, so even if these folks are targeted, they're followed by these seven influencers that we really are going after. Well, you know what, even if they share and none of the seven influencers do, that's okay. It's still a win. So I hope that with these in your pocket you can go and do a little more successful content outreach and content amplification. If you have some tactics that you would like to share that have worked well for you, I would love to hear about them in the comments. I'm sure everyone else would as well, and you'll get lots of thumbs up. So I look forward to that and to seeing you again next week for another edition of Whiteboard Friday. Take care. \u0003Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get Content into the Hands of Influencers Who Can Help Amplify It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get Content into the Hands of Influencers Who Can Help Amplify It"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "I have a few tactics for you that I hope will work."
    },
    {
      "level": "H3",
      "text": "1) The simple nudge"
    },
    {
      "level": "H3",
      "text": "2) The inclusion mention"
    },
    {
      "level": "H3",
      "text": "3) The review"
    },
    {
      "level": "H3",
      "text": "4) The network effect"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}