{
  "url": "https://moz.com/blog/content-marketing-think-campaigns-not-just-links-your-guide-to-tofu",
  "slug": "content-marketing-think-campaigns-not-just-links-your-guide-to-tofu",
  "title": "Content Marketing - Think Campaigns Not Just Links, Your Guide to TOFU - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content Marketing is so much more than getting links. It's the glue that holds your funnel together. It's the reason a prospect visits your site, it's the reason they choose to move further down the purchase path, buy a product and return to your site time and again. Real content marketing is…",
  "content": "Content Marketing - Think Campaigns Not Just Links, Your Guide to TOFU Content Marketing By: Kieran Flanagan September 18, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kieran Flanagan September 18, 2012 Content Marketing - Think Campaigns Not Just Links, Your Guide to TOFU Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content Marketing is without doubt the most popular member of buzzword bingo at the moment. With updates like Panda and Penguin (easily track all this with SEOMoz's Algorithm Tracker) and the devaluation of low quality links, the role of content in SEO has never been greater. Many of the large SEO agencies are doubling down on their efforts to sell themselves as content strategists, not just SEO consultants, and where the big agencies go, usually everyone else follows. With the next Google Penguin update (dependent on when this post is published, it may have already been released) touted to be \"jarring and jolting\" for a lot of webmasters, we can expect content marketing's shine to get even greater. Changing from \"build\" to \"attract\" From an SEO viewpoint, the interest in great content is to attract links, where as a lot of what Google is looking to eliminate are examples of where content is used to build links: articles, spun articles spammed across thousands of directories, blog posts spun across networks, networks that dragged in content form places like Youtube, Yahoo Answers and article directories to create mashup posts, blog comments, spun blog comments using scrapebox so you can hit thousands of sites at a time, web2.0 link wheels made from spun content, reclaiming tumblr blogs with PR and adding posts with links to your site, buying up dropped domains and using archive.org to re-add the previous content so you can link to your site, finding squidoo len's to comment on, the list could go on and on and on. It's a lot easier to build links with subpar content, as you don't expect anyone to read it. What's being sold as \"Content Marketing\" - is truly great content that people want to share and link to = hey presto ... you're #Number1inGoogleB*tches. The problem with a lot of SEO's evolution into \"Content Marketing\" is they are really just thinking about links/shares - it's a blackbox approach, with content going in and links and social shares coming out: There is more to Content than Links The reality is true content marketing isn't just about links and shares. In the words of copyblogger: \"Content Marketing means creating and sharing valuable free content to attract and convert prospects into customers, and customers into repeat buyers. The type of content you share is closely related to what you sell; in other words, you’re educating people so that they know, like, and trust you enough to do business with you.” CopyBlogger Content Marketing is so much more than getting links. It's the glue that holds your funnel together. It's the reason a prospect visits your site, it's the reason they choose to move further down the purchase path, buy a product and return to your site time and again. Real content marketing is complex; it's not just building a great infographic and notifying some bloggers about it. If you are purchasing a \"Content Marketing\" strategy from an SEO agency where the sole objective is to acquire links - you are going to waste money in the long run. Sure links can be a metric, but real content marketing is expensive, as a link building strategy - it's very difficult to make a decent return on. If you are investing in content marketing, why not put together campaigns that drive goals across your funnel and have links and shares as a metric, but not the sole objective. Let's start with TOFU (Top of Funnel) content marketing campaigns .... Top of Funnel - Joining the Dots Your approach to content marketing will differ slightly dependent on where the campaign resides within the funnel. For example, the following is a snapshot of what may be involved in a TOFU (Top of Funnel) campaign. # Objective Anything successful in life starts with a clear and concise objective/goal. For example, a goal could be structured as: Core Objective: Our content campaign is aimed at people who love to camp and are looking for the latest pair of hiking boots from brand X. We want to attract X amount of new visits, rank for keyword “X” on first page of Google, attract 15 links from PR2+ sites and drive X% of these new visits into our product page (which converts at X%) - of course that X% can be improved upon by MOFU (Mid of Funnel Campaigns) via A/B Testing etc Secondary Goal: We want X amount of these new visits to turn into Facebook Fans and X to turn into new Twitter Followers The more specific you can be about the goal of your content campaign the better. When asked to explain what you are doing to a VP of marketing, having a well-structured campaign mapped against core business goals will get you a far bigger budget than \"I'm trying to get links\". Your Twitter Highlight: Your Content Marketing Strategy Should be aligned to Business Goals I have purposely left out revenue in the above goal as I am splitting campaigns into Top of Funnel and Mid of Funnel to show the importance of content throughout the purchase path. If you're running a content campaign across the funnel - you should have revenue as a metric. You will need to quantify your own metrics to establish the ROI on your campaign e.g. how do you value Cost Per Link. 1. Persona Development Persona development is a crucial part of any successful content marketing strategy. There are a number of ways to develop personas: Using your Analytics Social listening (this is hard, I’ve done it) Interviews with prospects Interviews with customers Interviews with people you want to become customers Customer surveys (if you have a big enough Email DB) Google consumer surveys (http://www.google.com/insights/consumersurveys/home) Even running an internal workshop with different teams provides great insights. You would be amazed how much valuable information is stored within the customer support team, example of a previous one I ran with the help of iqcontent.com Something that’s really important to keep in mind is your content campaign may touch multiple personas. For example, in the objectives mapped out above, the persona we are targeting for new visits isn’t necessary the same persona who is going to link to you. Unlike online marketing, where most people have blogs, it’s highly likely in other industries the people who you can get links from and potential customers are not the same person. Your Twitter Highlight: If Links are your core goal; you need to target the personas who actually have the power to link to you. 2. Strategy Once you have personas in place, you can build out your content campaign framework. This should be broken into what I call The VP Strategy and The Actual Strategy. But What's my VP Strategy? This is for that moment in a meeting when you are asked, \"Hey what are you spending my 100k on?\" They don’t need your life story, just an overview that makes sense. We are building an interactive map of the globe where users can click around and learn about the best camping destinations in the world + what camp gear they should bring for each hike. We are doing 10 posts on our own blog to promote it. We are doing an outreach program with 20 experts on outdoor pursuits; these experts helped us develop the content for the map. We are doing PR with 10 online camping magazines about our Facebook competition where you can win a holiday to one of the destinations on the map. The clues to this are being given away on our Twitter feed; you have to follow to get them, as they are time sensitive We are also running paid campaign via remarketing, content network and third-party placements to support our initial launch The above may not be great, but you get the point :) The Actual Strategy is your project plan. I usually start everything with a flow diagram (creately is awesome for this) – I am a visual thinker so this helps a lot - how you plan content could be totally different. But you need to plan .... : Your Twitter Highlight: Divide your content campaign into a VP Strategy and Actual Strategy 3. Resources Most content campaigns will fail because they have no clear objective and they haven’t considered what resources they require (often not having the correct resources to implement the campaign). You need to define: How much will this cost in total? This includes any piece of activity related to the campaign, regardless if its coming from your budget or some other department’s e.g. if you are feeding Facebook/Twitter with great content – maybe you have a social media budget that you can steal take from :) What internal resources do you have? What external resources will you be using? For our campaign we probably need: Project coordinator Content strategist Outreach consultant (to get bloggers onboard) Developer (for interactive map) External agency for design PR manager (for pitching of the competition) Resources should be part of your project plan doc. Your Twitter Highlight: Your Content Marketing will #fail if you don't have the right resources 4. Content Types What content types will you be using in your campaign: Blog posts Guest posts PR pitches Video etc Your Twitter Highlight: Map out every asset your content campaign will include over the whole lifecycle of the project 5. Mediums What mediums are going to be used to promote your content? For our example we are going to use: Google (organic): Once our piece lifts off, we expect to acquire traffic for informational key phrases around “camping destinations”. Yes, not all these are going to purchase our product. But some may share it, like our Facebook page, follow us on Twitter, join our email list or help us amplify the content. Think both macro and micro conversions. Facebook: Let’s assume we already have an audience on Facebook we can promote it to. We can also use this as a way to acquire new fans via paid ads – but how effective it is to pay for fans is open for debate. Twitter to promote time sensitive clues for our competition Email Marketing: Yes, building an email database should still be part of your marketing strategy. Guess what Email Marketing is NOT DEAD. Leveraging it for content campaigns is a great reason why. Just make sure you are doing it right. Remarketing: We are going to build a list of anyone who has visited our product pages on camping gear. Instead of advertising another product to them – we are going to take them back up the funnel a little and show them this great interactive map. Maybe they won't buy, but the might help amplify our message. Display: We are going to run a small display campaign across a select number of outdoors activity sites advertising the interactive map. Google content network campaigns advertising free content tend to perform quite well. Guest posts: Once live we are going to ping the experts who helped us put the map together. There is no requirement for them to post, but we hope they will :). Dependent on your brand, this step is really easy or really hard. The great thing about content marketing is, the better you get, the easier this step becomes. Your Twitter Highlight: Even the most remarkable Content will #fail without a solid promotion plan 6. Metrics Doing content for \"Brand Awareness\" or \"Thought Leadership\" is easy, as most companies do not put anything measurable against these goals. Putting metrics against what you are doing and reporting to senior execs is a lot more difficult. You will get asked what did I get in return for my spend? Having an answer to this will put on you a par with every other exec (mostly in Sales), who can easily answer that question. a. Goals Defining goals for content marketing campaigns is not easy, just as defining goals for whitehat link building campaigns is near impossible (unless you are just doing guest posting). How do you put a number against how many links a piece of content will deliver naturally? But it's critical you have specific goals for any campaign you put live. These will be defined in your objectives: X Number of Visits Improved Keyword Rank (To First Page) Attracted X Number of Links X Number of Visits into Product Page Increase X Number of Facebook Fans Increase X Number of Twitter Followers Most TOFU (Top of Funnel) campaigns core goal is not Sales(B2C)/Qualified Leads(B2B), but thinking in terms of Macro and Micro conversions will help put dollar/euro values against each goal. For example, you can get the number of sales generated by your product page (either when it's the landing page or when it's some part of the journey), using this you can put a dollar/euro metric against each visit generated to that product page as part of this campaign. It's then up to your MOFU campaign to split test the hell out of the page and turn these into sales. b. ROI ROI isn't going to be a straightforward calculation. How valuable is each new visit? (Google Analytics Mutli Funnels help a lot). How valuable is your improved visibility on Google? How valuable are visits to your product page? How valuable are your Facebook Fans/Twitter followers? In most cases, it might not be possible to answer all these questions, but if you want executive buy in for large content campaigns - have some type of ROI forecast you can give them. c. Links/Shares Yes, links and shares are good metrics to have. Trying to put a monetary value against these are a lot more difficult. You are better of measuring what links and shares should bring e.g. new visits from both google and social media. Your Twitter Highlight: Content Marketing Campaign without metrics is like p*ssing in the dark. Spraying everywhere and just maybe hitting the target So you are now thinking Top of Funnel Content Marketing Campaigns !! and well on the way to being a ...... #TOFUContentMarketingNinja But what about the Mid of Funnel (MOFU) Campaigns ... that's going to need a whole other post !! Hope you can hold on for part two !! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing - Think Campaigns Not Just Links, Your Guide to TOFU"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Marketing - Think Campaigns Not Just Links, Your Guide to TOFU"
    },
    {
      "level": "H2",
      "text": "Changing from \"build\" to \"attract\""
    },
    {
      "level": "H2",
      "text": "There is more to Content than Links"
    },
    {
      "level": "H2",
      "text": "Top of Funnel - Joining the Dots"
    },
    {
      "level": "H3",
      "text": "# Objective"
    },
    {
      "level": "H2",
      "text": "#TOFUContentMarketingNinja"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kieran Flanagan\n          \n            Kieran Flanagan\n          \n            Kieran Flanagan"
}