{
  "url": "https://moz.com/blog/content-with-the-content-network",
  "slug": "content-with-the-content-network",
  "title": "Content with the Content Network? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's a long time since I used the content network. I've always thought that it is a bit of a waste of time. All those impressions, no conversions -- it hardly seemed worth the effort.\n\nI have been reconsidering my stance of late though. The problem is that I have been viewing it as a paid search…",
  "content": "Content with the Content Network? Online Advertising S By: Sarah Carling December 5, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Sarah Carling December 5, 2008 Content with the Content Network? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It's a long time since I used the content network. I've always thought that it is a bit of a waste of time. All those impressions, no conversions -- it hardly seemed worth the effort. I have been reconsidering my stance of late though. The problem is that I have been viewing it as a paid search platform, but perhaps that's not really where it sits. Perhaps what it really wants to be is an affiliate platform. This realisation came about after working on a lot of affiliate relationships. At the same time as pulling together a list of all of the Google services we may want to use at sometime in the future (ah, the joys of working in a large marketing department), the two just seem to sit in the same space, and certainly share more characteristics than the search & content networks do. I've had to change my perception and decide on some best practices for myself to ensure that I approach this in the right way (it's all about the ROI, after all). Here are my thoughts on how to approach the content network as an affiliate: Ignore the impression numbers. When working with affiliate partners it doesn't matter how many page views your ad gets; all you concern yourself with is click to sale ratio. Work on a CPC basis only. Unless you're running a branding exercise (in which case you are probably already on the content network), CPM causes you to lose control over your spend. Bid on a CPC basis and make sure that will work with your ROI. Use all ad types. To maximise your exposure, ensure that you have image ads in all sizes, as well as text ads. This way you can ensure that all of the sites you want to be seen on can show your ad. Don't use the display ad creator. These images are going to become old, fast! Be selective...but not too selective. If you use both placement and contextual targeting, you do not need to be too selective with where you advertise. Say you are selling wedding dresses. You would not necessarily think of an insurance website as a natural place to advertise, but keep it on the list. Your contextual requirements will mean that as soon as that site starts selling or pushing their wedding insurance services you will be seen by relevant customers. Google has made so many improvements to this tool over the last few years. I'm hoping to re-claim it as part of my online marketing arsenal. What's the worst that can happen? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content with the Content Network?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content with the Content Network?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Carling\n          \n            Sarah Carling"
}