{
  "url": "https://moz.com/blog/contextualize-topics-for-press-worthy-content",
  "slug": "contextualize-topics-for-press-worthy-content",
  "title": "How Contextualizing Topics can Lead to Press-worthy Content for Your Brand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The team at Stacker has mastered how to create newsworthy, data-driven stories for their newswire. Contextualizing topics, statistics, and events serves as a core part of their content ideation process. Today, Amanda shares their winning strategy so you can create content that has real news value.",
  "content": "How Contextualizing Topics can Lead to Press-worthy Content for Your Brand Content Marketing By: Amanda Milligan January 19, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Milligan January 19, 2022 How Contextualizing Topics can Lead to Press-worthy Content for Your Brand Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. More brands than ever are investing and producing quality journalism to drive their earned media strategy. They recognize that it’s a valuable channel for simultaneously building authority while finding and connecting with customers where they consume news. But producing and distributing great content is no easy feat. At Stacker and our brand-partnership model Stacker Studio, our team has mastered how to create newsworthy, data-driven stories for our newswire. Since 2017, we’ve placed thousands of stories across the most authoritative news outlets in the country, including MSN, Newsweek, SFGate, and Chicago Tribune. Certain approaches have yielded a high hit rate (i.e., pick up), and one of our most successful tactics is helping add context to what’s going on in the world. (I mentioned this as a tactic in my Whiteboard Friday, How to Make Newsworthy Content: Part 2.) Contextualizing topics, statistics, and events serves as a core part of our content ideation process. Today, I’m going to share our strategy so you can create content that has real news value, and that can resonate with newsroom editors. Make a list of facts and insights You likely have a list of general topics relevant to your brand, but these subject areas are often too general as a launching point for productive brainstorming. Starting with “personal finance,” for example, leaves almost too much white space to truly explore and refine story ideas. Instead, it’s better to hone in on an upcoming event, data set, or particular news cycle. What is newsworthy and specifically happening that’s aligned with your general audience? At the time of writing this, Jack Dorsey recently stepped down as CEO of Twitter. That was breaking news and hardly something a brand would expect to cover. But take the event and try contextualizing it. In general, what’s the average tenure of founders before stepping down? What’s the difference in public market success for founder-led companies? In regard to Parag Agrawal stepping into the CEO role, what is the percentage of non-white CEOs in American companies? As you can see, when you contextualize, it unlocks promising avenues for creative storyboarding. Here are some questions to guide this process. Question 1: How does this compare to similar events/statistics? Comparison is one of the most effective ways to contextualize. It’s hard to know the true impact of a fact when it exists stand alone or in a vacuum. Let’s consider hurricane season as an example. There’s a ton of stories around current hurricane seasons, whether it’s highlighting the worst hurricanes of all time or getting a sense of a particular hurricane’s scope of destruction or impact on a community. But we decided to compare it another way. What if we asked readers to consider what hurricane seasons were like the year they were born? This approach prompts a personal experience for the readers to compare what hurricane seasons are like now compared to a more specific “then” — one that feels particularly relevant and relatable. I’ll talk more about time-based comparisons in the next section, but you can also compare: Across industries/topics (How much damage do hurricanes do compared to tidal waves?)Across geographic areas (Which part of the ocean is responsible for the most destructive hurricanes? Where has the most damage been done around the world?)Across demographics (Which generation is most frightened of hurricanes?) There are dozens of possibilities, so allow yourself to freely explore all potential angles. Question 2: What are the implications on a local level? In some cases, events or topics are discussed online without the details of how they’re impacting individual people or communities. We might know what something means for a general audience, but is there a deeper impact or implication that’s not being explored? One of the best ways to do this is through localization, which involves taking a national trend and evaluating how it’s reflected and/or impacts specific areas. Newspapers do this constantly, but brands can do it, too. For example, there are countless stories about climate change, but taking a localized approach can help make the phenomenon feel “closer to home.” We put together a piece that illustrated significant ways climate change has affected each state (increased flooding in Arkansas, the Colorado River drying up, sea levels rising off South Carolina, etc.). You could take this a step further and look at a particular city or community if you had supporting data or research. If you serve particular markets, it’s easy to implement this strategy. Orchard, for example, does a great job publishing real estate market trend reports in the areas they serve. But if you’re a national or international brand that doesn’t cater to specific regions, try using data sets that have information for all countries, states, cities, ZIP codes, etc., and present all of it, allowing readers to identify data points that matter to them. When readers can filter data or interact with your content, it allows them to have a more personalized reading experience. Question 3: What sides of the conversation have we not fully heard yet? The best way to tap into the missing pieces of a story is to consider how other topics/subject areas interact with that story. I’ll stick with our climate change theme. We did the story above on how climate change has impacted every state, which feels comprehensive about the topic, but there’s more to dive into. Outside of just thinking how climate change is impacting geographic areas, we asked ourselves: How is it affecting different industries? Now we have a look at a more specific angle that’s fascinating — how climate change has impacted the wine industry. When you have a topic and want to uncover less-explored angles, ask yourself a set of questions that’s similar to the compare/contrast model: How does this topic impact different regions? (E.g. What is wine’s cultural role in various countries?)How does this topic impact different demographics of people? (E.g. Who profits most from wine making?)How does this topic impact different industries? (E.g. How have wineries/vineyards impacted tourism?)How is this topic impacted by these various things? (E.g. How is the flavor of wine impacted by region? Who buys the most wine, and where do they live?) This should create a good brainstorming foundation to identify interesting hooks that aren’t often explored about a really common topic. Conclusion Not only will taking the approach of contextualizing differentiate your story from everything else out there, it will also allow you to re-promote it when a similar event occurs or the topic trends again in the future. Contextualized content is often this perfect blend of timeliness and evergreen that’s really difficult to achieve otherwise. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Contextualizing Topics can Lead to Press-worthy Content for Your Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Contextualizing Topics can Lead to Press-worthy Content for Your Brand"
    },
    {
      "level": "H2",
      "text": "Make a list of facts and insights"
    },
    {
      "level": "H2",
      "text": "Question 1: How does this compare to similar events/statistics?"
    },
    {
      "level": "H2",
      "text": "Question 2: What are the implications on a local level?"
    },
    {
      "level": "H2",
      "text": "Question 3: What sides of the conversation have we not fully heard yet?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Amanda Milligan\n          \n            Amanda Milligan"
}