{
  "url": "https://moz.com/blog/content-marketing-that-stands-out",
  "slug": "content-marketing-that-stands-out",
  "title": "Content Marketing That Stands Out - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When you're a small fish in a sea of competitors, getting noticed by search engines is never easy. If you're a car dealer, local restaurant, real estate agent, lawyer, doctor, etc., you're not only competing with hundreds of other businesses just like yours, but when it comes to link-building,…",
  "content": "Content Marketing That Stands Out Content Marketing By: Dr. Peter J. Meyers October 6, 2010 Table of Contents Copied! By: Dr. Peter J. Meyers October 6, 2010 Content Marketing That Stands Out Content Marketing When you're a small fish in a sea of competitors, getting noticed by search engines is never easy. If you're a car dealer, local restaurant, real estate agent, lawyer, doctor, etc., you're not only competing with hundreds of other businesses just like yours, but when it comes to link-building, everyone is trying to pick the same low-hanging fruit. Strong content that attracts natural links can really help break the mold of low quality directories, blog comments, and spammy article marketing, but where do you start and how do you stand out? The world only needs so many mortgage calculators. I'd like to offer a few tactics to get you moving (and thinking) in the right direction. Car Dealers (Tactic: Positive UGC) Many companies are afraid of user-generated content (UGC). They imagine the worst – negative comments, brand-bashing, customer service horror stories. Although that fear is often overblown, it's easy to sympathize. It is possible, though, to use UGC and still control the message. Let me illustrate with a story. In the late 90s, my parents bought a Saturn. Back then, Saturn was known for their unique buying experience – when you signed your paperwork, they took your picture, posted it on the wall, and the employees all came out and cheered. It was a little odd, admittedly, but it was definitely a memorable experience. Why not use that same approach online? Find your brand evangelists - ask your customers to submit photos of themselves with their cars, for example. This type of positive UGC has a number of advantages: You'll tend to attract brand loyalists. People will link to their content on your site out of vanity. You'll create natural testimonials. Restaurants (Tactic: Positive UGC) This is another spin on the car dealership idea. If you're a restaurant, you have to deal with reviews. They can really make or break your business, especially now that there are entire companies dedicated to flooding the internet with positive (or negative) reviews. Why not ask for feedback in a way that naturally spins positive? For example, add a feature to your site where you ask people to post pictures of their favorite dish from your restaurant. No one has a bad favorite dish – the haters will naturally exclude themselves. Meanwhile, the brand evangelists will love seeing their photo posted online and will naturally tell their friends. Real Estate (Tactic: Local Interest) Real estate websites and even blogs have a tendency to be generic – they talk about why it's time to buy, how to find a decent interest rate, etc. This information, done well, is fine, but it's hard to stand out when you're saying the same things that 1,000 other realtors are saying. Why not focus on the local angle? Think more broadly than just real estate – talk about the highlights of the neighborhoods you sell in. This could be everything from the best schools and local tourist attractions to talking about your favorite local restaurants. Don't be afraid to get a little personal, and you'll tap into a few advantages: You'll show you know and like the neighborhood you sell in. Local content will naturally attract local links. You'll naturally highlight the reasons to live in your neighborhood. Lawyers (Tactic: Local Expertise) Lawyers, like realtors, face the problem of how to say the same things as everyone else and still sound unique. Again, focus on your own niche and the local angle (assuming you're a smaller office). Highlight local stories that show how the law impacts your area – this could be everything from crime stories to civil suits. Discuss these stories in the context of your practice. You could even have fun with it – talk about weird laws in your state or city, for example. The advantages? You'll show that you're up to date with current laws and events. People will see that you understand how the law impacts them. Local interest stories naturally attract local links. Don't Be Afraid to Get Creative If there's a theme here, it's that you can't be afraid to start getting creative, even if you think you're in a \"boring\" industry. Think about what got you into your business in the first place – there's always a story, and the more you put your own spin on content, the more authentic and unique it will naturally become. Say something that no one else is saying, and natural links will create themselves.\"Hundreds of cars\" image provided by ShutterStock. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Marketing That Stands Out"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Marketing That Stands Out"
    },
    {
      "level": "H4",
      "text": "Car Dealers (Tactic: Positive UGC)"
    },
    {
      "level": "H4",
      "text": "Restaurants (Tactic: Positive UGC)"
    },
    {
      "level": "H4",
      "text": "Real Estate (Tactic: Local Interest)"
    },
    {
      "level": "H4",
      "text": "Lawyers (Tactic: Local Expertise)"
    },
    {
      "level": "H4",
      "text": "Don't Be Afraid to Get Creative"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}