{
  "url": "https://moz.com/blog/content-syndication-and-how-to-look-good-doing-it",
  "slug": "content-syndication-and-how-to-look-good-doing-it",
  "title": "Content Syndication and How to Look Good Doing It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content syndication comes straight from page 63 of the Rules of SEO, so most Mozzarati know what it’s about. A brief primer: content syndicators accept informational content from writers (or at least people familiar with the alphabet) and post these articles for download by webmasters.",
  "content": "Content Syndication and How to Look Good Doing It Online Advertising By: Paul Lalley November 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Lalley November 19, 2008 Content Syndication and How to Look Good Doing It Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Content syndication comes straight from page 63 of the Rules of SEO, so most Mozzarati know what it’s about. A brief primer: content syndicators accept informational content from writers (or at least people familiar with the alphabet) and post these articles for download by webmasters. In return for the use of that content, the author gets a short bio and a backlink to his or her site. Symbiosis. The writer creates backlinks, webmasters find site content and the syndicators are racking up clickthrough revenues faster than FREE VIAGRA links. (Don’t bother. It’s a scam.) However, where you post and what you post and how easily you post these tidbits of wisdom will have an impact on how well they work at actually driving qualified traffic to a site. So, here are some suggestions for getting a bigger bang for your syndicated pieces. 1. Don’t post the same content on your own site. Your site will get slammed for duplicate content. However, once a piece has served its SEO usefulness on a site, re-purpose it for syndication and amortize content development dollars. 2. Find a hook that involves money, health or family. These articles get picked up much faster than content on what’s happening in the world of string theory. For example, I’ve got some articles posted with a syndicator. The article entitled “How to Ask for a Raise and Get It” has been viewed 218 times as of this morning. It’s the kind of title that can fit on sites with a broad range of topicality. Conversely, “Monetize Your Site – Fast” sits in the basement with only 14 views. Why? Because it’s a topic of interest only to some site owners, and the sites that appeal to this niche demographic are like SEOmoz (blatant plug) and a few other well-known sites so this piece was, most likely, a waste of my time. Even if you have to corkscrew the article to fit into one of the three categories – money, health or family – that’s what gets picked up the most. SEO articles basically suck when it comes to syndication. 3. Sell information. Syndication sites don’t want your 22-page sales letter. They want useful content that webmasters will download, that webmasters want. That doesn’t mean the piece can’t sell. Provide just enough informational content for the reader to recognize that “I need help with this.” Example? Let’s say you post a piece on investing (money topic) in oil exploration companies. If you title it “What Does the Future Hold for Oil and Gas Juniors,” maybe one site will pick it up. But, if you slant the text just a bit and title it “Secure Your Family’s Future With Energy,” that piece will show up on more sites, creating more links on SERPs. Don’t give the reader the answer(s) in the syndicated article. Provide just information to pique interest so the reader clicks on the link back to your client’s site. 4. Use expert’s name and email-site address. Place the expert’s name and email address at the end of each post. Also, if the syndicator allows for an ‘Authority Site” URL, enter your client’s site for an instant link. 5. Read the editorial and submissions guidelines carefully. Helium, for example, won’t accept the tried and true “10 Tips to (fill in the blank).” (Snobs!) Some of the submission guidelines are surprising. No links in the first 250 words and so on. To eliminate bounce backs and re-dos, follow submission and formatting guidelines to the letter. It’s their sand box. 6. You aren’t using this content to improve search engine rank so post, post, post. Post the same piece on several syndication sites. There’s no rule that says you can’t. Maybe change the title, but that’s it. There are lots of syndication sites, some are better than others. The three I use are: helium.com, ezine.com and goarticles.com, for different reasons: Goarticles.com lets the webmaster decide if a piece is worthy of download and display, so there’s no editorial process. Even if it’s horrible, it’ll be available on goarticles.com, which is kind of cool because one webmaster’s trash is another’s home page that day. Ezine.com does put its pieces through machine readers and Chris McKnight, who runs the ezine blog, has been touting the machine readers for their efficiency. Ezine bloggers have debated the subject several times. Even so, machine readers weed out spam, gibberish and anything by serial killers. And because ezine is, perhaps, the best known syndication site, you get a lot of use out of a piece. The site also enables you to have publications announced to your Twitter fan club automatically. Very cool. Helium.com has become a little snooty in accepting articles and the editorial review (human, so I’m told) is tortuously slow. However, Helium does have a cachet of quality and webmasters actually have to pay Helium for the download. You won’t get rich fast or slow, but it does keep out the bottom feeders. 7. Read Good. Syndicated content is a reflection of the quality of the site so it should be well-written, syntactically correct and sans typos. And so, for those who slept though Miss Warthog’s 7th grade English grammar class, here are a couple of writing tips to improve your image to the world. Common Copywriting Gaffes 1. There – That place over yonder They’re – contraction of they are Their – belongs to them 2. its – belonging to it it’s the contraction of it is 3. effects - physical outcome, e.g., The effects made my skin turn green. affects - a verb, e.g., The green skin thing affects my ability to date. 4. Ending a sentence with a proposition. We all do it even though we know it’s wrong. Prepositions are words like of, about, over, under, etc. Wrong: It was a good subject to read about. (Sentence ends in preposition) Right: It was a good subject about which to read. (No preposition) 5. Subject agreement Wrong: The medical practice couldn’t decide what they should do. Right: The medical practice couldn’t decide what it should do. 6. Parallel sentence construction Wrong: The book is delivering good information, education to the reader and an easy revenue model. Right: The book delivers good information, educates the reader and provides an easy revenue model. [All verbs are constructed in the same manner] 7. Phrases to avoid: at this point in time (from the Department of Redundancy Department) repeat again (ditto) I want to repeat again that you should not use repeat again. as we speak (you mean ‘now’) cutting edge, leading edge, ahead of the curve (or curb as I’ve seen it), bleeding edge, state-of-the-art and other clichés 8. Punctuation should appear inside quotes, as in: “I really didn’t agree with anything she said!”, NOT “I really didn’t agree with anything she said”! 9. Use colons to introduce bullet lists and end each bullet point with appropriate punctuation. This book will show you: how to earn $1 million in SEO. how to employ jargon to confuse clients. why SEO is growing so fast. In each case, the sentence begins, “This book will show you...\" and ends with one of the bullet points; thus, the period, question mark or other punctuation goes at the end of each point. 10. Finally, use action words. Would you rather: Learn the Secrets of Investing in Gold Futures or Discover the Secrets of Investing in Gold Futures Okay, there’s more but that’s enough for one post. All comments welcomed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Syndication and How to Look Good Doing It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Syndication and How to Look Good Doing It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Lalley\n          \n            Paul Lalley\n          \n            Paul Lalley"
}