{
  "url": "https://moz.com/blog/content-marketing-business-performance",
  "slug": "content-marketing-business-performance",
  "title": "Use as Directed: A Content Marketing Plan for Robust Business Performance - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most marketers utilize content marketing, but it's not always clear how to use it effectively, measure your results, or see actual business value from the effort. Alexandra Tachalova shares tactical advice for preparing a content marketing plan that will prove valuable for your bottom line.",
  "content": "Use as Directed: A Content Marketing Plan for Robust Business Performance Content Marketing By: Alexandra Tachalova December 20, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Alexandra Tachalova December 20, 2017 Use as Directed: A Content Marketing Plan for Robust Business Performance Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The chances that your company invests in a content marketing strategy are very high. Content Marketing Institute revealed that 89% of B2B and 86% of B2C marketers use content marketing, while the money spent on this activity ranges between 26% to 30% of an entire marketing budget. I believe that spending up to 50% of your overall budget on content marketing needs isn’t too much, if you know how to take advantage of it. Not only will it benefit your brand’s awareness, but it will also help you generate traffic, leads, and sales. My personal experience working with digital businesses has shown that only a few are successful in finding a strategic approach to their content plan. Sadly, most companies practice throwing spaghetti on the wall to see if a piece of content gets any readers. In this post, you'll learn how to ensure that every piece of content you create drives traffic, attracts leads, and generates sales. I’ll give you ready-to-use solutions on how you can plan, execute, and measure your content promotion, so that content starts earning your business money. Disclaimer: If you decide to follow any of my recommendations, make sure to adjust these techniques in accordance to your audience’s interests and your business needs, and test, test, and test again. As we all know, every business is unique, and what’s good for one brand may not be as helpful for another. Remember that blindly following any suggestions and mimicking other brands’ activities may not deliver desirable results. Numbers don’t lie: Measure how your current content is performing It’s important to start off your new content marketing campaign by analyzing your current situation. You may discover old content that hasn’t performed well yet, but that has the potential to benefit you with a few changes and a second chance. Working with old content is always a good idea, as the copywriting is already taken care of. Many marketers don’t understand what’s absolutely required when it comes to measuring a content marketing campaign. Data measurement and analysis can be quite intimidating, especially if you're just starting out. Here are two steps to take in order to get some meaningful insights: 1. Figure out how your content ranks in Google and whether it brings you traffic and conversions To get ahold of this data, you're going to need a combination of tools. Start with Google Analytics The \"Landing Pages\" report in Google Analytics will show how your pages perform according to the number of impressions, clicks, conversions, and the average position of each page in the search results. To view this report in Google Analytics, your Google Search Console needs to be connected with your Google Analytics account. If you haven’t connected it yet, this data can be viewed directly in Google Search Console via the \"Search Traffic\" > \"Search Analytics\" report. The problem with Google, though, is that it doesn’t give you a page's exact ranking; it only shows your site’s average position. It also requires you to check each page manually, so you can’t see a bigger picture all at once. Using tools — like SEMrush, SpyFu, Searchmetrics, Ahrefs, SERPstat, etc. — will allow you to see more precise data about your content's rankings. For example, here's a screenshot of a Google Analytics report showing a list of keywords for which a specific page appears in the SERPs: And here’s the same data from SEMrush that allows you to filter pages, export the data, and work with it in a spreadsheet: 2. Find content that can be easily improved/edited to begin bringing value After completing step #1, you'll have an all-encompassing picture of your content’s past performance. Geared up with the information you’ve uncovered, find those pages that are showing up in the search results and bringing you clicks and conversions, but that aren’t listed among the top five or ten search results. These pages have a lot of potential to make it to the top of Google. I would recommend checking whether these pieces: Are supported by internal links. The higher the referring article is in the search results, the better it is for you. Are easily discoverable. How long will it take a user to find your article? And I’m not talking only about the number of internal links in your content piece, but also whether it's featured in a similar content feed on blog posts. Have enough external links. If there are none, then you should definitely consider mentioning your article in one of your next guest posts, or ask your colleagues in the PR department to help spread the word. Have a well-written title and meta descriptions. Sometimes, this is what really affects your click-through rate and, as a result, your traffic. Make a user stay on your page reading longer. If the answer is no, you need to brainstorm what kind of triggers you can add to your page so that your users spend some time browsing around your content. It could be a catchy GIF, educational videos, or product slide presentations. The needs and wants of your business: Define the right metrics to track your progress From an early age, we're taught that there’s a difference between a need and a want, that we only have a few true basic needs, and myriad wants. The same logic can be applied to the business world, but it’s a lot harder to discern and comprehend. During this stage, you need to select highly meaningful and relevant metrics that align perfectly with your business needs. Please don’t try to use generic metrics — your business may have its own kind of struggles and goals. For some businesses, for instance, a conversion does not equal money. I run a free online conference called Digital Olympus that does not intend to sell anything. For me, a conversion is a registration, and I’ve come to learn that the best conversion for my situation is when a registered user attends my online event. Keep such things in mind at all times! Another great example of a non-monetary conversion comes from one of my clients. They are a completely free SaaS software for specialists in the agricultural industry. They realized that their conversions aren’t registrations alone, and the reason is quite simple. After carefully analyzing their users’ behavior, they discovered that after a user registers, they aren’t taking advantage of their tool at all. For them, the best conversion is a registered user that is actively involved with their product. Coincidentally, that’s where content marketing can come into play to solve their problems. Their users need help to understand how they can take advantage of the software; adding relevant content to the company’s site will surely add clarity and improve users' understanding of their product. When it comes to creating and managing content, it’s always a good idea to see exactly how users interact with it. Do they click on your call-to-action buttons? How many of them read your article in its entirety? All of these metrics are very easy to track if you use Google Tag Manager. It’s a must-have tool, allowing you to track whatever you want without going through the excruciating process of dealing with your dev team. Here’s an excellent post by Simo Ahava that explains which metrics you can track and analyze with the help of GTM. Have your Google Analytics reports ever shown you something like this?: If the answer is yes, you must know that elevating feeling of joy and excitement, seeing all these visitors checking out your page. But unless you’re a deliberate YouTuber with a fame complex, you’re not interested in traffic, per se. You want to witness conversions. The goals of pages that attract traffic but don’t convert, in the majority of cases, don't match up to the goals of your web visitors. If you haven’t added lead magnets on those pages yet, it should be your top priority, because currently those content pieces aren’t converting your traffic into something tangible. Don’t neglect the importance of SEO Yes, it’s definitely important to write meaningful content that will perfectly resonate with your audience — but that’s not all. If you want to bring a steady flow of new visitors with the help of that content, you must optimize each of your posts to make sure that it has a fighting chance to rank on Google. I highly recommend spending some time researching topics that will increase your chances to rank well. Below are a few ways you can identify them: 1. Find related keywords Imagine you discovered that keywords related to \"content marketing strategy\" are the keywords driving the most conversions. Those keywords should be analyzed in order to find other keywords related to that subject. These keywords have proven to mirror your audience’s search behavior the most, and they're very promising in terms of earning you more paying clients.One of the easiest ways to find related keywords is to simply check Google’s Autocomplete. You can look for autocomplete suggestions manually or by using tools like AnswerThePublic.com and Keywordtool.io. The latter scans Google Autosuggest and gives you the search volume for each keyword entered. It's a time-saver. Another tool worth trying is SEMrush's Keyword Magic tool. It automatically gives you the most necessary information about a keyword, factoring in metrics such as CPC and volume (basic, but much-needed), keyword difficulty, competition level, SERP features, and exact and broad keyword matches. This tool gathers the data you need and offers a wide range of analysis for both single keywords and groups of keywords. 2. Check the competition level in the SERPs After you've compiled a list of related keywords, it’s time to choose the keywords (e.g., topics for your future articles) that will help you rank higher in Google.To save time, use a tool like SEMrush's Keyword Difficulty. It tells you how difficult it will be for you to promote your piece of content based on the domain’s visibility in organic search results. However, the Keyword Difficulty tool doesn’t consider the number of referring domains for the website or page URL you’re trying to look up. Here’s what you can do to make the process of gathering this missing data hassle-free: Begin by collecting the list of domains and pages (URLs) that currently rank in Google for the list of keywords you’ve selected during the previous step. To speed things up, use a tool that allows you to easily export lists of domains and pages. After you collect all the domains and URLs, you'll need to check the number of referring domains for each of them. Tools like Ahrefs or the Majestic Bulk Backlink Checker will allow you to analyze multiple links at once. Finally, you can get a good understanding of what kinds of keywords have more or less competition based not only on the number of searchers they have, but also on their actual situation in the SERPs. After these steps are completed, you’ll see how many referring domains each of your content pieces ought to have in order to rank higher. You'll also be able to identify the number of referring domains by looking at how many links have been acquired by the other pages that currently rank well. Content promotion that gives short-term results As I’ve mentioned previously, you need to remember that ranking in Google and attracting organic visitors are among the top goals of any content piece. Ideally, every article you publish on your website should eventually rank well, but you need to give your new SEO campaign some time before it bears fruit. While you’re waiting, you can take advantage of the promotional activities that allow for almost instantaneous results. Depending on your budget and your current rankings, choose one of the following promotional activities that seem most relevant for you. A. Promote your posts on social media channels Some people say the world will never be same again thanks to social media. Not sure how to interpret that exactly, but not taking advantage of this powerful channel is reckless! This is a basic and very common way to promote content, and it’s not rocket science to figure out how things work. But let me give you a couple of really actionable tips that will help you to maximize the output: Create a short video to promote your content. They tend to perform really well on Facebook. Use GIFs that prove to be very effective. Tools like Canva will help you create them without needing to hire a designer, unless you really want your GIFs to win you an award. On Twitter, tag users that have recently shared something similar to your content. Search for a term that is related to your article, and you’ll see a list of users who you can tag. Facebook groups are always a great idea — especially private groups. I recommend researching such groups in advance. Be sure to think of a catchy, unique intro you’ll be able to post to each group. This article explains the benefits of building a Facebook group. Get inspired and get out there to network! If you want to promote your post on Facebook, make sure that your preview image meets the Facebook Ads Guidelines. Set up a small ad campaign on Twitter targeting users that have recently shared related content. Use BuzzSumo to find like-minded users. B. Collect leads If you choose this way of promotion, then you are going to put in some work. A dull page with \"meh\"-looking content won’t cut it. You'll need to prepare something beforehand, something that will look attractive enough to convince a visitor to give you their email. A user is more likely to give you their contact information when they are offered one (or all) of the following options: Exclusive content Content with quotes from or provided by well-known industry experts A webinar with a popular industry expert Useful tools and templates. For instance, it’d be very helpful if a post offered to download a free and ready-to-use content — a promotional plan with a detailed description of all stages and resources one may need to implement a marketing strategy. In case you don’t have a staff developer to help you with designing and adding a form to your website, there are different online services (like wisepops.com, wishpond.com, popupmonkey.com, or sumo.com) that you can use to create any kind of forms you want. C. Use remarketing Typically, only about 30% of visitors are willing to give you their contact details. The remaining 70% read or skim your content, close the tab, and get back to their routine. But you still have a second chance with them. How? The answer is remarketing: Prepare banners and landing pages that are relevant to your content. These can invite your users to join a webinar or offer an exclusive content. Basically, you can use the same lead magnets that you’ve already integrated into your content page. Prepare a script to automatically exclude your existing clients and leads from your remarketing campaign. There’s no need to bother them... yet. D. Use email marketing automation to turn leads into paying clients If you are somehow collecting leads and aren’t putting them through email marketing funnels, then you might as well just burn the rest of your money. HubSpot will really come in handy here because you can create email marketing funnels based not only on how users interact with your emails, but also on the type of pages your leads have visited. I’ve tried several HubSpot features while working on a few projects in the past, and I couldn’t have asked for a more powerful functionality. In case you aren’t a Hubspot user, there are other marketing tools that allow you to create email funnels. I'd also suggest involving your leads in as many activities as you possibly can, because every interaction matters and is making them warmer. Ask them to follow you on social media channels. You can also offer some case studies or success stories another client shared about your brand. Real-life cases with your actual clients are very powerful, and the open and click rates of these emails can be a lot higher. Before you start pushing your products or services to your leads, it's important to research what brought them to your website in the first place. This is absolutely essential, but sadly, a lot of companies tend to forget to do this research and fail; open rates plummet and users unsubscribe. Don’t let this happen to you. In conclusion It’s obvious why some blogs only post a couple of articles a year. What’s the point in creating tons of content that won’t bring any value to the business? Always keep your SEO goals in mind, and remember that you have to do some preparation in order for them to be delivered accurately and on time. Even short-term results require some leg work. No doubt that, once you’ve adjusted your routine, practiced some of the tactics mentioned above, and are consistent with them, every time you create a piece of meaningful and purposeful content, it will take you less time to manage and promote it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Use as Directed: A Content Marketing Plan for Robust Business Performance"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Use as Directed: A Content Marketing Plan for Robust Business Performance"
    },
    {
      "level": "H2",
      "text": "Numbers don’t lie: Measure how your current content is performing"
    },
    {
      "level": "H3",
      "text": "1. Figure out how your content ranks in Google and whether it brings you traffic and conversions"
    },
    {
      "level": "H4",
      "text": "Start with Google Analytics"
    },
    {
      "level": "H3",
      "text": "2. Find content that can be easily improved/edited to begin bringing value"
    },
    {
      "level": "H2",
      "text": "The needs and wants of your business: Define the right metrics to track your progress"
    },
    {
      "level": "H2",
      "text": "Don’t neglect the importance of SEO"
    },
    {
      "level": "H3",
      "text": "1. Find related keywords"
    },
    {
      "level": "H3",
      "text": "2. Check the competition level in the SERPs"
    },
    {
      "level": "H2",
      "text": "Content promotion that gives short-term results"
    },
    {
      "level": "H3",
      "text": "A. Promote your posts on social media channels"
    },
    {
      "level": "H3",
      "text": "B. Collect leads"
    },
    {
      "level": "H3",
      "text": "C. Use remarketing"
    },
    {
      "level": "H3",
      "text": "D. Use email marketing automation to turn leads into paying clients"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alexandra Tachalova\n          \n            Alexandra Tachalova\n          \n            Alexandra Tachalova"
}