{
  "url": "https://moz.com/blog/content-strategy-guided-by-audience-intent",
  "slug": "content-strategy-guided-by-audience-intent",
  "title": "Is Your Content Strategy Guided by Audience Intent (or Just Keywords)? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How do we build something that meets user intent while satisfying our business goals, and is better than anything else out there? This post provides three examples of audience-focused (not keyword-focused) content strategies based on exactly that question.",
  "content": "Is Your Content Strategy Guided by Audience Intent (or Just Keywords)? Content Marketing L By: Laura Lippay May 6, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! L By: Laura Lippay May 6, 2014 Is Your Content Strategy Guided by Audience Intent (or Just Keywords)? Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. All too often, I see content strategies that:Look at what people are searching for (keyword research).Create landing pages for as many keywords as possible.Write gobs of (often meaningless) keyword-optimized content. This is a typical old-school SEO strategy, but what about audience (visitor) intent?There's a lot of focus in SEO around optimized landing pages (as there should be). An optimized landing page has a targeted topic and keywords, a targeted page title, a clean URL, a compelling meta description, intuitive layout and navigation, loads quickly, looks amazing, and has calls to action most likely above the fold.Content, on the other hand, is more than just optimized landing pages. Content serves a purpose. Content can give a company an advantage over it's competitors. Content is a means of communicating and building a relationship with an audience. What is audience intent?Also called keyword intent and search intent, audience intent is the core of what your audience needs. Maybe they're researching the best hiking vacations around the globe. Maybe they want to know where they could go hiking, specifically in Utah. Maybe they know they want to go hiking in Utah and are looking for Utah vacation packages that include hiking. Or maybe they just need to book a trip from Boston to Park City. Their intent can be very vague or very specific, and when coming up with content for a landing page you need to put yourself in the mind of your audience and consider what it is that they really want to see. The audience intent would consider:What kind of content would help to easily and satisfactorily meet the intent of that visitor? If the intent is vague (ex: \"hairstyles\"), what are the various types of intents that they may have? Ex: hairstyle how-to videos, hairstyle lookbooks, short hairstyles, long hairstyles, hairstyles for curly hair, thin hair, frizzy hair, specific hairstyles like up-do's, braids, etc. What would they consider useful?What would they consider interesting or engaging?What would they consider sharable? The basic requirements of content strategyA great piece of content requires all of the things a great landing page does (when the content is indeed a landing page, as opposed to other types of content like white papers, videos, guides, maps, etc.). A great content strategy, though, considers a bit more beforehand, primarily:What are the goals of this content (why are we creating it)?What are the goals for the business (how do we make money)?What does it need to solve for the consumer (what is the audience intent)?And after thoughtful research around the audience needs and competitive landscape, it addresses this question:How do we build something that meets (and exceeds) user intent, while satisfying our business goals, and is better than anything else out there?Let's look at these considerations in real-life examples of content strategies. These examples clearly differentiate between simply building landing pages and writing copy vs. coming up with creative ways to meet audience intentions and business goals.Content strategy example 1:Content vs. lifestyleThe company in this scenario is currently purely transactional. The setup (in brief): Audience: Women age 25-55, typically moms.The audience need/intent: Discover smart and innovative ways to be awesome and live fabulously while being budget-conscious.Content goals: Extend the currently purely transactional brand into a lifestyle brand through an extensive, multidimensional content plan.Business goals: Sell product online.Previous attempts at content by the company have fallen flat (as have similar attempts by their primary competitors). No one reads their blogs and hasty attempts at launching content pieces have been more or less crickets.Much of this has to do with a transactional company trying to have a voice when no one is expecting them to talk. A brand without a clear voice and no authoritative experts or influencers, launching random bits of content is not a likely win situation. From an audience standpoint it raises more questions than advocacy - Why is this content here? Will there be more? Why should I consider them the authoritative voice in (topic), especially when there are many more authoritative voices out there dedicating entire websites and lifestyles to these topics?Lifestyles in this case is the key. Producing content is very different than immersing your brand in a lifestyle:CONTENTLIFESTYLELanding pagesSelf-expressionArticlesCommunityBlog PostsCultureVideosIdentitySlideshowsAssociationsGuidesExperienceMapsEmotionConsider these brands embracing lifestyles through content. They're all there to sell product, but their content attracts and engages audiences, draws them in like moths to flames. Their content isn't based on keywords and optimized landing pages, it's based on giving their audiences what they need and getting them excited about it in the process.GoPro: Be inventive, buy cameras. Nike: Do sports, buy shoes. Airbnb: Travel hip, rent places. Martha Stewart: Be crafty, buy products. The approach proposed for this particular client in this example:Client: Live fabulously on a budget, buy products.See how that's different from this?Client: Optimized landing pages derived from high-volume keywords, buy products.The content strategy involves weekly collections, guides, a magazine-style approach to daily content, evergreen marketing pieces and special approaches to holidays, plus acquisitions and partnerships with influential people in the space and potentially a branded \"voice of the company\" personality doing TV appearances and PR and promoting the content.Of course this content strategy took several months and a lot of research. In a future post I'll go into detail on the process and tools available for putting together a comprehensive content strategy.Content strategy example 2:Articles vs. awesome contentThis client was an online magazine targeted at women, with several top-level categories on the site like fashion, beauty, etc. presented in one of two formats: slideshows or articles.The setup:Audience: Primarily women, primary age group: 35-55.The audience need/intent: Get fashion and beauty inspiration, tips, ideas.Content goals: Reach and engage more women.Business goals: Page views (ad impressions).The easy part of this content strategy was the architecture. The current architecture was so basic that keyword research alone was enough to provide some great insight into what the audience was looking for that the online magazine was providing but in no clear architectural way. There were quick wins to be had like creating subcategorical landing pages like Spring Trends and Summer Trends under Fashion Trends.The bigger challenge: The competition. Women's fashion and beauty is a highly competitive space online. Creating landing pages does not mean they will come. This content needed a more creative \"how can we do something better\" eye. From the typical SEO mindset you can think of it as \"how can we create something that people will link to, share and engage with more than our competitors?\"We utilized several research avenues, primarily:Market research on online beauty and fashion trends.Extensive competitive research.Extensive research into trends on what's popular in beauty and fashion online and in social networks.And we found all kinds of cool things that the online magazine could be doing to attract and engage more women. In the end the content strategy proposed features like:Videos or slideshows comparing different makeup brands (example: different thick lash mascaras or long-lasting lipsticks).Makeover tools.Various types of \"lookbooks\" for things like pixie hairstyles, colorful eyeliner ideas, nail trends, etc.Working with brand partners to deliver samples boxes to subscribers.A series on recreating celebrity looks for less (and where to buy).Local fashionista bloggers in major cities who blog on where the latest coolest fashion finds, fashion events and fashionable places to be are in that city.Weekly collections/series around various topics like This Weeks Cutest Shoes (in your inbox), Must-Have Dresses, Craziest Fashion Trends, etc.This was presented within the newly proposed architecture with cross-linking opportunities and optimization recommendations (especially around video, images and social sharing) for a complete content strategy.Content strategy example 3:Selling vacation packagesAn airline sells vacation packages that include flights and tours of the area they mainly fly into. They have the packages on the site but they're performing pretty poorly.The setup:Audience: Adult international travelers coming from the United States.The audience need/intent: Find things to do in the area, find tours in the area, find vacation packages, plan a vacation in the area.Content goals: Attract, engage and convert more people.Business goals: Primary: sell flights. Secondary: sell packages.Here are the things I looked at in preparation for their content strategy:What do searches tell us about the various types of intent the searchers have? People may be searching a specific attraction or they may be looking for hiking tours. We found at least 4 high-level ways to slice and dice intent (in addition to looking for packages): By specific attraction name, by town, by type of attraction (ex: waterfalls), or by activity (ex: bird-watching).Does the site architecture currently meet those intents? In fact, no. The architecture was somewhat random. It is difficult to find some of the things on the site based on those 4 types of intent. Some of the content that could be easily cross-sold was also buried as landing pages in the packages section.How do visitors with these intents navigate the site now? We did user testing asking visitors to find and book a specific attraction and to find and book a specific activity. Many were unable to complete the tasks, and all of them went about it in completely different ways. We learned a lot about what people expect to find and how they expect to find it that could help guide our content strategy (including additional types of intent like time of year the package is available for instance).What content assets do we have to work with? A content inventory was done with a sample size of content currently in season and live on the site, and content out of season that they currently remove from the site. Each page was \"tagged\" with the specific attractions, towns, type of \"thing to see,\" and activities that were included in the package along with package price, travel period, whether or not it includes a flight, departure airport, number of nights.With all of this in mind, the end content strategy proposed things like:Architecture: An updated architecture with landing pages to meet the specific major intents.Navigation: A newly proposed navigation (which is slightly different from the architecture).URLs: Of course.Tools: A proposed filtering tool/system to filter anything from type of activity involved to price range to number of nights and everything in-between.On-Page: On-page content recommendations based on what we learned from user testing + adding in related content for higher engagement and search-friendly cross-linking of relevant content and pulling things like transportation options out from being a buried landing page under packages to being a module cross-linked from relevant package pages.Seasonal content treatments: Adding the ability to book packages that aren't in season right now + how to address long term landing pages for seasonally available or annually changing content.Rather than just creating landing pages and optimizing them based on what people are searching for, we took an approach to this content based on the various types of user intents people may have that may bring them to the site and ultimately book a package.Remember, we're creating content for people, not search engines It all goes hand-in-hand. When you create something that your audiences like, that they link to more, share more, and engage with more, it's likely to affect search engine rankings and traffic, too. Of course this isn't your good ol' typical \"SEO,\" but its also not 1999. The best SEO is—and for many years has been—a good product, so taking the time to consider your audience intentions when creating a content strategy can pay off in more ways than one. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Your Content Strategy Guided by Audience Intent (or Just Keywords)?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Your Content Strategy Guided by Audience Intent (or Just Keywords)?"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "What is audience intent?"
    },
    {
      "level": "H2",
      "text": "The basic requirements of content strategy"
    },
    {
      "level": "H2",
      "text": "Content strategy example 1:Content vs. lifestyle"
    },
    {
      "level": "H2",
      "text": "Content strategy example 2:Articles vs. awesome content"
    },
    {
      "level": "H2",
      "text": "Content strategy example 3:Selling vacation packages"
    },
    {
      "level": "H2",
      "text": "Remember, we're creating content for people, not search engines"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Laura Lippay\n          \n            Laura Lippay\n          \n            Laura Lippay"
}