{
  "url": "https://moz.com/blog/content-flow",
  "slug": "content-flow",
  "title": "Content Flow: The \"Melodic\" Fix for Your \"Broken\" Content Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Building out a content strategy fit for your audience is a difficult process. Content flow is the metric you've been waiting for to make that much easier.",
  "content": "Content Flow: The \"Melodic\" Fix for Your \"Broken\" Content Marketing Strategy Content Marketing | Blogging | SEO Copywriting By: Simon Penson December 3, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Simon Penson December 3, 2014 Content Flow: The \"Melodic\" Fix for Your \"Broken\" Content Marketing Strategy Content Marketing | Blogging | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In a world now overflowing with 'content,' standing out is critical to breaking through. And while almost all digital marketers are aware of the challenge that presents, the solution chosen simply extenuates the very issue it was designed to fix. Unfortunately, too many people see the answer to standing out and achieving reach as becoming a 'shout louder'. But that’s an approach that misses so many critical strategic objectives. Maturing markets, as the 'content market' now is, require subtlety of approach and refinement. A campaign plan based on an unconnected series of 'big bang' content is unconnected from the very audience for which it was really designed to attract and retain. The answer to this disconnect lies in something I call 'content flow', or 'content dynamics', and this post is designed to share the concept to allow you to give it a go.What is content flow? \"The whole is greater than the sum of its parts.\" - Aristotle This quote eloquently 'sums' up the true value of content strategy. Your content marketing strategy is not hundreds or thousands of connected stories. It's one story with a lot of scenes. The only way of creating any kind of long-term connection with your audience is to introduce variation into your content strategy and connect those important bigger campaigns, or pieces, together using smaller pieces. The best way of visualizing this is to imagine the smaller 'everyday' content pieces you produce as 'whispers' that keep the campaign alive in between the larger, campaign-led 'shouts'.The music of content flow To understand how to create the variation any good content strategy needs to work, we should look for a moment to some of the greatest content creators to have lived: classical music composers—the masters of the concept of 'whispering' and 'shouting' to create impact. Listen to any 'great' piece and you will immediately notice that it has quieter periods followed by great crescendos, utilizing something called dynamic note velocity to create an absorbing 'journey' through the composition. We can clearly see this is we look at the sound wave profile of such a piece. Below is a Beethoven composition with clear crescendos and diminuendos that make the piece so absorbing. This is why classical 'songs' can go on for so long without losing your interest. If this were content strategy, or an editorial plan, the 'peaks' would be those 'big bang' campaign ideas, while the 'troughs' would be the 'everyday content' that glues your big ideas together in a seamless and absorbing way. The result is a coherent composition that allows the user to feel the full range of your content marketing strategy and still experience it as a whole.Content dynamics in marketing Given that we now understand how content flow works in a musical context, we must now look at how those key principles can be applied to content marketing. The first step in creating the right flow of content is in understanding its importance, but the second is in the planning and measurement of your own work. To do this you should start at the beginning, with the ideation process. It's critical here to have a sound process for coming up with ideas that produced, consistently, enough of the right ideas that can fit the 'peak' and 'troughs' concept. This is something I have worked on for the past ten years and the resulting process is something I have shared right here on Moz previously. Since that time, however, the process has been updated even further and you can find the latest version here. This process is designed to ensure you have enough of each type of content to enable the second phase—editorial planning.Building your editorial plan Once you have enough content ideas from your brainstorm the next phase is to begin 'grading' them into either 'small', 'medium' or 'large' ideas. You can do this manually as I'm about to explain now, or make use of the free and brand-spanking-new Zazzle Media Content Flow Generator tool, which is designed to do the hard work for you.Manual testing To test out your best laid content plan is a simple process and it begins at the initial ideation phase. Once you have your initial list of ideas, you should note them down in a simple Excel column. I've created an example below with some ideas for a fictional finance brand. In the right hand column you will see a number. There is no 'science' here, just a simple scoring system to highlight the 'size' or, more precisely, the amount of time and resource that will go into the creation of each piece. The purpose of this is to enable the plotting of your content on a chart that will allow you to understand how it flows. The next stage is to then plot the suggested publication dates so you end up with something like this: From here select the dates and scores and select the 'Charts' function from the menu bar of Excel (I'm using Mac in this example). Select the 'Line' option and you should see the data in a chart that looks a little like this: You can then use the various formatting options to make it more clear, or play with the numbers, more importantly, to get the 'flow' right.The 'right' wave dynamic Of course, you need to know what it is you are looking for to be able to decipher if your initial content plan is laid out correctly. In simple terms there is no 'perfect' shape as every business has different objectives but whenever in doubt we should refer back to the initial learning from those classical pieces. The strategy should be to create a handful of 'big bang' ideas per year surrounded by a cacophony of brilliant everyday content, which both entertains and informs and ties together your symphony. The work above should then create something that looks like the chart below. The important part is in ensuring that the 'big bang' campaign ideas are evenly spaced and do not drown out the overall picture. There are few worse mistakes then simply creating a large number of 'big' ideas as we discussed earlier in the post. The reason for that is simple and it comes back to the same rules as those that are applied to TV, radio and print when it comes to achieving perfect 'content flow'.Learning from print We can reverse engineer this in practice by taking a look at how something like a magazine is put together. Having worked in the industry for many years I know first hand how content works over the long term, and it's all about consistently delivering surprise and variation. The best place to find this is on the cover. An example of this can be found below with this Men's Health cover: You can clearly see how the cover lines correspond to the needs of the audience: Those that want to improve their body Those that want to improve their mind Those that want to be better lovers And you can clearly see that the editorial team understands its audience in great detail and knows precisely how to deliver content in a way that keeps all elements of its readership entertained and informed. That doesn't happen by accident. It starts with the persona creation process to segment the key interest sets. These then manifest themselves as regular 'cover sells' or 'content pillars' as I like to call them. These concepts are then covered monthly within the editorial plan and how each key subject is covered will vary each time it is covered. So, in month one the 'improve your body' concept will be covered in a long form feature, looking at something like 'the science of muscle growth', while the next month it may be a quick-fire, shorter piece forming a 20-minute circuit training session. It's this variation that creates 'content flow'. If you want to learn the tricks yourself all you have to do is reverse engineer a couple of magazines. To do that all you need is a 'flatplan' template – or the document many editors use to plan out the 'flow' of their issue. You can then take a copy of the magazine from your sector and mark off the general schematic make-up of the edition a little like the example below: You can then simply test that 'layout' for your own digital strategy.Mobile The testing phase shouldn't simply stop at your overall plan, however, as content consumption is quickly becoming a 'mobile first' game. That means that thinking about how you plan your strategy for the various devices is also critical to success to ensure that the way in which you cover your key 'pillars' creates a compelling mix of content types for ALL devices. I wrote about this aspect of the content strategy in this earlier Moz post if you want some more detail.Final plan Like anything in digital there is no 'perfect' template to use when it comes to planning the right delivery for your brand but by sticking to the principle of 'ebb and flow' in your content flow and working hard on ideas you will quickly see how easy it is to grow a truly valuable, and engaged audience, over time for your site.Six steps to nail your content plan For those that like steps to work to this is the general process I work to: Start with a data dig to establish your key audience personas. Utilize a good persona template to record the key information. Work through a structured content ideation process to ensure you create ideas pinned to the key audience need. Work this data into a content plan and record in a calendar. Test how that content 'flows' using the checker tool I mentioned earlier. You find help as to how to lay your content out from magazines. Run the plan over a six-month period and then review based on the changes you have seen in key engagement metrics such as bounce rate, returning visitor numbers, time on site, etc. Change and repeat, constantly looking for the right ebb and flow for your audience and commercial goals. Having got this far, I genuinely hope you are now keen to integrate content flow checks into your overall content strategy and marketing process. With most content discussions surrounded by 'data' and 'ideas' it is useful sometime to step back and remember that it is, ultimately still an art form, and always will be. That means you must ensure that any strategy you create is focused in not just on the buzzwords but the foundation too. By doing this you'll turn your content creation process from a gaggle of ideas into a true symphony for your audience to enjoy. And if you want to have a go yourself, here's a reminder of that free Content Flow Checker tool. Click below to try it out on your strategy and let me know how you get on. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Content Flow: The \"Melodic\" Fix for Your \"Broken\" Content Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Content Flow: The \"Melodic\" Fix for Your \"Broken\" Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "What is content flow?"
    },
    {
      "level": "H2",
      "text": "The music of content flow"
    },
    {
      "level": "H2",
      "text": "Content dynamics in marketing"
    },
    {
      "level": "H2",
      "text": "Building your editorial plan"
    },
    {
      "level": "H3",
      "text": "Manual testing"
    },
    {
      "level": "H3",
      "text": "The 'right' wave dynamic"
    },
    {
      "level": "H2",
      "text": "Learning from print"
    },
    {
      "level": "H2",
      "text": "Mobile"
    },
    {
      "level": "H2",
      "text": "Final plan"
    },
    {
      "level": "H2",
      "text": "Six steps to nail your content plan"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Penson\n          \n            Simon Penson\n          \n            Simon Penson"
}