{
  "url": "https://moz.com/blog/content-reoptimize-guide",
  "slug": "content-reoptimize-guide",
  "title": "How to Use Tools to Determine Which Content to Re-Optimize: A Step-by-Step Guide - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Re-optimizing content can be a powerful tool for increasing traffic, but it’s easy to do wrong. Learn how to re-optimize the right way in this step-by-step guide.",
  "content": "How to Use Tools to Determine Which Content to Re-Optimize: A Step-by-Step Guide Content Marketing | SEO Tools By: Jeff Baker January 14, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jeff Baker January 14, 2020 How to Use Tools to Determine Which Content to Re-Optimize: A Step-by-Step Guide Content Marketing | SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Why is everyone and their grandparents writing about content re-optimization? I can’t speak for the people writing endless streams of blogs on the subject, but in Brafton’s case, it’s been the fastest technique for improving rankings and driving more traffic. As a matter of fact, in this previous Moz post, we showed that rankings can improve in a matter of minutes after re-indexing. But why does it work? It’s probably a combination of factors (our favorite SEO copout!), which may include: Age value: In a previous study we observed a clear relationship between time indexed and keyword/URL performance, absent of links: More comprehensive content: Presumably, when re-optimizing content you are adding contextual depth to existing topics and breadth to related topics. It’s pretty clear at this point that Google understands when content has fully nailed a topic cluster. It’s a known quantity: You’re only going to be re-optimizing content that has a high potential for return. In this blog post, I’ll explain how to identify content with a high potential for return. How well does it work? Brafton’s website is a bit of a playground for our marketing team to try new strategies. And that makes sense, because if something goes horribly wrong, the worst case scenario is that I look like an idiot for wasting resources, rather than losing a high-paying client on an experiment. You can’t try untested procedures on patients. It’s just dangerous. So we try new strategies and meticulously track the results on Brafton.com. And by far, re-optimizing content results in the most immediate gains. It’s exactly where I would start with a client who was looking for fast results. Example: Top Company Newsletters Example: Best Social Media Campaigns In many cases, re-optimizing content is not a “set it and forget it,” by any means. We frequently find that this game is an arms race, and we will lose rankings on an optimized article, and need to re-re-optimize our content to stay competitive. (You can clearly see this happening in the second example!) So how do you choose which content to re-optimize? Let’s dig in. Step 1: Find your threshold keywords If a piece of content isn’t ranking in the top five positions for its target keyword, or a high-value variant keyword, it’s not providing any value. We want to see which keywords are just outside a position that could provide more impact if we were able to give them a boost. So we want to find keywords that rank worse than position 5. But we also want to set a limit on how poorly they rank. Meaning, we don’t want to re-optimize for a keyword that ranks on page eleven. They need to be within reach (threshold). We have found our threshold keywords to exist between positions 6–29. Note: you can do this in any major SEO tool. Simply find the list of all keywords you rank for, and filter it to include only positions 6-29. I will jump around a few tools to show you what it looks like in each. You have now filtered the list of keywords you rank for to include only threshold keywords. Good job! Step 2: Filter for search volume There’s no point in re-optimizing a piece of content for a keyword with little-to-no search volume. You will want to look at only keywords with search volumes that indicate a likelihood of success. Advice: For me, I set that limit at 100 searches per month. I choose this number because I know, in the best case scenario (ranking in position 1), I will drive ~31 visitors per month via that keyword, assuming no featured snippet is present. It costs a lot of money to write blogs; I want to justify that investment. You’ve now filtered your list to include only threshold keywords with sufficient search volume to justify re-optimizing. Step 3: Filter for difficulty Generally, I want to optimize the gravy train keywords — those with high search volume and low organic difficulty scores. I am looking for the easiest wins available. You do not have to do this! Note: If you want to target a highly competitive keyword in the previous list, you may be able to successfully do so by augmenting your re-optimization plan with some aggressive link building, and/or turning the content into a pillar page. I don’t want to do this, so I will set up a difficulty filter to find easy wins. But where do you set the limit? This is a bit tricky, as each keyword difficulty tool is a bit different, and results may vary based on a whole host of factors related to your domain. But here are some fast-and-loose guidelines I provide to owners of mid-level domains (DA 30–55). ToolKW DifficultyAhrefs<10Moz<30Semrush<55KW Finder<30 Here’s how it will look in Moz Keyword Explorer. Note: Moz has predefined ranges, so we won’t be able to hit the exact thresholds outlined, but we will be close enough. Now you are left with only threshold keywords with significant search volume and reasonable difficulty scores. Step 4: Filter for blog posts (optional) In our experience, blogs generally improve faster than landing pages. While this process can be done for either type of content, I’m going to focus on the immediate impact content and filter for blogs. If your site follows a URL hierarchy, all your blogs should live under a ‘/blog’ subfolder. This will make it easy for you to filter and segment. Each tool will allow you to segment keyword rankings by its corresponding segment of the site. The resulting list will leave you with threshold keywords with significant search volume and reasonable difficulty scores, from blog content only. Step 5: Select for relevance You now have the confidence to know that the remaining keywords in your list all have high potential to drive more traffic with proper re-optimization. What you don’t know yet, is whether or not these keywords are relevant to your business. In other words, do you want to rank for these keywords? Your website is always going to accidentally rank for noise, and you don’t want to invest time optimizing content that won’t provide any commercial value. Here’s an example: I recommend exporting your list into a spreadsheet for easy evaluation. Go through the entire list and feel out what may be of value, and what is a waste of time. Now that you have a list of only relevant keywords, you now know the following: Each threshold keyword has significant search volume, reasonable keyword difficulty, corresponds to a blog (optional), and is commercially relevant. Onto an extremely important step that most people forget. Step 6: No cannibals here What happens when you forget about your best friend and give all your attention to a new, but maybe not-so-awesome friend? You lose your best friend. As SEOs, we can forget that any URL generally ranks for multiple keywords, and if you don’t evaluate all the keywords a URL ranks for, you may “re-optimize” for a lower-potential keyword, and lose your rankings for the current high value keyword you already rank for! Note: Beware, there are some content/SEO tools out there that will make recommendations on the pieces of content you should re-optimize. Take those with a grain of salt! Put in the work and make sure you won’t end up worse off than where you started. Here’s an example: This page shows up on our list for an opportunity to improve the keyword “internal newsletters”, with a search volume of 100 and a difficulty score of 6. Great opportunity, right?? Maybe not. Now you need to plug the URL into one of your tools and determine whether or not you will cause damage by re-optimizing for this keyword. Sure enough, we rank in position 1 for the keyword “company newsletter,” which has a search volume of 501-850 per month. I’m not messing with this page at all. On the flipside, this list recommended that I re-optimize for “How long should a blog post be.” Plugging the URL into Moz shows me that this is indeed a great keyword to reoptimize the content for. Now you have a list of all the blogs that should be reoptimized, and which keywords they should target. Step 6: Rewrite and reindex You stand a better chance of ranking for your target keyword if you increase the depth and breadth of the piece of content it ranks for. There are many tools that can help you with this, and some work better than others. We have used MarketMuse at Brafton for years. I’ve also had some experience with Ryte’s content optimizer tool, and Clearscope, which has a very writer-friendly interface. Substep 1: Update the old content in your CMS with the newly-written content. Substep 2: Keep the URL. I can’t stress this enough. Do not change the URL, or all your work will be wasted. Substep 3: Update the publish date. This is now new content, and you want Google to know that as you may reap some of the benefits of QDF. Substep 4: Fetch as Google/request indexing. Jump into Search Console and re-index the page so that you don’t have to wait for the next natural crawl. Step 7: Track your results! Be honest, it feels good to outrank your competitors, doesn’t it? I usually track the performance of my re-optimizations a couple ways: Page-level impressions in Search Console. This is the leading indicator of search presence. A keyword tracking campaign in a tool. Plug in the keywords you re-optimized for and follow their ranking improvements (hopefully) over time. Variant keywords on the URL. There is a good chance, through adding depth to your content, that you will rank for more variant keywords, which will drive more traffic. Plug your URL into your tool of choice and track the number of ranking keywords. Conclusion Re-optimizing content can be an extremely powerful tool in your repertoire for increasing traffic, but it’s very easy to do wrong. The hardest part of rewriting content isn’t the actual content creation, but rather, the selection process. Which keywords? Which pages? Using the scientific approach above will give you confidence that you are taking every step necessary to ensure you make the right moves. Happy re-optimizing! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Tools to Determine Which Content to Re-Optimize: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Tools to Determine Which Content to Re-Optimize: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "But why does it work?"
    },
    {
      "level": "H3",
      "text": "How well does it work?"
    },
    {
      "level": "H2",
      "text": "Step 1: Find your threshold keywords"
    },
    {
      "level": "H2",
      "text": "Step 2: Filter for search volume"
    },
    {
      "level": "H2",
      "text": "Step 3: Filter for difficulty"
    },
    {
      "level": "H3",
      "text": "But where do you set the limit?"
    },
    {
      "level": "H2",
      "text": "Step 4: Filter for blog posts (optional)"
    },
    {
      "level": "H2",
      "text": "Step 5: Select for relevance"
    },
    {
      "level": "H2",
      "text": "Step 6: No cannibals here"
    },
    {
      "level": "H2",
      "text": "Step 6: Rewrite and reindex"
    },
    {
      "level": "H2",
      "text": "Step 7: Track your results!"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Baker\n          \n            Jeff Baker\n          \n            Jeff Baker"
}