{
  "url": "https://moz.com/blog/content-marketing-builds-links-and-earns-press-mentions",
  "slug": "content-marketing-builds-links-and-earns-press-mentions",
  "title": "\"Study Finds:\" How Data-Driven Content Marketing Builds Links and Earns Press Mentions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We pulled 8,400 articles containing the text “study finds” to understand what types of data journalism, themes, and strategies for outreach can be most effective for link building.",
  "content": "\"Study Finds:\" How Data-Driven Content Marketing Builds Links and Earns Press Mentions Content Marketing | Link Building By: Kristin Tynski August 12, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristin Tynski August 12, 2019 \"Study Finds:\" How Data-Driven Content Marketing Builds Links and Earns Press Mentions Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In 2019, high-authority links remain highly correlated with rankings. However, acquiring great links is becoming increasingly difficult. Those of you who operate publications of any variety, especially those who enjoy high domain authority, have likely received several link building requests or offers like this each day: “Please link to my suspect site that provides little or no value.” “Please engage in my shady link exchange.” “I can acquire 5 links of DA 50+ for $250 each.” Or maybe slightly more effectively: “This link is broken, perhaps you would like to link here instead.” “You link to X resource, but my Y resource is actually better.” This glut of SEOs who build links through these techniques above have been consistently eroding the efficacy of this style of little-to-no-value ad outreach link building. In the past, perhaps it was possible to convert 2% of outreach emails of this style to real links. Now, that number is more like 0.2 percent. Link building outreach has become glorified email spam—increasingly ignored and decreasingly effective. And yet, high-authority links remain one of the single most important ranking factors. So where do we go from here? Let’s start with a few axioms. The conclusion: Leveraging data journalism to tell newsworthy stories re-enables effective promotion of content via outreach/pitching. Doing so successfully results in the acquisition of high domain authority links that enjoy the potential for viral syndication. Overall data journalism and outreach represents one of the only remaining scaleable high-authority link building strategies. How can I leverage data journalism techniques to earn coverage? To answer this question, I conducted my own data journalism project about the state of data journalism-driven link building! (Meta, I know.) The primary goal was to understand how major publications (the places worth pitching content) talk about data journalism findings from external sources. By understanding how data journalism is covered, we lay the groundwork for understanding what types of data journalism, themes, and strategies for outreach can be most effective for link building. We pulled 8,400 articles containing the text “study finds.” This keyword was used as a heuristic for finding data-driven news stories created by outside sources (not done internally by the news publication themselves). We then supplemented these articles with additional data, including links built, social shares, and Google’s Machine Learning topic categorization. The categories derived by Google’s classifier can have multiple tiers based on the keywords in the article titles, giving us four ways to show the results within each category: The main topic area (containing all relevant subcategories), just the first subcategory, just the second subcategory, and just the third subcategory. Which outlets most frequently cover data-driven stories from external pitches? Let’s begin by taking a look at which top-tier news outlets cover “study finds” (AKA, any project pitched by an outside source that ran a survey or study that had “findings”). For companies conducting studies, they hope to win press coverage for, these top sites are prime targets, with editorial guidelines that clearly see outside pitches of study findings as attractive. It’s not surprising to see science-based sites ranking at the top, as they’re inherently more likely to talk about studies than other publications. But sites like The Independent, Daily Mail, The Guardian, CNN, Washington Post, and NBC News all ranked highly as well, providing great insight into which established, trusted news sources are willing to publish external research. Which topic areas do these publishers write about most? Diving a little deeper, we can explore which topics are covered in these publications that are associated with these external studies, providing us insight into which verticals might be the best targets for this strategy. There are many unique insights to be gleaned from the following charts depending on your niche/topical focus. This data can easily be used as a pitching guide, showing you which publishers are the most likely to pick up and cover your pitches for the findings of your study or survey. Here is a view of the overall category and subcategory distribution for the top publishers. As you can see, it’s...a lot. To get more actionable breakdowns, we can look at different views of the topical categories. The categories derived by Google’s classifier can have multiple tiers based on the keywords in the article titles, giving us several ways to show the results within each category. You can explore the Tableau sheets to get into the nitty-gritty, but even with these views, a few more specialized publications, like InsideHigherEd.com and blogs.edweek.org, emerge. Which topic areas drive the most links? Press mentions are great, but syndication is where data journalism and content-based outreach strategy really shines. I also wanted to understand which topic areas drive link acquisition. As it turns out, some topics are significantly better at driving links than others. Note that the color of the bar charts is associated with volume of sharing by topic—the darker the bar on the chart, the higher it was shared. With this additional sharing data, it’s plain to see that while links and social shares are highly correlated, there are some categories that are top link builders but do not perform as well on social and vice versa. This next set of data visualizations again explore these topic areas in detail. In each batch, we see the median number of links built as an overall category aggregate and then by each category. Which domains generate the most links when they pick up a data-driven story? Another interesting question is which domains overall result in the largest number of links generated for “study finds” stories. Below is that ranking, colored by the median number of total shares for that domain. Notice that while The Independent ranked supreme in the earlier graph about including the most “study finds” pieces, they don’t appear at all on this graph. Sites like The Guardian, CNN, The Washington Post, and NBC News, however, score highly on both, meaning they’re probably more likely to publish your research (relatively speaking, since all high-authority sites are tough to get coverage on), and if you’re successful, you’re probably more likely to get more syndicated links as a result. Which topic areas are the most evergreen? Now, let’s look at each category by BuzzSumo’s “evergreen score” to see what kind of content will get you the most bang for your buck. The evergreen score was developed by BuzzSumo to measure the number of backlinks and social shares an article receives more than a month after it’s published. When you’re considering doing a study and you want it to have lasting power, brainstorm whether any of these topics tie to your product or service offering, because it appears their impact lingers for longer than a month: What this all means Link building through data-driven content marketing and PR is a predictable and scalable way to massively impact domain authority, page authority, and organic visibility. Always consider: 1. Which publishers make sense to pitch to? Do they often cover external studies?Do they cover topics that I write about?Does their coverage lead to a high volume of syndicated links? 2. Does my topic have lasting power? To really make the most of your content and outreach strategy, you’ll need to incorporate these tips and more into your content development and pitching. In previous articles on Moz I’ve covered: The emotional factors that influence press pickup and virality.The news syndication networks that impact pickup and distribution.How to find the absolute best people and media outlets to pitch.Which topic areas result in the highest success rates for press coverage, social sharing, and link building as well as the outlets that have are most likely to cover data-journalism pitches. These ideas and methodologies are at the heart of the work we do at Fractl and have been instrumental in helping us develop best practices for ideation, content creation, and successful outreach to press. Pulling on each of these levers (and many others), testing, and accumulating data that can then be used to refine processes is what begins to make a real impact on success rates and allows you to break through the noise. If you want to discuss the major takeaways for your industry, feel free to email me at kristin@frac.tl. Did anything surprise you in the data? Share your thoughts below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "\"Study Finds:\" How Data-Driven Content Marketing Builds Links and Earns Press Mentions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "\"Study Finds:\" How Data-Driven Content Marketing Builds Links and Earns Press Mentions"
    },
    {
      "level": "H3",
      "text": "So where do we go from here?"
    },
    {
      "level": "H2",
      "text": "How can I leverage data journalism techniques to earn coverage?"
    },
    {
      "level": "H3",
      "text": "Which outlets most frequently cover data-driven stories from external pitches?"
    },
    {
      "level": "H3",
      "text": "Which topic areas do these publishers write about most?"
    },
    {
      "level": "H3",
      "text": "Which topic areas drive the most links?"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Which domains generate the most links when they pick up a data-driven story?"
    },
    {
      "level": "H3",
      "text": "Which topic areas are the most evergreen?"
    },
    {
      "level": "H2",
      "text": "What this all means"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristin Tynski\n          \n            Kristin Tynski"
}