{
  "url": "https://moz.com/blog/convincing-upper-management-aka-justifying-your-existence-whiteboard-friday",
  "slug": "convincing-upper-management-aka-justifying-your-existence-whiteboard-friday",
  "title": "Convincing Upper Management aka Justifying your Existence - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today we have special guest Marshall Simmonds joining us in the Moz studio to present this week's Whiteboard Friday. Marshall is the Founder and CEO of Define Media Group. He is also a pioneer in the field of SEO, and we are all too pleased to have him present a topic he knows all to well. Having…",
  "content": "Convincing Upper Management aka Justifying your Existence Whiteboard Friday By: Marshall Simmonds May 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Marshall Simmonds May 3, 2012 Convincing Upper Management aka Justifying your Existence Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today we have special guest Marshall Simmonds joining us in the Moz studio to present this week's Whiteboard Friday. Marshall is the Founder and CEO of Define Media Group. He is also a pioneer in the field of SEO, and we are all too pleased to have him present a topic he knows all to well. Having worked for some of the largest online brands, Marshall knows a thing or two about convincing upper management in the value of search. We look forward to reading your comments below. Happy Friday everyone! Enjoy! Video Transcription Hello, SEOMoz fans. Welcome to another edition of Whiteboard Friday. My name is Marshall Simmonds. I'm the founder of Define Media Group. I was formally the Chief Search Strategist of the New York Times and About.com. What I want to talk about today is enterprise search engine optimization, what I've learned from enterprise SEO, and how that corresponds to either startup, small to midsize companies, and how to basically convince upper management that what you do is important and how to justify your existence, which is also what I'm subtitling this little presentation about today too. There are a lot of different schools of thought. Do you need top-down input? Do you need bottom-up input? How are you going about earning your keep? How are you going about justifying and convincing upper management that what you do is a valuable component of search? A lot of times because of the size of the organization or because of just the overall acceptance of what search is and how companies get accustomed to your traffic and to the expectations of the traffic that will technically, they think, always be there. So a lot of times, search unfortunately kind of blends into the background, and what we do blends into the background. Sometimes we don't necessarily have the buy-in that we're looking for. How do you justify that buy-in? Is it a top-down or bottom-up approach? Unfortunately, there isn't really a good answer to that. Ultimately, it does help to have upper management buy-in, but ultimately what we're doing is we're working in the trenches. A lot of what we're doing is having to convince product managers, having to convince certain executives or department heads that what you're doing or what you want to do will help the company from a search perspective. So we have to find certain motivators to find that pain point or that pressure point. What makes a company act? Is it ego? Is it money? Is it traffic? Is it data? What are those factors that get the attention of upper management or a department head? For example, ego is a great way to get attention of an editorial team, because editorial teams are driven by having a lot of exposure, making sure that their articles are prominent, making sure that their name is prominent, making sure that their social profile is prominent. The best way to get somebody's attention is to show examples of failure. Failure is a fantastic motivator when it comes to showing that a competitor may be outpacing you in content creation for a topic or for a piece of content that you should maybe have more exposure for than a competitor does. Money. Money is, of course, an excellent motivator too, because the value of link equity cannot be underestimated. Link equity is the value of your backlink profile. It's imperative that a company understands that backlink profile, that it understands that backlinks are essentially the foundation of a company from a search engine optimization perspective. Every company needs to understand this. It takes a long time to convince a company, to convince upper management that link equity is as valuable as it is. The best way to do that is just to go to the Open Site Explorer. Take a picture, a snapshot, of that backlink profile and put a dollar amount to it to show that if we move content, which is okay, if we redesign or migrate the site, which is okay to do too, it has to be done protecting the empire, protecting the kingdom. That is through link equity, understanding that the monetary value of links cannot be underestimated. We also have to look at traffic. Traffic is a key differentiator too, because it's not ranking anymore in search. Ranking is important, but traffic obviously drives the end result. Social has come on so strong in this round too that it's actually stolen budget. A lot of times in these enterprise organizations, that department is growing at an incredible rate, much faster than maybe the SEO department is. This is where the SEO and the aikido of SEO is really important, because social is so intertwined. I'm sure everybody knows and understands how important it is in the ecosystem of search. Social drives search, drives traffic, drives social. It's this symbiotic relationship that we have to work with social. It's making sure that we are customizing and yet creating a consistent message with social, with PR, with product, with editorial to ensure that best practices are enacted, and that we're using the data that comes from social, because it's really valuable data. The data that we can glean from that user experience and from how our social networks work is incredibly important because it feeds into this data. This data is the last building block as far as the four motivators that I've laid out here. Who gets the reports? We've got an incredible amount of data. Now, as an SEO expert, I can't take that data and put it in front of an editorial team or even upper management. I can of course attach that spreadsheet that I have, but it's pretty deep down the rabbit hole, and that's not worthwhile data. On a weekly or a monthly basis, what's important though is that the editorial team gets a consistent message, a customized message that shows the fruits of their labor, because we want to close that circle. We want to draw the editorial team in and close the loop. What I mean by that is, after they push the publish button, what happens? A lot of editorial teams check out at that moment. But what we need to do is give them data that quantifies and rewards them for their efforts. Sometimes it's going to be the big green arrow going up, and sometimes it's going to be a red arrow, but that's very, very important, simple data that we need to give editorial teams. Upper management though, however, gets the nuts and bolts. Right? They get to see that over a year-over-year basis, what happened to the traffic. Are there certain outliers? Are there prominent sections of the site that have done well, and why, and giving some explanation about that. So, who gets the reports and the data? It needs to be highly segmented. Because of who we are, as far as an SEO is concerned, a lot of times there's not a big barrier. There are not a lot of levels between the head of SEO and the head of marketing, or a CEO, or a CTO. So you may be called to the floor at any point in time to justify why you are doing what you're doing or why something has gone wrong, which it does. You always have to know. You always have to know these four things. You have to know how much what you are doing will cost if you're asking for more budget or if you're asking for an initiative that you're trying to push through. You have to know how much it's going to make, what the traffic potential is, and what's involved. If you can't answer those four questions at any point in time, you're probably not going to get the traction that you're looking for. Upper management has to be able to have some quantifiable number or percentage around these four questions. So you have to have this available at any point in time, because if you don't, you're going to be held accountable for what we've seen in the last year or so. That is something going wrong. Something is going to go wrong in your SEO plan, in your SEO agenda and grand scheme. It's imperative that you have that contingency plan. How do you react to what Panda has thrown at us in the last 14 months? A lot of things have happened, but it's been a huge opportunity for search engine optimization and for the search engine optimization experts. Panda has been an incredible opportunity to push an agenda, because there are always things that we have been barking about for years and years and years that maybe now are basically getting the exposure and the attention that it needs. That's what Panda has been good for. Panda has put a light on a section of our network, of our world that may have needed some attention really bad. The final point is never give up. It may feel like at times you have absolutely no traction, you have no exposure at a company, and the company has no insight into what you are pushing or respect for what you are doing internally. You see mistakes made. You see mistakes repeated. You're giving the same training over and over and there's not a lot of attention or there's not a lot of action as a result of what you're trying to educate on. That's okay. That's going to happen. You have to find quick wins. You have to find the one person, one department that will buy into just a small part of what you're trying to push. Is it just changing a title tag? Is it actually uploading or working with ALT text and images. Is it getting a sitemap, just a basic sitemap. Some of these small little wins can create huge results. That's the point. It's to just not give up on your agenda and understand where your floor is and making sure that you don't go beyond that, but at the same time, looking for whatever win will help drive these motivators, and then essentially justify your existence. I hope this was helpful. I thank you, and I look forward to the comments. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Convincing Upper Management aka Justifying your Existence"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Convincing Upper Management aka Justifying your Existence"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marshall Simmonds\n          \n            Marshall Simmonds"
}