{
  "url": "https://moz.com/blog/convert-goals-into-reportable-metrics-whiteboard-friday",
  "slug": "convert-goals-into-reportable-metrics-whiteboard-friday",
  "title": "How to Convert a Client's Goals into Reportable Metrics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The metrics we show in our reports should be based on our goals, but that leap is easier mentioned than made. In today's Whiteboard Friday, MozCon speaker Dana DiTomaso walks us through the process of converting our goals into truly reportable metrics.",
  "content": "How to Convert a Client's Goals into Reportable Metrics SEO Reporting | Whiteboard Friday By: Dana DiTomaso October 3, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso October 3, 2014 How to Convert a Client's Goals into Reportable Metrics SEO Reporting | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Metrics are really only effective markers of business success if they're measuring your progress toward your organization's goals. How, though, do we make the leap from goals to reportable metrics? In today's Whiteboard Friday, Dana DiTomaso (a partner at Kick Point and a MozCon 2014 speaker!) walks us through that process. Want to see more from Dana? You can watch her presentation \"Prove Your Value\" from MozCon 2014 for free. (If you're looking to turn turn the marketing learning volume up to 11, you can purchase all of the MozCon presentations on that page!) For reference, here's a still of this week's whiteboard! Video transcription Hi, I'm Dana DiTomaso. I work at Kick Point, which is a digital marketing agency in Edmonton. I presented at MozCon 2014 this year, talking about reporting and how people love it so much and how you can make your reporting better. One of the slides in my presentation that people had a lot of questions about afterwards was what you see behind me. This is not my handwriting. It's much better than my handwriting. Left-handers and whiteboards don't mix. One of the things that we wanted to talk in this slide was you can take a goal that the client gives you and drill it down to what you report on in the actual report. The reason why you do this is that you can report on basically everything. That's one of our super powers as a digital marketer. Because of that, it means that you're able to take what the client says are their business goals and turn it into things that you actually report on. Because you're able to do this for a client, they're much more likely to like you, keep paying their bills, keep you around, last company fired when all the contractor budgets get cut, those sorts of things. We find that reporting to clients goals proves your value much more strongly than anything else you could possibly do, including delivering great results, to be honest. Clients appreciate honesty, and they appreciate it when you are able to say, \"This is what we're doing to meet your goals. This is the work and here's how it all fits together.\" You'll have an easier time selling what it is that you do. The client's going to be happy, you're going to be happy, everybody's happy. Let's start with how this works. The idea here is you take the client's goal. When we start with a client, we say to them, \"What are your business goals for this year and next year? Give us all your goals.\" They often say, \"Oh, no marketing company has ever asked for this before,\" which is kind of crazy. So start asking your clients for these goals. Again, that's already a competitive differentiator, and this is before the client has even signed on with us. This is in the proposal meeting. After you've done your research, you can come back to the client and say, \"Here's how we're going to break down your goals into the strategy that we're going to execute on once you sign on the nice dotted line and give us a check.\" I find that definitely doing that research part is an important part of our proposal process. It might be an important part of yours. What we really like to focus on is making that sure we understand all the pieces of how the client's project is going to fit together before we tell them how much it's going to be to execute on it. Because of that, not all clients are like, \"Oh I have to pay you money, and then I have to pay you money again.\" They are kind of confused, but at the same time you have a way better grasp of what's going to happen. There are no nasty surprises like, \"Oh, you paid a company to black hat link building for you. Well, that's great.\" Then you're going to have to revise your estimate, etc., etc., etc. Doing this goal setting as a part of the research process, before you quote on the actual piece, is crucial. If a client doesn't agree to it, we actually don't work with them as a client. I know it means that you get less business, but at the same time you get way better business. Clients who are invested in this process are awesome clients. Back to the goals, this is a real goal from one of our clients -- increase gross sales to $17.5 million in 2014. For this client, to set some context, they have recently cancelled all of their print. They weren't doing any radio or TV. It was just print advertising. They have gone strictly digital. What they're going to get leads in now is word-of-mouth, referral, being known in the industry, and digital marketing. Great, so now we have this goal. The question is: How do we track that goal? What do we need to find out in order to make sure we're delivering on that goal? That gets broken down into KPIs, key performance indicators. That's gross sales, average sale size, and average time to close sale. That's the three things we need from the client. Because we communicate to this client at the very beginning, we can then set up a process to say, \"Okay, so when it's report time at the end of the month, this is the kind of stuff that we need from you.\" The client is ready, able to deliver it right away. It's not a huge turnaround time on the reports. The next thing is tactics. Of course, there are way more tactics than this. This is kind of a broad overview of the tactics that you think about. This includes things like link building or content marketing or outreach or anything like that. What we're looking at right now is: How are we going to deliver, and how are we going to deliver on our end? What is the stuff we're thinking about when we actually do stuff like content marketing? So this helps to sharpen your focus to say, \"All right, we're going to right a blog post about how our client is really awesome at environmental sustainability,\" for example. Then we know that we need to make sure that we're setting up lead tracking and lead scoring and that there's a nice call-to-action at the end of that content piece, because we need to make sure that it turns into leads, and blah, blah, blah. A couple of tactics, use lead tracking to determine the percentage of lead sources per industry and their source. For this client, they want to sell more to specific industries, so we want to make sure that we're tracking that on the form. There is a drop-down on the form, but also people hate self-reporting. They're really bad at it. They often pick \"other\" or \"I don't want to tell you\" or they just don't fill out the form. If you can remove that and then try to get the industry in some other way, either through demographic information. For example, once you get your email address, you can look it up. If it's a client with a low volume of leads, that can be really effective or some other method, and then you can remove that from the form. That helps improve your close rate. Lead scoring to identify high close rate, fast closing leads and their source. What we want to know is not just how many leads did you get, but what were the best leads. Which ones closed the fastest? Which ones gave you the most money? Let's get more of these. We want to find out their source so we can say, \"Wow, that referral campaign we did was really amazing. Let's make sure we do more of that.\" That's the tactics. Next is metrics. This is what are we going to pull out of Google Analytics or whatever reporting method you're using. For example, this could also be a social goal that's related strictly to social media, such as improving share of voice in your industry. In that case, you would look at different metrics like the share of voice. You would look at mentions. There's lots of different stuff that you can look at. For this case, we're looking at lead form fills and specifically the multi-attribution model. I want to take a minute to talk about that. I think that by default, of course, Google Analytics reports on the click before the last click attribution model. What we want to report on is all the different steps that went into that. Annie Cushing had a great quote about this, \"Reporting on last click attribution in 2014 is like buying a football team and only paying the players who score.\" If you only report on last-attribution modeling, the problem is that you are shortchanging yourself. Often, for example, organic traffic is very high up the funnel. We want to make sure that we're getting credit for every touch point that the client makes before they fill out that form. The first time you present multi-attribution modeling to a client, if you aren't doing it already, and if you're not doing it already, then start. I know it takes a little bit of work with customer reporting and stuff, but it's totally worth it. You usually have to sit down and explain to the client. I have used Annie's quote. It works really great to explain how this stuff works. Just sit down with them and show them and actually open up Google Analytics and take them through the model. Say, \"Look at all these different paths. Isn't this crazy? Did you know somebody visited your website 78 times before they filled out form?\" They are often horrified, but also a little confused, as we all are about user behavior on the Internet. I find that it's important to show the client this so that they understand and they get a real appreciation of all the different pieces that come in together. There's very rarely a, \"I clicked on your ad. I filled out a form.\" That's not necessarily a transaction that happens a lot, especially in the B2B space, which is where this client is. Make sure that you're using multi-attribution in all your reporting, that you're explaining it, and that you're giving credit where credit is due, even if it isn't something that you particularly did. Let's say you're not responsible for email marketing. That's a client. Email marketing can be a really important channel, drives lots of leads. No, you didn't do it, but report on it. The client is going to appreciate that. Make sure you use the multi-attribution model. In the report itself, now we know these are the metrics you're going to report on: number of leads; attribute leads to channels, this is really important; and attribute high value leads to channels. This is the golden thing that's going to be able to tell us what is really working well for this client and what we need to focus on in the future. Then, of course, that rolls all the way back up to this goal again. By putting all the pieces together, you can become incredibly valuable to your clients. They appreciate honest, accurate reporting. They appreciate reporting that relates back to their business goals, so then when it comes time for your client's boss to ask questions about why they're paying all that money to the digital marketing agency, they can come back and say, \"Look what they did to hit those goals.\" That should help you out with reporting. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Convert a Client's Goals into Reportable Metrics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Convert a Client's Goals into Reportable Metrics"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}