{
  "url": "https://moz.com/blog/could-google-shopping-feeds-be-a-thing-of-the-past",
  "slug": "could-google-shopping-feeds-be-a-thing-of-the-past",
  "title": "Could Google Shopping Feeds Be a Thing of the Past? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google may have something amazing in the pipeline, an easy entry point into its vast Google Shopping platform. By combining increasingly accurate image detection software with existing structured product data detection, ...",
  "content": "Could Google Shopping Feeds Be a Thing of the Past? Online Advertising | E-Commerce SEO By: Jonathan Ellins May 8, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jonathan Ellins May 8, 2015 Could Google Shopping Feeds Be a Thing of the Past? Online Advertising | E-Commerce SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google may have something amazing in the pipeline, an easy entry point into its vast Google Shopping platform. By combining increasingly accurate image detection software with existing structured product data detection, Google Shopping may soon be open for all eCommerce websites. The Google Shopping platform Paid online advertising offers an additional revenue stream for eCommerce business owners and Google Shopping is arguably the most cost-effective advertising channel. As product images are displayed on Google Shopping, there are far less wasted clicks compared to text ads. These ads work on a pay-per-click basis, meaning that advertisers only pay when the user likes both the look of the product and its price. Example: Once an ad is clicked, the user is sent directly to the matching product page. From there, the product can be bought with minimal effort. As a result, conversion rates tend to be higher. Getting into Google Shopping results Unfortunately, gaining access to Google Shopping isn’t an easy task. It requires a devilishly complicated data feed or API connection that has to be accurate and comprehensive, and it must match up exactly to Google’s pre-set product categories. The need to create this data feed prevents many small and medium eCommerce websites from accessing the Google Shopping platform. Whether due to technical issues or a lack of budget, at the moment it seems that only the bigger eCommerce retailers are taking advantage of Google Shopping. But this data feed hurdle may not be an issue in the near future. Below are the two key milestones that may open up access to Google Shopping to a huge number of eCommerce websites. Milestone 1. Image recognition technology Image recognition is the process of recognizing objects, text, and other information inside a still image. The technology behind image recognition has become very sophisticated in the past few years: Facebook’s “DeepFace” software recognizes faces almost as accurately as humans: huffingtonpost.com/2014/03/18/facebook-deepface-facial-recognition_n_4985925.html The “Janken” robot hand that can never lose a game of rock-paper-scissors with lighting fast gesture detection: bbc.co.uk/news/technology-24803751 A “Yahoo Labs” algorithm that determines whether an image of a person is beautiful or not: medium.com/the-physics-arxiv-blog/the-algorithm-that-sees-beauty-in-photographic-portraits-435ab8064646 Google’s Neural Network team has developed image recognition technology that can detect multiple objects within an image before translating the results into coherent sentences. See some amazing examples below of how this software (called “Google LeNet”) has detected everyday objects, beings, and locations from still 2D images: (Source: googleresearch.blogspot.co.uk) (Source: googleresearch.blogspot.co.uk) This software outputs a full description of an image as if a human being were describing it. As you can imagine, this tool would be a huge help for the visually impaired, and would significantly improve image search engine results. It could also be used as a search engine ranking factor, or even on frames of videos, where it could categorize video content. The results aren’t 100% perfect yet, but this software has massively improved in the past few years. Google LeNet’s classification error rate in 2014 was almost the same as a human’s error rate on the very same images. If the simple product images from eCommerce websites were analyzed, it would be much easier for Google LeNet to figure out what these objects are than typical photographs with a lot of added \"noise\". A standard image of a product centers on the product itself. Backgrounds are commonly pure white so that the product is displayed alone, without distractions. Google Shopping already uses more primitive image processing to detect visually similar apparel products, as shown in the example below. Found on several websites showcasing clothing such as Pinterest, Polyvore, and Kaboodle, this software detects colors and patterns to give useful comparative results: Milestone 2. Structured product data Well-built websites, including most eCommerce websites, take advantage of a content management system to easily add, edit, or remove data. Web pages are built using a small number of templates that output different layouts for different page types. These different page types can include blog posts, category pages, product pages, or information pages—all sharing the same layout preset in the template. Search engines can detect matching layouts of web pages to pick out the unique content. Much of a web page consists of common site-wide areas such as the header, footer, and possibly a sidebar. The useful, unique content typically lies somewhere in the middle of all the duplicated elements: Schema markup helps search engines to make further sense of data placed on a web page. This consists of small hidden tags placed within the HTML code. There are many types of schema categories available that can be used to tag important attributes based on data type. Types of schema include event details, restaurant information, and business listings; and the use of Schema markup can lead to rich snippets appearing within search engine results. There’s even a schema markup for products. It can show prices, reviews, stock levels, and other key information that can appear in search engine results like those in the example below: Google’s structured data highlighter allows product data to be tagged without the need for coding. You simply highlight the data using the online too, which tells Google where to find product attributes such as name, main image, and price. Once a minimum of five product pages are tagged by hand, Google can then detect the common product page template, and apply the tags to all product pages in one fell swoop. Example: Combining image recognition with structured product data Combine image recognition with structured product data, and you have the ability to automatically draw product data from an entire eCommerce website and categorize it appropriately. This is all the data needed for a Google Shopping feed, and it doesn’t require any spreadsheets, dynamic data feed development, or complex API integrations. The user would simply have to highlight the product data structure, and Google would handle the rest. As with AdWords Express, this can be a real boost for smaller businesses that may not have the time, money, or technical knowhow needed to get their products into Google Shopping results. While it may not be as simple to set up as Google AdWords Express, a platform like Google Shopping Express is certainly possible and could be in the pipeline. Potential issues Google Shopping works on a cost-per-click (CPC) bidding system. The higher you bid, the more prominently placed your product listings appear in relevant search results. This means that an increase in the number of advertisers would result in less clicks overall, and/or higher CPC on average. Also, if two or more advertisers are selling the same product, then Google would promote the cheapest item, creating a possible pricing war between sellers. While this would be bad for existing advertisers, the increase in competition would be great for consumers. One last potential issue is that if you wanted to highlight your product data for Google Shopping, each product page would need to display a complete set of product information. This would require clearly showing the SKU, brand name, and stock levels on the product page so that the data could be read and recorded automatically. Conclusion Advances in image recognition technology will soon allow search engines to improve product search results, benefitting both consumers and online retailers. When combined with modern eCommerce websites and Google’s structured data highlighter, image recognition software could allow any online retailer easy access to the Google Shopping platform. It’s not just Google who has built impressive image recognition software, though. Other search engines, social media platforms, and several government organizations have built accurate image recognition software that may have a huge impact on our lives in the near future—both online and offline. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Could Google Shopping Feeds Be a Thing of the Past?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Could Google Shopping Feeds Be a Thing of the Past?"
    },
    {
      "level": "H2",
      "text": "The Google Shopping platform"
    },
    {
      "level": "H2",
      "text": "Getting into Google Shopping results"
    },
    {
      "level": "H2",
      "text": "Milestone 1. Image recognition technology"
    },
    {
      "level": "H2",
      "text": "Milestone 2. Structured product data"
    },
    {
      "level": "H2",
      "text": "Combining image recognition with structured product data"
    },
    {
      "level": "H2",
      "text": "Potential issues"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Ellins\n          \n            Jonathan Ellins"
}