{
  "url": "https://moz.com/blog/covid19-local-search-marketing-business-impact-survey",
  "slug": "covid19-local-search-marketing-business-impact-survey",
  "title": "Take the COVID-19 Local Search Marketing Business Impact Survey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you market local businesses in any capacity, whether in-house or for an agency, please take our quick, supplementary six-question survey. Your answers will help everyone gauge the impacts of the past few weeks on our industry, and hopefully shed some light on planning for the future.",
  "content": "Take the COVID-19 Local Search Marketing Business Impact Survey Moz News | SEO Reporting By: Miriam Ellis May 7, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis May 7, 2020 Take the COVID-19 Local Search Marketing Business Impact Survey Moz News | SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The poet Burns once observed that the best laid plans “gang aft agley.” At Moz, we were about to publish our State of Local SEO industry report, based on our local search marketing survey to which hundreds of you generously replied. Then the public health emergency unexpectedly arose, and we decided to pause in our planning. The findings of the survey, as they currently stand, contain valuable and surprising insights which are as relevant today as they were pre-COVID-19. Yet, in order to reflect the substantial changes the local business community is currently weathering, we are reaching out to you with a timely additional request. If you market local businesses in any capacity, whether in-house or for an agency, please take our quick, supplementary six-question survey. Your answers will help everyone gauge the impacts of the past few weeks on our industry, and hopefully help in planning for the future. We would be so grateful for just a few minutes of your time to be sure the final report reflects the full picture of local business marketing. Take the Survey Now Thank you for your time, and please know that all of us at Moz are wishing your local businesses and agencies well! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Take the COVID-19 Local Search Marketing Business Impact Survey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Take the COVID-19 Local Search Marketing Business Impact Survey"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}