{
  "url": "https://moz.com/blog/crafting-compelling-home-pages",
  "slug": "crafting-compelling-home-pages",
  "title": "Crafting Compelling Home Pages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bare Naked App kindly pointed out that Skype's home page is one of the most compelling, well written homepages ever created. They properly target their audience, make the site fun, easy-to-learn and hard to resist. And, to top it off, the video walkthrough of Skype's service is pr...",
  "content": "Crafting Compelling Home Pages Design By: Rand Fishkin May 9, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 9, 2006 Crafting Compelling Home Pages Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Bare Naked App kindly pointed out that Skype's home page is one of the most compelling, well written homepages ever created. They properly target their audience, make the site fun, easy-to-learn and hard to resist. And, to top it off, the video walkthrough of Skype's service is pretty phenomenal, too. What can we take away from the lessons of Skype and other extraordinary home pages? Know your audience - if you have a product or service that needs no introduction (think Gap, Nordstrom, DisneyWorld, etc.), don't introduce - create desire. Make sure your imagery, graphics and layout are commensurate with the brand space you want to inhabit. Are you Kia (affordable, reliable, better-than-before) or the Cadillac (upscale, statement-making and expensive). Keep it Simple - the home page can't be everything to everyone, but by providing navigation that serves most of the new visitors and makes it easy for returning visitors to find what they need, you server both audiences effectively. Converting a new visitor is far more difficult than retaining a returning user so make sure you put the appropriate effort into each. I also really liked some of the copy-writing advice given by BNA: Trim your sentences to get your message across in the quickest way possible. Adding more words doesn’t make you sound clever and it certainly doesn’t make your app better so again leave them out. A couple of examples of this are: What you write - What you should write At the present time - NowProvided that - IfOwing to the fact that - BecauseIn order to - ToThe majority of - Most... Some folks are already doing a great job in this arena: http://technorati.com/ http://www.last.fm/ http://www.zillow.com/ Some others haven't quite figured it out: http://www.linkedin.com/ - rotating messages that aren't clickable, no compelling story on why joining is valuable, no direct login for returning visitors http://flickr.com/ - If you don't understand what Flickr is, it's not easy to figure out http://www.dell.com/ - They're so ubiquitous, it may be hard to make a case that they're not doing a great job, but I've always been frustrated by the entry page - the segmentation just seems premature and unneccessary. Your thoughts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Crafting Compelling Home Pages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Crafting Compelling Home Pages"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}