{
  "url": "https://moz.com/blog/cre8asites-website-hospital",
  "slug": "cre8asites-website-hospital",
  "title": "Cre8asite's Website Hospital - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The various webmaster and SEO/M forums on the web all offer their own versions of a peer review for member websites, but no one does as good a job as Cre8asite forums with their ...",
  "content": "Cre8asite's Website Hospital Moz News By: Rand Fishkin September 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 13, 2005 Cre8asite's Website Hospital Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The various webmaster and SEO/M forums on the web all offer their own versions of a peer review for member websites, but no one does as good a job as Cre8asite forums with their Website Hospital. There's no other forum on par with the quality, quantity and level of advice and recommendations given by the members, many of whom are considered top experts in the field (Ammon Johns, Kim Krause Berg & Bill Slawski to name but a few). Just for example, whereas many forums have a very closed-door policy and strict rules about site reviews (primarily due to spam), the title of the first sticky at the hospital is \"No Question is Too Dumb\". It almost brings a tear to my eye knowing how sweet and generous the crew is. If you're seeking to have your site peer reviewed by the best of the best, stop by. Make sure you read their Tips on Getting a Better Review and Guidelines before you post, though. These aren't rules so much as recommendations, but the advice is worth heeding. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Cre8asite's Website Hospital"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Cre8asite's Website Hospital"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}