{
  "url": "https://moz.com/blog/creative-diversification-link-building",
  "slug": "creative-diversification-link-building",
  "title": "Creative Diversification — More Hooks and Less Risk for Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To give your link building campaigns the best chance in the outreach stage, you need to ensure there is enough creative diversification during the production process, especially for data-led pieces and surveys.",
  "content": "Creative Diversification — More Hooks and Less Risk for Link Building Link Building | Advanced SEO By: George Driscoll August 19, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: George Driscoll August 19, 2020 Creative Diversification — More Hooks and Less Risk for Link Building Link Building | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As digital PRs we can often get stuck with our \"campaign goggles\" on, especially in the ideation and production stage of a creative campaign. By this I mean, you have a preconceived idea of where you'd like your campaign to be featured, what kind of headlines you want it to achieve, and how people should read your data and story. As we all know, we can't control the outcomes of a campaign, but we can certainly push them in the right direction. To give your link building campaigns the best chance in the outreach stage, you need to make sure there is enough creative diversification during the production process, especially for data-led pieces and surveys. This opens up your \"journalist pool\" and gives you a ton more people to outreach to with a potential interest in your piece. What is creative diversification? Creative diversification is how you minimize the amount of risk in your link building campaign by ensuring your idea has enough breadth during the production process. It doesn't matter what format you’re using for each campaign — you always need to confirm it’s diverse enough to stand up in a changing news landscape. You want to develop an idea that can naturally explore multiple angles and sectors in the outreach phase. This flexibility needs to be set up before production, by exploring the potential outcomes and headlines you’re going after before you have them. Find related topics In the production stage, we obviously need to focus on our fundamental topic. This is often the domain's main reason for being. It could be finance, travel, fashion — you get the picture. Then you want to start branching out and overlaying topics: finance + students, travel + safety, fashion + Elon Musk, and so on. You’re attempting to grab subtopics of interest. Every link builder will have a different approach to discovering these topics, but the simplest way to get started is to grab a piece of paper and start scribbling ideas by word association. Just write as much as you can and you’ll find there’s lots of closely-related topic areas your content could delve into. (Tools like BuzzSumo would be invaluable here, but if you’re after a free alternative, I have been enjoying playing with AlsoAsked.com lately for related topic inspiration. Nothing is going to beat existing news content, though.) It's also crucial to think about topic relevance, because if you question a tenuous link between your domain and topic matter, you can be certain journalists will, too. Link relevance is a whole other conversation to be had, but as long as it aligns with your client’s goals and you’re happy with showing them the link/coverage in full, you can’t go far wrong. As a team at Root, we scrutinize our data points and approaches a lot in the production phase of each campaign and we find that championing personal expertise and curiosity often leads to some interesting statistics. My own passion for veganism gave us a unique angle which proved fruitful when we went out with a third round of outreach for our recent COVID-19 spending campaign. Take off your campaign goggles If the idea for your new campaign was born from your mind, you’re emotionally and personally invested whether you like it or not. You’ll need to put these feelings aside to engage with as many potential angles as possible from the start. When I say you need to take off your campaign goggles, you need to (preferably with a colleague) tear apart the campaign and think about where you can add further value. It's best to approach this objectively, so if you can tackle a colleague’s campaign and vice-versa, even better. Some link builders will look at their angles and opportunities only once the content has been created and consider it an outreach decision. Success is definitely possible this way, but you’re stopping yourself from being as successful as you might have been had you thoroughly drilled into your content before and during the production process. Highlight the key areas and approaches you'd like to tackle beforehand and you can feed this into your outreach strategy later on. Make sector-specific data for journalists When creating media lists and discovering relevant journalists, link builders can often be encouraged to rush through and ignore the content itself. If you know what they’re writing about, both on Twitter and in publications, you can begin to think about what data you could craft specifically for them. In the campaign I mention in this blog, we focused on side-hustle data related to the fundamental topic of how people are earning their money during the pandemic, which was directly influenced by journalists. The journalist who covered this specific topic in USA Today fortunately tweeted a lot about the stories he was working on, so it made it incredibly easy for us to tailor some content toward his interest and later offer him the type of unique data he wanted. Aside from keeping tabs on Twitter, you can also find out what they’re interested in through Google Discover and Reddit to understand what’s being talked about and what is topical. I know many digital PRs review key publications directly on a regular basis and have big Feedly feeds or watch insight roundups on YouTube instead. Either way, thinking about what a journalist will need in the next few weeks is imperative to early planning and ensuring your campaign is diverse enough from the get-go. Diversify outreach with hash URLs Another way you can make certain your content is diversified and prepared for a breadth of outreach is through the use of URL fragments or \"hash URLs\". In the case of our coronavirus spending research campaign, we used article hooks on the page to provide anchor links from the table of contents at the top which then allowed us to offer another layer of personalization. The key findings or headlines section in a table of contents is an essential piece to any long-form data campaign and makes it incredibly easy for journalists and readers to find the most relevant statistics to them in literally seconds. If you’ve never implemented this yourself, there’s a simpler way than hooks — you just need to know your HTML basics. (Please excuse me if I butcher this description as a non-dev!) Place id=\"#subject\" within the heading tag, so it would look like: <h2 id=\"#subject\">. In the example below, a BBC journalist used the URL with \"#vegetarian\" when referencing our statistics about plant-based food usage. This came from the ID tag and meant the journalist could link directly to the bits of research that was relevant to their article. On top of that, we could send journalists semi-personalized links in our outreach, too. It’s a win-win and is best practice for users and search engine crawlers to navigate your long-form content anyway. This is a literal manifestation of your creative diversification process early on, as it’s now been produced and each hash URL is an extra asset pointing journalists to the most relevant data for them. Creative diversification in action The campaign I’ve mentioned in this piece was a lengthy, yet simple, survey campaign for a fin-tech client asking Americans about their spending habits during the pandemic. We secured a range of coverage, but the three biggest placements we landed (BBC, CNBC, and USA Today) all covered different angles and data points from each other, but from this one survey, and that wasn’t an accident. In the production stage, we knew we needed to focus on the campaign fundamentals: spending during the pandemic. Our related topics led us to grocery store spending and another leap encouraged us to look at food choices (were American’s eating more veg during lockdown? Hmm). These topics were still closely related to our core focus (finances) and therefore useful for our outreach in terms of securing relevant and high quality links. When it came to the outreach strategy, we prioritized landing placements tied directly to the campaign fundamentals, then the related topics fed into the consecutive rounds which we chose depending on the strength of the data we received from the survey. If you’re thinking in the production process that there’s too much going on with too many angles, you may have just created multiple mini content campaigns for yourself. We’ve found time and time again that the simpler stories and slimmer, more targeted outreach emails will land placements way more often than bloated emails trying to offer up far too much content at once. That’s not to say that you should automatically split up larger pieces of content, but your outreach should be the final step in diversifying your piece. A data analysis research piece that taps into multiple sectors should simply highlight the most relevant information to the journalist in bite-size sections. We gave grocery spend data to retail business journalists, vegan food consumption data to food writers, and side-hustle data to those writing on the latest employment trends. The next time you’re creating a content campaign, have your team (even if that’s just you) ruthlessly find new sectors, journalists, and angles to target, to ensure your next piece is as diverse as possible. Creative diversification = more hooks and less risk. To help us serve you better, please consider taking the 2020 Moz Blog Reader Survey, which asks about who you are, what challenges you face, and what you'd like to see more of on the Moz Blog. Take the Survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Creative Diversification — More Hooks and Less Risk for Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Creative Diversification — More Hooks and Less Risk for Link Building"
    },
    {
      "level": "H2",
      "text": "What is creative diversification?"
    },
    {
      "level": "H2",
      "text": "Find related topics"
    },
    {
      "level": "H2",
      "text": "Take off your campaign goggles"
    },
    {
      "level": "H2",
      "text": "Make sector-specific data for journalists"
    },
    {
      "level": "H2",
      "text": "Diversify outreach with hash URLs"
    },
    {
      "level": "H2",
      "text": "Creative diversification in action"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Driscoll\n          \n            George Driscoll\n          \n            George Driscoll"
}