{
  "url": "https://moz.com/blog/creating-right-marketing-mix-whiteboard-friday",
  "slug": "creating-right-marketing-mix-whiteboard-friday",
  "title": "Creating the Right Marketing Mix - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From search ads and SEO to display ads, content, and your social efforts, there's a lot to consider when creating the correct marketing concoction. In today's Whiteboard Friday, Rand goes over advice on how and why you should be auditing your funnel to ensure you have a balanced, effective…",
  "content": "Creating the Right Marketing Mix Marketing Industry | Whiteboard Friday By: Rand Fishkin January 22, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 22, 2016 Creating the Right Marketing Mix Marketing Industry | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From search ads and SEO to display ads, content, and your social efforts, there's a lot to consider when creating the correct marketing concoction. In today's Whiteboard Friday, Rand goes over advice on how and why you should be auditing your funnel to ensure you have a balanced, effective marketing mix. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about how to balance your marketing mix. Specifically, I want to talk a little bit more about search ads and SEO versus kind of content and social, those traffic channels that you invest in, either paid or organic, that can drive traffic kind of more at the top of the funnel or more in the conversion process. But this is actually a complex equation, and the marketing mix overall is something that a lot of folks struggle with and that I find a ton of misplaced energy and misplaced dollars happening. So the way to solve for this, in my opinion, is we can start with a pretty simple auditing process. We can ask ourselves kind of strategically, \"Where are we facing funnel challenges?\" Determining where your funnel challenges are. I see lots of businesses — from tiny, small startups and small businesses on the web to giant companies — having this issue where they say, \"We have a problem with the consideration and comparison phase. We feel really good that people are aware of our brand, and they come for that first visit. They come back for the return visit. But then they get to the consideration phase and we feel like we're losing out against our competitors right there before conversion happens.\" Well, guess what? If you're spending all your marketing dollars on display or on offline forms of display marketing, which go to awareness, and very little in the consideration and comparison set, where things like search can be great, especially your brand versus competitors, or your competitor versus your own brand, or features, or what to buy, or recommendations, or reviews, all those kinds of things, ranking for that stuff, buying those key terms, having content that serves them and maybe doing some display advertising to people who've already been to your website through a retargeting that's trying to convince them, well, all of those forms of marketing can reach that set. But the problem is you're spending all your time and energy, and people, and dollars up in awareness. I see this across the board. I've seen people spend a ton on first visit and return visit, and nothing on recidivism and retention. I've seen them spend a ton at the point of conversion, but nothing up here to drive awareness. So they have a great-looking funnel for a very small number of people. If you know where you have this problem, if you can identify where your issues lie, then you can invest in the right channels. You can change up your marketing mix and your people, your time, and your dollars accordingly. Also, don't be too narrow. My view here is a little bit narrow. But you should consider whether channels like community building, email marketing, offline advertising, or in-product, in-app marketing can actually be part of this mix and how they should be part of this mix. I don't want you to limit it just to search, social, content, display. There's a lot of opportunity there. Validate that your investments can actually move the needle. You can invest a lot of time and energy, and dollars, and people into one of these channels to try and move the needle on something, and get what look like good results in the channel itself. Like, \"Oh, search is driving lots of traffic.\" Or, \"We have high rankings.\" Or, \"We are spending a lot on this display channel, and we're seeing lots of people visit.\" But then, when you actually dig in, you see that you're not moving the needle on what you need to. You're not improving the problem that you have in your funnel. So you might ask: \"I've got a retargeting ad or a whole set of retargeting ads. Are we effectively improving conversion rate, or are we just bringing people back to the site? Which was our goal? Were we doing retargeting to earn return visits? Or are we doing retargeting so that we can increase conversion or so we can improve consideration and comparison against the competition?\" \"Is this piece of content, or our content strategy overall, or the tactic of producing a daily blog post or a monthly report, or a white paper every quarter, is that reaching a broad enough audience? Is it targeting enough of our visitors and their influencers? Is it driving return visits? Is it driving conversion? Is it getting us a lead that we can then follow up with? What's happening there?\" You can ask that question in SEO and in PPC as well. Does ranking for this keyword bring in the right qualified potential traffic? Does it bring us enough? Are we ranking for a keyword where, you know what, it sounds like a great keyword and it would convert great. But we're not getting enough people because Google has a knowledge graph and an instant answer up top. So the keyword opportunity score is way down low in the toilet, and it's just not going to drive any traffic. So maybe we need to expand that keyword set. Maybe we're doing great with SEO, but we need to do more of it for different keywords. If you are doing this auditing process and you identify whether the tactics are actually moving the needle in the places you think they are, you can now move on to, \"We know our funnel problems, where they exist, where they don't. We know which tactics work and don't.\" Analyze your resource allocation to match against the problems and ROI. Now we can say, \"You know what? Let me look at my marketing mix. Let me look at my resource allocation and say, 'Oh, maybe I'm putting 20% of my budget to display and 18% to paid search. Maybe I'm putting 15% to offline, and I'm putting 12% to social and 8% to content.\" Whatever the numbers may be, \"Is that the right mix? Does that effectively sound like it's doing the right things over here, or should I be changing this up?\" Should I say, \"Huh. You know what? We saw that we have a bunch of opportunity in SEO, or we have a bunch of opportunity in content. We have a lot of time and energy and people being spent in display. Could we put that on autopilot for a little bit? Let our display run for a quarter. Maybe do a weekly or monthly check-in from one person. But ask those people to go concentrate on content, and then have our SEOs help them become sophisticated and savvy with how to promote that content.\" Maybe. Maybe you can. The questions I like to ask in the resource allocation phase are: Are any of these already purely on autopilot? Are they just sort of running and they haven't been audited? Because that can speak to why the tactic isn't working, or why it's not targeting the right phase of the funnel. How many people and hours, not just dollars are going to each? Because a lot of folks, when they look at their marketing budget from a CFO level or a chief marketing officer, they'll look purely at the numbers, not at the people. That can be very dangerous too, because if you say, \"Hey, we've got a bunch of our budget is allocated to display. We have almost no budget to allocate it to SEO. But that's intentional because SEO is a free channel.\" Ahh. Pull out your hair. That's crazy. Or the only dollars that we have assigned to it are our SEO consultants, rather than people and hours, and time, and energy, which is what you need to be successful with an inbound marketing flywheel, like the content, search, social, email, community system. Are any of these maxing out? If you're seeing that you're putting more dollars, more time against them, but you're getting lower and lower ROI over time, that could be a sign that you're sort of maxed out in that channel, and you either need to get more creative on how you're reaching more people, or you might think about switching some of that expenditure of time and people and dollars. Then, finally, do any of these have tracking or data issues? I find that in a huge number of organizations the reason they're not solving the funnel challenges that they want to, and pursuing poor tactics and not investing in channels like search and social and content, is because they have no good way to measure it. So the first step might be admitting, \"You know what? We're bad at measuring the ROI of content. So that's the first thing we have to do.\" We have to be able to say, \"Did someone come to visit us for the first time from a piece of content? What happened in the 90-day window, or 120-day window, whatever the cookie lasts, however long we can make the cookie last? Did we see that person come back again and go to consideration and comparison phase, or go to conversion, or become more of a recidivist for our products or a highly-retentive customer who's subscribing to us?\" If the answer to those things is yes, then you know what? Data is the place to invest. When you do that, then you're able to effectively allocate your marketing channels. So hopefully, this will kick off an exercise in audit for many of you. I'd love to hear from you in the comments with your shares about places you have reallocated dollars, places you've seen present lots of opportunity or present poor opportunity. Then, I'd love to see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Creating the Right Marketing Mix"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Creating the Right Marketing Mix"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Determining where your funnel challenges are."
    },
    {
      "level": "H2",
      "text": "Validate that your investments can actually move the needle."
    },
    {
      "level": "H2",
      "text": "Analyze your resource allocation to match against the problems and ROI."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}