{
  "url": "https://moz.com/blog/creating-local-seo-welcome-for-non-locals",
  "slug": "creating-local-seo-welcome-for-non-locals",
  "title": "Creating a Local SEO Welcome for New Neighbors and Travelers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Attribution, reviews, and location data management: 3 hugely important things when attracting non-local visitors to your business. Learn how and why your local SEO strategy must welcome newcomers as well as established residents.",
  "content": "Creating a Local SEO Welcome for New Neighbors and Travelers Local SEO By: Miriam Ellis December 21, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis December 21, 2016 Creating a Local SEO Welcome for New Neighbors and Travelers Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In our ongoing quest for local prominence, are we leaving anybody out in the cold? For years, a fundamental message I’ve shared with almost every incoming local business client is that they need local SEO, specifically, because they need to be found on the web by local people. I’d estimate that 98% of everything our industry writes about is tied to this concept, and while this focus is sensible, today I’d like to highlight an underserved (but enormous) target local market: non-local people. Consider these statistics: According to the U.S. Census Bureau, 40,093,000 residents move annually — averaging 14.19% of the population. According to AAA, 35% of US families planned to take a vacation of 50+ miles in 2016. According to the Global Business Travel Association, Americans took an estimated 488.1 million business trips in 2015 — that’s 1.3 million work-related trips happening every day of the year. These numbers create a context in which there are literally millions of consumers arriving in unfamiliar towns on a daily basis, in need of a variety of local resources they'll discover using the Internet. In this article, I’d like to help your local business get discovered with a welcoming, supplementary local SEO strategy based on the understanding that newcomers matter. We’re going to dive into location data management, attribution, and reviews, with an eye to newcomer needs. Want to learn more about Local SEO firsthand? Join the experts — grab your tickets to MozCon Local, February 27th & 28th in Seattle! Register now! What do newcomers really need? Residents of your city or town have likely already established their favorite restaurant, grocery store, doctor, school, place of worship and pet supply shop. While there are certainly tactics you can employ for trying to edge out the competition to become someone’s new favorite destination, chances are good that longtime locals won’t have too much trouble actually locating you at 123 Main St. if you’re doing good, essential local SEO. They already know where Main St. is in relationship to other streets, how long it will take to get there and, if they’re established neighbors, what the parking situation is like in that part of town. Non-locals know none of this. Your city is a blank slate to them, and they’ll be using their desktop and mobile devices to start filling in that slate to create a picture of their destination, both before and after they arrive in town. If you’re not providing the necessary signals to foster transactions with newcomers, if they never learn that your local business exists, it’s a direct hit to your wallet, week after week, year after year. Which types of local businesses need to appeal to new neighbors and travelers to avoid foregoing desirable revenue? Let’s break that down by industry: As we can see, a significant number of industries can serve either new neighbors or travelers, and in some cases, both. Let’s look at three intelligent ways to put out the welcome mat for these important consumers. 1. Basic location data management While settled residents may be able to parse out that your business is actually located on 5th Street rather than 5th Avenue when encountering inconsistent data about your company on the web, don’t expect newcomers to inuit this. Step one in welcoming this user group is to ensure that you’ve got your core name, address, and phone number (NAP) correct in two places: A) Your website For the single-location business, this should be easy. Audit every page and element (like the header and footer ) of your website where you mention any part of your NAP for accuracy. Correct any errors. Pay particular attention to your branding. Don’t be The Tree Restaurant on your Contact Us page, The Green Tree Restaurant on your About page, and Green Trees Cafe in your logo. You want to make a cohesive brand impression on your website so that consumers can clearly match it to your real-world signage as they drive through town. For multi-location businesses, things are a little more complex. In addition to checking that NAP is correct on each of the landing pages you create for each location, be certain those pages are accessible via a well-functioning store locator widget which enables users to search by city (not just by zip code, as most newcomers will not know local zip codes). B) Your local business listings Hopefully you're already engaging in active location data management of your local business listings/citations to help local consumers find you, but know that inconsistencies on major platforms could result in particularly heavy newcomer losses as users get misdirected, lost, and drift away, never to return. You want a clear NAP dataset on the most important platforms, keeping in mind that even if a particular platform isn’t that popular in your own city, it may be significant in the regions from which newcomers hail. You can do a speedy citation health check for free using the Moz Check Listing tool, which audits your listings on foundational platforms like Google My Business, Bing, Apple Maps, Yelp, Facebook, etc. Correct any inaccurate data the tool surfaces for you, and back up this work with a manual check of any niche directories that apply to your city or industry. If you find you’ve got significant inconsistencies, or have a large number of locations to manage, you may want to consider purchasing an automated location data management service like Moz Local. Beyond basic NAP In addition to managing the NAP on your website and citations, there are 5 elements that are crucial to ensuring newcomers connect with your business: Driving directionsBe sure directions and map place markers are accurate on your major citations and, for newcomers, put additional effort into writing up the best possible set of driving directions on your website. Write them out coming from the four cardinal directions and be sure you are associating your business with any major local landmarks that are easily seen from the road. Alert consumers to the presence of hazardous road conditions they may encounter coming from a particular direction and offer detours or shortcuts. Don’t leave out how to navigate large shopping centers if you’re located in one. Hours of operationIt’s especially important if your business has seasonal/holiday hours to ensure that you are updating all relevant pages of your website and all of your major local business listings to reflect this for newcomers. If your business is seasonal (like a farm stand or pumpkin patch), set your Google My Business hours when you open for business, and when your season closes, remove them so that they appear ‘un-set,’ with the plan to re-set them next open season. If you have special hours for Christmas or other holidays, follow these directions to avoid Google stamping your listings with a warning that the hours may be inaccurate. Parking informationUrban parking can be so appallingly complicated that it has led to the launch of booking services like Parkwhiz, but be sure you’re detailing parking information on your own website, regardless of city size. Don’t forget RV parking accessibility for travelers, whether parking is free, or if paid, the forms of payment local meters/lots accept. Parking info can be especially helpful for people with health concerns, so if on-site parking is unavailable, estimate how far the consumer will have to walk to reach your destination. A lack of parking data once caused me to have climb over cement barriers in a split-level parking lot in search of a salad on a 90+ degree day — it would have been courteous for the grocery store to have saved me from this silly situation with clear directions. DescriptionGoogle may have replaced their former owner-authorized business description display with their in-house custom description, but most other local business listing platforms still allow you to pen your own. To play to a newcomer audience, which may be forming a very fast impression from your listings via a mobile device, pack your descriptions with the most persuasive information you can think of to help them make a decision. Is it that you’re kid-friendly, carry a certain brand, won a best-in-city award? In the fewest words possible, highlight the most impactful elements of your business to connect with high conversion, targeted newcomers. Forms of paymentFailing to inform travelers that your business is cash-only is a deal-breaker, and many major retailers now even refuse to accept checks (which can come as an inconvenient surprise to out-of-towners). Numerous local business listings enable you to specify forms of payment accepted, and you should also at least include a visual representation of supported transaction methods on your website. For your most sophisticated consumers, if you support digital wallets, Bitcoin, or other popular payment alternatives, be sure to highlight this fact. I recommend that you give first priority to getting your basic location information into beautiful shape on your website and local business listings so that the process of finding your business is as foolproof as possible for newcomers. Now let’s look at some elements that can influence being chosen once you’ve been found. 2. Attribution It’s no secret in the local SEO industry that Google, Yelp, and other powerhouses are now actively crowdsourcing attribution from reviewers, but if local business attributes are new to you, let’s summarize. Basically, attributes are snippets of descriptive content that differentiate the nature or features of a given business. Some of the data in the previous section would actually be considered attributes, such as whether a business features free parking, accepts Apple Pay, or offers 24-hour services. In practice, attributes are valuable to search engines in helping them determine the relevance of a result to a given user, and they’re valuable to users in helping to make decisions about whether a specific business provides exactly what they’re seeking. Significantly, in May of 2016, Google rolled out version 3.0 of the Google My Business API, a new feature of which is the ability for developers to directly add attributes to Google My Business listings. And, as the year closes out, many users are finally seeing promised attribute functionality within the Google My Business dashboard. We can take all this as a clear signal that Google is zooming in on attribution, which they base on business categories. While dashboard attribution is still limited as of writing this, I predict we’ll see it expanding in 2017. To conceptualize the practical application of attributes, I find it’s helpful to imagine consumer personae. Let’s hypothesize that our restaurant franchise is hoping to win a transaction from a group of six travelers on a family vacation. They are on the road a bit late one evening near one of our locations and are hungry for supper: Dad would be glad to find an all-you-can eat buffet. Mom would love to hear some live music. There are three children; one is gluten-intolerant, one is a vegetarian, and one is a toddler who needs a booster seat and can’t eat full portions. Grandmother urges that they find a salad bar because everyone has been eating too much fast food on this trip. The dog would prefer not to be left in the car all evening. Look through this very abridged list of Google My Business API attributes applicable to restaurants to see if you can match them to the family members (hey, this is like a game!): If some or all of these attributes describe our restaurant location, and we’ve either added them to Google My Business or are earning them from our reviewers on Google, Yelp, or Trip Advisor, we’re making a strong case for being shown as a relevant answer to the family’s search query, and to being chosen by them. Good start! But, I’d like to take the concept of attribution one step further as it relates to local SEO. I’m not privy to the methodology Google used to come up with their extensive list of attributes for all sorts of business categories, but I’d invite local enterprises and agencies to view attributes as a fascinating roadmap to website content development. Imagine taking the above set of descriptors and writing something like this, in natural language, on the website landing page for our restaurant’s location in Santa Fe: What we’ve done here is to take Google’s attribute hints as to what consumers are looking for and have turned them into a statement that helps a newcomer make a quick, informed mobile decision (call it a ‘micro-moment’ and you’re really being cool!). For thoroughness, I would recommend combining Google’s attributes with those you are personally prompted to enter when leaving your own reviews on various platforms, and fine-tune it all based on your unique expertise drawn from serving your customer base. It could be that a driving motivation for newcomers to your city and business would be proximity to a point-of-interest, accepting mobile payments, or serving organic food. Think of attributes as clues from search engines, review sites, and directories that you can pass along to customers to qualify your business as the answer to their needs. Finally, I’d like to take the exploration of attributes one step further. I reached out to TouchPoint Digital Marketing owner, David Deering, who is one of our industry’s foremost experts on local business Schema. I asked if there was a direct relationship between attributes and Schema, and he explained: “Unfortunately schema.org does not have corresponding properties and values for local business attributes. But there are ways to mark them up anyway. Some are rather straightforward and others take a little more coding but they all can be marked up in one way or another. Schema.org recently added the \"amenityFeature\" property for the Place type (which includes the LocalBusiness type) and for LodgingBusiness of which Hotel is a subtype of. So a local business can do something like this to say that it offers free parking, free wifi, that it's wheelchair accessible and so on: \"amenityFeature\": [ { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Free Parking\", \"value\": \"True\" }, { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Free WiFi\", \"value\": \"True\" }, { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Wheelchair Accessible\", \"value\": \"True\" }, { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Serves Breakfast\", \"value\": \"True\" }, { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Has All-You-Can-Eat Buffet\", \"value\": \"True\" } ], By the way, that is the structure that would need to be used if a business was marking up more than one amenity or attribute. A hotel could also do something like this to mark up the fact that they have an indoor swimming pool that is open everyday from 7 AM to 10 PM. It's possible that a similar structure could be used to mark up, say, Happy Hour (I guess that depends if a restaurant's Happy Hour could be considered an \"amenity\" or not. I'm not sure.). \"amenityFeature\": { \"@type\": \"LocationFeatureSpecification\", \"name\": \"Indoor Swimming Pool\", \"hoursAvailable\": [ { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Sunday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Monday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Tuesday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Wednesday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Thursday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Friday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" }, { \"@type\": \"OpeningHoursSpecification\", \"dayOfWeek\": \"http://schema.org/Saturday\", \"opens\": \"07:00:00\", \"closes\": \"22:00:00\" } ], And schema.org does have a direct and simple way to mark up the fact that a restaurant accepts reservations and whether or not smoking is allowed. It would simply be: \"acceptsReservations\": \"True\", \"smokingAllowed\": \"False\", The same goes for if a hotel or lodging business allows pets: \"petsAllowed\": \"True\", Now how much of this Google and the other search engines will use, it's hard to say. But it certainly can't hurt for a business to mark up their attributes and amenities on their site. If a website's markup matches the attributes they've included on their Google My Business listing, I think that can only help. And we never know what Google will begin pulling out of a site's structured data to use for something, so I stick by my motto: Mark up as much as possible and be as thorough as possible.” In sum, in markets where you are looking for a competitive edge, exploration of thorough Schema amenity markup can dovetail, and might sometimes even correlate, with attribution development, enabling you to define features of your business is way your competitors may be overlooking. 3. Reviews Here on the Moz Blog, we’ve previously discussed the vital importance of giving special treatment to reviews and testimonials on your website. And, as for reviews on third-party websites, I’m going to make a guess that you’ve already seen studies like this one indicating that a whopping 92% of consumers now read online reviews. Most recently, we’ve covered how to make maximum use of the owner response function available on many review platforms as a form of customer service, reputation management, and free marketing. But there’s a subject we haven’t yet broached regarding reviews that is highly relevant to serving newcomers, and which recently came up in an exchange I had with Phil Rozek surrounding his excellent article, If Nobody in Your Area Cares About Yelp, Should You Still Bother Getting Reviews There?. Phil brainstormed 7 great reasons for caring about review giant Yelp, including the visibility of Yelp in-SERP stars for your brand searches in Google, and the fact that Yelp feeds reviews to a number of other important platforms like Apple Maps and Bing Places. What I added to Phil’s list is that, even if Yelp isn’t big in your town, it may be huge in the cities from which your newcomer customers hail. Surveys have repeatedly cited that Yelp is a much bigger deal on the coasts than in the interior United States. Yet, imagine a large hotel located within 3 miles of the newly-built Minnesota Viking’s U.S. Bank Stadium in Minneapolis. Local people may not be leaving a ton of Yelp reviews of this hotel. Now, imagine that the San Francisco 49ers (having a MUCH different season than this one) are playing in the NFC Championship game at U.S. Bank Stadium on their way to Superbowl glory. San Franciscans are about to pour into Minneapolis, and they’ll be looking at Yelp in extraordinary proportions to find a hotel. If our hypothetical lodging facility has neglected Yelp because it’s no big deal in their home city, they could be losing out on a very lucrative moment. This scenario is applicable to all third-party review platforms and all relevant local businesses located near major points-of-interest or event sites. This past summer, Wesley Young used his hometown of Frisco, TX to estimate that that 33% of local commerce was generated by non-locals. Meanwhile, here’s an interesting map of the places Americans were moving to and from in 2016. I would recommend that all local businesses consider gathering intel as to the cities that send them the most newcomers, and the review platforms most used in those cities of origin, to be sure a strong reputation is being developed there. Completing the welcome In addition to utilizing local business listing data management, attribute-driven website content, and city-of-origin review management to attract newcomers, here are a few more things you can do to round out the welcome message: If you’ve discovered that certain cities tend to send your city of location a significant amount of newcomers, geotarget paid advertising to be shown to that demographic. Your resident local customers may have the leisure to research your business from their desktop computers, but most of your traveling customers will be on their mobile devices. The quality of the mobile experience your website provides is especially critical to this user group. Most good-sized towns and nearly all cities have welcome centers or tourism boards, many of which produce print materials for visitors. Consider advertising in these publications if your industry is included in my above infographic on local needs. And, if you print your own brochures, seek to have them included in the lobbies of as many local hotels and other businesses as possible. Consider offering a new neighbor discount if you’d like to capture this demographic. Businesses like the Welcome Wagon have been facilitating this form of advertising for almost a century. Or, be your own welcoming committee utilizing both print and social media to promote one-time discounts for new homeowners in your area. Look for tie-in opportunities with other local businesses. If our hypothetical family of 6 vacationers dines at Salsa Roja restaurant, could your auto garage, pottery shop, or swim center advertise on the back of the menu, alerting the family to your existence for tomorrow’s things-to-do agenda? How about getting a coupon code included in that ad, or doing some other form of cross-promotion with the restaurant? Speaking of things-to-do, realize opportunities for publishing best-in-city guides to a particular subject that ties into your business model. For example, a gift shop specializing in nature-themed merchandise near a state or national park could write a wild bird guide listing species to be spotted in the area. A gym could publish a guide to the healthiest restaurants in the city or the best places to run. A pediatrician could write about fun places to take kids in their town. A cell phone store could map out areas of highest connectivity in a rural area. A key benefit to this type of relational topic development will be brand discovery by new neighbors and travelers while they are engaging with the useful content. If your business is tourism-based (like a hotel chain), it’s likely you are already implementing most of these techniques, but it’s my hope that this article will have helped many more industries consider how crafting an appeal to new or non-locals is both applicable and savvy. At the opening of this piece, I called this a ‘supplemental’ local SEO strategy, to be implemented as appropriate in addition to all you are already doing well to serve your resident population. The amount of resources you devote to this supplemental effort should be based on a) research as to the number of newcomers and tourists your city receives annually and b) the need for your business to distance itself from competitors with a superior effort. If your findings are good and your need to compete is strong, why not make 2017 the year you extend a well-planned welcome to your share of those millions of consumers who will be on the move? Hankering for more Local SEO knowledge? Don't miss MozCon Local, February 27th-28th in Seattle: Register now! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Creating a Local SEO Welcome for New Neighbors and Travelers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Creating a Local SEO Welcome for New Neighbors and Travelers"
    },
    {
      "level": "H2",
      "text": "What do newcomers really need?"
    },
    {
      "level": "H2",
      "text": "1. Basic location data management"
    },
    {
      "level": "H3",
      "text": "A) Your website"
    },
    {
      "level": "H3",
      "text": "B) Your local business listings"
    },
    {
      "level": "H3",
      "text": "Beyond basic NAP"
    },
    {
      "level": "H2",
      "text": "2. Attribution"
    },
    {
      "level": "H2",
      "text": "3. Reviews"
    },
    {
      "level": "H2",
      "text": "Completing the welcome"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}