{
  "url": "https://moz.com/blog/create-enviable-customer-experience-mobile-web-searchers",
  "slug": "create-enviable-customer-experience-mobile-web-searchers",
  "title": "How Your Brand Can Create an Enviable Customer Experience for Mobile Web Searchers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Make customer experience a priority by delivering the content mobile web searchers are looking for when they need it most.",
  "content": "How Your Brand Can Create an Enviable Customer Experience for Mobile Web Searchers Mobile SEO By: Ronell Smith October 5, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith October 5, 2016 How Your Brand Can Create an Enviable Customer Experience for Mobile Web Searchers Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Here I am, seated in a Manhattan, New York restaurant, staring at corned beef hash that looks and tastes like what I imagine dog food to look and taste like. Not very edible corned beef hash I'm pissed for two reasons: It cost nearly $25 and was entirely inedible I should have known better given the visuals depicted after doing a Google image search to find the dish, which was offered at a nearby restaurant In retrospect, I should have checked A and B on my phone before ordering the $25 plate of Alpo. And though I didn't do that, other would-be customers will, which means the business owner or SEO had better follow the steps below if they wish to stay in business. The bad news is I no longer relish the thought of eating at high-end NY restaurants; the good news is this experience totally reshaped the way I view mobile, opening my eyes to simple but very effective tactics businesses of all types can immediately put to use for their brands. My mobile education We've all heard how mobile is transforming the web experience, reshaping the landscape for marketers, brands and consumers. As marketers, we now have to account for how our content will be accessed and consumed on mobile devices, whether that's a phone, tablet or phablet. As brands, we realize our efforts will be judged not only on how well or high we show up in the SERPs, but also on much we can delight the on-the-go prospect who needs information that's (a) fast, (b) accurate and (c) available from any device. As prospects and consumers, we've come to know and value customer experience in large part because brands that use mobile to deliver what we need when we need it and in a way that's easily consumed, have earned our attention — and maybe even our dollars. But that's where the similarities seemingly end. Marketers and brands seem to get so wrapped up in the technology (responsive design, anyone?) they forget that, at the end of the day, prospects want what they want right now — in the easiest-to-access way possible. I've come to believe that, while marketers appreciate the overall value of mobile, they have yet to realize how, for customers, it's all about what it allows them to accomplish. At the customer/end-user level it's not about mobile-friendly or responsive design; it's about creating an enviable customer experience, one web searchers will reward you for with traffic, brand mentions and conversions. I was alerted to the prominence of mobile phone use by noticing how many people sit staring at their phones while out at dinner, even as family members and friends are seated all around them. \"How rude,\" I thought. Then I realized it wasn't only the people at restaurants; it's people everywhere: walking down the street, driving (sadly and dangerously), sitting in movie theaters, at work, even texting while they talk on the phone. One of my favorite comments with regard to mobile's dominance comes with the Wizard of Moz himself, when he shared this tweet and accompanying image last year: Mobile isn't killing desktop. It's killing all our free time. pic.twitter.com/pXb7F7aWsP— Rand Fishkin (@randfish) December 20, 2015 But my \"aha!\" moment happened last year, in Manhattan, during the corned beef hash episode. After working until brunch, I... Opened iPhone to Google Typed \"Best corned beef hash near me\" Scanned list of restaurant by distance and reviews Selected the closest restaurant having > 4-star review ratings Ended up disappointed That's when it hit me that I'd made errors of omission at every step, in large part by leaving one very important element out of the process, but also by not thinking like a smart web user. Normally my process is as follows, when I wish to enjoy a specific meal while traveling: Open iPhone to Google Search box Type \"Best _________ near me\" Scan list of restaurants by distance and reviews Select restaurant having > 4-star review rating but has excellent reviews (> 4.5) of the dish I want and has great images of the dish online Delight ensues That's when three things occurred to me like a brickbat to the noggin': This is a process I use quite often and is one that has proved quite foolproof It's undoubtedly a process many other would-be customer are using to identify desirable products and services Marketers can reverse-engineer the process to bring the customers they're hoping for to their doors or websites. (Eds. note: This post was created with small business owners (single or multiple location), or those doing Local SEO for SMBs, in mind, as I hope to inform them of how many individuals think about and use mobile, and how the marketers can get in front of them with relevant content. Also, I'd like to thank Cindy Krum of Mobile Moxie for encouraging me to write this post, and Local SEO savant Phil Rozek of Local Visibility System for making sure I colored within the lines.) Five ways to create an enviable customer experience on mobile #1 — Optimize your images Image optimization is the quintessential low-hanging fruit of online marketing: easy to accomplish but typically overlooked. For our purposes, we aren't so much making them \"mobile-friendly\" as we are making them search-friendly, increasing the likelihood that Google's crawlers can better decipher what they contain and deliver them for the optimal search query. First and foremost, do not use a stock image if your goal is for searchers to find, read and enjoy your content. Just don't. Also, given how much of a factor website speed is, minify your images to ensure they don't hamper page speed load times. But the three main areas I want us to focus on are file name, alt text and title text, and captions. My standard for each is summed up very well in a blog post from Ian Lurie, who proposes an ingenious idea: The Blank Sheet of Paper Test: If you wrote this text on a piece of paper and showed it to a stranger, would they understand the meaning? Is this text fully descriptive? With this thinking in mind, image optimization becomes far simpler: File name: We're all adults here — don't be thickheaded and choose something like \"DSC9671 . png\" when \"cornedbeefhash . jpg\" clearly works better. Alt text and title text: Given that, in Google's eyes, these two are the priorities, you must make certain they're as descriptive as possible. Clearly list what the image is and/or contains without weighing it down with unneeded text. Using the corned beef hash from above as a example, \"corned beef hash with minced meat\" would be great, but \"corned beef hash with minced meat and diced potatoes\" would work better, alerting me that the dish isn't what I'm looking for. (I prefer shredded beef and shredded potatoes.) Caption: Yes, I know these aren't necessary for every post, but why leave your visitors hanging, especially if an optimal customer experience is the goal? Were I to caption the corned beef, it'd be something along the lines of \"Corned beef hash with minced meat and diced potatoes is one of the most popular dishes at XX.\" It says just enough without trying to say everything, which is the goal, says Lurie. “'Fully descriptive' means 'describes the thing to which it’s attached,' not 'describe the entire universe,'\" he adds. Also, invite customers to take and share pictures online (e.g., websites, Instagram, Yelp, Google) and include as much rich detail as possible. What's more, it might behoove you to have a Google Business View photo shoot, says Rozek. \"Those show up most prominently (in the Knowledge Panel) for brand-name mobile searches in Google.\" #2 — Make reviews a priority Many prospects and customers use reviews as a make-or-break tactic when making purchases. Brands, realizing this, have taken note, making it their charge to get positive reviews. But not all reviews are created equal. Instead of making certain your brand gets positive reviews on the entirety of its products and services, redouble your efforts at getting positive reviews on your bread-and-butter services. In many instances, what people have to say about your individual services and/or products matters more than your brand's overall review ratings. I learned this from talking to several uber-picky foodie friends who shared that the main thing they look for is a brand having an overall rating (e.g., on Yelp, Google, Angie's List, Amazon, etc.) higher than 3.5, but who have customer comments glorifying the specific product they're hoping to enjoy. \"These days, everyone is gaming the system, doing what they can to get their customers to leave favorable reviews,\" said one friend, who lives in Dallas. \"But discerning [prospects] are only looking at the overall rating as a beginning point. From there, they're digging into the comments, looking to see what people have to say about the very specific thing they want. [Smart brands] would focus more on getting people to leave comments about the particular service they used, how happy they work with the result and how it compares to other [such services they've used]. We may be on our phones, but we're still willing to dig into those comments.\" To take advantage of this behavior, In addition to asking for a favorable review, ask customers to comment on the specific services they used, providing as much detail as possible Redouble your efforts at over-delivering on quality service when it comes to your core offerings Ask a few of your regulars, who have left comments on review sites, what they think meets the minimum expectation for provoking folks to leave a review (e.g., optimizing for the desired behavior) Encourage reviewers to upload photos with their reviews (or even just photos, if they don't want to review you). They're great \"local content,\" they're useful as social-proof elements, and your customers may take better pictures than you do, in which case you can showcase them on your site. Relevant content: 60+ Questions to Troubleshoot and Fix Your Local Reviews Strategy How to Execute the Perfect Local Reviews Strategy #3 — Shorten your content I serve as a horrible spokesperson for content brevity, but it matters a great deal to mobile searchers. What works fine on desktop is a clutter-fest on mobile, even for sites using responsive design. As a general rule, simplicity wins. For example, Whataburger's mobile experience is uncluttered, appealing to the eye and makes it clear what they want me to do: learn about their specials or make a purchase: On the other hand, McDonald's isn't so sure what I'm looking for, apparently: Are they trying to sell me potatoes, convince me of how committed they are to freshness or looking to learn as much as they can about me? Or all of the above? Web searchers have specific needs and are typically short on time and patience, so you have to get in front of them with the right message to have a chance. When it comes to the content you deliver, think tight (shorter), punchy (attention-grabbing) and valuable (on- message for the query). # 4 — Optimize for local content Like all of you, I've been using \"near me\" searches for years, especially when I travel. But over the last year, these searches have gotten more thorough and more accurate, in large part as a result of Google's Mobile Update and because the search giant is making customer intent a priority. In 2015, Google reported that \"near me\" searches increased by 34-fold since 2011. And though most of these \"near me\" searches are for durable goods/appliances and their associated retailers, services, including \"surgeons near me,\" \"plumbers near me,\" \"jobs near me,\" etc., and other things that are typically in a high consideration set are growing considerably, according to Google via its website, thinkwithgoogle.com. A recent case study of 82 websites (41, control group; 41, test group) shows just how dramatic the impact of optimizing a site for local intent can be. By tweaking the hours and directions page titles, descriptions and H1s to utilize the phrases \"franchise dealer near me\" and \"nearest franchise dealer\" the brand saw mobile impressions for “near me” more than double to 8,833 impressions and 46 clicks. (The control group's “near me” impression share only rose 11%.) Image courtesy of CDK Global Additional steps for optimizing your site for “near me” searches Prominently display your business name, address and phone number (aka, NAP) on your site Use schema markup in your NAP In addition to proper setup and optimization of your Google My Business listing, provide each location with its own listing and, just as important, ensure that the business name, address and phone number of each location matches what's listed on the site Consider embedding a Google Map prominently on your website. \"It's good for user experience,\" says Rozek. \"But it may also influence rankings.\" #5 — Use Google App Deep Linking We've all heard the statistics: The vast majority — in some circles the figure is 95% — of apps downloaded to mobile devices are never used. Don't be deceived, however, into believing apps are irrelevant. Nearly half of all time spent on the web is in apps. This means that the mobile searchers looking for products or services in your area are likely using an app or, at the very least, prompted to enter/use an app. For example, when I type \"thai restaurant near me,\" the first organic result is TripAdvisor. Upon entering the site, the first (and preferred) action the brand would like for me to make is to download the TripAdvisor app: Many times, a \"near me\" search will take us to content within an app, and we won't even realize it until we see the \"continue in XX app or visit the mobile site\" banner. And if a searcher doesn't have the app installed, \"Google can show an app install button. So, enabling your app for Google indexing could actually increase the installed base of the app,\" writes Eric Enge of Stone Temple Consulting. For brands, App Deep Linking (ADL), which he defines as \"the ability for Google to index content from within an app and then display it as mobile search results,\" has huge implications if utilized properly. \"Think about it,\" he writes. \"If your app is not one of the fortunate few that get most of the attention, but your app content ranks high in searches, then you could end up with a lot more users in your app than you might have had otherwise.\" (To access details on how to set up Google App Deep Linking, read Enge's Search Engine Land article: SMX Advanced recap: Advanced Google App Deep Linking) If your brand has an app, this is information you shouldn't sleep on. Typically, when I conduct a \"near me\" search, I click on/look through the images until I find one that fits what I'm looking for. Nine times out of ten (depending upon what I'm looking for), I'm either taken to content within an app or taken to a mobile site and prompted to download the app. Seems to me that ADL would be a no-brainer. Optimizing for mobile is simply putting web searchers first For all the gnashing of teeth Google's many actions/inactions provoke, the search giant deserves credit for making the needs of web searchers a priority. Too often, we, as marketers, think first and foremost in this fashion: What do we have to sell? Who needs it? What's the cheapest, easiest way to deliver the product or service? I think Google is saying to us that the reverse needs to occur: Make it as fast and as easy for people to find what they want Better understand who it is that's likely to be looking for it by better understanding our customers and their intent The sales process must begin by thinking \"what specific needs do web searchers have that my brand is uniquely qualified to fulfill?\" In this way, we're placing the needs of web searchers ahead of the needs of the brand, which will be the winning combination for successful companies in the days ahead. Brands will either follow suit or fall by the wayside. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Your Brand Can Create an Enviable Customer Experience for Mobile Web Searchers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Your Brand Can Create an Enviable Customer Experience for Mobile Web Searchers"
    },
    {
      "level": "H2",
      "text": "My mobile education"
    },
    {
      "level": "H2",
      "text": "Five ways to create an enviable customer experience on mobile"
    },
    {
      "level": "H2",
      "text": "#1 — Optimize your images"
    },
    {
      "level": "H2",
      "text": "#2 — Make reviews a priority"
    },
    {
      "level": "H2",
      "text": "#3 — Shorten your content"
    },
    {
      "level": "H2",
      "text": "# 4 — Optimize for local content"
    },
    {
      "level": "H3",
      "text": "Additional steps for optimizing your site for “near me” searches"
    },
    {
      "level": "H2",
      "text": "#5 — Use Google App Deep Linking"
    },
    {
      "level": "H2",
      "text": "Optimizing for mobile is simply putting web searchers first"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}