{
  "url": "https://moz.com/blog/create-content-your-audience-will-love",
  "slug": "create-content-your-audience-will-love",
  "title": "5 Tips to Create Content Your Audience Will Love - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your brand is struggling to get a handle on what content to create next, it's time to take that concern off the table by learning how to produce content the audience craves.",
  "content": "5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love Content Marketing | SEO Basics By: Ronell Smith November 8, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith November 8, 2016 5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love Content Marketing | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. (Original image source) The young man at the back of the ballroom in the Santa Monica, Calif., Loews hotel has a question he's been burning to ask, having held it for more than an hour as I delivered a presentation on why content marketing is invaluable for search. When the time comes for Q&A, he nearly leaps out of his chair before announcing that he's asking a question for pretty much the entire room. \"How do I know what content I should create?\" he asks. \"I work at a small company. We have a team of content people, but we're typically told what to write without having any idea if it's what people want to read from us.\" When asked what the results of their two blog posts per week was, his answer told a tale I hear I often: \"No one reads it. We don't know if that's because of the message or because [it's the] wrong audience for the content we're sharing.\" In fishing and hunting circles, there's a saying that rings true today, tomorrow, and everyday: \"If you want to land trophy animals, you have to hunt in places where trophy animals reside.\" Content marketing is not much different. If you want to ensure that the right audience consumes the content you design, create and share, you have to \"hunt\" where they are. But to do so successfully, you must first know what they desire in the way of bait (content). For those of us who've been involved in content marketing for a while now, this all sounds like fairly simplistic, 101-level stuff. But consider this: While we as marketers and technologists have access to sundry tools and platforms that help us discern all sorts of information, most small and mid-size business owners — and the folks who work at small and mid-size businesses — often lack the resources for most of the tools that could help flatten the learning curve for \"What content should I create?\" If you spend any time fishing around online, you know very well that the problem isn't going away soon. Image courtesy of Content Marketing Institute and Marketing Profs For small and mid-size business looking to tackle this challenge, I detail a few tips below that I frequently share during presentations and that seem to work well for clients and prospects alike. #1—Find your audienceFirst, let's get something straight: When it comes to creating content worth sharing and hopefully linking to, the goal is, now and forevermore, to deliver something the audience will love. Even if the topic is boring, your job is to deliver best-in-class content that's uniquely valuable. Instead of guessing what content you should create for your audience (or would-be audience), take the time to find out where they hang out, both online and offline. Maybe it's Facebook groups, Twitter, forums, discussion groups, or Google Plus (Yes! Google Plus!). Whether your brand provides HVAC services, computer repair, or custom email templates, there's a community of folks sharing information about it. And these folks, especially the ones in vibrant communities, can help you create amazing content. As an example, the owner of a small automobile repair business might spend some time reading the most popular blogs in the category, while paying close attention to the information being shared, the top names sharing it, and common complaints, issues, or needs that commonly arise. The key here is to see who the major commenters, sharers, and influencers are, which can easily be gleaned after careful review of the blog comments over time. From there, she could \"follow\" those influencers to popular forums and discussion boards, in addition to Facebook groups, Google Communities, and wherever else they congregate and converse. The keys with regard to this audience research is to find out the following: Where they are What they share What unmet needs they might have #2—Talk to themOnce you know where and who they are, start interacting with your audience. Maybe it's simply sharing their content on social media while including their \"@\" alias or answering a question in a group or forum. But over time, they'll come to know and recognize you and are likely to return the favor. A word of warning is in order: Take off your sales-y hat. This is the time for sincere interaction and engagement, not hawking your wares. Once you have a rapport with some of the members and/or influencers, don't be shy about asking if you can email them a quick question or two. If they open that door, keep it open with a short, simple note. With emails of this sort, keep three things in mind: Be brief Be bold Be gone Respect their time — and the fact that you don't have enough currency for much of an ask — by keeping the message short and to the point, while leaving the door open to future communication. #3—Discern the job to be doneWe've all heard the saying: \"People don't know what they want until they've seen it.\" Whether or not you like the bromide, it certainly rings true in the business world. Too often a product or service that's supposedly the perfect remedy for some such ailment falls flat, even after focus groups, usability testing, surveys, and customer interviews. The key is to focus less on what they say and more on what they're attempting to accomplish. This is where the Jobs To Be Done theory comes in very handy. Based primarily on the research of Harvard Business School professor Clayton Christensen, Jobs To Be Done (JTBD) is a framework for helping businesses view customers motivations. In a nutshell, it helps us understand what job (why) a customers hires (reads, buys, uses, etc.) our product or service. Christensen writes... \"Customers rarely make buying decisions around what the 'average' customer in their category may do — but they often buy things because they find themselves with a problem they would like to solve. With an understanding of the 'job' for which customers find themselves 'hiring' a product or service, companies can more accurately develop and market products well-tailored to what customers are already trying to do.\" Christensen's latest book provides a thorough picture of the \"Jobs To Be Done\" theory One of the best illustrations of the JTBD theory at work is the old saw we hear often in marketing circles: Customers don't buy a quarter-inch drill bit; they buy a quarter-inch hole. This is important because we must clearly understand what customers are hoping to accomplish before we create content. For the auto repair company preparing to create a guide for an expensive repair, it would be helpful to learn what workarounds currently exist, who are the people experiencing the problem (i.e., DIYers, Average Joes, technicians, etc.), how much the repair typically costs, and, most important, what the fix allows them to do. For example, by talking to some of the folks in discussion groups, the business owner might learn that the problem is most common for off-roaders who don't feel comfortable making the expensive repair themselves. Therefore, many of them simply curtail the frequent use of their vehicles off-road. Armed with this information, she would see that the JTBD is not merely the repair itself, but the ability to get away from work and into the woods on the weekend with their vehicles. An ideal piece of content would then include the following elements: Prevention tips for averting the damage that would cause the repair A how-to video tutorial of the repair Locations specializing in the repair (hopefully her business is on the list with the most and best reviews) A piece of content covering the elements above, that contains amazing graphics of folks kicking up dirt off-road with their vehicles, along with interviews of some of those folks as well, should be a winner. #4—Promote, promote, promoteNow that you've created a winning piece of content, it's time to reach back out the influencer(s) for their help in promoting the content. First, though, ask if what you've created hits the threshold of incredibly useful and worth sharing. If you get a yes for both, you're in. The next step is to find out who the additional influencers are who can help you promote and amplify the content. One simple but effective way to accomplish this is to use BuzzSumo to discern prominent shares of your amplifiers' content. (You'll need to sign up for a free subscription, at least, but the tool is one of the best on the market.) After you click \"View Sharers,\" you'll be taken to a page that list the folks who've re-shared the amplifier's content. You're specifically looking for folks who've not only shared their content but who (a) commonly share similar content, (b) have a sizable audience that would likely be interested in your content, and (c) might be amenable to sharing your content.As you continue to cast your net far and wide, a few things to consider includes: Don't abuse email. Maintain the relationships by offering to help them in return as/more often than you ask for help yourself. Share content multiple times via social media. Change the title each time content is shared, and look to determine which platforms work best for a given message, content type, etc. Use engagement, interaction, and relationship to inform you of future content pieces. Don't be afraid to ask, \"What are some additional ideas you'd be excited to share and link to?\" #5—Review, revise, repeatThe toughest part of content marketing is often understanding that neither success nor failure are final. Even the best content and content promotion efforts can be improved in some way. What's more, even if your content enjoys otherworldly success, it says nothing about the success or failure of future efforts. Before you make the commitment to create content, there are two very important elements to adhere to: 1.) Only create content that's in line with your brand's goals. There's lots of good ideas for creating solid content, but many of those ideas won't help your brand. Stick to creating content that in your brand's wheelhouse. 2.) This line of questioning should help you stay on track: \"What content can I create that's (a) in line with my core business goals; (b) I'm uniquely qualified to offer; and (c) prospects and customers are hungry for?\" My philosophy of the three Rs: Review: Answer the questions \"What went right?\", \"What can we do better?\", and \"What did we miss that should be covered in the future?\" Revise: You'll need to determine the metrics that matter for your brand before creating content, but whatever they are ensure they're easy to track, attainable, and, most important of all, have real meaning and value. Repeat: Successful content marketing efforts occur primarily through repetition. You do something once, learn from it, then improve with the next effort. Remember, the No. 1 reason we have less and less competition each year is many aren't willing to pay the price of doing the little things over and over. This post is, by no means, an exhaustive plan of what it takes to create effortful content. However, for the vast majority of brands struggling with where to start, it's exactly what the doctor ordered. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Tips to Get Off the Content Marketing Struggle Bus & Create Content Your Audience Will Love"
    },
    {
      "level": "H2",
      "text": "#1—Find your audience"
    },
    {
      "level": "H2",
      "text": "#2—Talk to them"
    },
    {
      "level": "H2",
      "text": "#3—Discern the job to be done"
    },
    {
      "level": "H2",
      "text": "#4—Promote, promote, promote"
    },
    {
      "level": "H2",
      "text": "#5—Review, revise, repeat"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}