{
  "url": "https://moz.com/blog/create-a-better-performing-website-using-one-sneaky-tactic",
  "slug": "create-a-better-performing-website-using-one-sneaky-tactic",
  "title": "Three Ways to Create a Better Performing Website (Using One Sneaky Tactic) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A particular feature of the way the web and web browsers are designed, gives us an opportunity to make our websites more usable and increase conversions. This post shows you how.",
  "content": "Three Ways to Create a Better Performing Website (Using One Sneaky Tactic) Technical SEO By: Rob Ousbey August 1, 2010 Table of Contents Copied! By: Rob Ousbey August 1, 2010 Three Ways to Create a Better Performing Website (Using One Sneaky Tactic) Technical SEO Let's start with a sneaky tactic. I know that SEOmoz blog readers are an internet-savvy crowd, so many of you are probably familiar with the 'browser history sniffing' techniques that exist. (Bear with me, we'll get to internet marketing advice in a moment.) In case you've not come across the concept before, it's probably best exemplified by the site Start Panic - just hit the 'Let's start!' button to watch it trawl through your browser history, and start listing sites that even you forgot you'd visited. StartPanic uses Javascript to do the dirty work, but it's also possible to do this completely using CSS, and without Javascript. (There's advice about implementing the technical side of this in a popular post by Niall Kennedy.) I wanted to show how you can use this to help your website perform better - let's begin with the least controversial, and work on from there 1 - Customize the User Experience Niall's post - linked above - suggests one very sensible use of this technique: offering your users links to the social sites they use, and hiding the ones they don't. In this bottom of this live example page, you'll see a 'Digg It' button if you've been to Digg, a 'Share on Facebook' button if you've been there, etc. By limiting the set of sharing buttons, you can remove that 'social clutter' that is prevalent on some sites - this doesn't just give a cleaner page to the user, but may have a much higher 'sharing' rate for your page. Customization can also be made is to the content of your site: use the browser history sniffing technique to see the kinds of blogs and news sites your visitors are reading, and then adjust your content based on the results. For example: I might consider writing a weekly post about PPC for the Distilled blog. We could check to see how many of the Distilled visitors had looked at PPC Hero, the AdWords blog, and the AdWords support pages. If the number was high enough, we might consider adding content to satisfy that niche. Likewise, if you find that a high proportion of your readers visit KittenWar, then you might consider adding a little more 'cute' to your posts. 2 - Retarget Your Publicity Traditional ad-network retargeting works in the following way: a visitor comes to your site, and leaves without making a purchase your advertising network drops a cookie onto that user's computer the user visits a different site which displays ads from that network the network recognizes the user, and shows them an ad for your product hopefully they're reminded of you, and come back to the site to make a purchase. However, this retargeting only works when you can cookie people once they've visited your site. I'd propose using this technique to alter the copy on your site, based on what the user has already seen about you elsewhere. For example: check for new posts about your brand each morning (or can I assume you do this already?) If your company had three product reviews on blogs and news sites today, then record these URLs, and check to see if each visitor to your site has already read one of them. You could then display a prominent content box on the front page with information about the exact product they saw reviewed, and a link to your page for that product. You might even acknowledge they'd seen the review: \"Initech wants to offer you a 10% discount, as a reader of The Daily Bugle\" You could use the same technique for Reputation Management. If a site has published a negative article about you, there's a potential that people will come to your site to find out more. However, you may not want to simply have a message on your front page that reads \"The Bluth Company has NOT committed treason - read more\" - but you could choose display this headline only to people who've read about the story already. 3 - Find Your Competitors' Customers This is where you could really up-the-ante with your CRO efforts. I recently saw a bank who offered $100 to people who closed their account at a competitor's bank and switched over. This would be a perfect opportunity to sniff each visitor's browser history, to see if you should promote this offer to them on your site. You can even avoid showing it to people who have been shopping around (and looking at every bank's website homepage) by checking to see if they've visited the URLs for logging in and out of the competitor's online banking to see if they're actually a customer of that company. For e-commerce sites, you could check to see if your visitor has visited your competitor's site, but could also check if they've looked at the competitor's product on Amazon or other retailers. Your product page could then include a comparison between the two products. That could increase conversions, but you'd avoid comparing your product to a competitor's for anyone who'd never seen the competing product. To Conclude So, the practice of checking to see if a visitor has already been to particular pages might seem a little shady at first - but this part of the way that the web and web browsers are designed, and people can block their browser history if they'd prefer. Executed in the right way, it could be a very powerful technique for creating high performing, high converting websites. Use it wisely. (Thanks for reading; you can follow me on Twitter: @RobOusbey, and I'm pleased to be speaking alongside some of the best SEO practitioners around at this year's Pro Training Seminar - tickets are still available.) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Three Ways to Create a Better Performing Website (Using One Sneaky Tactic)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Three Ways to Create a Better Performing Website (Using One Sneaky Tactic)"
    },
    {
      "level": "H2",
      "text": "1 - Customize the User Experience"
    },
    {
      "level": "H2",
      "text": "2 - Retarget Your Publicity"
    },
    {
      "level": "H2",
      "text": "3 - Find Your Competitors' Customers"
    },
    {
      "level": "H2",
      "text": "To Conclude"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}