{
  "url": "https://moz.com/blog/create-cornerstone-content",
  "slug": "create-cornerstone-content",
  "title": "How to Create Cornerstone Content That Google and Your Audience Will Love - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Read on for tips on creating, optimizing, and promoting the necessary, foundational content that drives traffic to your website, and that will eventually convert visitors into loyal customers.",
  "content": "How to Create Cornerstone Content That Google and Your Audience Will Love Content Marketing | SEO Basics By: Sam O'Brien July 20, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sam O'Brien July 20, 2021 How to Create Cornerstone Content That Google and Your Audience Will Love Content Marketing | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Creating the right content for your website needs serious planning and development. In an increasingly competitive world, it’s not enough that your audience loves it — Google has to love it too! This article will show you how to create, optimize, and promote cornerstone content that drives traffic to your website and eventually converts visitors into loyal customers. What exactly is cornerstone content? The dictionary describes “cornerstone” as something essential, indispensable, basic, or the main foundation upon which something is constructed. Cornerstone content, therefore, is the most important part of your website. It refers to a high-value piece of content that aims to increase traffic and brand awareness by showing what your business can offer. Letting potential customers know what you’re all about will help define your brand and reflect your values. As well as creating a positive first impression, cornerstone content tells Google what your website wants to share. Cornerstone content is not designed to convert visitors right away. The main aim is to pique their interest so that they’ll remember you and return when they actually need your services. Cornerstone content is sometimes called “evergreen content”, which provides a clue to the type of articles that work best. As well as responding to trends, you should choose subjects that people consistently search for. If you’re a telecommunications company, for example, you could include a piece that explains some of the terminology (“What is VoIP?”) or how your products work (“The ultimate guide to video conferencing”). The benefits of great cornerstone content Cornerstone content is a hugely important tool in raising brand awareness, both through content itself and the way it’s optimized. It’s a golden chance to get your core message across to your target audience. Done right, it will help you achieve a high ranking on the SERPs, which will drive all that lovely relevant traffic to your site. Remember that 75% of people don’t look beyond the first results page! Cornerstone content gives you the opportunity to build natural links: from other pages on your website, from your social media channels, and from external sources who think your content is worth linking to. It’s a great way to position your business as an authority in your industry, which increases trust in your brand. And it also feeds your funnel, by attracting prospects who can be tracked and nurtured for optimum conversion rates. Evergreen content can be used across all marketing channels to strengthen your brand identity — and it can even be repurposed into different formats to keep the website fresh. If you focus your efforts on getting cornerstone content right, you’ll create something that continues to drive value for your business. How to create great cornerstone content Now we’ll show you how to create informative, engaging content and promote it to your target audience. Do your research Getting to know your customers and understanding their buyer persona is a crucial aspect of marketing. If you know who you’re aiming at, you’ll have a better idea of what to write about. You need to ensure that your cornerstone piece is relevant, and the best way to do that is to communicate with your audience. Talk to existing customers, carry out surveys, and then analyze the data. You’ll also need to find out what people are searching for online. Ideally, you’re looking for a subject that’s commonly searched for but doesn’t yield many results. When you’re aiming to move up the SERP rankings, the content you provide must be better than what’s already out there. Ask yourself: what are the pain points faced by the target audience? What questions are they asking, and why aren’t they already being answered? The idea is to spot a problem that your business can help with — maybe using specialist knowledge or data to provide a unique solution. Part of your research is to find out what keywords people use when they search on Google. You’ll need to choose the most appropriate keywords and phrases for your content, making sure they match the ones people are most likely to use when they type a question (which only you can answer!). Once you’ve gathered the data you need, hang on to it! You’ll want to access it in the future to see how your target audience has evolved and how you can adapt. Using Platform as a Service (PaaS) storage solutions gives you a secure and efficient way to keep data (and content pieces) all in one handy place. Plan your content Cornerstone content usually takes the form of an in-depth article, such as “Everything you need to start selling online” or “Cloud computing: the complete guide”. While this is the most popular way to communicate brand values, there’s no law that says you have to stick with one type of content. For example, you could consider posting a how-to guide with step-by-step instructions or a video tutorial. A searchable knowledge base could also prove helpful for visitors, while access to a free tool would definitely help them feel positive about you. When you’ve chosen the type of content you want to produce, think about how long it will take and the costs involved. Decide if you’re going to keep it in-house or outsource the work, or a mixture of both. Remember that previous content can be repurposed for another format or channel. This is a good way to stay on-budget, as you don’t have to pay for a whole new article. A clever writer can transform existing content into something that feels fresh and new, even if it covers the same ground. Write your masterpiece Cornerstone content should be well-planned and superbly-written, making sure the reader is interested, informed, and inspired. It must be relevant and genuinely helpful, not only solving the customer’s problem but making them want to learn more about you. Accuracy is also crucial, as the reputation of your brand is at stake. Content should sound suitably authoritative, perhaps including links from other expert sources—this will also help your search engine rankings, as trustworthy websites tend to rank highly. Keywords should be built into the natural flow of the writing, avoiding keyword-stuffing. Taking advantage of software like Hemingway or Grammarly is a great way to check that your writing is easy to read and informative. And the piece should obviously deliver on what the headline or intro promises — an article called “What exactly is machine learning?” should explain the terminology and provide easily-understandable examples. You should also avoid being too pushy. Although you’re trying to attract visitors, cornerstone content isn’t about aggressive sales tactics. A subtle approach will plant the seed in a potential customer’s mind while addressing their query in a trustworthy way. Visual appeal is just as important as written content, so be sure to include attractive images and graphics to keep the reader engaged. Ideally, you need the whole piece to be so impressive that readers want to share it, or even link to it in their own content. Optimize your content You’ve created some outstanding cornerstone content, so now you need to ensure it’s fully optimized for maximum hits. It goes without saying that your website should be easy to access and navigate on any device, paying particular attention to mobile optimization. Your primary keyword must appear in the URL and the title tag — which is also your headline — so it should be especially appealing. Google is trying to offer the most relevant results, so it helps if the title answers the exact question being asked. As well as using keywords in the body text, make sure you’re using them in subheadings. This makes it easy for readers to see at a glance what the content is about, and for search engines to recognize its relevance. It also pays to optimize visual content by including alt text, using relevant keywords in image file names, and making sure images are fast-loading. And the top-of-funnel position means cornerstone content should always be available for free. Promote your content Smart promotional tactics will help your content reach as wide an audience as possible. You’ve already sorted the SEO strategy, but there are plenty of other tools at your disposal — and some won’t cost you a penny. If you already have an email database, use this to let people know about new cornerstone content. Consider an extra incentive to encourage them to visit your page, such as a special offer on products or services. Marketing automation tools can be used to send out mail shots, or schedule social media posts — this will save time as well as helping you nurture leads. But remember that a dash of personalization is always appreciated, and will make the recipient more likely to access, share, or link to your content. Cornerstone content can be adapted for different channels, focusing on the platforms that work best for your company (you’ll already have identified these via your detailed customer research). Organic social promotion is great for your budget, but you may also want to invest in paid promotion to reach a more targeted audience. Don’t forget data analytics so you can see who’s responding and alter your strategy accordingly. Links and sharing Another way to generate leads is to direct visitors to personalized post-click landing pages. You don’t want to annoy people by having suggestions pop up when they’re in the middle of reading your content, but how about an exit banner with a special offer just as they’re about to leave? Of course, visitors may have landed elsewhere on your site, so you need to provide plenty of internal links to cornerstone content and make it easy to click straight through to new material. Including cross-references and backlinks in other similar posts will increase exposure to cornerstone content. This can also help boost your rankings, as Google tends to favor a robust internal linking structure. Finally, make it simple for visitors to share your content with others by adding social media buttons. If your content references industry influencers, it might incentivize them to share content with their many followers. Regular maintenance Search engines love websites whose content is fresh and highly relevant. Regular updates let Google know that your content is up-to-the-minute, which helps your SERPs position. Cornerstone content should be updated frequently to include things like new trends and the latest stats. If it mentions specific products, check they’re still available and that the prices are accurate. You should also make sure the website works properly, with no broken links or slow-loading images. Fonts and layouts can start to look old-fashioned after a while, too, so it’s worth revamping the look of the pages from time to time. Remote IT support comes in handy when teams are working on content maintenance — they may need swift assistance to fix an issue before potential customers are put off by a slow-running site or inability to access content. You’re ready to start creating content! More than 90 percent of online content gets no traffic at all from Google. Creating cornerstone content that’s impressive and fully optimized is a great way to make sure this doesn’t happen to you. If you follow the advice in this article, you’ll be able to create cornerstone content that’s loved by audiences and Google alike. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create Cornerstone Content That Google and Your Audience Will Love"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create Cornerstone Content That Google and Your Audience Will Love"
    },
    {
      "level": "H2",
      "text": "What exactly is cornerstone content?"
    },
    {
      "level": "H2",
      "text": "The benefits of great cornerstone content"
    },
    {
      "level": "H2",
      "text": "How to create great cornerstone content"
    },
    {
      "level": "H3",
      "text": "Do your research"
    },
    {
      "level": "H3",
      "text": "Plan your content"
    },
    {
      "level": "H3",
      "text": "Write your masterpiece"
    },
    {
      "level": "H3",
      "text": "Optimize your content"
    },
    {
      "level": "H3",
      "text": "Promote your content"
    },
    {
      "level": "H4",
      "text": "Links and sharing"
    },
    {
      "level": "H3",
      "text": "Regular maintenance"
    },
    {
      "level": "H2",
      "text": "You’re ready to start creating content!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam O'Brien\n          \n            Sam O'Brien\n          \n            Sam O'Brien"
}