{
  "url": "https://moz.com/blog/creating-great-content-is-not-easy-in-enterprise-seo",
  "slug": "creating-great-content-is-not-easy-in-enterprise-seo",
  "title": "Creating Great Content is Not Easy in Enterprise SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How to tackle huge Enterprise SEO projects by working with your team, setting expectations, owing SEO, and being an awesome communicator.",
  "content": "Creating Great Content is Not Easy in Enterprise SEO Content Marketing By: Robert Gaglini October 12, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Robert Gaglini October 12, 2012 Creating Great Content is Not Easy in Enterprise SEO Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. These are the screaming voices in my head during every project: Make sure you work within the creative guidelines for this particular product, tell the graphic designers that this page has SEO value, let the developer know you want the copy to be unique, don’t chew with your mouth open, sit up straight, don’t eat fish on Friday, and always remember to brush your teeth twice a day for a squeaky-clean mouth to avoid gingivitis. But I digress… As you can surmise by my list, one of the most challenging and rewarding experiences of my life so far has working in an enterprise SEO setting. My major role within our company’s Organic Search team is to create and optimize our site’s content, focusing on pages listed high-up within our taxonomy. Combine this with building quality links and enhancing social sharing, and our little SEO team is doing quite well. There are two main pieces you should take away from this article. The first is for those of you not involved in enterprise SEO to see the myriad of issues that affect content creation. The other is to understand that the people involved in these issues are not at fault. In an enterprise company, each person plays a very specific role and is not often accountable for much else. Although relevant content is “King” in an enterprise environment, getting it onto the site requires much more than just a keyboard. It takes patience, a hard shell, and unmitigated perseverance. Before I go too deep into this article, it’s imperative that I mention how this post may read similar to Jonathon Colman’s fantastic article about in-house SEO. The three areas that most impact the creation process are: Content Strategy Technology Development Graphic Design Content Strategy: Every company has a content strategy. In larger companies, that strategy is often very complex, with 100 different parts all trying to work together. Imagine 50 very different products, each with its own particular strategy. Now think of several initiatives to promote higher click-through-rate, scattered throughout the 50 different products. Add in a few different project managers, all with various styles, thoughts and experiences and throw them into the mix. Finally, appease everything. You can’t right away, and that’s why second drafts exist. Much like a clock, each cog in the enterprise machine must work with the other cogs. When I create copy for a valuable page, it goes into a scrupulous review by a content strategist and proofreader. What comes back isn’t always what’s best for SEO. These are the three pieces of feedback I’ve received the most: Your content is too long, and I’ve shortened it The word ‘(target keyword)’ doesn’t make sense at the top of the page, I’ve changed it Parts of your content don’t match the strategy, please re-work it This feedback has helped me learn that when working with content strategists, it’s imperative to list out your expectations as well as understand theirs. For certain pages, it became necessary for me to let them know why more relevant content is often better and why the key term needed to be at the top of the page. The last piece of feedback was the most interesting. Here I was, hopped up on the SEO Kool-Aid, not stopping for one minute to think, “Maybe I have something to learn here.” It was up to me to comprehend the different strategies. After all, SEO is based on what’s best for the user. Never forget that you can always learn more at a large company. Your Action Plan: Work with other teams at your company to create one overarching strategy—no matter how long it takes. If you see your company beginning to take the turn into the blasé and undefined, speak up! Simple conversations and use cases are triggers to GSD (Getting Sh*t Done). Write with the writers. You may work within an SEO team, but getting recommendations from the copywriters is one of the best ways to write more effectively for the user. If they want to remove one of your three keywords, maybe it means it’s not necessary. Developers, Developers, Developers, Developers: For many Enterprise SEOers, developers can be your best friends, if you collaborate. At my company, hundreds of tasks are assigned every few weeks to these developers, who work tirelessly to get it all done by code freeze. You readers that are fluent in HTML, CSS, Javascript, or any other code language have my utmost respect and jealousy. Nevertheless, this rushed atmosphere can pave the way for mistakes, some of them critical. Here are a few common problems that I run into when working directly with developers. Request tickets are pushed to a later date due to resources Duplicate pages are created because of a lack of details I have no idea what the hell they’re talking about The first one is a simple fact of working in an enterprise environment. So many things are happening that your project, well, just doesn’t stand up against others. It’s not unusual to wait two, three, or even four months to have your request looked at by a developer. Patience is a virtue. It also sucks, but it’s a virtue. The second piece is a very serious issue that I see frequently. Because our site has hundreds of thousands of managed pages, it can grow tiresome for a developer to create unique coding for every element on the page. Ordering buttons, footer text, and social media buttons all have the same code across many different pages. But when code holding copy is duplicated, there’s a problem. To prevent this from happening, my entire team actively monitors new projects to make sure that developers are creating new snippets of code for sections of the page that spiders can crawl. Duplicate content is never this cute. Of course, this process is painstaking and not bulletproof. This is why my team keeps up with our SEO awareness project and is constantly preaching it to developers. It’s okay to be a broken record. ‘When any issues slip through the cracks, Organic Search suffers.’ For the last bullet, the lesson learned is similar to the one involving Content Strategy. I’m not nearly as awesome as I think I am; I have a lot to learn; and sometimes I need to pull a little extra weight. Even though everyone has a specialized task, a company won’t work if all the cogs are just moving, instead of moving together. Have a face-to-face meeting and discuss your project. If you don’t understand their insanely smart developer-speak, ask them to explain the concept, no matter how seemingly simple. Don’t worry, no one will laugh…much. Sometimes you may feel infantile in the midst of brainy developers. Don't let that stop you from asking questions. Your Action Plan: Create an SEO Awareness Roadshow. Hit different areas of the company and drill down into how SEO is affected by the specific things that they do. Some of your advice is bound to stick. Get involved in projects early. Even if you’re not looped in, nose your way in to make sure that the project is following SEO best practices. While the developer will most likely do the right thing, it never hurts to have a one-on-one to make sure everything is going according to plan. Graphic Design: If it was possible to fail Art back in grade school, I would have. Moreover, if it was acceptable, my teachers would have banded together and ritualistically burned everything I’d created. I know nothing of design, which is why we have people to create all the attractive stuff. Some of the world’s most brilliant minds work at my company, all focused on generating the best site design for our customers. Of course, when it comes to the website, there are always going to be SEO issues. The two most frequent ones are: Having the marquees at the top of the page use text baked into images Not getting Alt text placed within images on prominent pages Once again, it comes back to collaboration, communication, and connection. The first issue is more potentially harmful than the second. Like projects that involve technology development, our SEO Team is not always looped into the page design process until it’s too late to change. Once in a while, we’ll come across this ‘live text’ issue on an already existing landing page and finally understand why our rankings aren’t where they should be. And since this marquee exists at the very top of the page, some of the best SEO value can be found here. To prevent this, my team has expressed that making sure the marquees have live text and don’t have JavaScript blocking the crawler are very important. However, asking for live text shrinks the creativity of the graphic designer as not all fonts are available in HTML. Because of this, we’ve met with several members of the graphic design team to see if both parties can arrive at a happy medium. This is ranking data for one of our top keywords (246,000 local searches a month). Fixing the second bullet point was a little more convoluted. In the long history of the company, there had never been a true system for implementing Alt Text. A few months ago, I inquired as to who owns that task. There wasn’t really anyone who did. Because of the sudden intrigue I stirred around “Alt Text,” it was easy for me to jump on the issue and come up with some sort of process to get it proofed and into the code. Your Action Plan: While Alt text is a very specific issue, it needs to be addressed. If there is a problem being passed back and forth, tackle it head on. Even if it only slightly disrupts SEO, it still becomes your responsibility. Such is the life of a gung-ho SEO. When faced with issues that affect SEO, be it Graphic Design or otherwise, get the approval and support of prominent members of your business. This isn’t saying that you should wage epic battle against your coworkers, but should instead have someone with authority there to make sure people are listening to your thoughts and opinions. Once again, this post was not meant to be a gripe session. It was meant to be an insightful look into the various ways that enterprise SEO can be impacted. I will end with saying that in an Enterprise environment, communication is your best friend. For those of you who communicate effectively in a smaller setting, I totally understand. But this is not a small company. In a larger environment, it can be tempting to keep to yourself and your work. But, with bigger projects, demanding cries for resources and a mile-a-minute pace, constant communication remains a must. I leave you with a very applicable quote from enterprise SEO guru Marshall Simmonds on why companies don’t perfect enterprise SEO, “This is the responsibility of the in-house SEO expert. If he or she isn’t constantly “reminding” his or her fellow colleagues why search is always important, SEO—and the poor search director as well—will be forgotten.” Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Creating Great Content is Not Easy in Enterprise SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Creating Great Content is Not Easy in Enterprise SEO"
    },
    {
      "level": "H3",
      "text": "Content Strategy:"
    },
    {
      "level": "H3",
      "text": "Developers, Developers, Developers, Developers:"
    },
    {
      "level": "H3",
      "text": "Graphic Design:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Robert Gaglini\n          \n            Robert Gaglini"
}