{
  "url": "https://moz.com/blog/creating-competitor-link-gaps",
  "slug": "creating-competitor-link-gaps",
  "title": "Why Creating Competitor Link Gaps Is Just as Important as Closing Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this post, Rebecca shares the framework that her team at JBH uses to create hyper-niche and relevant digital PR campaigns that earn links on sites where your competitors aren’t found, and highlights the strategic importance of creating these gaps for SEO success.",
  "content": "Why Creating Competitor Link Gaps Is Just as Important as Closing Them Competitive Research | Content Marketing By: Rebecca Moss August 9, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Moss August 9, 2022 Why Creating Competitor Link Gaps Is Just as Important as Closing Them Competitive Research | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In SEO and digital PR, there is a lot of discussion surrounding how and why brands need to close backlink gaps in order to rank high and be competitive in the SERPs. But what about tackling competitive SEO from the opposite direction by creating link gaps? In this post, I’ll share a framework that we use at JBH to help us create hyper-niche and relevant digital PR campaigns that will earn links on sites where our clients' competitors aren’t found, and highlight the strategic importance of creating these gaps for SEO success. What are link gaps, and how do we find them? On a very basic level, a link gap is the difference between the sites linking to multiple competitors, but not to you. It’s really easy to discover these sites by performing a link gap analysis (using a tool like Moz’s Link Intersect Tool), comparing the backlinks you have to those of your competitors. At the end of your analysis, you’re left with a list of websites you should try and earn a link from — this is called closing the link gap, and is common in most SEO strategies. Closing link gaps makes a lot of sense. For example, if someone is linking to a site in a particular industry or vertical, it’s likely they’d be keen to link to a similar site. And if your competition is ranking well, then you’d expect those links to be contributing to that. But if we flip that theory around and start to think about creating backlink gaps as opposed to closing them, then we become more proactive in our approach to link building, as opposed to simply reacting to the competition. Create link gaps in competitive industries with an audience-first mindset If you’re trying to earn or build links for brands in very competitive industries, it can be tempting to follow the competition and simply copy their link strategy to prove you’ve done everything you can. I’d like to share a different approach, and it involves thinking audience-first rather than backlink first. The idea behind this technique is to generate links from sites that are: Topically relevant to the industry your brand or client operates inHigh quality and non-spammyNot feature a link to any of your competitors For this technique to work, we still need to have a good understanding of the competitor link landscape. By using Link Intersect, we can see where our competitors are focusing their link building efforts. We’ll red flag that information in our strategy and do something completely different. For most industries and sectors, there will be “business as usual” topics that their PR teams might use to generate coverage and links. A personal finance brand might talk about how to get the best exchange rate on travel moneyAn alcoholic beverage brand might share some recipes for summer cocktails to enjoy in the gardenA car insurance brand might warn drivers not to wear flip flops when driving in a heatwave These are all interesting and relevant subjects, but they are not going to achieve the unique links for the purposes of creating a link gap between you and your competitors. Case Study: How we identified niche link targets for a well-established brand in a competitive vertical For an established brand in the UK holiday industry, the objective was to earn links from entirely new referring domains, as well as create a link gap between them and their competitors. The initial link gap analysis highlighted that there wasn’t much difference between the key players. As they were all well established brands in the vertical, all brands had earned backlinks from the usual and expected outlets, so we spotted a really great opportunity to develop a new link gap. Identify new audiences by asking the most important questions As mentioned above, instead of thinking “link first”, we take a step back and think “audience first”. We have to step into the shoes of our audience, and to do that, we create a checklist of questions to help frame our thinking. For the UK holidays brand we wanted to know: What drives them? What are the passions and interests of our intended audience?What makes them tick and click? What actions do the audience take before and after using your product or service?What do they care deeply about? Their close family and friends? Finances? Pets? Problem solving? What do the audience need and what problems does your product or service solve? Once we answer all of the audience questions, we have a solid starting point to pinpoint those niche audiences. Using a mind mapping tool like MindNode, we can then get to work on expanding out those primary and secondary audiences: These audiences will look different for every industry, but it’s easy to see how each of the audiences we identified might be interested in booking a holiday in the UK. Let’s take “work from anywhere” as the primary audience to explore first. If you’re a freelancer who works primarily online, it’s likely that you’ll be able to work from anywhere with a decent internet connection. So, taking a UK holiday whilst working at the same time is an option and therefore relevant to the audience. But who else can work from anywhere? Here, we can also identify four secondary audiences who could also be targeting our content: The results of this audience-led approach to digital PR Following this approach, over a third (35%) of the links that JBH secured were from completely new referring domains, and (at the time of writing) none of the brand’s competitors had links from those domains either, proving that an audience-led approach to digital PR can put space between you and your competitors. How to find suitable sites and link targets Now that we’re happy that the “work from anywhere” audience group would be suitable to target, our next steps are to identify the sites we want to target for links. It makes sense to do this before we start to create any content, as we’ll assess: Quantity of sites: Are there enough sites to target?Quality of sites: Are the sites high enough quality? Topics of interest: What conversations are trending and can we add value to them?Targeted by the competition? Have our competitors got links on here yet? Will they share our content? Is it likely they will take content on an editorial basis? We don’t want to target any sites who require payment for coverage Searching manually with Google This technique is old but gold, and it’s probably the most effective way to find new sites to pitch your content to. We search for terms relevant to the audience we’re looking to target, and make a list of the sites that pop up, noting down journalist/author names, the domain authority of the sites, any similar content, and how likely they are to take content from us. Top tip! Drill down your settings in Google’s tools. Try changing the country or changing the “last published” date to see more sites in the search engine results. Discovering similar sites Download a free tool called SimilarSites from Chrome’s web store. When you find a site that looks perfect for the niche audience you’re targeting, click on the extension to be shown a list of sites that might also work. Simply add them to your outreach list to use later. There are plenty of other prospecting techniques you can use to find link targets, but you should now have a list of relevant publications that may be interested in your content - it’s time to start thinking about the type of content you could share! Content ideas for niche link targets How boundaries can help It’s worth mentioning at this point that having boundaries for brainstorms can actually make this part of the process much easier. In 2006, a team of architects wanted to study how having a fence around a playground would impact children and how they play. They observed children playing on a playground surrounded by a fence and compared it to children playing on a playground without the physical boundary of a fence. They found a striking difference in how the children interacted with the space. On the playground without the fence (1), the children gathered around the teacher and were reluctant to explore the space. On the playground with the fence (2), the children explored the entire playground, feeling more free. The study concluded that the boundary (in this case a fence) made the children feel more at ease to explore and play. We can draw parallels with this. By providing some boundaries and a specific problem to solve, we can actually improve the creative process. “The three Rs”: A framework to develop content ideas for niche link targets The content ideas we produce need to resonate with our niche audience, so we need to get immersed in the topics they care about. And there are some unique and perhaps unexpected ways we can do this. Before you start thinking about creative content, ensure you follow the Three R’s: Research Reddit - join subreddits related to the audience you want to target - Reddit is the front page of the internet and it’s likely you’ll find your audience there Quora - discover the questions your audience want to know the answers toFacebook Groups - joining very audience specific groups lets you see the genuine conversations that the community are havingBuzzsumo - discover the topics that are trending and getting tons of engagement and clicks on social media React Google Alerts - Set up alerts for keywords and phrases surrounding your identified topics ie: work from anywhereGoogle Trends - Check to see if any topics are experiencing a spike in searches as this can highlight the popularity of trends#JournoRequest / Response Source / HARO - Keep an eye on the type of requests that journalists are making to see if they match the style of content you’re planning Relevance Audience — would my client or brand's audience be interested in this content? Authority — is my client or brand an authority on the subject? Could they be interviewed about it? Keywords — does it contain keywords that we want to rank for, and do we have a page on the site that makes sense to link to?Newsworthiness — will journalists care about what we are saying? What are we adding to the conversation? A strategic approach can give you the competitive edge, but it’s all about the set up It is so easy to get carried away chasing the tail of your competition, but with this approach, you’ll begin to create content designed specifically for niche audiences that creates beneficial gaps between you and your competitors. Remember, there’s no better link to build than one that the competition doesn’t have yet. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Creating Competitor Link Gaps Is Just as Important as Closing Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Creating Competitor Link Gaps Is Just as Important as Closing Them"
    },
    {
      "level": "H2",
      "text": "What are link gaps, and how do we find them?"
    },
    {
      "level": "H2",
      "text": "Create link gaps in competitive industries with an audience-first mindset"
    },
    {
      "level": "H2",
      "text": "Case Study: How we identified niche link targets for a well-established brand in a competitive vertical"
    },
    {
      "level": "H2",
      "text": "Identify new audiences by asking the most important questions"
    },
    {
      "level": "H2",
      "text": "The results of this audience-led approach to digital PR"
    },
    {
      "level": "H2",
      "text": "How to find suitable sites and link targets"
    },
    {
      "level": "H3",
      "text": "Searching manually with Google"
    },
    {
      "level": "H3",
      "text": "Discovering similar sites"
    },
    {
      "level": "H2",
      "text": "Content ideas for niche link targets"
    },
    {
      "level": "H3",
      "text": "How boundaries can help"
    },
    {
      "level": "H3",
      "text": "“The three Rs”: A framework to develop content ideas for niche link targets"
    },
    {
      "level": "H4",
      "text": "Research"
    },
    {
      "level": "H4",
      "text": "React"
    },
    {
      "level": "H4",
      "text": "Relevance"
    },
    {
      "level": "H2",
      "text": "A strategic approach can give you the competitive edge, but it’s all about the set up"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    }
  ],
  "author": "Rebecca Moss\n          \n            Rebecca Moss\n          \n            Rebecca Moss"
}