{
  "url": "https://moz.com/blog/create-a-one-page-site",
  "slug": "create-a-one-page-site",
  "title": "Create a Decent One-Page Local Business Site - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Nothing could be worse for a business than existing customers thinking you no longer exist. With millions of Google Business Profile websites being shut down, Miriam Ellis outlines your options for a free/cheap replacement site, with tons of tips for making a strong 1-page presence.",
  "content": "How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown Local SEO | Search Engines By: Miriam Ellis Edited By: Emilie Martin February 19, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis Edited By: Emilie Martin February 19, 2024 How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was concerned back in 2017 when Google waded into the pool of companies offering free/cheap small business websites because of the brand’s documented pattern of regularly retiring products they roll out. It’s one thing to abandon an experiment no one is counting on, but quite another to leave a huge number of the smallest local business owners in the lurch like this. By December 2017, more than 1 million business owners were using this service, and the most recent estimate I’ve seen is as high as 22 million worldwide users. This means that millions of local businesses on the tightest budgets will be impacted by Google’s March 2024 shutdown of this product: As the announcement says, Google will shut down these sites and redirect searchers to your Google Business Profile until June 10, but after that, customers trying to find a website for you will be given no clue as to where your site went or what happened. They may wrongly conclude that your company has closed. Nothing could be worse for business than existing customers thinking you no longer exist, so you’ve got to act quickly to come up with a plan to replace your former Google website. Let’s consider your best options together today, and we’ll break it down into five practical tips. Tip 1: Bulk up your Google Business Profile and build out your listings elsewhere Suppose you are running one of the millions of businesses affected by the GBP website shutdown. In that case, you may not be feeling too excited about investing more time in a Google product. Still, the fact is, your Google Business Profile remains one of your most valuable and visible local business assets, whether you have a website or not. Now is the time to invest as much energy as possible in thoroughly filling out your listing with proper categories, images, videos, Updates posts, FAQs, and more so that it can act as a sort of stand-in for a website. Ensure you respond to every review you’ve earned to signal that your business is active. Write several new Google Updates posts so that their timestamps prove you haven’t gone out of business. Please consult this chapter of Moz’s free Essential Local SEO Strategy Guide to understand the many fields you can control in your Google Business Profile. The fuller you make your listing, the better your chances of potential customers finding the information they need to decide to contact or visit your business. Once you have filled out as many fields as you can in your GBP, do a lookup of your most important keywords and see which directories are coming up for them: If you have the budget, using a service like Moz Local can help you get listed on major directories for a modest fee, but if you just can’t afford that yet, don’t worry; you can manually build out your listings on most of the directories that rank highest for your most important search terms. By being listed on a variety of highly-ranked directories, you will increase your chances of potential customers finding you while you are working to replace your lost Google Business Profile website. It’s important to know, though, that most directory listings don’t go live immediately, so it’s not an instant magical solution. If you don’t yet know what your most important keywords are, you can do some searches for free in Moz Keyword Explorer. Tip 2: Embrace the Hidden Gems forum trend If the community you serve has a local forum, now is the time to become a regular participant there. An apparent outcome of the “hidden gems” component of Google’s Helpful Content update is an uptick in forum-based results in the SERPs, including the local SERPs. As my friends at Near Media describe it: “The boost Google is giving to forums and social content is intended to deliver more information from real people, with personal expertise, insights or first-hand knowledge. This is also a way for Google to preemptively address the coming AI content crisis and other lower quality content (e.g., spam, lead-gen) that doesn't really serve users.” Greg Sterling, Mike Blumenthal, and David Mihm point to old, established platforms like the Berkeley Parents Network, and I’ve often referenced community hubs like the West Seattle Blog’s forum. Research whether your town or city has such a forum and become active there. Note that this does not mean continuously pitching your business there, which will only annoy your neighbors and potential customers! Instead, participate in discussions and try to be helpful to others as you develop a reputation for trustworthiness and community spirit. Then, when someone appears on the platform asking where to get their wedding dress altered, their fence rebuilt, or the tree trimmed, you’ll be able to respond from a place of sharing rather than hard-selling, and if you are well-liked enough, you may find neighbors recommending you. If your community has no stand-alone forum, you may be able to find a subreddit on Reddit for your region. The goal of this activity for your local business is twofold: firstly, to become more connected with your community so that it becomes local wisdom that you offer a particular service when neighbors need it and, secondly, that you may find some of your threads surfaced by Google in the local results as they strive to provide content based on real experiences rather than AI fantasies. But, you’ll still want a website to direct interested parties to, so we move on to tip 3. Tip 3: Re-build a basic website elsewhere I want to be clear here that I am not vouching for the quality of any of these solutions to replace what you formerly had with your GBP site. I am simply offering this list of free/inexpensive website solutions for your research and investigation. I hope you can find a solution that works for your budget in this short list: Canva — You can build a 1-page website on Canva for free, but you will need to budget for your own domain name. Their visual design tools are very good, and I use them all the time, but the advice on their website SEO resource is very naive. Don’t pay attention to any resource telling you that you will “be on top of search results” with a one-page website, as Canva claims. SEO is more complicated than that, with zero guarantees. When your budget is tight, your expectations must be realistic, regardless of what website builder platforms say.WordPress.com and WordPress.org — This older, popular solution has plans that range from free to enterprise-level. The main difference between the two flavors of WordPress is that WordPress.com sites have built-in hosting, and WordPress.org sites use the software to develop a site that is hosted elsewhere. WordPress may be a good choice if you are confident that your business will be successful and grow over time. The platform enables you to develop a more sophisticated presence as you grow and is one of the more SEO-friendly solutions. However, WordPress generally requires a bit more technical learning than some of the other website builder offerings.Squarespace — Offers a 1-year free trial if something totally free is what you need right now, but you’ll need to budget for their fees after that year has ended. They have a variety of website templates to choose from.Wix — Similarly, Wix lets you build a site for free and offers you a free domain for one year, after which you’ll need to pay for one of their plans. Weebly — Weebly has a free plan for one of their websites, but you’ll need to pay for your own domain unless you opt to use a Weebly subdomain.Whitespark has rolled out a $1/month one-page website solution in response to the GBP site shutdown. Finally, a variety of hosting companies offer “free” or inexpensive website builder programs if you pay them for the domain or domain/hosting. As always, be wary of any claims that using any product will make you #1 in search engines. These claims are misleading. And read “best of” lists with care. Companies listed in them may have paid for inclusion, or such lists may have been generated carelessly by AI, meaning they have little or no basis in reality. If you can, reach out to your local business peers to ask what they are using for their site and what they like/don’t like about their platform. If you’re not connected to fellow entrepreneurs in your town or city, research whether your community has a local business association of any kind. You could likely use lots of support right now! Tip 4: Map out the basics you need to include on your new 1-page website. Once you’ve selected a solution to replace your 1-page Google Business Profile site, take the time to map out everything you need to include on your new page. The truth is, no 1-page website is ideal because it limits your SEO opportunities, but let’s work smart with what we’ve got! You can fit a ton of helpful information onto a single page. You’ll be hoping to grow your site beyond a single page as your business can afford it and budget time to build it, but to get started, here’s a mockup of a single-page local business site that contains 11 key elements designed to convert visitors into customers: Key to the one-page website mockup: Create a logo in whatever design program you end up using. Keep it simple.Make the header on your page count as your unique selling proposition (USP), and include the name of your city or service region. In this case, our fictitious local business’ USP is that they offer wedding dress alterations in Willow Creek, California. Create a contact area on the page that includes your complete business name, address (if applicable), phone number, and hours of operation. If your business is home-based and you don’t want to share your home address, just put the city and state name, but don’t forget your phone number!Put your best photo on the page that tells the clearest story about what you do. If there is a highly visual component to your business, you might want to make this photo area a slideshow with thumbnails so the visitor can see multiple images. Or, you might embed a video instead if you’ve got one.Use your first paragraph of the main body text to describe everything your business does and where you are located in clear, short sentences. You can add more text below, of course, but make that first paragraph really count for visitors in a hurry!If you have a physical location, embed a map on the page showing where your business is located. If you run a service area business (like a tree trimmer or plumber), indicate your service area on the map.Put all of your services into a list, even if you’ve mentioned them in the main body text. Label it “services”. If you vend goods instead of services, list your most popular items in this area.If at all possible, feature reviews/testimonials from your satisfied customers. It adds so much to the credibility of your business; after all, 89% of consumers trust what customers say about brands more than what brands say about themselves. Include links to all social media and review platforms on which customers can connect with you and learn more about how customers like your business.Include any additional contact information, such as your text number, email address, fax number, or anything else applicable. You want to be sure you’ve spelled out every possible way a customer can contact you because you are counting on this one page to drive leads.Never publish any page without a clear call to action (CTA). Here, the business owner is urging customers to phone her so she can solve their problems. Make it big and bold! A single-page website can best be viewed as an online brochure for the business, and as you can see, we can fit tons of actionable and persuasive information into a very small space. I highly recommend that you go beyond what I’ve shown in the mockup. A one-page site can be as long as you like, and the more text, photos, videos, and other media you include on the page, the stronger it will be, but try to put your main USP, contact, credibility, and goods/service information up top so that visitors can quickly understand and choose your business. 5. Consider whether social media can replace having a website Thanks to platforms like Instagram, Facebook, and YouTube, it’s possible to run a small business entirely on social media without investing in developing and hosting a website. I know multiple small entrepreneurs who earn a modest living baking bread, walking dogs, and selling crafts to their local community “sitelessly,” using their social profiles as their point of connection. This arrangement may work for you, too, but it comes with one significant risk. Right now, you’re experiencing what it is like when you build your presence on a third-party platform (like Google), and then the company summarily pulls the rug out from under your feet. What Google has done in sunsetting GBP websites can happen on any social platform, too. Every Instagram user I know is still complaining about a change the platform made to promote reels because it has impacted how much traffic and money users are earning. Whenever you are renting space from a third party, a large part of your fate is out of your hands, which is a challenging position to be in. I’ve written a lot about renting vs. owning customer journeys because I always want businesses to have maximum control of customer experience and their own destiny. To that end, while you may be able to build up a large enough social following to run your business sitelessly, it’s important to realize your efforts can be undone by a single update. That being said, your social profiles could definitely help tide you over as you are researching where to create a new website of your own. A word of encouragement Never forget the real-world society that pre-dates social media, in particular, and the internet, in general. Suppose you can create an offline campaign to encourage your existing customers to recommend you via word-of-mouth to their local friends and family. In that case, it can be one of the most powerful steps you can take towards decreasing some of your irksome dependence on big online players who change the rules (and your life!) on a whim. I ran my own web design and SEO agency for years, almost entirely on referrals, and the shutdown of GBP sites is a learning moment for all of us on why the online world is rather unstable, making offline reality as vital as ever to local business owners and their customers. I’m so sorry if Google’s decision has negatively impacted your small business, but I’m confident that you will find new ways to keep following your professional dreams. Wishing you good luck in creating a new home-base online for your business and a loyal real-world customer base in your local community! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown"
    },
    {
      "level": "H2",
      "text": "Tip 1: Bulk up your Google Business Profile and build out your listings elsewhere"
    },
    {
      "level": "H2",
      "text": "Tip 2: Embrace the Hidden Gems forum trend"
    },
    {
      "level": "H2",
      "text": "Tip 3: Re-build a basic website elsewhere"
    },
    {
      "level": "H2",
      "text": "Tip 4: Map out the basics you need to include on your new 1-page website."
    },
    {
      "level": "H2",
      "text": "5. Consider whether social media can replace having a website"
    },
    {
      "level": "H2",
      "text": "A word of encouragement"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}