{
  "url": "https://moz.com/blog/create-your-own-bullet-train-to-ppc-optimization",
  "slug": "create-your-own-bullet-train-to-ppc-optimization",
  "title": "Create Your Own \"Bullet Train\" to PPC Optimization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here's a quick and dirty tip for those of you managing PPC campaigns - and even those of you who want to improve your organic campaigns. It illustrates my philosophy that by being willing and open to learn from everybody - especially blackhats and people sm...",
  "content": "Create Your Own \"Bullet Train\" to PPC Optimization Paid Search Marketing (PPC) By: Gabriel Goldenberg January 31, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg January 31, 2008 Create Your Own \"Bullet Train\" to PPC Optimization Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Here's a quick and dirty tip for those of you managing PPC campaigns - and even those of you who want to improve your organic campaigns. It illustrates my philosophy that by being willing and open to learn from everybody - especially blackhats and people smarter or more aggressive than you - you can often come up with new tactics applicable to your own situation. The thing that's so novel about this tactic is that it allows you to test a variety of PPC ads much faster and with much greater precision. It's the bullet train of PPC campaign optimization. Here are the rails, wagons, engines, and other parts you'll need: Generic keyword domains getting type-in traffic. The more of your PPC campaign's generic keyword domains you can get hold of, the better. Some SERP CSS and design; available from any reputable SE near you Good quality analytics software. Andrew Goodman recommends Conversion Ruler; I've seen Web Trends in action (decent, but could be better); a contact of mine uses Fireclick. For our purposes it needs to scale and needs to be able to track A creative mind Let's get down to business. First, get ahold of as many generic keyword domains as you can, which get type-in traffic. You can contact domain owners directly through the whois listed information, or you can try working through third party domain brokers. If you're new to it, learn more at Namepros, aka the best domain name community online. Most of them will want to sell you the domain, but you might be able to rent it out first to see how well the traffic converts, etc. (I thought that renting domain names was an original idea, but it looks like there's already some companies doing this.) Next, set up a landing page like the affiliate spammer that my favourite blackhat described here, in order to replicate a real SERP environment for type-in visitors. The key characteristics are the \"organic SERPs section\" all linking to your site, albeit to different pages, and the ads being those you'd like to test. Try out very different versions of your copy. If ever you're short, or if you find yourself relying on keyword insertion too much, check out how the pros write their copy. You can also speak to Bill, Ann, Christine, Paul, Kat, or Brian if need be. The viagra SERPs will have changed by the time this is posted, but some of them noticeably used no keywords in the title or description, focusing on other details. One of them had the price-per-pill and number of pills in an order while others mentioned free shipping and so on. Third, tie all the listings into your analytics and see what gets the best ROI. You can measure conversion rate, cost per acquisition (by estimating PPC costs for each position or SEO costs to reach each spot), etc. On a related note, I just bought Avinash's Web Analytics An Hour A Day, and it's looking good :). And that's how you can quickly see which ads and title/meta/URL organic combos convert best, quickly. The reason this works faster is because you can test several ads against each other simultaneously. Another advantage of this is that you can use it for competitive intelligence: duplicate a competitor's ad, landing page, etc, and see what the CTR and conversion rate is. Then take the PPC campaigns you manage and the SEO campaigns and roll out the best stuff. Another way to approach this is to test new keywords you're thinking of targeting. On a related note, it appears that Kevin Ham is going ahead with an idea I had wanted to do myself: make a company around developing premium generic domains. The scary thing is that he's hiring search marketers... It's going to be tough as nails to compete against his sites, when they'll have the generic keyword domains! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Create Your Own \"Bullet Train\" to PPC Optimization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Create Your Own \"Bullet Train\" to PPC Optimization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}