{
  "url": "https://moz.com/blog/create-a-memorable-experience-focus-on-your-customers",
  "slug": "create-a-memorable-experience-focus-on-your-customers",
  "title": "Create a Memorable Experience & Focus on Your Customers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Like many of you, I work in a heavily saturated industry with a lot of competitors. It's gotten to a point where everyone pretty much sells the same thing. It's like bottled water. All we're really competing on is price and brand. Our company entered the game a bit late so most of the big players…",
  "content": "Create a Memorable Experience & Focus on Your Customers Branding By: Alan Wu April 24, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Alan Wu April 24, 2013 Create a Memorable Experience & Focus on Your Customers Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A little introduction. I'm the Marketing Manager for Bay Alarm Medical, a medical alert company that provides seniors with a way to get rapid 24/7 emergency help in the unfortunate event of a fall, heart attack, stroke, etc. Like many of you, I work in a heavily saturated industry with a lot of competitors. It's gotten to a point where everyone pretty much sells the same thing. It's like bottled water. All we're really competing on is price and brand. Our company entered the game a bit late so most of the big players had already secured their spots on the first page of Google. During the early years, we probably averaged around page five with our SERPs. Most of our budget went to PPC and although we did pretty well in that area, we knew we were missing a lot of opportunities by not having any organic presence. We tried everything to get our rankings up - buying links, focusing on link volume, writing useless press releases and updating our blog with keyword-stuffed content that no real human would ever read. In short, we did everything we could to make the search algorithms like us. All of the above strategies worked for our competitors so like sheep, we followed suit. Our rankings on Google started to increase (from page five to page three in a couple of months). We were pretty happy with the steady growth so we continued on this path. About six months into it, I received a six-month link report from our agency and saw that they had posted a comment on a very reputable caregiver forum. I was pretty excited and wanted to see what they had written. This was what I found... This is a great platform for caregivers. This gives the opportunity to exchange the views. Such forums will help uncover many facts. Health care is a serious issue; so people should be able to get the latest information on different issues like medical alert alarm. (last three words anchored to our homepage) I was extremely disgusted and embarrassed that our company was being represented in this fashion. Furthermore, these links provided absolutely no value to the discussion, to the readers, and to the community. I wish I could show you the entire forum thread but it's since been removed. Even though we started seeing our rankings rise, the agency was immediately fired. Keep in mind that this was all pre-Panda/Penguin and our competitors were sitting pretty with tens of thousands of backlinks. At the time, making the call to stop our linkbuilding efforts was a very risky and gutsy move. So that's exactly what we did. High Quality Content The medical alert industry is, for a lack of a better word, tasteless. Google \"medical alert\" and you'll come across a lot of websites that look the same. All of these websites use the same message, have the same taglines, and even use the same stock images. We decided that it was time for a change. Instead of focusing on our rankings, we decided that it was more important to provide high quality content to our visitors, deliver a memorable shopping experience, and to simply set ourselves apart from the rest of the pack. A little #rcs if you will. So here's what we came up with. We felt that creating a cartoon brought several advantages. Not only were we able to differentiate ourselves, we were able to talk about a hard subject that most seniors have a hard time coming to grips with. The cartoon allowed us to approach a difficult subject while giving it a soft and playful feel. Furthermore, the cartoon gave our company topics that were fun to talk and write about. We used Grumpy Grandpa to tie in articles about senior fall prevention, informative senior-related infographics and even implemented the character in various lead forms and call to action elements of our website. It also spruced up our social media efforts. Allow me to provide some examples: Homepage Before (left) and After (right): We ditched the old homepage with the stock image of the senior couple (which by now is probably being used by another company) in favor of Grumpy Grandpa and his daughter. The homepage is now responsive and gives our visitors something to remember us by. Here's our old boring web lead form, next to the new form where we aim to provide a more inviting user experience for our visitors. Fun Holiday Themes Social Media Content Old Blog Posts - Here's an example of the kind of blogging we used to do. You'll notice obvious keyword stuffing, anchor text \"strategies\", and some of the most boring content you'll ever come across. These posts were written for us by an online news and content agency which we no longer work with. http://www.bayalarmmedical.com/medical-alert-blog/common-causes-behind-falls/ New Blog Posts - Here's an example of our newer blog posts. You'll immediately notice a difference in style and tone. All of our posts are now written in-house. The goal was to make it more \"human\" and to actually write it as if we were having a conversation with a customer. http://www.bayalarmmedical.com/medical-alert-blog/meet-grumpy-grandpa/ Focusing On What Matters So you're probably wondering how this helped us with regards to SEO. While I can't get into specifics, let's just say that with each iteration of Panda and Penguin, we've consistently moved up the rankings. We've never had to use the disavow tool and as bad as some of our old linkbuilding strategies were, we never had to remove any spammy or unnatural links. The same can't be said for some of our competitors. Here's a quick organic traffic snapshot from Google Analytics. No crazy up or down movements. Just a nice steady trendline. Dear Matt Cutts, please keep the updates coming. As important as rankings and driving traffic are, I believe that companies should focus more on what their visitors are doing while browsing their website(s). Since the launch of Grumpy Grandpa and a shift in focus from algorithm optimization to UX, we've seen significant improvements to time on site, pages per visit and bounce rates. When you focus on creating the best experience for your customer, you build trust and once you have that, rankings, site traffic, leads and sales will eventually take care of itself. If you happened to be at SMX West this year, I think the biggest takeaway boiled down to one idea: The notion that if you want to succeed in search, you'd better focus on providing your customers with an awesome user experience. I'm not saying that focusing on algorithm optimization is a bad thing. With regards to link building for example, we might average a couple of links per month. But those couple of links are usually from partners, reputable organizations, and places that we think the link will actually provide value for the visitor. No more spamming comment sections, focusing on anchor text and other blackhat strategies. Conclusion We recently received a call from a customer that wanted to sign up for our service. Here's how the conversation went: Sales Rep - How can I help you today? Customer - I want to get one of those medical alert systems. Sales Rep - Great! Which package were you interested in? Customer - I don't know... whatever Grumpy Grandpa is using in your video! Every time we get a call from a customer that tells us that our video was able to put a smile on their face or at the very least, entertain them for a couple of minutes, it really proves that providing awesome content is the way to go. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Create a Memorable Experience & Focus on Your Customers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Create a Memorable Experience & Focus on Your Customers"
    },
    {
      "level": "H2",
      "text": "High Quality Content"
    },
    {
      "level": "H2",
      "text": "Focusing On What Matters"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alan Wu\n          \n            Alan Wu\n          \n            Alan Wu"
}