{
  "url": "https://moz.com/blog/cro-case-study",
  "slug": "cro-case-study",
  "title": "The Anatomy of a $97 Million Page: A CRO Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A highly converting landing page is never an accident — it's a carefully constructed masterpiece. In this CRO case study, traditional marketing wisdom combines with modern creativity to architect a page with immense potential value.",
  "content": "The Anatomy of a $97 Million Page: A CRO Case Study Conversion Rate Optimization (CRO) J By: Jasper Kuria September 19, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jasper Kuria September 19, 2017 The Anatomy of a $97 Million Page: A CRO Case Study Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In this post, we share a CRO case study from Protalus, one of the fastest-growing footwear companies in the world. They make an insole that corrects the misalignment suffered by roughly 85% of the population. Misalignment is the cause of most back, knee, and foot pain. Back pain alone is estimated to be worth $100 billion a year. Summary We (with Protalus’ team) increased direct sales by 91% in about 6 months through one-click upsells and CRO. Based on the direct sales increase, current run-rate revenue, the \"Virtuous Cycle of CRO\"-fueled growth rate, and revenue multiple for their industry, we estimate this will add about $97 million to the company’s valuation over the next 12–18 months*. A concrete example of the Virtuous Cycle of CRO: Before we increased the conversion rate and average order value, Google Adwords was not a viable channel. Now it is, opening a whole new floodgate of profitable sales! Ditto for at least two other channels. In part due to our work, Protalus’ annual run-rate revenue has grown by 1,212% in less than a year. * Protalus’ core product is differentiated, patent protected, and high margin. They also have a strong brand and raving fans. In the Shoes & Apparel category, they're most similar to Lululemon Athletica, which has a 4x plus revenue multiple. While Nike and Under Armor engage in a bloody price war and margin-eroding celebrity endorsements, Lululemon commands significantly higher prices than its peers, without big-name backers! Business gurus Warren Buffett and Charlie Munger often say that the true test of a defensive moat around a business is “Can you raise prices without hurting sales?” Protalus has this in spades. They've raised prices several times while simultaneously increasing units sold — from $39 to $49 to $59 to $69 to $79 to $99 to $119. One-click upsells: A 21% sales boost When we do engagements, the first order of business to uncover low-hanging fruit growth opportunities. This accomplishes two things: It helps the client get an immediate ROI on the engagement It earns us goodwill and credibility within the company. We then have wide latitude to run the big, bold experiments that produce huge conversion lifts In Protalus’ case, we determined they were not doing post-purchase one-click upsells. Adding these immediately boosted sales by 21%. Here’s how we did it: On their main sales landing page, Protalus has an offer where you get $30 off on the second pair of insoles, as well as free expedited shipping for both. About 30% of customers were taking this offer. For those who didn’t, right after they purchased but BEFORE they got to the \"Thank You\" page, we presented the offer again, which led to the 21% sales increase. Done correctly, one-click upsells easily boost sales, as customers do not have to re-enter credit card details. Here’s the best way to do them: The Little Secret that Made McDonalds a $106 Billion Behemoth. Below is the final upsell page that got the 21% sales increase: We tested our way to it. The key effective elements are: 1. Including “free upgrade to expedited shipping” in the headline: 145% liftThe original page had it lower in the body copy: Google Experiments screenshot showing 145% lift 2. Adding celebrity testimonials: 60% lift Google Experiments screenshot showing a 60% lift Elisabeth Howard’s (Ms. Senior America) unsolicited endorsement is especially effective because about 60% of Protalus’ customers are female and almost one-third are retired. We uncovered these gems by reviewing all 11,000 (at the time) customers' testimonials. 3. Explaining the reasons why other customers bought additional insoles. See the three bulleted reasons on the first screenshot (convenience, different models, purchasing for loved ones). Radical re-design and long-form page: A 58% conversion lift With the upsells producing positive ROI for the client, we turned to re-designing the main sales page. The new page produced a cumulative lift of 58%, attained in two steps. [Step 1] 35% lift: Long-form content-rich page Optimizely screenshot shows 35% lift at 99% statistical significance Note that even after reaching 99% statistical significance, the lift fluctuated between 33% and 37%, so we'll claim 35%. [Step 2] 17% lift: Performance improvements The new page was quite a bit longer, so its \"fully loaded\" time increased a lot — especially on mobile devices with poor connections. A combination of lazy loading, lossless image shrinking, CSS sprites, and other ninja tactics led to a further 17% lift. These optimizations reduced the page load time by 40% and shrunk the size by a factor of 4x! The total cumulative lift was therefore 58% (1.35 x 1.17 = 1.58). With the earlier 21% sales gain from one-click upsells, that's a 91% sales increase (1.21 x 1.35 x 1.17 = 1.91). Dissecting the anatomy of the winning page To determine what vital few elements to change, we surveyed the non-converting visitors. Much of the work in A/B testing is the tedious research required to understand non-converting visitors. \"Give me six hours to chop a tree and I'll spend the first four sharpening the axe.\" – Abraham Lincoln All CRO practitioners would do well to learn from good, ol’ honest Abe! We used Mouseflow’s feedback feature to survey bouncing visitors from the main landing page and the check-out page. The top objection themes were: Price is too high/product too expensive Not sure it will work (because others didn’t work before) Not sure it will work for my specific condition Difficulty in using website We then came up with specific counter-objections for each: A landing page is a “salesmanship in digital print,” so many of the techniques that work in face-to-face selling also apply. On a landing page, though, you must overcorrect because you lack the back- and-forth conversation in a live selling situation. Below is the list of key elements on the winning page. 1. Price is too high/product is too expensiveThis was by far the biggest objection, cited by over 50% of all respondents. Thus, we spent a disproportionate amount of effort and page real estate on it. Protalus’ insoles cost $79, whereas Dr. Scholls (the 100-year-old brand) cost less than $10. When asked what other products they considered, customers frequently said Dr. Scholls. Coupled with this, nearly one-third of customers are retired and living on a fixed income. “I ain’t gonna pay no stinkin' $79! They cost more than my shoes,” one visitor remarked. To overcome the price objection, we did a couple of things. Articulated the core value proposition and attacked the price from the topWhen prospects complain about price it simply means that they do not understand or appreciate the the product’s value proposition. They are seeing this: The product’s cost exceeds the perceived value To effectively deal with price, you must tilt the scale so that it looks like this instead: The perceived value exceeds cost While the sub-$10 Dr. Scholls was the reference point for many, we also learned that some customers had tried custom orthotics ($600 to $3,000) and Protalus’ insoles compared favorably. We therefore decided our core value proposition would be: “Avoid paying $600 for custom orthotics. Protalus insoles are almost as effective but cost 87% less.” ...forcing the $600 reference point, instead of the $10 for Dr. Scholls. In the conversion rate heuristic we use, the value proposition is the single biggest lever. We explained all this from a \"neutral\" educational standpoint (rather than a salesy one) in three steps: 1. First, we use “market data” to explain the cause of most pain and establish that custom orthotics are more effective than over-the-counter insoles. Market data is always more compelling than product data, so you should lead with it. 2. Next, like a good trial lawyer, we show why Protalus insoles are similar to custom orthotics but cost 87% less: 3. Finally, we deal with the \"elephant in the room\" and explain how Protalus insoles are fundamentally different from Dr. Scholls: We also used several verbatim customer testimonials to reinforce this point: Whenever possible, let others do your bragging! Attacked price from the bottomHere, we used a technique known as “break the price down to the ridiculous.” $79 is just 44 cents per day, less than a K-cup of coffee — which most people consume once or twice a day! This makes the price more palatable. Used the quality argumentThe quality technique is from Zig Ziglar’s Sales Training. You say to a prospect: “Many years ago, our company/founder/founding team made a basic decision. We decided it would be easier to use the highest quality materials and explain price one time than it would be to apologize for low quality forever. When you use the product/service, you’ll be glad we made that decision.\" It's especially effective if the company has a well-known \"maker\" founder (like Yvon Chouinardat at Patagonia). It doesn’t work as well for MBAs or suits, much as we need them! Protalus’ founder Chris Buck designed the insoles and has a cult-like following, so it works for him. Dire outcomes of not taking actionHere we talked about the dire outcomes if you do not get the insoles; for example, surgery, doctors’ bills, and lost productivity at work! Many customers work on their feet all day (nurses, steelworkers, etc.) so this last point is highly relevant. Microsoft employed this technique successfully against Linux in the early 2000s. While Linux was free, the \"Total Cost of Ownership\" for not getting Windows was much higher when you considered support, frequent bugs, less accountability, fewer feature updates, and so on. 2. Not sure the product will workFor this objection, we did the following: Used Dr. RomanskyWe prominently featured Dr. Romansky, Protalus’ resident podiatrist. A consultant to the US Men’s and Women’s soccer teams and the Philadephia Phillies baseball team, he has serious credibility. The \"educational\" part of the landing page (above the fold) is done in \"his voice.\" Before, only his name appeared on a rarely visited page. This is an example of a \"hidden wealth\" opportunity! Used celebrity testimonials on the main landing pageBack in 1997, a sports writer asked Phil Knight (Nike’s founder): “Is there no better way for you to spend $100 million?” You see, Knight had just paid that staggering sum to a young Tiger Woods — and it seemed extravagant! Knight’s answer? An emphatic “No!” That $100 million would generate several billion dollars in sales for Nike over the next decade! Celebrity testimonials work. Period. Since our celebrity endorsements increased the one-click upsell take-rate by 60%, we also used them on the main page: Used expert reviewsWe solicited and included expert reviews from industry and medical professionals. Below are two of the four we used: These also helped address the price concern because some site visitors had expressed discomfort paying so much for an over-the-counter product without doctor recommendation. 3. Not sure the product will work for meThis is different from “Not sure the product will work” and needs to be treated separately. If there’s one thing we’ve learned over the years, it is that everyone thinks their situation is one-in-a-million unique! We listed all the conditions that Protalus insoles address, as well as those they do not. In addition, we clearly stated that the product does not work for 15% of the population. By conspicuously admitting this (NOT just in the fine print section!) you are more credible. This is expressed in the Prospect’s Protest as: “First tell me what your product CANNOT do and I might believe you when you tell me what it can do!” 4. Difficulty in using the siteSeveral visitors reported difficulty using the site, so we used Mouseflow’s powerful features to detect and fix usability issues. Interestingly, the visitor session recordings confirmed that price was a big issue as we could clearly see prospects navigate to the price, stare incredulously, and then leave! Accentuate the customers’ reasons for buyingMost of the opportunity in CRO is in the non-converting visitors (often over 90%), but understanding converting ones can yield crucial insights.* For Protalus, the top reasons for buying were: Desperation/too much leg, knee, or back pain/willing to try anything (This is the 4M, for \"motivation,\" in the strategic formula we use) The testimonials were persuasive Video was convincing On the last point, the Mouseflow heatmaps showed that those who watched the video bought at a much higher rate, yet few watched it. We therefore placed the video higher above the fold, used an arrow to draw attention, and inserted a sub-headline: A million-dollar question we ask buyers is: “Was there any reason you ALMOST DID NOT buy?” Devised by Conversion Rate Experts' Cambridge-educated Dr. Karl Blanks, who coined the term “conversion rate optimization” in 2006, this question earned him a commendation from the Queen of England!It's a great question because its answer is usually the reason many others didn’t buy. For every person who almost didn’t buy for reason X, I guarantee at least three others did not buy! Given the low response rates when surveying non-converting visitors, this question helps get additional intelligence. In our case, price came up again. *Sometimes the customers’ reasons for buying will surprise you. One of our past clients is in the e-cigarette/vaping business and a common reason cited by men for vaping was “to quit smoking because of my young daughter.” They almost never said “child” or “son”! Armed with this knowledge, we converted a whole new segment of smokers who had not considered vaping. Speed testimonialsOne of the most frequently asked questions was \"How soon can I expect relief?\" While Protalus addressed this in their Q&A section, we included conspicuous “speed testimonials” on the main page: For someone in excruciating pain, the promise of fast relief is persuasive! Patent protection exclusivity & social proof Many of Protalus’ site visitors are older and still prefer to buy in physical stores, as we learned from our survey. They may like the product, but then think “I’ll buy them at the store.” We clarified that the product is only available on Protalus’ site. Mentioning the patent-protection added exclusivity, one of the two required elements for a compelling value proposition. At its core, landing page optimization isn’t about optimizing pages. A page just happens to be the medium used to optimize thought sequences in the prospect’s mind. Dr. Flint likes to say, “The geography of the page determines the chronology of thought sequences in the prospect’s mind.” As shown above, we repeated the social proof elements at the point of purchase. Tying it all togetherAfter systematically addressing each objection and adding various appeal elements, we strung them all in the cohesive long-form page below. We start with a powerful headline and Elisabeth’s story because it's both intriguing and relevant to Protalus’ audience, which skews female and over 55. The only goal of a headline is to get visitors to read what comes next — NOT to sell. The product’s price is not mentioned until we have told a compelling story, educated visitors and engaged them emotionally. Note that the winning page is several times longer than the control. There is a mistaken belief that you “just need to get to the point” because people won’t read long pages. In fact, a previous consultant told Protalus that their sales were low because the “buy button” wasn’t high enough on the page. :-) Nothing could be further from the truth. For a high-priced product, you must articulate a compelling value proposition before you sell! But also note the page is \"as long as necessary, but as short as possible.\" Buy buttons are sprinkled liberally after the initial third of the page so that those who are convinced needn’t \"sit through the entire presentation.\" AcknowledgementWe’d like to thank team Protalus for giving us wide latitude to conduct bold experiments and for allowing us to publish this. Their entrepreneurial culture has been refreshing. We are most grateful to Don Vasquez, their forward-thinking CMO (and minority owner), for trusting the process and standing by us when the first test caused some revenue loss. Thanks to Hayk Saakian, Nick Jordan, Yin-so Chen, and Jon Powell for reading drafts of this piece. Free CRO audit I can’t stress this enough: CRO is hard work. We spent countless hours on market research, studied visitor behavior, and reviewed tens of thousands of customer comments before we ran a single A/B test. We also solicited additional testimonials from industry experts and doctors. There is no magical silver bullet — just lots of little lead ones! Results like this don’t happen by accident. If you are unhappy with your current conversion rate for sales, leads or app downloads, first, we encourage you to review the tried-and-true strategic formula. Next, we'd like to offer Moz readers a free CRO audit. We’ll also throw in a free SEO (Search Engine Optimization) review. While we specialize in CRO, we’ve partnered with one of the best SEO firms due to client demand. Lastly, we're hiring. Review the roles and reasons why you should come work for us! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Anatomy of a $97 Million Page: A CRO Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Anatomy of a $97 Million Page: A CRO Case Study"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "One-click upsells: A 21% sales boost"
    },
    {
      "level": "H3",
      "text": "1. Including “free upgrade to expedited shipping” in the headline: 145% lift"
    },
    {
      "level": "H3",
      "text": "2. Adding celebrity testimonials: 60% lift"
    },
    {
      "level": "H3",
      "text": "3. Explaining the reasons why other customers bought additional insoles."
    },
    {
      "level": "H2",
      "text": "Radical re-design and long-form page: A 58% conversion lift"
    },
    {
      "level": "H3",
      "text": "[Step 1] 35% lift: Long-form content-rich page"
    },
    {
      "level": "H3",
      "text": "[Step 2] 17% lift: Performance improvements"
    },
    {
      "level": "H2",
      "text": "Dissecting the anatomy of the winning page"
    },
    {
      "level": "H3",
      "text": "1. Price is too high/product is too expensive"
    },
    {
      "level": "H4",
      "text": "Articulated the core value proposition and attacked the price from the top"
    },
    {
      "level": "H4",
      "text": "Attacked price from the bottom"
    },
    {
      "level": "H4",
      "text": "Used the quality argument"
    },
    {
      "level": "H4",
      "text": "Dire outcomes of not taking action"
    },
    {
      "level": "H3",
      "text": "2. Not sure the product will work"
    },
    {
      "level": "H4",
      "text": "Used Dr. Romansky"
    },
    {
      "level": "H4",
      "text": "Used celebrity testimonials on the main landing page"
    },
    {
      "level": "H4",
      "text": "Used expert reviews"
    },
    {
      "level": "H3",
      "text": "3. Not sure the product will work for me"
    },
    {
      "level": "H3",
      "text": "4. Difficulty in using the site"
    },
    {
      "level": "H4",
      "text": "Accentuate the customers’ reasons for buying"
    },
    {
      "level": "H4",
      "text": "Speed testimonials"
    },
    {
      "level": "H4",
      "text": "Patent protection exclusivity & social proof"
    },
    {
      "level": "H3",
      "text": "Tying it all together"
    },
    {
      "level": "H2",
      "text": "Acknowledgement"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Free CRO audit"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jasper Kuria\n          \n            Jasper Kuria\n          \n            Jasper Kuria"
}