{
  "url": "https://moz.com/blog/cross-domain-rel-canonical-seo-value-cross-posted-content",
  "slug": "cross-domain-rel-canonical-seo-value-cross-posted-content",
  "title": "Using the Cross Domain Rel=Canonical to Maximize the SEO Value of Cross-Posted Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Same content, different domains? There's a tag for that. Rel=canonical can inform Google that the same content exists on multiple sites. Rand covers how to use it properly and what to keep in mind in this edition of Whiteboard Friday.",
  "content": "Using the Cross Domain Rel=Canonical to Maximize the SEO Value of Cross-Posted Content Technical SEO | Whiteboard Friday | Content Marketing By: Rand Fishkin February 16, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 16, 2018 Using the Cross Domain Rel=Canonical to Maximize the SEO Value of Cross-Posted Content Technical SEO | Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Same content, different domains? There's a tag for that. Using rel=canonical to tell Google that similar or identical content exists on multiple domains has a number of clever applications. You can cross-post content across several domains that you own, you can benefit from others republishing your own content, rent or purchase content on other sites, and safely use third-party distribution networks like Medium to spread the word. Rand covers all the canonical bases in this not-to-be-missed edition of Whiteboard Friday. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about the cross-domain rel=canonical tag. So we've talked about rel=canonical a little bit and how it can be used to take care of duplicate content issues, point Google to the right pages from potentially other pages that share similar or exactly the same content. But cross-domain rel=canonical is a unique and uniquely powerful tool that is designed to basically say, \"You know what, Google? There is the same content on multiple different domains.\" So in this simplistic example, MyFriendSite.com/green-turtles contains this content that I said, \"Sure, it's totally fine for you, my friend, to republish, but I know I don't want SEO issues. I know I don't want duplicate content. I know I don't want a problem where my friend's site ends up outranking me, because maybe they have better links or other ranking signals, and I know that I would like any ranking credit, any link or authority signals that they accrue to actually come to my website. There's a way that you can do this. Google introduced it back in 2009. It is the cross-domain rel=canonical. So essentially, in the header tag of the page, I can add this link, rel=canonical href — it's a link tag, so there's an href — to the place where I want the link or the canonical, in this case, to point to and then close the tag. Google will transfer over, this is an estimate, but roughly in the SEO world, we think it's pretty similar to what you get in a 301 redirect. So something above 90% of the link authority and ranking signals will transfer from FriendSite.com to MySite.com. So my green turtles page is going to be the one that Google will be more likely to rank. As this one accrues any links or other ranking signals, that authority, those links should transfer over to my page. That's an ideal situation for a bunch of different things. I'll talk about those in a sec. Multiple domains and pages can point to any URL Multiple domains and pages are totally cool to point to any URL. I can do this for FriendSite.com. I can also do this for TurtleDudes.com and LeatherbackFriends.net and SeaTees.com and NatureIsLit.com. All of them can contain this cross-domain rel=canonical pointing back to the site or the page that I want it to go to. This is a great way to potentially license content out there, give people republishing permissions without losing any of the SEO value. A few things need to match: I. The page content really does need to match That includes things like text, images, if you've embedded videos, whatever you've got on there. II. The headline Ideally, should match. It's a little less crucial than the page content, but probably you want that headline to match. III. Links (in content) Those should also match. This is a good way to make sure. You check one, two, three. This is a good way to make sure that Google will count that rel=canonical correctly. Things that don't need to match: I. The URL No, it's fine if the URLs are different. In this case, I've got NatureIsLit.com/turtles/p?id=679. That's okay. It doesn't need to be green-turtles. I can have a different URL structure on my site than they've got on theirs. Google is just fine with that. II. The title of the piece Many times the cross-domain rel=canonical is used with different page titles. So if, for example, CTs.com wants to publish the piece with a different title, that's okay. I still generally recommend that the headlines stay the same, but okay to have different titles. III. The navigation IV. Site branding So all the things around the content. If I've got my page here and I have like nav elements over here, nav elements down here, maybe a footer down here, a nice little logo up in the top left, that's fine if those are totally different from the ones that are on these other pages cross-domain canonically. That stuff does not need to match. We're really talking about the content inside the page that Google looks for. Ways to use this protocol Some great ways to use the cross-domain rel=canonical. 1. If you run multiple domains and want to cross-post content, choose which one should get the SEO benefits and rankings. If you run multiple domains, for whatever reason, let's say you've got a set of domains and you would like the benefit of being able to publish a single piece of content, for whatever reason, across multiples of these domains that you own, but you know you don't want to deal with a duplicate content issue and you know you'd prefer for one of these domains to be the one receiving the ranking signals, cross-domain rel=canonical is your friend. You can tell Google that Site A and Site C should not get credit for this content, but Site B should get all the credit. The issue here is don't try and do this across multiple domains. So don't say, \"Oh, Site A, why don't you rel=canonical to B, and Site C, why don't you rel=canonical to D, and I'll try and get two things ranked in the top.\" Don't do that. Make sure all of them point to one. That is the best way to make sure that Google respects the cross-domain rel=canonical properly. 2. If a publication wants to re-post your content on their domain, ask for it instead of (or in addition to) a link back. Second, let's say a publication reaches out to you. They're like, \"Wow. Hey, we really like this piece.\" My wife, Geraldine, wrote a piece about Mario Batali's sexual harassment apology letter and the cinnamon rolls recipe that he strangely included in this apology. She baked those and then wrote about it. It went quite viral, got a lot of shares from a ton of powerful and well-networked people and then a bunch of publications. The Guardian reached out. An Australian newspaper reached out, and they said, \"Hey, we would like to republish your piece.\" Geraldine talked to her agent, and they set up a price or whatever. One of the ways that you can do this and benefit from it, not just from getting a link from The Guardian or some other newspaper, but is to say, \"Hey, I will be happy to be included here. You don't even have to give me, necessarily, if you don't want to, author credit or link credit, but I do want that sweet, sweet rel=canonical.\" This is a great way to maximize the SEO benefit of being posted on someone else's site, because you're not just receiving a single link. You're receiving credit from all the links that that piece might generate. Oops, I did that backwards. You want it to come from their site to your site. This is how you know Whiteboard Friday is done in one take. 3. Purchase/rent content from other sites without forcing them to remove the content from their domain. Next, let's say I am in the opposite situation. I'm the publisher. I see a piece of content that I love and I want to get that piece. So I might say, \"Wow, that piece of content is terrific. It didn't do as well as I thought it would do. I bet if we put it on our site and broadcast it with our audience, it would do incredibly well. Let's reach out to the author of the piece and see if we can purchase or rent for a time period, say two years, for the next two years we want to put the cross-domain rel=canonical on your site and point it back to us and we want to host that content. After two years, you can have it back. You can own it again.\" Without forcing them to remove the content from their site, so saying you, publisher, you author can keep it on your site. We don't mind. We'd just like this tag applied, and we'd like to able to have republishing permissions on our website. Now you can get the SEO benefits of that piece of content, and they can, in exchange, get some money. So your site sending them some dollars, their site sending you the rel=canonical and the ranking authority and the link equity and all those beautiful things. 4. Use Medium as a content distribution network without the drawback of duplicate content. Number four, Medium. Medium is a great place to publish content. It has a wide network, people who really care about consuming content. Medium is a great distribution network with one challenge. If you post on Medium, people worry that they can't post the same thing on their own site because you'll be competing with Medium.com. It's a very powerful domain. It tends to rank really well. So duplicate content is an issue, and potentially losing the rankings and the traffic that you would get from search and losing that to Medium is no fun. But Medium has a beautiful thing. The cross-domain rel=canonical is built in to their import tool. So if you go to Medium.com/p/import and you are logged in to your Medium account, you can enter in their URL field the content that you've published on your own site. Medium will republish it on your account, and they will include the cross-domain rel=canonical back to you. Now, you can start thinking of Medium as essentially a distribution network without the penalties or problems of duplicate content issues. Really, really awesome tool. Really awesome that Medium is offering this. I hope it sticks around. All right, everyone. I think you're going to have some excellent additional ideas for the cross-domain rel=canonical and how you have used it. We would love you to share those in the comments below, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Using the Cross Domain Rel=Canonical to Maximize the SEO Value of Cross-Posted Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Using the Cross Domain Rel=Canonical to Maximize the SEO Value of Cross-Posted Content"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Multiple domains and pages can point to any URL"
    },
    {
      "level": "H3",
      "text": "A few things need to match:"
    },
    {
      "level": "H3",
      "text": "Things that don't need to match:"
    },
    {
      "level": "H2",
      "text": "Ways to use this protocol"
    },
    {
      "level": "H3",
      "text": "1. If you run multiple domains and want to cross-post content, choose which one should get the SEO benefits and rankings."
    },
    {
      "level": "H3",
      "text": "2. If a publication wants to re-post your content on  their domain, ask for it instead of (or in addition to) a link back."
    },
    {
      "level": "H3",
      "text": "3. Purchase/rent content from other sites without forcing them to remove the content from their domain."
    },
    {
      "level": "H3",
      "text": "4. Use Medium as a content distribution network without the drawback of duplicate content."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}