{
  "url": "https://moz.com/blog/cross-domain-canonical-the-new-301-whiteboard-friday",
  "slug": "cross-domain-canonical-the-new-301-whiteboard-friday",
  "title": "Cross-Domain Canonical The New 301? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "About a year ago Google announced the release of the canonical tag to the SEO world.  The canonical tag helps in solving issues with duplicate content by letting Google know that pages with the tag are copies of the original page.  Now we can do this across different domains to let Google know…",
  "content": "Cross-Domain Canonical The New 301? Whiteboard Friday By: Casey Henry May 5, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry May 5, 2011 Cross-Domain Canonical The New 301? Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. About a year ago Google announced the release of the canonical tag to the SEO world. The canonical tag helps in solving issues with duplicate content by letting Google know that pages with the tag are copies of the original page. Now we can do this across different domains to let Google know where the original content originated from and give credit to the original content owner. This week Rand discusses some information from Tony Adam's blog post titled, Should I use the Canonical Tag or 301 Redirect to change domains, and some research that we have done internally here at SEOmoz. Rand touches on our use of the cross-domain canonical tag on The Story of SEOmoz blog post and some of the effect we saw. Please feel free to add your comments on what you've seen by using the cross-domain canonical tag. Learn More:Canonicalization - What is a canonical tag? Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we're talking about the cross-domain rel=canonical. It's a very interesting attribute that we can now add to web pages. Last year, Google created the ability for the rel=canonical, which has always enabled us to canonicalize duplicate content or to tell Google, hey, these pages are actually copies of this particular page, and now we can do this across different domains. For example, we can say, oh, the New York Times runs IHT, the International Herald Tribune, and IHT.com features many stories that were originally published on New York Times. The IHT sort of goes, well, we don't really deserve the search traffic for this. It's a great resource for our readers to be able to browse on the IHT site, but what we actually want to do is say, search engines the original article exists here on the New York Times' website, let's point to that. This cross- domain rel=canonical enables webmasters of all stripes, big, small, medium, to be able to do this. I want to point out Tony Adam, who is a great SEO in Los Angeles and wrote on Visible Factors just this week about the cross-domain rel=canonical. He pointed out that in some testing he had done the cross-domain rel=canonical looked even faster, even faster and more effective than a 301, which has been the traditional way that SEOs and content producers on the Web of all kinds have repointed content. Now, what a 301 does is it means that not only do search engines, but visitors as well, get pointed to the new version. So, it is a little frustrating if you are, in the example I pointed out earlier with the IHT where the IHT says, well, we still want to keep that visitor on our site reading this story, we just don't want search engines to be confused about which one is the original. So, the New York Times can have that originality through the cross-domain rel=canonical. It looks like search engines are really respecting that. Props to Tony for doing some experimenting there. I wanted to point out two experiments, interesting ones, that we've actually done here at SEOmoz and the results that we've seen. A lot of times, you have this call, like I have page A here and I want to redirect it to this other page over here. So maybe this is A-X and I want to redirect it to content A-Y. I can use the 301 or I can use the rel=canonical. I sort of have a choice to make. Now, there are a lot of times when the rel=canonical might make good sense, like that IHT example. What we've been seeing is that the cross domain is a really powerful way to make this work. I'll show you a first example here. What we've seen is that taking an individual post, so we produced a blog post on SEOmoz a couple weeks ago called \"The Story of SEOmoz.\" It was actually originally written by Robin Good. He transcribed some video of a presentation that I made in Rome, and he posted it on his website. It's under, I think it's called, \"Entrepreneurship: The Story of SEOmoz,\" is the name of his post on his website. It's got video. It has all this great content. We took that content and we said, man, Robin, we really love what you've done here. This is fantastic transcription work and all the video that you took. This is great. We'd like to reproduce that on SEOmoz, give you credit for it, and we want to make sure the search engines know that you originally made the article as well. So Casey Henry on our team actually implemented a cross-domain rel=canonical to make sure that this version is the one that shows up. If you search for \"the story of SEOmoz\" or \"Entrepreneurship: The Story of SEOmoz,\" you will find some older blog posts of ours and some different ones, but that one won't show up. Robin's on his Master New Media website will show up. That's pretty cool. Showing the power of that cross-domain rel=canonical in action and really good use of it. Sort of a white hat way of saying, hey, we want to reproduce your content, we want to license that content, but we want to make sure you get the search engine credit because you were the publisher. So, very cool. The second example is even niftier and suggests some very cool applications as well, and so I want to point this one out. I was frustrated because for the last few years a very old domain that I created, I don't know, back in the late '90s, early 2000s, Randz.net was ranking really well for my name. I think it was ranking number 3 actually for my name, for Rand Fishkin in Google. I was always kind of frustrated because it's an old domain. I haven't updated in forever. I need to do the WordPress reinstall. I don't even know where the server login is. Whatever. It's kind of defunct at this point, and I haven't updated it in years. But I have this new blog, RandFishkin.com/blog. I really wish I could this one ranking because it has some good content on there, a bunch of posts that have been on Hacker News and some interesting things. It's much more current and updated. I do once a month at least put something new on there. So, what I did is I took very page in the header of the WordPress template, I took every page and I put a cross-domain rel=canonical to this URL. So every page at Randz.net now says canonical version is RandFishkin.com/blog. You know what happened? Two days, literally 48 hours, like the next time they crawled Randz.net, bang, RandFishkin.com/blog ranking number 3 for my name. It hadn't even ranked on page 1 or 2. I think it was on page 3 or 4 up until that point. So, just awesome to be able to put this, the page that I really want in the search results and kind of retire my old blog from being searchable. This suggests that there are lots of good things you can do with this. If you have content and you sort of, oh, I have it available but I can't do the cross domain 301ing, hey, I can use a cross-domain rel=canonical to do that. If I have content that other people are reproducing from my site, I can ask them to put it on there when they license content from me. If I have content that I am producing out, I can make sure that people rel=canonical back to my site. There are just great uses for this cross- domain rel=canonical. Very powerful tool. I am excited because I think over the next few months we're going to see some really creative uses, some good white hat ways to do this. I am excited to see what the SEO world comes up with in terms of strategy, and we'll certainly be reporting on some of that here on Whiteboard Friday. All right, everyone. Thanks. Take care. Video transcription by SpeechPad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Cross-Domain Canonical The New 301?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Cross-Domain Canonical The New 301?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}