{
  "url": "https://moz.com/blog/crushing-your-enemies-with-their-own-brand",
  "slug": "crushing-your-enemies-with-their-own-brand",
  "title": "Crushing Your Enemies with Their Own Brand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know it's a pretty simple concept, but I've been more or less obsessed with pushing people to target competitors' brand names lately.  It's come up in about half of my recent conversations, and the thing that I don't understand is what a hard sell it is to people.",
  "content": "Crushing Your Enemies with Their Own Brand Online Advertising B By: Ben Toth February 11, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Ben Toth February 11, 2009 Crushing Your Enemies with Their Own Brand Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I know it's a pretty simple concept, but I've been more or less obsessed with pushing people to target competitors' brand names lately. It's come up in about half of my recent conversations, and the thing that I don't understand is what a hard sell it is to people. I've discovered that there is a genuine reluctance from marketers to aggressively target their competitor's brand, so I wanted to spell out the advantages to this tactic as simply as possible. Here is my list of top reasons everyone should be targeting competitor brand keywords. Hopefully you can use this info to get your lazy minions off the fence and onto the bloody warpath. (YOUTIP: When talking to clients, make sure that none of Ben Toth’s language or general demeanor creeps into your conversation because they might think you are absurd and also a huge nerd.) It’s easy. In almost all conflicts, on-page optimization is all it will take to rank for branded keywords. Typically a single domain is limited to two results on the first page of the SERPs. With branded search the two result limit is somewhat mitigated, but it’s still pretty easy to compete for the other spots. Do some research and find the branded searches in your market that have traffic and then check the search results for junk content you can easily beat. By targeting a larger brand you are putting yourself in direct and visible competition with them right on the first page of SERPS. This improves your market position and can get you great traffic since even the biggest brands won’t dominate a whole page of results. It’s effective. Even if you aren’t the top result (and you won’t be), you will have a great clickthrough with a title like “Why you should never use Company X for Keyword X” or “My product works even better than Company X for Keyword X”. It doesn’t take great copy writing skills to stick out head and shoulders on the results page. People are curious and will click. If a person is knowledgeable enough about the subject to know the brand names, they are usually highly qualified. This is the most easily converted traffic there is and it’s not even hard to get…which brings me to my next point. It’s satisfying. You can make a page so conversion-oriented that it’s basically a landing page for your title (and with a title like that, what else would you do). In a few bold keystrokes you will be taking easy sales directly from your competition. What better conversion is there? If your sales team did that, you’d give them huge high-fives (YOUTIP: It’s customary that interaction with your sales team begin with a high-five). If they are established and dignified, make your company or service sound new and revolutionary. If they are a young upstart, then vice versa. Once you’ve jumped on their bandwagon to get yourself in front of their best prospects, differentiate yourself as much as possible. Make them seem irrelevant. They will be shaking their fists at the gods when they see your pages show up on their branded Google Alerts (or not; I’m often surprised at the lack of web marketing sophistication even at the enterprise level). It’s difficult to combat. Since you are more or less gaming Google’s reluctance to fill a results page with one domain, it is takes much more effort to defend against someone targeting your brand with countermeasures like subdomains (which are also throttled) and third party content than it does to initiate the attack. If a competitor goes to the immense effort of pushing you off the top page, simply switch gears and go after someone else. You can do it in three hours. You have still won. Even if you can’t hold the spot, you have still easily and efficiently taken some of their sales, made your pitch to their best traffic, and taken a little of their honor and an incredible amount of their effort. Truth be told, though, they probably won’t notice for a year and that is even better for you (if less satisfying). They call it keyword competition for a reason, and it’s high time you made them remember that. In every competition there is a blood-soaked champion, and with a little effort it can be you. I could go on but by now I think I’ve bludgeoned my point home. You can spend a relatively small amount of time and get great returns on your competitor’s brand name. Do it. Some of you may be a tad squeamish about showing up so aggressively on your competition’s radar, but the more you try it, the more you realize there isn’t much people can do to stop you. This kind of thinking simply makes sense and there is a huge amount of opportunity out there. If you are trying to accomplish more with less there are few better things you could be doing with your time. Speaking of which, gotta go. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Crushing Your Enemies with Their Own Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Crushing Your Enemies with Their Own Brand"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ben Toth\n          \n            Ben Toth"
}