{
  "url": "https://moz.com/blog/css-inspiration",
  "slug": "css-inspiration",
  "title": "CSS Inspiration - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you're thinking about putting together a pure CSS driven site and need inspiration, I've compiled a short list of my favorite CSS showcases.    I use these sites not only to inspire visual ideas, but also to learn more creative and practical ways to use CSS.   I often find myself digging…",
  "content": "CSS Inspiration Design O By: Oatmeal April 4, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal April 4, 2006 CSS Inspiration Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you're thinking about putting together a pure CSS driven site and need inspiration, I've compiled a short list of my favorite CSS showcases. I use these sites not only to inspire visual ideas, but also to learn more creative and practical ways to use CSS. I often find myself digging through source code of sites in the showcases discovering good (and bad) CSS techniques. WebCreme - I first noticed webcreme after they featured SEOmoz in their showcase. They don't post a large volume of sites, but the sites they do post are usually top notch. CSS Beauty - A winner in our web 2.0 awards, CSSBeauty is a showcase with tagging and categories to help you narrow down what kind of sites you want to see. CSSMania - I hadn't heard of cssmania until it featured both SEOmoz, the Web 2.0 Awards, and my personal blog. CSSMania is updated daily with a large list of css-driven sites and also features a rating system. CSSRemix - A newer CSS showcase, simple and easy to peruse. CSS Zen Garden - The ultimate css inspiration. If you have your doubts about the flexiblity of using CSS over traditional HTML, check these guys out. If standards compliance and flexibility aren't enough to motivate you away from old school HTML techniques, perhaps creating a beautiful site using CSS and getting listed in these showcases will. Not only do they send fair amounts of traffic, they offer great exposure to the web development sphere of the internet.UPDATE - I almost forgot, tomorrow is CSS Naked Day. Unfortunately SEOmoz won't be participating simply because I think it would confuse and scare our users, but it's a cool idea anyhow. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "CSS Inspiration"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "CSS Inspiration"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}