{
  "url": "https://moz.com/blog/customer-journey-maps-whiteboard-friday",
  "slug": "customer-journey-maps-whiteboard-friday",
  "title": "Customer Journey Maps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The experiences our customers have throughout the buying process are windows into the effectiveness of our businesses, and in today's Whiteboard Friday, MozCon 2014 speaker Kerry Bodine shows us how to capture them through customer journey mapping.",
  "content": "Customer Journey Maps Conversion Rate Optimization (CRO) | Whiteboard Friday By: Kerry Bodine August 22, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kerry Bodine August 22, 2014 Customer Journey Maps Conversion Rate Optimization (CRO) | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At every stage in the marketing funnel, it's crucially important to empathize with your customers' interactions with your business, feeling great about the high points and frustrated by the lows. In today's Whiteboard Friday, MozCon 2014 speaker Kerry Bodine shows us all about customer journey mapping—a tool that allows us to visualize and learn from those experiences. Video transcription Hi, I'm Kerry Bodine. I am a customer experience consultant, and I am the co-author of a book called \"Outside In.\" The subtitle of the book is \"The Power of Putting Customers at the Center of Your Business.\" That's really what I am all about. I try and help companies to take customer knowledge, customer insights and really bring it into their organization, so that they can become more customer-centric. What I'd like to share with you today is a tool from the customer experience world that I think is really critical for every marketer out there to understand. It is called a \"customer journey map.\" Really simply, all a journey map is, is it's an illustration that shows all the different steps that your customers go through as they do business with you over time. In addition to showing just what they do, it also shows customers' thoughts, their feeling, and their emotions. The goal of the customer journey map is really to get a holistic view of what the customer is going through from their point of view and really what it's like for them on a personal level, that human level. I'll share a little bit about how customer journey maps work, and we'll wrap up with how you can do this yourselves within your own organizations. What I've got behind me here is the start of a customer journey map, what this typically looks like. As you can see, as customers interact with you, it's not just a straight line. Some of those experiences are going to be better, and some of those experiences are going to be worse. What you want to do is you want to track what those actually look like over time. Now ideally, you are going to be understanding where those bright spots are. Those are the things that your company is really doing well to help meet your customers' goals. You've also got to understand where things aren't going so well for your customers, where you're not delivering the value that they're looking for, where you're making it really difficult just to do business with you, or where you're just not treating them as a human being. You're treating them as just kind of a line in a spreadsheet or maybe a record in your CRM system. We've got to really understand our customers at a human level. Why is a journey map like this so important for marketers? Well, part of the reason is that, at some point as we go along this journey, we're going through that typical marketing funnel. The customer first learns about your products and services. Then there's consideration, and they move into actually purchasing whatever it is that you're providing. We're not talking with those words when we're doing a journey map, because no customer is out there saying, \"Oh, I'm in the awareness phase right now of buying shoes.\" No, they're just saying, \"Hey, I'm out there researching shoes.\" Those are the types of steps that you put on here. As you go along, your customers are learning about your products and services, and then they're buying them hopefully. At some point, the traditional role of the marketer ends. The rest of the customer journey, maybe receiving those shoes in the mail if they've ordered them online and then trying them on, and if they don't fit, maybe the process of returning them, that all happens after that purchase point. We've got half of this customer journey that's really all about making promises to the customer. This is what marketing is traditionally set up to do. They are set up to help customers to understand why it's going to be so amazing to spend money with their particular company. All of these different touch points here are in the service of making a promise to the customer about what they're going to get after they've purchased from you. All of the touch points that follow are really about delivering on that promise. As you can see in this journey, the organization really didn't deliver well on whatever it was that was promised during this phase over here. The interesting thing is that not only do marketers need to care about these journey maps, but everyone else in the organization does as well. While marketers might be primarily responsible for this process of making promises, there are many, many other parts of the organization that are primarily responsible for delivering on those promises. You've got people who are working in customer service, in retail, in finance, in operations, behind the scenes, in parts of the organization like legal and IT, parts of the organization that never even talked to a customer typically during their employment at that company or maybe in their entire careers. These journey maps can help to unite all of the different parts of the organization. It can help someone in marketing understand really what they need to be promising in order to have expectations set correctly for the end of this process. It can also help people who are responsible for delivering the rest of the customer experience. It can help them understand really what that pre-purchase experience is like and really what is being promised to customers. This is really an effective tool at helping to break people out of their organizational silos, getting them to understand that holistic customer viewpoint across all the different touch points, and getting people within the organization to have empathy for each other, their fellow colleagues, or perhaps external partners, who are all playing a role in delivering this journey behind me. How can you do this yourself within your organization? What I want to do is share with you a very simple method for doing journey mapping with any group. All you really need is to have a whiteboard like this, or maybe you're going to have a big sheet of butcher paper that you can get at any office supply store. You want to have some markers. I typically like using Sharpie markers, because you can read them from a distance. My very, very favorite tool for doing this, packs of sticky notes. All you're going to do is you're going to write down each step in the customer journey on a different sticky note. Then all you need to do is put them up on your whiteboard or your piece of white butcher paper in the order that the customer would go through their particular journey. I mentioned buying shoes before, and what I'm putting up here are all the different steps that a customer might go through if they were buying shoes from your company. They're going to search for the shoes. They're going to follow a link to a website. They're going to learn about the product. They're going to buy the shoes. They're going to wait to receive them. Then they'll finally receive them. They're going to try on the shoes, and they're not going to fit here. They're going to go to the website, but they can't find the returns information. They're going to call customer service. They're going to get the return information. I'm running out of room here. They're going to print a return label. They're going to box up their shoes, and then they're going to drop the box off at the shipper, UPS or USPS, whatever it is that they're using. That's really the basic building blocks of creating a journey map. It's just going through and mapping out step by step what the customer is going through. I like using stickers for this. You can get red and green stickers at your office supply store. You can use markers. The idea is that you're going to note where the different steps in that process are going well and then maybe where those steps start to go south. This will give you a really good depiction of where the problem points are in your customer journey and where you need to focus on improving interactions to better meet your customer's needs. You can go a lot further with this. You can start detailing what your customers are thinking and what they're feeling. You can add those in on different colors of Post-it notes. You can also denote all of the different touch points that they're interacting with. Are they talking to the call center? Are they on the website? Are they on Google? Whatever those touch points happen to be. You can even dig down deeper into the organization to start to identify who is responsible for all of those different interactions, so that again you really know where you need to be focusing on fixing the systemic problems within your organization. What I would recommend that you do is conduct this type of exercise with people from across your organization. I mentioned that this is a really great tool for breaking down organizational silos. Really, that's only going to happen if you get the people from all of those different organizational silos involved in creating this diagram. Hold a half-day workshop. Bring in people from all the different parts of your organization, maybe some of your key partners, and map out what you think this journey is based on your best assumptions about customers. But don't stop there, because, often, what we find are that our assumptions are either wrong or they've got big gaps in them. The second step to this process is to bring customers into the workshop and have them validate this. The beauty of this is that when you've created this out of sticky notes, your customers are going to have no problem going up and removing sticky notes, adding new sticky notes, moving them around so that the journey more accurately reflects what it is that they go through when they do business with you. That is Journey Mapping 101. I hope that I've introduced you to a tool that you can use within your organization. If you would like more information about customer journey maps, please visit my website. It's KerryBodine.com/CustomerJourneyMaps. Thanks very much. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Customer Journey Maps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Customer Journey Maps"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kerry Bodine\n          \n            Kerry Bodine\n          \n            Kerry Bodine"
}