{
  "url": "https://moz.com/blog/customer-service-protocol-101-the-revised-edition",
  "slug": "customer-service-protocol-101-the-revised-edition",
  "title": "Customer Service Protocol 101: The Revised Edition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I apologise for another Facebook-centred post, but something interesting happened to me this week. I also realise that it is a bit strange to title an original post, \"The Revised Edition,\" but this is indeed a complete re-write of my first draft. My initial post was titled, \"Cusomter Service…",
  "content": "Customer Service Protocol 101: The Revised Edition Social Media By: Jane Copland May 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland May 7, 2008 Customer Service Protocol 101: The Revised Edition Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I apologise for another Facebook-centred post, but something interesting happened to me this week. I also realise that it is a bit strange to title an original post, \"The Revised Edition,\" but this is indeed a complete re-write of my first draft. My initial post was titled, \"Cusomter Service Protocol 101: Threaten To Ban Your Most Loyal Users,\" and it was quite the diatribe. You see, on Monday Facebook threatened to ban me. They said I had been caught spamming. I became very angry, as I hadn't spammed anyone. I'm also one of Facebook's biggest fans in an environment where everyone has something bad to say about the company. This is the pop-up I received whilst reading a message thread between myself and Julie Joyce, who claims that she didn't find my early-morning ramblings particularly spammy at all: I read through a selection of items on Facebook's Warnings page which highlights some of the things you aren't meant to do with certain features. I did notice that some of its rules about how one is supposed to use its private messaging system are a little over the top, but I didn't think I'd been sending messages at quite the rate that would set of its spam warnings: Facebook has determined that you were sending messages at a rate that is likely to be abusive. Please note that these blocks can last anywhere from a few hours to a few days. Unfortunately, we cannot lift the block for you. Facebook has several features in place to limit the potential for abusive or annoying behaviors on the site. One of these features is a cap on the speed and frequency at which a user sends messages to other users. I am not the first person who has been unfairly warned or banned for various crimes. It seems as though you can be done for anything, including (apparently) refreshing a page too often or using the site's search feature too much. Good thing Twitter doesn't get upset at you for refreshing its pages, or I'd have been ousted when I put it on auto-refresh about a month ago. I assumed that I'd been sending messages to Julie too quickly. We were using the message service as a Chat client, which is also apparently verboten. The problem with the stringent rules Facebook has on what you can do with its message services (and a whole lot of other features) is that those rules are carefully hidden. The warnings page isn't exactly easy to find. You can break their rules rather easily, it seems: Please note that even if all of your conversations were legitimate interactions with friends, our message service is not a chat client, and should not be treated as such. This astounded me. You cannot tell me that my conversations are taxing the servers to breaking point and they'd be doing a lot better if I used their new Chat client or, better still, someone else's. Can you imagine this coming from Gmail? In my pissed-off state, I imagined it for you. Surely it isn't a good practice to provide services and limit their usage in ways that most people wouldn't think of? Online, unless we're explicitly told, I think we tend to take the liberties of web services for granted. Go through the Warnings page: would you ever have thought that a couple of those things were against the rules? Surely the lesson here is that you shouldn't be surprised when people break your rules if your rules are a) hidden, and b) unintuitive. However, when I stepped back from how pissed off I was, I could see why Facebook has some of the idiotic rules. (In my original draft, that sentence was in the present tense.) The company has a reputation as the home of privacy and purity online. Recent failures aside, its reputation as being relatively safe was deserved. There is another lesson here: once you start really angering your loyal users, they stop being loyal. I politely emailed Support, inquiring about my warning. I didn't expect to hear back from them. You never hear back from companies like that, do you? The automated response you got from triggering the system is all you'll ever see. Imagine my surprise when, almost twenty-four hours after my message to them, I received the following email: \"Hi Jane, We are aware of the problem that you described and hope to resolve it as soon as possible. This warning is an error and you can ignore it without consequence. Sorry for any inconvenience. Let me know if you have any further questions. Thanks for contacting Facebook, Sydney User Operations Facebook\" I immediately had to delete about half of this post. To me, this looks like a real reply from an actual human being. This is very different to Rand's current communication with Twitter about the Twitter username \"seomoz.\" As you can see, Twitter indicates that twitter.com/seomoz does not exist, but when we try to register it for our own use, the system tells us that the name is taken. Having contacted Twitter some days ago, Rand still hasn't heard back. It's kind of sad that I'm impressed by the fact that I received a response from a real person. I've heard so many negative stories about what happens when you try and contact companies like Digg that I expected to be treated in a similar fashion. My only experience with contacting Facebook in the past was in 2005: I was researching online hate speech for a university project and wanted to include Facebook Groups in my discussion. I received responses back then, but the site is a different animal now to what it was three years ago. I realise this is a little off-topic, but it highlights the connection between customer service and loyalty. The little episode also shows the dangers of creating rules that many people will unintentionally break whilst carrying out totally legitimate tasks. Perhaps it's also a lesson in letting machines decide what constitutes spam (again, see the Warnings page for a full list of offenses. Some are totally legitimate. Others are questionable). Of course, from a search engine's perspective, they must rely on computers to go at fast speeds through data that a human could never begin to comprehend. In the space between Google and a site like SEOmoz, for example, sometimes a bit more human interpretation could be of use. For now, I'm thankful to Sydney from Facebook for not kicking me off. Although I'll wait a couple of minutes before I send Julie another message. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Customer Service Protocol 101: The Revised Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Customer Service Protocol 101: The Revised Edition"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}