{
  "url": "https://moz.com/blog/daily-seo-fix-monitoring-local-markets",
  "slug": "daily-seo-fix-monitoring-local-markets",
  "title": "Daily SEO Fix: Monitoring Local Markets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How can we keep an eye on our site’s performance within local markets to ensure we’re continuing to show up in relevant searches? In this edition of the Daily SEO Fix, we’ll look at how the Moz tools can help you to monitor how your site is performing in local markets.",
  "content": "Daily SEO Fix: Monitoring Local Markets Moz Tools | Local SEO By: Meghan Pahinui December 21, 2022 Table of Contents Copied! By: Meghan Pahinui December 21, 2022 Daily SEO Fix: Monitoring Local Markets Moz Tools | Local SEO Almost every search we make via Google includes some degree of localization. So, how can we keep an eye on our site’s performance within local markets to ensure we’re continuing to show up in relevant searches? In this edition of the Daily SEO Fix, we’ll look at how the Moz suite of tools can help you monitor how your site is performing in local markets. Tracking Market-Based Rankings The first step in monitoring local market performance is tracking keyword rankings locally. Within Moz Pro you can track market-based rankings by city name or postal code. In this video, Emilie will walk through two ways to add locally tracked keywords to your Moz Pro Campaign. Preview Localized SERPs When actively monitoring a site’s performance in search results, it can be helpful to view the SERP itself to see how many of your pages are ranking, where they are ranking, and how this compares to your competitors’ performance. In this video, Emilie will illustrate how to use the Analyze a Keyword tool within Moz Pro Campaigns to view the current, local SERP for your tracked keywords. This tool will show you the top 50 organic results for your locally tracked keywords along with their Domain Authority, Page Authority, and Page Optimization score for further analysis. Segment Keywords By Market Now you’re tracking keywords locally and you know how to view the current SERP, but what if you want to see and compare Search Visibility and rankings for multiple markets? Or what if you have markets which include multiple cities or postal codes? For example, let’s say you’ve opened up multiple stores in the San Francisco Bay Area and want to see how your site is performing in that region. There are multiple cities and postal codes within the wider San Francisco Bay Area. How can you monitor performance in this market and compare it to other markets? In this video, Emilie will show you how to label and segment your keyword data by market within Moz Pro along with how to compare performance by market, side-by-side. Track Competitors As Lidia Infante recently noted in her SEO Gap Analysis edition of Whiteboard Friday, “ranking on Google is not ranking in a vacuum. Ranking is outranking your competitors.” So it stands to reason that tracking your competitors' rankings on a local level is an important part of any strategy around monitoring local markets. But how do you do that with the Moz tools? In this video, Arian will walk through how to view competitor rankings on a local level within your Moz Pro Campaign. STAT: Accessing the Local Pack Report Local Packs are local-specific SERP features which feature up to 3 local businesses. They are incredibly competitive and are a critical component of any local SEO strategy. So how can you keep an eye on how your business is showing up in a local pack? In this video, Emilie will show you how the STAT tools can be instrumental in monitoring local pack performance. She will show you how to set up a Local Pack report right within the tool. Now that you have the tools to start monitoring local markets, it’s time to get out there and try it for yourself! Be sure to check out the Moz Help Hub and STAT Knowledge Base for additional resources and help. And keep an eye out for our next edition of the Daily SEO Fix. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Daily SEO Fix: Monitoring Local Markets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Daily SEO Fix: Monitoring Local Markets"
    },
    {
      "level": "H2",
      "text": "Tracking Market-Based Rankings"
    },
    {
      "level": "H2",
      "text": "Preview Localized SERPs"
    },
    {
      "level": "H2",
      "text": "Segment Keywords By Market"
    },
    {
      "level": "H2",
      "text": "Track Competitors"
    },
    {
      "level": "H2",
      "text": "STAT: Accessing the Local Pack Report"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}