{
  "url": "https://moz.com/blog/daily-seo-fix-5",
  "slug": "daily-seo-fix-5",
  "title": "Your Daily SEO Fix: Week 5 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is the fifth and final round-up of our 1-2 minute video tutorials to help you get the most out of Moz's tools. One last time, welcome back to your Daily SEO Fix!",
  "content": "Your Daily SEO Fix: Week 5 SEO Basics | Moz Tools By: Trevor Klein June 22, 2015 Table of Contents Copied! By: Trevor Klein June 22, 2015 Your Daily SEO Fix: Week 5 SEO Basics | Moz Tools We've arrived, folks! This is the last installment of our short (< 2-minute) video tutorials that help you all get the most out of Moz's tools. If you haven't been following along, these are each designed to solve a use case that we regularly hear about from Moz community members. Here's a quick recap of the previous round-ups in case you missed them: Week 1: Reclaim links using Open Site Explorer, build links using Fresh Web Explorer, and find the best time to tweet using Followerwonk. Week 2: Analyze SERPs using new MozBar features, boost your rankings through on-page optimization, check your anchor text using Open Site Explorer, do keyword research with OSE and the keyword difficulty tool, and discover keyword opportunities in Moz Analytics. Week 3: Compare link metrics in Open Site Explorer, find tweet topics with Followerwonk, create custom reports in Moz Analytics, use Spam Score to identify high-risk links, and get link building opportunities delivered to your inbox. Week 4: Use Fresh Web Explorer to build links, analyze rank progress for a given keyword, use the MozBar to analyze your competitors' site markup, use the Top Pages report to find content ideas, and find on-site errors with Crawl Test. We've got five new fixes for you in this edition: How to Use the Full SERP Report How to Find Fresh Links and Manage Your Brand Online Using Open Site Explorer How to Build Your Link Profile with Link Intersect How to Find Local Citations Using the MozBar Bloopers: How to Screw Up While Filming a Daily SEO Fix Hope you enjoy them! Fix 1: How to Use the Full SERP Report Moz’s Full SERP Report is a detailed report that shows the top ten ranking URLs for a specific keyword and presents the potential ranking signals in an easy-to-view format. In this Daily SEO Fix, Meredith breaks down the report so you can see all the sections and how each are used. Fix 2: How to Find Fresh Links and Manage Your Brand Online Using Open Site Explorer The Just-Discovered Links report in Open Site Explorer helps you discover recently created links within an hour of them being published. In this fix, Nick shows you how to use the report to view who is linking to you, how they're doing it, and what they are saying, so you can capitalize on link opportunities while they're still fresh and join the conversation about your brand. Fix 3: How to Build Your Link Profile with Link Intersect The quantity and (more importantly) quality of backlinks to your website make up your link profile, one of the most important elements in SEO and an incredibly important factor in search engine rankings. In this Daily SEO Fix, Tori shows you how to use Moz's Link Intersect tool to analyze the competitions' backlinks. Plus, learn how to find opportunities to build links and strengthen your own link profile. Fix 4: How to Find Local Citations Using the MozBar Citations are mentions of your business and address on webpages other than your own such as an online yellow pages directory or a local business association page. They are a key component in search engine ranking algorithms so building consistent and accurate citations for your local business(s) is a key Local SEO tactic. In today’s Daily SEO Fix, Tori shows you how to use MozBar to find local citations around the web Bloopers: How to Screw Up While Filming a Daily SEO Fix We had a lot of fun filming this series, and there were plenty of laughs along the way. Like these ones. =) Looking for more? We've got more videos in the previous four weeks' round-ups! Your Daily SEO Fix: Week 1 Your Daily SEO Fix: Week 2 Your Daily SEO Fix: Week 3 Your Daily SEO Fix: Week 4 Don't have a Pro subscription? No problem. Everything we cover in these Daily SEO Fix videos is available with a free 30-day trial. Sounds good. Sign me up! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: Week 5"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: Week 5"
    },
    {
      "level": "H2",
      "text": "Fix 1: How to Use the Full SERP Report"
    },
    {
      "level": "H2",
      "text": "Fix 2: How to Find Fresh Links and Manage Your Brand Online Using Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "Fix 3: How to Build Your Link Profile with Link Intersect"
    },
    {
      "level": "H2",
      "text": "Fix 4: How to Find Local Citations Using the MozBar"
    },
    {
      "level": "H2",
      "text": "Bloopers: How to Screw Up While Filming a Daily SEO Fix"
    },
    {
      "level": "H2",
      "text": "Looking for more?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}