{
  "url": "https://moz.com/blog/daily-seo-fix-ga4-and-moz-pro",
  "slug": "daily-seo-fix-ga4-and-moz-pro",
  "title": "Explore the GA4 Integration with Moz Pro - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "GA4 is here! Learn all about how to connect your GA4 profile to Moz Pro, and get to know your data in this Daily SEO Fix on exploring the GA4 integration with Moz Pro.",
  "content": "Explore the GA4 Integration with Moz Pro SEO Tools | Moz News By: Emilie Martin June 29, 2023 Table of Contents Copied! By: Emilie Martin June 29, 2023 Explore the GA4 Integration with Moz Pro SEO Tools | Moz News Edited by Emilie Martin Google Analytics 4 is the latest version of Google Analytics, also known as GA4, and replaces the previous UA, or Universal Analytics version. GA4 uses machine learning technology to help analytics users understand customer behavior across multiple devices and platforms. It provides more granular data about user engagement and includes features such as event tracking, cross-device tracking, and funnel analysis. With the GA4 migration underway, the time has come for all of us to embrace change, and don’t forget, you only have until July 1, 2023, before the switch to GA4 is permanent. In this Daily SEO Fix edition, we’ll take you through an introduction to GA4, along with how GA4 is integrated into the Moz Pro tool. Introducing GA4 In this video, I’ll take you through an introduction to GA4, explaining the main differences as compared to UA so you can better understand why and how you should be using GA4. How to Connect GA4 to Moz Pro In this video, you’ll discover how to connect your GA4 account to Moz Pro. You’ll first need admin access to your Google Analytics account; from there, you can fly! Understand the Site Traffic Tab In this video, I’ll explain the analytics data you’ll see in the Site Traffic section of a Campaign. The Site Traffic section allows you to monitor your organic traffic for trends and insights. Understand the Landing Pages Tab In this video, I’ll guide you through the analytics data you’ll see in the Landing Pages tab in the Rankings section of a Campaign. Landing Pages uses your tracked keywords to help you determine which keywords may be sending your website traffic. Learn more about GA4 in our Beginner’s Guide to Google Analytics. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Explore the GA4 Integration with Moz Pro"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Explore the GA4 Integration with Moz Pro"
    },
    {
      "level": "H2",
      "text": "Introducing GA4"
    },
    {
      "level": "H2",
      "text": "How to Connect GA4 to Moz Pro"
    },
    {
      "level": "H2",
      "text": "Understand the Site Traffic Tab"
    },
    {
      "level": "H2",
      "text": "Understand the Landing Pages Tab"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    }
  ],
  "author": "Emilie Martin\n          \n            Emilie Martin\n          \n            Emilie Martin"
}