{
  "url": "https://moz.com/blog/daily-seo-fix-keywords-concepts-page-optimization-naps",
  "slug": "daily-seo-fix-keywords-concepts-page-optimization-naps",
  "title": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In our final week of the Daily SEO Fix video series, we cover some quick wins for on-page optimization, keyword research, and accurate NAP listings for your local endeavors using tools from the Moz suite.",
  "content": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs Keyword Research | On-page SEO | Local SEO By: Felicia Crawford March 23, 2017 Table of Contents Copied! By: Felicia Crawford March 23, 2017 Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs Keyword Research | On-page SEO | Local SEO Howdy, readers! We're back with our last round of videos for this go of the Daily SEO Fix series. To recap, here are the other topics we've covered previously: Your Daily SEO Fix: The Keyword Research Edition Your Daily SEO Fix: Link Building & Ranking Zero Today we'll be delving into more keyword and concept research, quick wins for on-page optimization, and a neat way to stay abreast of duplicates and inaccuracies in your local listings. We use Moz Pro, the MozBar, and Moz Local in this week's fixes. Fix #1: Grouping and analyzing keywords by label to judge how well you're targeting a concept The idea of \"concepts over keywords\" has been around for a little while now, but tracking rankings for a concept isn't quite as straightforward as it is for keywords. In this fix, Kristina shows you how to label groups of keywords to track and sort their rankings in Moz Pro so you can easily see how you're ranking for grouped terms, chopping and analyzing the data as you see fit. Fix #2: Adding alternate NAP details to uncover and clean up duplicate or inaccurate listings If you work in local SEO, you know how important it is for listings to have an accurate NAP (name, address, phone number). When those details change for a business, it can wreak absolute havoc and confuse potential searchers. Jordan walks you through adding alternate NAP details in Moz Local to make sure you uncover and clean up old and/or duplicate listings, making closure requests a breeze. (This Whiteboard Friday is an excellent explanation of why that's really important; I like it so much that I link to it in the resources below, too. ;) Remember, you can always use the free Check Listing tool to see how your local listings and NAP are popping up on search engines: Is my NAP accurate? Fix #3: Research keywords and concepts to fuel content suggestions — on the fly You're already spying on your competitors' sites; you might as well do some keyword research at the same time, right? Chiaryn walks you through how to use MozBar to get keyword and content suggestions and discover how highly ranking competitor sites are using those terms. (Plus a cameo from Lettie Pickles, star of our 2015 Happy Holidays post!) Fix #4: Discover whether your pages are well-optimized as you browse — then fix them with these suggestions A fine accompaniment to your on-the-go keyword research is on-the-go on-page optimization. (Try saying that five times fast.) Janisha gives you the low-down on how to check whether a page is well-optimized for a keyword and identify which fixes you should make (and how to prioritize them) using the SEO tool bar. Further reading & fond farewells I've got a whole passel of links if you're interested in reading more educational content around these topics. And by \"reading,\" I mean \"watching,\" because I really stacked the deck with Whiteboard Fridays this time. Here you are: Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research - Our inaugural post on concepts versus keywords. Can SEOs Stop Worrying About Keywords and Just Focus on Topics? - Whiteboard Friday - Well... Can they? Rand describes each approach, then discusses a smarter hybrid answer in this video. Using Related Topics and Semantically Connected Keywords in Your SEO - Whiteboard Friday - A how-to on incorporating related topics and semantic keywords in your on-page processes. Why You Need to Find All Your NAP Variations Before Building Local Citations - Whiteboard Friday - If you don't sniff out all your inaccurate, out-of-date listings, you could be creating a big duplicates problem for yourself without even knowing. Why Listing Accuracy is Important - Whiteboard Friday - A very necessary primer on just why those NAPs need to be accurate. It's Time to Stop Doing On-Page SEO Like It's 2012 - There are a ton of practices that are now behind the times; Rand details what you should be forgetting and what you should be doing in this post. And of course, if you need a better handle on all this SEO stuff and reading blog posts just doesn't cut the mustard, we now offer classes that cover all the essentials. My sincere thanks to all of you tuning in to check out our Daily SEO Fix video series over the past couple of weeks — it's been fun writing to you and hearing from you in the comments! Be sure to keep those ideas and questions comin' — we're listening. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs"
    },
    {
      "level": "H2",
      "text": "Fix #1: Grouping and analyzing keywords by label to judge how well you're targeting a concept"
    },
    {
      "level": "H2",
      "text": "Fix #2: Adding alternate NAP details to uncover and clean up duplicate or inaccurate listings"
    },
    {
      "level": "H2",
      "text": "Fix #3: Research keywords and concepts to fuel content suggestions — on the fly"
    },
    {
      "level": "H2",
      "text": "Fix #4: Discover whether your pages are well-optimized as you browse — then fix them with these suggestions"
    },
    {
      "level": "H2",
      "text": "Further reading & fond farewells"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}