{
  "url": "https://moz.com/blog/daily-seo-fix-use-keyword-labels",
  "slug": "daily-seo-fix-use-keyword-labels",
  "title": "Daily SEO Fix: How to Use Keyword Labels in Moz Pro - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this edition of the Daily SEO Fix, we’ll look at how you can apply labels to keywords in your Moz Pro Campaign along with different ways to segment your data and how to create reports for different keyword clusters.",
  "content": "Daily SEO Fix: How to Use Keyword Labels in Moz Pro Moz Tools By: Meghan Pahinui April 17, 2023 Table of Contents Copied! By: Meghan Pahinui April 17, 2023 Daily SEO Fix: How to Use Keyword Labels in Moz Pro Moz Tools Tracking keyword rankings is an essential part of any SEO strategy and helps inform how changes you’ve made to your site have made an impact. No matter how many keywords you’re tracking it can be incredibly helpful to segment your data in various ways to monitor and compare groups of keywords. Within Moz Pro you have the ability to label keywords any way you like so you’re able to do just that. In this edition of the Daily SEO Fix, we’ll look at how you can apply labels to keywords in your Moz Pro Campaign along with different ways to segment your data and how to create reports for different keyword clusters. How to Label Keywords in Moz Pro Before we can segment our keyword rankings data to compare metrics we have to properly label our keywords. In this video, Emilie will walk through how to add labels to your keywords in a Moz Pro Campaign. How to Use Filters in Moz Pro Once your keywords are labeled, you can filter and sort to compare metrics and rankings over time for different sets of keywords. In this next video, Emilie will show you how to filter by label in Moz Pro. Ways to Label Keywords There are an infinite number of ways you can label and segment your keyword data. This includes by sales funnel stage, product line, and market location just to name a few. In this video, Emilie will talk through a few different ways you may want to consider segmenting your keywords and rankings data. How Labels Impact Metrics When applying filters in Moz Pro, you’ll see that certain metrics and graphs update accordingly. For example, when filtering by label you can see Search Visibility over time for each set of keywords. In this video, Emilie will walk you through how filtering by label impacts the metrics and graphs seen in the Rankings section of your Moz Pro Campaign. How to Create a Report with Segmented Data Now that your keywords are labeled and you know how to filter or segment your keyword data, it’s time to create customized rankings reports! With Moz Pro Custom Reports you can have segmented data sent right to your inbox on a regular basis. In this video, Eli will show you how to create a Custom Report for labeled keywords so you’re able to keep an eye on changes to your rankings. With that, you’re ready to get out there and start labeling your keywords and tracking your success. Thanks so much for checking out this edition of the Daily SEO Fix and we’ll see you next time! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Daily SEO Fix: How to Use Keyword Labels in Moz Pro"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Daily SEO Fix: How to Use Keyword Labels in Moz Pro"
    },
    {
      "level": "H2",
      "text": "How to Label Keywords in Moz Pro"
    },
    {
      "level": "H2",
      "text": "How to Use Filters in Moz Pro"
    },
    {
      "level": "H2",
      "text": "Ways to Label Keywords"
    },
    {
      "level": "H2",
      "text": "How Labels Impact Metrics"
    },
    {
      "level": "H2",
      "text": "How to Create a Report with Segmented Data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}