{
  "url": "https://moz.com/blog/daily-seo-fix-keyword-research",
  "slug": "daily-seo-fix-keyword-research",
  "title": "Your Daily SEO Fix: The Keyword Research Edition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You have SEO quandaries, we have tools to solve them. Check out four quick videos (starring real, live Mozzers!) designed to help you level up your skills and get the most out of both our free and paid tools.",
  "content": "Your Daily SEO Fix: The Keyword Research Edition Keyword Research | Moz Tools | SEO Basics By: Felicia Crawford March 9, 2017 Table of Contents Copied! By: Felicia Crawford March 9, 2017 Your Daily SEO Fix: The Keyword Research Edition Keyword Research | Moz Tools | SEO Basics Back in 2015, we had an epiphany. Every day, via every channel, you — our readers, subscribers, community members, and social followers — would ask us really good questions. (You're an incredibly intelligent, friendly, inquisitive bunch, you know that? It's humbling.) A lot of those questions were about how to accomplish your SEO goals, and it got us thinking. Moz is an educational resource, it's true, but we also offer a suite of tools (both free and paid) that can help you achieve those goals. Why not provide a space for those two things to converge? And thus, the idea of the Daily SEO Fix was born: quick 1–3 minute videos shared throughout the week that feature Mozzers describing how to solve problems using the tools we know best. It's two years later now, and both our tools and our industry have evolved. Time to revisit this idea, no? Today's series of Daily SEO Fixes feature our keyword research tool, Keyword Explorer. Perhaps you've heard us mention it a couple times — we sure like it, and we think it could help you, too. And you don't have to be a subscriber to check this puppy out — anyone on the whole wide Internet can use it to research two queries a day for free. If you're logged into your Moz community account, you get five free queries. Open Keyword Explorer in a new tab! Queue it up in another browser tab to follow along, if you'd like!* *Keep in mind that some features, such as lists, are only available when you're also a Moz Pro Medium subscriber or above. If you're bursting with curiosity, you can always check out the 30-day free trial, which features everything you'd see in a paid subscription... but for free. :) Fix #1: Nitty-gritty keyword research Let's get down to brass tacks: your keyword research. Janisha's here to walk you through... Researching your keyword; Determining whether it strikes the right balance of volume, difficulty, and organic CTR; How to quickly analyze the SERPs for your query and see what factors could be affecting your ranking opportunity; Finding keyword suggestions ripe with promise; and Organizing your newly discovered keywords into lists. Fix #2: Finding question keywords to boost your content & win featured snippets When you answer the questions searchers are actually asking, you've got way more opportunity to rank, earn qualified traffic to your site, and even win yourself a featured snippet or two. Brittani shows you how to broaden your page content by speaking to your audience's most burning questions. Fix #3: Updating your keyword metrics on a whim If you're hot on the trail of a good ranking, you don't have the time or patience to wait for your metrics to update on their own. Kristina shows you how to get that sweet, sweet, up-to-date data after you've organized a list of related keywords in Keyword Explorer. Fix #4: Moving curated keyword lists to Moz Pro for long-term tracking If you're interested in tracking the overall SEO progress of a site and digging into the nuts and bolts of your keyword data, you'll want to pay attention. Kristina's back to explain how to import your curated Keyword Explorer lists into a Moz Pro campaign to track long-term rankings for a specific site. That's a wrap for Week 1!There you have it — four ways to level up your keyword research and knock some to-dos off your list. We'll be back next Thursday with more fixes from a new group of Mozzers; keep an eye on our social channels for a sneak peek, and maybe try a free spin of Moz Pro if you'd like to follow along. Curious about what else you can do with Keyword Explorer? Here are some fab resources: Keyword Research in 2016: Going Beyond Guesswork – A thorough explanation of keyword difficulty, organic CTR, importance, and priority — the key ingredients to Keyword Explorer's secret sauce. Generate 100+ Blog Topic Ideas in Seconds – Research keywords and save yourself a headache when brainstorming headlines and topics to write about. Diving for Pearls: A Guide to Long-Tail Keywords - Next Level – Uncover those hidden long-tail gems that will inform your keyword strategy and capture very specific audience interest. And if you're fairly new to the game or looking for ways to grow your team members' SEO knowledge, be sure to check out our classes on introductory SEO, keyword research, site audits, link building, reporting, and more. See you next week, friends! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: The Keyword Research Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix: The Keyword Research Edition"
    },
    {
      "level": "H2",
      "text": "Fix #1: Nitty-gritty keyword research"
    },
    {
      "level": "H2",
      "text": "Fix #2: Finding question keywords to boost your content & win featured snippets"
    },
    {
      "level": "H2",
      "text": "Fix #3: Updating your keyword metrics on a whim"
    },
    {
      "level": "H2",
      "text": "Fix #4: Moving curated keyword lists to Moz Pro for long-term tracking"
    },
    {
      "level": "H2",
      "text": "That's a wrap for Week 1!"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}