{
  "url": "https://moz.com/blog/daily-seo-fix",
  "slug": "daily-seo-fix",
  "title": "Your Daily SEO Fix - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're excited to announce a new collection of video tutorials focused on tips and tricks with Moz tools, each in two minutes or less. Welcome to your Daily SEO Fix!",
  "content": "Your Daily SEO Fix SEO Basics | Moz Tools By: Trevor Klein May 21, 2015 Table of Contents Copied! By: Trevor Klein May 21, 2015 Your Daily SEO Fix SEO Basics | Moz Tools We at the Mozplex have noticed a recurring event. Somewhat regularly, one of our community members—sometimes even a Pro subscriber—will ask us if we know of any tools that'll do a good job solving for a particular use case. They've got a need and are looking for a solution. That solution, it turns out, is available in our own tools—they just never made the connection. This week, we began a series of video tutorials we're calling the Moz Daily SEO Fix. The videos are shorter than two minutes each and are designed to offer you solutions to some of the most common problems faced by SEOs and online marketers of all stripes. A new video will be released every weekday for a month, and we'll post a weekly roundup on Thursday afternoons. Whether you're a seasoned veteran of the old SEOmoz days or have never once used a Moz tool, we hope these videos will show you a way to make your marketing life a little easier. =) Update: We've published three more posts with 4-5 video tutorials each; make sure to check them out: Week 2: Analyze SERPs using new MozBar features, boost your rankings through on-page optimization, check your anchor text using Open Site Explorer, do keyword research with OSE and the keyword difficulty tool, and discover keyword opportunities in Moz Analytics. Week 3: Compare link metrics in Open Site Explorer, find tweet topics with Followerwonk, create custom reports in Moz Analytics, use Spam Score to identify high-risk links, and get link building opportunities delivered to your inbox. Week 4: How to use Fresh Web Explorer to build links, analyze rank progress for a given keyword, use the MozBar to analyze your competitors' site markup, use the Top Pages report to find content ideas, and find on-site errors with Crawl Test. Week 5: How to use the full SERP report, find fresh links and manage your brand online using OSE, build your link profile with link intersect, find local citations using the MozBar, and screw up while filming a Daily SEO Fix video (blooper reel!). Fix 1: How to reclaim links using Open Site Explorer In today's Daily SEO Fix, David explains how to use the Open Site Explorer's top pages tab plus the filter for 4xx and 5xx errors to find the pages on your site with the most potential link equity that are broken and can be redirected. 301'ing these URLs to relevant pages on your site can give your rankings a serious boost. Fix 2: How to build links using Fresh Web Explorer In this Daily SEO Fix, Michael shows you how to set up an alert in Fresh Web Explorer for anyone who mentions (or links to) your two biggest competitors but not to you. Monitor your inbox for these alerts and you'll find new link building opportunities, ripe for the picking. Fix 3: How to find the best times to tweet using Followerwonk Finding the best time to tweet is unique for everyone and figuring out what times work best for you is key to maximizing your presence on Twitter. In this Daily SEO Fix, Ellie shows you how to use Followerwonk to find the best times to tweet so your followers don't miss out on your updates. Don't have a Pro subscription? No problem. Everything we cover in these Daily SEO Fix videos is available with a free 30-day trial. Sounds good. Sign me up! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Your Daily SEO Fix"
    },
    {
      "level": "H2",
      "text": "Fix 1: How to reclaim links using Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "Fix 2: How to build links using Fresh Web Explorer"
    },
    {
      "level": "H2",
      "text": "Fix 3: How to find the best times to tweet using Followerwonk"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}