{
  "url": "https://moz.com/blog/danger-excitement-romance-coming-soon-to-an-auditorium-near-seomoz",
  "slug": "danger-excitement-romance-coming-soon-to-an-auditorium-near-seomoz",
  "title": "Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Cue suspenseful music...\n\nHer heart nearly jumped a beat as he leapt onto the stage, his eyes dancing across the room, crying out for silence and attention. As she watched, a small device moved from his right hand to his left and then, without warning, it began... With the deftness of an acrobat…",
  "content": "Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz SEO Events By: Rand Fishkin July 31, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 31, 2007 Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Cue suspenseful music... Her heart nearly jumped a beat as he leapt onto the stage, his eyes dancing across the room, crying out for silence and attention. As she watched, a small device moved from his right hand to his left and then, without warning, it began... With the deftness of an acrobat and the cadence of a poet, he swept her away to a world where anything was possible, where even the greatest challenge was surmountable. In the end, she felt powerful, in control, ready to storm the Bastille single-handed! Her wits, cunning and guile had carried her this far, but now she had what she needed to reach the top. A smile swept across her eyes and she burst forth with confidence, ready for the road ahead. I predict that the above shall be only the start of the magnificent reviews our SEO Training Seminar in October will receive. No, don't worry, the trip to Google & Yahoo! hasn't gone to my head; I'm just being facetious. While I do think we'll have a terrific time and provide a lot of value to attendees, I certainly don't expect to have the blogosphere buzzing with film-noir-esque writeups. Although Scott technically announced our seminar last Friday, he asked me to write a bit more in-depth about the specifics, and I thought it would be a great opportunity to outline not only what I'll be covering, but what I think is truly important to move from basic knowledge of search marketing to an intermediate or advanced level. The seminar itself is focused on exactly that - transforming attendees who have some experience with SEO into real authorities on the subject. No, you won't become an expert overnight, but you will come away with a lot of answers, teh right questions and the knowledge of where and how to solve them. Here's what I plan to cover: Introduction to Search Engine Marketing (~30 minutes) Stats, basics and a solid background on the goals and processes critical to good SEO Search Engine Algorithms (~40 minutes) We'll dive right into relevancy and popularity, sorting out how the engines rank their content and what elements are playing large and small roles in the ordering Search Engine Friendly Design (~35 minutes) To insure there's no confusion, I'll cover some of the basics of search-friendly website creation, as well as some more advanced tactics for search targeting and promotion Keyword Research & Targeting (~25 minutes) You might know the basics of keyword research, but this session will showcase some of the best tools on the web to use and methods for determing value & importance, along with recommendations for how to utilize keywords on your sites and pages to maximum effect Content Development Strategies (~50 minutes) With a heavy focus on viral content and link-worthy content creation, we'll pour over the various styles and tactics that can earn rankings, both for small and large scale sites Social Media Marketing (~40 minutes) Now that we've covered viral content creation, we'll shift over to promotional tactics, including how to market your content successfully on the big social portals and the niche sites as well Blogging & the Blogosphere (~40 minutes) With blogging becoming such a big part of SEO and corporate outreach strategy, I'll spend a significant chunk of time diving into how to make a blog work and build a community that will reward and link to your blog's content Analytics (~20 minutes) Measuring success in the right ways is critical to the SEO process, so we'll take a look at how to show off the impressive stats you earn to the management and make yourself a star Site Clinic (~60 minutes) One of my favorites - we'll take hands from the audience, throw a site on the screen and spend some time diving into SWOT analysis to find ways for you to specifically improve After each individual section, there will be a short break for Q+A (10-20 minutes per session) - in the past when I've run a format like this, it's been fast and furious with a very high energy environment. The one thing I can promise is that no one will be falling asleep :) Our plan is to start at 9:30am and run until 5pm, with an hour break for lunch between 12:30 and 1:30pm. Then, of course, there's the fun part - an all expenses paid party with the SEOmoz crew and your fellow attendees, including Monday Night Football on big screen TVs, pool, darts, free drinks and a ton of opportunity for networking and one-on-one time. Now a little business transparency in keeping with the spirit of \"moz.\" When you look at the prices ($199 for premium members, $349 for the public), it may seem like a much lower priced offering than any of the similar SEO training session in the wide world. That's not because it's less valuable - we're actually doing this without profit. Our plan here is to test the waters and only take enough to cover the venue and the after-party (with a little bit of buffer room). The goals are to earn a bit of goodwill with the seminar and to produce some video material that we'll repurpose later on. We'll see how this trial run works out and potentially run one of these each year. However, I suspect that we'll be very unlikely to offer it at these rates again. If you've got feedback or suggestions for the seminar, please feel free to leave them below. And if you're thinking about joining us, you can save $50 (premium member or not) by signing up by August 2nd (Thursday). For those who might be particularly price conscious, I've grabbed a few travel searches from Farecast & Kayak to find the rates on flights and hotels. Flights (roundtrip, arriving in Seattle on Sunday & leaving Tuesday) Chicago to Seattle - $259 New York to Seattle - $299 Dallas to Seattle - $233 Atlanta to Seattle - $339 Los Angeles to Seattle - $199 San Francisco to Seattle - $199 Boston to Seattle - $300 Hotels (two nights, Sunday & Monday) 3 Star - from $110 / night 4 Star - from $170 / night 5 Star - from $250 / night At under $1,000 including flight and lodging, this is probably one of the least expensive ways to boost your hands-on SEO expertise. Here's the page to signup - SEOmoz Premium SEO Training Seminar. If you're considering coming for the weekend before to see the sites in Seattle, I highly recommend it. The last weekend in September has historically had very few tourists and very good weather (though, since it's Seattle, I wouldn't count on anything). p.s. A few folks have been emailing me about the seminar asking if they should go if they consider themselves an SEO \"expert.\" My advice would be - if you think the networking alone is worthwhile, come, if not, stay home. You'll probably pick up a few tips and have a great time to boot (plus it's a great tax write-off), but this material is geared more towards the intermediate and starting-out crowd. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}