{
  "url": "https://moz.com/blog/dannys-dream-machine",
  "slug": "dannys-dream-machine",
  "title": "Danny's Dream Machine - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been jealous of Danny Sullivan in the past, but never as much as I was today when I saw this:\n\nNow that's a home office setup. It may not look fant...",
  "content": "Danny's Dream Machine Online Advertising By: Rand Fishkin March 22, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 22, 2006 Danny's Dream Machine Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been jealous of Danny Sullivan in the past, but never as much as I was today when I saw this: Now that's a home office setup. It may not look fantastic, but that three monitor layout with three graphics cards all with their own taskbars would make my online research and email correspondence a heck of a lot easier. I'm especially thinking of those times when I need to put data into an excel spreadsheet, have two blogs that I'm reading open, my email (with three unfinished drafts) and Dreamweaver running to change the CSS spacing on an article. How much would a system like this actually cost? Something tells me it's not that expensive. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Danny's Dream Machine"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Danny's Dream Machine"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}