{
  "url": "https://moz.com/blog/data-science-content",
  "slug": "data-science-content",
  "title": "4 Key Lessons Content Marketers Can Take From Data Journalists - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Create truly newsworthy content by leveraging these four key insights from data science and journalism.",
  "content": "4 Key Lessons Content Marketers Can Take From Data Journalists Marketing Industry | Content Marketing By: Matt Gillespie May 20, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matt Gillespie May 20, 2019 4 Key Lessons Content Marketers Can Take From Data Journalists Marketing Industry | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There’s an oft-cited statistic in the world of technology professionals, from marketers to startup founders to data scientists: 90% of the world’s data has been created in the last two years. This instantly-Tweetable snippet was referenced in Forbes in 2018, mentioned by MediaPost in 2016, and covered on Science Daily in 2013. A casual observer could be forgiven for asking: How could that be true in three different years? At Fractl, the data makes perfect sense to us: The global amount of digital information is growing exponentially over time. From Seagate This means that the “90 percent of all data…” statistic was true in 2013, 2016, and 2018, and it will continue to be true for the foreseeable future. As our culture continues to become more internet-integrated and mobile, we continue to produce massive amounts of data year over year while also becoming more comfortable with understanding large quantities of information. This is hugely important to anyone who creates content on the web: Stats about how much data we create are great, but the stories buried in that data are what really matter. In the opening manifesto for FiveThirtyEight, one of the first sites on the web specifically devoted to data journalism, Editor-in-Chief Nate Silver wrote: “Almost everything from our sporting events to our love lives now leaves behind a data trail.” This type of data has always been of interest to marketers doing consumer research, but the rise of data journalism shows us that there is both consumer demand and almost infinite potential for great storytelling rooted in numbers. In this post, I’ll highlight four key insights from data science and journalism and how content marketers can leverage them to create truly newsworthy content that stands out from the pack: The numbers drive the narrativePlotted points are more trustworthy than written words (especially by brands!)Great data content is both beautiful and easy-to-interpretEvery company has a (data) story to tell By the time you're done, you'll have gleaned a better understanding of how data visualization, from simple charts to complex interactive graphics, can help them tell a story and achieve wide visibility for their clients. The numbers drive the narrative Try Googling “infographics are dead,” and your top hit will be a 2015 think piece asserting that the medium has been dead for years, followed by many responses that the medium isn’t anywhere close to “dead.” These more optimistic articles tend to focus on the key aspects of infographics that have transformed since their popularity initially grew: Data visualization (and the public’s appetite for it) is evolving, and A bad data viz in an oversaturated market won’t cut it with overloaded consumers. For content marketers, the advent of infographics was a dream come true: Anyone with even basic skills in Excel and a good graphic designer could whip up some charts, beautify them, and use them to share stories. But Infographics 1.0 quickly fizzled because they failed to deliver anything interesting — they were just a different way to share the same boring stories. Data journalists do something very different. Take the groundbreaking work from Reuters on the Rohingya Muslim refugee camps in southern Bangladesh, which was awarded the Global Editors Network Award for Best Data Visualization in 2018. This piece starts with a story—an enormous refugee crisis taking place far away from the West—and uses interactive maps, stacked bar charts, and simple statistics visualizations to contextualize and amplify a heartbreaking narrative. The Reuters piece isn’t only effective because of its innovative data viz techniques; rather, the piece begins with an extremely newsworthy human story and uses numbers to make sure it’s told in the most emotionally resonant way possible. Content marketers, who are absolutely inundated with advice on how storytelling is essential to their work, need to see data journalism as a way to drive their narratives forward, rather than thinking of data visualization simply as a way to pique interest or enhance credibility. Plotted points are more trustworthy than written words This is especially true when it comes to brands. In the era of #FakeNews, content marketers are struggling more than ever to make sure their content is seen as precise, newsworthy, and trustworthy. The job of a content marketer is to produce work for a brand that can go out and reasonably compete for visibility against nonprofits, think tanks, universities, and mainstream media outlets simultaneously. While some brands are quite trusted by Americans, content marketers may find themselves working with lesser-known clients seeking to build up both awareness and trust through great content. One of the best ways to do both is to follow the lead of data journalists by letting visual data content convey your story for you. “Numbers don’t lie” vs. brand trustworthiness In the buildup to the 2012 election, Nate Silver’s previous iteration of FiveThirtyEight drew both massive traffic to the New York Times and criticism from traditional political pundits, who argued that no “computer” could possibly predict election outcomes better than traditional journalists who had worked in politics for decades (an argument fairly similar to the one faced by the protagonists in Moneyball). In the end, Silver’s “computer” (actually a sophisticated model that FiveThirtyEight explains in great depth and open-sources) predicted every state correctly in 2012. Silver and his team made the model broadly accessible to show off just how non-partisan it really was. It ingested a huge amount of historical election data, used probabilities and weights to figure out which knowledge was most important, and spit out a prediction as to what the most likely outcomes were. By showing how it all worked, Silver and FiveThirtyEight went a long way toward improving the public confidence in data—and, by extension, data journalism. But the use of data to increase trustworthiness is nothing new. A less cynical take is simply that people are more likely to believe and endorse things when they're spelled out visually. We know, famously, that users only read about 20-28 percent of the content on the page, and it’s also known that including images vastly increases likes and retweets on Twitter. So, in the era of endless hot takes and the “everyone’s-a-journalist-now” mentality, content marketers looking to establish brand authority, credibility, and trust can learn an enormous amount from the proven success of data journalists — just stick to the numbers. Find the nexus of simple and beautiful Our team at Fractl has a tricky task on our hands: We root our content in data journalism with the ultimate goal of creating great stories that achieve wide visibility. But different stakeholders on our team (not to mention our clients) often want to achieve those ends by slightly different means. Our creatives—the ones working with data—may want to build something enormously complex that crams as much data as possible into the smallest space they can. Our media relations team—experts in knowing the nuances of the press and what will or won’t appeal to journalists—may want something that communicates data simply and beautifully and can be summed up in one or two sentences, like the transcendent work of Mona Chalabi for the Guardian. A client, too, will often have specific expectations for how a piece should look and what should be included, and these factors need to be considered as well. Striking the balance With so many ways to present any given set of numbers, we at Fractl have found success by making data visualizations as complex as they need to be while always aiming for the nexus of simple and beautiful. In other words: Take raw numbers that will be interesting to people, think of a focused way to clearly visualize them, and then create designs that fit the overall sentiment of the piece. On a campaign for Porch.com, we asked 1,000 Americans several questions about food, focusing on things that were light and humorous conversation starters. For example, “Is a hot dog a sandwich?” and “What do you put on a hot dog?” As a native Chicagoan who believes there is only one way to make a hot dog, this is exactly the type of debate that would make me take notice and share the content with friends on social media. In response to those two questions, we got numbers that looked like this: Using Tableau Public, an open-source data reporting solution that is one of the go-to tools for rapid building at Fractl, the tables above were transformed into rough cuts of a final visualization: With the building blocks in place, we then gave extensive notes to our design team on how to make something that’s just as simple but much, much more attractive. Given the fun nature of this campaign, a more lighthearted design made sense, and our graphics team delivered. The entire campaign is worth checking out for the project manager’s innovative and expert ability to use simple numbers in a way that is beautiful, easy-to-approach, and instantly compelling. All three of the visualizations above are reporting the exact same data, but only one of them is instantly shareable and keeps a narrative in mind: by creatively showing the food items themselves, our team turned the simple table of percentages in the first figure into a visualization that could be shared on social media or used by a journalist covering the story. In other cases, such as if the topic is more serious, simple visualizations can be used to devastating effect. In work for a brand in the addiction and recovery space, we did an extensive analysis of open data hosted by the Centers for Disease Control and Prevention. The dramatic increase in drug overdose deaths in the United States is an emotional story fraught with powerful statistics. In creating a piece on the rise in mortality rate, we wanted to make sure we preserved the gravity of the topic and allowed the numbers to speak for themselves: A key part of this visualization was adding one additional layer of complexity—age brackets—to tell a more contextualized and human story. Rather than simply presenting a single statistic, our team chose to highlight the fact that the increase in overdose deaths is something affecting Americans across the entire lifespan, and the effect of plotting six different lines on a single chart makes the visual point that addiction is getting worse for all Americans. Every brand’s data has a story to tell Spotify has more than 200 million global users, nearly half of whom pay a monthly fee to use the service (the other half generate revenue by listening to intermittent ads). As an organization, Spotify has data on how a sizeable portion of the world listens to its music and the actual characteristics of that music. Data like this is what makes Spotify such a valuable brand from a dollars and cents standpoint, but a team of data journalists at The New York Times also saw an incredible story about how American music taste has changed in the last 30 years buried in Spotify’s data. The resulting piece, Why Songs of Summer Sound the Same, is a landmark work of data-driven, interactive journalism, and one that should set a content marketer’s head spinning with ideas. Of course, firms will always be protective of their data, whether it’s Netflix famously not releasing its ratings, Apple deciding to stop its reporting of unit sales, or Stanford University halting its reporting of admissions data. Add to the equation a public that is increasingly wary of data privacy and susceptibility to major data breaches, and clients are often justifiably nervous to share data for the purpose of content production. Deciding when to share That said, a firm’s data often is central to its story, and when properly anonymized and cleared of personal identifying information, or PII, the newsworthiness of a brand reporting insights from its own internal numbers can be massive. For example, GoodRx, a platform that reports pricing data from more than 70,000 U.S. pharmacies, released a white paper and blog post that compared its internal data on prescription fills with US Census data on income and poverty. While census data is free, only GoodRx had the particular dataset on pharmacy fills—it’s their own proprietary data set. Data like this is obviously key to their overall valuation, but the way in which it was reported here told a deeply interesting story about income and access to medication without giving away anything that could potentially cost the firm. The report was picked up by the New York Times, undoubtedly boosting GoodRx’s ratings for organic search. The Times’ pieces on Spotify and GoodRx both highlight the fourth key insight on the effective use of data as content marketers: Every brand’s data has a story to tell. These pieces could only have come from their exact sources because only they had access to the data, making the particular findings singular and unique to that specific brand and presenting a key competitive advantage in the content landscape. While working with internal data comes with its own potential pitfalls and challenges, seeking to collaborate with a client to select meaningful internal data and directing its subsequent use for content and narrative should be at the forefront of a content marketer’s mind. Blurring lines and breaking boundaries A fascinating piece recently on Recode sought to slightly reframe the high-publicity challenges facing journalists, stating: “The plight of journalists might not be that bad if you’re willing to consider a broader view of ‘journalism.’” The piece detailed that while job postings for journalists are off more than 10 percent since 2004, jobs broadly related to “content” have nearly quadrupled over the same time period. Creatives will always flock to the options that allow them to make what they love, and with organic search largely viewed as a meritocracy of content, the opportunities for brands and content marketers to utilize the data journalism toolkit have never been greater. What’s more, much of the best data journalism out there typically only uses a handful of visualizations to get its point across. It was also reported recently that the median amount of data sources for pieces created by the New York Times and The Washington Post was two. It too is worth noting that more than 60 percent of data journalism stories in both the Times and Post during a recent time period (January-June, 2017) relied only on government data. Ultimately, the ease of running large surveys via a platform like Prolific Research, Qualtrics, or Amazon Mechanical Turk, coupled with the ever-increasing number of free and open data sets provided by both the US Government or sites like Kaggle or data.world means that there is no shortage of numbers out there for content marketers to dig into and use to drive storytelling. The trick is in using the right blend of hard data and more ethereal emotional appeal to create a narrative that is truly compelling. Wrapping up As brands increasingly invest in content as a means to propel organic search and educate the public, content marketers should seriously consider putting these key elements of data journalism into practice. In a world of endless spin and the increasing importance of showing your work, it’s best to remember the famous quote written by longtime Guardian editor C.P. Scott in 1921: “Comment is free, but facts are sacred.” What do you think? How do you and your team leverage data journalism in your content marketing efforts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Key Lessons Content Marketers Can Take From Data Journalists"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Key Lessons Content Marketers Can Take From Data Journalists"
    },
    {
      "level": "H2",
      "text": "The numbers drive the narrative"
    },
    {
      "level": "H2",
      "text": "Plotted points are more trustworthy than written words"
    },
    {
      "level": "H3",
      "text": "“Numbers don’t lie” vs. brand trustworthiness"
    },
    {
      "level": "H2",
      "text": "Find the nexus of simple and beautiful"
    },
    {
      "level": "H3",
      "text": "Striking the balance"
    },
    {
      "level": "H2",
      "text": "Every brand’s data has a story to tell"
    },
    {
      "level": "H3",
      "text": "Deciding when to share"
    },
    {
      "level": "H2",
      "text": "Blurring lines and breaking boundaries"
    },
    {
      "level": "H2",
      "text": "Wrapping up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Gillespie\n          \n            Matt Gillespie"
}