{
  "url": "https://moz.com/blog/david-naylor-a-great-perspective",
  "slug": "david-naylor-a-great-perspective",
  "title": "David Naylor - A Great Perspective - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "David Naylor, an SEO based in the UK (of which there are quite a few it seems), has a terrific, if brief blog on which he writes - Changing Face...",
  "content": "David Naylor - A Great Perspective Public Relations By: Rand Fishkin February 25, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 25, 2005 David Naylor - A Great Perspective Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. David Naylor, an SEO based in the UK (of which there are quite a few it seems), has a terrific, if brief blog on which he writes - Changing Face of Search. This discussion is one that will go on for some time, but I suspect that Dave is right - Google can not afford to continue to make enemies in the webmaster community without repercussions to their bottom line. Sorry for the short post - I have been traveling and will be on the east coast until next Saturday. During the SES conference I should have great stuff to report, however. BTW - I'm considering adding the ability for visitors to comment. Email me and let me know if you have a preference. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "David Naylor - A Great Perspective"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "David Naylor - A Great Perspective"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}