{
  "url": "https://moz.com/blog/day-1-at-the-seomoz-training-raceway",
  "slug": "day-1-at-the-seomoz-training-raceway",
  "title": "Day 1 at the SEOmoz Training Raceway - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I’m going to speed through the 2nd half of the 1st day at the SEOmoz Pro Training Race Track. Recall that 9 speakers raced through topics covering clicks to conversions.The following are highlights of the end of the race for Day ...",
  "content": "Day 1 at the SEOmoz Training Raceway SEO Events D By: DanaLookadoo September 1, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: DanaLookadoo September 1, 2010 Day 1 at the SEOmoz Training Raceway SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I’m going to speed through the 2nd half of the 1st day at the SEOmoz Pro Training Race Track. Recall that 9 speakers raced through topics covering clicks to conversions.The following are highlights of the end of the race for Day 1. Presentation Off Insights distilled also included the business side of pitching SEO. Will Critchlow and Rand Fishkin dueled it out for their \"Presentation Off\" to determine who could give the best advice for “How to Pitch SEO.” This marked the first time they “faced off” in battle on US Soil. Will held the winning title to date. Bottom line, both of them presented valuable insights about pitching and when not to pitch (or bother). Takeaways from Will Critchlow, The Champion: Don’t sell to people who have to be convinced of SEO. It’s best to sell to those who know about SEO, those who know they need it. Then, you never pitch SEO ever again. Will explained why you don’t sell SEO in the pitch: You pitch SEO before that. Selling the client on SEO is a separate conversation, if necessary at all. Will has been asked to help model the business impacts of SEO changes. such is a different story. He showed the Mozzers how to look at the prospective client’s industry and give them some unique data. He shared an Excel file to help you (us) control a lot of assumptions. Download Distilled’s SEO Traffic Model spreadsheet. http://dis.tl/dk6N59 <nice!> Takeaways from Rand Fishkin, The Challenger: Rand focused on the emotional side and winning minds of the in-house SEO Get engineers & developers on your side. Explain how SEO will benefit their projects to help them boost speed, grow browse rate (pages/visit), improved accessibility, minimize errors, increase usabiltiy. In pitching SEO, you can then go one step further to help them sell their project(s) with SEO. From there, help sell other projects for marketing, design, sales, etc. Rand showed graphs and slides on how to show value based off ROI - showing the value of their traffic: <If you're taking notes, you can see how this would fit into a spreasheet...> Rand then explain search growth over time - meaning, search is growing, period! If they are not adding 20% budget to SEO, then they are falling back. “Every day, there are more than a billion searches for information on Google. These people have specific intents. If you’re not adding 20% to your SEO budget this year, you’re falling behind the average.\" Show prospective clients which competitors are winning for their keywords: Show competitors in SERPs. Match it with yeyword demand. Show how they are doing, side-by-side. And the winner of the Presentation Off is ... Rand Fishkin, who edged over the finish line just in front of Will Critchlow. OK, let’s catch the replay highlights of the rest of the search marketing race. Joanna Lord drove the fastest car, “The End of Analysis Paralysis.” She explained it’s time to get serious with metrics and conversions: 1. What is your website trying to do? 2. If one metric could identify that you are succeeding or failing, what would it be? How would you know you are gaining or losing ground? 3. What is the biggest threat to your success? You should only have 3 or 4 metrics, no more than 5. (Focus) Joanna then sped around Google Analytics advanced filter fun, including: Social Network Filters – combine Google Image Search - Low hanging fruit if you SEO out of images Cascading Filters – see LunaMetrics.com for tips on customizing advanced filters – something that’s NOT in Google Analytics documentation. Joanna was stopped in her tracks when she polled the Mozzers to find out how many were using Multiple Custom Variables - 2 hands raised. MCV is the ability for us to tag visitors for any number of interactions on our site. It goes beyond the single user-defined variable _setVar() and replaced it with _setCustomVar(). Multiple Custom Variables give us the ability for us to tag visitors for any number of sessions to enable “first touch” attribution rather than Google Analytics default “last touch.” Resource: How to do First Touch Tracking in Google Analytics Joanna then screeched around the corner to present her Advanced Analytics Checklist: Filter the data so you are getting the data you want to manipulate Segment the data so you can see the right data in different ways Customize reports so you can compare valuable data sets, find intersections & relationships Take the resulting insights and dive deeper Use those deep dive insights and make them actionable for your company Show the action items (not the data) to your company Last but not least…do the analytics victory dance. Whew... surely it was time to full-up again after that session, but no... more typing at high speeds: Marshall Simmonds - Site Architecture & Best Practices for Big Site SEO Marshall Simmonds is a seasoned Enterprise-level SEO and works with the NY Times, previously with About.com. Working on large sites requires triage and prioritization. (Race car drivers overlook a chip in the paint when the carburator blows out.) Any level of SEO can view the following triage tips for their own site to determine where to best spend their time: High Priority Tactics: Sitemaps Education 301s Template SEO – fixing titles, captions, linking Rel=canonical Rewriting urls How much it will make? What's the cost/traffic potential Low Priority Tactics: Page load time / site speed – most of time they don’t care, but upper mgt does care. It’s only 1 of 200 signals. URLs Link Flow Video SEO Duplicate content CMS Overhaul W3C compliance Focus on best practices for the long term. Marshall often recommends you don't budget for an SEO project. Putting a dollar amount to it turns it into a a project with an end point. SEO doesn't have an end point. Marshall proceeded to explain that the NY Times is a duplicate content factory and has some SEO challenges. As a news property, they dramatically see the importance of the following principle: Optimize all assets! Ask: Are there any assets that you are not optimizing? If not, then competition is beating. Key takeaways for all of us in the SEO race: rel=”canonical” is a band aid and solves the problem. Google is not necessarily crawling organically for video, which puts focus on video XML sitemap. Webmaster Tools reports a lot of errors. Title is the most important element. Analytics suck!!!!!!!! Omniture – over reports search referrers Webtrends – under reports search referrers (have to add images) Google analytics doesn’t scale – in middle of search referrers. Bottom line, add as many analytics packages that you can afford, optimize, track and prioritize. Tom Critchlow Keyword Research & Targeting Tom Critchlow of Distilled explained that you need to group all keywords: Head terms – main terms, everything you can put in a calendar and plan forMid-tail – hot trends, cyclical demand, triggered by QDFLong-tail – 4+ words, opportunity since 20-25% of the queries Google sees today they have never seen before. QDF = Query Deserves Freshness QDF is riddled with spam, returns 90% malicious links. Tip: Publish Fast – Cite Fast!! Keyword harvesting tools: Google Search Suggest Ninja tip: Geolocation – Google Search Suggest is geo-specific Google Related Searches Mozenda + API = WIN Mozenda is a paid tool http://mozenda.com/ Easy to use paid tool. Input terms and get long tail key phrases that don’t show up in AdWords tool and long-tail, niche. Look at other data sources. Don’t restrict yourself to keyword tools, and use other data sources relative to your niche. Look at how people tag stories on Delicious The following is a shot of how to use Mozinda to review tags on Delicious.com. (You can look at Delicious tags without using Mozinda.) Discount code that applies to full pro plan: seomoz20 (Valid till Sep 15th 2010.) Build an SEO friendly CMS: Below is a wireframe template for an ideal CMS that pulls data in: Discussion raced through use of APIs for scraping content from the Web and incorporating on your pages to include additional keywords. The boxes on the right represent ideas for pulling in the following: Delicious tags – todo, toread (API) Foursquare top checkins (API) Local events calendar (API) Yahoo Answers (API) Wikipedia discussions of your keyword (APIish) No API? – Mozenda ftw! More: https://moz.com/blog/api-and-dataset-cheatsheet-building-quick-dirty-tools The Mozzers had lots of questions from the audience about this CMS concept, and Tom’s answer was: \"It’s not that hard!\" <sigh> Tom then gave away a proof of concept Google doc that scrapes Google Suggest and Google Search. Thank you, Tom! Lindsay Wassell - Constructing Effective SEO Audits Lindsay Wassell got deep under the hood like no one else has done at a conference to show her approach and outline of SEO Audits, starting with her daily schedule. I especially liked that she set a schedule to focus on one client in one day and allow time for lunch to ponder your findings and approach. Tip: Allow ponder time & 6 weeks or more to deliver an audit. Give it enough time. The following SEO Audit Outline lays out a suggested framework: She incorporates a Scorecard for rating issues with a 1-5 rating scale: Some Scores are site-wide and some scores are finding-specific. She placed importance on showing visuals and also providing an actionable Executive Summary. SEOs realize that a 40-page audit is likely to sit on someone’s desk for weeks or months. Give them takeaways they can begin working on now. Tim Ash – 7 Deadly Sins of Landing Page Optimization The final race of the day focused on after the click – conversions. Discussion included importance of considering what you do with all that SEO & PPC traffic after they arrive at the site. Tim Ash did a poll at the end of the race day to see how many Mozzers were doing Conversion Rate Optimization (CRO). Almost 1/2 of the room raised their hand. Tim starts with insults – You are ignorant and blind. He then asked: How many of you have talked to the end user in the last quarter? Well, only a few admitted to talking to website users ... Tim showed us how to avoid the following 7 Deadly Sins of Landing Page Design: Unclear call-to-action Too many choices Asking for too much info Too much text Not keeping your promises Visual distractions Lack of trust We all left the SEOmoz Raceway convinced that our baby is ugly and tips to optimize and beautify our website babies. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Day 1 at the SEOmoz Training Raceway"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Day 1 at the SEOmoz Training Raceway"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "DanaLookadoo\n          \n            DanaLookadoo"
}