{
  "url": "https://moz.com/blog/day-one-of-mozcon-2019",
  "slug": "day-one-of-mozcon-2019",
  "title": "MozCon 2019: The Top Takeaways From Day One - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Topics ranged from local SEO, link building, and Google tools, and there was no shortage of \"Aha!\" moments. And while the content was diverse, the themes are clear: search is constantly changing.",
  "content": "MozCon 2019: The Top Takeaways From Day One Moz News | SEO Events By: Kameron Jenkins July 15, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins July 15, 2019 MozCon 2019: The Top Takeaways From Day One Moz News | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rand, Russ, Ruth, Rob, and Ross. Dana and Darren. Shannon and Sarah. We didn’t mean to (we swear we didn’t) but the first day of MozCon was littered with alliteration, takeaways, and oodles of insights from our speakers. Topics ranged from local SEO, link building, and Google tools, and there was no shortage of \"Aha!\" moments. And while the content was diverse, the themes are clear: search is constantly changing. If you're a Moz community member, you can access the slides from Day One. Not a community member yet? Sign up — it's free! Get the speaker slides! Ready? Let's make like Roger in his SERP submarine and dive right in! Sarah's welcome Our fearless leader took the stage to ready our attendees for their deep sea dive over the next three days. Our guiding theme to help set the tone? The deep sea of data that we find ourselves immersed in every day. People are searching more than ever before on more types of devices than ever before… we truly are living in the golden age of search. As Sarah explained though, not all search is created equal. Because Google wants to answer searchers’ questions as quickly as possible, they’ve moved from being the gateway to information to being the destination for information in many cases. SEOs need to be able to work smarter and identify the best opportunities in this new landscape. \"Let's lift each other up.\"@SarahBird This is truly what #MozCon is all about!— Sha Menz (@ShahMenz) July 15, 2019 Today, Google is a destination. they want to keep you there and give you the answer...@SarahBird #mozcon— Greg Gifford (@GregGifford) July 15, 2019 Rand Fishkin — Web Search 2019: The Essential Data Marketers Need Next up was Rand of SparkToro who dropped a ton of data about the state of search in 2019. To set the stage, Rand gave us a quick review of the evolution of media: “This new thing is going to kill this old thing!” has been the theme of panicked marketers for decades. TV was supposed to kill radio. Computers were supposed to kill TV. Mobile was supposed to kill desktop. Voice search was supposed to kill text search. But as Rand showed us, these new technologies often don’t kill the old ones — they just take up all our free time. We need to make sure we’re not turning away from mediums just because they’re “old” and, instead, make sure our investments follow real behavior. Voice search didn’t kill desktop search. Both mobile and desktop are still big. Don’t ignore either. #mozcon @randfish pic.twitter.com/YusAXepmS9— Yosef Silver (@ysilver) July 15, 2019 Rand’s deck was also chock-full of data from Jumpshot about how much traffic Google is really sending to websites these days, how much of that comes from paid search, and how that’s changed over the years. In 2019, Google sent ~20 fewer organic clicks via browser searches than in 2016. In 2016, there were 26 organic clicks for every paid click. In 2019, that ratio is 11:1. Over time, you can see a trend of Google cannibalizing more and more clicks. In 2016 there were 26 organic clicks/paid click. In 2019? 11:1. Still big but a lot smaller. @randfish #mozcon— Ruth Burr Reedy (@ruthburr) July 15, 2019 Google still owns the lion’s share of the search market and still sends a significant amount of traffic to websites, but in light of this data, SEOs should be thinking about how their brands can benefit even without the click. MozCon 2019 off to a great start. First of many interesting snippets from Rand Fishkin: “More than half of all Google searches are now zero-click”.Ouch.#mozcon #mozcon2019 #contentmarketing #google #search #seo #clickthelink @Moz @randfish pic.twitter.com/au5UZSPtP5— Jonathan Clarke (@TechnologyJon) July 15, 2019 And finally, Rand left us with some wisdom from the world of social — getting engagement on social media can get you the type of attention it takes to earn quality links and mentions in a way that’s much easier than manual, cold outreach. Ruth Burr Reedy — Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents It’s 2019. And though we all thought by this year we’d have flying cars and robots to do our bidding, machine learning has come a very long way. Almost frustratingly so — the push and pull of making decisions for searchers versus search engines is an ever-present SEO conundrum. Ruth argued that in our pursuit of an audience, we can’t get too caught up in the middleman (Google), and in our pursuit of Google, we can’t forget the end user. Optimizing for humans-only is inefficient. Those who do are likely missing out on a massive opportunity. Optimizing for search engines-only is reactive. Those who do will likely fall behind. Optimizing for human-readable quality signals means even if something doesn’t turn out to be a ranking factor, you still haven’t wasted your time. #MozCon— Ruth Burr Reedy (@ruthburr) July 15, 2019 She also left us with the very best kind of homework… homework that’ll make us all better SEOs and marketers! Read the Quality Rater GuidelinesAsk what your site is currently benefiting from that Google might eliminate or change in the futureWrite better (clearer, simpler) contentExamine your SERPs with the goal of understanding search intent so you can meet itLean on subject matter experts to make your brand more trustworthyConduct a reputation audit — what’s on the internet about your company that people can find? And last, but certainly not least, stop fighting about this stuff. It’s boring. Homework: Stop fighting about this stuff, it’s boring #MozCon— Ruth Burr Reedy (@ruthburr) July 15, 2019 Thank you, Ruth! Dana DiTomaso — Improved Reporting & Analytics Within Google Tools Freshly fueled with cinnamon buns and glowing with the energy of a thousand jolts of caffeine, we were ready to dive back into it — this time with Dana from Kick Point. This year was a continuation of Dana’s talk on goal charters. If you haven’t checked that out yet or you need a refresher, you can view it here! Dana emphasized the importance of data hygiene. Messy analytics, missing tracking codes, poorly labeled events… we’ve all been there. Dana is a big advocate of documenting every component of your analytics. She also blew us away with a ton of great insight on making our reports accessible — from getting rid of jargon and using the client’s language to using colors that are compatible with printing. Love how @danaditomaso encourages the use of labels for her report names...\"Are people getting in touch\" such a great basic label. That doesn't require a lot of interpretation / translation #mozcon pic.twitter.com/ZLUwoY1L7J— Wil Reynolds (@wilreynolds) July 15, 2019 And just when we thought it couldn’t get any more actionable, Dana drops some free Google Data Studio resources on us! You can check them out here. (Also, close your tabs!) Rob Bucci — Local Market Analytics: The Challenges and Opportunities The first thing you need to know is that Rob finally did it — he finally got a cat. .@STATrob kicked off his preso with a kitten and I couldn’t be more interested in local SEO now. #mozcon pic.twitter.com/PKctqVcyQJ— Angela Rivera (@angfrivera) July 15, 2019 Very bold of Rob to assume he would have our collective attention after dropping something adorable like that on us. Luckily, we were all able to regroup and focus on his talk — how there are challenges aplenty in the local search landscape, but there are even more opportunities if you overcome them. Rob came equipped with a ton of stats about localized SERPs that have massive implications for rank tracking. 73 percent of the 1.2 million SERPs he analyzed contained some kind of localized feature. 25 percent of the sites he was tracking had some degree of variability between markets. 85 percent was the maximum variability he saw across zip codes in a single market. That’s right… rankings can vary by zip code, even for queries you don’t automatically associate as local intent. Whether you’re a national brand without physical storefronts or you’re a single-location retail store, localization has a huge impact on how you show up to your audience. With this in mind, Rob announced a huge initiative that Moz has been working on… Local Market Analytics — complete with local search volume! Eep! See how you perform on hyper-local SERPs with precision and ease — whether you’re an online or location-based business. ⁦@STATrob⁩ with a mic drop. All slides are capability reporting in Local Marketing Analytics tool in Moz Pro. #mozcon pic.twitter.com/s5aG9YCxzc— Jeff Russell (@rock_hawk) July 15, 2019 It launched today as an invitation-only limited release. Want an invite? Request it here! Ross Simmonds— Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing Ross Simmonds was up next, and he dug into how you might be creating content wrong if you’re building it strictly around keyword research. The methodology we marketers need to remember is Research - Rethink - Remix. Research: Find the channel your audience spends time on. What performs well? How can you serve this audience? Rethink: Find the content that your audience wants most. What topics resonate? What stories connect? Remix: Measure how your audience responds to the content. Can this be remixed further? How can we remix at scale? Awesome.Ross lays out the process for finding the user / channel / content fit. Here's the framework...Resarch > Rethink > RemixBy @TheCoolestCool #mozcon pic.twitter.com/cBRCIZIony— Andy Crestodina (@crestodina) July 15, 2019 If you use this method and you still aren’t sure if you should pursue a content opportunity, ask yourself the following questions: Will it give us a positive ROI?Does it fall within our circle of competence? Does the benefit outweigh the cost of creation? Will it give us shares and links and engagement? Thanks, Ross, for such an actionable session! Shannon McGuirk — How to Supercharge Link Building with a Digital PR Newsroom Shannon of Aira Digital took the floor with real-life examples of how her team does link building at scale with what she calls the “digital PR newsroom.” The truth is, most of us are still link building like it’s 1948 with “planned editorial” content. When we do this, we’re missing out on a ton of opportunity (about 66%!) that can come from reactive editorial and planned reactive editorial. Shannon encouraged us to try tactics that have worked for her team such as: Having morning scrum meetings to go over trending topics and find reactive opportunitiesStaffing your team with both storytellers and story makersHolding quarterly reviews to see which content types performed best and using that to inform future work Her talk was so good that she even changed Cyrus’s mind about link building! Not an easy thing to do! :) INCREDIBLE talk by @ShannonMcGuirk_ !!! Don't miss her #MozCon deck on strategic link building! https://t.co/f10KGDYt7y— Britney Muller (@BritneyMuller) July 15, 2019 For free resources on how you can set up your own digital PR newsroom, visit: aira.net/mozcon19. Darren Shaw— From Zero to Local Ranking Hero Next up, Darren of Whitespark chronicled his 8-month long journey to growing a client’s local footprint. Here’s what he learned and encouraged us to implement in response: Track from multiple zip codes around the cityMake sure your citations are indexedThe service area section in GMB won’t help you rank in those areas. It’s for display purposes onlyInvest in a Google reviews strategyThe first few links earned really have a positive impact, but it reaches a point of diminishing returnsAny individual strategy will probably hit a point of diminishing returns A full website is better than a single-page GMB website when it comes to local rankings As SEOs, we’d all do well to remember that it’s not one specific activity, but the aggregate, that will move the needle! @DarrenShaw_ is on stage at #MozCon right now sharing all the awesome details of his case study on going From Zero to Local Ranking Hero. Get an inside look into the process, strategies, and tactics implemented on our site! https://t.co/7UXOpcwr5A— Whitespark (@whitespark) July 15, 2019 Russ Jones — Esse Quam Videri: When Faking it is Harder than Making It Rounding out day one of MozCon was our very own Russ Jones on Esse Quam Videri — “To be, rather than to seem.” By Russ’s own admission, he’s a pretty good liar, and so too are many SEOs. In a poll Russ ran on Twitter, he found that 64 percent of SEOs state that they have promoted sites they believe are not the best answer to the query. We can be so “rank-centric” that we engage in tactics that make our websites look like we care about the users, when in reality, what we really care about is that Google sees it. Russ encouraged SEOs to help guide the businesses we work for to “be real companies” rather than trying to look like real companies purely for SEO benefit. Thanks to Russ for reminding us to stop sacrificing the long run for the short run! Really great talk by @rjonesx today! Great mix of philosophical food for thought & actionable takeaways. I left feeling inspired and like I have specific action items. #mozcon #mozcon2019 pic.twitter.com/s46LvWkmIT— Charissa Hearon (@thatnewidea) July 16, 2019 Phew — what a day! And it ain't over yet! There are two more days to make the most of MozCon, connect with fellow attendees, and pick the brains of our speakers. In the meantime, tell me in the comments below — if you had to pick just one thing, what was your favorite part about day one? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon 2019: The Top Takeaways From Day One"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon 2019: The Top Takeaways From Day One"
    },
    {
      "level": "H2",
      "text": "Sarah's welcome"
    },
    {
      "level": "H2",
      "text": "Rand Fishkin — Web Search 2019: The Essential Data Marketers Need"
    },
    {
      "level": "H2",
      "text": "Ruth Burr Reedy — Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents"
    },
    {
      "level": "H2",
      "text": "Dana DiTomaso — Improved Reporting & Analytics Within Google Tools"
    },
    {
      "level": "H2",
      "text": "Rob Bucci — Local Market Analytics: The Challenges and Opportunities"
    },
    {
      "level": "H2",
      "text": "Ross Simmonds— Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing"
    },
    {
      "level": "H3",
      "text": "Research:"
    },
    {
      "level": "H3",
      "text": "Rethink:"
    },
    {
      "level": "H3",
      "text": "Remix:"
    },
    {
      "level": "H2",
      "text": "Shannon McGuirk — How to Supercharge Link Building with a Digital PR Newsroom"
    },
    {
      "level": "H2",
      "text": "Darren Shaw— From Zero to Local Ranking Hero"
    },
    {
      "level": "H2",
      "text": "Russ Jones — Esse Quam Videri: When Faking it is Harder than Making It"
    },
    {
      "level": "H2",
      "text": "Phew — what a day!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}