{
  "url": "https://moz.com/blog/day-of-the-longtail",
  "slug": "day-of-the-longtail",
  "title": "Day of the Longtail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To commemorate the publication of Chris Anderson's book, The Long Tail, self-proclaimed \"z-l...",
  "content": "Day of the Longtail Online Advertising K By: katfive July 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: katfive July 28, 2006 Day of the Longtail Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. To commemorate the publication of Chris Anderson's book, The Long Tail, self-proclaimed \"z-list blogger\" Mickeleh - can you really call yourself that after link love from Boing Boing? - uploaded what he imagine's Hollywood's remake of the story will be. Part War of the Worlds and part zombie flick, Day of the Longtail promises to be a film that will horrify marketing execs worldwide. Well, it might if it weren't a parody. Watch it on YouTube. Anderson's hot new bestseller is already experiencing a bit of sensational attention. Though the long tail concept is nothing new (the original Wired article was published in October 2004) it's still making its way into more conservative circles. Wall Street Journal columnist Lee Gomes responded to say that he \"doesn't think things are changing\" as much as Anderson does. Another theme of the book is that \"hits are starting to rule less.\" But when I looked online, I was surprised to see what seemed like the opposite. Ecast says 10% of its songs account for roughly 90% of its streams; monthly data from Rhapsody showed the top 10% songs getting 86% of streams. Based on Gomes's data, the role of the long tail isn't, as Anderson says, \"big and getting bigger.\" In fact, the 'hits' are far outselling the 'misses,' not the other way around. Gomes's column is an interesting attempt to debunk an already disruptive theory. Of course, Anderson wrote a rebuttal, and is complimented by the fact that the WSJ made it their mission to take him down: Let's say you have 1,000 items and the top 100 (10%) account for 50% of the sales. Then you add another 99,000 items to the catalog, and the sales of that top 100 fall to just 25% of the total, while it takes another 900 items to make up the next 25%. I would say that demand has shifted down the tail, because those top 100 items have dropped from half the market to just a quarter of it and the rest of the demand is spread over more items. But by Gomes' math, we've gone from a market where 10% of products make 50% of the revenues to one where 1% of the products make 50% of the revenues--in other words, it's become more hit-centric. I think this is simply a misunderstanding of basic statistics, and I'm disappointed that Gomes, despite many emails from me and at least one economist to him on this point, chose to simply say that I don't agree with that approach (but not why). And Gomes responded back (in someone else's blog). Flame war, anyone? Anderson writes, The big lesson, as Rex Hammock points out, was the advantage of having a blog. The WSJ got the first word, but the conversation continued out here in the blogosphere, both in my comments and on other blogs thanks to the very classy decision of the WSJ editors to put a link to my response in a prominent box in Gomes' story. Gomes, not having his own blog (by WSJ policy perhaps), was forced to respond by asking blogger Nick Carr to post an email from him the next morning, which was too little, too late. Hmm, all I can say to that is... INTARWEB FTW!!! Erick Shonfeld from Business 2.0 tried to clear up the confusion for all the readers lost in the fray with a B2DAY post, ... the interesting question is not so much whether the tail is bigger than the head. It is not. The really interesting question is: How long can the tail get? Thanks, Erick! It really is that simple. There is a long tail, it is affecting businesses, and even I can see that. Before things like iTunes, Last.fm, and Pandora, the only way I (being a non-music savvy consumer) could find new tunes was to mooch off my friends or listen to the radio. The pure power of suggestion: user recommendation, grouping like with like, and allowing music sampling, has led me to purchase far more and far obscurer music than I ever have before. Oh, and thank you Netflix for making accessible the crazy Japanese horror flicks I can't get anywhere else! I know folks like Gomes need hard numbers to make themselves feel better. I am a journalist, so I do understand that. But really, the proof is in the pudding. Now that the meme is out in the mainstream, let's wait and see how the long tail grows. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Day of the Longtail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Day of the Longtail"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "katfive\n          \n            katfive"
}