{
  "url": "https://moz.com/blog/days-of-our-lives-and-the-drama-that-fills-them",
  "slug": "days-of-our-lives-and-the-drama-that-fills-them",
  "title": "Days of our Lives... and the Drama That Fills Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With Rand and the crew AFK at SMX West ...I figured it's freed up some time in the spotlight for a novice like myself.  For those wondering, I'm not an SEO expert, or a CEO or anything like that, I'm an IT Manager for a medium sized company.  I've learned and applied concepts learned from my…",
  "content": "Days of our Lives... and the Drama That Fills Them Search Engines G By: George Davis December 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: George Davis December 8, 2007 Days of our Lives... and the Drama That Fills Them Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. With Rand and the crew AFK at Pubcon </jealousy>...I figured it's freed up some time in the spotlight for a novice like myself. For those wondering, I'm not an SEO expert or a CEO or anything like that. I'm an IT Manager for a medium sized company. I've learned and applied concepts learned from my membership here at SEOmoz and a few other locations and it is (finally) paying off. Anything I talk about here is strictly speaking as an SEO newbie, and it's purely my observations. I have a lot of cool YOUmoz post ideas that I am working on, but I just wrote this one up today in an hour or so... Speaking of today, I don't know if anybody knows this yet, so this is probably breaking news to most of the mozzers...but today Matt Cutts & Co. demonstrated their more-than-suggestive stance on buying/selling links that pass PageRank. With supporters of the policy few and far between, I thought I would outline (albeit in a somewhat cynical way) the reception of our community and try to get the ball rolling on SEOmoz buzz for this particular drollery... What stood out most to me is the lack of creativity and abundance of redundancy in every comment. 1. You have your usual SEO trolls : Wouldn't you know, the second they go and pass a policy like this, all the people with the cure for cancer and people basing life and death decisions off of Google SERPs are commenting. It's almost as if nobody has a real job where they are in it to make money. 2. You also have your avid supporters, who most likely have no proverbial chips in the [seo] pot. 3. Then you have one of curious origins: the type who can't seem to understand that Google is a privately owned company, with the primary interest of making money. Matt explains it over and over again, but he can't seem to understand it. Should it please the mozzers (Copyright 2007, Sarah Bird), I submit this guy for quote of the century : \"I will be so glad when your doofus ranking system is no longer an issue in the companies I work for.\" Now...I found this choice of wording interesting, perplexing, moooving. A little known but reliable source (the dictionary) defines \"Doofus,\" using such words as: \"Incompetent, Inept, Foolish\" Now, I realize that recent trends suggest Google is making some unwise choices, but certainly nobody is banking on the extinction of Google anytime soon? CERTAINLY \"incompetent\" is a bit of a negative overstatement for a 120 BILLION Dollar global giant? I've told these people a million times... STOP EXAGGERATING. I REALLY think we in the community tend to be short sighted in the way we view SEO. I may not have known all of the trends of SEO for the past 10 years, but from what I read, I know there is one constant denominator that is very little discussed or acknowledged, and that is the ability of this community to change and adapt in the face of circumstances outside of your control. We can't continue to look at our industry with a stagnant mindset. It's probably got a lot to do with the fact that it seems like all of the discussion in the SEO community is 90% analyzing how search engines HAVE done things, or how they might be doing them now, but very little talk about how things WILL be done (aside from the recent interview with Danny Sullivan, which is EXCELLENT content). I think this needs to be flipped around, with 90% of the talk being about how things WILL happen, especially at this stage where we are on the verge of a possible complete re-design of how SERPs are determined. I realize that due to the fact that we are in sort of an ongoing battle of anonymity with the SEs we have to base our theories on past data, but we need to take this into account and be proactive in our attitudes and reactions to changes which are OBVIOUSLY going to happen regardless of the implementation method... Wait wait wait.... I'm getting too mushy here.... *deep breath*... How do we apply this to today's episode of 90210 the current drama? I can't speak for people who obviously have more experience than me, but I can say that we should look on this situation dispassionately, at least at first. Offer solutions, alternate implementations, and different models of doing things. I have to say I have a hand in a LOT of different industry fields, from financial consulting to a slew of programming languages (and even the occasional social media indulgence), and I know that the level of involvement that is shown by Cutts & Co. is like nothing I've ever seen. I look at the amount of public correspondence that takes place between Average Joe and Google Project managers, and it's probably unheard of in most niches. Let's take advantage of this and not leave a sour taste in the mouth of Google. I'm really keen on hearing your guys' comments, especially with this being my first post--just make sure you learned a lesson :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Days of our Lives... and the Drama That Fills Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Days of our Lives... and the Drama That Fills Them"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Davis\n          \n            George Davis"
}