{
  "url": "https://moz.com/blog/dealing-with-a-yahoo-penalty",
  "slug": "dealing-with-a-yahoo-penalty",
  "title": "Dealing with a Yahoo! Penalty - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yahoo! and I have always had an excellent relationship, which is why I was so perturbed to find that they banned a site I've been working with for several years - www.avatarfinancial.com.\nLast week, a ...",
  "content": "Dealing with a Yahoo! Penalty Blogging By: Rand Fishkin May 20, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 20, 2005 Dealing with a Yahoo! Penalty Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yahoo! and I have always had an excellent relationship, which is why I was so perturbed to find that they banned a site I've been working with for several years - www.avatarfinancial.com. Last week, a site:avatarfinancial.com command at Yahoo! brought nearly 400 results. That number has now dropped to 8. Obviously, a careful inspection of the site is warranted to see why Yahoo! has instituted this penalty. I've always been very wary of breaking any of the search engines' terms of service, and Yahoo!'s is, to me, particularly clear and well written. I've also dived into searching for others with similiar issues, only to find the major forums bombarded by people who've been thrown out of Yahoo!, both recently and over the last few years. Here are some of the more pertinent threads: Kicked out of Yahoo! - SEO Chat Banned by Yahoo! - SEW Yahoo Update - HighRankings With Yahoo! not sending any traffic (except for the few people every day who type in the URL and get sent over), it was also time to carefully examine my historic traffic levels to see what was missing. The results show Yahoo! sending, on average, 30% of the traffic Google sends - around 15-20% of total traffic. What has struck me as very odd is that ever since the Yahoo! traffic turned off (which was actually almost 3 weeks ago - just before my trip to SES Toronto), traffic from MSN, AskJeeves & Google has picked up a bit. One hypothesis is that Yahoo! searchers are unhappy in general with the results for the search terms that brought up avatarfinancial.com and are switching to MSN, Ask & Google to attempt another search. While investigating the cause, I did find many thousands of spammy sites linking to Avatar, causing me to get suspicious. Most of them, however, look like content scraper sites that are constantly crawling the web and search engines to steal and re-post content. It would be tragic, indeed, if these sites were responsible for the loss thanks to their unwanted link programs. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Dealing with a Yahoo! Penalty"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Dealing with a Yahoo! Penalty"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}