{
  "url": "https://moz.com/blog/dear-google-big-brands-arent-enough",
  "slug": "dear-google-big-brands-arent-enough",
  "title": "Dear Google: Big Brands Aren't Enough - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's recent brand update means that a large brand can completely dominate the top 10 with a single website. Is that what searchers really want?",
  "content": "Dear Google: Big Brands Aren't Enough Search Engines By: Dr. Peter J. Meyers August 25, 2010 Table of Contents Copied! By: Dr. Peter J. Meyers August 25, 2010 Dear Google: Big Brands Aren't Enough Search Engines Google's recent brand update has gotten a lot of buzz this past week. Previously, the best a single domain could hope for was one listing in the SERPs with possibly 1-2 indented listings. Now, a large brand can completely dominate the top 10 with a single website. Let's look at the case many people have been citing – a search for \"apple\". Here's a summary of what that results page looks like today:Apple.com dominates the 1st page, holding slots 1-7, with a few other big brands finishing up the top 10. Google's argument seems to be that this is good for consumers, but is a SERP monopolized by a single website really what search users are looking for?Unraveling Search IntentOne of the ways you can tell what a searcher is interested in is by looking at the way they refine that search. It's nearly impossible to sort out the intent behind a search for \"apple\" by itself, but if you look at follow-up searches, they start to paint a clearer picture.Thanks to a Twitter shout-out from Dave Naylor, the folks at Hitwise (thanks, Matt) were kind enough to pull some data from their Search Term Sequence tool for me. The data below is a 4-week snapshot (prior to the brand update) of what people searched for after they searched for \"apple\": \"itunes\" \"facebook\" \"youtube\" \"apple\" \"best buy\" \"apple store\" \"google\" \"craigslist\" \"itunes download\" Of course, some of these queries are the typical exit queries (\"youtube\"), and some are people who probably didn't get what they wanted the first time and typed \"apple\" again later (if at first you don't succeed…). Apple.com is clearly represented in some of this search intent, but there's also an implied attempt (\"best buy\", \"craigslist\") to buy Apple products at stores outside of Apple.com. In the current top 10, not a single non-Apple retailer is currently featured, a fact that pretty clearly has an impact on consumer choice.Bing Search FunnelUnfortunately, Google doesn't have a tool for isolating its query funnels, but Bing does over at adCenter Labs (thanks to Branko Rihtman for the tip). With the Search Funnel tool, you can isolate keywords that start or end with a specific word:Although Bing searchers, especially the former MSN portal crowd, are known to differ from Google visitors a bit, the chain of intent for the average consumer undoubtedly has many similarities. Here are the top 10 post-\"apple\" queries on Bing: \"bestbuy\" \"ebay\" \"ipod\" \"dell\" \"appleipod\" \"circuitcity\" \"apple vacations\" \"apple.com\" \"sony\" \"target\" Here, the trend is even more striking – a full 6 of the top 10 follow-up queries are either electronics retailers (\"bestbuy\") or Apple competitors (\"sony\"). Apple Vacations also has a top spot, clearly showing that not everyone searching for \"apple\" is interested in Apple computers.The #15 spot – \"apples\". Yes, some people just want to find an actual apple. This reminds me of the time I searched for Brown's Chicken and the first result was Wikipedia. I didn't want the history of the company, I WANTED SOME ^$%#@ FRIED CHICKEN! Sorry, had to get that off my chest.What Do We Want?Clearly, search intent is a tricky thing, and \"apple\" is a tough search to interpret, but there's a real danger when companies start to tell us what we want based on their own self-interest, and my fear is that the brand update does just that. Given clear data on how much click-through the top 3 results grab, it's obvious that a brand that dominates the top 7 is effectively crowding out not only the competition, but retailers, product reviews, product complaints, etc. This has profound implications for consumer choice and ORM, and it will be interesting to see if this trend continues and spreads into broader queries. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Dear Google: Big Brands Aren't Enough"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Dear Google: Big Brands Aren't Enough"
    },
    {
      "level": "H3",
      "text": "Unraveling Search Intent"
    },
    {
      "level": "H3",
      "text": "Bing Search Funnel"
    },
    {
      "level": "H3",
      "text": "What Do We Want?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}