{
  "url": "https://moz.com/blog/december-mozscape-index-is-live",
  "slug": "december-mozscape-index-is-live",
  "title": "December Mozscape Index is Live! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Happy Holidays!! The December Mozscape index is now live! The latest index has just been released and you will see fresh Mozscape data in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API.",
  "content": "December Mozscape Index is Live! Moz Tools By: Carin Overturf December 21, 2012 Table of Contents Copied! By: Carin Overturf December 21, 2012 December Mozscape Index is Live! Moz Tools Happy Holidays!! The December Mozscape index is now live! The latest index has just been released and you will see fresh Mozscape data in Open Site Explorer, the Mozbar, PRO campaigns, and the Mozscape API. The Big Data team was hoping to provide a special holiday treat launching two indices in one month again, but, unfortunately processing was bitten by a full machine failure. We've had really good luck running Mozscape processing on the larger, high compute AWS machines, but, sadly, just a few days before the index was complete, an entire computing machine failed which forced us to have to re-run a few steps. Even with the failure, the December index is a few days earlier than our scheduled release date on December 27th - a pre-holiday treat for everyone! In even bigger Big Data news - our private cloud is fully up and running in Virginia and we are about 25% done with our first production ready index! If all goes well, we'll be releasing the first Mozscape index created in our own private cloud in mid-January. What a way to bring in the new year! Here are the metrics for this latest index: 78,671,787,078 (78 billion) URLs 687,827,137 (687 million) Subdomains 136,539,340 (136 million) Root Domains 917,094,026,686 (917 billion) Links Followed vs. Nofollowed 2.32% of all links found were nofollowed 56.69% of nofollowed links are internal 43.31% are external Rel Canonical - 14.07% of all pages now employ a rel=canonical tag The average page has 72 links on it 61.38 internal links on average 10.45 external links on average And the following correlations with Google's US search results: Page Authority - 0.36 Domain Authority - 0.19 MozRank - 0.24 Linking Root Domains - 0.30 Total Links - 0.25 External Links - 0.29 The histogram for the freshness of the index's crawl data shows a pretty high volume of fresh crawl data coming from middle of November. This index will have data ranging as old as the end of October, but a large volume of the data was crawled from the middle to end of November. We'll be keeping an eye on things over the holiday, so send us your feedback - we always love to hear your thoughts! And remember, if you're ever curious about when Mozscape is updating, you can check the calendar here. We also maintain a list of previous index updates with metrics here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "December Mozscape Index is Live!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "December Mozscape Index is Live!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carin Overturf\n          \n            Carin Overturf"
}