{
  "url": "https://moz.com/blog/deciding-between-synonymous-keywords",
  "slug": "deciding-between-synonymous-keywords",
  "title": "Deciding Between Synonymous Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The SEOmoz blogs and YOUmoz blogs always provide me with a lot of help and support. So I figured it's my time to give something back. In this post I will take you through the process I went through while doing keyword research. In the post I use the original Dutch keywords, but that shouldn’t be an…",
  "content": "Deciding Between Synonymous Keywords Keyword Research By: Bart van der Meer August 21, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Bart van der Meer August 21, 2012 Deciding Between Synonymous Keywords Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hello SEOmoz community and greetings from the Netherlands! The SEOmoz blogs and YOUmoz blogs always provide me with a lot of help and support. So I figured it's my time to give something back. In this post I will take you through the process I went through while doing keyword research. In the post I use the original Dutch keywords, but that shouldn’t be an issue. Also in the Netherlands Google accounts for 97 - 98 % of all searches on search engines so in the post below I will only focus on Google. The problem is choice A client of mine provides several services and one of his services hadn’t been given any SEO attention so far. So he asked me to help him with it. The service is called betonboren (= concrete drilling). This keyword will be the foundation for further optimization of this service, so it's kind of important. Problem being that the service my client described to me had nine synonymous keywords. The keywords literally mean the same thing, but Google distinguishes them anyway. The keywords: betonboren betonboring betonboringen boren in beton in beton boren beton boringen beton boring boringen in beton beton boren So now what? I couldn’t optimize for all nine words. Two words might be possible. The singular and plural version like betonboring and betonboringen. But definitely not all nine. As Neo adequately put it: The problem is choice. In order to choose, I needed more research. Below are the factors I researched: Meaning of the word Potential organic traffic and competition PPC traffic and costs Current ranking and traffic Related keywords Clients input Meaning of the word There are always words with multiple meanings depending on how you use it. For example if you search for the word jaguar, that can either mean you are looking for the animal or the car (and maybe more things). If a keyword doesn’t have multiple meanings it is potentially worth more, since you know the search is intended for your service. Most keywords didn't have multiple meanings, so that made things a bit easier. The words that did where boren in beton and in beton boren. They both can also be used by a do-it-yourself person who is looking for instructions on how to drill. But we don’t have any drill instructions (yet) on the site. So those searches aren’t relevant and could potentially damage the site as the bounce rate will most likely increase. Also the word beton boren could be a do-it-yourself person who is looking for an actual concrete drill to put in his Black and Decker. Also not very relevant. Potential organic traffic and competition I used Google’s keyword tool to gain insight in the potential traffic and the competitiveness. This would allow me to see what keywords are worth my time. Below is the list it returned. It is set to only select searches performed in the Netherlands. Now this is useful. You can clearly see the words betonboringen and betonboren having a lot more potential traffic than all the other words. 50% more than the number three and over fifteen times the searches of the number nine. And the words beton boringen, beton boring and boringen in beton having very little traffic. You can also see that the competitiveness is normaal (=normal) for the words with a lot of searches, while the words who have less searches have hoog (=high) competitiveness. PPC and costs To estimate the PPC traffic and cost I used Google’s adwords traffic estimator. As you can see the cost ranges between € 0,59 and € 0,84 with an average of € 0,67. You can see that the words beton boringen, betonboring stand out as they are a lot more expensive than average and boringen in beton stands out as the cost is € 0,00. Current ranking and traffic The current ranking and traffic coming in via the selected keywords matters, because….well if you don’t get this part… This is what Google’s webmaster tools and analytics gave me (timeline: one month): Keyword Ranking betonboren 170 betonboring 280 betonboringen 190 boren in beton N/A in beton boren N/A beton boringen N/A beton boring N/A boringen in beton N/A beton boren 6 Wait! What?! The site was already ranking sixth in Google for the keyword Beton boren? Wow, I did not see that coming… Cool… None of the words had generated any organic traffic on their own (some in combination with other words which I will highlight below). Related keywords All the keywords can be combined with other keywords to generate traffic. So I thought it was worth checking this out. The word betonboringen was the only keyword generating traffic. They keyword was being used as a local search word. So by adding either a province or a city they searched and found my clients company. And the traffic that came from those searches converted really well (around 50%). Not something to be taken lightly. Clients input Last but definitely not least I went to my client. I explained the problem and asked him for his input. My client understood the problem, but he couldn’t really help me. He told me that in e-mail or phone conversations he has with his clients, most clients used a few of the mentioned keywords. He went ahead and showed me some e-mail correspondence with his clients. But like he said it didn’t really help. This completed my research for this specific keyword and the foundation of my clients' service. Summarize I left out everything that is average to make the summary cleaner. Keywords betonboren High traffic betonboring betonboringen High traffic High conversion related keywords boren in beton Can have multiple meanings High competition in beton boren Can have multiple meanings High competition beton boringen Low traffic High competition High adwords cost beton boring Low traffic High adwords cost boringen in beton Low traffic High competition Low adwords cost beton boren Can have multiple meanings High competition Sixth in SERP The Choice Seeing the summary the first thing I did was eliminate the words who had nothing going for them: boren in beton in beton boren beton boringen beton boring These words had only negatives. So they were eliminated. Four down, four to go. Now even though the keyword boringen in beton has low adwords costs it’s still not going to make the cut. Low traffic and high competition just doesn’t make sense. You wouldn’t invest in a company located in the desert, surrounded by competitors either just because it can advertise cheap. So now we got four potential good words. The easiest thing seems to be to take on beton boren since it already ranks sixth, maybe try to be creative and also try to boost betonboren since they seem so similar. But I and my client are in here for the long run. So I decided to go for the word betonboringen for a few reasons. The keyword has high traffic, so potentially worth a lot. The competitiveness isn’t high. There is already traffic coming in via this keyword and it seems to be doing well. Hoping that Google will hurry up with their algorithm adjustments and understand that betonboring is just the singular version of this word. So the site will rank high on both words. So what do you guys think? Did I make the right call here? I would love to hear your thoughts… Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Deciding Between Synonymous Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Deciding Between Synonymous Keywords"
    },
    {
      "level": "H1",
      "text": "The problem is choice"
    },
    {
      "level": "H1",
      "text": "Meaning of the word"
    },
    {
      "level": "H1",
      "text": "Potential organic traffic and competition"
    },
    {
      "level": "H1",
      "text": "PPC and costs"
    },
    {
      "level": "H1",
      "text": "Current ranking and traffic"
    },
    {
      "level": "H1",
      "text": "Related keywords"
    },
    {
      "level": "H1",
      "text": "Clients input"
    },
    {
      "level": "H1",
      "text": "Summarize"
    },
    {
      "level": "H1",
      "text": "The Choice"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bart van der Meer\n          \n            Bart van der Meer"
}