{
  "url": "https://moz.com/blog/deciding-where-to-guest-blog",
  "slug": "deciding-where-to-guest-blog",
  "title": "Deciding Where to Guest Blog: A TV Guide Approach - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Guest blogging can be one of the most daunting tasks for both professionals and casual bloggers, alike. You are faced with this unfathomably large sea of information and you are trying to find someone who will accept your little guest post on how to make tastier sugar cookies (or whatever). It…",
  "content": "Deciding Where to Guest Blog: A TV Guide Approach Blogging By: Patrick O'Neill March 14, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Patrick O'Neill March 14, 2013 Deciding Where to Guest Blog: A TV Guide Approach Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Guest blogging can be one of the most daunting tasks for both professionals and casual bloggers, alike. You are faced with this unfathomably large sea of information and you are trying to find someone who will accept your little guest post on how to make tastier sugar cookies (or whatever). It certainly isn’t easy, and it’s going to take a lot of leg work before you start posting material that will generate a following for your own blog. The best thing that you can do – and sometimes, the only thing that you can do – is to try and impress a reputable blog to start building your own credibility as a writer. You can post on your friends’ blogs all day long, but the exposure becomes incestuous and you’re stuck in a stagnant pool of familiar blogs that essentially terminates on itself. If you are interested in growing your blog, and actually getting your writing seen by people, you need to branch out and become more of an online social butterfly. Fortunately for you, many people who own successful blogs and websites have gained their prominence in the blogging community from being social themselves; they will be happy to cooperate with you to generate some unique content for their own site, as well as assist a fellow blogger. Finding a Publisher Understand that just finding a blog that will accept guest posts doesn’t mean that you have necessarily found a publisher – these bloggers haven’t gained their reputation by filling their archives with Internet pabulum for all these years – you’ll need to make sure that your writing is both thematically and technically up to speed with the site that you are interested in. The easiest way to make an impression on a blog owner is by writing about something that allows you to communicate expertise and enthusiasm. With the help of some thorough proofreading you’ll be better-equipped to impress whichever site it is that you’re, well…courting. To get you started, here are five blogs from a reasonably broad spectrum of categories that actively accept guest submissions. To better illustrate what kind of writers they attract I have tagged on a fictional television character who would likely contribute to that website, and what they would be contributing. Try and evaluate which of these align most closely with your interests and your talents, and see if you can’t make a bit of a splash with their followers. 1. SelfGrowth.com: If you’re interested in anything from alternative medicine to motivational prose, SelfGrowth has the audience for you. The site is comprised almost strictly of guest-generated content and offers a pretty positive community that’s interested in what you have to say. Granted, there are hundreds of different categories that you can submit to, but for the most part they all have to do with self-improvement and “being the best you that you can be” (not a quote from the website, but you understand what I mean). It’s actually pretty easy to get your article posted, so if you just need a little ego boost by seeing your blog up somewhere other than your own URL, SelfGrowth might be a good place to start. Who should publish here? Someone who considers themselves remotely spiritual, but can engender an authentic motivational voice. Which fictional character would publish here? Coach Eric Taylor. What would he/she post? Clear Eyes, Full Hearts: The Story of How You Can’t Win Them All 2. ArtofManliness.com: Recently, this has become one of my favorite blogs to keep up with. ArtOfManliness rejects the current trend of flimsy, bloated machismo and seeks to reacquaint its readers with the long lost practices of chivalry and noble masculinity. Don’t worry, the site isn’t meant to perpetuate any kind of offensive patriarchic ideals, it’s more of a guide to positive living that’s directed toward men and (thankfully) void of any talk about improving your sex performance. ArtOfManliness frequently muses on finance, exercise, DIY projects and personal viewpoints on male maturity. The site’s editors also pride themselves on robust citation from credible sources, so be sure to sufficiently support whatever it is you’re writing about. Who should publish here? Real men hoping to impart some of their time-earned wisdom. Which fictional character would publish here? Ron Swanson. Duh. What would he/she post? 1 Way(s) to Steak. 3. YourTango.com: If you are the kind of person who has had a Cosmo subscription for almost a decade (I know there are a bunch of you who do), then YourTango is probably going to be a place where you can try and entertain your fantasies of being one of Cosmo’s regular contributors. YourTango is pretty much about what you’d expect: Love, Dating, Relationships and Sex. Understand, I am not saying this to try and mitigate the website's repution – it is apparently a highly successful blog where people can share supportive advice and racy details about maintaining a healthy relationship with a significant other. Many of the contributors are even physicians, so there is some serious information to be learned from the YourTango community. To be sure, anything that you contribute has to somehow be related to a relationship or a past sexual experience, so don’t be surprised when your DIY article about making your own body glitter gets rejected. Who should publish here? Like I said – people who read Cosmo. Which fictional character would publish here? Carrie Bradshaw. Hello Lover. What would he/she post? \"And Suddenly, I Realized\": 11,345 Ways to Know that You’ve Been With Too Many Guys 4. Visual.ly: This is kind of a deviation from the other entries, considering that this website isn’t actually a (traditional) blog. Visual.ly is a site that allows you to make quality infographics with a very user-friendly interface. Infographics can be a great way to add some visual stimulation to the monolithic wall of text that is your blog and the infographics that you’ll find on Visual.ly are pretty attractive, to say the least. The reason why this site makes it on the list, however, is because everything that you make can be shared on the site’s home page, giving you an opportunity to have your material shared straight from the site. Bottom line, this site allows you to make content that is hyper-sharable. Who should publish here? Users who consider themselves creative, but aren’t particularly adept with Photoshop. Which fictional character would publish here? Hannah Horvath. She doesn’t know Photoshop. What would he/she post? Infographic: The Inverse Relationship Between Romper-Wearing and Employment. 5. Lifehack.org: In a digital vein similar to that of SelfGrowth, Lifehack is about ways that you can actually explore different activities and diversify your interests. This is good news for bloggers, because Lifehack’s category, so-to-speak, allows for a pretty wide range of material to be published. Are you a musician? Give some practical ways that someone can become more musically literate. Are you a cook? Talk about some cheap ways to find great grub. Are you a thinker? Give the Lifehack community a bit of philosophy that it can chew on for the rest of the day. The Lifehack editors seem to appreciate material that is legitimately intended to help others, so if your writing is considered helpful and your enthusiasm seems genuine, you might be able to reach a few people with your content. Who should publish here? A positive person with an unconventional “How To”. Which fictional character would publish here? Jack Tripper. RIP. What would he/she post? 2 Ways to Introduce More Hijinks Into Your Life. Conclusion While blogging can be exhausting, and even frustrating at times, it is enormously rewarding to be able to connect with someone who values your writing voice. What is even better is if you can connect with a blogging personalities who have already been deemed authoritative through their sites' popularity and they are willing to recognize your content in their pantheon of valuable internet information. As you start to publish a feature here or an infographic there, you will notice your own site’s reputability and audience slowly increasing until one day a novice writer is begging you to feature him on your blog. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Deciding Where to Guest Blog: A TV Guide Approach"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Deciding Where to Guest Blog: A TV Guide Approach"
    },
    {
      "level": "H3",
      "text": "Finding a Publisher"
    },
    {
      "level": "H3",
      "text": "1. SelfGrowth.com:"
    },
    {
      "level": "H3",
      "text": "2. ArtofManliness.com:"
    },
    {
      "level": "H3",
      "text": "3. YourTango.com:"
    },
    {
      "level": "H3",
      "text": "4. Visual.ly:"
    },
    {
      "level": "H3",
      "text": "5. Lifehack.org:"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick O'Neill\n          \n            Patrick O'Neill\n          \n            Patrick O'Neill"
}