{
  "url": "https://moz.com/blog/define-competitors-step-4-of-the-8step-seo-strategy",
  "slug": "define-competitors-step-4-of-the-8step-seo-strategy",
  "title": "Define Competitors: Step 4 of the 8-Step SEO Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Congratulations on making it halfway through building this SEO Strategy document with me!  Do you feel your value as an SEO rising?\nIf you’re jumping into the 8 Step SEO Strategy here in Step 4, or just need a recap, you can find the previous three steps here:\n\n    Step 1: ...",
  "content": "Define Competitors: Step 4 of the 8-Step SEO Strategy Online Advertising L By: Laura Lippay May 12, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! L By: Laura Lippay May 12, 2010 Define Competitors: Step 4 of the 8-Step SEO Strategy Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Congratulations on making it halfway through building this SEO Strategy document with me! Do you feel your value as an SEO rising? If you’re jumping into the 8 Step SEO Strategy here in Step 4, or just need a recap, you can find the previous three steps here: Step 1: Define Your Target Audience and Their Needs Step 2: Categorized Keyword Research: Step 2 of the 8-Step SEO Research Strategy Step 3: Finding Gaps and Opportunities: Step 3 of the 8-Step SEO Strategy DEFINING CATEGORY COMPETITORS Step 4 is a simple one where we’ll be defining our competitors in SERPs for use in dissection in the Step 5. We’ll only be looking at search engine competitors here, and not comScore, Hitwise or other types of industry-defined competition by Uniques or Page Views, or any other metric. For the SEO Strategy we’re building here, we’re concerned with Search, therefore we’ll stick to competitors in search results only. I can already hear you saying – this is easy – just do a search for your keywords and see who shows up. True. That’s part of it. But because we’re going to do some serious dissection in Step 5, we’ll want to make sure we get the right competitors to dissect and compare ourselves against. We broke our keyword research out into categories in Step 2, so we’ll want to define competitors for each category (or pick just a few important categories – especially if you're working on large enterprise-sized sites). What I mean when I mention defining competitors by categories is this: If I am working on a site all about celebrities, my competitors might be OMG, TMZ, Perez Hilton, etc. But that’s only at the high level. My keyword categories from step 2 might cover subtopics like celebrity photos, celebrity news and more. Each of those subtopics has someone who is dominating those rankings. It may be the same one or two sites across the board, but it’s likely that each subtopic will have different high-ranking competitors. We want to know specifically who’s doing well for each topic. HOW TO FIND YOUR COMPETITORS There are several ways you can do this. If you’ve already got a method you like and want to stick with – by all means do (and if you’re compelled to share your method with us in the comments – you know we love to hear it). I’m going to give you an example of how I pull this data together. Here’s how I set it up: Grab a new Excel worksheet and name it something like ‘Competitors’. Create one tab to keep track of your overall site competitors, and if you’re tracking any subtopics on your site (likely the keyword categories we defined in step 2), create a tab for each one of those that you’re going to do competitive research for. We’re not going to do any calculations or fancy stuff with this worksheet – it’s just for keeping track of your competitors in one place. You can use a Word doc or good ol’ pen and paper if you want too. The easy way to figure out who your competitors are is to type a couple of terms into the search box and see who shows up. So let’s look at that method. Here’s what I see in the top 5 results for [celebrity gossip]. Take note in your Excel sheet of who’s appearing in the top rankings for a couple of terms for each tab/topic. You don’t have to look up the competitors for every term in your keyword group, just pick a few and make note of what comes up. You can also choose to check the top rankings in all three search engines, or just pick one. It’s up to you. In the end you’ll be looking for which site(s) show up the most often for this keyword group. Another method of doing this is to use SEOmoz’s Keyword Difficulty Tool. The cool thing about the Difficulty Tool is that you get extra insights along with your top competitors. But for this example I just want to get my top-ranked competitors in a downloadable csv file that I’ll just copy and paste into my Excel sheet. To get this info, type in one of your terms: Below the difficulty score and authority comparison graph are the top-ranked results... ...and at the bottom of the page you can export the results. I’ll do the same thing for a few more terms that represent the topic I’m researching, and add the results all to the tab for the topic. In the end I have something that looks like this – here’s my general terms (there’s only two for this example, but the more terms you can use the better idea you’ll get of who shows up in the rankings the most): I’ve highlighted the sites that show up in the top 5 rankings for both terms and made a note of it on the top. This is a competitor I know I want to target. Here’s another example of one of my subcategories: Here I see two sites appearing for multiple keywords. I’ve highlighted them and made note of them at the top. These are competitors I’ll be targeting for my competitive dissection of sites for the Celebrity News subtopic in Step 5. Again, there’s only 3 terms in the screenshot example above – I recommend pulling the data for at least 5-10 per topic. Note that you can also choose to target 2 competitors or 5 competitors for each category – whatever you prefer (I usually like to do at least 3). The more sites you choose the more work you have to do in Step 5, but the more insight you’ll get back. That’s the jist of it folks. Now you have targeted competitors defined for each topic you’re interested in. In the next post we’ll look at how to dig into the competitive landscape to uncover site features, content, and SEO strategy that should be built into your site in order to outrank your competitors. This is where we really start to take SEO to another level. In the meantime, if you use any of the vast selection of SEO tools out there to define your competitors, or just do it in a different way, please share with the readers in the comments! Go to any of the 8 steps: Step 1: Define Your Target Audience and Their Needs Step 2: Categorized Keyword Research Step 3: Finding Gaps and Opportunities Step 4: Define Competitors Step 5: Spying On (and Learning From) Your Competitors Step 6: Customized SEO Strategy & Recommendations Step 7: Must-have SEO Recommendations Step 8: Prioritize and Summarize Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Define Competitors: Step 4 of the 8-Step SEO Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Define Competitors: Step 4 of the 8-Step SEO Strategy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Laura Lippay\n          \n            Laura Lippay\n          \n            Laura Lippay"
}