{
  "url": "https://moz.com/blog/definitive-guide-to-qualifying-a-link-prospect-video",
  "slug": "definitive-guide-to-qualifying-a-link-prospect-video",
  "title": "The Definitive Guide to Qualifying a Link Prospect [with Video] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A step-by-step guide to qualifying link prospects and bucketing them to improve efficiency and workflow.",
  "content": "The Definitive Guide to Qualifying a Link Prospect [with Video] Link Building By: Adria Saracino June 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adria Saracino June 3, 2012 The Definitive Guide to Qualifying a Link Prospect [with Video] Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link builders should look at a website differently than other people. However, through my years of training new link builders, I found that most struggle with this. If they are new, they have trouble letting go of their \"consumer lenses,\" taking everything at face value and evaluating a site by arbitrary trustworthiness cues. If it's SEO Consultants trying to do some link building, they are often looking at the architecture and diving deeply into site metrics. Link builders, on the other hand, should be looking for cues that make a website a good potential partner. They look at metrics like a SEO, but also less tangible cues like engagement and trustworthiness. I thought I'd share the work I'd already done through years of training and create the definitive guide to qualifying a potential link partner. Hopefully it can be used as both a refresher and a tool for training new hires. What Am I Talking About Here I think it's easiest to start with what I'm not talking about. I'm not going through the prospecting process - there are many a guide for that. I'm also not talking about sweet new hacks to scale this through the use of apps, spreadsheets, APIs, etc., though there are some pretty sweet ideas out there and I am all for speeding up the process. While I think efficiency is incredibly important, I think everyone needs to know how to do this stuff manually in order to truly understand how to evaluate a website. What I am talking about is what to do with a list of prospects once you've found them; the steps to take when you click on the first possible site and need to determine whether or not you will contact them. Going after every site willy nilly with an equal amount of effort is going to be a serious waste of time and resources. Here's a road map of where I'll be going with this article to help you improve efficiency: Link building metrics Less tangible metrics Bucketing qualified prospects Improving efficiency + a VIDEO DEMO Link Building Metrics Will this link pass value, and if so, how much? That's the question we're really trying to figure out with link building metrics. And let's be real, there are A LOT of different metrics that could make a data junkie OD. So how do you filter out the noise? This is one of the main stumbling blocks for new or occasional link builders. Just the other day during our #AskDistilled video series, the very first question I came across was, \"What metrics do you look at to validate potential link partners?\" While all this data is well and fun, it won't make you a great link builder if you spend all day analyzing it. Great link builder = being able to get shit done. If you really want to stand out you need to know how to scale, not spend 10 hours getting one link. So really, there are only a very few metrics I'd say you need to look at to determine if a prospect is worth going after. This is probably the #1 metric I look at because it will help me determine a prospective site's value for all types of projects. If I'm asking for a guest post or promoting an infographic, the new page this piece of content will be put on won't have metrics like page authority and # of linking root domains. But it will have domain authority. Yes, there are other nifty metrics like domain MozRank and domain MozTrust, but to get a quick impression of the site's value directly on the SEOmoz toolbar, this is my go to metric. Obviously the higher the better, but if it's higher on a site I don't recognize I'll evaluate it against other less tangible metrics (below) to determine the accuracy of this. This is one of the best-correlated Moz metrics because SEOmoz's analysis shows that ULD is well correlated with rankings, so you want to look at this. Ideally, the site will have a good amount of ULDs to both the page in question and domain. You can get a general sense of how popular that page/domain is to external websites, and more ULDs could mean more. If the number is high, upon first look it may be safe to say that the DA and PA metrics are statistically significant, and thus more likely to stay consistent (if in doubt, I'll look at the backlink profile to see if these ULDs are manipulated). What do I mean by this? If there are only a few ULDs, and 50% of them decide to remove the link, those metrics could drastically change over time. I glance at this when I'm on the home page, but overall I'll ignore this if promoting something for placement on, say, a blog post, since it will be a new page without any PA value yet. For static pages, I'll be really excited if this is a high number and has a good number of ULDs. Also, it's important to note that if I am doing outreach for placement on a subdomain – such as blog.DOMAIN.com, NAME.blogspot.com, NAME.wordpress.com, and so forth - I will look at the subdomain's PA, since the DA will be pretty irrelevant for these types of targets. By this, I mean link attributes like nofollowed vs. followed. I make sure that all of the nofollowed links are highlighted in the browser I'm using, by doing this on my SEOmoz toolbar: That way I can spot if all the links on the page are nofollowed. If so, I walk, as the chances of convincing someone to do otherwise are slim. Plus, I think it gets a bit too shady talking about that kind of stuff with potential partners – especially when it is very easy to avoid it otherwise. As I'm scrolling down the page, I always hover over the links and look at the URL in the bottom left of the browser (clicking through wastes time) to see 1) if the links are to external sites and 2) if so, are they clean URLs or are they redirected or have parameters attached to them (i.e. something that looks like this: http://www.domain.com/landing-page?affid=johndoe&sid=campaign1). Ideally, I'd like clean links in order to get the most out of that site's passable link juice. If I really want to know, I'll look at the \"Page Attributes\" tab in the SEOmoz toolbar, but oftentimes I just do a quick visual skim to see how many links are on the page, looking for blog rolls or excessive lists of links on sidebars. The more links, the more any link juice on that page is going to be split among all of them (regardless if they are followed or nofollowed). Thus, I want pages that have less links. However, a lot of links isn't necessarily a deal breaker, depending on the project goals. What those links say and what they are directing to come into play at that point, which moves us into the less tangible metrics (more below). Those are pretty much the only hard metrics I look at when qualifying a potential link partner. There are other useful ones, like comparing PageRank vs MozRank to check if the site has been penalized (if PR is a lot lower than mR, this could be a sign of a problem). You can also compare MozRank to MozTrust, to see if the site chases PR (though know why PR isn't a great metric for qualifying a site). Depending on the circumstances and my gut feeling, I'll start playing around with other metrics if needed, such as viewing the site code for potential iframes (which, when links reside in them, don't pass value), checking the HTTP status code of specific pages, and using OSE to decipher its top pages or analyze its backlinks. However, like I said, you do not want to waste a ton of time evaluating a site the first time around, only to be ignored when you reach out, or worse, realize you were targeting the completely wrong niche in the first place. Save that type of effort for high value prospects. Less Tangible Metrics Will this site owner work with me, and if so, what would be the best-case scenario? Some of the tangible metrics above will help answer this question, but there are other less tangible hints that an epic link builder will learn to pick up on. Here are the ones I find the most important, all of which can really tell you a lot about the site. This will be the first thing you notice, before you even click through to the site. Get in the habit of looking at URLs and what they tell you. First, does the domain name tell you what the site is about or is it a brand name? Is it highly optimized? Is it so optimized that it doesn't even make sense? There is a difference between www.lawyers.com and www.injury-lawyers-malpractice-law.com. When dealing with highly optimized sites, be on the lookout for ranking manipulation. I also look at the rest of the URL to see what else it says about the site. If it has any /index.html’s or /p=?’s, I may be dealing with a website that isn't completely SEO savvy, which could be great for outreach purposes. I also, do a quick check to see if the site is canonicalized. If it isn't, it might again mean the site isn't on the top of its architectural game (though note, some big brands have scary URL structure, so this isn't an end-all-be-all metric). This is important for sites that produce consistent content, like blogs or publications. If I notice that the most recent post was six months ago, it most likely means the site was neglected and I can cross it off my list. I think I can count on one hand the number of times I've tried reaching out to a dead site and heard back with a, \"Sure, your content is so good it took me out of my writing slump, thanks!\" Pro Tip: If you notice a lot of linking root domains to that page, save it for a backlink analysis later. Reach out to the sites linking to that page and tell them they are linking to a dead site, but you have another resource they might be interested in linking to instead :) Again, this is for projects targeting articles and blog posts. Get in the habit of looking for bylines. First, are there any? If so, are they made up of names or generic terms like \"staff?\" Is it consistently the same name(s)? If yes, then you know whom to contact about editorial content. Also, if the articles are all hosted on the main page (aka not cut short with a more tag), as you scroll down the page look to see if there are bios. If so, these might very well be contributor pieces. If they are, it is very likely this site will work with you. These are really important to answering the \"what would be the best-case scenario\" question. The best-case scenario would be that the website would cover your piece and not only give you a link, but also leverage its community to push your content viral. These types of sites are what I like to call \"influencers\" and they can really help scale your link building efforts by helping your content essentially generate its own links simply by being put in front of the right eyeballs. So how do you know if you're looking at an influencer site? Look for clues that show the site has an engaged audience. These include things like: Number of comments Number of social shares Number of RSS feed and newsletter subscribers Number of social media followers People might ask why I say these are intangible. Well, unless you look at those comments or followers, you don't really know if they are real. Was the subscriber list scraped? Does the site owner accept spam comments? So I bucket this in the intangibles because prospecting isn't about sitting around all day analyzing the nitty gritty, but rather seeing the big picture. Another important part to answering the \"will they link to me\" question is determining if your company or the content you are pitching is relevant to the content the site hosts. Notice that I don’t look at a site’s content until later. This is because you could come across a site with amazing content, but if it has absolutely no valuable metrics you might not want to target it right away. Looking at the content does not mean you need to spend a ton of time reading the website. Rather try: Reading titles – article titles can tell you not only what the content is about, but the \"voice\" of the website (are they news headlines or are they bold statements with sometimes vulgar language?). Using the search feature – If I'm really unsure or think it's a stretch, I'll do a quick keyword search across the site to see if there is any reference to the topic. If so, this gives me great positioning power when contacting them because it lets them know that I know they cover this type of content. About page – If I am still in doubt, I'll take a quick gander at the site's about page to figure out the mission statement and see if my content fits. But really, this is a last resort and if I have to work this hard to make it work, I need to determine if it's worth the effort. Get in the habit of quickly glancing at navigation and footer links for clues like \"contributors,\" \"write for us,\" or \"guest posts.\" If they have a page dedicated to getting content already, boom, there is my in for contacting them. Also, while you're busy browsing links, look for any red flag keywords that look like sponsored links with questionable anchor text (loans, Viagra, poker, etc.). These aren't generally desirable, so if it's bad enough I'll walk away. After looking at all of these metrics, I usually have a pretty good gut feeling of whether or not I should trust this site. If I'm still not sure and the site is of particular high value, I might use an outbound link checker to see if it's linking to any questionable sites. I may also look at its backlink profile to see if the majority of links coming in are from directories or pages titled \"Free Link Exchange.\" Note, design can be somewhat arbitrary of a spam test because, in my experience, there are a lot of websites out there run by old men just doing it for fun, so they use templates to get some visibility in the online world. So don't always judge a book by its cover. If you're still stumped, here are some questions to ask yourself: Taking a cue from Panda, would I trust giving my credit card information to this site? Does this site offer good content? Is it of value to visitors? What percentage of its site is taken up by AdSense or external links? Does the content look like unique content, or is the site a syndication farm that scrapes articles from around the Internet? What types of content/links are on this site? Are there red flag keywords? Are the external links related to the site content? Does the content seem suspiciously optimized? Is the site transparent? Is there an about or contact section? Transparency is a huge one for me. When there is no contact information and no about section, it can mean the site owner doesn’t really care about offering good content and connecting with readers, but rather is using this site for SEO or advertising purposes. I do want to note that a lot of AdSense and external links aren’t necessarily bad. It is only a piece of the puzzle. I think the content and types of external links are more important, but sometimes a lot of AdSense can be an obvious indicator that a site owner is trying to drive traffic to the site in order to make money from click throughs. Bucketing Qualified Prospects As you're going through your prospects, you'll start making a long list of sites to contact. How do you prioritize these? If you think you don't need to, you are wrong. Bucketing your prospects is really important so you can determine how long you should spend on trying to convert them and in which order you should reach out. Not all prospects are created equally so you should not be treating them the same. You don't need to be really formal about this, bucketing them into separate lists or labeling them obsessively. But you definitely can if it helps. I've found that I have a pretty good memory and just know with a few quick sorts in Excel, but if this isn't you find a system of organization that works best for you. Here are the variables I tend to use for determining buckets: DA Influencer status Potential difficulty of getting a link Past relationship? First access play? That's pretty much it. All of the other metrics told me that the site was worth being on the list, but these are the ones needed to organize them. These are the buckets I use and what defines them (I know, ingenious titles): High Value Sites with a high DA (anywhere from 65+ depending on the project), extreme influencer power (will help my content go viral), and likely difficult to get a link on. Why the last metric? Because sites that are high enough value are worth the chase, and this metric will help determine how long you should wait before letting go. Medium Value Sites with a DA around 50 – 65, has some influencer status (might get a handful of comments and shares), and probably reasonably easy to get a link. Low Value DA below 45, barely any influencer status, easy to get a link on – probably has cues like \"write for us\" on site. So what do I do with these buckets? I prioritize using the last two metrics from the above list that I didn't mention yet. First access play helps figure out when to contact a prospect, and this is reserved for high value contacts. Why would you give a site with mediocre metrics first access to something? This is oftentimes effective on journalists, who are always hungry to break a story. The past relationship point also helps determine when you will contact a prospect. I usually give my existing contacts the courtesy of first dibs once a piece goes live not only out of respect, but also because the turnaround time will probably be quick and allow me to start raking in the wins. Plus, these contact attempts will be easiest because you don't need to butter them up, so get these out of the way. So what order do I do outreach in once I have my prospects in buckets? Why the back and forth? Because I never do outreach in a linear fashion. You could reach out to all your prospects in a particular bucket only to find out your contact approach was a fail. Link builders need to think on their feet and do some informal A/B testing to figure out what will work, because you can never 100% guarantee what responses will be like for outreach. So my advice would be not to put all your eggs in one basket, but do outreach in chunks and adjust if the approach doesn't work. Improving Efficiency This was a long article. I know. But just because it was long does not mean this process needs to take forever – but it will at first. Every new link builder gets caught up qualifying sites, and they will keep doing it until they gain the confidence to breeze through it. This comes with practice, so whether you are new yourself or hiring, please keep this in mind and adjust your expectations accordingly. Practice of course will improve speed. When looking at a site for all of the above metrics and clues, I take a minute or less. The only time it takes longer is when I am looking for a high value target's contact details. The qualifying process – being able to say \"yes\" or \"no\" to adding them to your list – should become second nature to you; so much that you no longer look at websites the same ever again, even as a consumer. To review, let me give you a quick video of what I look at when I am qualifying a potential prospect, putting all of these metrics into practice. My advice for becoming a speedier and more efficient link builder in general is: Be hyper organized – whether you use a tool like Buzzstream or spreadsheets, you need to stay on top of your game and be detailed so you don't have to keep going back to the site to remember why you put it on your list in the first place. You should be able to put it on your list and not have to go back to the website when you contact them. Here is an example of the information I collect about websites while prospecting. I developed it with my old boss at eLocal.com and it has been the most effective organization I've used so far: You'll see I have a dropdown list in place to explain the relationship stage. I color code these so when I have a long list and sort them, I can quickly browse. Flag date refers to the next time I want to remember to contact them. Notes is where I like to keep detailed information so I do not have to go back to the site before contacting. Have an efficient workflow – I prospect, outreach, repeat in chunks. I rarely do all my prospecting and then all my outreach because you could be targeting a niche that will fail or burn yourself out. Similarly, I don't prospect one site, contact it, prospect, repeat. Reaching out one by one is difficult to scale and speed through, so focus on one task and ship it, rather than waffling back and forth. After qualifying your prospects, you're ready to craft a pitch and contact the appropriate person for each site. Hopefully this will help qualifying become second nature, allowing you to speed through the process and focus on what really matters – building relationships and getting conversions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Definitive Guide to Qualifying a Link Prospect [with Video]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Definitive Guide to Qualifying a Link Prospect [with Video]"
    },
    {
      "level": "H2",
      "text": "What Am I Talking About Here"
    },
    {
      "level": "H2",
      "text": "Link Building Metrics"
    },
    {
      "level": "H2",
      "text": "Less Tangible Metrics"
    },
    {
      "level": "H2",
      "text": "Bucketing Qualified Prospects"
    },
    {
      "level": "H2",
      "text": "Improving Efficiency"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adria Saracino\n          \n            Adria Saracino\n          \n            Adria Saracino"
}