{
  "url": "https://moz.com/blog/degreed-vs-nondegreed-professionals-in-the-marketing-space",
  "slug": "degreed-vs-nondegreed-professionals-in-the-marketing-space",
  "title": "Degreed vs. Non-Degreed Professionals in the Marketing Space - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight, I got to meet one of my all-time SEO heroes for the first time in person - Ammon Johns. Living up to his mystical reputation, he instantly gave me some advice for the SEOmoz website that I think will serve quite well for the future. He also regaled me with some hilarious stories, some deep…",
  "content": "Degreed vs. Non-Degreed Professionals in the Marketing Space Public Relations By: Rand Fishkin May 31, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 31, 2006 Degreed vs. Non-Degreed Professionals in the Marketing Space Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight, I got to meet one of my all-time SEO heroes for the first time in person - Ammon Johns. Living up to his mystical reputation, he instantly gave me some advice for the SEOmoz website that I think will serve quite well for the future. He also regaled me with some hilarious stories, some deep insight into the SEO field (and why SEO isn't really what it should be called at all) and, uncharacteristically, we got into a bit of an argument over dinner (Ammon, myself and Elisabeth Osmeloski's fiance, Matthew) over the value of a college degree. In certain fields - medicine, engineering, the physical sciences and law - I cannot argue against the idea that a degree is absolutely essential. However, Ammon and I both agreed that, outside of these and a few other rigidly regimented fields, the degree's value in the working world is more of a formality than a true marker of a quality individual. In higher learning, it's often the reputation and \"brand name\" of the professor(s) you study under that determine your \"value\" on the street, regardless of the true quality of education received. However, with undergraduate degrees, Ammon and I could not agree on the question - given all else was equal, would you (as a search marketing consultantcy) hire a new employee with a degree in marketing, or one who had not completed a degree. My answer was always to take the non-degreed candidate and Ammon had a strong preference the other way. Rand's Reasons: A degreed professional often has to be \"un-trained\" as the usual collegiate degree is virtually useless in the search field, and the marketing drivel spouted by professors 10, 20 or more years out of the profession is often worse than nothing at all. Degreed candidates, in my experience, will often feel that the world \"owes\" them more than the boot-strapper who hasn't been through University (thankfully, this doesn't apply to any of SEOmoz's staff, who are remarkably humble, but they're the exceptions, IMO). Degreed candidates are more expensive to start - if all else really is \"equal,\" why pay more for a piece of paper? Taking a chance on someone who doesn't quite fit the mold is my cup of tea - I'd rather take a few bets, lose a few times, and occassionally be rewarded with something (or, in this case, someone) truly spectacular than take the road more traveled. Ammon's Reasons (from memory, so hopefully he'll post if he had more): A degree shows a dedication to stick to something and follow-through, even if the experience was hard work or under-appreciated. A degree carries weight outside the search industry that may come in handy in the future, even if it doesn't appear so now. Degrees can include an educational background in the fundamentals of statistical analysis and marketing that aren't often found outside the academic world (great for analyzing data and grasping the concepts of a marketing strategy). School creates a social environment that is often mimicked in the workplace. To be completely truthful and honest, I bring a massive amount of personal baggage and emotion to this issue, so it's very hard for me to be objective. My own experiences in business school with professors, students and, later graduates who have come in for interviews or sent resumes was exceptionally dissapointing. What's your view? Should SEO firms be hiring college grads with business and marketing degrees, or should they take a chance on the self-taught? p.s. If you do decide to go (back) to school, check out ThatAdamGuy's checklist for making a decision (had loads of fun kicking it with him tonight, too). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Degreed vs. Non-Degreed Professionals in the Marketing Space"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Degreed vs. Non-Degreed Professionals in the Marketing Space"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}