{
  "url": "https://moz.com/blog/delivering-json-recommendations",
  "slug": "delivering-json-recommendations",
  "title": "How to Deliver JSON-LD Recommendations the Easy Way - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When you work with large clients whose sites comprise thousands (or hundreds of thousands) of pages, it's a daunting task to add the necessary markup. In today's Whiteboard Friday, we welcome Sergey Stefoglo to share his framework for delivering JSON-LD recommendations in a structured and…",
  "content": "How to Deliver JSON-LD Recommendations the Easy Way Technical SEO | Whiteboard Friday | E-Commerce SEO By: Serge Stefoglo June 28, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Serge Stefoglo June 28, 2019 How to Deliver JSON-LD Recommendations the Easy Way Technical SEO | Whiteboard Friday | E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When you work with large clients whose sites comprise thousands (or hundreds of thousands) of pages, it's a daunting task to add the necessary markup. In today's Whiteboard Friday, we welcome Sergey Stefoglo to share his framework for delivering JSON-LD recommendations in a structured and straightforward way. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hello, Moz fans. My name is Serge. I'm a consultant at Distilled, and this is another edition of Whiteboard Friday. Today I want to take the next few minutes to talk to you about one of my processes for delivering JSON-LD recommendations. Now it's worth noting upfront that at Distilled we work with a lot of large clients that have a lot of pages on their website, thousands, hundreds of thousands of pages. So if you work at an agency that works with local businesses or smaller clients, this process may be a bit overkill, but I hope you find some use in it regardless. So as I mentioned, oftentimes at Distilled we get clients that have hundreds and thousands of pages on their site, and you can imagine if your point of contact comes to you and essentially asks, \"Hey, we don't have any markup on our site. Can you recommend all of the JSON-LD on all the pages, please?\" If you're anything like me, that could be a bit daunting, right, like that's a big ask. Your wheels start spinning so to speak, and oftentimes that leads to a little bit of unproductivity. So I hope this process kind of helps get you unstuck and get started and get to work. Step 1: List out all the page templates The first step in this process essentially is to list out all of the templates on the site. I'm assuming you're going to be dealing with an e-commerce site or something like that. That's really the way that you're going to break down this problem and take it from kind of a larger picture, where someone comes to you and says, \"Hey, I need all of the things on all of the things,\" and you break it down and say, \"Okay, well, really what I need to focus on is a section at a time, and what I need to do is give recommendations for each section at a time.\" To me, that's a much more kind of organized way to come at this, and it's helped me a lot. So when you list out the templates, if you've had this client for a while, you probably already know the templates that they have. If they're new, it's worth getting familiar with their site and thinking about things at a template level regardless. So just simply hopping on the site, browsing around, and making a list of, yes, they have product pages and category pages and some different variations of those. They have blog pages and a bunch of other kinds of pages. It's good to be familiar with them. Our goal is to essentially recommend JSON-LD for each of those templates. So that's really the first step is getting clear on which templates we're looking at and what exists on the site. Step 2: Choose one template and note what can be marked up The second step is to choose one of those templates, just one, for example, like the product page template, and essentially go through that page and jot down anything you think that can be marked up. Now if you've recommended schema before or if you've worked with JSON-LD or any kind of markup, you'll be familiar with a lot of the kind of standards across the board, and it does get familiar over time. So once you do this your 2nd time or 3rd time or 10th time, you'll have a good idea of what kind of markup goes on a product page or what kind of markup goes on a category page. If it's your first time, just go on the page and I'd encourage you to just browse through and look at schema.org or some other example sites that are similar, see what they're doing, and kind of jot down by yourself, in a notebook or something, what you think can be marked up. So on a product page, you can note down that, yes, there's an image of the product. There's a price. There's a URL. There are breadcrumbs on the page. There are reviews, etc. You're just going through and kind of making a list of that very simply. Step 3: Convert notes into JSON-LD, validate with the schema testing tool, and paste into doc The next step is to essentially take those notes and convert them into JSON-LD. At this point, people tend to kind of freak out a little bit, but you don't have to be a developer to do this. It's very accessible. If this is your first time going about it, I'm not going to get into all of the specifics on how to do that. This is more of a framework of approaching that. But there are a lot of great articles that I can link to. Just reach out to me and I can hook you up with that. JSON-LD in Real Life: Understanding and Implementing Structured DataThe Beginner’s Guide to Structured Data for SEO: How to Implement ItA Guide to JSON-LD for BeginnersAn SEO’s Guide to Writing Structured Data (JSON-LD)Understand how structured data works7 Tips for Structured Data on E-commerce Sites But the third step, again, is to convert those notes into actual JSON-LD. That process is fairly straightforward. What I like to do is open up the page or a representative URL from that template that I'm working on. So for a product page, open that up in my browser. I would like to have schema.org open. That's kind of the canonical resource for schema information. Then I also like to have a few competitor sites open that are similar. If you're working on an e-commerce brand, you're fortunate that there are a lot of great examples of sites that are doing this well, and that's publicly available to you and you can check out what they're doing and how they're doing it. So my process is kind of just going through that list, going on schema.org or going on a competitor's site or a previous site you've worked on. If you're looking at something like, let's say, the cost of the product, you can look that up on schema.org. You can see that there's an Offer-type markup. You can copy that into the schema testing tool and essentially validate that it works. Once you validate it, you just go down the list further. If you start off with the price, you can move on to breadcrumbs, etc. At the end of step three, you essentially have all of the JSON-LD that you need and certainly the core elements to kind of start down the next step. Step 4: Check with your point-of-contact/developer! The next step is to pause and check in with your point of contact, because if you're working on a large-scale site and you're going to have 10 or 15 of these templates you're working on for JSON-LD, it's worthwhile to essentially say, \"Hey, can we do a 30-minute check-in because I'm done with the first template and I want to make sure that this all makes sense and this is in a format that's going to be good for you?\" Speaking of format, what I like to do personally is just use Google Drive, set up a folder in the client folder and title it JSON-LD, give the client access to that, and within that folder you're just going to have a bunch of different documents, and each document is going to be per template. So for the product page example, you would have a document in that folder titled \"Product JSON-LD,\" and you would copy any of the JSON-LD that you validated in the schema testing tool and paste it in that doc. That's what you would be walking through with your point of contact or with the developer. Pretty much take any feedback they have. If they want it in a different format, take that into account and revise it and meet with them again. But pretty much get a green light before moving forward to work on the other templates. Step 5: Repeat from Step 2 onward for all your templates That's really the next step is, at that point, once you have the green light and the developer feels good about it or your point of contact feels good about it, you're just going to kind of rinse and repeat. So you're going to go back to Step 2, and you're going to choose another template. If you've done the product page one, hop over to the category page template and do the same thing. Jot down what can be marked up. Transfer those notes into JSON-LD using competitor sites or similar sites, using schema.org, and using the structured data validating tool. It's the same process. At that point, you're just kind of on cruise control. It's nice because it takes, again, something that initially could have been fairly stressful, at least for me, and it breaks it down in a way that makes sense and you can focus because of that. So again, this process has worked really well for me. At Distilled, we like to think about kind of frameworks and how to approach bigger problems like this and break them down and kind of make them more simple, because we've found that allows us to do our best work. This is just one of those processes. So that's all I have for you all today. Thank you so much for tuning in. If you have any questions or comments, or if you have any experiences kind of implementing or recommending JSON-LD, I'd love to hear them. So give me a shout on Twitter or in the comments or anything like that. Thank you so much for tuning in, and we will see you next time. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Deliver JSON-LD Recommendations the Easy Way"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Deliver JSON-LD Recommendations the Easy Way"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Step 1: List out all the page templates"
    },
    {
      "level": "H2",
      "text": "Step 2: Choose one template and note what can be marked up"
    },
    {
      "level": "H2",
      "text": "Step 3: Convert notes into JSON-LD, validate with the schema testing tool, and paste into doc"
    },
    {
      "level": "H2",
      "text": "Step 4: Check with your point-of-contact/developer!"
    },
    {
      "level": "H2",
      "text": "Step 5: Repeat from Step 2 onward for all your templates"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Serge Stefoglo\n          \n            Serge Stefoglo\n          \n            Serge Stefoglo"
}