{
  "url": "https://moz.com/blog/delicious-cloaking-to-combat-spam",
  "slug": "delicious-cloaking-to-combat-spam",
  "title": "Del.icio.us Cloaking to Combat Spam - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Everyone's favorite social bookmarking site: Del.icio.us, appears to be rendering different content to the search engines than to its users. Every page on del.icio.us appears to have a the following directive in place: This should t...",
  "content": "Del.icio.us Cloaking to Combat Spam Online Advertising O By: Oatmeal September 29, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal September 29, 2006 Del.icio.us Cloaking to Combat Spam Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Everyone's favorite social bookmarking site: Del.icio.us, appears to be rendering different content to the search engines than to its users. Every page on del.icio.us appears to have a the following directive in place: <meta name=\"robots\" content=\"noarchive,nofollow,noindex\"/>This should technically remove all of their pages from Google's index. Performing a site:del.ico.us command at google, however, returns several million pages. I checked Google's cache and didn't see a meta noindex tag. Examining robots.txt reveals the same thing: a standard user agent renders \"disallow /,\" but a GoogleBot user agent does not.They also nofollow all the outbound links on their site, but the nofollow attributes don't appear to be cloaked (so del.icio.us won't pass any link value). My guess is that this is a method of combatting spam. They're probably hoping that having the meta tag will deter potential spammers from saturating their site with crap. It might also weed out robots that are scouring the web for valuable places to inject spammy links. It doesn't seem like a particularly effective tactic, but I suppose every little bit helps.Thanks to Emil Stenström for pointing this out. Apparently this was covered on SEO Speedwagon in August, but I hadn't heard menton of it until now. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Del.icio.us Cloaking to Combat Spam"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Del.icio.us Cloaking to Combat Spam"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}