{
  "url": "https://moz.com/blog/delicious-and-digg",
  "slug": "delicious-and-digg",
  "title": "Delicious and Digg - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Although I rarely point to TW, as everyone here has already read their posts twice, there's an excellent comment on the thread about Digg that I felt worth publicizing. It comes from John Resig, who writes:\n\nThe two 'Web 2.0' traffic b...",
  "content": "Delicious and Digg Link Building By: Rand Fishkin November 8, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 8, 2005 Delicious and Digg Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Although I rarely point to TW, as everyone here has already read their posts twice, there's an excellent comment on the thread about Digg that I felt worth publicizing. It comes from John Resig, who writes: The two 'Web 2.0' traffic builders are, imo, Digg and Delicious (getting on to del.icio.us/popular). I've had pages make it on to both the main page of Digg (getting very similar results to lorenbaker) and onto del.icio.us/popular.... 1) I post a link2) People who read the tag pages of del.icio.us, or other people, see my link and link to it.3) Enough people link to it to get it on to the popular page.4) TONS of people read the popular in their feed readers.5) Go back to number 2 But here is where it gets different:- A lot of people dump their del.icio.us links, every night, to their web log - this means that you get a lot of link backs to your site. So you PR goes up, your Technorati rank goes up, your PubSub rank, etc. etc. (plus giving you even more traffic) The Digg effect is cool, but nothing can match the 'splash benefits' of del.icio.us. As a concept, these traffic sending systems are fantastic, and relatively stable, as the value is built through the links people build after the fact - meaning there's (somewhat) less incentive to game. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Delicious and Digg"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Delicious and Digg"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}