{
  "url": "https://moz.com/blog/desktop-mobile-voice",
  "slug": "desktop-mobile-voice",
  "title": "Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Since more searchers are home and not on-the-go, we're left wondering where to focus our optimization efforts. Is desktop the most important? Is mobile? What about the voice phenomenon that's now become part of our day-to-day lives? As with most things, the most important factor is to consider your…",
  "content": "Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday Whiteboard Friday | Search Engines By: Dr. Peter J. Meyers August 14, 2020 Table of Contents Copied! By: Dr. Peter J. Meyers August 14, 2020 Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday Whiteboard Friday | Search Engines Needless to say, we're facing more and more complexity in our everyday work, and the answers to our questions are about as clear as mud. In the wake of the 2018 mobile-first index, and since more searchers are home and not on-the-go, we're left wondering where to focus our optimization efforts. Is desktop the most important? Is mobile? What about the voice phenomenon that's now become part of our day-to-day lives? As with most things, the most important factor is to consider your audience. People aren't siloed to a single device — your optimization strategy shouldn't be, either. In this informative Whiteboard Friday, Dr. Pete soothes our fears about a multi-platform world and highlights the necessity of optimizing for a journey rather than a touchpoint. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, everybody. It's Dr. Pete here from Moz. I am the Marketing Scientist here, and I flew in from Chicago just for you fine people to talk about something that I think is worrying us a little bit, especially with the rollout of the mobile index recently, and that is the question of: Should we be optimizing for desktop, for mobile, or for voice? I think the answer is (d) All of the above. I know that might sound a little scary, and you're wondering how you do any of these. So I want to talk to you about some of what's going on, some of our misconceptions around mobile and voice, and some of the ways that maybe this is a little easier than you think, at least to get started. The mistakes we make So, first of all, I think we make a couple of mistakes. When we're talking about mobile for the last few years, we tend to go in and we look at our analytics and we do this. These are made up. The green numbers are made up or the blue ones. We say, \"Okay, about 90% of my traffic is coming from desktop, about 10% is coming from mobile, and nothing is coming from voice. So I'm just going to keep focusing on desktop and not worry about these other two experiences, and I'll be fine.\" There are two problems with this: Self-fulfilling prophecy One is that these numbers are kind of a self-fulfilling prophecy. They might not be coming to your mobile site. You might not be getting those mobile visitors because your mobile experience is terrible. People come to it and it's lousy, and they don't come back. In the case of voice, we might just not be getting that data yet. We have very little data. So this isn't telling us anything. All this may be telling us is that we're doing a really bad job on mobile and people have given up. We've seen that with Moz in the past. We didn't adopt to mobile as fast as maybe we should have. We saw that in the numbers, and we argued about it because we said, \"You know what? This doesn't really tell us what the opportunity is or what our customers or users want. It's just telling us what we're doing well or badly right now, and it becomes a self-fulfilling prophecy.\" Audiences The other mistake I think we make is the idea that these are three separate audiences. There are people who come to our site on desktop, people who come to our site on mobile, people who come to our site on voice, and these are three distinct groups of people. I think that's incredibly wrong, and that leads to some very bad ideas and some bad tactical decisions and some bad choices. So I want to share a couple of stats. There was a study Google did called The Multiscreen World, and this was almost six years ago, 2012. They found six years ago that 65% of searchers started a search on their smartphones. Two-thirds of searchers started on smartphones six years ago. Sixty percent of those searches were continued on a desktop or laptop. Again, this has been six years, so we know the adoption rate of mobile has increased. So these are not people who only use desktop or who only use mobile. These are people on a journey of search that move between devices, and I think in the real world it looks more something like this right now. Another stat from the series was that 88% of people said that they used their smartphone and their TV at the same time. This isn't shocking to you. You sit in front of the TV with your phone and you sit in front of the TV with your laptop. You might sit in front of the TV with a smartwatch. These devices are being used at the same time, and we're doing more searches and we're using more devices. So one of these things isn't replacing the other. The cross-device journey So a journey could look something like this. You're watching TV. You see an ad and you hear about something. You see a video you like. You go to your phone while you're watching it, and you do a search on that to get more information. Then later on, you go to your laptop and you do a bit of research, and you want that bigger screen to see what's going on. Then at the office the next day, you're like, \"Oh, I'll pull up that bookmark. I wanted to check something on my desktop where I have more bandwidth or something.\" You're like, \"Oh, maybe I better not buy that at work. I don't want to get in trouble. So I'm going to home and go back to my laptop and make that purchase.\" So this purchase and this transaction, this is one visitor on this chain, and I think we do this a lot right now, and that's only going to increase, where we operate between devices and this journey happens across devices. So the challenge I would make to you is if you're looking at this and you're saying, \"Only so many percent of our users are on mobile. Our mobile experience doesn't matter that much. It's not that important. We can just live with the desktop people. That's enough. We'll make enough money.\" If they're really on this journey and they're not segmented like this, and this chain, you break it, what happens? You lose that person completely, and that was a person who also used desktop. So that person might be someone who you bucketed in your 90%, but they never really got to the device of choice and they never got to the transaction, because by having a lousy mobile experience, you've broken the chain. So I want you to be aware of that, that this is the cross-device journey and not these segmented ideas. Future touchpoints This is going to get worse. This is going to get scarier for us. So look at the future. We're going to be sitting in our car and we're going to be listening — I still listen to CDs in the car, I know it's kind of sad — but you're going to be listening to satellite radio or your Wi-Fi or whatever you have coming in, and let's say you hear a podcast or you hear an author and you go, \"Oh, that person sounds interesting. I want to learn more about them.\" You tell your smartwatch, \"Save this search. Tell me something about this author. Give me their books.\" Then you go home and you go on Google Home and you pull up that search, and it says, \"Oh, you know what? I've got a video. I can't play that because obviously I'm a voice search device, but I can send that to Chromecast on your TV.\" So you send that to your TV, and you watch that. While you're watching the TV, you've got your phone out and you're saying, \"Oh, I'd kind of like to buy that.\" You go to Amazon and you make that transaction. So it took this entire chain of devices. Again now, what about the voice part of this chain? That might not seem important to you right now, but if you break the chain there, this whole transaction is gone. So I think the danger is by neglecting pieces of this and not seeing that this is a journey that happens across devices, we're potentially putting ourselves at much higher risk than we think. On the plus side I also want to look at sort of the positive side of this. All of these devices are touchpoints in the journey, and they give us credibility. We found something interesting at Moz a few years ago, which was that our sale as a SaaS product on average took about three touchpoints. People didn't just hit the Moz homepage, do a free trial, and then buy it. They might see a Whiteboard Friday. They might read our Beginner's Guide. They might go to the blog. They might participate in the community. If they hit us with three touchpoints, they were much more likely to convert. So I think the great thing about this journey is that if you're on all these touchpoints, even though to you that might seem like one search, it lends you credibility. You were there when they ran the search on that device. You were there when they tried to repeat that search on voice. The information was in that video. You're there on that mobile search. You're there on that desktop search. The more times they see you in that chain, the more that you seem like a credible source. So I think this can actually be good for us. The SEO challenge So I think the challenge is, \"Well, I can't go out and hire a voice team and a mobile team and do a design for all of these things. I don't want to build a voice app. I don't have the budget. I don't have the buy-in.\" That's fine.One thing I think is really great right now and that we're encouraging people to experiment with, we've talked a lot about featured snippets. We've talked about these answer boxes that give you an organic result. One of the things Google is trying to do with this is they realize that they need to use their same core engine, their same core competency across all devices. So the engine that powers search, they want that to run on a TV. They want that to run on a laptop, on a desktop, on a phone, on a watch, on Goggle Home. They don't want to write algorithms for all of these things. So Google thinks of their entire world in terms of cards. You may not see that on desktop, but everything on desktop is a card. This answer box is a card. That's more obvious. It's got that outline. Every organic result, every ad, every knowledge panel, every news story is a card. What that allows Google to do, and will allow them to do going forward, is to mix and match and put as many pieces of information as it makes sense for any given device. So for desktop, that might be a whole bunch. For mobile, that's going to be a vertical column. It might be less. But for a watch or a Google Glass, or whatever comes after that, or voice, you're probably only going to get one card. But one great thing right now, from an SEO perspective, is these featured snippets, these questions and answers, they fit on that big screen. We call it result number zero on desktop because you've got that box, and you've got a bunch of stuff underneath it. But that box is very prominent. On mobile, that same question and answer take up a lot more screen space. So they're still a SERP, but that's very dominant, and then there's some stuff underneath. On voice, that same question and answer pairing is all you get, and we're seeing that a lot of the answers on voice, unless they're specialty like recipes or weather or things like that, have this question and answer format, and those are also being driven by featured snippets. So the good news I think, and will hopefully stay good news going forward, is that because Google wants all these devices to run off that same core engine, the things you do to rank well for desktop and to be useful for desktop users are also going to help you rank on mobile. They're going to help you rank on voice, and they're going to help you rank across all these devices. So I want you to be aware of this. I want you to try and not to break that chain. But I think the things we're already good at will actually help us going forward in the future, and I'd highly encourage you to experiment with featured snippets to see how questions and answers appear on mobile and to see how they appear on Google Home, and to know that there's going to be an evolution where all of these devices benefit somewhat from the kind of optimization techniques that we're already good at hopefully. Encourage the journey chain So I also want to say that when you optimize for answers, the best answers leave searchers wanting more. So what you want to do is actually encourage this chain, encourage people to do more research, give them rich content, give them the kinds of things that draw them back to your site, that build credibility, because this chain is actually good news for us in a way. This can help us make a purchase. If we're credible on these devices, if we have a decent mobile experience, if we come up on voice, that's going to help us really kind of build our brand and be a positive thing for us if we work on it. So I'd like you to tell me, what are your fears right now? I think we're a little scared of the mobile index. What are you worried about with voice? What are you worried about with IoT? Are you concerned that we're going to have to rank on our refrigerators, and what does that mean? So it's getting into science fiction territory, but I'd love to talk about it more. I will see you in the comment section. Video transcription by Speechpad.com To help us serve you better, please consider taking the 2020 Moz Blog Reader Survey, which asks about who you are, what challenges you face, and what you'd like to see more of on the Moz Blog. Take the Survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The mistakes we make"
    },
    {
      "level": "H3",
      "text": "Self-fulfilling prophecy"
    },
    {
      "level": "H3",
      "text": "Audiences"
    },
    {
      "level": "H2",
      "text": "The cross-device journey"
    },
    {
      "level": "H2",
      "text": "Future touchpoints"
    },
    {
      "level": "H3",
      "text": "On the plus side"
    },
    {
      "level": "H2",
      "text": "The SEO challenge"
    },
    {
      "level": "H2",
      "text": "Encourage the journey chain"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}