{
  "url": "https://moz.com/blog/determining-keyword-value-a-recipe-for-prioritizing-page-optimizations",
  "slug": "determining-keyword-value-a-recipe-for-prioritizing-page-optimizations",
  "title": "Determining Keyword Value: A Recipe for Prioritizing Page Optimizations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "E-commerce search engine optimization is quite possibly the most tedious and time-consuming type of SEO. An e-commerce web site can have hundreds of categories and thousands of product pages, all waiting to be optimized, haunting your every moment.The amount of work on an e-commerce site can be so…",
  "content": "Determining Keyword Value: A Recipe for Prioritizing Page Optimizations Keyword Research N By: nunoandrade October 7, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: nunoandrade October 7, 2009 Determining Keyword Value: A Recipe for Prioritizing Page Optimizations Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. E-commerce search engine optimization is quite possibly the most tedious and time-consuming type of SEO. An e-commerce web site can have hundreds of categories and thousands of product pages, all waiting to be optimized, haunting your every moment. The amount of work on an e-commerce site can be so daunting it can sometimes be difficult to even know where to start. If it's a brand new site, chances are you will prioritize your optimizations based on the search volume of each page's targeted keyword. But what if it's not a brand new site? I came across that very problem on a furniture retailing site I recently worked on. I could have optimized high-volume keyword pages first but that didn't make sense. Some of the site's pages already ranked well for lower searched but relatively strong keywords. It simply made more sense to attack the low-hanging fruit first and start getting the most immediate traffic to the site. But what was that magic balance between search volume and ranking? My Approach To determine that balance, I took each possible search engine ranking from 1-200 and assigned it an inverse, exponential value from 1-10, 10 being the highest. For example, if a targeted term ranked #2, it had a value of 10. If it had a rank of 3, it received a score of 9.5 (a factor of 0.95). A rank of 4 gave it a score of 9.025. So if keyword X ranks #29, it receives a score of roughly 2.5. Let's say keyword X gets 386 daily searches. To get the Value of that term, simply multiply the score by the daily searches (2.5 X 386). That being said, here is your recipe. The Ingredients Google Analytics Google SpreadSheets or Microsoft Excel Rank checking tool (SEOBook.com's Rank Checker Firefox plugin will do just fine, although it has a limitation of 100 keywords) Wordtracker The Instructions Determine the top 1,000 keyword traffic sources from Google Analytics. To do so, first grab the top keywords over a six-month span and then the top over the past week (to make sure you don't miss any recent high-traffic terms). Combine them in Excel and delete duplicates. Grab the first 100 and put them into Rank Checker. In the settings, choose the engine that gets you the most traffic. ;) Export the results as CSV. Repeat until you've completed the keywords list. Combine the exported files into one. Import the keywords list into a Wordtracker bucket and get the number of searches per keyword. Save the tab delimited document and open in Excel. From the rankings Excel document, do a vLookUp (instructions here) to pull the number of daily searches from the Wordtracker export. In another column (call it \"Value\"), multiply the Wordtracker searches by the value you assigned to the position for which that term ranks. Phew. You're all done. If this sounds complicated, it really isn't. I have created a Google Spreadsheets template doc here in case you need some help. The value field will be populated if you enter the keyword rank and daily searches. Keep in mind that I haven't even included keyword conversion rates in the process. Imagine how valuable that could be? Which YOUmozzer is up to the task? If you build off of this spreadsheet, please post a link to it in the comments below. Good luck! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Determining Keyword Value: A Recipe for Prioritizing Page Optimizations"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Determining Keyword Value: A Recipe for Prioritizing Page Optimizations"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "nunoandrade\n          \n            nunoandrade"
}