{
  "url": "https://moz.com/blog/diagrams-for-solving-crawl-priority-indexation-issues",
  "slug": "diagrams-for-solving-crawl-priority-indexation-issues",
  "title": "Diagrams for Solving Crawl Priority & Indexation Issues - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday night I stayed up way too late authoring a post on Google's Indexation Cap. Today, despite getting up way too early, I wanted to follow up and answer some of the questions from the comments, Twitter and my email. I think SEOs who read the post rightly asked for more direction in solving…",
  "content": "Diagrams for Solving Crawl Priority & Indexation Issues Technical SEO By: Rand Fishkin December 2, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 2, 2009 Diagrams for Solving Crawl Priority & Indexation Issues Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday night I stayed up way too late authoring a post on Google's Indexation Cap. Today, despite getting up way too early, I wanted to follow up and answer some of the questions from the comments, Twitter and my email. I think SEOs who read the post rightly asked for more direction in solving this problem - a fair request. Below, I've done my best to tackle these problems visually, as I believe we all think about site architecture and crawling issues in a visual structure. First off, here's a sample site hierarchy to set down the concept and give the colors I'm using in the following diagrams more context: Next, I've illustrated in a more representative fashion, how those hierarchies might look on a website, and noted the external link potential of each: In this next piece, I'm trying to explain a very important concept and something that's frequently misunderstood by SEOs. Once upon a time, search spiders would crawl the web largely recursively - hitting a homepage that had been submitted to its index (remember way back when search engines had submission?!), then crawling in an outward fashion based on the links they discovered there. That hasn't been the case for a long time, and as we all see with crawl paths (if you're looking at the requests Google/Yahoo!/Bing make to your domain), multiple entry points are nearly universal and crawling pushes \"outward\" from those priority URLs. It looks a bit like Minesweeper, right? :-) Finally, I've got a graphic to help understand how to positively approach these problems and solve them. There are certainly more recommendations that can be provided around these issues, and I look forward to a discussion of them in the comments. p.s. I covered site architecture and navigation in a good bit of detail at the PRO Training this summer, but I like this image format so much, I think I might re-craft something new for next year. It feels like structuring sites properly is still a big pain point for SEOs (but possibly that's less to do with lack of knowledge and more to do with lack of influence during the design phase?) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Diagrams for Solving Crawl Priority & Indexation Issues"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Diagrams for Solving Crawl Priority & Indexation Issues"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}