{
  "url": "https://moz.com/blog/did-search-engines-ever-use-keyword-density",
  "slug": "did-search-engines-ever-use-keyword-density",
  "title": "Did Search Engines Ever Use Keyword Density - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While looking around for some tokenization databases to help me build a term weight analysis tool, I came across a Microsoft article from January of 1997 on the subject of text analysis. This paper discusses some of the elements used in text processing, topic detection and classification and…",
  "content": "Did Search Engines Ever Use Keyword Density Search Engines By: Rand Fishkin July 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 14, 2005 Did Search Engines Ever Use Keyword Density Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While looking around for some tokenization databases to help me build a term weight analysis tool, I came across a Microsoft article from January of 1997 on the subject of text analysis. This paper discusses some of the elements used in text processing, topic detection and classification and clearly shows that in 1997, search engines weren't used keyword density anymore than they are today. Since there had been some debate on this subject, I started a thread on the subject over at SEOChat. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Did Search Engines Ever Use Keyword Density"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Did Search Engines Ever Use Keyword Density"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}