{
  "url": "https://moz.com/blog/die-diggbar-die-die-should-you-kill-the-digg-bar-on-your-website",
  "slug": "die-diggbar-die-die-should-you-kill-the-digg-bar-on-your-website",
  "title": "Die Digg-Bar Die, Die! (or Should You Kill the Digg Bar on Your Website) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You'll have noticed that Digg has recently added the Digg-bar as a central feature, if not the main feature of their social media website. TechCrunch's discussion has a good range of comments from all sides. Having read a few such discussions, used Digg and developed a frames jail-break plugin to…",
  "content": "Die Digg-Bar Die, Die! (or Should You Kill the Digg Bar on Your Website) Social Media By: pbhj April 15, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: pbhj April 15, 2009 Die Digg-Bar Die, Die! (or Should You Kill the Digg Bar on Your Website) Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. You'll have noticed that Digg has recently added the Digg-bar as a central feature, if not the main feature of their social media website. TechCrunch's discussion has a good range of comments from all sides. Having read a few such discussions, used Digg and developed a frames jail-break plugin to release my pages from Digg's grip, I thought my first YOUmoz post was due with my reflections on the use and abuse, hits and misses of the Digg-bar. Here I'm going to look at: what the Digg-bar is and how it works benefits of keeping the digg bar unfavourable features how to remove the Digg-bar from appearing on your website other considerations Digg-bar: What it is and how it works The Digg bar is at once a URL shortener (like tinyurl.com, bit.ly or ow.ly, for example), a \"Digg this\" recommendation tool, a form of content suggestion service (like stumbleupon), and crucially for Digg a means to keep user on their website and serve adverts to them, no matter how far they stray from Digg and the stories Digg directly links to. Technologically, Digg-bar is a small outer-page that house an IFRAME \"jail\" into which all content linked from Digg is sent. Javascript is used to allow the Digg-bar to remain relatively small (46px high) in standard mode and then expand-on-click (325px) for user interaction. Digg-bar is fixed to the top of the browser window as you can see in the screenshots. Content is linked with a shortened URL, e.g., http://digg.com/d1o9FP is a link to a BBC article about a meteorite. The parent frame has a meta description and title formed from the Digg submission's description and title. Note that the outer frame cannot, by design, access your child frame to follow where you go. It can (at your request) load other links into the \"jail.\" This means that the Digg-bar remains at the original Digg story until you use the Digg-bar itself to navigate elsewhere. Benefits The Digg-bar is actually quite useful from a user's perspective. It offers a quick way to move around Digg viewing stories, allows pages to be seen alongside comment threads (as comments are one of the services that use the expanded bar), and provides related information about the subject matter you are viewing. It also offers quick links (that open new browser windows) for Facebook and Twitter so you can share easily with friends. You can even do URL shortening just by adding Digg.com/ in front of any web address (try it!). If you don't like the bar, you can hide it with a single click. Hovering over some of the Digg-bar links (e.g., bury) gives a medium (88px) height bar. Hovering over the close link (X, top-right) gives a drop-down link that then shows the \"Always hide the toolbar\" link - this is available in your settings on Digg too and actually removes the bar completely rather than \"hiding\" it. What's not to like! From an SEO/SEM perspective, the benefit of the Digg-bar comes in users being able to more easily digg your pages up through a familiar interface. Users are spending more time on Digg, so there's more chance that well promoted content on Digg will attract eyeballs. There may even be some blackhat benefits for building up trust on your spammy pages. Unfavourable features Well. From a user perspective, you're losing a reasonable piece of real estate from the top of your browser and quite a lot of control of where you surf to (though many won't notice that) -- it's akin to the forceable insertion of a toolbar. The URL shortening service relies on Digg's servers, so when Digg is slow your experience will be degraded too. Other than that, it's mainly win for the user. Content providers should be up in arms. When frames first became popular, there was quickly a moral refactoring that showed (including in the courts; see, for example, this page discussing a number of the more prominent cases, or a more US centric page) that linking someone else's content in a way that presented it as originating from your own website was contrary to good order (copyright, trademarks, etc.). Digg is branding all web content they link to as their own, not only with the Digg logo, but also with a Digg \"<abbr title=\"Uniform Resource Locator; i.e., the address from your browser's address bar\">URL</abbr>\". Digg is also applying advertising to your content in the most prominent position. Lastly, what specifically are the SEO issues (and I'm sure I've missed a deal that you'll all fry me for)? Well, Digg is no longer passing users on to your content in its native form; they're being presented with a different URL. They will link to Digg's rendering of your content, with their ads, their follow-on content, their recommendations, and perhaps crucially what amounts to a great big exit sign front-and-centre above your content. As for link juice? It's not your content that's being linked any longer, it's Digg's window on your content (what will Google et al do about this?). How to remove the Digg bar You'll want to ask \"Should I?\" first. I can see benefits for those who use Digg regularly to court visitors and, more specifically, those who aren't trying to directly lead people to a sale (brand building, etc.). It's too early to make a quantitative analysis, but if Digg's bar is doing bad things to your / your client's revenue, you can use the same frame jail-breaking javascript as was used back in the day: // when your page loads window.onload = function() { // if the top frame isn't your document if (top.location != location) { // write your documents address as the top (i.e., outer) frames address top.location.href = document.location.href ; } } More on this digg-bar frame breaking code, when and where it works, when you shouldn't use it, and a Wordpress Plugin for it on alicious.com. Other considerations If you're running a site with lots of links out or a URL shortener (Ow.ly at least does this, bit.ly claims the moral high ground and denounce content framing), this is a fantastic way to keep visitors under your control and increase the apparent worth of your site (VC, anyone?) whilst maximising advertising opportunities. You've only got all your visitors to lose! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Die Digg-Bar Die, Die!  (or Should You Kill the Digg Bar on Your Website)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Die Digg-Bar Die, Die!  (or Should You Kill the Digg Bar on Your Website)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "pbhj\n          \n            pbhj"
}