{
  "url": "https://moz.com/blog/differential-diagnosis-a-broken-website-ranking-atop-google",
  "slug": "differential-diagnosis-a-broken-website-ranking-atop-google",
  "title": "Differential Diagnosis: A Broken Website Ranking Atop Google - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As I was stumbling around the web today, building some slides out for my Pubcon sessions next week, I came across some search results I couldn't help but blog about. Have a peek:\n...",
  "content": "Differential Diagnosis: A Broken Website Ranking Atop Google Search Engines By: Rand Fishkin November 8, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 8, 2008 Differential Diagnosis: A Broken Website Ranking Atop Google Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As I was stumbling around the web today, building some slides out for my Pubcon sessions next week, I came across some search results I couldn't help but blog about. Have a peek: Check out that fourth result from hugthecook.com. It's currently down, and has been that way since at least October 20th (when Google's cache shows the \"invalid website\" page). The last date I can confirm it was up and available is January of 2008, when Archive.org shows a functional site. What makes this more perplexing is that page's complete lack of inlinks, according to both Yahoo! and Linkscape. The query \"stand mixer review\" might not be the most competitive phrase, but it's certainly not insignificant either, and there are a lot of what appear to be very competitive and robust sites and pages ranking in positions 5-20. So, in the spirit of my new TV addiction to medical mystery shows, I thought I'd ask you - what's making that URL rank so well at Google? If there's interest, perhaps we can have an ongoing series with more SEO diagnoses in the future :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Differential Diagnosis: A Broken Website Ranking Atop Google"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Differential Diagnosis: A Broken Website Ranking Atop Google"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}