{
  "url": "https://moz.com/blog/differential-diagnosis-2-a-double-mystery",
  "slug": "differential-diagnosis-2-a-double-mystery",
  "title": "Differential Diagnosis #2: A Double Mystery - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been watching a lot more of the Dr. House show, and becoming a bit obsessed with some SEO mysteries of my own. Since our last outing into diagnosis went so well, I thought we'd try again. I haven't got either completely solved, but I feel pretty good about some hypotheses. Let's see how you...",
  "content": "Differential Diagnosis #2: A Double Mystery Technical SEO By: Rand Fishkin December 11, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 11, 2008 Differential Diagnosis #2: A Double Mystery Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been watching a lot more of the Dr. House show, and becoming a bit obsessed with some SEO mysteries of my own. Since our last outing into diagnosis went so well, I thought we'd try again. I haven't got either completely solved, but I feel pretty good about some hypotheses. Let's see how you do: Mystery #1: Google SERPs for Web Crawler Ranking in position #8 is the real estate site \"www.mckinley.com\" with neither the word \"web\" nor \"crawler\" on the page or in the URL. Why is it there? Mystery #2: Google SERPs for 4:20 Don't ask me why I was searching for it, but that 7th result is peculiar. What causes it to rank at Google, but not Live or Yahoo? Looking forward to your analyses in the comments, and yes, if SEO were a class, this would be extra credit. :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Differential Diagnosis #2: A Double Mystery"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Differential Diagnosis #2: A Double Mystery"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}