{
  "url": "https://moz.com/blog/diggs-new-algorithm-is-the-suck",
  "slug": "diggs-new-algorithm-is-the-suck",
  "title": "Digg's New Algorithm is The Suck - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For those of you unfamiliar with the hissy fit going on over at Digg the past couple weeks, I point you to Tamar Weinberg's handy recap. In a nut shell, Kevin Rose (Digg founder who really needs to be featured on this site) announced some algorithm changes o...",
  "content": "Digg's New Algorithm is The Suck Social Media By: Rebecca Kelley February 1, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 1, 2008 Digg's New Algorithm is The Suck Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For those of you unfamiliar with the hissy fit going on over at Digg the past couple weeks, I point you to Tamar Weinberg's handy recap. In a nut shell, Kevin Rose (Digg founder who really needs to be featured on this site) announced some algorithm changes on Digg, top diggers complained and planned a Digg boycott, Kevin and Jay Adelson (CEO of Digg) crappily addressed user complaints in a chat room, the top diggers were all \"omg they acknowledge our existence,\" and all was well. Or not. This new algorithm sucks. Supposedly, the algorithm is supposed to \"get a more diverse number of people to Digg the stories on upcoming.\" It was also supposed to give new diggers or those of us who don't have \"power accounts\" a fighting chance to make it to the home page instead of the almighty, all powerful top diggers who freakin' dominate all the time. (I direct your attention to virtually any instance where some poor unknown sap gets submission blocked by a power digger who gets the exact same story on the home page because he has a legion of die-hard fans following his every move.) The algorithm sounds promising, yet it's supremely lame. What took a digger like Tamar around 100 to 120 diggs to get to the home page (a number that had been steadily climbing the more popular she got) was now taking her well over 200. A less \"powerful\" but still successful (28% popular ratio) digger submitted a story titled \"The 15 Greatest Spaceships of All Time\" (clearly a diggworthy topic, if only for the nerdtastic discussion that will inevitably take place in the comments), and after 24 hours it had over 170 diggs and still hadn't made the home page. The comments made it seem like it wasn't getting hit with too many buries. Currently the post is dead at around 230 diggs, gathering dust and refusing to tip over to the home page. Okay, what about unpopular diggers? Us lowly folks who read and comment but have never been successful in getting stories to the home page? Well, let's take my profile as an example. I've been a member of Digg since March 2006. I'm fairly good at leaving snarky comments that get a lot of thumbs on stories, but I've only submitted 8 stories to Digg, and none of them have hit popular. My best submission was a whopping 25 diggs. Clearly this algorithm change would benefit an Average Joe like me, right? I submitted a picture to Digg earlier this week. I took the photo at a Brooks outlet store I went to over the weekend. Brooks is a running gear store, and they were having a big sale (2 for 1s, 50% off, etc). I saw this \"deal\" for \"runderwear\" (running underwear), laughed like a fool, and snapped a picture with my phone. I talked to some power diggers I know, and they suggested I submit the image to Digg myself because with the new algo change, I actually had a better chance at making the home page with fewer diggs than they would. I wrote up a decent enough title and description, submitted it to \"offbeat sports,\" clearly a less popular category, and waited. It got 72 diggs within 24 hours but didn't get promoted. I didn't game Digg for votes (only 8 people on my friends list dugg the story, and I didn't know most of the other folks), the comments in the thread weren't of the typical \"This is lame, wtf\" caliber, and, looking at my submission history, this story did far better than any story I had ever submitted. You'd think that the new algo would be friendly to a story that received over 70 diggs and was submitted by someone who had submitted less than 10 stories in the past two years, right? Guess not. I don't know if this algo change is supposed to prevent gaming or what, but it really seems to be punishing both the hardcore Digg lovers who made the site into what it is today (e.g., Tamar and other power diggers) and more casual users like myself who see stories hitting the home page with between 30 and 250 diggs and wonder why their submission didn't make it. And honestly, isn't the whole point of having a \"Friends\" feature on Digg is so that your friends can see what you're digging and maybe digg the same story? Why would you then punish submitters and say, \"Well, actually, you need to have more diverse votes.\" I have a tolerate/hate relationship with Digg that has been veering steadily into the \"hate\" column. Unlike many other SEOs, I mostly use Digg as an entertainment medium. We don't have any clients with social media campaigns, and it's been a while since anything on SEOmoz has gained traction on Digg. I smile when I see Arrested Development references in the comments, roll my eyes when I see Family Guy references, and digg every Wednesday's Zero Punctuation review. When this entertainment site (I'll throw some quotation marks around the words news site, since it's kind of like a legit news site's dumber but more popular brother) makes a casual user like myself exasperated with things like B.S. algorithms, inexplicable user bans, spammy Shout features, and other changes of the numbskullery variety, I can only imagine how the top diggers and early adopters feel. A word of advice to Digg (and to anyone with a website, really): don't piss off your users. They are what make your site what it is today. If we were to do something to alienate our community here, you guys would abandon ship and we'd be a nothing site. It doesn't matter if you're an Amazon.com, an SEOmoz, or a simple little knitting forum. Never, ever forget that without your users, your diehard fans, your community members, you are nothing. Listen to your users, roll out features they're clamoring for, make compromises here and there, politely turn down suggestions, do all of these things. Just acknowledge them. Make them understand that they're valued and that you owe your site's success to folks like them. Can you dig(g) it? I hope so. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Digg's New Algorithm is The Suck"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Digg's New Algorithm is The Suck"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}