{
  "url": "https://moz.com/blog/dirty-deeds-done-dirty",
  "slug": "dirty-deeds-done-dirty",
  "title": "Dirty Deeds Done Dirty - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know we don't usually cover news that everyone else has, but I couldn't help spreading the word on this band of snakes. From David Wallace:\n\nThe company in question is Paramount Web Masters (www.paramountwebmasters.com). I'm am not going to link directly to ...",
  "content": "Dirty Deeds Done Dirty Blogging By: Rand Fishkin March 22, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 22, 2006 Dirty Deeds Done Dirty Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I know we don't usually cover news that everyone else has, but I couldn't help spreading the word on this band of snakes. From David Wallace: The company in question is Paramount Web Masters (www.paramountwebmasters.com). I'm am not going to link directly to them as I don't want to give them link credit. The story in short goes like this. A salesperson cold called one of Leann's clients essentially warning them that their site was going to be banned by Google because they were participating in a link farm. Nothing could be further from the truth as Leann’s company only builds sites of the utmost quality and does not participate in any types of schemes or tricks that would get a site banned by Google. This salesperson was obviously using a scare tactic to try to earn Leann's client's business.When her client suggested that the salesperson contact their webmaster (IncreaseRanking), he/she refused stating that they were the culprits endangering their site. The client then comes to find out that it is Paramount Web Masters who can fix the problem. To make a long story short, the client passes on their service, obviously seeing through the salesperson's questionable sales techniques of which they then resort to blackmail stating that he/she will now try to get Leann's client banned from Google because they will not use their services.Excuse me for a minute while I go throw up. Sick, mean and evil. Compared to this company, most black hats are saints. Send out the warning to your fellow small businesspeople. UPDATE: Aaron has an excellent post on the subject of this and other SEO scams and how they affect the industry as a whole (and some good comments about Google's ongoing \"renting links is unethical\" spiel). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Dirty Deeds Done Dirty"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Dirty Deeds Done Dirty"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}