{
  "url": "https://moz.com/blog/distance-from-perfect",
  "slug": "distance-from-perfect",
  "title": "Distance from Perfect - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "All marketing includes some measure of distance from perfect, but no channel is more influenced by it than SEO. Are you moving your site closer to perfect?",
  "content": "Distance from Perfect Marketing Industry | SEO Basics By: Ian Lurie August 4, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ian Lurie August 4, 2015 Distance from Perfect Marketing Industry | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In spite of all the advice, the strategic discussions and the conference talks, we Internet marketers are still algorithmic thinkers. That’s obvious when you think of SEO. Even when we talk about content, we’re algorithmic thinkers. Ask yourself: How many times has a client asked you, “How much content do we need?” How often do you still hear “How unique does this page need to be?” That’s 100% algorithmic thinking: Produce a certain amount of content, move up a certain number of spaces. But you and I know it’s complete bullshit. I’m not suggesting you ignore the algorithm. You should definitely chase it. Understanding a little bit about what goes on in Google’s pointy little head helps. But it’s not enough. A tale of SEO woe that makes you go \"whoa\" I have this friend. He ranked #10 for \"flibbergibbet.\" He wanted to rank #1. He compared his site to the #1 site and realized the #1 site had five hundred blog posts. “That site has five hundred blog posts,” he said, “I must have more.” So he hired a few writers and cranked out five thousand blogs posts that melted Microsoft Word’s grammar check. He didn’t move up in the rankings. I’m shocked. “That guy’s spamming,” he decided, “I’ll just report him to Google and hope for the best.” What happened? Why didn’t adding five thousand blog posts work? It’s pretty obvious: My, uh, friend added nothing but crap content to a site that was already outranked. Bulk is no longer a ranking tactic. Google’s very aware of that tactic. Lots of smart engineers have put time into updates like Panda to compensate. He started like this: And ended up like this: Alright, yeah, I was Mr. Flood The Site With Content, way back in 2003. Don’t judge me, whippersnappers. Reality’s never that obvious. You’re scratching and clawing to move up two spots, you’ve got an overtasked IT team pushing back on changes, and you've got a boss who needs to know the implications of every recommendation. Why fix duplication if rel=canonical can address it? Fixing duplication will take more time and cost more money. It’s easier to paste in one line of code. You and I know it’s better to fix the duplication. But it’s a hard sell. Why deal with 302 versus 404 response codes and home page redirection? The basic user experience remains the same. Again, we just know that a server should return one home page without any redirects and that it should send a ‘not found’ 404 response if a page is missing. If it’s going to take 3 developer hours to reconfigure the server, though, how do we justify it? There’s no flashing sign reading “Your site has a problem!” Why change this thing and not that thing? At the same time, our boss/client sees that the site above theirs has five hundred blog posts and thousands of links from sites selling correspondence MBAs. So they want five thousand blog posts and cheap links as quickly as possible. Cue crazy music. SEO lacks clarity SEO is, in some ways, for the insane. It’s an absurd collection of technical tweaks, content thinking, link building and other little tactics that may or may not work. A novice gets exposed to one piece of crappy information after another, with an occasional bit of useful stuff mixed in. They create sites that repel search engines and piss off users. They get more awful advice. The cycle repeats. Every time it does, best practices get more muddled. SEO lacks clarity. We can’t easily weigh the value of one change or tactic over another. But we can look at our changes and tactics in context. When we examine the potential of several changes or tactics before we flip the switch, we get a closer balance between algorithm-thinking and actual strategy. Distance from perfect brings clarity to tactics and strategy At some point you have to turn that knowledge into practice. You have to take action based on recommendations, your knowledge of SEO, and business considerations. That’s hard when we can’t even agree on subdomains vs. subfolders. I know subfolders work better. Sorry, couldn’t resist. Let the flaming comments commence. To get clarity, take a deep breath and ask yourself: “All other things being equal, will this change, tactic, or strategy move my site closer to perfect than my competitors?” Breaking it down: \"Change, tactic, or strategy\" A change takes an existing component or policy and makes it something else. Replatforming is a massive change. Adding a new page is a smaller one. Adding ALT attributes to your images is another example. Changing the way your shopping cart works is yet another. A tactic is a specific, executable practice. In SEO, that might be fixing broken links, optimizing ALT attributes, optimizing title tags or producing a specific piece of content. A strategy is a broader decision that’ll cause change or drive tactics. A long-term content policy is the easiest example. Shifting away from asynchronous content and moving to server-generated content is another example. \"Perfect\" No one knows exactly what Google considers \"perfect,\" and \"perfect\" can't really exist, but you can bet a perfect web page/site would have all of the following: Completely visible content that’s perfectly relevant to the audience and query A flawless user experience Instant load time Zero duplicate content Every page easily indexed and classified No mistakes, broken links, redirects or anything else generally yucky Zero reported problems or suggestions in each search engines’ webmaster tools, sorry, \"Search Consoles\" Complete authority through immaculate, organically-generated links These 8 categories (and any of the other bazillion that probably exist) give you a way to break down \"perfect\" and help you focus on what’s really going to move you forward. These different areas may involve different facets of your organization. Your IT team can work on load time and creating an error-free front- and back-end. Link building requires the time and effort of content and outreach teams. Tactics for relevant, visible content and current best practices in UX are going to be more involved, requiring research and real study of your audience. What you need and what resources you have are going to impact which tactics are most realistic for you. But there’s a basic rule: If a website would make Googlebot swoon and present zero obstacles to users, it’s close to perfect. \"All other things being equal\" Assume every competing website is optimized exactly as well as yours. Now ask: Will this [tactic, change or strategy] move you closer to perfect? That’s the \"all other things being equal\" rule. And it’s an incredibly powerful rubric for evaluating potential changes before you act. Pretend you’re in a tie with your competitors. Will this one thing be the tiebreaker? Will it put you ahead? Or will it cause you to fall behind? \"Closer to perfect than my competitors\" Perfect is great, but unattainable. What you really need is to be just a little perfect-er. Chasing perfect can be dangerous. Perfect is the enemy of the good (I love that quote. Hated Voltaire. But I love that quote). If you wait for the opportunity/resources to reach perfection, you’ll never do anything. And the only way to reduce distance from perfect is to execute. Instead of aiming for pure perfection, aim for more perfect than your competitors. Beat them feature-by-feature, tactic-by-tactic. Implement strategy that supports long-term superiority. Don’t slack off. But set priorities and measure your effort. If fixing server response codes will take one hour and fixing duplication will take ten, fix the response codes first. Both move you closer to perfect. Fixing response codes may not move the needle as much, but it’s a lot easier to do. Then move on to fixing duplicates. Do the 60% that gets you a 90% improvement. Then move on to the next thing and do it again. When you’re done, get to work on that last 40%. Repeat as necessary. Take advantage of quick wins. That gives you more time to focus on your bigger solutions. Sites that are \"fine\" are pretty far from perfect Google has lots of tweaks, tools and workarounds to help us mitigate sub-optimal sites: Rel=canonical lets us guide Google past duplicate content rather than fix it HTML snapshots let us reveal content that’s delivered using asynchronous content and JavaScript frameworks We can use rel=next and prev to guide search bots through outrageously long pagination tunnels And we can use rel=nofollow to hide spammy links and banners Easy, right? All of these solutions may reduce distance from perfect (the search engines don’t guarantee it). But they don’t reduce it as much as fixing the problems. The next time you set up rel=canonical, ask yourself: “All other things being equal, will using rel=canonical to make up for duplication move my site closer to perfect than my competitors?” Answer: Not if they’re using rel=canonical, too. You’re both using imperfect solutions that force search engines to crawl every page of your site, duplicates included. If you want to pass them on your way to perfect, you need to fix the duplicate content. When you use Angular.js to deliver regular content pages, ask yourself: “All other things being equal, will using HTML snapshots instead of actual, visible content move my site closer to perfect than my competitors?” Answer: No. Just no. Not in your wildest, code-addled dreams. If I’m Google, which site will I prefer? The one that renders for me the same way it renders for users? Or the one that has to deliver two separate versions of every page? When you spill banner ads all over your site, ask yourself… You get the idea. Nofollow is better than follow, but banner pollution is still pretty dang far from perfect. Mitigating SEO issues with search engine-specific tools is \"fine.\" But it’s far, far from perfect. If search engines are forced to choose, they’ll favor the site that just works. Not just SEO By the way, distance from perfect absolutely applies to other channels. I’m focusing on SEO, but think of other Internet marketing disciplines. I hear stuff like “How fast should my site be?” (Faster than it is right now.) Or “I’ve heard you shouldn’t have any content below the fold.” (Maybe in 2001.) Or “I need background video on my home page!” (Why? Do you have a reason?) Or, my favorite: “What’s a good bounce rate?” (Zero is pretty awesome.) And Internet marketing venues are working to measure distance from perfect. Pay-per-click marketing has the quality score: A codified financial reward applied for seeking distance from perfect in as many elements as possible of your advertising program. Social media venues are aggressively building their own forms of graphing, scoring and ranking systems designed to separate the good from the bad. Really, all marketing includes some measure of distance from perfect. But no channel is more influenced by it than SEO. Instead of arguing one rule at a time, ask yourself and your boss or client: Will this move us closer to perfect? Hell, you might even please a customer or two. One last note for all of the SEOs in the crowd. Before you start pointing out edge cases, consider this: We spend our days combing Google for embarrassing rankings issues. Every now and then, we find one, point, and start yelling “SEE! SEE!!!! THE GOOGLES MADE MISTAKES!!!!” Google’s got lots of issues. Screwing up the rankings isn’t one of them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Distance from Perfect"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Distance from Perfect"
    },
    {
      "level": "H2",
      "text": "A tale of SEO woe that makes you go \"whoa\""
    },
    {
      "level": "H2",
      "text": "SEO lacks clarity"
    },
    {
      "level": "H2",
      "text": "Distance from perfect brings clarity to tactics and strategy"
    },
    {
      "level": "H3",
      "text": "\"Change, tactic, or strategy\""
    },
    {
      "level": "H3",
      "text": "\"Perfect\""
    },
    {
      "level": "H3",
      "text": "\"All other things being equal\""
    },
    {
      "level": "H3",
      "text": "\"Closer to perfect than my competitors\""
    },
    {
      "level": "H2",
      "text": "Sites that are \"fine\" are pretty far from perfect"
    },
    {
      "level": "H2",
      "text": "Not just SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ian Lurie\n          \n            Ian Lurie\n          \n            Ian Lurie"
}