{
  "url": "https://moz.com/blog/do-former-search-engine-insiders-make-great-seos",
  "slug": "do-former-search-engine-insiders-make-great-seos",
  "title": "Do Former Search Engine Insiders Make Great SEOs? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You may have noticed recently that there's a trend of folks who leave search engines crafting their own startups. It made me wonder - how are these individuals doing with the SEO on their own sites? Have they engaged a secret formula that the rest of us don't know to achieve incredible results? Or…",
  "content": "Do Former Search Engine Insiders Make Great SEOs? Public Relations By: Rand Fishkin July 26, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 26, 2009 Do Former Search Engine Insiders Make Great SEOs? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You may have noticed recently that there's a trend of folks who leave search engines crafting their own startups. It made me wonder - how are these individuals doing with the SEO on their own sites? Have they engaged a secret formula that the rest of us don't know to achieve incredible results? Or are they languishing in poor accessibility and SEO tactics gone awry? Since many of these individuals are friends and colleagues of mine, I won't pass judgment (and I certainly won't be comprehensive in my SEO reviews - got lots on my plate), but I do want to share them with you and get your opinions & feedback. Eytan Seidman & Oyster.com Eytan worked for Microsoft's Live Search and was often the public face of the search quality team at conferences. You can read an interview with him here re: Live's efforts in the search arena. Clearly, Eytan's a guy who knows search and should get SEO. His new startup, a project with his brother Ellie, focuses on creating the web's most high quality, in-depth hotel reviews. The Good: The reviews themselves are some of the highest quality, most in-depth content I've seen in the travel world, and possibly on the web as a whole. Gorgeous photos with great descriptive text that really takes in the detail - I'm not sure I'd ever even need that much knowledge about a hotel, but I can imagine it's a picky honeymooner's best friend. Internal link structure looks solid, and it appears Google's already grabbed tens of thousands of pages - site:oyster.com Titles are great - hotel name + geography | Oyster Hotel Reviews. It gets all the relevant keywords in nicely without looking spammy. Good breadcrumb navigation that helps with any potential keyword cannibalization (and is helpful for users) Excellent internal linking in content (whenever another hotel/region is referenced, Oyster links to it in context) Ranking #80 for \"Hotel Reviews\" and rising fast :-) Smart, descriptive meta descriptions Good link profile, primarily from press and blog coverage Not afraid to link out to external sites in review (and no nofollows on editorial outbounds, either) Great architecture means that the right pages rank first for the desired query. For example, even though there are lots of pages about \"Fisher Island\" in Miami, the destination guide ranks first (fisher island site:oyster.com). The Bad: Exact match domains are so powerful in the rankings, I'm a bit surprised they went with \"Oyster.com.\" That said, there's never been a truly big success in technology that had an associative name - Microsoft, Sun, Oracle, Google, Yahoo!, Facebook, Twitter, etc. Maybe YouTube would be the closest to a billion+ exit that actually had a somewhat descriptive name. Oddly, the top button links have no anchor text - they're done with CSS, so there's nothing between the <a> tags, e.g. <a href=\"/dominican-republic/hotels/\" id=\"headerDominicanRepublic\" class=\"headerButton\"></a> I'm not 100% sure, but it looks like not all of the gorgeous photos can be indexed based on how they're displayed/linked-to. Google's got a couple hundred in their image search index, so perhaps I'm just missing how they're getting efficiently crawled. Avichal Garg & PrepMe.com Avichal worked in search quality and web spam at Google, so he's got a good idea of what makes sites succeed in the engine. Although not publicly facing, as the CEO and founder of PrepMe, a site that aims to provide online tutoring to kids in high school for test prep and class assistance, he's going to be much more in the limelight (particularly as PrepMe has getting exciting levels of traction). The Good: They're already on page 1 of the results for high demand queries like \"online sat prep,\" \"online act prep\" and \"psat prep courses\" They're employing nofollows on unimportant internal links... (not sure if that's technically good or bad, but I'll bet Avichal knows what he's doing) They've got a great set of long tail content in the PrepMe Answers section - Google appears to be doing lots of indexing of these (155K results) and many of them rank well, too. Titles, URLs, internal link structure, etc. is all very clean and simple (and well-optimized) The Bad: A lot of page have the same title tags - prepme answers - for example It looks like their sitemap file has a limited number of pages listed Not that it's a huge deal, but both prepme.com and www.prepme.com resolve (though they do use absolute URL links to ensure that deep pages aren't being linked to on the non-www version) Jeff Weiner & LinkedIn.com Jeff started at Yahoo!, where he led acquisitions of search technologies from companies like Inktomi, AltaVista & Fast. After a stint as EVP of Yahoo! Networks, he moved to the VC world before taking the lead role at LinkedIn. Jeff's a very smart, talented guy and LinkedIn is clearly benefiting. They were one of the first to adopt Google's rich snippets throughout the site and have fixed a lot of duplicate content/canonicalization issues related to user profiles. The Good: As I mentioned, their use of rich snippets in Google is awesome (note they grey descriptive text in result #7 for \"Rand Fishkin\"). I think they could do even more there (photos especially), but Google may want to keep that only for their own profiles. Strong basics - titles, meta descriptions, page structure and content The use of the member's name throughout the page in headlines, e.g. \"Rand Fishkin's Summary, Rand Fishkin's Experience, etc.\" gets plenty of targeted phrase use without being spammy They allow direct links out, without nofollows - a very, very wise choice and an incentive to maintain updated links in your profile People directory - example \"A\" - these are terrific navigation systems for engines and they do a really solid job of minimizing all other links on these pages Interestingly, like PrepMe, they continue to employ nofollows - I think this is a positive (doesn't waste crawler bandwidth even if it is \"evaporating\" juice), although I'd probably recommend link consolidation even more. Brilliant use of individual name directories, e.g. John Bennett to help searchers find the right person The Bad: They're disallowing a lot of stuff in the robots.txt file that might be earning links (like /search*). As we've noted in the past, blocking pages rather than simply noindexing them, prevents juice from passing. There are lots more that I won't dive into detail on, but could be interesting to review as well. Barnaby Dorfman & Foodista.com Barnaby headed up search at Amazon's A9 (back when they were building their own engine to compete with Google/Yahoo!/etc). He's now the founder and CEO at the Wikipedia of Food - Foodista. Patrick Li & Raptr.com Patrick previously worked on Google's datacenter infrastructure, then on the launch team, where he audited new products/features before they went live. Raptr's online games platform is fairly addicting and they've got some impressive rankings. Bret, Jim, Paul, Sanjeev, Ana, Tudor & Gary at Friendfeed.com A large number of Googlers at this social, real-time startup. Friendfeed clearly wants to capture people search the same way LinkedIn, Twitter & Facebook have, and they're doing a decent job of it. Mark Lucovsky & VMWare.com Former Microsoftee and Googler (where he was an engineering director), Mark's now with VMWare, who still has a way to go before they're in the top 100 for \"cloud computing\" although that's unlikely to be Mark's sphere of influence. Vanessa Fox & JaneandRobot.com Vanessa was the creator of Google's Webmaster Tools platform and her new company, focused on making SEO accessible to developers, has held a number of industry events. Obviously she's kicking butt. :-) Tim Cadogan & OpenX.com Tim was a search executive at Yahoo! before moving on to lead OpenX, an ad-serving platform. There may not be a great need for SEO here, but Tim probably knows some folks who can help if they do want to leverage organic search to drag in more targeted leads. There are many other examples, but I think this is a decent start. If you've got others to share, we'd love to hear about them in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Do Former Search Engine Insiders Make Great SEOs?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Do Former Search Engine Insiders Make Great SEOs?"
    },
    {
      "level": "H2",
      "text": "Eytan Seidman & Oyster.com"
    },
    {
      "level": "H2",
      "text": "Avichal Garg & PrepMe.com"
    },
    {
      "level": "H2",
      "text": "Jeff Weiner & LinkedIn.com"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}