{
  "url": "https://moz.com/blog/do-not-overlook-the-importance-of-the-display-urls-in-ppc-ads",
  "slug": "do-not-overlook-the-importance-of-the-display-urls-in-ppc-ads",
  "title": "Do Not Overlook the Importance of the Display URLs in PPC Ads - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When creating a pay-per-click ad (PPC) ad, it is easy to overlook the importance of the display URL. However, search engine marketers have only a limited number of lines of text to work with and should take maximum advantage of each of them. This article summarizes the results of an eye tracking…",
  "content": "Do Not Overlook the Importance of the Display URLs in PPC Ads Paid Search Marketing (PPC) R By: Randy Pickard March 18, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! R By: Randy Pickard March 18, 2009 Do Not Overlook the Importance of the Display URLs in PPC Ads Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When creating a pay-per-click ad (PPC) ad, it is easy to overlook the importance of the display URL. However, search engine marketers have only a limited number of lines of text to work with and should take maximum advantage of each of them. This article summarizes the results of an eye tracking study and reviews the findings of two other tests of display URLs. The eye tracking study demonstrated that the display URL in PPC ads captures a significant portion of the gaze time allocated to the ads. The results of the other two tests showed that display URLs can have a meaningful impact upon click-thru rates. To gain a better understanding of viewer interaction with display URLs, User Centric, Inc. conducted an eye tracking study measuring the length of time users spend looking at display URLs on Google search engine results pages. Thirty individuals participated in the research, each performing twelve searches using Google.com. The results of the eye tracking study confirmed that the display URL is an important component of a PPC ad. The display URL captured a significant portion of the time people spent looking at each PPC ad, as shown in the tables and heat map below. For PPC ads served above the organic listings on the left side of search engine results pages, the display URL garnered over three times more gaze time (0.53 seconds) than the text description (0.15 s). Further, the display URL in PPC ads in the top position on the page above the organic results received the same amount of gaze time as the headline, 0.65 s. Average gaze time (in seconds) per visit to a Google search results page: The general location of a PPC ad on the page had a significant impact on the gaze activity the URL received. Not surprisingly, the display URLs of the top three ads on the left attracted more attention than the URLs of the top three ads on the right. Display URLs presented on the left received almost three times as much attention (0.53 s per URL) as URLs on the right side of the page (0.19 s per URL). The length of time spent looking at a URL also varied by the specific position of the ad. The URL located within the first ad was looked at the longest while the URL within the third ad was looked at the shortest. This was true for ads on both the left and right sides of the page. Within ads on the left, display URLs received, in general, more attention (0.53 s) than the ad text descriptions (0.15 s) but less than the ad headlines (0.70 s). This is not surprising because in those PPC ads, the display URL is located to the left of the text, directly below the headline, which makes it more prominent than the description text but less prominent than the headline. On the other hand, URLs within ads on the right received less attention (0.19 sec) than both the headlines (0.27 s) and ad text descriptions (0.30 s). The display URLs for ads on the right are the least salient ad elements, as they are presented at the bottom of the PPC ad, below the text description. Heatmap showing aggregated participant gaze activity during one of the twelve searches in the study (the redder the area, the more attention it received): Adding Descriptive Keywords to Display URLs May Reduce Click-Thru’s Understanding that display URLs receive a significant amount of gaze time is not simply a branding issue. The display URL can be altered in attempts to improve results. The most common manner in which this is done is by adding descriptive keywords to the end of the domain name. A Google employee in account management actually encouraged us to test this tactic. In our experience, adding keywords in front of the domain name fails in the majority of cases, particularly for domains that have significant name recognition and brand equity. However, adding keywords at the end of the domain name increases click-thru rates often enough that it is worthwhile to test. Shown below is an example from a test of display URLs. The three ads are identical except for the display URL. The goal of the test was to determine if adding “eye tracking” to the display URL would increase the click-thru rate of a PPC ad promoting User Centric’s eye tracking service. The first ad simply features the domain name as the display URL, the second ad includes the keyword term added to the end of the domain name, and the third ad includes the keyword in front of the domain name. Eye Tracking Research Learn about benefits of measuring gaze activity. View white papers. www.UserCentric.com Eye Tracking Research Learn about benefits of measuring gaze activity. View white papers. www.UserCentric.com/Eye_Tracki... Eye Tracking Research Measure user gaze activity. Get a full analysis, not just heat maps. EyeTracking.UserCentric.com In the test of the above PPC ads, the version featuring only the domain name produced the best results. Adding the keyword “eye tracking” at the end of the domain name in the second ad resulted in about a 5% decrease in click-thru rate, which was not surprising. The most dramatic result of this test was that adding keywords in front of the domain name decreased clicks by over 25%! Not to mention that our ISP charged a fee for an extra top level domain name. Another drawback of adding descriptive keywords to a display URL is that this form of “keyword stuffing” may reduce the branding value of a PPC ad by cluttering up the display of the domain name. Domain Name in Display URL Has a Major Impact on Click-Thru Rate The value of an identifiable domain name in a display URL was highlighted by a test conducted for iNest Realty. Their parent company, RealEstate.com, is a much more recognizable domain name. The test was conducted to determine the impact of using the stronger brand name in the display URL of PPC ads. The test ads are shown below. The only difference between the two PPC ads is the display URL. New Homes & Home Builders Find new homes and home builders 1% cash back buyer rebate program. www.iNest.com New Homes & Home Builders Find new homes and home builders 1% cash back buyer rebate program. www.RealEstate.com Utilizing RealEstate.com in the display URL resulted in a 20% greater click-thru rate for the bottom PPC ad. Based solely on that information, it might appear that the bottom ad was the winner. However, the ad’s conversion rate was abysmal. In order to comply with Google guidelines on display URLs, a landing page had to be created for this ad on the Real Estate.com server. The page was co-branded for both iNest and RealEstate.com. Visitors did not like the experience of clicking on an ad with one display URL and then seeing information about a different brand. Thus, iNest was paying for a 20% increase in clicks, while generating fewer conversions. If the test had not been ended quickly, it would have been an expensive lesson on the importance of providing users with a good experience. However, the test provided a good demonstration of the positive impact a recognizable domain name in the display URL can have upon click-thru rates. Conclusion The results of our eye tracking study and the other two tests show that display URLs are an important component of PPC ads. Modifying display URLs as a test poses a danger of reducing the branding value of a PPC ad by cluttering up the display of the domain name. However, the potential long-term benefit of acting upon a successful test can easily outweigh the short-term cost of a failed one. Thus, for many PPC advertisers, a closely monitored display URL test is likely a worthwhile effort. Links to Additional Information The following web pages provide additional information on display URLs in PPC ads: Everything You Need To Know About AdWords Display URLs Adwords Makes Yet Another Change to Display URL Policy Small Test of Display URLs Do Not Waste PPC Display URLs Information about User Centric’s eye tracking services is available by following these links: Eye Tracking Service PPC Ad Optimization About the Author – Randy Pickard is Vice President for Product Innovation for User Centric, Inc. User Centric is a leading user experience research firm. Randy’s focus is on the intersection of user experience and search engine marketing. He has been optimizing web sites for usability and search since 1996 and is a regular speaker at search conferences, including SES - San Jose and Chicago. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Do Not Overlook the Importance of the Display URLs in PPC Ads"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Do Not Overlook the Importance of the Display URLs in PPC Ads"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Randy Pickard\n          \n            Randy Pickard\n          \n            Randy Pickard"
}