{
  "url": "https://moz.com/blog/do-tweets-still-effect-rankings",
  "slug": "do-tweets-still-effect-rankings",
  "title": "Experiments on Google+ and Twitter Influencing Search Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Do tweets still effect rankings? How about Google+? The mystery began on July 3rd when Google Realtime Search went dark. The next day we learned the underlying cause to be Google loosing access to...",
  "content": "Experiments on Google+ and Twitter Influencing Search Rankings Social Media By: Cyrus Shepard July 5, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard July 5, 2011 Experiments on Google+ and Twitter Influencing Search Rankings Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The mystery began on July 3rd when Google Realtime Search went dark. The next day we learned that the underlying cause was Google losing access to its special Twitter data feed. The source of the disagreement is unclear, but the effects have been immediate. Realtime Search disappeared - all of it, not just the part that relied on Twitter. This included Realtime results from Google News, Blog Search links, Facebook fan page updates and more. No Realtime results? What if it took the world hours, instead of minutes, to learn about the tweet below? To gain perspective on what's at stake, consider the example of journalists and protesters staying abreast of current events during the recent government upheavals in the Middle East. Yes, this s#&t matters. For the past two years Google used Twitter not only to power Realtime results, but also for faster indexation of content and, we believe, to calculate Author Authority for use in their ranking algorithm. Google says they plan on reinstating Realtime with the power of Google+. But the network will have to grow significantly before this works. In the absence of the Twitter Firehose, can tweets still influence rankings? What about Google+? Test 1: Firehose On Last week, before this happened, we had the pleasure of working with Shari Goetsch of SeeYourImpact.org on a social media campaign for their terrific nonprofit organization. SeeYourImpact is a hardworking and unique charity that SEOmoz has worked with in the past. The goal of this campaign was to create buzz around a single, previously unindexed URL on the target website using only Twitter. A tweet was created and followers of SeeYourImpact were encouraged to retweet as much as possible. Within a few short hours of the campaign kickoff, the URL was tweeted 300+ times. As a secondary effect, the URL also received a handful of additional Facebook likes and LinkedIn shares. By early afternoon the page ranked #2 in Google for its targeted phrase, “Assist a Mom.” The URL reached #1 status by day’s end. As of this writing it remains the number one ranked page for this target keyword phrase. The Twitter effect was in full power. Test 2: Firehose Off After Google announced that they no longer used direct Twitter data, Rand created a previously unindexed webpage and tweeted it to his followers. Within 10 minutes, Google picked up a tweet scraper, but not the original post. After an hour we realized a mistake. We had inadvertently included a meta NOINDEX tag in the head of the webpage. Doh! After quick removal of the tag, it took Bing a full 6 hours to index the original URL, but still no Google. Not until 8 hours after the original tweet did Google index our URL. Eventually it ranked #1 for its targeted keyword phrase. Even with our mistake, Google appeared significantly slower than it used to. Test 3: Twtter vs. Google+ Twitter The next day we created two unique pages to test the ranking power of Twitter vs. Google+. Rand then shared one page on Twitter and the other on Google+. This time, the Twitter URL performed much better and faster in the SERPs. Within 13 minutes it ranked #1 for its keyword phrase \"Euclidean Taeniasis of Galapagos\". Rand noted that the ranking coincided very neatly with our URL's appearance in Topsy, which may be where Google found it. It makes sense that the Topsy 100 is crawled and indexed much more frequently than Rand's Twitter profile. Even more revealing was how tweets not only helped indexation, but also appeared to boost rankings. The first hour the page appeared in search results, it ranked 10th for the phrase Euclidean Perry and number 8 for EuxliswN Darwin. In the time it took for the number of tweets to double, the rankings rose from 8 and 7 respectively. Tweets still help with indexation, although maybe not as fast as they used to. And tweets appear to boost rankings, although the exact degree is unclear. Caveat: We noticed the URL was shared through several Linkedin accounts. Many people, including Rand, have their Twitter profile set up to automatically post to LinkedIn whenever they share. We believe this had a minimal influence on the experiment, but can't be discarded. Google+ Rand shared the second page through his Google+ profile. He likewise encouraged folks to share it through Google+, but not through Twitter, Facebook, direct linking, etc. Within minutes the post was shared dozens of times. Two hours later, this test URL ranked #1 for it's keyword phrase in Google search results - this time without a single Twitter scraper in the results. A check of shared count shows it was tweeted 0 times, although there were 4 Google Buzzes that appeared. Is this the effect of the +1 button? Two hours is a long time to wait for real time results. If Google wishes to replace Twitter with Google+ in a meaningful way, they have a long road ahead of them. At this time, I haven't found direct evidence of improved rankings with Google+ beyond basic indexation, but I wouldn't be surprised if the phenomenon existed. Twitter is Still Relevant: 4 Takeaways Even without the Twitter firehose, it seems the Twitter effect still finds ways of maneuvering into Google's search results. 1. Aggregators & Scrapers Play an SEO Role Without Topsy and the countless Twitter scrapers, it's unknown how fast our pages would have been indexed. The aggregators and the scrapers contain two features which undoubtedly helped our URLs to rank in each Twitter experiment: Optimized Title Tags for the target phrase, i.e. <title>SeeYourImpact.org » Assist a mom, change the world – english | Twitmunin</title> A prominent followed link to the target URL near the top of the page. 2. Retweet – Retweet, Repeat The more retweets a link receives, the better it seems to perform in search results and the more visibility it obtains with the social media aggregators referenced above. With Topsy, for example, a URL that makes it into their top 100 list achieves much more visibility than a single tweet. 3. Social Authority = Ranking Potential? “Who” tweets your content used to be just as important, or more so, than the number of people retweeting your content. Can Google still calculate this in any meaningful way? It's interesting to note that Google still shows Twitter sharing data in personalized search results, as seen below. Whether this sharing data translates into author rank remains to be seen. 4. Traditional SEO Still Rules - For Now Lately, I’ve talked to a lot of folks who are genuinely confused about the new role of social factors in search engine optimization. We in the SEO industry have contributed to this with our wall-to-wall coverage of Facebook likes, Google+ and articles like this one about Twitter. Ian Laurie wrote an excellent article on the topic. This attention has caused some people to believe that social media has displaced traditional SEO. This is far from the truth. Let me be clear: Social media doesn't replace traditional SEO. It helps it. Each of these tests contained a URL optimized for the targeted keyword phrase and the target page was optimized for the keyword, including the URL, title tag and on-page text. All of these factors undoubtedly helped it to rank. Traditional SEO practices including content creation, external link building and on-page factors still lay the foundation for long-term ranking success. Take a look at Rand's SEO Pyramid below, where social media rests atop the other bases. Although the social aspect may be larger today than depicted in the past, we need to be careful not to flip the entire pyramid on its head. SEO Pyramid created by Rand Fishkin for SEOmoz Tweets or Google shares alone don't yet equate to long term ranking nirvana. Employing a synergistic combination of social media and technical SEO savvy provides the best recipe for success. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Experiments on Google+ and Twitter Influencing Search Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Experiments on Google+ and Twitter Influencing Search Rankings"
    },
    {
      "level": "H2",
      "text": "Test 1: Firehose On"
    },
    {
      "level": "H2",
      "text": "Test 2: Firehose Off"
    },
    {
      "level": "H2",
      "text": "Test 3: Twtter vs. Google+"
    },
    {
      "level": "H2",
      "text": "Twitter"
    },
    {
      "level": "H2",
      "text": "Google+"
    },
    {
      "level": "H2",
      "text": "Twitter is Still Relevant: 4 Takeaways"
    },
    {
      "level": "H3",
      "text": "1. Aggregators & Scrapers Play an SEO Role"
    },
    {
      "level": "H3",
      "text": "2. Retweet – Retweet, Repeat"
    },
    {
      "level": "H3",
      "text": "3. Social Authority = Ranking Potential?"
    },
    {
      "level": "H3",
      "text": "4. Traditional SEO Still Rules - For Now"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}