{
  "url": "https://moz.com/blog/do-your-customers-actually-trust-you-injecting-trust-into-online-commerce",
  "slug": "do-your-customers-actually-trust-you-injecting-trust-into-online-commerce",
  "title": "Do Your Customers Actually Trust You? Injecting Trust into Online Commerce - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Overview\n\n\tIn the US and other countries, one of the largest indicators of trust is \"the handshake.\" Greek history tells us that the handshake originated as a gesture of trust indicating you held no weapons and came in peace.\n\t\n\tAs technology progresses, we do less and less busine...",
  "content": "Do Your Customers Actually Trust You? Injecting Trust into Online Commerce E-Commerce SEO By: Patrick Coombe June 19, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Patrick Coombe June 19, 2013 Do Your Customers Actually Trust You? Injecting Trust into Online Commerce E-Commerce SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Overview In the US and other countries, one of the largest indicators of trust is \"the handshake.\" Greek history tells us that the handshake originated as a gesture of trust indicating you held no weapons and came in peace.As technology progresses, we do less and less business in person. With that in mind, implementing a solid trust architecture into your online platform for doing business is more important than ever.Trust is the single most important factor that will determine whether or not a customer will complete an online transaction or hit the back button. Trust is the reason for large scale political changes and enterprise level business mergers.Our industry has been collectively examining web analytics for a very long time, and we now understand that people move through the web FAST. In many online commerce situations, users will simply skim a website and take in key words and images that pop out the most prior to making a purchase.With that in mind, we've learned a trick or two. Web design is no longer just about what looks good or feels right. It is a science and a well thought out design plan can be the difference between a user hitting the back button or clicking a call to action. A long long time ago... 14 years ago, two companies (Cheskin Research and Studio Archetype/Sapient) conducted a study titled, \"eCommerce Trust Study\" which was way ahead of its time. In their study, they solicited customer feedback to determine what elements communicated the most trust in an ecommerce transaction.This was a remarkable study that is still very relevant today, and anyone who has anything to do with conversion rate optimization should study it much closer.In one part of the study, they asked the group which symbols they were most familiar with, and which of them increased their overall trust the most: While a number of these seals and logos aren't as relevant as they used to be, we can learn a lot from this. Seals & icons that users are familiar with and associate with trust will still pass the most trust to a user during the buying process. Let's look at another study from more recently: What we knew before holds true today. In January of 2013 an independent web research company (the Baymard Institute) updated this data with their own testing. The study was titled \"What Site Seal Do People Trust the Most.' The respondents were adults from the US and were asked a number of questions, mainly relating to which site seals gave them the most sense of trust. While this test answers a lot of questions, it reveals many more: Keep in mind 49% of the respondents responded with either \"does not care\" or \"genuinely has no preference\". Rand also talked about the varying effects of social proof a few months ago in a Whiteboard Friday.Consumers are getting hip to the fact that a lot of these seals are \"for sale\" and that some of these have no bearing on your company being trustworthy in an online transaction. Some websites have used as many as 10 trust seals on an ecommerce site. While some business owners say \"the more the better,\" if you apply the law of diminishing returns, as the number of trust seals increases on the website, this will actually diminish the amount of trust given to that website from the buyer. In a lot of cases, enterprise level brands do not use trust seals. Consumers who are making a purchase on Amazon already know the stellar reputation that it has, as opposed to those who are making a purchase on a lesser known ecommerce website that they have never heard of. There are different ends of this spectrum as well. Users who are about to make a purchase on fiverr.com are much less likely to take trust seals into account then someone who is going to buy an item for $5K. Informational Social Influence or \"Social Proof\" If you've ever studied psychology or sociology, you are familiar with this concept. Let's review a few classic examples & studies that you might have heard about: When sitting in a room filled with smoke, no one moved unless they saw other people move. When someone has fallen down in the street, bystanders failed to act if they see other bystanders are walking past. When someone is staring up at a building on the street, other people passing by will also stare up at it. Bartenders and baristas will sometimes add their own money to the jar to encourage others to \"do the same as others.\" Freshman college students emulate the drinking behaviors of other college students. Donation solicitors will add names to a sign-up list to show that other people have also been generous. People will take free samples in a mall food court if they see other people taking them (I came up with that one). In our world of Internet marketing the examples are much different than the above, but conceptually very much the same. Social proof or sometimes referred to as \"informational social influence\" is a phenomenon where people follow the actions of other people, believing they’re following the right course of behavior for the particular situation. Social proof is a huge buzz word that is being thrown around by conversion rate optimization experts and SEOs right now. To a lot of people implementing social proof simply means embedding the VISA logo or other seals in the footer of a website. Most of us know that it goes way beyond that. In Robert Cialdini's \"Influence: The Psychology of Persuasion\" he writes about six principles of influence which was first described in 1982 in the Journal of Applied Psychology. One of his catch phrases is to \"use peer power when it's available.\" This idea is used every day in online commerce as well as brick and mortar businesses to drive more customers to their business. This basic principle of human psychology can be transferred to website marketing in a number of different ways. Take Basecamp.com for example. They use influence to transfer social trust to their users with two snappy sentences backed by live data. Statistics such as Facebook likes, Twitter followers, and newsletter subscribers might able to be easily faked, but is still a very key factor in many people's buying decision. Most of the time users just glance at the number of followers you have, but that glance is just another check mark in the positive column of a person's internal trust calculator. The Social Proof in Social Commerce Consumers are now more interconnected via social networks than ever. Yes, people have been connected via social networks for a long time, but these same relationships are now becoming more connected through product recommendations and posts on social networks. Social commerce uses social network connectivity to drive traffic which will boost sales in online commerce. Although we are really only now starting to see the success of social commerce, the idea was created in the early 90's. The early attempts at social commerce were great, but failed during the web 1.0 / dot com burst due to ineffective technologies and really, poorly developed social networks that were incapable of interacting with ecommerce sites. While some claim that social commerce is a new technology, others claim that it is simply an evolution of ecommerce and simply a combination of several technologies. Amazon is a great example of simply owning this tactic. When a consumer is browsing their social network activity and comes across a product recommendation, trust is organically embedded into that interaction. A product recommendation from a random person holds very little value to most users. A recommendation from a family member, co-worker, friend, etc can pass an enormous amount of trust. In 2010 Amazon launched \"Connecting with Facebook.\" Amazon developed this new feature to connect Amazon users to their Facebook profiles & news feeds. It then makes Amazon product suggestions based on likes, recommendations and other social activity. You might know of a lot of different companies that are already using this technology, but Amazon has really done it right. With social proof you must think outside of the box. Yes, it is good to list the authorize.net logo and McAfee logo on your site, but don't stop there. There are a number of different ways that social proof can be implemented in social commerce, including: \"Customers also purchased\" - Displays a group of items that similar customers also purchased Review or scoring systems - Newegg.com has branded an amazing review and scoring system. If you are in the tech sector chances are you've made a purchase from Newegg. During that time you might have heard or said \"how many eggs did that get\" indicating the overall score of an item. Recent orders - This implementation (and sometimes tactic) is when an ecommerce site displays a list of the most recent orders made by customers The US Small Business Administration or SBA.gov gives some tips for small business owners and consumers as well: \"Look for signals of trust – Recently I came across a fake deal site, suggesting we may encounter more of those. Protect yourself by looking for trust signals such as an About page with real people identified as part of the management team; links to social accounts such as Twitter and Facebook; and a phone number and other contact information. Consider also using a service like McAfee’s Site Advisor which can help identify fake sites that are nothing more than phishing sites or malware sites or sites merely there to harvest email addresses. Check the site in Google to see what others are saying about it.\" Building Trust over Time or \"Relational Trust\" Interpersonal relationships gain trust momentum over time through various human interactions, mental tests, and various other ways. When two dating partners are courting one another, they don't disclose their life secrets on the first date, right? More than likely as each partner proves to the other one that they can be trusted and feel safe, more intimacy is revealed to the other partner over time. (In most cases) In ecommerce, trust built over time, or \"relational trust\", is one type of trust that is established after one or more transactions have been made that result in customer satisfaction. This type of trust evolves after two parties have interacted with each other in a transactional context. The same is true with the way consumers develop a trust relationship with a brand. In one study of relational trust (p15), it showed that there can be several violations of trust before erosion of that trust begins to take place. This makes sense, many users can deal with one or two errors, but after that they might go looking for another solution. One example of this is the overall purchase or service experience that happens over a period of time. Let's say a user buys something from a website, is issued a receipt, receives shipping notification, the order arrives on time, and they get a follow-up email. This is not only a sign of overall customer satisfaction it is a sign that your company can be trusted to follow through with what is listed on your website. What if a customer receives the wrong item, reneges, shipped to the wrong address, incorrect quantity, or customer service is rude or unable to answer a question? This will signal that your company cannot be trusted, and the user will most likely explore other options. They might even further contribute to the problem by posting a negative review or even blogging about it. Even if a buyer has a good experience with a supplier over time, seeing negative reviews or even negative publicity could cause this user to seek an alternative supplier. Community = Trust One of the positive aspects of building trust with your customers over time is the organic development of a user community or fan base. This is one aspect of trust building that is near impossible to fake. One cannot simply hire an employee and say \"ok, go build a community of loyal users for us.\" An online fan base is the result of very hard work and having a customer-centered business. Most people think of \"social media\" when they think of an online community, but that is just one of many ways to do so. There are a number of ways to encourage community development: Develop a forum. Forum interaction is difficult to get rolling, but once it gains some momentum it can manage itself in some cases. Having an online forum can be a live testament to your hard work, and a sign that there are loyal users dedicated to your brand. Even if there is some bad press, the mere presence of an online forum can offset this in many ways. Moz does an amazing job of community development and that shines through into excellent customer support and a trustworthy brand. Develop a rating system - \"Kyle B (registered 1999) Rated this item 4.5/5 and 137 other items.\" Rating systems can sometimes be an aspect of an online forum, but mostly exist independently of them. Many sites have implemented a voting system where items are displayed alongside the number of votes up/down, number of successful uses, and other metrics. Commenting systems - Various online newspapers have implemented commenting systems that have drawn users that may have not otherwise been a reader. Platforms such as Disqus and now Google+ have made it much simpler for brands to integrate and build communities through their ease of implementation in CMS's. Social Media - This is obviously one of the most popular ways to build an online community. The Walmart Facebook Page is an extreme example of this with 29 million likes and engagements as often as every few minutes. Smaller businesses are joining the race as well. Integrating social media into your web framework or CMS is one of the best ways to encourage community, and show trust to your users. Blogging - A blog built into your website is an excellent way to show trust. People want to see that there is a team of people behind your website, not just a flat faced website. Blog about industry related concepts as well as what is going on in your organization. Community and Personality One thing to remember when building a community is to have a personality, but remain professional at all times. We've seen numerous PR disasters where company representatives have blown up on social media sites, forums, and blogs. Retain trust in your brand by taking time to make calculated responses to your interactions, and not just responding like it is your personal Twitter feed. Well thought out responses with correct spelling and proper grammar shows you take pride in your business and can be trusted. We can't all be lucky enough to have talented people like Keri Morgret managing our community. Find someone in your organization who is excited about your company and have them work a few hours per week on community management. If it works out well, a lot more time for them to work on this. Community building is not just a great way to build trust; it can funnel leads into your system as well. Security & Privacy \"The Internet\" does not organically support security or trust as part of its framework. Online vendors and websites must realize this and apply proper measures to deploy security if they wish for their website to be secure from the dangers that are out there. According to the FTC, complaints about identity theft accounted for about 1/3 of the 686,000 total complaints filed last year. That alone should indicate that consumers take this very seriously. Proper security and privacy disclosures are a huge factor in a customer's decision to make a purchase. A lack of regard for your intentions with what you do with a user's email address basically tells your users that they are going to get spammed, and probably sold to other list brokerages. Security can be interpreted by a number of different factors during a customer's experience on your site. For instance, when you sign up for a new service 99/100 times you will receive a confirmation email to assure that you were the person who signed up for a service. While this process is annoying to most users, it also reminds them that security is an important component to your website. If a user does not receive a confirmation email, this might be less of an annoyance to your customer - but what sort of signal is that sending? Web server security is also another huge factor. The worst case scenario in website security is your site gets hacked and your content gets tampered with. This not only causes a temporary loss of revenue due to downtime, but creates a question in your customers mind if your company is committed to security. It doesn't have to be as serious as a website being compromised. Security is in the details. Asking for strong passwords, captchas, and other verifications will reinforce to your customer that information security and their personal data is of the utmost of importance to your company. Privacy policies should not be overlooked, nor should they ever be templated.Privacy Policies While privacy policies are considered to be somewhat legal in nature, they should be able to be read and understood by anyone. The overall clarity is very important when attempting to transfer trust. A privacy policy filled with Latin legal mumbo jumbo could be perceived by consumers as a means to confuse them with big words and text that is difficult to comprehend. While enterprise sites such as Google and Facebook often have multiple privacy policies for specific products that vary in length, smaller businesses can most often get away with a privacy policy under 1000 words that read easy. A good privacy policy will leave the consumer with a very clear understanding of how their information will be used, while being easy to comprehend. Most importantly it should leave them with the feeling that their data will be safe with you at all stages of the transaction. SSL & Ecommerce An SSL certificate binds together security/encryption with a domain name along with an organizations identity. An organization will install an SSL certificate onto its server as a way to initiate a secure connection between the users and the server. There are various different SSL vendors which vary in price and overall security. SSL certificates such as VeriSign have become a trusted name in the SSL industry. Once an SSL connection has been established, all of the traffic that goes in and out of the server is now encrypted. A web browser tells website visitors that it is a secure connection via a number of visible trust indications such as: (depending on the browser) A secure \"lock\" symbol will appear in the address bar that indicates that a connection is secure. A popup might appear notifying & querying the user to accept the secure connection http becomes https in the address bar You can \"view the certificate\" by checking the settings on your browser Most modern day merchants such as authorize.net or PayPal might even require an SSL certificate to be present in order to function. While SSL certificates are not as blatant as a trust seal or brand logo, it is still another factor that makes up the overall trustworthiness of a website. SERP Rankings & Backlinks The mere appearance of your website in key positions in search engine rankings can be a trust signal. Many users are aware of Google's SPAM filters and associate rankings with trust. Brands realize that performing SEO on their website is not only a great way to drive business and traffic to their website, but a way for them to show their users that they are \"good\" with Google. If a user cannot find your company in the search engine results pages it raises a red flag as well as questions about the legitimacy of your brand. Backlinks are not just a way to beef up your SEO; they are associations of your brand. Businesses that engage in blackhat SEO methods such as automated backlinking programs create 1000's of backlinks (and associations) on websites that they have no control over. If you are in the SEO industry you know that more and more business owners and consumers check backlinks. Being associated with bad neighborhoods could send mixed messages to your users about what you stand for and what you are about. Trust: TLD's and Location Due to the influence of cultural, political and social issues, not all countries and regions have an equal amount of ecommerce penetration. A company's location and TLD choice also plays a part in trust perception. If you are a US citizen and about to make a purchase, what impact would it have on the buyer if the TLD was .ru or .pk? Different countries have different relationships with one another, foreign policy relationships and globalization can sometimes affect a decision that a buyer is going to make. Particularly in large international transactions, buyers can have concern for international shipping, foreign policy, exchange rate fluctuation, customer support, language barriers, customs complications, and other issues that could prevent the transaction from processing start to finish. In larger online transactions (mainly B2B sales) a buyer might visit the contact page to see the country of origin that the company headquarters are located in. Most of the time a buyer is going to feel more comfortable when the company's location is in the same country as the buyer. In the US (or your country of origin) and countries with societies that use ecommerce, there are laws to protect consumers and businesses if someone rips them off. Doing business with a website in another country can sometimes cause the supplier to lose credibility from the buyer. In a localized ecommerce transaction, people in the same country or region are privy to local policy, contractual traditions, laws, and even ethics. It is also much easier for parties in a localized transaction to gather information about each other, which may allow the buyer to gain more trust for the seller then it would be in different countries. Again, once a transaction has been complete, this could mitigate some suspicions the buyer might have had and make future transactions much smoother. In addition, websites that deal in global markets should always have a website version available in their native language. While there can be many implications in offering a translated version of your website, there are many services and packaged solutions available for the webmaster seeking a quick fix. Conventions, Site Standards, and Operational Flow Conventions are extremely important in the trust race. A professional appearance and easy-to-use navigation system implies a promise of quality service. It's the little things such as typographical errors, 404s, and tricky navigation systems that give off a lack of trust for users A quick trust checklist for ecommerce sites in terms of standards and working operation: Do your products have up to date photos? Are the photos professionally done and do they show all angles/views/zooms? (Product photos taken haphazardly with different backdrops/angles can show a lack of consistency.) Do you have a comprehensive description of all of your products? Are your products searchable? Do you disclose all shipping & handling (and other) charges up front before checkout? Are you using universal form components that are universally familiar? Are \"out of stock\" items listed accordingly? Are helpful instructions listed nearby that won't make them navigate away from the page? Are prices calculated live and listed where you can see them? (not hidden until checkout) Constant technical difficulties, down time, and server issues are not just an annoyance to users, it shows that your company does not pay attention to the small details and may also signal that you are regularly unavailable. Find the spelling and grammar nerd in your office and assign them to constantly scan all outgoing communications, particularly static pages on your website. Everyone makes a mistake here and there, but constant spelling and grammatical errors show a lack of regard for attention to detail which leaks trust from your precious brand. Sites that do not reference, cite, & link to other sites can show a lack of credibility to your users. A site that is properly referenced will show your users that you products, data, and services are backed up by other sources. If you care more about \"losing PR\" then you do about usability, you're doing it wrong. About Us Pages and Other Site Staples An \"about us\" page with a one-paragraph statement about your company and nothing else is just plain shady. The \"about us\" page within a website is a staple in the framework of modern website architecture. It is expected that a website has an about us page, and for that page to be as detailed as possible. List all of the people in your organization and maybe even a little bit about their personal lives. Perhaps make their social media profiles available alongside their contact information. Show headshots and maybe even a group photo. Paid Wordpress theme template examples can show great examples of proper about us implementations. A mission statement alongside a statement of guarantee goes a long way, but only if you back it up. The contact us page also applies to the above. This page is so essential to the framework of a site. The contact page should list as many ways to contact your organization as possible, as well as the address to your headquarters. A photo of your organization or a map can also go a long way. Steer clear of contact pages that just have a form that goes nowhere. Web Design & Standardization If a customer does not believe that a web interface is trustworthy then the transaction will not take place. We've already mentioned the importance that a privacy statement has in online commerce, but what about the placement of the privacy policy and disclosures? Consumers expect for a privacy statement to be readily available (most often in the footer) of the website. It is also important to include the privacy statement within the checkout process at the time when you are asking the user to give their information. Sometimes it just isn't responsible to have the latest and greatest HTML5/CSS/Flash/ jquery gadgetry on your sites. Websites should be designed with standardization in mind for all users and browsers. All sites should be viewable in text-only mode and a great way of testing this is to view it in Lynx. Symmetry, overall good design standards, color choices etc all play a huge part in a user's decision to complete a transaction. Visiting a website that is poorly designed and just \"bad\" has shown time after time to scare users away and look for other options. A well designed website is essential to signaling trust in your customer base. Be Responsible with Responsive Web Design In this day in age there is no standard web browser or screen resolution. I know it's cliché, but more and more users everyday are using their mobile phones, tablets, and even televisions to browse the web. Having a responsive web design is a great way to show your users that you care about their experience and have taken an action step to implement them. Developing a mobile version of your website is another way to do the same. Developing a mobile site tells your users that you realize that they have a small screen, and you care enough to provide a much simpler interface for them to browse. Customer Service Customer service isn't just having someone answering complaint related emails. You can implement static customer service elements into your website in a number of different ways. Create a wiki page - these pages are great for technical products or software, but more and more companies are using them every day. Implement and order tracking system A live chat that is 'always on' An easy return system that is consistent Instant merchant notification and notice of receipt Easy order calculation and ability to modify order types and quantities The above list might sound more like a general ecommerce checklist, but are essential in a users trust relationship with a brand. Conclusion & Thanks I always have a hard time wrapping things up, that's why my posts are usually so long. Much of this knowledge has been gained as a result of my personal experience as an affiliate marketer and my professional experience developing sites for customers over the years. I also take a lot of information in from reading books, papers, and blogs. Implementing trust in a website or online shopping environment is a process, not an event. It cannot be solved by installing a plugin or changing some images. It is an overall attitude and really, it is a way of life and a standard to conduct business by. In a world of identity theft and \"flogs\" (fake blogs) our customers come to our sites very skeptically. Creating an environment where your customer feels trusted is not just a way to increase CTR or sales. It is our duty as online marketers to provide a safe & quality shopping environment and live by the \"TAGFEE\" way of life. Thanks so much for reading, as well as any feedback; I'm really interested in what you all have to say about this topic. It's been a pleasure! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Do Your Customers Actually Trust You? Injecting Trust into Online Commerce"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Do Your Customers Actually Trust You? Injecting Trust into Online Commerce"
    },
    {
      "level": "H2",
      "text": "Overview"
    },
    {
      "level": "H2",
      "text": "Informational Social Influence or \"Social Proof\""
    },
    {
      "level": "H2",
      "text": "The Social Proof in Social Commerce"
    },
    {
      "level": "H2",
      "text": "Building Trust over Time or \"Relational Trust\""
    },
    {
      "level": "H2",
      "text": "Community = Trust"
    },
    {
      "level": "H3",
      "text": "Community and Personality"
    },
    {
      "level": "H2",
      "text": "Security & Privacy"
    },
    {
      "level": "H2",
      "text": "SERP Rankings & Backlinks"
    },
    {
      "level": "H2",
      "text": "Trust: TLD's and Location"
    },
    {
      "level": "H2",
      "text": "Conventions, Site Standards, and Operational Flow"
    },
    {
      "level": "H2",
      "text": "Conclusion & Thanks"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Coombe\n          \n            Patrick Coombe\n          \n            Patrick Coombe"
}