{
  "url": "https://moz.com/blog/does-seo-even-work-for-small-businesses",
  "slug": "does-seo-even-work-for-small-businesses",
  "title": "Does SEO Even Work for Small Businesses? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Clicks on paid search listings beat out organic listings by nearly a 2:1 margin for keywords with high commercial intent in the US. Is SEO still a viable marketing tactic for the average small business owner?",
  "content": "Does SEO Even Work for Small Businesses? Marketing Industry By: Larry Kim August 3, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Larry Kim August 3, 2012 Does SEO Even Work for Small Businesses? Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. You've probably noticed by now that pay-per-click ads have been increasingly taking over more and more of the search engine results page.I've been noticing an acceleration in that trend, particularly recently, and so earlier this month I did some research into the impact all of these new, super-sized, engaging ad formats are having on the average Google searcher. The result:Clicks on paid search listings beat out organic listings by nearly a 2:1 margin for keywords with high commercial intent in the US.You can check out the full study results by clicking on the image below.Just to be clear here – organic searches still get more clicks overall than paid search – but not all keyword searches are created equal. Keyword searches with high commercial intent – meaning, keywords where a searcher is looking to buy a product or service (for example: 'office paper shredder') are worth far more to businesses than your basic informational keyword searches (for example: 'why is the sky blue'). We defined keywords with high commercial intent as keywords that triggered the Google Shopping / Google Product Listing ads, and our data was for US only. So, our data could also be interpreted as: when you see a search where the standard Google ads and Product Listing ads are taking up most of the screen, that the majority of clicks will go to the paid listings.I’ll spare you from reading yet another PPC vs. SEO article, or worse, the perennial 'SEO is dead' article, or even the optimistic 'let’s use PPC and SEO together' article. Instead (at the risk of getting the most thumbs down votes in the history of the SEOmoz UGC blog), I’m going to make just three bold assertions, and I'm really interested in your take here! With that said, here goes:1. PPC isn't OptionalIf you're a business owner, trying to actually sell products online, my study suggests that SEO appears to be less and less viable as a marketing tactic every month! In the last year, a war on SEO has been waged on two fronts:PPC is becoming more prominent and relevant than ever, soaking up the lion's share of the most valuable clicks to be had.At the same time, SEO has become far more complex, more expensive to execute, increasingly difficult to measure, and delivers far less predictable results than ever.Of course it’s possible to be successful in SEO – there are always exceptions and to a large extent, it depends on your industry niche and other competitive factors. But for the average small business owner trying to sell products on the internet, who isn't a full-time internet marketer – the ROI from SEO just isn’t there anymore.For example, my mom (who isn’t an internet marketer) has a small business. If she had a $2,000 budget to spend on online marketing, I would today recommend that she allocate nearly $0 towards SEO.2. The SEO Industry Is Largely in Denial as to What Is HappeningAm I the only one who is seeing it this way? When it comes to the old “PPC vs. SEO” debate, I generally find SEOs fall into one of three camps.There are some in the SEO community who think that PPC is some kind of marketing addiction that needs to be overcome.Others believe that PPC can be useful in certain areas, for example, as a way for conducting keyword research to make your SEO more efficient.And finally, there are some who believe that SEO and PPC work best together.But I think what I’m saying here is: (d) none of the above. If you're a small business trying to sell stuff online, that you should probably just focus your limited budget on PPC. SEO is starting to feel more like a 'nice to have' for companies that can afford it.Another example of where I differ with the average SEO is in reading through the recent SEOmoz State of SEO in 2012 article. Now, I wasn’t part of that interview series, but if i had been, my answers would have been pretty different. For example:Q: What’s the impact of the Google Spam Wars?We’re now at a point where the cost and complexities of executing SEO outweigh the benefits to most small businesses, particularly those trying to sell products online.Some SEOs seem to think Panda, Penguin, et al are good for job security – I guess because small businesses will keep hiring SEO consultants instead of trying to figure it out themselves. But the alternative is, they realize the SEO ship is sinking and re-allocate that budget to something else instead.Q: What is your take on Keyword Not ProvidedSEO was once a very measurable industry – arguably one of the most measurable forms of marketing, which was one of the reasons I got drawn into the field over 10 years ago, but measuring the ROI of SEO is now more difficult than ever, making PPC even more valuable.(etc.)Am I really the only one who feels this way?3. The War on 'Free' Clicks Isn’t Such a Bad ThingDon't get me wrong here – I’ve been doing SEO for over 10 years and I love it. It's a significant part of my company’s Web marketing strategy. I'm the founder of a venture-backed PPC management software company with over 60 employees now, with a huge number of customers, yet I still spend about 40% of my time doing SEO work! My website operates in one of the most competitive search verticals, and ranks on search terms like 'keyword tool' or 'AdWords' – where the competition comes from domains like google.com.But it’s not exactly easy, and certainly was never free. We need to maintain a constant stream of links and social bookmarks to fuel this operation; we have to design, develop, and promote free tools like our AdWords Grader and Free Keyword Tool, and execute seemingly impossible content marketing strategies just to maintain our search rankings. In addition to my time, we employ an amazing full-time blogger, a talented SEO guy, the best Web guy on the planet, an intern, and many other engineering and contractor resources. SEO is easily one of the most complicated aspects of my business. We’ve invested millions into building out our content infrastructure, and you have to be a bit of a mad scientist to do this kind of stuff, and somehow I feel that this kind of work really just isn’t in everyone’s DNA (or everyone's budget). You could even argue that my time, as the founder, would be better spent on other projects.But what's the goal of SEO anyway? For many small businesses it's to sell products or services, or drive qualified leads to their websites.What if Google were to give you an easier way to precisely target just the keywords that were relevant to your business, without requiring all the crazy workflow like social media bookmarking and link begging and link baiting, and writing evergreen content, etc.Now imagine that they made the paid ads way more powerful than your standard organic listings, by adding features like:Remarketing – so that you can relentlessly chase your leads across two million websites on the internet until they finally give up and convert to a customer.Click-To-Call Ad Extensions – so that prospects can easily call your business with the click of a button if using a mobile phone.Communication Extension – so you can collect emails to grow your newsletter list.Chat Ads – to connect with leads while they’re hot!Product Listing Ads – big pretty pictures of the things they want to buy.Map/Location Extensions – target people in your area and show them how to find you.Verticalized Ad Units – Special ad units for every type of search, like flights, and eventually, for every other major search vertical.Etc. – there are just too many to list out here.My point is: How exactly is this bad thing for small businesses?In the end, isn't PPC just becoming an easier, more prominent, and more effective form of inbound marketing? And if so, why not embrace it with both arms open?And isn’t this better than worrying about what zoo creature Google will unleash upon us next?About The AuthorLarry Kim is the Founder & CTO of WordStream, provider of the AdWords Grader and the 20 Minute PPC Work Week. Larry splits his time doing SEO and Software Product Management work. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Does SEO Even Work for Small Businesses?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Does SEO Even Work for Small Businesses?"
    },
    {
      "level": "H2",
      "text": "1. PPC isn't Optional"
    },
    {
      "level": "H2",
      "text": "2. The SEO Industry Is Largely in Denial as to What Is Happening"
    },
    {
      "level": "H3",
      "text": "Q: What’s the impact of the Google Spam Wars?"
    },
    {
      "level": "H3",
      "text": "Q: What is your take on Keyword Not Provided"
    },
    {
      "level": "H2",
      "text": "3. The War on 'Free' Clicks Isn’t Such a Bad Thing"
    },
    {
      "level": "H2",
      "text": "About The Author"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Larry Kim\n          \n            Larry Kim\n          \n            Larry Kim"
}