{
  "url": "https://moz.com/blog/does-fixing-broken-links-matter-seo",
  "slug": "does-fixing-broken-links-matter-seo",
  "title": "Does Fixing Old Broken Links Still Matter to SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Fixing broken links has long stood as an SEO best practice. But if you've run into situations where you've fixed a broken link and nothing happened, you’re not alone. In today’s episode of Whiteboard Friday, SEO expert Cyrus Shepard discusses whether these fixes still matter, and takes you through…",
  "content": "Does Fixing Old Broken Links Still Matter to SEO? Link Building | Whiteboard Friday By: Cyrus Shepard June 4, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard June 4, 2021 Does Fixing Old Broken Links Still Matter to SEO? Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Fixing broken links has long stood as an SEO best practice. But if you've run into situations where you've fixed a broken link and nothing happened, you’re not alone. In today’s episode of Whiteboard Friday, SEO expert Cyrus Shepard discusses whether these fixes still matter, and takes you through steps to increase your chances of seeing the benefits. For more link building tips, be sure to check out our recent update to The Beginner’s Guide to Link Building: Read the Guide! Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Howdy, Moz fans. Welcome to another edition of Whiteboard Friday. I'm Cyrus Shepard. I am a full-time SEO consultant, working here with Moz. Today I want to talk to you about a subject I saw on Twitter that I thought was really interesting: Does fixing old broken links still matter to SEO? Now I thought this was a great question because fixing broken links is an SEO best practice. You read about it all the time. But if you've been doing SEO long enough, like I have, you've run into situations where you've fixed a broken link, or you found a page with hundreds of broken links, maybe thousands of broken links, you fixed it, you redirected it to a new target, and nothing happened. So does this happen all the time? Is this common? Has Google changed the way it treats broken links? What's going on here, what are best practices, and what steps can we take to increase our chances of seeing a benefit from fixing broken links? That's what we're going to talk about today. Why we fix broken links So let's start off with why do we fix broken links. This is the basic stuff, the introduction. Links pass link signals. Google uses links for things like PageRank and anchor text. So when they find links, they can give you a rankings boost. When a page 404s when those links break, when they go to a page that doesn't work, those link signals don't have a chance to pass anymore, and that can hurt your SEO. Usually these are caused by one of two reasons. One, the link itself is just bad. It points to a page that doesn't exist on your website or something like that. There's a weird parameter in it. Someone typed it in wrong. But oftentimes pages break on your own site. You remove a page and you don't redirect it to another page. A combination of these factors means that on any given site you can find tens, hundreds, thousands, even millions of links sometimes because this is a very common scenario. So that's why we fix broken links, to regain that link juice and get that ranking benefit that Google is looking for. So it's supposed to work and oftentimes it does work and a lot of times it's great. But there are times when it doesn't work. Why it might not work So what could be going on here during these times that it doesn't work? So here are four reasons why fixing broken links may not be effective in certain situations. 1. The links didn't count First of all, the links may not have counted in the first place. The truth is there are a lot of links Google just doesn't count. These could be spam links, manipulative links, or links they find that are non-editorial. Just because a tool reports a link as being broken or pointing to a non-existent page doesn't mean that link actually has value. So that could be one reason why fixing the broken link may not work. 2. The links were low value Second reason, Google may have counted those links, but they were considered low value or not fresh. Consider a link on a page that's a broken link from a page that's 10 years old. It doesn't have very much traffic or no traffic. It's buried at the bottom. No one even visits this page. Google doesn't even rank it. Would you expect Google to attach a lot of value by fixing that broken link? Probably not. So a lot of times when you're fixing broken links, you may find low value, not fresh links, pages that aren't updated. They may not pass a lot of value and fixing them may not have a lot of benefit. 3. You redirected to an irrelevant URL Third, and this is a really common reason, you fixed the link, but you redirected it to an irrelevant URL or a URL that's not as pertinent. We see this a lot with sites that discontinue an entire section and they redirect everything to the homepage. They get rid of a subdomain. They redirect to a category page or something like that. Google will often report these as soft 404s, meaning they see your redirect, but they don't think the page that you're redirecting to is as relevant as the original page or the page that was broken or intended to be there in the first place. So that's another reason why Google may not pass these link signals through these links when they see a soft 404 or they see you redirecting to a page that just isn't as relevant as the original. 4. Google may not rely on \"live\" links The fourth reason it may not work, there's this phenomenon, this theory that Google may not rely on live links, that these link signals don't necessarily have to be there all the time for Google to pass value to them. Now Google advises us, when we do redirects, to leave those redirects in place for a year. Now why would they say a year? The theory is that after a year any value in those link signals has already passed. Rand Fishkin noticed this phenomenon and named it ghost links several years ago, where links that no longer exist might already have passed their value. So sometimes we don't really know how Google treats these older links. But sometimes it may not be necessary for links to be live for them to pass value, so fixing them doesn't really have an impact. Again, this is an area where we don't have a lot of insight into how Google actually works, but it's possible that the link signals have simply passed on their relevance anyway. 5 broken link building best practices So what can we do about it? What can we do about these situations to maximize fixing old broken links on our website? So here are my five best practices. 1. DO fix broken links One, yes, you should fix broken links. Do continue to fix broken links, because we don't know which links Google isn't counting, and there are several, often many instances where it does work and you can see a benefit. Plus it's just a good user experience. When users are coming from one URL to another, they don't want to see broken pages, and those link signals can pass relevance and value to Google. 2. Prioritize pages with high authority Two, prioritize pages and links with high authority. Your site may have thousands of broken links or millions of broken links. You don't need to fix all of them. But what you want to prioritize are the high value links, the pages with lots of links pointing to them, or links from pages that have lots of value themselves. We score pages here at Moz on a value called Page Authority. A lot of SEO tools have different metrics that help rank pages based on links. So fix the pages with your highest number of links, your highest Page Authority or whatever score you're using, and prioritize links from pages themselves that also have high Page Authority. These are going to be your most valuable links to fix. 3. Prioritize links with freshness signals Third, we want to prioritize links with freshness signals. We want to avoid these 10-year-old pages. Well, we don't necessarily need to avoid them, but we want to prioritize the most important pages. So what are freshness signals? Generally, we want to prioritize links from pages that get traffic themselves, that are regularly updated, that get links coming to them. There are many, many different types of freshness signals. There's an old post I wrote a while back. We'll link to it in the transcript below. But we definitely want to prioritize those links that have the highest value. 4. Redirect to relevant URLs Fourth, we want to make sure we're redirecting to relevant URLs. You don't want to redirect everything to your homepage or necessarily a category page that's off-topic. A question to ask is: Does the page you're redirecting to rank for the same types of keywords as the old URL? Or would it provide a good user experience to someone coming from the old link, or would the user be confused? The closer you are in topicality to the original page, the more likely those link signals are to pass from one target onto another. Ideally, you're linking to the exact same page and it just happens to be a broken page and you can fix it and it's relevant and everything is great. But in cases where you can't redirect to a relevant page, as close as possible or maybe you just shouldn't redirect at all, because 404s are okay. They're a natural part of the internet. It's not always bad to have a 404. 5. You don't need to fix every link Which brings us to best practice number five, you don't have to fix every link. This happens all the time. Broken links are a natural part of the internet. Moz, if we go into our broken links report, we have tens of thousands of broken links. It would not be worth our time to fix every one of them, and it would be a waste of money and effort. But fixing the good ones, fixing the ones with high authority, with freshness signals, and redirecting to relevant URLs or the original URLs, those are the ones that are going to have value. So you don't want to give your developers a list of 10,000 broken links and say, \"Hey, fix all these.\" They're going to be mad at you, and you're not going to see the value out of it. So if you want some tips on how to fix broken links, how to find those high value links, we have a video from Dr. Pete on tips on exactly how to do that using Moz. You can use many other tools. Google Search Console and others are great at this. So yes, fix those broken links. You don't have to fix all of them. That's how you're going to get the value. Leave us your tips in the comments below. Thanks, everybody. Video transcription by Speechpad.com Tweet your questions and comments about broken link building using #MozBlog! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Does Fixing Old Broken Links Still Matter to SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Does Fixing Old Broken Links Still Matter to SEO?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Why we fix broken links"
    },
    {
      "level": "H2",
      "text": "Why it might not work"
    },
    {
      "level": "H3",
      "text": "1. The links didn't count"
    },
    {
      "level": "H3",
      "text": "2. The links were low value"
    },
    {
      "level": "H3",
      "text": "3. You redirected to an irrelevant URL"
    },
    {
      "level": "H3",
      "text": "4. Google may not rely on \"live\" links"
    },
    {
      "level": "H2",
      "text": "5 broken link building best practices"
    },
    {
      "level": "H3",
      "text": "1. DO fix broken links"
    },
    {
      "level": "H3",
      "text": "2. Prioritize pages with high authority"
    },
    {
      "level": "H3",
      "text": "3. Prioritize links with freshness signals"
    },
    {
      "level": "H3",
      "text": "4. Redirect to relevant URLs"
    },
    {
      "level": "H3",
      "text": "5. You don't need to fix every link"
    },
    {
      "level": "H3",
      "text": "Tweet your questions and comments about broken link building using #MozBlog!"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}