{
  "url": "https://moz.com/blog/does-seo-boil-down-to-site-crawlability-and-content-quality-whiteboard-friday",
  "slug": "does-seo-boil-down-to-site-crawlability-and-content-quality-whiteboard-friday",
  "title": "Does SEO Boil Down to Site Crawlability and Content Quality? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What does good SEO really mean these days? Rand takes us beyond crawlability and content quality for a peek inside the art and science of the practice.",
  "content": "Does SEO Boil Down to Site Crawlability and Content Quality? Whiteboard Friday By: Rand Fishkin July 11, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 11, 2014 Does SEO Boil Down to Site Crawlability and Content Quality? Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all know that keywords and links alone no longer cut it as a holistic SEO strategy. But there's still plenty outside our field who try to \"boil SEO down\" to a naively simplistic practice - one that isn't representative of what SEOs need to do to succeed. In today's Whiteboard Friday, Rand champions the art and science of SEO and offers insight into how very broad the field really is. For reference, here's a still of this week's whiteboard! Video Transcription Howdy Moz fans, and welcome to another edition of Whiteboard Friday. This week I'm going to try and tackle a question that, if you're in the SEO world, you probably have heard many, many times from those outside of the SEO world. I thought a recent question on Quora phrased it perfectly. This question actually had quite a few people who'd seen it. Does SEO boil down to making a site easily crawlable and consistently creating good, relevant content? Oh, well, yeah, that's basically all there is to it. I mean why do we even film hundreds of Whiteboard Fridays? In all seriousness, this is a fair question, and I can empathize with the people asking it, because when I look at a new practice, I think when all of us do, we try and boil it down to its basic parts. We say, \"Well, I suppose that the field of advertising is just about finding the right audience and then finding the ads that you can afford that are going to reach that target audience, and then making ads that people actually pay attention to.\" Well, yes and no. The advertising field is, in fact, incredibly complex. There are dramatic numbers of inputs that go into it. You could do this with field after field after field. Oh, well, building a car must just mean X. Or being a photographer must just mean Y. These things are never true. There's always complexity underneath there. But I understand why this happens. We have these two things. In fact, more often, I at least hear the addition of keyword research in there, that being a crawl-friendly website, having good, relevant content, and doing your keyword research and targeting, that's all SEO is. Right? The answer is no. This is table stakes. This is what you have to do in order to even attempt to do SEO, in order to attempt to be in the rankings to potentially get search traffic that will drive valuable visits to your website. Table stakes is very different from the art and science of the practice. That comes because good, relevant content is rarely, if ever, good enough to rank competitively, because crawl friendly is necessary, but it's not going to help you improve any rankings. It's not going to help you in the competitive sense. You could be extremely crawl friendly and rank on page ten for many, many search terms. That would do nothing for your SEO and drive no traffic whatsoever. Keyword research and targeting are also required certainly, but so too is ongoing maintenance of these things. This is not a fire and forget strategy in any sense of the word. You need to be tracking those rankings and knowing which search terms and which pages, now that \"not provided\" exists, are actually driving valuable visits to your site. You've got to be identifying new terms as those come out, seeing where your competition is beating you out and what they've done. This is an ongoing practice. It's the case that you might say, \"Okay, all right. So I really need to create remarkable content.\" Well, okay, yes, content that's remarkable helps. It does help you in SEO, but only if that remarkability also yields a high likelihood of engagement and sharing. If your remarkability is that you've produced something wonderful that is incredibly fascinating, but no one particularly cares about, they don't find it especially more useful, or they do find it more useful, but they're not interested in sharing it, no one is going to help amplify that content in any way—privately, one to one, through email, or directing people to your website, or linking to you, or sharing socially. There's no amplification. The media won't pick it up. Now you've kind of lost. You may have remarkable content, but it is not the kind of remarkable that performs well for SEO. The reason is that links are still a massive, massive input into rankings. So anything—this word is going to be important, I'm going to revisit it—anything that promotes or inhibits link growth helps or hurts SEO. This makes good sense when you think about it. But SEO, of course, is a competitive practice. You can't fire and forget as we talked about. Your competition is always going to be seeking to catch up to you or to one up you. If you're not racing ahead at the right trajectory, someone will catch you. This is the law of SEO, and it's been seen over and over and over again by thousands and thousands of companies who've entered the field. Okay, I realize this is hard to read. We talked about SEO being anything that impacts potential links. But SEO is really any input that engines use to rank pages. Any input that engines use to rank pages goes into the SEO bucket, and anything that people or technology does to influence those ranking elements is what the practice of SEO is about. That's why this field is so huge. That's why SEO is neuropsychology. SEO is conversion rate optimization. SEO is social media. SEO is user experience and design. SEO is branding. SEO is analytics. SEO is product. SEO is advertising. SEO is public relations. The fill-in-the-blank is SEO if that blank is anything that affects any input directly or indirectly. This is why this is a huge field. This is why SEO is so complex and so challenging. This is also why, unfortunately, when people try to boil SEO down and put us into a little bucket, it doesn't work. It doesn't work, and it defeats the practice. It defeats the investments, and it works against all the things that we are working toward in order to help SEO. When someone says to you on your team or from your client, they say, \"Hey, you're doing SEO. Why are you telling us how to manage our Facebook page? Why are you telling us who to talk to in the media? Why are you telling us what changes to make to our branding campaigns or our advertising?\" This is why. I hope maybe you'll send them this video, maybe you'll draw them this diagram, maybe you'll be able to explain it a little more clearly and quickly. With that, I hope we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Does SEO Boil Down to Site Crawlability and Content Quality?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Does SEO Boil Down to Site Crawlability and Content Quality?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}