{
  "url": "https://moz.com/blog/does-ad-viewability-equal-views",
  "slug": "does-ad-viewability-equal-views",
  "title": "Does Ad Viewability Always Equal Views? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ad viewability is only becoming more and more important, with Google announcing it would only charge advertisers for viewable impressions. But what exactly does \"viewable\" mean, and does it translate to actual views? Mediative recently conducted a research study that set out to answer these…",
  "content": "Does Ad Viewability Always Equal Views? Online Advertising By: Rebecca Maynes February 24, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Maynes February 24, 2016 Does Ad Viewability Always Equal Views? Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 6 minutes]There’s a lot of talk about ad viewability at present, and with big players such as Google announcing in 2015 that it would only charge advertisers for 100% viewable impressions, it's easy to see how it’s become such a hot topic in the digital marketing world. But what exactly does it mean to be \"viewable?\" Does this mean people will look at your ad? We recently conducted a research study that set out to answer these questions. Conducting the eye-tracking studyThe study was conducted in two parts: an online survey of 1400 participants for quantitative data, and an eye-tracking study designed to observe actual behaviors of searchers online — more qualitative data. The goal was to measure the type of ads people noticed and engaged with the most, determining whether behavior changed depending on the intent behind the search task (research or purchase) and the relevancy of the ad. We also wanted to determine how viewable online display ads truly are and what other factors influenced whether or not people viewed them. Participants performed tasks in Mediative’s lab while being recorded using the Tobii T60 desktop eye tracker. The key metrics measured were: Time to First Fixation – How long it took the searcher to fixate on an ad. A fixation is when we hold our eyes still and actually take in visual information. A typical fixation lasts from 100–300 milliseconds, and we generally fixate 3–4 times every second (Source: tobii.com). Total Visit Duration – How long the searcher spent in total fixating on the ad. Visit Count – How many times the searcher came back to look at the ad. Percentage Fixated – The percentage of all participants who looked at the ad. Percentage Clicked – The percentage of all participants who clicked on the ad. A participant conducting a calibration test on the T60 Tobii Eye-tracker in Mediative’s research lab“The findings in this study are a powerful reminder to create engaging advertising programs that responsibly leverage first- and second-party data. Marketers are still better off complimenting user experiences than disrupting them.”– Sonia Carreno, President, Interactive Advertising Bureau of Canada What is viewability?“Viewability,” as defined by the Media Ratings Council, means an ad has 50% of its pixels in view for a minimum of one second. Essentially, an ad is viewable if there's an opportunity for it to be viewed. 76% of ads in Mediative’s study were served in a \"viewable\" position as defined above. An opportunity for an ad to be viewed, however, does not mean that it will be viewed. 16.6% of the ads that were served throughout the study were viewed. 50% more ads were viewed above the fold compared to below the fold, and ads above the fold were viewed for 87% longer. Increasing viewability to increase viewsAlthough click-through rate is a clear indicator of whether an ad was viewed or not, it doesn't give the whole picture. It gives no measurement of how many ads were seen, but not clicked on. Therefore, CTR cannot be the sole measurement of a display ad campaign's success. Ads can be seen, noticed, and influence a purchase — all without generating a click. Buying a viewable ad impression is only the first step, however. Here are some areas for you to consider improving in order to maximize the chances of your display ads being seen. 1. Ad relevancyThe research showed that ads relevant to the searcher's current task are 80% more likely to be noticed than ads relevant to something the searcher had looked for in the past. Additionally, ads relevant to the search query are viewed for 67% longer than irrelevant ads. Relevant ads were visited on average 2.59 times per visitor per page, versus only 1.6 times for irrelevant ads. Relevant ads received 5.7x more clicks. Below are heat maps for web pages containing two big box ads. The page on the left features an ad that was irrelevant to the search task. The page on the right features a relevant ad. The areas in red had the most views, followed by orange, yellow, and green. Your action item:You can advertise on sites that are relevant to the audience you are trying to reach (e.g. a car ad on a car information site). However, adding data into campaigns and purchasing impressions in real-time will increase the relevancy of your ads, no matter the site the user is visiting. With demographic data and/or intent- and interest-based data, specific audiences of people can be targeted, rather than specific sites. This is more likely to result in a higher return on ad investments, as impressions land on the most likely buyers. 2. Ad typeIn a survey, we asked people which ads they pay attention to the most on a webpage. The responses show that people believe they pay attention to the leaderboard ads at the top of the page the most. Our eye-tracking study confirmed that, yes, this ad type was noticed the fastest, and by the most people. However, it was the ads to the side of the page (skyscraper ads) and within the page content (big box ads) that were viewed for the longest and received the most clicks. A November 2014 report by Google had similar findings, reporting that the most viewable ads on a page are those that are positioned just above the fold, not at the top of the page. Your action item: Don’t rule out ads that might traditionally have poor click performance. This doesn’t mean the ad isn’t seen! 3. Ad designPoor display ad design is often to blame for a poor click-through rate; if people don’t notice the ad, they won’t click it. When it comes to online display ads, images, videos, and animations are more important than what's actually being said with the text. Your action item: Invest in good ad creative. Keep ads simple, yet eye-catching. Ensure the ad features a clear call-to-action to indicate why the searcher should click on your ad so that they don’t lose interest. 4. Multiple ad exposuresMultiple relevant ads on the same page were viewed, on average, by 2.7x more participants and captured 2.8x more clicks than the individual relevant ads. Multiple ads shown several times across different pages increase in engagement the more times they're shown. The average number of clicks increased by 162% between one exposure and two, and by 39% between two exposures and three. Your action item: Consider advertising placements such as home page takeovers or run-of-site/run-of-network advertising, where multiple exposures of the same ad will be served. Retargeted ads will also likely result in multiple exposures to the same ad. When retargeted ads were presented to a searcher, they were viewed, on average, 65% faster than ads that were not retargeted. In summaryUltimately, what we've discovered through this research is that buying a \"viewable\" ad impression does not guarantee that it's going to be seen and/or clicked on, and that there are many ways you can maximize the chances of your ad being viewed. It’s critical to understand, however, that online ad success cannot be determined by views and clicks to an ad alone. The entire customer’s purchase journey must be considered, and how ads can influence behavior at different stages. Display advertising is just one part of an integrated digital campaign for most advertisers. For more tips on how to maximize display ad viewability, download the full Mediative paper for free. Let us know your thoughts and questions in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Does Ad Viewability Always Equal Views?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Does Ad Viewability Always Equal Views?"
    },
    {
      "level": "H2",
      "text": "Conducting the eye-tracking study"
    },
    {
      "level": "H2",
      "text": "What is viewability?"
    },
    {
      "level": "H2",
      "text": "Increasing viewability to increase views"
    },
    {
      "level": "H3",
      "text": "1. Ad relevancy"
    },
    {
      "level": "H4",
      "text": "Your action item:"
    },
    {
      "level": "H3",
      "text": "2. Ad type"
    },
    {
      "level": "H4",
      "text": "Your action item:"
    },
    {
      "level": "H3",
      "text": "3. Ad design"
    },
    {
      "level": "H4",
      "text": "Your action item:"
    },
    {
      "level": "H3",
      "text": "4. Multiple ad exposures"
    },
    {
      "level": "H4",
      "text": "Your action item:"
    },
    {
      "level": "H2",
      "text": "In summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Maynes\n          \n            Rebecca Maynes\n          \n            Rebecca Maynes"
}