{
  "url": "https://moz.com/blog/does-your-seo-contract-have-a-clause-limiting-your-liability",
  "slug": "does-your-seo-contract-have-a-clause-limiting-your-liability",
  "title": "Does Your SEO Consulting Contract Have a Clause Limiting Your Liability? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,...",
  "content": "Does Your SEO Consulting Contract Have a Clause Limiting Your Liability? E-Commerce SEO By: Sarah Bird August 11, 2008 Table of Contents Copied! By: Sarah Bird August 11, 2008 Does Your SEO Consulting Contract Have a Clause Limiting Your Liability? E-Commerce SEO May It Please the Mozzers, I'm continuing my series on important contract clauses for Legal Monday. Today I'm looking at Limitation of Liability provisions. A Limitation of Liability clause places a cap on the amount of money an unsatisfied client could win in Court. It is a very powerful tool to limit your risk. Important Note: Never use disclaimers of warranties, indemnifications, or limitations of liability as excuses to do bad work. It's bad business and it is unethical. Further, it is impossible to guarantee that your contract terms will be enforceable. That said, even talented, ethical SEO/Ms will have a problem client some day. When that day arises, you want to be as protected from risk as possible. Well written contracts help you reduce your risk. What is a Limitation of Liability (\"LOL\") Clause? A Limitation of Liability restricts what an unsatisfied client can get from you if there is a breach or repudiation of the consulting contract. In other words, you can put a cap on the amount of money that the unsatisfied client is entitled to receive in the event of a problem. However, LOL clauses do not protect you from liability for intentional misconduct, nor does it limit your liability to persons other than your client. Third-parties who have not signed the consulting contract are not bound by the LOL provision. Important Things To Know about Limitations of Liability Clauses LOL laws vary state by state and may not be enforceable in each state. In fact, it may even be against some states' consumer protection laws to include them in the contract. If you deal with clients from many different states, consider including language that voids the clause where it is prohibited. LOL must have at least a semblance of reasonableness; otherwise they will not be enforceable. Don't try to limit your liability to zero. Instead, pick a reasonable amount, such as the amount that the client paid you under the contract. Make all limitations of liability conspicuous, i.e., bold and in large print somewhere near the client's signature. Make sure that your LOL prevents recovery for consequential damages. Make sure that attorneys' fees are included in the limitation amount. This will encourage settling for the limitation amount. If you use sub-contractors or consultants, make sure that the LOL clause benefits employees and sub-consultants. Sample Limitation of Liability Clauses Here are a few sample Limitation of Liability clauses. They vary in sophistication, but achieve similar ends. SAMPLE ONE LIMITATION OF LIABILITY. Notwithstanding any provision to the contrary, the total liability of \"SEO Company,\" and its employees and consultants, for all losses, damages, costs, and expenses, including attorneys fees, shall not exceed the aggregate amount paid to \"SEO Company\" under this Agreement, regardless of the legal theory under which such liability is imposed. Some jurisdictions do not allow excluding or limiting implied warranties or limiting liability for incidental or consequential damages, and some jurisdictions have special statutory consumer protection provisions which may supersede the foregoing disclaimers and limitations. As a result, these disclaimers and/or limitations may not apply to you if prohibited by law. SAMPLE TWO LIMITATION OF LIABILITY. In no event shall \"SEO Company\" or its subconsultants of any tier be liable in contract, tort, strict liability, warranty or otherwise, for any special, incidental or consequential damages, such as, but not limited to, delay, disruption, loss of product, loss of anticipated profits or revenue, loss of use of the equipment or system, non-operation or increased expense of operation of other equipment or systems, cost of capital, or cost of purchase or replacement equipment systems or power. SAMPLE THREE IN NO EVENT SHALL WE, OUR EMPLOYEES, CONSULTANTS, OFFICERS OR DIRECTORS BE LIABLE FOR ANY INDIRECT, CONSEQUENTIAL, INCIDENTAL, SPECIAL, PUNITIVE OR EXEMPLARY DAMAGES, OR FOR ANY LOSS OF PROFITS OR REVENUE, REGARDLESS OF WHETHER WE KNEW OR SHOULD HAVE KNOWN OF THE POSSIBILITY OF SUCH DAMAGES, AND IN NO EVENT SHALL OUR TOTAL CUMULATIVE LIABILITY, INCLUDING ATTORNEYS' FEES, UNDER THIS AGREEMENT EXCEED THE FEES PAID TO \"SEO COMPANY.\" CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS. Although Limitation of Liability Clauses are not always enforceable, you can immediately understand how useful and important they are to include in your consulting contracts. You should never use a LOL provision as an excuse to do bad work. However, in the event that a problem with contract arises, a LOL provision will help the parties reach a fast and fair resolution. Please let me know if you have any questions or concerns about the above. Best Regards, Sarah Bird Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Does Your SEO Consulting Contract Have a Clause Limiting Your Liability?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Does Your SEO Consulting Contract Have a Clause Limiting Your Liability?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}