{
  "url": "https://moz.com/blog/domain-buyers-anonymous",
  "slug": "domain-buyers-anonymous",
  "title": "Domain Buyers Anonymous - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few of the more prominent spammers at SEOChat have come out to play in a thread on the subject of domain registration.\nGeof starts off by noting that he's recently purchased 500 new domains, all of which will probably be b...",
  "content": "Domain Buyers Anonymous Blogging By: Rand Fishkin July 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 13, 2005 Domain Buyers Anonymous Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few of the more prominent spammers at SEOChat have come out to play in a thread on the subject of domain registration. Geof starts off by noting that he's recently purchased 500 new domains, all of which will probably be blacklisted by the SEs in a matter of months. He also say that in a single day, he lost 85 domains to blacklisting by SEs. This numbers game of spam is spiralling into an expensive habit. In another blow to the hard work of page creation by white hats, EarlGrey comments that his \"mini-sites\" have only 20,000 pages on them. In the world of white-hat building, a good quality article page takes at least an hour, and even a blog entry is a minimum of 5 minutes. With content scrapers and automated content generation, however, this is no longer an issue - unless you like high quality pages. One great piece of advice comes from Geof later in the thread when he notes: Domains are cheap through registerfly. I got em for $1.25 each so it was only $625. A pricey amount but I don't have to make a lot on each site I throw up to make my money back. Those 500 domains should last me a month or two. I got tired of buying 50-100 domains each week The engineers at Google, Yahoo! & MSN must be tearing their hair out reading this... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Domain Buyers Anonymous"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Domain Buyers Anonymous"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}