{
  "url": "https://moz.com/blog/dont-be-too-clever-when-marketing-especially-in-miami-international-airport",
  "slug": "dont-be-too-clever-when-marketing-especially-in-miami-international-airport",
  "title": "Don't Be Too Clever When Marketing (especially in Miami International Airport) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Feb 17 2:00PM – In preparation for our product launch at SMX West, I came up with the idea of writing famous Google bombs on a T-shirt as a promotional giveaway. The idea was simple and funny—and, admittedly, only makes sen...",
  "content": "Don't Be Too Clever When Marketing (especially in Miami International Airport) Social Media By: Hamlet Batista March 17, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Hamlet Batista March 17, 2008 Don't Be Too Clever When Marketing (especially in Miami International Airport) Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Feb 17 2:00PM – In preparation for our product launch at SMX West, I came up with the idea of writing famous Google bombs on a T-shirt as a promotional giveaway. The idea was simple and funny—and, admittedly, only makes sense to SEOs. ;-) I picked some of the most popular Google bombs and listed them on the front of the shirt with the word “defused!!” to highlight that these link bombs are no longer working. On the back I encouraged people to try our seo software if they wanted longer lasting rankings. I think the T-shirt conveyed the message we wanted to associate with our software, that it has been designed for the long run of search engine optimization. Feb 18 3:00PM – After compiling a trimmed down list of popular Google bombs, I passed the text and concept to our marketing manager, Yerfri Martinez. It would have been easier to get the shirts made in California, but we had had such a bad experience with the shirts we had made for TechCrunch40 (they looked like crap and nobody liked them) that I decided to produce them locally in the Dominican Republic. It was a good choice because it required exploring a couple of providers before I found one that created quality shirts. Feb 22 5:00PM – The shirts were finally done, but when we called FedEx to ship them to the conference, they said we were past the 4:00PM deadline. We decided instead to fill a couple of extra suitcases with our giveaway CDs, marketing material, and T-shirts and bring them on our flight. Feb 26 9:00AM – We arrived at the airport to check in our luggage. Two suitcases were over the weight limit; my personal suitcase had some extra space, so we moved some of the shirts in there and paid extra for just one overage (we really are cheap in the Dominican Republic :-)). So far so good. Feb 26 11:00AM – Miami International Airport. We followed the usual path, promised to behave well while in US territory and wound our way all the way to customs. This is where trouble begins… When I had filled out the custom forms I declared the commercial merchandise, which put us in a separate line to be inspected. Luis Jimenez, one of the employees traveling with me, was carrying one of the suitcases with the shirts. I had additional shirts in my bag and a young and very nice woman inspected my luggage. She saw the shirts and didn’t complain. Luis, meanwhile, was less lucky. The guy inspecting his bag saw the shirts and read the words “Bomb,” “Satan,” “Miserable Failure,” and the link to the White House. I have never seen anyone raise his eyebrows so high (he probably practices that a lot). He ran to his supervisor, whispered something in his ear, and out came a man with a very angry and disturbed look. He demanded to know what this was all about, and Luis, thinking on his feet perhaps, said he was just an employee and pointed to me… Supervisor: “Sir, can you explain this to me? Where are you coming from? Who is your sponsor?” Me: “Sir…we are going to a search marketing conference. This is a joke that we (search marketers) understand…” Supervisor: “This might be a joke to you, but it is definitely not a joke to me.” Me: “Sir, you can look up ‘Google bomb’ in Google and you will understand. This is for viral marketing purposes.” Supervisor: “Allow me a moment.” He retired to the corner and argued with several peers about it. Me: [Waiting. My connecting flight was is in 30 minutes. Things aren’t looking good.] Feb 26 12:30PM – The supervisor took me to a closed room for further interrogation. He asked me to insert the promotional CDs we brought into my computer to confirm that they are actually installation programs for my software. I kept explaining, but he wouldn’t listen. Fortunately, he left me with another inspector that appeared a bit more relaxed. I don’t know if it was because he was Hispanic, too, but he calmly asked me to explain the situation. “Listen,” I said, “a Google bomb is created when a bunch guys agree to link to a site with a funny or ridiculous phrase. Those are all examples of Google bombs that no longer work because Google fixed the problem. You see at the top it clearly says DEFUSED!” He broke into a smile, and went running to his boss. Everything having been explained to him, the supervisor returned far more calm and understanding. He told me that the shirts said exactly the opposite of what he was thinking. He never apologized, but at least I was off the hook, and for that I was very glad. Feb 26 6:00PM – We missed our connecting flight and arrived in San Jose two hours later than we were supposed to. Fortunately, all the trouble was worth it because we ran out of our shirts very fast. The people that came to our booth at SMX West loved them! I guess next time I will have to be a little bit less clever—or just avoid Miami International Airport altogether. :-) Anyone interested in trying our own Google bomb? “Innocent mistake” and link to HamletBatista.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Don't Be Too Clever When Marketing (especially in Miami International Airport)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Don't Be Too Clever When Marketing (especially in Miami International Airport)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Hamlet Batista\n          \n            Hamlet Batista"
}