{
  "url": "https://moz.com/blog/dont-count-on-search-traffic-in-your-ten-year-plan",
  "slug": "dont-count-on-search-traffic-in-your-ten-year-plan",
  "title": "Don't Count on Search Traffic in Your Ten Year Plan - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I see powerful things in Digg, Slashdot, Stumbleupon, Delicious, Wikipedia, forums of all types, and other sites that attract people because of a common interest or activity.  These sites are \"communities\" of visitors or authors.  These sites drive massive traffic in a short blast or massive…",
  "content": "Don't Count on Search Traffic in Your Ten Year Plan Moz News E By: EGOL May 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL May 23, 2006 Don't Count on Search Traffic in Your Ten Year Plan Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I see powerful things in Digg, Slashdot, Stumbleupon, Delicious, Wikipedia, forums of all types, and other sites that attract people because of a common interest or activity. These sites are \"communities\" of visitors or authors. These sites drive massive traffic in a short blast or massive traffic that is cumulative over time.My guess is that these highly popular websites will grow in number - and these activities will start cutting into search volume simply because they consume a person's time spent online. Furthermore, at the present time, how many people now go to Wikipedia instead of searching, how many go to forums and ask a question rather than searching? Or maybe they simply use the search utility at Wiki or their forum? Information search has some real competition here.Retail search has some strong competition too. Once people locate a nice website that sells what they want at good prices perhaps they just go straight to that site instead of searching. Sites like amazon and newegg - once you buy from them and have gotten a good deal you go there and use the site search instead of Google or MSN or Yahoo!. Maybe you will use a price comparison site instead of search. Value and trust become strong magnets - so who needs search once you have found comfort?But one of the more important variables is \"frustration\". How many times will a person search for something and get turned off by spam until they simply to a navigational search by typing WalMart into the query box?Offline media is also undercutting retail search. Print catalogs now are just lures to online retail sites, TV ads now seem to be driving you to a website instead of your phone or a store downtown. If the URLs where you can buy what you want are already loaded in your head - why search?I don't have any data to verify the above - this is simply a call from logic and reason - maybe I am totally wrong. But I think that search engines are in their heyday right now. Even if I am 100% wrong, getting top position in the SERPs is going to be an awful lot harder because the number of websites is expanding rapidly and the good ones are locking down turf. Competition is going to be insane ten years out. With all of this happening, what should a webmaster be doing today so that he/she is still prospering ten years down the road? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Don't Count on Search Traffic in Your Ten Year Plan"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Don't Count on Search Traffic in Your Ten Year Plan"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}