{
  "url": "https://moz.com/blog/dont-use-yahoo-to-search-your-own-site",
  "slug": "dont-use-yahoo-to-search-your-own-site",
  "title": "Don't Use Yahoo to Search Your Own Site - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During the week – I was going over various sphinns, when I came across Goats Apples and Link building – I like inventive headlines, so I went ahead to read the story  – and came across this SEOmoz comment referenced in the post:“I knew the reciprocal linking we were doing was over kill and done…",
  "content": "Don't Use Yahoo to Search Your Own Site Search Engines By: Rishi Lakhani January 3, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani January 3, 2008 Don't Use Yahoo to Search Your Own Site Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I was going over various sphinns when I came across Goats Apples and Link building – I like inventive headlines, so I went ahead to read the story – and came across this SEOmoz comment referenced in the post: “I knew the reciprocal linking we were doing was over kill and done only to improve our rankings. I did not see any real benefit to my visitors... The problem I have is that a bunch of my competitors... are still getting away with it.” Unfortunately, the exact link to the comment wasn’t referenced, and being the nosy git I am, I decided to look for it. With surprising results. My first step was to select a unique set of words in a sequence: “over kill done only improve our rankings” I then plugged these into the SEOmoz site search facility powered by Yahoo!, with these results. Yep, that’s right – not only wasn’t the comment anywhere, the whole darn post wasn’t in the SERP’s. So, what next? Scoot over to the big G. Not only did I get the entry as the first result, but with the added benefit of the highlighted element in the cached version of the page, I found the exact comment without much difficulty. It's kind of obvious which SE produced the better results. In my opinion, there would be no better argument for using the Google site search facility as opposed to Yahoo’s, regardless of what any satisfaction survey says. And one of the main points to remember is that the Yahoo test was carried out by using the default setting of only searching for information within SEOmoz, while the Google search was across the web. Funnily enough, searching part of the title (How to Handle a Google Penalty - And, an Example from the) of the actual post in Yahoo across the web pulled up the Search Engine Watch mention of it. The actual article wasn’t in the first 50 results (after which I got bored of looking for it). Search in Google – hey, Presto! No.1. Maybe Yahoo isnt just good with long tail searches. Or maybe it's just, well, you know. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Don't Use Yahoo to Search Your Own Site"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Don't Use Yahoo to Search Your Own Site"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}