{
  "url": "https://moz.com/blog/dont-just-manage-your-reputation-improve-it",
  "slug": "dont-just-manage-your-reputation-improve-it",
  "title": "Don't Just Manage Your Reputation—Improve it - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the rise of reviews in local search, it's become impossible for businesses to hide from their reputation. The key to rising to the top isn't to just manage your reputation—you need to develop and improve it.",
  "content": "Don't Just Manage Your Reputation—Improve it Local SEO | Reputation Management By: Mary Bowling January 4, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mary Bowling January 4, 2016 Don't Just Manage Your Reputation—Improve it Local SEO | Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In ranking businesses in the local search results, Google's goal has always been to model the real world. It aims to reward the companies that are the most popular and prominent within their own market areas — those that are the most highly regarded by their customers, considered to among the best at what they do and that people generally patronize, talk well about and recommend to their friends. Those are the local businesses that Google wants to show in its local search results.That’s what searchers want to see in their results, too! After all, no one wants to get awful or even so-so service if they can choose to use a business that has a history of making its customers very happy, instead. Whether people think you’re doing a stellar job or a stinky one, there’s no way to hide from your reputation anymore. Prospective buyers can now see the collective history of a business’s ability to keep its customers happy 24 hours a day via online reviews. Why are reviews so important?Depending on which survey you see, somewhere between 75% and 90% of consumers read online reviews when considering a purchase. A slightly smaller number of us trust online reviews as much as we trust recommendations made by people that we know.While it may at first sound a little crazy, that trust is developed via our ability to read multiple opinions on a variety of websites made by a diverse group of people with differing standards and tastes. Then, while considering the public’s overall opinion of a business, we take into consideration the factors that are most important to us.For example, a light sleeper may be more concerned about the noisiness of a hotel than they are about whether it offers a hot breakfast or a clean pool, and a traveler with an early flight may be looking at guests’ opinions of the reliability of a hotel’s airport shuttle service more than at any other amenity.Moving beyond reputation managementMarketers have long used the term reputation management to refer to a company’s efforts to impact what prospective customers see about them online. Here’s Wikipedia’s definition of that term:The practice of managing one’s online reputation has mainly consisted of getting more good reviews to help drown out the poor ones, owning the first page of the SERPs for brand name searches, and using the ability to respond to reviews on many sites as a method of damage control.However, in 2015 and beyond, we need to think less about reacting appropriately to poor opinions and trying to reduce the visibility of bad online reviews. We need to concentrate on reputation development, instead.Developing a better reputationIn the past, it wasn't hard to for a small business to survive and perhaps even thrive while providing poor to mediocre products and services. If there was enough foot traffic to a shop or office or store, or if it was in a good location, or if it did enough advertising in the places people used to find that type of business, new people would keep coming in the doors and buying from it — despite how bad it might actually be. While its customers might share their experiences with the people in their social circles, those circles were relatively small and word of mouth didn't travel very far unless extraordinary measures were taken.However, in the age of the Internet, a business can no longer hide from its customers' opinions. We’re connected to each other online in ways that were not possible in the past. Most consumers have at least one mobile device with them at all times. We have our smartphones in our pockets and purses. They lie next to us while we sleep. We use them while we’re driving to be entertained and educated. We use them to communicate, get directions, and gather information, and we use them to find businesses to patronize and to learn about the experiences others have had there. People can read others’ opinions of local enterprises just about anytime and anywhere.Reviews as a ranking factorIn the first years of local search, reviews weren’t much of a ranking factor. That changed in 2009 when Yelp rejected acquisition by Google. The search giant then made reviews a significant ranking factor in the local algorithm in order to incentivize small businesses to encourage more online reviews at Google.We quickly suffered a plague of fake reviews and Google then had to take steps to reduce them. Among its tactics were the reduced impact of reviews on rankings, the development of a Yelp-like reviewer algorithm, and the requirement by Google+ to have a legitimate-looking profile in order to leave a review.In 2015, reviews still have an impact on ranking in Google Maps and the local pack results, but the crowd-sourced opinion of local search practitioners pegs it at less than 9%. We can still get rating stars showing in some of the SERPs once we have 5–6 Google reviews, and it’s generally believed that 10 reviews left at Google provides a little bit of a ranking boost. Google may also be trying to incorporate review sentiment into its ranking algorithms. If and when this becomes a reality, Google will have come quite close to its goal of modeling the real world. Beyond reviews as a ranking factorWhile you should definitely take advantage of these features, we really need to look beyond rankings for motivation for getting reviews. Instead, we need to think about getting more and more good reviews over time in order to develop our reputation, rather than just managing it.The newish Local Finder results shown below give users the opportunity to sort the results they see by ratings in some verticals. I anticipate that more industries will get this feature in the future, allowing us to choose just how good a local business must be before we’ll consider patronizing it. So, ranking well probably won’t do much for your enterprise unless those rankings are accompanied by ratings that are average (3 stars) at the very least.People are also learning to search in better ways and many of them are asking to see the \"best of something,\" rather than just \"something.\" No one wants to go to an average or below-average oral surgeon, for example. If I need a root canal, I want the best dentist that I can find in my area to operate on me. And if I can’t find a good one in my town, I’ll likely be willing to travel elsewhere to be seen by a specialist that nearly everyone raves about.Understanding Net Promoter ScoreA company’s Net Promoter Score® is an easy way to determine how your reputation is developing over time. Customers are asked a single question: How likely is it that you would recommend [brand] to a friend or colleague? A score is then calculated using a simple formula.If the NPS increases over time, the company is doing a good job of keeping its customers satisfied, which is reflected in the body of online reviews about it and in the steady overall growth of the business.While you may or may not wish to use Net Promoter Score® to assist you in improving your business, the idea behind it is a solid one. Actively ask for feedback from all of your customers. Then act on what you learn to constantly improve your products and services.Refining the process allows you to quickly respond those who have complaints or concerns and to make things right before they get a chance to criticize you in public, while those who are happy with you can be encouraged to tell others about their experience, both on- and offline.Contrary to what some business owners believe, most customers are not anxious to leave bad reviews. People tend to leave reviews only when their experience is exceptionally good or exceptionally bad. Mitigating bad experiences by sincerely asking for feedback and doing what’s needed to immediately make the customer happy is a fairly clear path to getting more good reviews and fewer bad reviews online.Fixing problems takes more than talk It’s easy to find examples that demonstrate how a business’ refusal to correct deficiencies when they’re brought to the staff’s attention can result in scathing reviews. It’s obviously much better to listen and correct a problem than it is to keep writing apologies for bad service. The hotel referred to in the examples below has dozens of reviews similar to this one commenting on poor experiences with its housekeeping department.And the manager keeps writing insincere apologies that do nothing to reassure readers that the problem has been corrected.A serious commitment to a cycle of continuous improvement based on customer feedback is what it takes to be one of the best businesses of its type in your area. This type of strategy will bring in more and more new customers over time and encourage past customers to return.Google’s local algorithms have improved exponentially since 2004. Google wants to reward us online for being prominent and popular in the offline world, so we have to make sure our companies shine. Businesses that are unwilling to do so are doomed to a slow death because there’s no longer anywhere to hide from a bad reputation.Best practices for reputation developmentGet company-wide buy-in.Everyone within the organization must be committed to asking for feedback from customers and sincerely listening for areas that can and should be improved. This needs to start at the top and flow through the entire organization. Always keep in mind that you have asked for ways to improve your business, so even the happiest customers are very likely to make suggestions. Take this as a positive, not a negative.Problems should be identified and mitigated as soon after the customer has experience with the business as possible.Ideally, that’s before the person leaves the business location or before the service provider leaves the location where work was performed. This is your best opportunity to learn from your customers and to delight them.Provide a way for customers to complain right on your company’s website.Even at the most conscientious businesses, people can have less-than-ideal experiences and sometimes people just need to vent, so give them a place to communicate with you away from the public eye. Closely monitor your on-site complaints and respond immediately.Contact the customer soon after their visit with you to thank them and ask about their experience.While a phone call is sometimes in order (such as with an oral surgeon checking up on a patient), in most cases, an email works fine. Send it out within a few days after the interaction asking about their experience and asking for suggestions on how it can be improved. Even those thrilled with their experience may have good ideas for your consideration.Provide an appropriate response to the customer’s comments.Address both their praise and concerns and thank them for helping you to improve your business.Politely ask happy customers if you can use their comments or your website and if you can also include their name and photo.Also suggest that they can help you and others by commenting on their positive experiences at popular online review sites. Provide links to your listing on several popular review sites to make it easy for them to do so.Honestly address the concerns of those who had negative experiences.Offer what you can to make it right and tell them what you plan to do to prevent it from happening again.Take suggestions to heart.Enthusiastically do what you can to continuously improve your business to satisfy the needs and wants of your clientele. In this way, you’ll always be improving your online and offline reputation and growing your business.ResourcesGoogle My Business Help Forum – Google provides review monitoring and responses via its Google My Business dashboard.Moz Local provides a foundational education in online review development.60+ Questions to Troubleshoot and Fix Your Local Reviews StrategyHow to Know If Your Local Reviews Strategy Works – Both of these articles from Phil Rosek will help you to understand and implement successful strategies for developing the online reputation of your local business.Review Handout Generator from Whitespark provides us with an easy way to create handouts to encourage more reviews from happy customers.How to Do Review Audits That Turn Clients’ Worst Reviews Into Actionable Solutions – Miriam Ellis schools us on providing the tough love businesses often need to help them get their online reputation cleaned up quickly and effectively.How to Conduct an Online Patient Review Audit – Incredible Marketing’s advice on review audits for medical practitioners.GetFiveStars – A customizable platform that helps you to easily monitor, share and respond to reviews. Free trial.Review Trackers – An all-in-one dashboard for keeping an eye on reviews about you across the web. Provides multi-location monitoring and the ability to respond quickly to reviews. Demo and free trial.ReviewPush – A review request, monitoring, and reporting tool. Free trial. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Don't Just Manage Your Reputation—Improve it"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Don't Just Manage Your Reputation—Improve it"
    },
    {
      "level": "H2",
      "text": "Why are reviews so important?"
    },
    {
      "level": "H2",
      "text": "Moving beyond reputation management"
    },
    {
      "level": "H2",
      "text": "Developing a better reputation"
    },
    {
      "level": "H2",
      "text": "Reviews as a ranking factor"
    },
    {
      "level": "H2",
      "text": "Beyond reviews as a ranking factor"
    },
    {
      "level": "H2",
      "text": "Understanding Net Promoter Score"
    },
    {
      "level": "H2",
      "text": "Fixing problems takes more than talk"
    },
    {
      "level": "H2",
      "text": "Best practices for reputation development"
    },
    {
      "level": "H2",
      "text": "Resources"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mary Bowling\n          \n            Mary Bowling"
}