{
  "url": "https://moz.com/blog/dont-ask-sites-for-links-find-people-and-connect",
  "slug": "dont-ask-sites-for-links-find-people-and-connect",
  "title": "Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many of us trained in the ways of classical SEO are familiar with the link building process:Step 1: Find relevant sites from which to get a link.Step 2: Search for contact information (email or phone number).Step 3: Get in touch and find a w...",
  "content": "Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect. Link Building By: Rand Fishkin May 31, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 31, 2011 Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect. Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Many of us trained in the ways of classical SEO are familiar with the link building process:Step 1: Find relevant sites from which to get a link.Step 2: Search for contact information (email or phone number).Step 3: Get in touch and find a way to make the link happen (sell them on great content, do a trade in-kind, plant a seed and hope, etc.)If you've ever done this (for the first 2 years of my SEO career, it's practically all I did), you know how much it sucks. Conversion rates are low. Time/link is high. The ROI is there, but it's a painful, boring, awkward slog.I've got some good news. There's a better way.Try this instead:Step 1: Find relevant human beings (bloggers, journalists, forum participants, members of online communities, active social networkers, people in media, PR, or simply the well-connected).Step 2: Follow their contributions to the web world and engage (in blog comments, over Twitter, via LinkedIn, through Q+A sites and forums, or directly over email). Ask for nothing.Step 3: Build something highly relevant and useful to them. If you've truly built that connection and gotten to \"know them,\" even if it's just virtually, you will know what they need/want/will appreciate.Step 4: Let them know about it. This can be over Twitter, Facebook, LinkedIn, email, in a blog comment, or whatever medium makes sense.There's huge advantages to this method, including:More Scalable Link Building: Content plays can approach dozens of folks who may influence, write for or control multiple properties leading to a much higher ROI for each successful contact.People Like People: People who answer webmaster@somesite.com don't particularly like link requests.Authenticity: Rather than simply begging for a link to help your SEO, you're actually forming connections that can help with every form of marketing - greater brand awareness, attention from influencers, social sharing, etc.Future Proof: No matter what signals engines evolve to measure or what forms of discovery become popular, your work carries value. If Facebook sharing takes over the web, it's not a problem because that's how people will share your links. If some new platform wins, you can rest assured that your content will make its way there.Better Web Content: Since you're producing material that fill a need, you're helping to make the web a better place - there's nothing more deserving of a link or rankings than that.Admittedly, the hardest part is Step 1: \"Finding the Right People.\" Allow Google to assist:Pictured above is a Google \"profile\" search. You can search Google's public user profiles with search query strings like this http://www.google.com/search?q=travel+blogger&tbs=prfl:e or by appending &tbs=prfl:e onto any search URL.It's also easy to use tools like FollowerWonk and LinkedIn Search to supplement these results. Armed with these tools and this process, I'm bullish that any SEO with the passion to invest time and the freedom to build quality resources can earn great links, mentions and social metrics from real people across the web.Good luck out there link builders. I'll have my fingers crossed that this process can reduce friction and pain for people on both sides of the link equation. If you've got any additional recommendations, tools or methods to share, feel free to do so in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Head Smacking Tip #20: Don't Ask Sites for Links. Find People and Connect."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}