{
  "url": "https://moz.com/blog/dont-forget-to-optimize-for-images-including-pdfs",
  "slug": "dont-forget-to-optimize-for-images-including-pdfs",
  "title": "Don't Forget to Optimize for Images (Including PDFs) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my last YouMoz entry, I wrote about the use of definition syntax in traffic generation. I expained why one of the pages on my website was garnering so much additional traffic when compared to other pages. We found that a good deal of web searchers were still using the \"define:\" sy...",
  "content": "Don't Forget to Optimize for Images (Including PDFs) SEO Tools E By: Eric Bryant November 4, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! E By: Eric Bryant November 4, 2008 Don't Forget to Optimize for Images (Including PDFs) SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In my last YOUmoz entry, I wrote about the use of definition syntax in traffic generation. I explained why one of the pages on my website was garnering so much additional traffic when compared to other pages. We found that a good deal of web searchers were still using the \"define:\" syntax in routine searches. As a result, pages consisting of dictionary-styled definitions of terms - even in a niche market (or perhaps especially so) - can generate significant traffic by virtue of Google's \"define:\" search retrieval protocol. Images Can Bring Traffic, Too Lately I've been noticing a new high-traffic page on my website. After a really informative QA session, I discovered the search terms people were typing in to land them on my site. This was difficult to determine because the route the searcher took from search bar to site, as it were, wasn't very clear. In my StatCounter stats I kept seeing this URL as a referrer site: http://images.google.com/imgres?imgurl=http://www.gnosisarts.com/images/sample-resume.gif&imgrefurl=http://writing.gnosisarts.com/&h=1490&w=1108&sz=291&hl=en&start=74&um=1&usg=__EdkOllceLuIcRUQq655trzlgcDI=&tbnid=6L9gm_y8xrazLM:&tbnh=150&tbnw=112&prev=/im Unwieldy, to say the least. Confusing, at best. And it doesn't give a clue as to the search term typed in. It turns out that searchers were typing in \"curriculum vitae samples\" or \"curriculum vitae example\". This was taking them to the Google image repository of images for that term. And my site is listed in the bunch (I have a GIF image of a sample CV on my website). So, a good portion of the searchers were clicking on the GIF file and proceeding to the above URL (which is recorded in StatCounter, not the term that brought the searcher to the URL). ALT IMG Attributes and PDF Object Element Data The moral in all this: Don't forget to optimize for images. Though it may be tedious or boring, don't forget to put some thought into writing ALT IMG SRC attribute text. Even though I didn't know that this particular image would bring traffic, nor could I figure out on my own that this image was responsible for bringing the extra traffic, I did perform some optimization on the image a long time ago. And don't forget PDF optimization! Mozilla has some decent PDF adds-ons that enable you to complete the PDF-Object metadata, place links inside PDFs which did not previously have them, and other SEO goodies. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Don't Forget to Optimize for Images (Including PDFs)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Don't Forget to Optimize for Images (Including PDFs)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Bryant\n          \n            Eric Bryant\n          \n            Eric Bryant"
}