{
  "url": "https://moz.com/blog/dos-and-donts-bad-link-building-and-useful-alternatives",
  "slug": "dos-and-donts-bad-link-building-and-useful-alternatives",
  "title": "Dos and Don'ts - Bad Link Building And Useful Alternatives - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "High-value links and a successful link profiles are still important topics in the world of SEO. Although “Content is King” links are still counting for SEO too. However, it is now important to avoid negative links instead of building more and more new ones.",
  "content": "Dos and Don'ts - Bad Link Building And Useful Alternatives Link Building By: Daniel Herndler April 8, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Daniel Herndler April 8, 2013 Dos and Don'ts - Bad Link Building And Useful Alternatives Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Success-oriented link building: Should I use this or not? High-value links and a successful link profiles are still important topics in the world of SEO. Although “Content is King” links are still counting for SEO too. However, it is now important to avoid negative links instead of building more and more new ones. Of course everyone wants to have the best links to their websites: \" 'DoFollow' content links of PageRank 7+ domains with lots of traffic and ranking boost. Please give me thousands of it!\" But is it true that these links are really the best? And what techniques still have positive effects for my ranking in search results? Much easier to tell is which link building techniques do have a negative impact on SEO. In fact there is a large amount of information and reports because of all those penalties since the latest Panda and so on. Recent talk of the town: The \"Anchor Text\" The SEOmoz Whiteboard of Friday February 8th dealt with this subject. Cyrus Shepard, SEO consultant and web strategist, approached the issue from several sides and comes up with clear results as the anchor text has a large influence on our link profile. After listening to Cyrus I asked if I should stop doing link building in services in which I can place as much links as I like to by my one, like flickr.com, and if they still do impact my rankings in a positive way. The answer was as short as clearly: As Cyrus Shepard explains in his tweet, you have to handle them like all the other optimizations and techniques: DO NOT ABUSE! Nine techniques you should avoid and alternatives in link building: Now I'd like to present you some common link building techniques which you should avoid and better use the alternatives given below. Keyword-anchor-text-only links: Do not use the site or the name of the company by their own. Do not use the word \"website\" or “link” as anchor text. Avoid URLs as a link anchor. Do not use domains by their own. Alternative: Create a mix of brand and keyword and constantly varying your anchor text links for the same, whether internal or external. For example: Try to use \"Wellness at the 5-star Hilton Hotel in New York City\" instead of \"Hilton Hotel\" or \"Wellness\". Pratik Dholakiya, director of SEO & VP of Marketing at E2M Solutins, wrote about the changes of Google's Penguin and bad issues of exact match keyword anchor texts a few weeks ago. Social profile links Do not create thousands of social profiles for quickly and easily generating links to your websites. Alternative: Focus on a handful of selected services and use them actively. Feed them with links and content concerning your topic. Those profiles are only relevant for search engines if they are used actively. If your content goes viral, those links are awesome traffic sources. Social signals like the amount of followers on Twitter, Facebook and Google+ are important ranking factor nowadays. But if you don't use your profiles for conversation and social activities to get those social signals, you just have them linking to your website or blog with an exact match domain anchor text which is not worth it. Social Bookmarks Avoid quickly and simple placed links in social bookmarks. Alternative: Use only a few top social bookmarks with niche topics and feed them with fresh content. In fact anyone can create links in common social bookmarks which can as well lead to a \"Bad Neighborhood\". If you do not know what \"Bad Neighborhood\" means: By finding your links close to thematically inappropriate and bad scored ones search engines will think yours have to be a “black sheep” too. Photo via Flickr under CC By license. A followed link is better than rel=\"nofollow\" – Really? Attempt to not only generate \"dofollow\" links and do not ignore the \"nofollow\" ones. Alternative: A natural link profile means a good mix of \"dofollow\" and \"nofollow\" links. Mixing them gives more value to your website. A good link is measured by its traffic and not by its relationship. It’s the same as for anchor texts which benefits from a natural variation too. As Bruce Clay, luminary of SEO and Internet Marketing at Bruce Clay, Inc., mentioned at his SEO workshop during the SMX West 2013, the rel=\"nofollow\" tag is just used by SEOs because other webmasters don't care about their link juice and power like SEOs do. Most of the time they don't know its benefits and how to use it. In fact most of them don't even know that it exists at all and so they won't ever use it, which is highly natural. So if you get links tagged with \"nofollow\" for search engines it does not mean that they are not relevant for your website. Just keep in mind that it is not natural to be \"the Brain\" without being a little bit of \"Pinky\". Blogrolls & footer links: Avoid internal and external linking in the footer area of your website and do not use a blogroll at your sidebar for example, if you want to score them as important. Alternative: Place links in the content of your website or blog to score them as relevant for search engines and users. Links are devalued by a webmaster himself if they are placed in the footer because they are almost hidden for users. And so Google does too. This does not mean that you should never place links on positions like that, but the number of links is highly important. Hundreds of links in your footer or blog roll area can harm your website in Google's search results. Commenting on blog posts: Do not place any links in the text of the comment, unless it is absolutely necessary. Avoid short and irrelevant comments like \"Great article!\" or \"Thank you for posting this!\". Do not write off topic by not talking about the article itself. Alternative: Just put your URL or domain into the website field of the comment form and write long and detailed opinions on products or content by using certain keywords. Communicate with the author himself - only commenting once is no longer enough! You can also link to your Google+ profile for increasing your \"Author Rank\". Trading and exchanging links with other webmasters: Avoid exchanging links with thematically inappropriate websites of webmaster you do not know. (Although he is asking in a very, very polite way!) Alternative: Build links to relevant and related sites on a special resource page of your own website. A link exchange with thematically inappropriate and irrelevant website will be scored badly for both of you! (I guess I don't have to mention that you should never spend time and money on trading or selling links for increasing your traffic and rankings.) Less moderated and immediate confirmed links of public directories: Very short forms are too small for putting enough information and data in it. Avoid directories with very general subjects. Confirmations after short or even no reviews could lead to bad neighborhood as already mentioned. Alternative: Use \"human-edited\" directories with similar topics to your website. Even if you have to submit links several times until they are adopted it is much better for a thematic link profile. SEOmoz prepared a useful web directory list for easily finding services to places your website on. Use descriptions for your links which are riddled with keywords and good to read for users attention. Using article directories by posting self-written content Do not create content for other websites which requires a lot of time and work. You are helping others more than yourself. Alternative: Invest your time and texts in your own blog or related ones with appropriate topics you know already. If you are generating content for other websites be sure that they will be recognized by a lot of traffic. In case you really want to use article directories, add your texts into special first checked niche article directories. Never donate your content to sites you don’t know! Five tips to smooth the way to a high-value link profile: Do competitor researches periodically to find new link sources. Don’t be shy for linking out – Don’t be a hoard and refer to thematically appropriate websites in your content by NOT using rel=\"nofollow\" tags. Just be natural! Use your anchor texts correctly combining keywords with your brands. It's the mix! Create a resource or link page to refer to related websites you know already. Be active and up to date in selected social bookmarks to create a good impact for search engines and to build communities. I welcome your opinions, suggestions and of course your contact on Google+ and Twitter! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Dos and Don'ts - Bad Link Building And Useful Alternatives"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Dos and Don'ts - Bad Link Building And Useful Alternatives"
    },
    {
      "level": "H2",
      "text": "Success-oriented link building: Should I use this or not?"
    },
    {
      "level": "H3",
      "text": "Recent talk of the town: The \"Anchor Text\""
    },
    {
      "level": "H2",
      "text": "Nine techniques you should avoid and alternatives in link building:"
    },
    {
      "level": "H3",
      "text": "Keyword-anchor-text-only links:"
    },
    {
      "level": "H3",
      "text": "Social profile links"
    },
    {
      "level": "H3",
      "text": "Social Bookmarks"
    },
    {
      "level": "H3",
      "text": "A followed link is better than rel=\"nofollow\" – Really?"
    },
    {
      "level": "H3",
      "text": "Blogrolls & footer links:"
    },
    {
      "level": "H3",
      "text": "Commenting on blog posts:"
    },
    {
      "level": "H3",
      "text": "Trading and exchanging links with other webmasters:"
    },
    {
      "level": "H3",
      "text": "Less moderated and immediate confirmed links of public directories:"
    },
    {
      "level": "H3",
      "text": "Using article directories by posting self-written content"
    },
    {
      "level": "H2",
      "text": "Five tips to smooth the way to a high-value link profile:"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Herndler\n          \n            Daniel Herndler\n          \n            Daniel Herndler"
}