{
  "url": "https://moz.com/blog/doubled-conversions-leads-case-study",
  "slug": "doubled-conversions-leads-case-study",
  "title": "How We More than Doubled Conversions & Leads for a New ICO [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Smart CRO and understanding your audience can go a long way toward meeting your goals. See how one team doubled conversions, leads, and sales for a company's initial coin offering (ICO).",
  "content": "How We More than Doubled Conversions & Leads for a New ICO [Case Study] Conversion Rate Optimization (CRO) J By: Jasper Kuria September 5, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jasper Kuria September 5, 2018 How We More than Doubled Conversions & Leads for a New ICO [Case Study] Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SummaryWe helped Repux generate 253% more leads, nearly 100% more token sales and millions of dollars in incremental revenue during their initial coin offering (ICO) by using our CRO expertise.The optimized site also helped them get meetings with some of the biggest names in the venture capital community — a big feat for a Poland-based team without the pedigree typically required (no MIT, Stanford, Ivy League, Google, Facebook, Amazon, Microsoft background).The details:Repux is a marketplace that lets small and medium businesses sell anonymized data to developers. The developers use the data to build “artificially intelligent” apps, which they then sell back to businesses. Business owners and managers use the apps to make better business decisions.Below is the original page, which linked to a dense whitepaper. We don’t know who decided that an ICO requires a long, dry whitepaper, but this seems to be the norm!This page above suffers from several issues:The headline is pretty meaningless (“Decentralized Data & Applications Protocol for SMEs). Remember, as David Ogilvy noted, 90% of the success of an ad (in our case, a landing page) is determined by the headline. Visitors quickly scan the headline and if it doesn’t hold their interest, bounce immediately. With so much content on the web, attention is scarce — the average time spent on a page is a few seconds and the average bounce rate is about 85%.The call to action is “Get Whitelisted,” which is also meaningless. What's in it for me? Why should I want to “Get Whitelisted”?A lack of urgency to act. There is a compelling reason to do so, but it was not being clearly articulated (\"Get 50% OFF on the tokens if you buy before a certain date.\")Lack of “evidentials”: Evidentials are elements that lend credibility or reduce anxiety and include things like mentions in trusted publications, well-known investors or advisors, industry seals, association affiliations, specific numbers (e.g. 99% Net Promoter Score), and so on.Too much jargon and arcane technical language: Our research using Mouseflow’s on-page feedback feature showed that the non-accredited-investor ICO audience isn’t sophisticated. They typically reside outside of the US and have a limited command of English. Most are younger men (18–35) who made money from speculative activities on the Internet (affiliate marketing, Adsense arbitrage, and of course other crypto-currencies). When we surveyed them, many did not initially understand the concept. In our winning page (below), we dumbed down things a lot!Below is the new page that produced a 253% gain in leads (email opt-ins). Coupled with the email follow-up sequence shown below, it produced a nearly 100% gain in token sales.Winning page (above the fold):Here are few of the elements that we believe made a difference:Much clearer headline (which we improved upon further in a subsequent treatment).Simple explanation of what the company is doingUrgency to buy now — get 50% off on tokens if you buy before the countdown timer expiresSolicited and used press mentionsSocial proof from the Economist; tapping a meme can be powerful as it's always easier to swim downstream than upstream. “Data is the new oil” is a current meme.More persuasive elements (below the fold):In the second span (the next screenful below the fold) we added a few more persuasive elements.For one, we highlighted key Repux accomplishments and included bios of two advisors who are well known in the crypto-community.Having a working platform was an important differentiator because only one in 10 ICOs had a working product. Most launched with just a whitepaper!A survey of the token buyers showed that mentioning well-known advisors worked — several respondents said it was the decisive factor in persuading them to buy. Before, the advisors were buried in a little-visited page. We featured them more prominently.Interestingly, this seemed to cut both ways. One of the non-contributors said he was initially interested because of a certain advisor’s involvement. He later chose not to contribute because he felt this advisor’s other flagship project had been mismanaged!We also used 3 concrete examples to show how the marketplace functions and how the tokens would be used:When your product is highly abstract and technical, using concrete examples aids understanding. We also found this to be true when pitching to professional investors. They often asked, “Can you give me an example of how this would work in the real world?”We like long-form pages because unlike a live selling situation, there's no opportunity for a back-and-forth conversation. The page must therefore overcorrect and address every objection a web visitor might have.Lastly, we explained why Repux is likely to succeed. We quoted Victor Hugo for good measure, to create an air of inevitability:How much impact did Victor Hugo have? I don’t know, but the page did much better overall. Our experience shows that radical redesigns (that change many page elements at the same time) produce higher conversion lifts. Once you attain a large lift, if you like, you can then do isolation testing of specific variables to determine how much each change contributed.13% lift: Simplified alternate pageThe page below led to a further 13% lift.The key elements we changed were:Simplified the headline even further: “Repux Monetizes Data from Millions of Small Enterprises.” What was previously the headline is now stated in the bullet points.Added a “5 Reasons Why Repux is Likely to Succeed” section: When you number things, visitors are more likely to engage with the content. They may not read all the text but will at least skim over the numbered sub-headlines to learn what all the points are — just like power abhors a vacuum, the mind can’t seem to stand incompleteness!We’ve seen this in Mouseflow heatmaps. You can do this test yourself: List a bunch of bullet points versus a numbered list and with a compelling headline: The 7 Reasons Why 20,0000 Doctors Recommend Product X or The 3 Key Things You Need to Know to Make an Informed Decision.Follow-up email sequenceWe also created a follow-up email sequence for Repux that led to more token sales. As you can see, the average open rate is north of 40%, and the goal attained (token sales) is above 8%. According to Mailchimp, the average email marketing campaign open rate is about 20%, while the average CTR is about 3%. We got more sales than most people get clicks. Here’s a link to three sample emails we sent.Our emails are effective because:They’re educational (versus pure sales pitch). This is also important to avoid “burning out” your list. If all you do is send pitch after pitch, soon you’ll be lucky to get a 1.3% open rate!They employ storytelling. We use a technique known as the “Soap Opera Sequence.” Each email creates anticipation for the next one and also refers to some interesting fact in previous ones. If a person would only have opened one email, they are now likely to want to open future ones as well as look up older ones to “solve the puzzle.” This leads to higher open rates for the entire sequence, and more sales.The calls to action are closer to the bottom, having first built up some value. Counterintuitively, this works better, but you should always test radically different approaches.Email is a massively underutilized medium. Most businesses are sitting on goldmines (their email list) without realizing it! You can — and should — make at least 2x to 3x as many sales from your email list as you do from direct website sales.It takes a lot of work to write an effective sequence, but once you do you can run it on autopilot for years, making money hand over fist. As customer acquisition gets ever more competitive and expensive, how well you monetize your list can make the difference between success and failure.ConclusionTo increase the conversion rate on your website and get more sales, leads, or app downloads, follow these simple steps:Put in the work to understand why the non-converting visitors are leaving and then systematically address their specific objections. This is what “research-driven” optimization means, as opposed to redesign based purely aesthetic appeal or “best practices.”Find out why the converting visitors took the desired action — and then accentuate these things.Capture emails and use a follow-up sequence to educate and tell stories to those who were not convinced by the website. Done correctly, this can produce 2x to 3x as many sales as the website.Simple, but not easy. It takes diligence and discipline to do these things well. But if you do, you will be richly rewarded!And if you’d like to learn more about conversion rate optimization or review additional case studies, we encourage you to take our free course. Thanks to Jon Powell, Hayk Saakian, Vlad Mkrtumyan, and Nick Jordan for reading drafts of this post. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How We More than Doubled Conversions & Leads for a New ICO [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How We More than Doubled Conversions & Leads for a New ICO [Case Study]"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "The details:"
    },
    {
      "level": "H3",
      "text": "Winning page (above the fold):"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "More persuasive elements (below the fold):"
    },
    {
      "level": "H3",
      "text": "13% lift: Simplified alternate page"
    },
    {
      "level": "H3",
      "text": "Follow-up email sequence"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jasper Kuria\n          \n            Jasper Kuria\n          \n            Jasper Kuria"
}