{
  "url": "https://moz.com/blog/double-featured-snippets",
  "slug": "double-featured-snippets",
  "title": "We Dipped Our Toes Into Double Featured Snippets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Double-snippet SERPs started trickling in last year, so we took a peek at what they’re up to.",
  "content": "We Dipped Our Toes Into Double Featured Snippets Competitive Research | Search Engines | Advanced SEO By: Roger MozBot February 25, 2019 Table of Contents Copied! By: Roger MozBot February 25, 2019 We Dipped Our Toes Into Double Featured Snippets Competitive Research | Search Engines | Advanced SEO This post was originally published on the STAT blog. Featured snippets, a vehicle for voice search and the answers to our most pressing questions, have doubled on the SERPs — but not in the way we usually mean. This time, instead of appearing on two times the number of SERPS, two snippets are appearing on the same SERP. Hoo! In all our years of obsessively stalking snippets, this is one of the first documented cases of them doing something a little different. And we are here for it. While it’s still early days for the double-snippet SERP, we’re giving you everything we’ve got so far. And the bottom line is this: double the snippets mean double the opportunity. Google's case for double-snippet SERPs The first time we heard mention of more than one snippet per SERP was at the end of January in Google’s “reintroduction” to featured snippets. Not yet launched, details on the feature were a little sparse. We learned that they’re “to help people better locate information” and “may also eventually help in cases where you can get contradictory information when asking about the same thing but in different ways.” Thankfully, we only had to wait a month before Google released them into the wild and gave us a little more insight into their purpose. Calling them “multifaceted” featured snippets (a definition we’re not entirely sure we’re down with), Google explained that they’re currently serving “‘multi-intent’ queries, which are queries that have several potential intentions or purposes associated,” and will eventually expand to queries that need more than one piece of information to answer. With that knowledge in our back pocket, let’s get to the good stuff. The double snippet rollout is starting off small Since the US-en market is Google’s favorite testing ground for new features and the largest locale being tracked in STAT, it made sense to focus our research there. We chose to analyze mobile SERPs over desktop because of Google’s (finally released) mobile-first indexing, and also because that’s where Google told us they were starting. After waiting for enough two-snippet SERPs to show up so we could get our (proper) analysis on, we pulled our data at the end March. Out of the mobile keywords currently tracking in the US-en market in STAT, 122,501 had a featured snippet present, and of those, 1.06 percent had more than one to its name. With only 1,299 double-snippet SERPs to analyze, we admit that our sample size is smaller than our big data nerd selves would like. That said, it is indicative of how petite this release currently is. Two snippets appear for noun-heavy queries Our first order of business was to see what kind of keywords two snippets were appearing for. If we can zero in on what Google might deem “multi-intent,” then we can optimize accordingly. By weighting our double-snippet keywords by tf-idf, we found that nouns such as “insurance,” “computer,” “job,” and “surgery” were the primary triggers — like in [general liability insurance policy] and [spinal stenosis surgery]. It’s important to note that we don’t see this mirrored in single-snippet SERPs. When we refreshed our snippet research in November 2017, we saw that snippets appeared most often for “how,” followed closely by “does,” “to,” “what,” and “is.” These are all words that typically compose full sentence questions. Essentially, without those interrogative words, Google is left to guess what the actual question is. Take our [general liability insurance policy]keyword as an example — does the searcher want to know what a general liability insurance policy is or how to get one? Because of how vague the query is, it’s likely the searcher wants to know everything they can about the topic. And so, instead of having to pick, Google’s finally caught onto the wisdom of the Old El Paso taco girl — why not have both? Better leapfrogging and double duty domains Next, we wanted to know where you’d need to rank in order to win one (or both) of the snippets on this new SERP. This is what we typically call “source position.” On a single-snippet SERP and ignoring any SERP features, Google pulls from the first organic rank 31 percent of the time. On double-snippet SERPs, the top snippet pulls from the first organic rank 24.84 percent of the time, and the bottom pulls from organic ranks 5–10 more often than solo snippets. What this means is that you can leapfrog more competitors in a double-snippet situation than when just one is in play. And when we dug into who’s answering all these questions, we discovered that 5.70 percent of our double-snippet SERPs had the same domain in both snippets. This begs the obvious question: is your content ready to do double duty? Snippet headers provide clarity and keyword ideas In what feels like the first new addition to the feature in a long time, there’s now a header on top of each snippet, which states the question it’s set out to answer. With reports of headers on solo snippets (and “People also search for” boxes attached to the bottom — will this madness never end?!), this may be a sneak peek at the new norm. Instead of relying on guesses alone, we can turn to these headers for what a searcher is likely looking for — we’ll trust in Google’s excellent consumer research. Using our [general liability insurance policy] example once more, Google points us to “what is general liabilities insurance” and “what does a business insurance policy cover” as good interpretations. Because these headers effectively turn ambiguous statements into clear questions, we weren’t surprised to see words like “how” and “what” appear in more than 80 percent of them. This trend falls in line with keywords that typically produce snippets, which we touched on earlier. So, not only does a second snippet mean double the goodness that you usually get with just one, it also means more insight into intent and another keyword to track and optimize for. Both snippets prefer paragraph formatting Next, it was time to give formatting a look-see to determine whether the snippets appearing in twos behave any differently than their solo counterparts. To do that, we gathered every snippet on our double-snippet SERPs and compared them against our November 2017 data, back when pairs weren’t a thing. While Google’s order of preference is the same for both — paragraphs, lists, and then tables — paragraph formatting was the clear favorite on our two-snippet SERPs. It follows, then, that the most common pairing of snippets was paragraph-paragraph — this appeared on 85.68 percent of our SERPs. The least common, at 0.31 percent, was the table-table coupling. We can give two reasons for this behavior. One, if a query can have multiple interpretations, it makes sense that a paragraph answer would provide the necessary space to explain each of them, and two, Google really doesn’t like tables. We saw double-snippet testing in action When looking at the total number of snippets we had on hand, we realised that the only way everything added up was if a few SERPs had more than two snippets. And lo! Eleven of our keywords returned anywhere from six to 12 snippets. For a hot minute we were concerned that Google was planning a full-SERP snippet takeover, but when we searched those keywords a few days later, we discovered that we’d caught testing in action. Here’s what we saw play out for the keyword [severe lower back pain]: After testing six variations, Google decided to stick with the first two snippets. Whether this is a matter of top-of-the-SERP results getting the most engagement no matter what, or the phrasing of these questions resonating with searchers the most, is hard for us to tell. The multiple snippets appearing for [full-time employment] left us scratching our head a bit: Our best hypothesis is that searchers in Florida, NYS, Minnesota, and Oregon have more questions about full-time employment than other places. But, since we’d performed a nation-wide search, Google seems to have thought better of including location-specific snippets. Share your double-snippet SERP experiences It goes without saying — but here we are saying it anyway — that we’ll be keeping an eye on the scope of this release and will report back on any new revelations. In the meantime, we’re keen to know what you’re seeing. Have you had any double-snippet SERPs yet? Were they in a market outside the US? What keywords were surfacing them? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "We Dipped Our Toes Into Double Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "We Dipped Our Toes Into Double Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Google's case for double-snippet SERPs"
    },
    {
      "level": "H3",
      "text": "The double snippet rollout is starting off small"
    },
    {
      "level": "H3",
      "text": "Two snippets appear for noun-heavy queries"
    },
    {
      "level": "H3",
      "text": "Better leapfrogging and double duty domains"
    },
    {
      "level": "H3",
      "text": "Snippet headers provide clarity and keyword ideas"
    },
    {
      "level": "H3",
      "text": "Both snippets prefer paragraph formatting"
    },
    {
      "level": "H3",
      "text": "We saw double-snippet testing in action"
    },
    {
      "level": "H3",
      "text": "Share your double-snippet SERP experiences"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Roger MozBot\n          \n            Roger MozBot\n          \n            Roger MozBot"
}