{
  "url": "https://moz.com/blog/draw-roger-winners",
  "slug": "draw-roger-winners",
  "title": "Draw Roger Winners! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For your afternoon Halloween pleasure, we're announcing the winners of our Draw Roger Contest! We received some amazing Roger-based art entries. Check them out!",
  "content": "Draw Roger Winners! Moz News By: Joel Day October 31, 2012 Table of Contents Copied! By: Joel Day October 31, 2012 Draw Roger Winners! Moz News Greetings to you, fans of SEOmoz. A merry All Hallow's Eve to you and yours. . Chester A. Arthur here to present the winners of this Draw Roger contest. When Joel asked me to step in and write this for him, I was, at first, beguiled! Why would I, the 21st present of these United States, be a fit author to such an auspicious announcement? I may only have been president a short time, but I believe my fine political track record and honorary doctorate in both Art and Robotics gives me the necessary credentials to deliver this fateful news. But first, I've got an extra special announcement. SEOmoz has started their very own Pinterest account where we've set up a board just for these submissions. You can see all the entries here. (And don't forget to join us in the Pinterest-y fun.) Now, without further ado, I deliver unto you: The Winner of SEOmoz's First Annual Draw Roger Contest! The winner of the adult group is Nicholas L. from Minneapolis, MN. Congratulations! For second place... Tamsin S. from London And, in an unprecendented fashion, we have a tie for third place! Chris L. from Philidelphia, PA and Bruno R. from Madrid The Winner of the Bairns! Everett N. from Fargo, ND Your second place winner is... Tenesea B. from Edmonton, AB And the third place winner: Elias N. from Fargo, ND We'll be emailing all of you soon to let you know about your prizes! Thanks for participating in the first ever Draw Roger Contest. We had a ton of fun seeing all your entries, and we were awed by your incredible artistic talents. They warmed Roger's robotic heart! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Draw Roger Winners!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Draw Roger Winners!"
    },
    {
      "level": "H2",
      "text": "The Winner of SEOmoz's First Annual Draw Roger Contest!"
    },
    {
      "level": "H2",
      "text": "The Winner of the Bairns!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joel Day\n          \n            Joel Day"
}