{
  "url": "https://moz.com/blog/drive-newsletter-growth-with-seo",
  "slug": "drive-newsletter-growth-with-seo",
  "title": "12 Actionable Steps to Drive Newsletter Growth with SEO Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here’s how to get users from your website into your email newsletter list, and why email marketing and SEO work so well together.",
  "content": "12 Actionable Steps to Drive Newsletter Growth with SEO Content Email Marketing By: Lauren Fox May 4, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lauren Fox May 4, 2022 12 Actionable Steps to Drive Newsletter Growth with SEO Content Email Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At Brafton, we’ve found our newsletter subscribers to be our best, most engaged audience. These are our people. They live and breathe content marketing, just as we do. Some even partner with us to create and execute awesome content marketing campaigns for their brands. Over the last two and a half years, we’ve placed a significant emphasis on growing this subscriber base, and we’ve achieved a 170% increase (and counting!) across 84 countries. Newsletter subscriptions coming from organic search traffic. If you’re reading this article, you’re probably looking for ways to grow your newsletter list, too. SEO blog content has been the foundation for our growth. How does it work? Simple: We create blog content that ranks highly in search, and we make it super easy (and tempting) for readers to subscribe to our newsletter once they visit our blog. While the concept seems straightforward, the effort is anything but. Read on to learn how to get users from your website onto your newsletter list, and why email marketing and SEO work so well together. Part 1: Attracting potential subscribers to your site The first part of this newsletter growth process is actually getting your potential newsletter subscribers to your website. Here are 5 solid strategies for doing just that: 1. Keyword research Our blog has been around since April 2010. We’ve published over 7,500 articles in those 12 years. That’s a lot of content. But it wasn’t until we rolled out a data-led keyword research and content creation strategy in 2018 that we started seeing significant traction with organic traffic growth: I won’t go into detail about the strategy we used to get there (you can read about it here), but I will wax poetic about the importance of keyword research and topic selection if you’re looking to grow your blog — and your newsletter subscriber list as a result. Keyword selection is crucial. If you don’t choose the right topics to write about, you won’t rank highly in search results. And if you’re not showing up in search, no one is going to come to your website to read your content — or to subscribe to read more from your brand. 2. Great content writing Great content is your foot in the door with your next potential newsletter subscriber. In an ideal scenario, they come to your site, they read your content, they’re incredibly impressed, and they happily enter their email address to get more of the same from your brand directly into their inbox. Writing great content not only gets you to appear more often in search and improves your organic visibility, but it’s also the best way to convince a reader to sign up for your newsletter. What do I mean when I say “write great content?” Well, there’s a creative and scientific element to this part of the process, and we do it because it works: Using the briefing process we developed, and an extremely talented pool of in-house writers, we’re able to create content that comprehensively covers all potential subtopics and answers all potential questions a searcher might have about the target keyword. In effect, we attempt to use data to create the most comprehensive content on the web for each topic we choose to cover. This keeps us competitive and ranking well in SERPs, which means more chances for a searcher to land on our blog and subscribe to our newsletter. 3. Content reoptimization Sometimes the content we create gets old. It becomes outdated and stale, or new competitors create better content than ours and start outranking us. Reoptimizing a piece of content helps us attract more potential newsletter subscribers to our blog in two main ways: By reoptimizing the blog content, we improve our ranking for our target keyword and, as a result, we start getting more clicks to the page for the targeted audience searching that term.By improving the comprehensiveness of the piece by covering more topics, we rank for a larger number of variant keywords and then drive more clicks to the page. Here’s the data from a blog post that was underperforming before we did a reoptimization on March 30, 2021, and what newsletter subscription goal completions looked like after the reoptimization, year-over-year: An increase in newsletter subscription goal completions YoY from a content reoptimization. Even though the increase in total subscriptions here is relatively small, this was just for a single blog post. Imagine doing this for 50 blog posts a year. At scale, it can make an impact. 4. Audio/visuals in blog content Some people are just more visual learners than others. They prefer eye-catching infographics and video tutorials over hundreds of words of straight-up written content. And I’m not just saying this without any actual data to back up my claim. We’ve consistently found that blogs with infographics drive more clicks to our site (compared to blogs that do not feature infographics). Even though our blogs with infographics make up just ~3% of all of our blog pages, they generate 25% of all the clicks to our blog pages and 21% of all the impressions generated by blogs in search: They also have a higher CTR (2.0% vs 1.6%) and a better average keyword position (22.4 vs 30.2): Finally, they tend to generate more backlinks organically: Blog post: The Anatomy of a Marketing Ideation Workshop (Infographic) How does this impact our newsletter list growth? These pages drive more clicks, rank better in search and get linked back to more often. All of these results drive a bigger audience of potential newsletter subscribers to our website to read our content and click “Subscribe.” 5. Pillar pages When it comes to attracting an organic search audience that is highly likely to subscribe to our newsletter, one of the top strategies we’ve rolled out in the last year is our pillar page strategy. Over the course of 2021, we published five of these long-form guides. They’re a cross between a blog post and a landing page — and they are search-targeted. Example of a pillar page targeting the keyword “what is content creation.” Compared to our blog content, users coming to the site to view these pages tend to bounce less, view more pages per session and subscribe to our newsletter at a higher rate (1.11% vs 0.38%): I’m not recommending you completely ditch your blog strategy for pillar pages, but they are a great supplemental way to generate more newsletter subscribers per page. Part 2: Improving on-site newsletter conversion (CRO) We’ve discussed plenty of ways to improve the content on the page to attract more visitors from organic search. But what happens once they get there? How do we actually get visitors to convert from first-time readers to weekly email subscribers? Enter: Conversion rate optimization! CRO is all about finding ways to get site visitors from reading your blog in their browser to receiving your content directly in their inbox. (Which is the ultimate goal, of course). Read on for four on-page elements that’ll likely improve your newsletter subscription conversion rates: 6. Pop-up form There’s a reason why nearly every site you visit on the web has an annoying pop-up form asking you to subscribe to their newsletter. It’s because it works. There was a time when our blog didn’t have a pop-up form (back around 2017). We decided to run a test and added the first iteration of our pop-up form, which looked like this: Here are the results we saw: Daily subscriptions without pop-up: 1.59Daily subscriptions with pop-up: 8.32Change: +532% We happily kept that pop-up form in its place and never looked back. In the years since we originally implemented the pop-up, we’ve modified how it behaves so that it’s more likely to capture a form fill. We: Redesigned the pop-up to be slightly more clear in terms of what the user is signing up for. Adjusted the timing on the pop-up. It used to come up too soon for the reader to make any real judgment on whether they might want to subscribe. We decided to go with 30 seconds, as this time is enough for the user to get the flavor of the post, but still retains most of the users (as we found they start to drop off after 45 seconds). These may seem like small modifications, but cumulatively they improve the chances that we’re serving the pop-up form at the exact right time for a reader. We’ve also learned over the years that the more ways website visitors have to subscribe to our newsletter, the better. Here are 3 more elements that we’ve included on-page to drive up our subscription rate: 7. Sticky sidebar This is one of my favorite CTA elements and I think it really personalizes the experience for the reader on a blog. The sticky sidebar follows you down the page as you read, and the “Subscribe” CTA is always present on the screen. It’s not overly distracting, but it does make it super easy for the reader to subscribe at any time (even if they’ve closed the pop-up form). There was a period when we removed this sidebar from our blog pages and our newsletter conversion rate plummeted. It ticked back up once we added the sidebar back to the page. Lesson learned! 8. Inline subscribe CTA We started embedding a CTA directly into each blog post. Its design is meant to not be too interruptive, but it’s present as yet another way for users to subscribe. This inline CTA is included once per blog post, around 50% down the page. We intentionally do not place it too close to the end of the article. This improves our chances of catching someone once they’ve read a significant portion of the content but won’t be missed if they don’t finish reading the entire piece. 9. Dedicated newsletter sign-up page + nav link As a final on-site CRO element, we launched a dedicated landing page to promote our newsletter: Like any good conversion landing page, it succinctly (and persuasively, we hope) explains what subscribers get by entering their contact information. And if they’re not yet convinced, we’ve included a sampling of some of our best blog content for them to peruse before they make the final decision to subscribe: Every single element on this page is geared toward prompting users to fill out the form. We use this landing page as a standalone promotional tool both on site and through external channels (paid and organic alike). We advertise the page on Google and social platforms.We share a link to this page in our email marketing — so friends of subscribers can easily subscribe.We even give it a prominent spot in our main navigation: You may think it’s not worth it to add a “Subscribe” button to your main navigation — it’s pretty important real estate, after all — but it will get you more newsletter subscribers organically as users land on and navigate through your site. And people do actually navigate to this page and subscribe this way. Since launching the page in January 2021, it accounted for 17.64% of our total on-site newsletter goal completions (in 2021) with a whopping 24.12% conversion rate. All the on-site elements I’ve covered may seem like tiny, insignificant changes but they 1) took significant research, analysis and effort to implement, and 2) they worked. Since adding these elements in 2021, we have doubled our newsletter subscription conversion rate: Small changes can yield big results — and every new newsletter subscriber makes a difference. Part 3: Enhancing subscriber engagement Now that we’ve looked at ways to grow your subscriber list and improve your subscription conversion rate, I want to switch gears and talk about what happens once someone does subscribe — and how content is invaluable to and inseparable from newsletter marketing. Content is what fuels newsletter marketing. You cannot have one without the other. Sure, you can technically run a newsletter that solely shares external sources, but without some sort of original content to include in the email, you’re not going to retain subscribers for very long. As I mentioned earlier, our newsletter audience is our best, most engaged audience. We hear time and time again about how much they like the content we produce. We like to reward them with even more great content. Here are the primary ways we’ve kept our newsletter audience engaged with content: 10. Downloadable content & webinars By offering different types of content, like downloadable assets (eBooks and white papers) and live-streamed webinars and workshops, we’re giving our audience more ways to connect with our brand. They can dive deeper into a specific topic in their own time with a white paper, or get their real-time questions answered with a webinar or workshop. From a marketing results perspective, we can see which contacts are most engaged with the content we’re offering by tracking email click-through rate, downloads and webinar sign-ups. It also gives us important insights into which topics and formats work best to improve user experience, and we can double down on those content types in the future. 11. Surveys One of my favorite ways we’ve connected with our newsletter audience over the years is through surveys. We ask them questions like: What types of content marketing resources do you want more of?What’s your favorite area of content marketing to learn about?How do you rate your skill level with content marketing (and other areas of marketing)?What are your favorite hobbies outside of content marketing? The feedback they provide is invaluable to our marketing efforts. It’s one of the best ways to know exactly what our newsletter audience wants from us. If you’re ever unsure about what your audience thinks of your newsletter, or where you might be lacking, a survey is arguably your best resource for those answers. And it doesn’t need to be a complex multi-question survey either — it can be a simple “How are we doing?” button you include in each send. 12. New layout for better user experience We’ve also changed the look and feel of our weekly newsletter over the years. And we continually work to improve the user experience with these design updates. Our newest iteration from 2021 contains a variety of sections based on what we’ve found to be most useful for our audience: A roundup of recently published blog posts.A rotating featured content section where we can promote our latest infographic, job opening or employee spotlight.A visual CTA to promote an eBook download or a webinar registration. My favorite sections of our newsletter are: Recommended reading Here, we share industry-related content from other brands in the space. Even if we didn’t create the content ourselves, we want to provide these additional resources to help our audience stay ahead of the content marketing curve. The hope is that they get everything they need (content marketing-wise) from our newsletter, and keep opening up our emails week after week. Subscribe CTA: “Did you get this email from a friend?” This section links out to our newsletter subscribe landing page. It’s here to help folks subscribe to our newsletter if it’s been forwarded to them from a friend. People forward emails all the time, and this way, we’ve built in an easy way to encourage new readers to subscribe to our content. It’s a CTA that doesn’t change week to week, so it doesn’t take any effort to maintain, but it’s there to organically generate more newsletter subscribers. And it does: We’ve found that 10% of people who subscribe via email do so on this page coming from the newsletter. When determining the best newsletter content and layout for your brand, it’s always most important to do what works best for your audience. You may not achieve the perfect newsletter format right out of the gate, but over time, and by gathering feedback (via surveys or organically through email replies), you’ll get closer to giving them exactly what they want. When I talk about enhancing newsletter engagement, our goal has always been the same: Be the best possible content marketing resource for our audience. As a result, we’ll get their attention and their loyalty, and possibly even their referral to a friend or colleague — and that helps us continue to grow our subscriber base. Conclusion Newsletter marketing has been at the core of Brafton’s marketing strategy for many years now, and we’ve found time and time again that there is plenty of reason to reinvest our efforts into this growth. I hope the methods I’ve shared have inspired you with plenty of ways to grow your own newsletter list. Because once you’ve got those readers subscribed, you’ll be unstoppable. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "12 Actionable Steps to Drive Newsletter Growth with SEO Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "12 Actionable Steps to Drive Newsletter Growth with SEO Content"
    },
    {
      "level": "H2",
      "text": "Part 1: Attracting potential subscribers to your site"
    },
    {
      "level": "H3",
      "text": "1. Keyword research"
    },
    {
      "level": "H3",
      "text": "2. Great content writing"
    },
    {
      "level": "H3",
      "text": "3. Content reoptimization"
    },
    {
      "level": "H3",
      "text": "4. Audio/visuals in blog content"
    },
    {
      "level": "H3",
      "text": "5. Pillar pages"
    },
    {
      "level": "H2",
      "text": "Part 2: Improving on-site newsletter conversion (CRO)"
    },
    {
      "level": "H3",
      "text": "6. Pop-up form"
    },
    {
      "level": "H3",
      "text": "7. Sticky sidebar"
    },
    {
      "level": "H3",
      "text": "8. Inline subscribe CTA"
    },
    {
      "level": "H3",
      "text": "9. Dedicated newsletter sign-up page + nav link"
    },
    {
      "level": "H2",
      "text": "Part 3: Enhancing subscriber engagement"
    },
    {
      "level": "H3",
      "text": "10. Downloadable content & webinars"
    },
    {
      "level": "H3",
      "text": "11. Surveys"
    },
    {
      "level": "H3",
      "text": "12. New layout for better user experience"
    },
    {
      "level": "H4",
      "text": "Recommended reading"
    },
    {
      "level": "H4",
      "text": "Subscribe CTA: “Did you get this email from a friend?”"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Create an Email List and Use It for SEO"
    },
    {
      "level": "H3",
      "text": "Lean into Email in 2022: An Interview with iContact’s Hank Hoffmeier"
    },
    {
      "level": "H3",
      "text": "5 Simple Tips for SEO + Email Marketing Flywheels"
    }
  ],
  "author": "Lauren Fox\n          \n            Lauren Fox\n          \n            Lauren Fox"
}