{
  "url": "https://moz.com/blog/drive-revenue-organically-whiteboard-friday",
  "slug": "drive-revenue-organically-whiteboard-friday",
  "title": "Drive Revenue with Your Organic Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday",
  "content": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday Whiteboard Friday | Conversion Rate Optimization (CRO) By: Kathryn Monkcom Edited By: Emilie Martin February 9, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kathryn Monkcom Edited By: Emilie Martin February 9, 2024 How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday Whiteboard Friday | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Search is one of the most powerful tools we have to drive business growth. Discover how to drive revenue with your organic traffic in this Whiteboard Friday. Hey, I'm Kathryn. I head up marketing automation at Aira, and I'm here today to show you how to make sure your SEO efforts convert to money in the bank. Search is one of the most powerful tools we have to drive business growth, but its influence ends once people land on your site. Without a solid strategy to drive that traffic through to sale, you're in for a tricky conversation with budget holders. Why paid and organic traffic doesn’t convert There are three key reasons why paid and organic traffic don't convert to sale. Reason number one, you're driving the wrong people to your site. Reason number two, people are coming to your site, but they're not converting into sales-qualified leads. And reason three, the sales are rolling in, but your churn rate is high. There will always be cases where people will come to your site and convert right away. But especially for more considered purchases, search is predominantly a traffic-driving channel. We need to bring in other tactics, such as email marketing and CRO, to secure that conversion to sale. 1. Driving the wrong people to the site So let's dive in. What do you do if you're driving the wrong people to your site? Now this can sometimes be a case of misunderstood intent or poor targeting, but I'll leave that for an SEO to speak on. What I'm talking about here is business models that rely on referrals or a buying committee, where the person doing the research is not the same person holding the credit card. Business training is a great example of this. If employees are looking for opportunities to upskill themselves, how can we help them to convince their boss to pay for it? In this instance, the employee is the user buyer, and the boss is the economic buyer. Letting the employee do the convincing all on their own is risky. They don't know the value proposition as well as us, and it's probably not their top priority. What if we could give them a prewritten email to send to their boss with all the information included? I'd also be asking them for their email address and their boss's email address at this point so we can nurture them with email marketing and ad retargeting further down the line. This then becomes the main CTA on the site. Instead of “buy now,” it's “share this with your manager.” Much more compelling for users lacking purchasing power.2. Not converting to sales-qualified leads On to reason two, people are coming to your site, but they're not converting to sales-qualified leads. First, you need to identify if it is a traffic-to-lead conversion issue or a lead-to-SQL issue. If you're facing a lack of leads, it's time to optimize your keyword pages for conversion. Do you have a clear value proposition and CTA above the fold? Have you included social proof, such as testimonials and success metrics? And do your forms only include the necessary fields? If in doubt, install a heat mapping tool like Hotjar on your site and get a first-hand view at how users are navigating around. But sometimes there are plenty of leads to go around, but sales teams reject them, giving a reason of not ready. Especially for more considered purchases, we can't assume that someone downloading a guide is ready to buy. We need to nurture them through to qualification. Marketing automation tools like HubSpot are great for this because we can set up a series of automated emails mapped to the decision-making process you know your prospect will go through. To do this, we need to come back to the buyer's journey and common objections at each stage. This can link in really closely with your content strategy, reusing blog posts and other content already on your site to keep your brands top of mind and signpost your prospect along that route. 3. Churn is high And finally, what happens when the sales are rolling in, but that revenue just isn't sticking? For SaaS businesses, this could mean that churn rate is high. And in e-commerce, maybe you're missing out on those repeat purchases. It's a really common misconception that marketing stops once a deal closes. But email marketing is a great tactic to use post-sale as well. Think about automated onboarding journeys for SaaS businesses, using triggers based on whether or not a customer has used a tool in their account and surfacing training materials where they might be unsure. In the same way, you can also use these triggers to listen for non-engagement. If a user hasn't logged in for 30 days, this is a great opportunity to remind them of the value your tool can bring. And on the e-commerce side, if you're selling a product that runs out, like laundry detergent, could you be emailing your customers with a discount code right before they need to repurchase? And finally, referrals. Use automation to continuously monitor satisfaction with your product and reward your most loyal customers in exchange for referring a friend. I hope this in-a-box toolkit of proven plays has given you some inspiration of ways to get more revenue from your existing organic traffic. I'd love to see how you build on this. Reach out to me on LinkedIn. Transcription by Speechpad Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Why paid and organic traffic doesn’t convert"
    },
    {
      "level": "H3",
      "text": "1. Driving the wrong people to the site"
    },
    {
      "level": "H3",
      "text": "2. Not converting to sales-qualified leads"
    },
    {
      "level": "H3",
      "text": "3. Churn is high"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Kathryn Monkcom\n          \n            Kathryn Monkcom\n          \n            Kathryn Monkcom"
}