{
  "url": "https://moz.com/blog/duplicate-management-upgrade-moz-local",
  "slug": "duplicate-management-upgrade-moz-local",
  "title": "Moz Local: Upgrading Duplicate Listing Management - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Duplicate listings have plagued local marketers for years. See how agencies, brands & SMBs alike can seek and destroy dupes faster than ever with Moz Local.",
  "content": "Giving Duplicate Listing Management the Upgrade it Deserves Local SEO | Moz Tools | Moz News By: George Freitag August 9, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: George Freitag August 9, 2016 Giving Duplicate Listing Management the Upgrade it Deserves Local SEO | Moz Tools | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Duplicate listings have been a plague to local search marketers since local search was a thing. When Moz Local first introduced duplicate closure in the fall of 2014, the goal was to address the horribly time-consuming task of finding and closing all those duplicate listings causing problems in Google, Bing, and various mapping platforms. Though we’ve consistently been making improvements to the tool’s performance (we’ll get into this later), the dashboard itself has remained largely unchanged. Not anymore. Today, we’re proud to announce our brand new duplicate management dashboard for Moz Local: Here’s a rundown of the features you can look for in the Moz Local upgrade: New Duplicates Dashboard providing full visibility and transparency of duplicate listings at each stage of the workflow — open, reviewed, and closed — for all of your listings or any subset Enhanced duplicates workflow making detecting, reviewing, and closing duplicate listings in Moz Local even easier through advanced filters Enhanced duplicate management for faster and more accurate duplicate listing detection, submission, and tracking across all of Moz Local’s partner networks This duplicate management update represents a new standard in the industry and will help our users be more productive and efficient than ever. A bit of context Eliminating duplicates and near-duplicates on major data sources and directories has always been one of the most effective ways to increase your presence in the local pack. It’s a key part of citation consistency, which was rated as the second most important tactic for getting into local pack results according to the 2015 local ranking factors survey. On top of that, in last May’s Mozinar on local search, Andrew Shotland of Local SEO Guide mentioned that he saw a 23% increase in presence in the local pack just by addressing duplicates. So we know that seeking and destroying duplicates works. The problem is that doing it manually just takes for-e-ver. Anyone who works in local search knows the pain and monotony of combing through Google for variations of a business, then spending more time finding the contact form needed to actually request a closure. Our duplicate listing feature has always focused on easily identifying potential duplicates and presenting them to marketers in a way that allows them to quickly take action. In the case of the aggregators (like Infogroup and Localeze) and direct partner sites (like Foursquare and Insider Pages), this takes the form of single-click closure requests that are quickly reviewed and sent directly to the source. For sites that aren’t part of our direct network or don’t accept closure requests from anyone, like Facebook, we still do our best to point our users in the right direction so they can close the listing manually. Originally, the dashboard took the form of a long list where marketers could scroll down and take action, as needed. Though this worked great for many of our users, it quickly became problematic for large brands and agencies. Based on data collected from the thousands of brands and locations we track, we know that the average enterprise client can have around 3,500 duplicate listings and, in some cases, that number can be as high as 100,000 duplicates. Even though we estimate our tool can reduce the time spent managing duplicates by around 75%, when you have literally thousands of duplicates to parse through, a single to-do list quickly becomes impractical. 1. New dashboard for full transparency The first opportunity we saw was to provide you with a bit more transparency into our closure process. Though we always provided some insight related to where we were in the closure process, there was no way to view this at an aggregated level and no way to see how many duplicates had been closed so you could track your progress. So we fixed that. Now all Moz Local customers can easily see how many duplicates are still marked as \"open,\" how many are being reviewed, and how many listings have been successfully closed. If you’re an agency or consultant, this can be especially useful to demonstrate progress made in identifying and closing duplicates for your clients. If you’re a brand, this can be a great way to build a business case for additional resources or show the value of your local strategy. We also saw another opportunity to improve transparency by further breaking down the reporting by the type of data partner. Moz Local has always been very deliberate in surfacing the relationship we have with our partners. Because of this, we wanted to add another layer of insight based on the nature of the partnership. Verification Partners include Google and Facebook, since they're sources we use to verify our own data. Though we can’t close duplicates directly at this point, they're so influential we felt it was imperative to include the ability to identify duplicates on these platforms and guide you as far as possible through the closure process. Direct Partners are data sources that we have a direct relationship with and submit business listings instantly through our distribution service. For all major aggregators and most of our direct partner directories, you can use our single-click duplicate closure, meaning that all you have to is click “Close” and we’ll make sure it’s removed completely from their database, forever. Lastly, we have our Indirect Partners. These are sources that receive all of our listing data via our direct partners, but we do not submit to directly. Though we can’t close listings on these sources automatically, we can still detect duplicates and send you directly to their closure form to help you request the closure. 2. Improve workflow through filters The second opportunity was to address the long list-view that our users used to identify, evaluate, and take action related to duplicates we discovered. With so many of our clients having hundreds or thousands of listings to manage, it quickly became apparent that we needed some advanced sorting to help them out with their workflow. So we added that, as well. Now, if you only want to view the listings that need action, you can just click “Open,” then scroll down and choose to close or ignore any of duplicates in that view. If you then want to see how many duplicates have already been closed and removed from the data partner, you can just click that checkbox. If you want to only see the open duplicate listings for a certain partner, like Foursquare, that’s an option as well. Further, just like everything else in the Moz Local dashboard and Search Insights, reporting strictly follows any filters and labels from the search bar. This can be especially useful if you’re an agency that wants to narrow your view to a specific client, or a brand that wants to only view reporting for a single marketing region. For example, if you only want to see closed duplicates from Infogroup located in Texas that are part of the campaign “hanna-barbera” well, there you go. All data in any filtered view is easily exportable via CSV so you can repurpose it for your own reporting or research. Lastly, all of these reports are retroactive, meaning any duplicates you’ve requested closure or closed in the past will show up in the new duplicates dashboard and be available for advanced sorting and reporting. 3. Enhanced duplicate management The new interface and reporting features aren’t the only things we’ve improved. Over the last year, our developers have been spending countless hours fine-tuning the duplicate closure process and improving relationships with our data partners. Early on, the Moz Local team decided that the product should focus on the data sources that have the greatest impact for local businesses, regardless of their relationship with us, directly. As a result, we built the widest and most complex set of partnerships with aggregators, direct and indirect partners, and business directories in the industry. This update not only launches a new dashboard but also marks the kickoff for some huge improvements to our back-end. Faster closure processing The challenge that comes with working with a network as diverse as ours is that each of our partners handle duplicate listings in completely different ways. The Moz Local team has always had resources devoted specifically to work with our partners to improve our data submission and listing management processes. For duplicates, however, this meant we needed to help some of our partners enhance their own APIs to accept closure requests or, in some cases, create the API all together! As part of this update, our development team has implemented new instrumentation and alerts to better identify submission errors sent to our partners, speed up the closure process, and quickly re-submit any closure requests that were not processed correctly. Shorter review cycles Additionally, we’ve shortened our internal review cycle for closure requests. In order ensure the quality of duplicate closures and to be sure our “alternates” feature isn’t being used maliciously, we manually review a percentage of closure requests. Through a variety of processes, we are now able to programmatically approve more closures, allowing for faster manual reviews of all other closure requests. As a result, we are now able to automatically approve around 44% of all closure requests instantly. The future The most exciting thing about this update is that it’s only the beginning. Over the next few months expect to see further integration with our data partners, discovery and progress notifications, increased closure efficiency, and more. We hope you find our new duplicates dashboard useful and, most importantly, we hope it makes your lives a little bit easier. Get Started with Moz Local! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Giving Duplicate Listing Management the Upgrade it Deserves"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Giving Duplicate Listing Management the Upgrade it Deserves"
    },
    {
      "level": "H2",
      "text": "A bit of context"
    },
    {
      "level": "H2",
      "text": "1. New dashboard for full transparency"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "2. Improve workflow through filters"
    },
    {
      "level": "H2",
      "text": "3. Enhanced duplicate management"
    },
    {
      "level": "H3",
      "text": "Faster closure processing"
    },
    {
      "level": "H3",
      "text": "Shorter review cycles"
    },
    {
      "level": "H2",
      "text": "The future"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Freitag\n          \n            George Freitag\n          \n            George Freitag"
}