{
  "url": "https://moz.com/blog/duplicate-listings-and-the-case-of-the-nomadic-new-mexican-restaurant",
  "slug": "duplicate-listings-and-the-case-of-the-nomadic-new-mexican-restaurant",
  "title": "Duplicate Listings and the Case of the Nomadic New Mexican Restaurant - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Even the softest, chewiest tortillas and most flavorful carne can't save you when customers are being misdirected to false locations via outdated, inconsistent, and duplicate listings.",
  "content": "Duplicate Listings and the Case of the Nomadic New Mexican Restaurant Local SEO | Moz Tools By: Miriam Ellis September 12, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 12, 2016 Duplicate Listings and the Case of the Nomadic New Mexican Restaurant Local SEO | Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Albuquerque’s locals and tourists agree, you can’t find a more authentic breakfast in town than at Perea’s New Mexican Restaurant. Yelp reviewers exclaim, \"Best green chile ever!!\", \"Soft, chewy, thick-style homemade flour tortillas soak up all the extra green chili,\" \"My go-to for great huevos rancheros,\" and \"Carne was awesome! Tender, flavorful, HOT!\" The descriptions alone are enough to make one salivate, but the Yelp reviews for this gem of an eatery also tell another story — one so heavily spiced with the potential of duplicate listings that it may take the appetite of any hard-working local SEO away:“Thru all of the location changes, this is a true family restaurant with home cooking.” “This restaurant for whatever reason, changes locations every couple years or so.”“They seem to wander from different locations”“As other reviews have already mentioned, Perea's changes locations periodically (which is puzzling/inconvenient — the only reason they don't get 5 stars)”“They switch locations every few years and the customers follow this place wherever it goes.”Reading those, the local SEO sets aside sweet dreams of sopapillas because he very much doubts the accuracy of that last review comment. Are all customers really following this restaurant from place to place, or are visitors (with money to spend) being misdirected to false locations via outdated, inconsistent, and duplicate listings?The local SEO can’t stand the suspense, so he fires up Moz Check ListingHe types in the most recent name/zip code combo he can find, and up comes:A total of 2 different names, 3 different phone numbers, and 4 different addresses! In 5 seconds, the local SEO has realized that business listings around the web are likely misdirecting diners left and right, undoubtedly depriving the restaurant of revenue as locals fail to keep up with the inconvenient moves or travelers simply never find the right place at all. Sadly, two of those phone numbers return an out-of-service message, further lessening the chances that patrons will get to enjoy this establishment’s celebrated food. Where is all this bad data coming from?The local SEO clicks on just the first entry to start gaining clues, and from there, he clicks on the duplicates tab for a detailed, clickable list of duplicates that Check Listing surfaces for that particular location:From this simple Duplicates interface, you can immediately see that 1 Google My Business listing, 1 Foursquare listing, 3 Facebook Places, 1 Neustar Localeze listing, and 1 YP listing bear further investigation. Clicking the icons takes you right to the sources. You’ve got your clues now, and only need to solve your case. Interested?The paid version of Moz Local supports your additions of multiple variants of the names, addresses, and phone numbers of clients to help surface further duplicates. Finally, your Moz Local dashboard also enables you to request closure of duplicates on our Direct Network partners. What a relief!Chances are, most of your clients don’t move locations every couple of years (at least, we hope not!), but should an incoming client alert you to a move they’ve made in the past decade or so, it’s likely that a footprint of their old location still exists on the web. Even if they haven’t moved, they may have changed phone numbers or rebranded, and instead of editing their existing listings to reflect these core data changes, they may have ended up with duplicate listings that are then auto-replicating themselves throughout the ecosystem.Google and local SEOs share a common emotion about duplicate listings: both feel uneasy about inconsistent data they can’t trust, knowing the potential to misdirect and frustrate human users. Feeling unsettled about duplicates for an incoming client today? Get your appetite back for powerful local SEO with our free Check Listing tool! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Duplicate Listings and the Case of the Nomadic New Mexican Restaurant"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Duplicate Listings and the Case of the Nomadic New Mexican Restaurant"
    },
    {
      "level": "H2",
      "text": "The local SEO can’t stand the suspense, so he fires up Moz Check Listing"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}