{
  "url": "https://moz.com/blog/duplicate-gmb-listings",
  "slug": "duplicate-gmb-listings",
  "title": "What You Need to Know About Duplicate GMB Listings [Excerpt from the Expert’s Guide to Local SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now that Google MapMaker is dead, there are lots of questions around duplicate listings. Joy Hawkins shares a chapter from her Expert's Guide to Local SEO and covers everything from what to do with listings for a deceased practitioner to service area businesses and beyond.",
  "content": "What You Need to Know About Duplicate GMB Listings [Excerpt from the Expert’s Guide to Local SEO] Local SEO By: Joy Hawkins May 16, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joy Hawkins May 16, 2017 What You Need to Know About Duplicate GMB Listings [Excerpt from the Expert’s Guide to Local SEO] Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently, I’ve had a lot of people ask me how to deal with duplicate listings in Google My Business now that MapMaker is dead. Having written detailed instructions outlining different scenarios for the advanced local SEO training manual I started selling over at LocalU, I thought it'd be great to give Moz readers a sample of 5 pages from the manual outlining some best practices. What you need to know about duplicate GMB listingsBefore you start, you need to find out if the listing is verified. If the listing has an “own this business” or “claim this business” option, it is not currently verified. If missing that label, it means it is verified — there is nothing you can do until you get ownership or have it unverified (if you're the one who owns it in GMB). This should be your first step before you proceed with anything below. Storefronts Do the addresses on the two listings match? If the unverified duplicate has the same address as the verified listing, you should contact Google My Business support and ask them to merge the two listings. If the addresses do not match, find out if the business used to be at that address at some point in time. If the business has never existed there: Pull up the listing on Maps Press “Suggest an edit” Switch the toggle beside “Place is permanently closed” to Yes Select “Never existed” as the reason and press submit. *Note: If there are reviews on the listing, you should get them transferred before doing this. If the duplicate lists an address that is an old address (they were there at some point but have moved), you will want to have the duplicate marked as moved. Service area businesses Is the duplicate listing verified? If it is, you will first have to get it unverified or gain access to it. Once you’ve done that, contact Google My Business and ask them to merge the two listings. If the duplicate is not verified, you can have it removed from Maps since service area businesses are not permitted on Google Maps. Google My Business allows them, but any unverified listing would follow Google Maps rules, not Google My Business. To remove it: Pull up the listing on Maps Press “Suggest an edit” Switch the toggle beside “Place is permanently closed” to Yes Select “Private” as the reason and press submit. *Note: If there are reviews on the listing, you should get them transferred before doing this. Practitioner listings Public-facing professionals (doctors, lawyers, dentists, realtors, etc.) are allowed their own listings separate from the office they work for, unless they're the only public-facing professional at that office. In that case, they are considered a solo practitioner and there should only be one listing, formatted as “Business Name: Professional Name.” Solo practitioner with two listingsThis is probably one of the easiest scenarios to fix because solo practitioners are only supposed to have one listing. If you have a scenario where there's a listing for both the practice and the practitioner, you can ask Google My Business to merge the two and it will combine the ranking strength of both. It will also give you one listing with more reviews (if each individual listing had reviews on it). The only scenario where I don’t advise combining the two is if your two listings both rank together and are monopolizing two of the three spots in the 3-pack. This is extremely rare. Multi-practitioner listingsIf the business has multiple practitioners, you are not able to get these listings removed or merged provided the practitioner still works there. While I don’t generally suggest creating listings for practitioners, they often exist already, leaving people to wonder what to do with them to keep them from competing with the listing for the practice. A good strategy is to work on having multiple listings rank if you have practitioners that specialize in different things. Let’s say you have a chiropractor who also has a massage therapist at his office. The massage therapist’s listing could link to a page on the site that ranks highly for \"massage therapy\" and the chiropractor could link to the page that ranks highest organically for chiropractic terms. This is a great way to make the pages more visible instead of competing. Another example would be a law firm. You could have the main listing for the law firm optimized for things like “law firm,” then have one lawyer who specializes in personal injury law and another lawyer who specializes in criminal law. This would allow you to take advantage of the organic ranking for several different keywords. Keep in mind that if your goal is to have three of your listings all rank for the exact same keyword on Google, thus monopolizing the entire 3-pack, this is an unrealistic strategy. Google has filters that keep the same website from appearing too many times in the results and unless you’re in a really niche industry or market, it’s almost impossible to accomplish this. Practitioners who no longer work thereIt’s common to find listings for practitioners who no longer work for your business but did at some point. If you run across a listing for a former practitioner, you'll want to contact Google My Business and ask them to mark the listing as moved to your practice listing. It’s extremely important that you get them to move it to your office listing, not the business the practitioner now works for (if they have been employed elsewhere). Here is a good case study that shows you why. If the practitioner listing is verified, things can get tricky since Google My Business won’t be able to move it until it’s unverified. If the listing is verified by the practitioner and they refuse to give you access or remove it, the second-best thing would be to get them to update the listing to have their current employer’s information on it. This isn’t ideal and should be a last resort. Listings for employees (not public-facing)If you find a listing for a non-public-facing employee, it shouldn’t exist on Maps. For example: an office manager of a law firm, a paralegal, a hygienist, or a nurse. You can get the listing removed: Pull up the listing on Maps Press “Suggest an edit” Switch the toggle beside “Place is permanently closed..” to Yes Select “Never existed” as the reason and press submit. Listings for deceased practitionersThis is always a terrible scenario to have to deal with, but I've run into lots of cases where people don’t know how to get rid of listings for deceased practitioners. The solution is similar to what you would do for someone who has left the practice, except you want to add an additional step. Since the listings are often verified and people usually don’t have access to the deceased person’s Google account, you want to make sure you tell Google My Business support that the person is deceased and include a link to their obituary online so the support worker can confirm you're telling the truth. I strongly recommend using either Facebook or Twitter to do this, since you can easily include the link (it’s much harder to do on a phone call). Creating practitioner listingsIf you’re creating a practitioner listing from scratch, you might run into issues if you’re trying to do it from the Google My Business dashboard and you already have a verified listing for the practice. The error you would get is shown below. There are two ways around this: Create the listing via Google Maps. Do this by searching the address and then clicking “Add a missing place.” Do not include the firm/practice name in the title of the listing or your edit most likely won’t go through, since it will be too similar to the listing that already exists for the practice. Once you get an email from Google Maps stating the listing has been successfully added, you will be able to claim it via GMB. Contact GMB support and ask them for help. We hope you enjoyed this excerpt from the Expert's Guide to Local SEO! The full 160+-page guide is available for purchase and download via LocalU below. Get the Expert's Guide to Local SEO Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What You Need to Know About Duplicate GMB Listings [Excerpt from the Expert’s Guide to Local SEO]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What You Need to Know About Duplicate GMB Listings [Excerpt from the Expert’s Guide to Local SEO]"
    },
    {
      "level": "H2",
      "text": "What you need to know about duplicate GMB listings"
    },
    {
      "level": "H3",
      "text": "Storefronts"
    },
    {
      "level": "H3",
      "text": "Service area businesses"
    },
    {
      "level": "H3",
      "text": "Practitioner listings"
    },
    {
      "level": "H3",
      "text": "Solo practitioner with two listings"
    },
    {
      "level": "H3",
      "text": "Multi-practitioner listings"
    },
    {
      "level": "H3",
      "text": "Practitioners who no longer work there"
    },
    {
      "level": "H3",
      "text": "Listings for employees (not public-facing)"
    },
    {
      "level": "H3",
      "text": "Listings for deceased practitioners"
    },
    {
      "level": "H3",
      "text": "Creating practitioner listings"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joy Hawkins\n          \n            Joy Hawkins\n          \n            Joy Hawkins"
}