{
  "url": "https://moz.com/blog/dusting-the-website-for-spring-optimization-seo-cleaning",
  "slug": "dusting-the-website-for-spring-optimization-seo-cleaning",
  "title": "Dusting The Website For Spring: Optimization and SEO Cleaning - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Spring is here, so why not put some spring cleaning actions through on your website? With that said, let's get straight to the action items. Below is a list of many things you can look for on your site to adjust, add, or remove.",
  "content": "Dusting The Website For Spring: Optimization and SEO Cleaning On-page SEO By: Scott Wyden Kivowitz April 24, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Scott Wyden Kivowitz April 24, 2013 Dusting The Website For Spring: Optimization and SEO Cleaning On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Spring is here, so why not put some spring cleaning actions through on your website? With that said, I'm going to get straight to the action items. Below is a list of many things you can look for on your site to adjust, add or remove. On-site dusting The following are things that you can do on your website to improve the presence on the web. Authorship: Extremely important SEO action item. Google authorship's role in your website's rankings is more important than ever. In addition to being a SEO tactic, it also acts as a conversion tactic. You see, it is estimated that SERPs with authorship enabled receive around 120% more clicks. +1 button: Going along with the Google Plus topic, make sure that you have a +1 button somewhere on your pages and/or posts. Why? Well, Google's Author Rank is using +1 data as part of ranking. So in addition to the marketing benefits of engagement, a simple +1 can help your website rank higher for keywords. Pinterest button: Hopefully you are on Pinterest and pinning, liking and commenting with your customers. If not, hop on it. Then also add the Pin button to your website's pages and/or posts. People love to pin things, so make it easier for them. Metadata: If you're using a WordPress theme similar to ProBlogger and Copyblogger (they're running Genesis), then there are SEO meta settings for every page and post on your website. I personally don't recommend using a theme's SEO settings. In fact, I much prefer WordPress SEO by Yoast - mentioned in this article on WordPress plugins. My reasoning for this is because in addition to providing meta functionality, it incorporates Open Graph for social media and a page analysis feature that is amazing. Open Graph: I might as well move on to Open Graph since I mentioned above. Open Graph is what lets specific titles, descriptions and images show up on websites like Facebook and Google Plus. By using the same WordPress SEO by Yoast plugin, you can specify your image and descriptions for each. Site speed: How fast does your website load? Could it be faster? Use the Google Speed Test tool to find what is slowing it down. Sometimes, simple changes can improve your load speed. Sometimes it requires development work. I like to tell people who if you're over a score of 70 then you're doing well, but to aim for mid 90s. Page speed helps for SEO and for user experience, so don't overlook it anymore. Sometimes slow site speeds can be due to shared hosting that so many websites are using. Broken links: Log into your Google & Bing Webmaster Tools and look at any 404 errors that show up. Fix them by creating new pages in their place or redirect them to another page using 301 redirects. (WordPress users can use this plugin) Index status: Are you preventing important pages from being indexed by search engines? To find out, go to Google and do a search that looks like the following, \"site:seomoz.org\". A search like that will bring up every page that Google has indexed on the domain listed. Dr. Pete shared a fantastic article on the SEOmoz blog that covers all the important search queries that you can utilize to see what content is indexed. The article also has queries that can help for guest post research. [bonus!] It's also worth mentioning that you can also log in to your Google Webmaster Tools panel to view all the URLs indexed by Google. Take advantage of that tool! User experience: To keep people on your website you need to make sure that visitors can browse it easily. As a photographer, I use a related posts plugin that shows other photographs that viewers might be interested in. That technique, used similarly on many major publications like Mashable and Engadget, is a great user experience tip to keep people browsing your website. Off-site dusting The following are things that you can do off your website to improve the presence on the web. Be social: Author Rank isn't 100% confirmed yet, but it's an inevitable ranking system that will soon be on Google, and a form of it will wind up on Bing eventually. To sum up Author Rank; it's where Google uses a combination of their core SEO algorithm and PageRank and combine it with the social activity around your website. For example, your commenting on and off-site, and +1s of your content and the content that you +1. Guest post: Writing a guest post on websites like SEOmoz do many things for your presence. The two most common benefits are the relationships you build in the process and the ability to create a backlink to your website which helps with SEO. Final Note Sometimes dusting your website requires a fresh look. Do some searching on Google for business WordPress themes and find one that suits your needs and provides that fresh look that you've always wanted. Maybe it's a Genesis theme or something else. Either way, change can be good at times. So grab your dust pan, an extra cup of coffee, sit down for a few hours and start cleaning up for spring time, both on and off-site. It's spring, so start fresh. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Dusting The Website For Spring: Optimization and SEO Cleaning"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Dusting The Website For Spring: Optimization and SEO Cleaning"
    },
    {
      "level": "H2",
      "text": "On-site dusting"
    },
    {
      "level": "H2",
      "text": "Off-site dusting"
    },
    {
      "level": "H2",
      "text": "Final Note"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott Wyden Kivowitz\n          \n            Scott Wyden Kivowitz\n          \n            Scott Wyden Kivowitz"
}