{
  "url": "https://moz.com/blog/early-look-at-googles-june-25-algo-update",
  "slug": "early-look-at-googles-june-25-algo-update",
  "title": "Early Look at Google's June 25 Algo Update - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On the morning of June 26th, MozCast registered a record high temperature of 113 degrees. This is an initial investigation into the possible algorithm update, and a potential partial-match domain (PMD) connection.",
  "content": "Early Look at Google's June 25 Algo Update Search Engines By: Dr. Peter J. Meyers June 26, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers June 26, 2013 Early Look at Google's June 25 Algo Update Search Engines If you follow our MozCast Google \"weather\" tracker, you may have noticed something unusual this morning – a record algorithm flux temperature of 113.3°F (the previous high was 102.2°, set on December 13, 2012). While the weather has been a bit stormy off and on since Penguin 2.0 and the announcement of 10-day rolling Panda updates, this one was still off the charts: I’m usually cautious about over-interpreting any single day's data – measuring algorithm change is a very difficult and noisy task. Given the unprecedented scope, though, and reports coming in of major ranking shake-ups in some verticals, I've decided to post an early analysis. Please understand that the Google algorithm is incredibly dynamic, and we’ll know more over the next few days. Temperatures by Category Some industry verticals are naturally more volatile than others, but here’s a breakdown of the major categories we track in order by the largest percentage change over the 7-day average. The temperature for June 25th along with the 7-day average for each category is shown in parentheses: 68.5% (125°/74°) – Home & Garden 58.2% (119°/75°) – Computers & Consumer Electronics 58.1% (114°/72°) – Occasions & Gifts 57.8% (121°/77°) – Apparel 54.8% (107°/69°) – Real Estate 54.1% (107°/69°) – Jobs & Education 50.6% (112°/74°) – Internet & Telecom 49.4% (112°/75°) – Hobbies & Leisure 49.4% (102°/68°) – Health 44.9% (105°/73°) – Finance 44.5% (116°/80°) – Beauty & Personal Care 43.0% (116°/81°) – Vehicles 39.7% (104°/74°) – Family & Community 38.0% (109°/79°) – Sports & Fitness 37.3% (89°/65°) – Retailers & General Merchandise 34.7% (101°/75°) – Food & Groceries 32.4% (107°/81°) – Arts & Entertainment 25.9% (92°/73°) – Travel & Tourism 25.6% (93°/74°) – Law & Government 25.5% (92°/73°) – Dining & Nightlife Every vertical we track showed a solid temperature spike, but “Home & Garden” led the way with a massive 51° difference between the single-day temperature and its 7-day average. Some Sample Queries There are so many reasons that a query can change that looking at individual cases is often a one-way ticket to insanity, but that doesn’t seem to stop me from riding the train. Just to illustrate the point, the query “gay rights” showed a massive temperature of 250°F. Of course, if you know about the Supreme Court rulings announced the morning of June 26th, then this is hardly surprising. News results were being churned out fast and furious by very high-authority sites, and the SERP landscape for that topic was changing by the hour. Sometimes, though, we can spot an example that seems to tell a compelling story, especially when that example hasn’t historically been a high-temperature query. It’s not Capital-S Science, but it can help us look for clues in the broader data. Here are a couple of interesting examples… Example 1: “limousine service” On the morning of June 25th, a de-localized and de-personalized query for “limousine service” returned the following results: http://www.ultralimousineservice.com/ http://www.uslimoservice.com/ http://www.fivediamondslimo.com/ http://www.davesbestlimoservice.com/ http://www.aftonlimousine.com/ http://www.awardslimo.com/ http://www.lynetteslimousines.com/ http://www.chicagolandlimo.com/ http://www.a1limousine.com/ http://www.sterlinglimoservice.com/ The following morning, the Top 10 for the same query was completely rewritten (yielding the maximum possible MozCast temperature of 280°). http://www.carmellimo.com/ http://www.crestwoodlimo.com/ http://www.dial7.com/ http://www.telavivlimo.com/ http://www.willowwindcarriagelimo.com/ http://www.asavannahnite.com/ http://www.markofelegance.com/ http://tomscruz.com/ https://www.legrandeaffaire.com/ http://www.ohare-midway.com/ One possible pattern is that there are no domains in the new Top 10 with either the phrase “limousine service” or “limo service” in them, which could indicate a crack-down on partial-match domains (PMDs). Interestingly, the term “limousine” disappeared altogether in the post-update domain list, although “limo” still fares well. This could also indicate some sort of tweak in how Google treats similar words (\"limo\" vs. \"limousine\"). Example 2: “auto auction” Here’s another query that shows a similar PMD pattern, clocking in at a MozCast temperature of 239°. The morning of June 25th, “auto auction” showed the following Top 10: http://www.iaai.com/ http://www.autoauctions.gsa.gov/ http://www.americasautoauction.com/ http://www.copart.com/ http://www.interstateautoauction.com/ http://www.indianaautoauction.net/ http://www.houstonautoauction.com/ http://www.ranchoautoauction.com/ http://www.southbayautoauction.com/ http://velocity.discovery.com/tv-shows/mecum-auto-auctions Just one day later, all but the #1 spot had changed… http://www.iaai.com/ http://www.copart.com/ http://www.autoauctions.gsa.gov/ http://www.barrett-jackson.com/ http://www.naaa.com/ http://www.mecum.com/ http://www.desertviewauto.com/ http://www.adesa.com/ http://www.brasherssacramento.com/ http://www.voaautoauction.org/ In the first SERP, eight of the top ten had “auto auction(s)” in the URL; in the second, only two remained, and one of those was an official US government sub-domain (even that site lost a ranking spot). Top-View PMD Influence Ultimately, these are anecdotes. The question is: do we see any pattern across the broader set? As luck would have it, we do track the influence of partial-match domains (PMDs) in the MozCast metrics. Our PMD Influence metric looks at the percentage of total Top 10 URLs where the root or sub-domain contains either “keywordstring” or “keyword-string”, but is not an exact-match. Here’s a graph of PMD influence over the past 90 days: Please note that the vertical axis is scaled to more clearly show rises and falls over time. Across our data set, there’s been a trend toward steady decline of PMD influence in 2013, but today showed a fairly dramatic drop-off and a record low across our historical data (back to April 2012). This data comes from our smaller (1K) query set, but the pattern is also showing up in our 10K data set. For reference and further investigation, here are a few examples of PMDs that fell out of the Top 10, and the queries they fell out of (including some from the same queries): \"appliance parts\" – www.appliancepartscenter.com \"appliance parts\" – www.appliancepartscenter.us \"appliance parts\" – www.appliancepartssuppliers.com \"bass boats\" – www.phoenixbassboats.com \"campagnolo\" – www.campagnolorestaurant.com \"divorce papers\" – www.mydivorcepapers.com \"driving school\" – www.dollardrivingschool.com \"driving school\" – www.elitedrivingschool.biz \"driving school\" – www.ferraridrivingschool.com \"driving school\" – www.firstchoicedrivingschool.net \"driving school\" – www.fitzgeraldsdrivingschool.com \"mario game\" – www.mariogames98.com \"monogrammed gifts\" – www.monogrammedgiftshop.com \"monogrammed gifts\" – www.preppymonogrammedgifts.com \"nickelback songs\" – www.nickelback-songs.com \"pressure washer\" – www.pressurewashersdirect.com \"tanzanite\" – www.etanzanite.com \"vibram\" – www.vibramdiscgolf.com \"wine racks\" – www.wineracksamerica.com \"yahtzee\" – www.yahtzeeonline.org I’m not making any statements about the quality of these sites (except nickelback-songs.com), since I haven’t dug into them individually. If anyone wants to take that on, though, please be my guest. The “Multi-Week” Update Recently, Matt Cutts warned of a multi-week algorithm update ending just after July 4th – could this be that update? The short answer is that we have no good way to tell, since Matt’s tweet didn’t tell us anything about the nature of the update. This single-day spike certainly doesn’t look like a gradual roll-out of anything, but it’s possible that we’ll see large-scale instability during this period. Some (Quite a Few) Caveats This is an imperfect exercise at best, and one day of data can be misleading. The situation is also constantly changing – Google claims Panda data is updating 10 days out of every 30 now, or 1/3 of the time, for example. At this early stage, I can only confirm that we’ve tracked this algorithm flux across multiple data centers and there is no evidence of any system errors or obvious data anomalies (we track many metrics, and some of them look relatively normal). Finally, it’s important to note that, just because a metric drops, it doesn’t mean Google pulled a lever to directly impact that metric. In other words, Google could release a quality adjustment that just happened to hit a lot of PMDs, even though PMDs weren’t specifically the target. I would welcome any evidence people have seen on their own sites, in webmaster chatter, in unofficial Google statements, etc. (even if it’s evidence against something I’m saying in this post). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Early Look at Google's June 25 Algo Update"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Early Look at Google's June 25 Algo Update"
    },
    {
      "level": "H2",
      "text": "Temperatures by Category"
    },
    {
      "level": "H2",
      "text": "Some Sample Queries"
    },
    {
      "level": "H3",
      "text": "Example 1: “limousine service”"
    },
    {
      "level": "H3",
      "text": "Example 2: “auto auction”"
    },
    {
      "level": "H2",
      "text": "Top-View PMD Influence"
    },
    {
      "level": "H2",
      "text": "The “Multi-Week” Update"
    },
    {
      "level": "H2",
      "text": "Some (Quite a Few) Caveats"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}