{
  "url": "https://moz.com/blog/early-ranking-factors-data-an-april-linkscape-update",
  "slug": "early-ranking-factors-data-an-april-linkscape-update",
  "title": "Early Ranking Factors Data + an April Linkscape Update - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's that time of the month... There's new data in Linkscape's index, which means Open Site Explorer, Moz's SEO Toolbar, our API and many of our other tools all have new links and metrics. Here are the stats for index 36:...",
  "content": "Early Ranking Factors Data + an April Linkscape Update Moz News By: Rand Fishkin April 5, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 5, 2011 Early Ranking Factors Data + an April Linkscape Update Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's that time of the month... There's new data in Linkscape's index, which means Open Site Explorer, Moz's SEO Toolbar, our API and many of our other tools all have new links and metrics. Here are the stats for index 36: 41,278,073,331 (41.3 billion) URLs 491,446,900 (491 million) Subdomains 114,288,802 (114 million) Root Domains 416,475,264,279 (416 billion) Links Followed vs. Nofollowed 2.23% of all links found were nofollowed 57.63% of nofollowed links are internal, 42.37% are external Rel Canonical - 7.43% of all pages now employ a rel=canonical tag The average page has 60.88 links on it (down from 61.69 last index - this has been dropping from index to index for many months now) 51.50 internal links on average 9.38 external links on average We're in the process of testing some much larger indices, as well as some new processes for index updates that will allow us to maintain several levels of freshness in our dataset. Look for some exciting news on this horizon in the next 2-3 months. In addition to the Linkscape update, I'm excited to share some very early results from SEOmoz's 2011 Search Ranking Factors. The results this year come from two sources - the opinions of SEO professionals via survey AND a broad correlation analysis of Google's results. This morning at SMX Munich, I presented the following slide deck: SMX Munich Keynote: Moz Ranking Factors View more presentations from randfish This is still early data and not fully vetted, so please give a bit more leeway than normal. That said, here were some of the top takeaways for me, personally. Facebook + Twitter are Big. Even if you don't believe that it's having a major impact on the rankings directly, the correlation shows that those sites/pages which perform well in social media outperform in search rankings. If you're in either profession - SEO or social media marketing - you should probably be working to strengthen your skillset on both sides. Partial Anchor Text. This was heavily discussed on several panels today, and the opinions of voters suggest that SEOs have noticed too - exact match anchor text seems to be less powerful than partial match anchor text (at least, sometimes). To be honest, I voted and thought that exact was still stronger, but it could be that Google's getting pickier about spammy, overly precise keyword-match anchors (and that's a good thing, IMO). Exact Match Domains? The correlation this round is strikingly lower than last June's data. Perhaps Google's taken some action here, or maybe other factors are at play, but either way, the votes from the SEOs suggest that we haven't yet seen the bottom of exact match domain name value. Something's Funny About Nofollows. The correlation data here is downright weird. Maybe nofollowed links are simply well-correlated to followed links, maybe Google's actually using some nofollow signals or perhaps, nofollows often come from good places (like social media sites, profiles, blog comments, discussion forums, etc.) that correlate to good, useful, high quality sites/brands. Domain-Wide Signals Matter. After the Panda/Farmer update, no one in SEO should be surprised that Google's looking at domains as well as pages, but the correlation and the strength SEOs ascribed in the voting both surprised me. I'm really excited about the full report and data, which should be released sometime in May. BTW - If you have questions about the correlation data specifics, feel free to post below, but know that we haven't done all the work or released all the data we intend to in the future. As before, we'll be making the entire dataset available so anyone can replicate our results. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Early Ranking Factors Data + an April Linkscape Update"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Early Ranking Factors Data + an April Linkscape Update"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}