{
  "url": "https://moz.com/blog/earl-greys-new-black-hat-paradise",
  "slug": "earl-greys-new-black-hat-paradise",
  "title": "Earl Grey's New Black Hat Paradise - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My personal opinion is that you can't be an SEO \"expert\" without understanding the black hat side of the debate - the techniques that are working, those that don't, how money is made in that sector, and what the latest in hijacking, link spamming and automated content...",
  "content": "Earl Grey's New Black Hat Paradise SEO Events By: Rand Fishkin December 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 14, 2005 Earl Grey's New Black Hat Paradise SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My personal opinion is that you can't be an SEO \"expert\" without understanding the black hat side of the debate - the techniques that are working, those that don't, how money is made in that sector, and what the latest in hijacking, link spamming and automated content looks like. Lucky for us, there's a new addition to the black hat blogger team, namely my good friend (of Newsweek fame), Earl Grey. Earl's promised to keep an eye on Matt, let his detractors know they can bugger off, and give us a glimpse into his world. I'm looking forward to it. p.s. I wonder if, by linking to Earl, I'm putting SEOmoz in danger of losing rankings. I'm not the only one - check out the sorry gang at Boston.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Earl Grey's New Black Hat Paradise"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Earl Grey's New Black Hat Paradise"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}