{
  "url": "https://moz.com/blog/earning-the-link-how-to-pitch-partner-with-5-publisher-personas",
  "slug": "earning-the-link-how-to-pitch-partner-with-5-publisher-personas",
  "title": "Earning the Link: How to Pitch and Partner with the 5 Publisher Personas - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Strategic, informed pitching can be your best bet for earning followed links. Learn how to quickly identify the publisher's perspective, personify it, and communicate effectively to give you the best chance of attaining that well-earned attribution link.",
  "content": "Earning the Link: How to Pitch and Partner with the 5 Publisher Personas Link Building By: Matt Vazquez October 20, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matt Vazquez October 20, 2016 Earning the Link: How to Pitch and Partner with the 5 Publisher Personas Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I stood up from my office chair, stepped behind it and leaned on its back with both hands so I could stare at the email from a new angle. I was silenced by the response of the blogger: “We’ve had a recent policy change here, and we no longer offer followed links. It’s hurting our reputation and being flagged by Google.\" In that moment, the game changed for me. I’ve received some interesting responses from editors and bloggers about links before, but never as adamant and uninformed as this. I realized that I needed to develop a communication strategy for my emails to publishing partners about links. The challenge Content marketing is a great way to amp up the reputation and visibility of your business. This includes well-placed bylines on high-authority sites that cover your market place. From our perspective, it’s completely appropriate to receive an attribution link in return. Creating interesting, authoritative, and valuable content is something my team excels at — that’s not the issue. The issue is working with publishing partners who have preconceived notions about links. Publishers, bloggers, and editors have a wide range of opinions when it comes to links and how they're treated by Google. This can create challenges for content creators who want to submit their work to these publishers but are being refused a link back to their site in their author attribution. A variety of people find themselves in this situation — SEOs, content marketing professionals, freelancers, thought leaders, etc. The fact that people have different opinions on links is not exactly breaking news. My CEO, Eric Enge, does a good job recapping how this nofollow madness came about. So how do you communicate with publishers in these circumstances in a way that’s credible, respectful, and effective? After placing roughly 150 pieces of content on a wide range of sites, I’ve learned that it’s crucial to identify someone’s perspective to effectively communicate with them. There are so many myths and misconceptions about links and how Google treats links — you never know what perspective you’ll be dealing with. This piece will help you quickly identify the perspective at hand, personify it, and from there, help you strategically communicate to give you the best chance of attaining that well-earned attribution link. Step 1 – Pitch properly As Rand Fishkin said in his 2012 Whiteboard Friday, \"Stop link building and start link earning.\" This context is the foundation of all communication with publishing partners. Practice good pitching etiquette and do your homework researching the site. There are many resources that cover this, so I won’t go in-depth here. However, I will touch on my pitching strategy because I truly believe in its effectiveness. When I draft all of my pitch emails, I refer to a sticky note stuck to my monitor that outlines the four sequential questions an editor is going to have when they receive my email: 1. What does this person want? Answer this question in the subject of your email, and in the first sentence. Eric Enge suggests you treat this as your value proposition. 2. Is this credible? Ask yourself the question, “What would make my communication more credible in this person’s eyes?” For example: Name-dropping a big brand that is a part of the collaboration Mentioning an accolade that your writer has earned (e.g. rated top Southern mommy blogger back-to-back years) Highlighting other places the author has been published (e.g. monthly Forbes and USA Today contributor) Mentioning a very specific piece of information that proves you’ve spent a lot of time on their site: “Penny Pens has a lot of tips to share on how to road trip around the Midwest. I think this would complement your travel-heavy July editorial calendar. It would also build nicely off of Christina WritesALot’s piece on Choosing Travel Buddies Wisely.” Speaking directly to their content strategy: “I think that Bobby Beers UCLA Tailgating guide would be a great piece to help promote football ticket sales on your events page.” Worth noting: If you’re unwilling to do the in-depth research that allows you to speak this way, don’t slapdash this communication. Go another route. “I read your recent article on plants and found it very interesting” doesn’t give you any credibility, and it can even hurt you by coming off as insincere. Emails like that already plague editors. Don’t believe me? Check out Michael Smart’s article on how we’ve ruined the compliment approach to pitch introductions. In fact, I’ve even seen software that mimics this approach for marketers that are trying to scale their outreach. The user selects the publication and editor and the software creates an email template that automatically pulls in the title of the last article the editor published. That is how manipulative the email outreach environment has become. 3. Is this valuable? And 4. Will this work? Ask yourself what details would be worth including here. Is the detail crucial to the communication? Would including it prevent the recipient from misunderstanding your offer or not responding? For example, when I pitch writers that work for a big brand, sometimes I mention that we’re not interested in giving or receiving any compensation for the contribution I’m offering. I’ve had experiences where the editor sees the name of my Fortune 100 client and immediately thinks that I’m offering a sponsored post. Or they think that my writer wants payment and will immediately write off the opportunity because they don’t have the budget for another writer at that time. By answering these questions clearly and in this order, I’m helping the editor quickly determine if this is an opportunity that interests them. Assisting editors in being able to make that determination quickly, and prioritizing that over being persuasive, is the best gift you can give them. It shows that you respect their time and will keep the door open for future opportunities. It’s how to begin building trust in a long-term relationship. Side note: Talking about links during pitching I generally don’t talk about links with an editor upfront and often wait until they’ve had a chance to see the completed content. First of all, the attribution link is only one of the benefits we’re looking for (reminder: the others are reputation and visibility). It just doesn’t seem fair to talk to the editor about your author attribution before they see the piece. They don’t know you and want to see that you can deliver something valuable and non-promotional first. It can also come off as unnatural to some editors. Do you really want to risk having your email mistaken for one of the hundreds of spam emails they regularly get promising “high-quality relevant content in exchange for only one dofollowed link!”? Unfortunately, talking about links right away can sometimes trigger an editor to see your content opportunity as low quality. Step 2 – Earn the link Once the editor requests your content, work with the writer or content creators until you have something that you’re proud to represent. Ask yourself this question: “Is this link-worthy?” If the answer isn’t a resounding “Heck yeah,” then you won’t have the leverage that you need later on if you end up in a sticky situation (i.e. if you aren’t given a link or you’re given a nofollow link). In those situations, you need to make a powerful request to remedy the situation. Are you willing to make that request for a piece of content your team created half-heartedly? That’s up to you. You need to decide what type of content you want associated with your personal brand. In short, there are no shortcuts. Earn the editor’s respect and earn the link. Step 3 – Write a simple “white-hat SEO” author attribution and submit For example: Usually no more than two to three sentences Avoid direct-match rich anchor text Link to a page that has high relevance to the author or the content Don’t include more than one to two links Step 4 – When encountering a nofollow link or missing link, communicate strategically Once in a blue moon, when you check to see if an article you’ve submitted has been published, you’ll find a nofollow tag or a missing link. What you SHOULDN’T do in this situation is send an email that justifies or explains why you deserve the link, or why the link is important to you. Don’t make an assumption as to why the link isn’t there. You don’t know what happened. What you SHOULD do is make a simple request. There is no need for the email to be longer than three sentences: “Hi Max, thanks for making Sally McWritesALot’s article look so great. It looks like the link in her attribution is nofollowed. Can you remove that nofollow tag?” The editor’s response will give you hints on how to proceed. Below, I’ve outlined some of the flavors of responses you might get, with a publisher persona associated with each one that will help guide your communication strategy. Skeptical Sally How to identify: Skeptical Sally might respond with something like this (real examples I’ve received): “I don't allow follow links on the site in sponsored or guest content. As I'm sure you are aware, it can dramatically damage our Google ranking. I love Andrea's piece, but can't risk a portion of the site … this is my full-time job — and one that I love. My Google ranking can affect future business opportunities.” “We do not allow dofollow links any longer; this is in an effort to abide by SEO best practices for our blog.” Skeptical Sally’s perspective: Sees links in general as very risky, especially a link that may be associated with a brand Due to their policy change, she now plans to put a nofollow tag on every outbound link, “just to be safe” Has an immediate skepticism of people asking for links Communication strategy: Move on. It is unlikely that Skeptical Sally will be open to a new perspective about links. If you try to educate her on the issue or talk through it, she may even get offended. Oftentimes, it’s just not worth impacting the relationship. After all, there may be ways to collaborate in the future that don’t involve content links (social media cross-promotion, interviews, etc.). Best to say thanks and move on. You still get the reputation and visibility benefits of the article that was published, but you now know that Sally’s site isn’t one where you can expect fair attribution. Pseudo-Smart Steve How to identify: Pseudo-Smart Steve might respond with something like this (real examples I’ve received): “The [client] link is just to [client] and will appear spammy to Google. Big red flag.” Other language to look out for — any mention of “PageRank sculpting” or “retaining link juice” Pseudo-Smart Steve’s perspective: Has absorbed some SEO advice from outdated or unreliable sources Knows that links are important, and wants to cash in on the best way to use them on his site May attempt some type of “page sculpting” strategy to prevent precious PageRank from leaking off of his domain (note that this notion is a myth) Communication strategy: Make an attempt to educate these people, standing shoulder to shoulder with them. Sometimes they are just doing the best they can with the knowledge that they have and are open to new information. For example, if the editor responds, “We prefer to nofollow as it retains the link juice,” then perhaps there is an opportunity to send them a link to a resource that will explain that the PageRank that would have been distributed to that nofollow link is NOT redistributed, it is essentially wasted (such as this Matt Cuts blog post). Important – I wouldn’t recommend explaining SEO concepts in-depth over email. What would be more credible and powerful is to make your point in a sentence or two and then provide a link to a resource that backs up your point from an obviously credible source (Google’s blog, something that contains a quote from Google, a reputable study, etc.). Empowering an editor with the information they need to make their own decision is powerful and helpful. Here are a couple of recently published resources to have bookmarked in case you are in a situation like this: The benefits of external links: Study - Outgoing Links Used As Ranking Signal Fear of linking out is unwarranted: Google's Gary Illyes: I'm Angry News Sites Don't Link Out, It's Stupid Here’s the extent I’d recommend explaining something in the email itself (real example): Me: “Regarding the link, you can nofollow if it’s an absolute sticking point for you. However, we do feel that since the link is going to a relevant page (where you can find more writing by Julia), there won’t be any risk. Also, there are millions of websites linking to [client], so we feel from that standpoint, it’s not really going to raise any red flags.” Editor: “OK — that all works. The nofollow link really isn't a sticking point ... I appreciate your feedback.” Savvy Shelby How to identify: Responses that comment on how a topic relates to user experience, engagement, visibility, or other editorial areas Savvy Shelby’s perspective: Knows what she needs to know about links — that they are important to people, relevant to search engines, and are a form of currency when working with writers and freelancers Knows that there are things that she doesn’t know about links — that search engines and technical marketers know a lot more than she does about exactly how links work Knows that user experience is what really matters — that if a link doesn’t feel valuable to a user and isn’t a gesture to reward a contributor for a brilliant piece (trusting the contributor enough to know that it won’t be harmful), it may not be something she wants to include Communication strategy: If the link was omitted entirely, explain why including that link will positively impact user experience. Will it provide author credibility? Help users find more content that the author has written? Expand on the topic somehow? If the link has a nofollow tag, let the editor know that the author you are working with prefers to have the freedom to include a followed link in their attribution. This is why it’s so important that you’ve earned the link and provided incredibly valuable content to her and her audience. Trust must have been built by now. Side note: Make this editor your best friend. They are your most powerful publishing partner. Oblivious Oliver How to identify: There may not be specific language to look out for here, besides hints that suggest complete apathy or a lack of editorial structure or direction. Look for off-topic content or grammatical errors during your initial research. You probably don’t want to do a lot of work (and build an association) with a site that doesn’t scrutinize the work of their guest contributors. Oblivious Oliver’s perspective: Doesn’t know anything about links or an association between links and search engines He’s willing to do almost anything with links, as long as it doesn’t make the page look bad May be so hungry for original content that he’s willing to sacrifice quality in general Communication strategy: If you’re just realizing that you’re dealing with an Oblivious Oliver at this stage, it may be a sign that you’re not doing enough detailed research on the site upfront. Perhaps there were some hints within content on his site that you could have picked up on. Regardless, at this point it doesn’t matter. Follow through on your word to deliver a high-quality piece of content and move on to the next opportunity. The biggest takeaway here is the simplest one: Email communication around controversial or misunderstood topics (such as links) is difficult. Because of this, it will benefit you to keep your communication in simple editorial vernacular until you have earned the right to talk about links — by providing something valuable. When you identify a Savvy Shelby, cultivate the relationship. And for the rest, I hope that this guide empowers you to respond in a manner that’s more effective and will get you results. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Earning the Link: How to Pitch and Partner with the 5 Publisher Personas"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Earning the Link: How to Pitch and Partner with the 5 Publisher Personas"
    },
    {
      "level": "H2",
      "text": "The challenge"
    },
    {
      "level": "H2",
      "text": "Step 1 – Pitch properly"
    },
    {
      "level": "H3",
      "text": "1. What does this person want?"
    },
    {
      "level": "H3",
      "text": "2. Is this credible?"
    },
    {
      "level": "H3",
      "text": "3. Is this valuable?"
    },
    {
      "level": "H3",
      "text": "4. Will this work?"
    },
    {
      "level": "H4",
      "text": "Side note: Talking about links during pitching"
    },
    {
      "level": "H2",
      "text": "Step 2 – Earn the link"
    },
    {
      "level": "H2",
      "text": "Step 3 – Write a simple “white-hat SEO” author attribution and submit"
    },
    {
      "level": "H2",
      "text": "Step 4 – When encountering a nofollow link or missing link, communicate strategically"
    },
    {
      "level": "H3",
      "text": "Skeptical Sally"
    },
    {
      "level": "H3",
      "text": "Pseudo-Smart Steve"
    },
    {
      "level": "H3",
      "text": "Savvy Shelby"
    },
    {
      "level": "H3",
      "text": "Oblivious Oliver"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Vazquez\n          \n            Matt Vazquez\n          \n            Matt Vazquez"
}