{
  "url": "https://moz.com/blog/easy-local-link-building-tactics-whiteboard-friday",
  "slug": "easy-local-link-building-tactics-whiteboard-friday",
  "title": "Easy to Implement Tactics for Local Link Building — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google’s local algorithm demands different tactics for link building. And even if you don't need local SEO, local link building strategies can still give you a different perspective and improve your work. In today’s episode, Greg walks you through some easy to implement local SEO tactics.",
  "content": "Easy to Implement Tactics for Local Link Building — Whiteboard Friday Whiteboard Friday | Local SEO | Link Building By: Greg Gifford June 2, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Greg Gifford June 2, 2023 Easy to Implement Tactics for Local Link Building — Whiteboard Friday Whiteboard Friday | Local SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Google’s local algorithm demands different tactics for link building. And even if you don't need local SEO, local link building strategies can still give you a different perspective and improve your work. In today’s episode, Greg walks you through some of these strategies. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans. I'm Greg Gifford, the COO of SearchLab Digital, and I'm back to do another Whiteboard Friday. Today we're talking tactics for local links. Get it, huh? The important thing to remember is that Google's local algorithm is different, so you need to approach local link building differently. Even if you don't need local SEO, local link-building tactics can still give you a different perspective, and we all know that with a different perspective, you can do better work. Whoa. So the most important thing to understand is that the best links are based on relationships that you have in the real world. They're easier to get and they're more powerful. The other thing to remember is the easiest way to get local links is to turn the clock back and do the things that businesses used to do to get exposure in the local community that everybody kind of stopped doing once we had the internet. So if you just get involved in the local community, you'll naturally acquire a lot of amazing local links. Remember checklist link building rarely works. That's not what I wrote, but I wasn't watching. But yeah, checklist link building doesn't really work. You have to be original. You need unique links to win so that you've got links that your competitors don't have. So don't follow a checklist. Think outside the box. Be creative. So a couple of ideas and tactics that I want to run you through. Sponsorships are great. Now, also I should remind you Google is basically pattern detection. So most importantly, remember that when you look at your link profile, you can't just do one or two things. You have to have a natural mix. But with sponsorships, a lot of people avoid them because they think that you're really buying links because obviously buying links is bad. But Google is totally okay with you buying a sponsorship that results in a link. So Little League, peewee hockey, peewee football, 5Ks, golf tournaments, these are all great things that a lot of businesses are already doing. So find those easy, cheap, awesome local sponsorship opportunities. Knock those out. Charities are great too. So you're not sponsoring an event, you're giving money or donating time to a local charity. That's an awesome link opportunity as well. Volunteer opportunities are great as well. You know, you're taking your team down to feed the homeless at the soup kitchen or anything like that, or highway clean-ups. Things like that are awesome local link opportunities. Local meetups are one of my favorite things to do. So you want to go to a site like meetup.com, and there's a couple of different tactics you can use here. First of all, if you've got some sort of a meeting room or a board room, conference room kind of situation and you're not using it all the time, go on meetup.com, look for local groups that have meetings on a regular basis. Let's say the group has a meeting on the second Monday of every month at 7:00 p.m. but your office is closed at 6:00. So you could offer them your conference room or your meeting area. They've got free Wi-Fi, they've got an awesome big TV they can connect to and etc., and cool, boom, you get a local link out of it. Now, if you don't have a space that you can offer to those local groups, again get on meetup.com or Facebook groups or whatever and look for local groups that are looking for meeting sponsors. Forty, fifty, sixty bucks a month buys their soft drinks and their snacks, and killer local links come right your way. Blogs are great too. Find the local bloggers and get them to write about you. Now, obviously, the blog is going to say, \"Hey, I was given a free widget to write about Greg's widget company,\" but who cares? You still get an awesome link from a local blogger, and even if it's something that seems like it may not be related to what you do, it's still okay because that blogger is in the local area. So even if it's a food blogger or a travel blogger and you give them a free widget to talk about your widget company, doesn't matter. You still get an awesome local link. Local business associations, it's a no-brainer. Better Business Bureau is an amazing one. In fact, Google has just added the Better Business Bureau link into your verification process if you're trying to get reinstated in your Google Business profile. But that's a whole nother Whiteboard Friday that we'll cover later. But join all of those local business associations. They're a no-brainer. Local business directories, couldn't fit that in there, but local business directories are great as well. Join all of them that you can. Even if it's a little bit of a fee to join that business directory, it's still a really killer list of really relevant local links. Local calendar pages are another thing that a lot of businesses don't really think about. There are always different websites or organizations in the local area, and a lot of times it's the city government site or local newspaper or TV that has a calendar page of just community events and you can't get on there if you don't have something event worthy. But if you've got a sales event or a barbecue or some sort of a cookout like that, you get a local link back to your site. You also want to think outside the box. Don't do the same thing that everybody else does. You don't do the same SEO for every client, so you shouldn't do the same link building for every client. So a couple of outside-the-box things. If you work with car dealerships or pediatricians or even personal injury attorneys, child seat installation is a killer tactic. You can have the staff of that location go to a two-day safety course. You can sign up at cert.safekids.org. I didn't have room to get it all on there. But you sit through the safety class and then you are officially certified to be a place that anyone in the community can come for free to get their child seat installed correctly. Because guess what, 99% of us are installing our child seats incorrectly. So if there was an accident, our kids would get injured. So this really makes sense if it's something related to kids or if it's something like personal injury or doctors, really killer. If the business owner or leadership of the business is a member of a certain ethnic group, there are ethnic business directories in every city in the country. So let's say you have an Iranian dry cleaner. I'm pulling that out of the air. There will be a list of Iranian-owned businesses in that area. You can get on that list, and the competitors can't. It's killer. Or if someone is LGBTQIA+, that's a link you can get that again competitors can't get, and there are LGBTQIA+ directories in every city that you can get on. So go look for those if it's applicable to your business. This last one is a really kind of wacky one that people don't really understand the first time I mention it. This isn't about the clubs and organizations that your business is a member of. You want to talk to the staff at your client's business or at your business if you're in-house, especially leadership of the organization, and find out what they're passionate about. What do they do in their free time that they really enjoy doing? What are their hobbies? Because if they're a member of a local club or organization, especially if they're so involved in that club or organization that they're on the leadership board of that organization, guess what, it's going to be super easy to get your business linked from that business' website. This one here, a lot of people are going to laugh at this because it's an old-school technique, but it really works. If you periodically, I'm not saying every week, but periodically you write a local informational blog post of like, \"Hey, our staff loves to go out and grab barbecue every Friday and here are the five best barbecue places in Dallas, according to our staff,\" once you've got that blog post up, you can then do outreach to each of those five locations and say, \"Hey, we listed you as one of the five best places in Dallas.\" Even if it's not related to the business, this is the kind of stuff that shows up in search results. So you get surfaced and you get eyeballs on your business. So it's great for branding. It's kind of that billboard effect, and it gets killer links. The really awesome part that people don't really think about is most of the time, when you're getting these links, you're dealing with people that aren't that technically savvy. So yeah, sure, the people that are technically savvy are going to link to that specific local blog post. But the people that aren't, they're going to link to your homepage. So it's really killer. So a cool story because everybody that knows me knows I'm a story guy. Several years ago, I was speaking at a conference in Vegas and a lawyer came up and he said, \"Hey, man, I know a lot about SEO and I need your help.\" I said, \"Okay, let me help you.\" He said, \"I've got three times as many links as this other attorney in town, yet he outranks me on every single query possible.\" I said, \"Okay.\" The guy again said, \"I know SEO, so I should be winning.\" Well, obviously there's a lot more than just links at play. So what I did, I built a little spreadsheet and I graphed out the link profile of this guy versus his competitor based on Domain Authority. Stick with me, though. It doesn't matter how many links they had, it's just based on the authority. So we see here the guy in red is the guy that I was talking to. So the guy in red has three times as many links as the guy in blue. So when I graph it out, this one right here is Domain Authority of above 50. This one right here is Domain Authority of 11 to 50, and this one right here is Domain Authority below 10. You can see 67% of the guy in blue links are above a 50, and 53% or almost 60% of the guy in red who was the guy asking me for help was below 50. I said, \"All right, there's a story here. Let's break it down a little bit more.\" So this is 91 to 100. This is 71 to 90, 51 to 70, 26 to 50, and 0 to 25. You can see right here that almost a massive section, like 65% of the guy in blue links are above Domain Authority of 7 versus 60% basically of the guy in red that is really low, below a DA of 50. Now, the guy in red wasn't doing local SEO. Even though the guy in red had three times as many links, they all skewed towards the bottom of the authority range because he was getting really horrible links from like seodirectory.com and linksxyz.com, and stupid things like that that wouldn't matter. The important thing to understand is if the guy in red had been doing local SEO and getting local links, this graph would look the same way because local links skew towards lower authority. But the guy in red would have been destroying the guy in blue if he'd been getting local links. So that's the way that you need to change your perspective and think about it differently. If you'd like to do something similar yourself, you can do exactly the same thing with my Badass Link Worksheet. You can download it right here at bit.ly/gregs-bad-ass-link-sheet. That is all lowercase when you type it in. So make sure you do that, or I'm sure they'll drop it down in the blog post or in the comments so that you can click on it there. You can download that sheet. It's an Excel spreadsheet. It does have macros enabled to basically make it easy to clear information out. It's set to work with your Moz link export. You need last month's link export, this month's link export, and your competitor's link export for this month. You drop those in, automatically it's going to graph out all of this stuff. On another tab, it's going to give you a list of all of the link gap opportunities where your competitors have links and you don't. Then on another tab, it's going to give you a list of all the links that you've lost since the last time you did it. Now, yeah, there's some link tools out there that do it too, but this is a really easy tool. It's super killer, and I'm sharing it with you guys today for free. Thank you so much for watching my newest episode of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Easy to Implement Tactics for Local Link Building — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Easy to Implement Tactics for Local Link Building — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Greg Gifford\n          \n            Greg Gifford\n          \n            Greg Gifford"
}