{
  "url": "https://moz.com/blog/easy-link-love-from-higher-ed-websites",
  "slug": "easy-link-love-from-higher-ed-websites",
  "title": "Easy Link Love From Higher Ed Websites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Greetings, I am now officially moving from lurker status to contributor.  Yay!It is oft debated the value of the .EDU TLD and whether the domain itself carries greater weight with the searche engines or if it's just the high value content of the higher education sites.  No matter which side you are…",
  "content": "Easy Link Love From Higher Ed Websites Link Building M By: Marty Martin June 5, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Marty Martin June 5, 2008 Easy Link Love From Higher Ed Websites Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Greetings, I am now officially moving from lurker status to contributor. Yay! It is oft debated the value of the .EDU TLD and whether the domain itself carries greater weight with the search engines or if it's just the high value content of the higher education sites. No matter which side you are on, wouldn't you like to have some easy link love? We're all on the lookout for juicy links from high value websites and the colleges and universities out there have a lot to share, but it's really difficult to get those links...until now. The quick and dirty solution? Do a little research and locate schools who have their alumni or college publications online AND also post their classified ads online. Many of these magazines are directly on the .EDU domain (and those that aren't still have high rankings) and are very cheap. $4.00 to $7.00 USD per word is pretty common. The great thing is they will include your URL as a part of the ad and directly link to your site. Most have archives and the links will typically remain active in the current issue for 2 months. Even better, your classified is in the print version so you're getting a two for one deal. Here's an example- http://harvardmagazine.com/classifieds/classifieds.html That's a good example, but there are better sites out there! (I can't give away all my secrets!) So this concludes my first opportunity to give back to the community. I hope some of you will find it useful and relevant to your work. Cheers! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Easy Link Love From Higher Ed Websites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Easy Link Love From Higher Ed Websites"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marty Martin\n          \n            Marty Martin"
}