{
  "url": "https://moz.com/blog/eat-and-the-quality-raters-guidelines",
  "slug": "eat-and-the-quality-raters-guidelines",
  "title": "E-A-T and the Quality Raters' Guidelines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "EAT — also known as Expertise, Authoritativeness, and Trustworthiness — is a big deal when it comes to Google's algorithms. But what exactly does this acronym entail, and why does it matter to your everyday work? In this bite-sized version of her full MozCon 2019 presentation, Marie Haynes…",
  "content": "E-A-T and the Quality Raters' Guidelines Advanced SEO | Whiteboard Friday By: Marie Haynes September 13, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Marie Haynes September 13, 2019 E-A-T and the Quality Raters' Guidelines Advanced SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. EAT — also known as Expertise, Authoritativeness, and Trustworthiness — is a big deal when it comes to Google's algorithms. But what exactly does this acronym entail, and why does it matter to your everyday work? In this bite-sized version of her full MozCon 2019 presentation, Marie Haynes describes exactly what E-A-T means and how it could have a make-or-break effect on your site. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, Moz fans. My name is Marie Haynes, from Marie Haynes Consulting, and I'm going to talk to you today about EAT and the Quality Raters' Guidelines. By now, you've probably heard of EAT. It's a bit of a buzzword in SEO. I'm going to share with you why EAT is a big part of Google's algorithms, how we can take advantage of this news, and also why it's really, really important to all of us. The Quality Raters' Guidelines Let's talk about the Quality Raters' Guidelines. These guidelines are a document that Google has provided to this whole army of quality raters. There are apparently 16,000 quality raters, and what they do is they use this document, the Quality Raters' Guidelines, to determine whether websites are high quality or not. Now the quality raters do not have the power to put a penalty on your website. They actually have no direct bearing on rankings. But instead, what happens is they feed information back to Google's engineers, and Google's engineers can take that information and determine whether their algorithms are doing what they want them to do. Ben Gomes, the Vice President of Search at Google, he had a quote recently in an interview with CNBC, and he said that the quality raters, the information that's in there is fundamentally what Google wants the algorithm to do. \"They fundamentally show us what the algorithm should do.\"- Ben Gomes, VP Search, Google So we believe that if something is in the Quality Raters' Guidelines, either Google is already measuring this algorithmically, or they want to be measuring it, and so we should be paying close attention to everything that is in there. How Google fights disinformation There was a guide that was produced by Google earlier, in February of 2019, and it was a whole guide on how they fight disinformation, how they fight fake news, how they make it so that high-quality results are appearing in the search results. There were a couple of things in here that were really interesting. 1. Information from the quality raters allows them to build algorithms The guide talked about the fact that they take the information from the quality raters and that allows them to build algorithms. So we know that it's really important that the things that the quality raters are assessing are things that we probably should be paying attention to as well. 2. Ranking systems are designed to ID sites with high expertise, authoritativeness, and trustworthiness The thing that was the most important to me or the most interesting, at least, is this line that said our ranking systems are designed to identify sites with a high indicia of EAT, of expertise, authoritativeness, and trustworthiness. So whether or not we want to argue whether EAT is a ranking factor, I think that's semantics. What the word \"ranking factor\" means, what we really need to know is that EAT is really important in Google's algorithms. We believe that if you're trying to rank for any term that really matters to people, \"your money or your life\" really means if it's a page that is helping people make a decision in their lives or helping people part with money, then you need to pay attention to EAT, because Google doesn't want to rank websites that are for important queries if they're lacking EAT. The three parts of E-A-T So it's important to know that EAT has three parts, and a lot of people get hung up on just expertise. I see a lot of people come to me and say, \"But I'm a doctor, and I don't rank well.\" Well, there are more parts to EAT than just expertise, and so we're going to talk about that. 1. Expertise But expertise is very important. In the Quality Raters' Guidelines, which each of you, if you have not read it yet, you really, really should read this document. It's a little bit long, but it's full of so much good information. The raters are given examples of websites, and they're told, \"This is a high-quality website. This is a low-quality website because of this.\" One of the things that they say for one of the posts is this particular page is to be considered low quality because the expertise of the author is not clearly communicated. Add author bios So the first clue we can gather from this is that for all of our authors we should have an author bio. Perhaps if you are a nationally recognized brand, then you may not need author bios. But for the rest of us, we really should be putting an author bio that says here's who wrote this post, and here's why they're qualified to do so. Another example in the Quality Raters' Guidelines talks about was a post about the flu. What the quality raters were told is that there's no evidence that this author has medical expertise. So this tells us, and there are other examples where there's no evidence of financial expertise, and legal expertise is another one. Think about it. If you were diagnosed with a medical condition, would you want to be reading an article that's written by a content writer who's done good research? It might be very well written. Or would you rather see an article that is written by somebody who has been practicing in this area for decades and has seen every type of side effect that you can have from medications and things like that? Hire experts to fact-check your content Obviously, the doctor is who you want to read. Now I don't expect us all to go and hire doctors to write all of our content, because there are very few doctors that have time to do that and also the other experts in any other YMYL profession. But what you can do is hire these people to fact check your posts. We've had some clients that have seen really nice results from having content writers write the posts in a very well researched and referenced way, and then they've hired physicians to say this post was medically fact checked by Dr. So-and-so. So this is really, really important for any type of site that wants to rank for a YMYL query. One of the things that we started noticing, in February of 2017, we had a number of sites that came to us with traffic drops. That's mostly what we do. We deal with sites that were hit by Google algorithm updates. What we were noticing is a weird thing was happening. Prior to that, sites that were hit, they tended to have all sorts of technical issues, and we could say, \"Yes, there's a really strong reason why this site is not ranking well.\" These sites were all ones that were technically, for the most part, sound. But what we noticed is that, in every instance, the posts that were now stealing the rankings they used to have were ones that were written by people with real-life expertise. This is not something that you want to ignore. 2. Authoritativeness We'll move on to authoritativeness. Authoritativeness is really very, very important, and in my opinion this is the most important part of EAT. Authoritativeness, there's another reference in the Quality Raters' Guidelines about a good post, and it says, \"The author of this blog post has been known as an expert on parenting issues.\" So it's one thing to actually be an expert. It's another thing to be recognized online as an expert, and this should be what we're all working on is to have other people online recognize us or our clients as experts in their subject matter. That sounds a lot like link building, right? We want to get links from authoritative sites. The guide to this information actually tells us that PageRank and EAT are closely connected. So this is very, very important. I personally believe — I can't prove this just yet — but I believe that Google does not want to pass PageRank through sites that do not have EAT, at least for YMYL queries. This could explain why Google feels really comfortable that they can ignore spam links from negative SEO attacks, because those links would come from sites that don't have EAT. Get recommendations from experts So how do we do this? It's all about getting recommendations from experts. The Quality Raters' Guidelines say in several places the raters are instructed to determine what do other experts say about this website, about this author, about this brand. It's very, very important that we can get recommendations from experts. I want to challenge you right now to look at the last few links that you have gotten for your website and look at them and say, \"Are these truly recommendations from other people in the industry that I'm working in? Or are they ones that we made?\" In the past, pretty much every link that we could make would have the potential to help boost our rankings. Now, the links that Google wants to count are ones that truly are people recommending your content, your business, your author. So I did a Whiteboard Friday a couple of years ago that talked about the types of links that Google might want to value, and that's probably a good reference to find how can we find these recommendations from experts. How can we do link building in a way that boosts our authoritativeness in the eyes of Google? 3. Trustworthiness The last part, which a lot of people ignore, is trustworthiness. People would say, \"Well, how could Google ever measure whether a website is trustworthy?\" I think it's definitely possible. Google has a patent. Now we know if there's a patent, that they're not necessarily doing this. Reputation via reviews, blog posts, & other online content But they do have a patent that talks about how they can gather information about a brand, about an individual, about a website from looking at a corpus of reviews, blog posts, and other things that are online. What this patent talks about is looking at the sentiment of these blog posts. Now some people would argue that maybe sentiment is not a part of Google's algorithms. I do think it's a part of how they determine trustworthiness. So what we're looking for here is if a business really has a bad reputation, if you have a reputation where people online are saying, \"Look, I got scammed by this company.\" Or, \"I couldn't get a refund.\" Or, \"I was treated really poorly in terms of customer service.\" If there is a general sentiment about this online, that can affect your ability to rank well, and that's very important. So all of these things are important in terms of trustworthiness. Credible, clear contact info on website You really should have very credible and clear contact information on your website. That's outlined in the Quality Raters' Guidelines. Indexable, easy-to-find info on refund policies You should have information on your refund policy, assuming that you sell products, and it should be easy for people to find. All of this information I believe should be visible in Google's index. We shouldn't be no indexing these posts. Don't worry about the fact that they might be kind of thin or irrelevant or perhaps even duplicate content. Google wants to see this, and so we want that to be in their algorithms. Scientific references & scientific consensus Other things too, if you have a medical site or any type of site that can be supported with scientific references, it's very important that you do that. One of the things that we've been seeing with recent updates is a lot of medical sites are dropping when they're not really in line with scientific consensus. This is a big one. If you run a site that has to do with natural medicine, this is probably a rough time for you, because Google has been demoting sites that talk about a lot of natural medicine treatments, and the reason for this, I think, is because a lot of these are not in line with the general scientific consensus. Now, I know a lot of people would say, \"Well, who is Google to determine whether essential oils are helpful or not, because I believe a lot of these natural treatments really do help people?\" The problem though is that there are a lot of websites that are scamming people. So Google may even err on the side of caution in saying, \"Look, we think this website could potentially impact the safety of users.\" You may have trouble ranking well. So if you have posts on natural medicine, on any type of thing that's outside of the generally accepted scientific consensus, then one thing you can do is try to show both sides of the story, try to talk about how actually traditional physicians would treat this condition. That can be tricky. Ad experience The other thing that can speak to trust is your ad experience. I think this is something that's not actually in the algorithms just yet. I think it's going to come. Perhaps it is. But the Quality Raters' Guidelines talk a lot about if you have ads that are distracting, that are disruptive, that block the readers from seeing content, then that can be a sign of low trustworthiness. \"If any of Expertise, Authoritativeness, or Trustworthiness is lacking, use the 'low' rating.\" I want to leave you with this last quote, again from the Quality Raters' Guidelines, and this is significant. The raters are instructed that if any one of expertise, authoritativeness, or trustworthiness is lacking, then they are to rate a website as low quality. Again, that's not going to penalize that website. But it's going to tell the Google engineers, \"Wait a second. We have these low-quality websites that are ranking for these terms.How can we tweak the algorithm so that that doesn't happen?\" But the important thing here is that if any one of these three things, the E, the A, or the T are lacking, it can impact your ability to rank well. So hopefully this has been helpful. I really hope that this helps you improve the quality of your websites. I would encourage you to leave a comment or a question below. I'm going to be hanging out in the comments section and answering all of your questions. I have more information on these subjects at mariehaynes.com/eat and also /trust if you're interested in these trust issues. So with that, I want to thank you. I really wish you the best of luck with your rankings, and please do leave a question for me below. Video transcription by Speechpad.com Feeling like you need a better understanding of E-A-T and the Quality Raters' Guidelines? You can get even more info from Marie's full MozCon 2019 talk in our newly released video bundle. Go even more in-depth on what drives rankings, plus access 26 additional future-focused SEO topics from our top-notch speakers: Grab the sessions now! Invest in a bag of popcorn and get your whole team on board to learn! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "E-A-T and the Quality Raters' Guidelines"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "E-A-T and the Quality Raters' Guidelines"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The Quality Raters' Guidelines"
    },
    {
      "level": "H2",
      "text": "How Google fights disinformation"
    },
    {
      "level": "H3",
      "text": "1. Information from the quality raters allows them to build algorithms"
    },
    {
      "level": "H3",
      "text": "2. Ranking systems are designed to ID sites with high expertise, authoritativeness, and trustworthiness"
    },
    {
      "level": "H2",
      "text": "The three parts of E-A-T"
    },
    {
      "level": "H3",
      "text": "1. Expertise"
    },
    {
      "level": "H4",
      "text": "Add author bios"
    },
    {
      "level": "H4",
      "text": "Hire experts to fact-check your content"
    },
    {
      "level": "H3",
      "text": "2. Authoritativeness"
    },
    {
      "level": "H4",
      "text": "Get recommendations from experts"
    },
    {
      "level": "H3",
      "text": "3. Trustworthiness"
    },
    {
      "level": "H4",
      "text": "Reputation via reviews, blog posts, & other online content"
    },
    {
      "level": "H4",
      "text": "Credible, clear contact info on website"
    },
    {
      "level": "H4",
      "text": "Indexable, easy-to-find info on refund policies"
    },
    {
      "level": "H4",
      "text": "Scientific references & scientific consensus"
    },
    {
      "level": "H4",
      "text": "Ad experience"
    },
    {
      "level": "H2",
      "text": "\"If any of Expertise, Authoritativeness, or Trustworthiness is lacking, use the 'low' rating.\""
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marie Haynes\n          \n            Marie Haynes\n          \n            Marie Haynes"
}