{
  "url": "https://moz.com/blog/ecommerce-holiday-hot-list-top-10-tips-andtricks",
  "slug": "ecommerce-holiday-hot-list-top-10-tips-andtricks",
  "title": "E-Commerce Holiday Hot List: Top 10 Tips and Tricks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's a slight chill in the air, and you know what that means…holiday season is right around the corner. How can you ensure your e-commerce site is ready to handle the holiday rush?\n\nSimply use this list of the top ten e-commerce tips and tricks to update your site. By considering some of the…",
  "content": "E-Commerce Holiday Hot List: Top 10 Tips and Tricks Conversion Rate Optimization (CRO) By: Fathom Digital Marketing October 11, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Fathom Digital Marketing October 11, 2011 E-Commerce Holiday Hot List: Top 10 Tips and Tricks Conversion Rate Optimization (CRO) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There’s a slight chill in the air, and you know what that means…holiday season is right around the corner. How can you ensure your e-commerce site is ready to handle the holiday rush? Simply use this list of the top ten e-commerce tips and tricks to update your site. By considering some of the most common e-commerce goals, you can implement the best ways to get your site holiday-ready. From increasing visitors and encouraging repeat business to improving your conversion rate, these tips cover all your bases. Find out if your site lands on the naughty or nice list by comparing it to this holiday hot list. Incorporate a ‘time till holidays’ countdown box on your website. Use the stress of the time-crunched holidays to your benefit. Implementing a countdown box reinforces the “scarcity of time” concept, which can lead to impulse buying and increased conversions. Add new shipping options for the holidays. Quite simply, if you can’t ship in the amount of time the consumer wants, you won’t make the sale. If you traditionally offer five-day shipping, add a two-day shipping option for the holidays. The difference in delivery time may only be three days, but it can be the difference between a sale and lost revenue, especially during the closing days of the holiday shopping season. Offer gift cards during the holidays. Buying for others can be stressful, especially if the gift-buyer isn’t familiar with the product they’re buying. Avoid losing sales from overwhelmed visitors by offering gift cards. Offer incentives based on order values. During your peak season, incentivize consumers to spend a little more by promoting things like discounts, extra points for your loyalty program, or free gifts with purchase if consumers spend over a specific amount of money. Be mindful of your margins and make sure your incentives to increase average order values don’t end up costing you more money. Bundle like items. Bundling like items consolidates the upsell process. Don’t just hope that users find all of your related products; make sure they get everything they need with fewer clicks of the mouse. Your bottom line will thank you. Optimize buying guides. Google Product Search includes links to buying guides at the bottom of its Shopping search results pages. Get links to the buying guide page and optimize it by including ‘buying guide’ in the title, metas, headers, content, and other onsite elements. The better optimized the page, the more likely Google will include your buying guide in its Product Search results. Implement a text messaging campaign. It’s no secret that mobile usage is increasing. And while mobile website development may come to mind first, don’t forget about text message marketing (SMS marketing). Text news about hot new products gives text message subscribers unique coupon codes, and you give you the opportunity to see repeat business grow. One additional benefit that SMS marketing provides: it enables you to market to users who don’t yet own smart phones. Ask for newsletter registration on the order confirmation page. If you don’t have one already, create an order confirmation page that renders immediately after a purchase has been made. Make sure the page includes details of the order (product, cost, etc.). This assures the consumer that you received all the proper information, and it affords the opportunity to request newsletter registrations before the consumer leaves the website. Email marketing is a great way to encourage repeat business. Check your SSL certificate. The last thing you want is for a consumer to add products to the cart, click on the checkout button, and then find a message that says the transaction isn’t secure. You should always make sure your SSL certificate is updated, but especially during the peak holiday season. Make sure your site renders properly in the major web browsers. Your website may render differently depending on the web browser. Don’t lose a large amount of sales because your site looks poor or your checkout process doesn’t look credible. The major web browsers are Internet Explorer, Mozilla Firefox, Google Chrome, and Apple Safari. Interested in learning more ways to improve your e-commerce website? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "E-Commerce Holiday Hot List: Top 10 Tips and Tricks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "E-Commerce Holiday Hot List: Top 10 Tips and Tricks"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Fathom Digital Marketing\n          \n            Fathom Digital Marketing\n          \n            Fathom Digital Marketing"
}