{
  "url": "https://moz.com/blog/ecommerce-marketing-investments",
  "slug": "ecommerce-marketing-investments",
  "title": "Easy Marketing Investments to Improve Your E-Commerce Store - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn the best ways to invest time and money into an e-commerce site with a few small-scale investments that can help drive performance on conversions, SEO, and more.",
  "content": "Easy Marketing Investments to Improve Your E-Commerce Store E-Commerce SEO | SEO Basics | Conversion Rate Optimization (CRO) By: Kane Jamison January 25, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kane Jamison January 25, 2017 Easy Marketing Investments to Improve Your E-Commerce Store E-Commerce SEO | SEO Basics | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At least once or twice per month, I talk to a small e-commerce store owner who wants to invest in content marketing. Often times, I have to break it to them that they’re not ready for content marketing. You see, before you spend a bunch of time generating traffic from your target audience, it’s important to make sure those visitors get the best experience possible while browsing your store. So, in this post, I want to give store owners and e-commerce newbies a clear idea of where they can invest their time before investing in more paid and organic traffic to their sites. Many of these can be accomplished for less than $1,000 or a few hours of your time. With a few small-scale investments you can help drive performance on conversions, SEO, and more. So what are they? Rewrite Your Weak Product Descriptions Take Better Product Photography Build Lookbooks & Product Collections Start Adding Product Videos Upgrade Your Review Software & Process Let’s look at these opportunities in detail, and better yet, show you some actual examples of what your site could look like. Rewrite your weak product descriptionsFrom product details to features and benefits, product descriptions must pack a lot of information in a short format. You may have overlooked some missed opportunities. If you answer “no” to any of the following questions, consider investing in improved product descriptions. 1 - Does your current product page copy speak only to your ideal customer?If you’ve built buyer personas for your brand, make sure the copy addresses the appropriate persona’s unique pain points and concerns. Bland descriptions meant to appeal to everyone — or just bots — aren’t as effective. This high chair example from 4moms.com focuses on the three things that matter to their audience: single-handed adjustments, spilt-food prevention, and easy cleanup. 2 - Does your copy focus on benefits rather than features?You can list features all day long, but customers really want to know how your product will make their life better. The Amazon Echo sales page does a great job of focusing less on the technical features of the product, and more on the cool things you can do with it. 3 - Are you describing your product with the same words that your customers use?Using the same language that your customers do will help you better communicate with your target audience in a way that sounds natural for them and touches on their pain points. A simple way to find these words is to do some reverse engineering. Start by looking at customer reviews and feedback you’ve collected (and those of your main competitors as well) to pick out common words and phrases that satisfied customers are using. From here, you can tie that customer language back into your own descriptions. I was shopping for a new tent last week and saw this awesome reviewer on Amazon drive home a point that the copywriters had missed. If you read that entire review, the phrase “family tent” is mentioned about 13 times. But if you read the product description, \"family tent\" only shows up once. The description fails to mention many of the benefits covered by the reviewer: lots of pockets, sleeping arrangements, ability to catch a breeze but keep the doors closed, etc. There’s an opportunity here for a competitor in the tent or outdoor space to improve their own product descriptions for the same tent (or even put together a larger guide to family tents). 4 - Are you telling your product’s story?The folks over at Rogue Brewing understand that the people buying gifts from their website are probably passionate about well-made products, not just well-made beer. Here’s a great example from their site that tells the story of their 28-year search for a decent beer shucker (bottle opener): Take better product photographyPhotography matters. Research from BigCommerce suggests that 67% of consumers consider image quality “very important” when making a purchase online. Good product photos do more than just show shoppers what you’re selling — they provide context and help customers visualize using your products. Plus, high-quality photos will reduce product returns that happen due to misleading images. So what can you do to upgrade your product photos? Smartphones aren't going to cut it Use a DSLR camera, not your smartphone. Although modern smartphone cameras can take higher resolution photos than ever before, you’ll get better results from a DSLR. Lower-end models start at around $500 — try finding a used body online and spending more money on a better & cost-effective fixed lens that can handle video, too. Build a cheap lightbox Create a lightbox for well-lit photos with a solid white background. For less than $10, you can build your own lightbox that will vastly improve the quality of your product images. &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;span id=\"selection-marker-1\" class=\"redactor-selection-marker\" data-verified=\"redactor\"&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;/span&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt; Use creative angles Shoot products from multiple angles. Be sure to include several images on every product page. The more perspectives and viewpoints you have, the better customers will be able to judge your product. It's OK to tweak & process your images to make them pop Process your images with filters that enhance color and overall image quality. Photo filters resolve poor lighting or color issues and vastly improve your product photos. Just try not to get carried away with dramatic filters that distort the color of your products, as this can be misleading for the buyer. Here’s a good example from ABeautifulMess.com showing the difference before and after image edits: If you don’t have time or the inclination to take your own photography, outsource it to a professional. No matter what route you go, know that upgrading your product page photography is well worth the investment. Build lookbooks & product collectionsYou can also provide more context for your products through lookbooks, which showcase your products in use. The term “lookbook” is mostly common in the fashion industry, but the concept can be extended to a variety of industries. The photos in the lookbook for Fitbit’s Alta model of fitness tracker help shoppers envision themselves wearing them. Fitbit’s lookbook also establishes a brand lifestyle promise — impossible with product photos alone. Even better? The various photos are clickable and take you to the product page for that color/style of wristband: Product collections are another great variation on this strategy. In this “Mediterranean Collection” page on Coastal.com, shoppers get an opportunity to shop by “style,” and to see examples of the glasses on actual faces instead of just a white background: As I alluded to before, this isn’t just an opportunity for fashion sites. The trick is to make sure you're showing your products in action. Plenty of other retailers have an opportunity to show off their product in use, like these photos from the Klipsch website showing off their soundbars in various settings: Car accessories? Same thing. Heck, even office furniture is easier to purchase when you see how it looks in a workspace. Start adding product videosAdding video to product pages is another relatively low-budget improvement you can make, yet it has extreme value for shoppers and your bottom line. Why? Because video’s ability to quickly educate shoppers is a powerful conversion tool. Eyeview Digital reported that including video on landing pages can improve conversions by as much as 80%, and ComScore indicated that online shoppers are 64% more likely to buy after watching a video. So how can you put video to work on your product pages? Whether you’re demonstrating a how-to or simply showcasing a product and outlining product details, adding video on your product pages provides a whole new experience for online shoppers that helps overcome purchase objections and answers their questions. Video also allows you to give shoppers a more complete overview of the product and to go beyond static pictures with a story element. These engaging visuals can help shoppers envision themselves using your products in a way that photography alone simply can’t. Zappos is well known for including videos on what seems like every listing, but what’s more impressive to me is how much personality and brand voice they show off. While shopping for boots recently, I have to say Joe was my favorite video personality: Click image to open product video in a new window. If you’re up for taking this on with a DIY approach, it’s reasonably easy to create your own product videos at home with the right equipment. Or, outsource this project to a local professional or videographer for hire. Upgrade your customer reviews software & processIn the current e-commerce landscape, competition is fierce — and there’s always someone willing to deliver cheaper and faster. That’s why social proof is more important than ever before. Research from eConsultancy shows that 61% of consumers indicate they look to product reviews before making a purchase, and that product reviews are 12x more trusted than product descriptions from companies. Customer reviews make your product pages more effective, allowing shoppers to evaluate the product based on real customer opinions — and can help you spot product issues. I’m listing a few common platforms here, but you should really check out Everett Sizemore’s guide to product review software, which has some great insights on the performance of the entire marketplace of product review software options, including technical SEO concerns: BazaarVoice Yotpo Trustpilot PowerReviews Traditional product reviews may not be right for all stores... The best option for you will depend on the tool’s ability to integrate with your store, your preferred functionality, and your budget. Sometimes, traditional product reviews won’t be the best choice for your product or store. In this example from ThinkGeek, they’ve opted to just let people leave Facebook comments rather than any product reviews at all. Which makes sense, because they’re Star Trek garden gnomes, and it’s not like you need to tell people whether they were the right size or not. Even better than Facebook comments, they also solicit product photos via social media on their #geekfamous hashtag. Here’s another example where my favorite wallet company, SlimFold, simply highlights great product reviews that they received from press and customer emails. While it makes it harder for them to solicit new reviews, they only have a handful of products, and this format allows them to put more emphasis on specific reviews. There are many different tools that will allow you to showcase elements of social proof like ratings and reviews, so take your time carefully reviewing different options to see which is the best fit for your needs and budget, and if normal product reviews aren’t the right fit, feel free to take a different approach. Make enough of these small investments and you should see big improvements over the long term.Tackling these small investments — as your schedule and budget allows — will dramatically improve the overall user experience and the effectiveness of your e-commerce store. Consider which aspects are the most important to complete first, and then start doing your research and put together a strategy for how you’ll prioritize these site upgrades. With a well-thought-out plan of action, you can focus on the projects that will drive the best results for your business, rather than trying too many different tactics all at once. Looking for more ideas? Take a look at our guides on product page optimization, category page optimization, and conversion rate improvements for e-commerce. This is by no means the complete guide to investing in your e-commerce store, so in the discussion below, I’d like to hear from you. What creative ways have you improved your e-commerce site content in the past that boosted conversions or organic search? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Easy Marketing Investments to Improve Your E-Commerce Store"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Easy Marketing Investments to Improve Your E-Commerce Store"
    },
    {
      "level": "H2",
      "text": "Rewrite your weak product descriptions"
    },
    {
      "level": "H3",
      "text": "1 - Does your current product page copy speak only to your ideal customer?"
    },
    {
      "level": "H3",
      "text": "2 - Does your copy focus on benefits rather than features?"
    },
    {
      "level": "H3",
      "text": "3 - Are you describing your product with the same words that your customers use?"
    },
    {
      "level": "H3",
      "text": "4 - Are you telling your product’s story?"
    },
    {
      "level": "H2",
      "text": "Take better product photography"
    },
    {
      "level": "H3",
      "text": "Smartphones aren't going to cut it"
    },
    {
      "level": "H3",
      "text": "Build a cheap lightbox"
    },
    {
      "level": "H3",
      "text": "Use creative angles"
    },
    {
      "level": "H3",
      "text": "It's OK to tweak & process your images to make them pop"
    },
    {
      "level": "H2",
      "text": "Build lookbooks & product collections"
    },
    {
      "level": "H2",
      "text": "Start adding product videos"
    },
    {
      "level": "H2",
      "text": "Upgrade your customer reviews software & process"
    },
    {
      "level": "H3",
      "text": "Traditional product reviews may not be right for all stores..."
    },
    {
      "level": "H2",
      "text": "Make enough of these small investments and you should see big improvements over the long term."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kane Jamison\n          \n            Kane Jamison\n          \n            Kane Jamison"
}