{
  "url": "https://moz.com/blog/effective-linkbaiting-48-hours-can-drive-your-website-viral",
  "slug": "effective-linkbaiting-48-hours-can-drive-your-website-viral",
  "title": "Effective Linkbaiting and 48 Hours Can Drive Your Website Viral - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Linkbaiting is one of the most universally effective tactics for promoting a site, both for search engine rankings and short-term traffic boosts. I remember Rand Fishkin saying these words in a guest post on Search Engine Journal way back in 2005. Even today, linkbaiting proves to be an effective…",
  "content": "Effective Linkbaiting and 48 Hours Can Drive Your Website Viral Social Media S By: Sameer Fadnavis March 18, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Sameer Fadnavis March 18, 2009 Effective Linkbaiting and 48 Hours Can Drive Your Website Viral Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Linkbaiting is one of the most universally effective tactics for promoting a site, both for search engine rankings and short-term traffic boosts. I remember Rand Fishkin saying these words in a guest post on Search Engine Journal way back in 2005. Even today, linkbaiting proves to be an effective way for attracting more eye balls to your website and becoming the center of attraction. Though there are many ways of linkbaiting, I would concentrate on one of them in this post: creating a valuable resource that benefits the community. It seems easy for the eyes tor read and ears to hear, but let me tell you, it is the most difficult technique to implement. I will share a case study here to simplify the understanding of how this technique works. February 18, 2009 - McKinsey Quarterly publishes a report on six ways to make Web 2.0 work. The report tries to highlight how organizations can harness the power of Web 2.0 internally due to its popularity and intense consumer engagement. February 19 - 24, 2009 - The report is discussed in blogs, Facebook, Twitter, Linkedin and other social networks. Some appreciate the report while some criticize it. The discussion keeps going... February 24, 2009 - Our team reads the report and tries to gather intelligence from it. After going through it, we realize that the report is a little complex to understand. So we decide to visualize it. February 24 - 28, 2009 - It takes us 5 days to create a visual out of the complex report. But wait, it's not over yet. We need to proofread it and add our intelligence. March 1, 2009 - The visual goes through numerous iterations as we try to make it as easy as possible. Finally, the visual passes the final QA and is slated for a release. March 2, 2009 - The visual is released at http://vizedu.com/2009/03/6-ways-to-make-web2-work/. Within 2 days, people start liking the visual format of the report. We inform McKinsey about the same and they are overwhelmed. People start discovering the presentation through tweets, emails and other networks. Since the presentation can be easily embedded, it goes viral. Withing 48 hours, our presentation sits on the blogs/websites with a PageRank 8, whose SEO meaning is that we are getting backlinks from high PR websites/blogs. Isn't that great? And within such a short period of time. Also, this has become a permanent destination for people to visit and understand the concept. So, with time as more people discover the presentation, they will embed it and thus link to us. Conclusion: People are always looking for original and useful content. If you are able to satisfy their hunger, they will make you or your product/service a champion. So the linkbaiting takeaway for you is \"Create something valuable and useful that helps people and then distribute it. The community will take care of the rest!\" I would conclude by saying \"Content is king.\" I know you have heard it many times, but this is true and I have witnessed this happen in just 48 hours! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Effective Linkbaiting and 48 Hours Can Drive Your Website Viral"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Effective Linkbaiting and 48 Hours Can Drive Your Website Viral"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sameer Fadnavis\n          \n            Sameer Fadnavis"
}