{
  "url": "https://moz.com/blog/efficient-link-reclamation",
  "slug": "efficient-link-reclamation",
  "title": "Efficient Link Reclamation: How to Speed Up & Scale Your Efforts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link reclamation isn’t a new tactic, but this high-ROI activity is becoming more complex. Luckily, there are tool providers that can help optimize your efforts. In this post, learn which tools get the job done and how to apply them to speed up and scale your link reclamation.",
  "content": "Efficient Link Reclamation: How to Speed Up & Scale Your Efforts Link Building | SEO Tools By: Darren Kingman May 2, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Darren Kingman May 2, 2018 Efficient Link Reclamation: How to Speed Up & Scale Your Efforts Link Building | SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link reclamation: Tools, tools everywhere Every link builder, over time, starts to narrow down their favorite tactics and techniques. Link reclamation is pretty much my numero-uno. In my experience, it’s one of the best ROI activities we can use for gaining links particularly to the homepage, simply because the hard work — the \"mention\" (in whatever form that is) — is already there. That mention could be of your brand, an influencer who works there, or a tagline from a piece of content you’ve produced, whether it’s an image asset, video, etc. That’s the hard part. But with it done, and after a little hunting and vetting the right mentions, you’re just left with the outreach. Aside from the effort-to-return ratio, there are various other benefits to link reclamation: It’s something you can start right away without assetsIt’s a low risk/low investment form of link buildingNearly all brands have unlinked mentions, but big brands tend to have the most and therefore see the biggest routine returnsIf you’re doing this for clients, they get to see an instant return on their investment Link reclamation isn’t a new tactic, but it is becoming more complex and tool providers are out there helping us to optimize our efforts. In this post, I’m going to talk a little about those tools and how to apply them to speed up and scale your link reclamation. Finding mentions Firstly, we want to find mentions. No point getting too fancy at this stage, so we just head over to trusty Google and search for the range of mentions we’re working on. As I described earlier, these mentions can come in a variety of shapes and sizes, so I would generally treat each type of mention that I’m looking for as a separate project. For example, if Moz were the site I was working on, I would look for mentions of the brand and create that as one \"project,\" then look for mentions of Followerwonk and treat that as another, and so on. The reasons why will become clear later on! So, we head to the almighty Google and start our searches. To help speed things up it’s best to expand your search result to gather as many URLs as you can in as few clicks as possible. Using Google’s Search Settings, you can quickly max out your SERPs to one hundred results, or you can install a plugin like GInfinity, which allows you to infinitely scroll through the results and grab as many as you can before your hand cramps up. Now we want to start copying as many of these results as possible into an Excel sheet, or wherever it is you’ll be working from. Clicking each one and copying/pasting is hell, so another tool to quickly install for Chrome is Linkclump. With this one, you’ll be able to right click, drag, and copy as many URLs as you want. Linkclump Pro Tip: To ensure you don’t copy the page titles and cache data from a SERP, head over to your Linkclump settings by right-clicking the extension icon and selecting \"options.\" Then, edit your actions to include \"URLs only\" and \"copied to clipboard.\" This will make the next part of the process much easier! Filtering your URL list Now we’ve got a bunch of URLs, we want to do a little filtering, so we know a) the DA of these domains as a proxy metric to qualify mentions, and b) whether or not they already link to us. How you do this bit will depend on which platforms you have access to. I would recommend using BuzzStream as it combines a few of the future processes in one place, but URL Profiler can also be used before transferring your list over to some alternative tools. Using BuzzStream If you’re going down this road, BuzzStream can pretty much handle the filtering for you once you’ve uploaded your list of URLs. The system will crawl through the URLs and use their API to display Domain Authority, as well as tell you if the page already links to you or not. The first thing you’ll want to do is create a \"project\" for each type of mention you’re sourcing. As I mentioned earlier this could be \"brand mentions,\" \"creative content,\" \"founder mentions,\" etc. When adding your \"New Project,\" be sure to include the domain URL for the site you’re building links to, as shown below. BuzzStream will then go through and crawl your list of URLs and flag any that are already linking to you, so you can filter them out. Next, we need to get your list of URLs imported. In the Websites view, use Add Websites and select \"Add from List of URLs\": The next steps are really easy: Upload your list of URLs, then ensure you select \"Websites and Links\" because we want BuzzStream to retrieve the link data for us. Once you’ve added them, BuzzStream will work through the list and start displaying all the relevant data for you to filter through in the Link Monitoring tab. You can then sort by: link status (after hitting \"Check Backlinks\" and having added your URL), DA, and relationship stage to see if you/a colleague have ever been in touch with the writer (especially useful if you/your team uses BuzzStream for outreach like we do at Builtvisible). Using URL Profiler If you’re using URL Profiler, firstly, make sure you’ve set up URL Profiler to work with your Moz API. You don’t need a paid Moz account to do this, but having one will give you more than 500 checks per day on the URLs you and the team are pushing through. Then, take the list of URLs you’ve copied using Linkclump from the SERPs (I’ve just copied the top 10 from the news vertical for \"moz.com\" as my search), then paste the URLs in the list. You’ll need to select \"Moz\" in the Domain Level Data section (see screenshot) and also fill out the \"Domain to Check\" with your preferred URL string (I’ve put \"Moz.com\" to capture any links to secure, non-secure, alternative subdomains and deeper level URLs). Once you’ve set URL Profiler running, you’ll get a pretty intimidating spreadsheet, which can simply be cut right down to the columns: URL, Target URL and Domain Mozscape Domain Authority. Filter out any rows that have returned a value in the Target URL column (essentially filtering out any that found an HREF link to your domain), and any remaining rows with a DA lower than your benchmark for links (if you work with one). And there’s my list of URLs that we now know: 1) don’t have any links to our target domain, 2) have a reference to the domain we’re working on, and 3) boast a DA above 40. Qualify your list Now that you’ve got a list of URLs that fit your criteria, we need to do a little manual qualification. But, we’re going to use some trusty tools to make it easy for us! The key insight we’re looking for during our qualification is if the mention is in a natural linking element of the page. It’s important to avoid contacting sites where the mention is only in the title, as they’ll never place the link. We particularly want placements in the body copy as these are natural link locations and so increase the likelihood of your efforts leading somewhere. So from my list of URLs, I’ll copy the list and head over to URLopener.com (now bought by 10bestseo.com presumably because it’s such an awesome tool) and paste in my list before asking it to open all the URLs for me: Now, one by one, I can quickly scan the URLs and look for mentions in the right places (i.e. is the mention in the copy, is it in the headline, or is it used anywhere else where a link might not look natural?). When we see something like this (below), we’re making sure to add this URL to our final outreach list: However, when we see this (again, below), we’re probably stripping the URL out of our list as there’s very little chance the author/webmaster will add a link in such a prominent and unusual part of the page: The idea is to finish up with a list of unlinked mentions in spots where a link would fit naturally for the publisher. We don’t want to get in touch with everyone, with mentions all over the place, as it can harm your future relationships. Link building needs to make sense, and not just for Google. If you’re working in a niche that mentions your client, you likely want not only to get a link but also build a relationship with this writer — it could lead to 5 links further down the line. Getting email addresses Now that you’ve got a list of URLs that all feature your brand/client, and you’ve qualified this list to ensure they are all unlinked and have mentions in places that make sense for a link, we need to do the most time-consuming part: finding email addresses. To continue expanding our spreadsheet, we’re going to need to know the contact details of the writer or webmaster to request our link from. To continue our theme of efficiency, we just want to get the two most important details: email address and first name. Getting the first name is usually pretty straightforward and there’s not really a need to automate this. However, finding email addresses could be an entirely separate article in itself, so I’ll be brief and get to the point. Read this, and here’s a summary of places to look and the tools I use: Author pageAuthor’s personal websiteAuthor’s Twitter profileRapportive & Email PermutatorAllmytweetsJournalisted.comMail Tester More recently, we’ve been also using Skrapp.io. It’s a LinkedIn extension (like Hunter.io) that installs a \"Find Email\" button on LinkedIn with a percentage of accuracy. This can often be used with Mail Tester to discover if the suggested email address provided is working or not. It’s likely to be a combination of these tools that helps you navigate finding a contact’s email address. Once we have it, we need to get in touch — at scale! Pro Tip: When using Allmytweets, if you’re finding that searches for \"email\" or \"contact\" aren’t working, try \"dot.\" Usually journalists don’t put their full email address on public profiles in a scrapeable format, so they use \"me@gmail [dot] com\" to get around it. Making contact So, because this is all about making the process efficient, I’m not going to repeat or try to build on the other already useful articles that provide templates for outreach (there is one below, but that’s just as an example!). However, I am going to show you how to scale your outreach and follow-ups. Mail merges If you and your team aren’t set in your ways with a particular paid tool, your best bet for optimizing scale is going to be a mail merge. There are a number of them out there, and honestly, they are all fairly similar with either varying levels of free emails per day before you have to pay, or they charge from the get-go. However, for the costs we’re talking about and the time it saves, building a business case to either convince yourself (freelancers) or your finance department (everyone else!) will be a walk in the park. I’ve been a fan of Contact Monkey for some time, mainly for tracking open rates, but their mail merge product is also part of the $10-a-month package. It’s a great deal. However, if you’re after something a bit more specific, YAMM is free to a point (for personal Gmail accounts) and can send up to 50 emails a day. You’ll likely need to work through the process with the whatever tool you pick but, using your spreadsheet, you’ll be able to specify which fields you want the mail merge to select from, and it’ll insert each element into the email. For link reclamation, this is really as personable as you need to get — no lengthy paragraphs on how much you loved [insert article related to my infographic] or how long you’ve been following them on Twitter, just a good old to the point email: Hi [first name],I recently found a mention of a company I work with in one of your articles. Here’s the article:[insert URL]Where you’ve mentioned our company, Moz, would you be able to provide a link back to the domain Moz.com, in case users would like to know more about us?Many thanks,Darren. If using BuzzStream Although BuzzStream’s mail merge options are pretty similar to the process above, the best \"above and beyond\" feature that BuzzStream has is that you can schedule in follow up emails as well. So, if you didn’t hear back the first time, after a week or so their software will automatically do a little follow-up, which in my experience, often leads to the best results. When you’re ready to start sending emails, select the project you’ve set up. In the \"Websites\" section, select \"Outreach.\" Here, you can set up a sequence, which will send your initial email as well as customized follow-ups. Using the same extremely brief template as above, I’ve inserted my dynamic fields to pull in from my data set and set up two follow up emails due to send if I don’t hear back within the next 4 days (BuzzStream hooks up with my email through Outlook and can monitor if I receive an email from this person or not). Each project can now use templates set up for the type of mention you’re following up. By using pre-set templates, you can create one for brand mention, influencers, or creative projects to further save you time. Good times. I really hope this has been useful for beginners and seasoned link reclamation pros alike. If you have any other tools you use that people may find useful or have any questions, please do let us know below. Thanks everyone! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Efficient Link Reclamation: How to Speed Up & Scale Your Efforts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Efficient Link Reclamation: How to Speed Up & Scale Your Efforts"
    },
    {
      "level": "H2",
      "text": "Link reclamation: Tools, tools everywhere"
    },
    {
      "level": "H2",
      "text": "Finding mentions"
    },
    {
      "level": "H2",
      "text": "Filtering your URL list"
    },
    {
      "level": "H3",
      "text": "Using BuzzStream"
    },
    {
      "level": "H3",
      "text": "Using URL Profiler"
    },
    {
      "level": "H2",
      "text": "Qualify your list"
    },
    {
      "level": "H2",
      "text": "Getting email addresses"
    },
    {
      "level": "H2",
      "text": "Making contact"
    },
    {
      "level": "H3",
      "text": "Mail merges"
    },
    {
      "level": "H3",
      "text": "If using BuzzStream"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Darren Kingman\n          \n            Darren Kingman\n          \n            Darren Kingman"
}