{
  "url": "https://moz.com/blog/elements-of-a-great-website",
  "slug": "elements-of-a-great-website",
  "title": "Elements of a Great Website - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Plenty of big companies have Flash websites, you might think, so why not yours? The answer is simple. Complicated Flash websites won't help you sell anything.\n\nThink back to the animated sites you've seen in the past. They might look nice, but they load slowly, especially for users on slow…",
  "content": "Elements of a Great Website Design D By: Devin Mills October 20, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Devin Mills October 20, 2008 Elements of a Great Website Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Plenty of big companies have Flash websites, you might think, so why not yours? The answer is simple. Complicated Flash websites won't help you sell anything. Think back to the animated sites you've seen in the past. They might look nice, but they load slowly, especially for users on slow connections. They can also be awkward to navigate, and they make it difficult for users to bookmark specific pages they'd like to return to. If the purpose of your website is to function like a television commercial, then make is as flashy as you want. Lexus, for example, doesn't sell cars from their website and most of the people who visit their website already know the Lexus brand; therefore, they do not care about a good search engine ranking. People know if they want to find out about Lexus, they can go to www.lexus.com. If your goal for your website is to be listed on the first page of Google, market and sell products, and take money from your customers, you will need a simple and easy to understand design that is search engine friendly. You can get a lot of web design inspiration from looking at highly successful e-commerce sites like Amazon, eBay, and Overstock. Above all, note the ease of navigation and page loading. Anxious customers are never left waiting for slow pages to load. Beyond creating a simple and quick-loading website, there are a number of additional steps you can take to give your users the best experience possible. There are several options when it comes to designing and creating your website. Inexpensive design companies can build, design, and launch your site for as little as $99.00. Prices ranges are as diverse as websites are on the internet. A simple functional website can be very inexpensive, while some more advanced websites cost thousands of dollars. These solutions are great for the design novice, who can afford to spend a little money to ensure that their website is functional while maintaining appealing design elements. It is also a great solution for the business owner who doesn't have the time or resources to build his/her own website, and wants to let someone else take care of that. Another option is to build your website yourself. There are many free web design software platforms available, and if you are willing to put in the work, you have an eye for design, and like the idea of always being in control of your website, these might be the solution for you. Choose Your Domain Carefully For decades, companies would give themselves names like “Acme Supplies” and “AAA Plumbing” in an attempt to find a spot at the front of the phone book. Online, a name like that just won't cut it. If you're competing against hundreds of other companies with the same name, your customers don't stand a chance of finding you, even if they're looking for you by name. It's best to avoid extremely common names or three letter acronyms (like TAG, IBM, or ABC). Instead, choose a name that's unique and easy to spell. While quirky spellings may be cute on a brick and mortar store's sign, you should aim for something that your users will be able to remember and type in to return to later. Google, eBay, and Yahoo have website domain names that relate nothing to the products they sell, but their easy to remember domain names made it hard for people to forget them. As far as the actual name of your business and domain is concerned, there are two major schools of thought. Some people believe strongly in choosing a name that uses keywords related to the product you intend to sell. For a site about paintbrushes, they might use a name like ChicagoPaintbrushes.com. In doing so, a site gives itself a much improved change of ranking well in search engines for keywords related to “Chicago” or “paintbrushes.” The downside to that approach is that it can be hard to build a strong brand around a keyword. Sometimes, random words or even made up words can be a better way to go. This approach also gives you greater long-term flexibility in your product offerings. If your name is something like “Chicago Paintbrushes,” it would be tough to transition to selling anything that wasn't directly related to paintbrushes. Logo Choosing a logo is another important part of branding your site, and your logo should appear somewhere on every single page of your site and every piece of correspondence with your customers. For best results, choose a logo that looks equally clear and attractive in almost any size. You've succeeded with your logo when people see it and immediately identify your business name. Companies like Logo Works can create a professional logo for you at an affordable price. Enhance Your Credibility Even if you have a brand-new website, there are steps you can take to enhance your credibility with potential customers. The presence of a secure site logo or message has been found to dramatically improve conversions, and many commercial services like Hacker Safe (now McAfee Secure) and the Better Business Bureau also offer verification services that you can use to enhance your customers' faith in your company. Display your SSL certificate icon on every single page. People want to know their information is secure. Don't wait until a customer sees the checkout page before they know you are secure; rather, start from the homepage and plant in your customers' mind that their information and future purchases are always secure on your website. It is amazing how many websites do not disclose they have an SSL certificate until the shopping cart. Answer Their Questions Before They Ask When customers have questions, only a small portion will actually contact you to ask. The rest will just leave, never to return. For that reason, it's extremely important to make sure you don't leave your customers wondering when they're close to making a purchase. Before you launch your site, spend a lot of time clicking around and imagining yourself as the customer. Have you left any unanswered questions? If so, find a place to address them, whether it's on your product/sales page, or on a separate FAQ page. In some cases, it might even be worthwhile to create a separate FAQ for each product. That's especially true for highly technical items. If you get additional questions after launch, consider adding those answers to your pages. Let Them Know Who You Are The more contact information you provide to your users, the more comfortable they'll be placing an order with you. It's best if you display a prominent link to contact information on every page of your site. If you can add a picture of yourself or your facility, this can often help. Of course, you need to use a bit of common sense here. If you're a 700-pound tattooed man working out of a dingy basement, pictures are not your friend. To reserve your domain name you can visit sites like GoDaddy or DirtCheap Domains. Follow their easy instructions for reserving your name. Typically domain names cost about $12.00 per year. Scalability When you design your site, you need to do it under the assumption that it will eventually grow and need to handle more than just a few visitors each day. In addition to making your site simple and clear to navigate, you'll want to make sure that the actual file sizes on each page are small enough to load quickly on slow Internet connections. Make sure that all images are optimized for the web to reduce file size, and try to avoid unnecessary graphics or multimedia objects. Don't do this at the expense of the presentation and user experience, but always give careful thought to whether or not something is truly needed. If you're concerned that your site may not be optimized for higher traffic levels, use a tool like WebSiteOptimization's free page tester. They'll let you know where your problems lie and offer helpful suggestions for fixing the most crucial issues. Tailor Navigation to Your Product Line If your site sells just one or two products, there's no need for category navigation or a complicated search feature. Creating a page for each product and including links to each will do the trick. On the other hand, if you're selling thousands of drop ship or affiliate products, you'll definitely want to give users a way to sort through everything effectively. On the other hand, you don' t want to create a structure that's overly complex. If it takes four or five clicks through categories to find a product, that's usually too many. If you absolutely must create a structure that deep, use image menus instead of a text directory. It's easier to be patient as you click through categories if you can look at images to get an idea of what's included in each. Leave Breadcrumbs If you're familiar with the fairy tale “Hansel & Gretel,” you probably remember how the children left a trail of breadcrumbs as they were taken into the forest. By leaving a trail, they reasoned, they'd certainly be able to find their way back home. Unfortunately, animals ate the breadcrumbs in the story, leaving the kids lost in the forest. Luckily, they're much more effective on the Internet. You may have noticed that many popular sites make it easy to find your way back to their homepage without actually hitting the “back” button. If you look at the image below, you'll see the breadcrumbs on an Overstock.com product page. Instead of just dropping you on a page about a handbag, they give you a map of the hierarchy so you can return to “YSL”, “Designer Handbags”, “Designer Store”, “Clothing”, or the homepage. In the end, the most important thing to remember is to make the site as clear as you possibly can. Even if you already have a site set up, take another look at it with clarity in mind. Because the users keep you in business, there's no higher goal than creating a site that's easy for them to use to buy your product. With a little hard work and effective planning, you should have no trouble creating a site that's simple, affordable, and effective at driving sales. No matter how tempting it may be to create a site with only appearances in mind, remember that your goal is to make money, not to win design awards. Summary Your website is the most important aspect of your internet business. Your domain name is the first thing people see that reflects your company. Be selective on your domain name. Your domain name impacts your ranking on search engines, viral and off-line marketing, and repeat business. Choose something that is easy to spell, easy to remember, and uses keywords relevant to your website. If you have to choose between a creative and easy to remember name, or a name with keywords relevant to your business, choose the easy to remember name. Retailers spend millions of dollars making sure their stores are inviting, easy to navigate through, and researching product placement. Their goal is to get each person walking through their doors to spend as much money as possible. Why should your goal be different? Your website is your online store. Remember in web design that bells and whistles win awards, but don't necessarily sell. Simple sells. Your website is your primary employee. It is your greeter, your salesman, and cashier all in one. To be successful it must welcome and invite the visitor to look around, must perceive, anticipate, and answer customer questions, and then make the checkout process as easy and secure as possible. Ask yourself this question when designing your site: \"Would I buy from my site\"? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Elements of a Great Website"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Elements of a Great Website"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Devin Mills\n          \n            Devin Mills"
}