{
  "url": "https://moz.com/blog/elite-retreat-competition",
  "slug": "elite-retreat-competition",
  "title": "Elite Retreat & Competition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The team behind the Elite Retreat conference series has been diligently requesting some press coverage of their San Francisco event in March. I have to say that I'm extremely impressed to hear that they've recruited Guy Kawasaki to speak, and certainly the speakers themselves (Aaron Wall, Darren ...",
  "content": "Elite Retreat & Competition SEO Events By: Rand Fishkin January 30, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 30, 2007 Elite Retreat & Competition SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The team behind the Elite Retreat conference series has been diligently requesting some press coverage of their San Francisco event in March. I have to say that I'm extremely impressed to hear that they've recruited Guy Kawasaki to speak, and certainly the speakers themselves (Aaron Wall, Darren Rowse, Neil Patel, et al.) are leaders in their respective fields. The $4,950 price tag for two days ensures that the audience will be quite exclusive - I'm guessing that somewhere between 15 and 25 people will show up (the organizers have capped attendance at 30), and this is part of their marketing: It’s logical if you think about it. What would be the ultimate in valuable communication with a leader or instructor? One-on-one time. It’s why people mob good speakers after a conference talk: everyone wants to have that few minutes of valuable interaction, that ability to talk about their own situation and hope to gain some insight, even if just a tiny taste. The exclusivity of the first event received some criticism the first time around, but I'm not sure it's well deserved. From the feedback I received, the attendees seemed to be very pleased with the networking opportunities and in-depth, expert-level coverage. It seems to me that ER (forgive the acronym) is trying to position itself more as a consultation workshop for website owners, rather than a true conference. The fundamental problem that I see is how ER can stand up to competition. I know of at least two events planned for rollout in the next 12 months that are designed to go head-to-head with the \"exclusive,\" \"one-on-one\" style of ER (obviously featuring different groups of experts). ER not only has the competition of other events to deal with, but standard SEO service providers as well. Although SEOmoz's price range doesn't compete with ER, they're certainly positioning themselves as an alternative to getting a day or two of in-person consultation on a specific project with many of the experts on this list. What's your opinion? Is ER a long-term business model that has merit? Is the price going to drop in the future? Does the value of having great minds in a sphere together outweigh the personal attention you could receive by buying 10-20 hours of consulting from a single expert? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Elite Retreat & Competition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Elite Retreat & Competition"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}