{
  "url": "https://moz.com/blog/email-marketing-for-linkbait-its-the-distribution-stupid",
  "slug": "email-marketing-for-linkbait-its-the-distribution-stupid",
  "title": "Email Marketing for Linkbait - It's the Distribution, Stupid - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How does linkbait work, from 10,000 feet up? If you look at the big picture, linkbait works because of distribution. And email marketing can be just as great - if not greater - a vehicle for promoting linkbait than social media, because the distribution possibilities are superior, to say nothing of…",
  "content": "Email Marketing for Linkbait - It's the Distribution, Stupid Link Building By: Gabriel Goldenberg May 21, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg May 21, 2008 Email Marketing for Linkbait - It's the Distribution, Stupid Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. How does linkbait work from 10,000 feet up? If you look at the big picture, linkbait works because of distribution. And email marketing can be just as great - if not greater - a vehicle for promoting linkbait than social media, because the distribution possibilities are superior, to say nothing of segmentation. (This post was inspired by Rebecca's non-search post on newsletters, which made me think about how the two could work together.) Just about everyone in search has written about the characteristics of successful linkbait. Catchy titles, humour, knowing your audience, quality graphics, yada yada yada. But what they're missing is that all these great things are meaningless if no one knows about the linkbait content. Distribution is the key factor in linkbait, as Lyndon might tell you. I should know - before playing nice with YOUmozzers and Sphinners, no one paid my writing much attention. So even posts that I put a lot of time and effort into got no link love because I had no way of distributing them. My RSS subscription numbers were pitiful, I had next to no email subscribers (although apparently a certain Rand at SEOmoz subscribed to my old blog one day :D), and no friends on social media to gain distribution there. Therefore, with the right list of linkerati, email marketing can be as potent (if not moreso) than social media. Consider Marketing Sherpa's lists, for example. They have over 200,000 subscribers! Web Marketing Today reports 108,000 subscribers to their free newsletter! Now, some of that is dead weight. I don't check the subscriptions going to my Hotmail address, for instance. That can be pruned. Mind Valley Labs posted about a newsletter telling them to either take action or get off their list (after 6 months of inactivity) and subsequently booted them from the list. You could also get creative and send a newsletter like this one I got from Copeac's affiliate program; it was obviously targeted to those people who hadn't been active on their site for a while/sent conversions to their merchants. By contrast, your success at linkbaiting with social media is limited to the size of the community, or to its daily traffic for Digg, Sphinn, Mixx, and social news type sites. For your future distribution to grow, the community has to grow too. Yet if you've been paying attention to Tamar's posts on Digg, and to other SU, Reddit, and Mixx users, Digg is hemorrhaging members. Oh, it won't go under tomorrow and I'm not close to suggesting that's likely. But with email, you have control over the breadth of the distribution - the quantity of people seeing your linkbait - because you can advertise and do other things (like, ironically, use social media) to grow your list. Email also allows segmentation, and in this way, linkbait can be that much more effective because you can target select members of your list more accurately. Did someone click an email link and then click the Digg button? Add him to your Diggers segment. If you get referrers from someblog.com/wp-admin (cuz you linked to them and it showed up in their Wordpress dashboard), you can also cross-reference the IPs to the traffic generated by the email. That way, you build a segment of bloggers in your email list. Here are 3 other fun things you might do with segmentation and linkbait, inspired by this post on 6 fun things to do with segmentation: Local linkbait - Send your post on Montreal's worst potholes to only those people who've said they're from Montreal or interested in it (you can also do this by cross-referencing logs and geographic location of an IP to the referring email). Reward those people who've been on the list for a while with a special 'loyal members only' giveaway or something. Target your top \"email-to-a-frienders\" (i.e., those who do it on your site so you can track it, vs those who do it straight in their email client) with rewards, acknowledgment, and thank yous. Also consider empowering them and asking for suggestions on future newsletter content; this is a typical community building method that can carry over well if you're building a forum or such. Promote your promoters, right? To resume, email marketing can be a huge asset to distribute your linkbait through. It can even let you do some things with segmentation that regular social media success can't. Liked this? Subscribe to the YOUmoz feed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Email Marketing for Linkbait - It's the Distribution, Stupid"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Email Marketing for Linkbait - It's the Distribution, Stupid"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}