{
  "url": "https://moz.com/blog/emotion-driven-seo",
  "slug": "emotion-driven-seo",
  "title": "How to Close More Sales With Emotion-Driven SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Wish your content led to more sales? Use these emotion-driven SEO tactics to create people-first content that sells.",
  "content": "How to Close More Sales With Emotion-Driven SEO Content Marketing | Marketing Psychology By: Tasmin Lofthouse Edited By: Emilie Martin July 1, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tasmin Lofthouse Edited By: Emilie Martin July 1, 2024 How to Close More Sales With Emotion-Driven SEO Content Marketing | Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Creating optimized content can be seen as a logical, almost formulaic process. Do your keyword research. Identify the search intent. Write a content brief. Create quality content. Follow on-page SEO best practices. Optimize and improve it over time… While the above is quite a rudimentary example, this is often the process people follow when creating content with organic visibility in mind. I get it. You’re writing content because you want people to see it. You want it to perform well organically and be discoverable by your target audience — and following a logical structure can help you tick those boxes. But that doesn’t mean your content has to be devoid of all emotion. If anything, that’s even more reason for why your content should be filled with emotion. If you’ve read Google’s SEO fundamentals on creating helpful, reliable, people-first content, you’ll know they recommend you “focus on creating people-first content to be successful with Google Search, rather than search engine-first content made primarily to gain search engine rankings.” This is where creating emotion-driven SEO really shines. Emotion-driven content puts people first. By weaving emotion into your content, you can tick the SEO boxes while putting your customers at the heart of your content. Keep reading to discover my key tactics for creating emotion-driven optimized content that directly taps into the needs, feelings, and desires of your target audience. What has emotion got to do with SEO, anyway? When you really dig deep into the fundamentals of SEO, it has everything to do with emotion. Search engines use complex, ever-changing algorithms to make sure they are serving the most relevant and highest-quality results for people’s search queries in the search engine result pages (SERPs). How search engines work is far more nuanced than what I can capture in a single sentence. But, if we know the purpose of search engine algorithms is to deliver the most relevant results to the questions being asked, we can fairly assume it’s about keeping the searcher happy. They ask something, and the search engine provides the answer. In turn, SEO is about understanding those search algorithms so you can optimize your websites, web pages, and content to rank higher in search engines. This means you have to create content that aligns with what the searcher is looking for. When you break it down into its most basic parts, it’s clear to see that SEO is about people… and what are people, if not emotional beings? Philosophical musings aside, emotion influences our behavior. We’re far more likely to impulsively buy something if it connects with us on a deeper, more emotional level, as shown by research carried out in 2023. A somewhat morbid case for the importance of emotion, rather than solely relying on logic, comes from the story of a man, Elliot, whose life was forever changed after a tumor in his frontal lobe led to an inability to feel emotion. He was still sound of mind when it came to intellect and logic, but he simply lacked emotional capacity. Now, you may think only having logic to guide you would make you a better decision-maker… right? Wrong! Or, at least, wrong in the case of Elliot, the man detailed in Damásio’s 1994 book, “Descartes' Error: Emotion, Reason, and the Human Brain.” His lack of emotion didn’t make him better at decision-making. It actually meant he struggled making any kind of decision at all. In an interview discussing this topic, António Damásio states “...when you are making decisions any day of your life — and of course, the options you make are going to produce an outcome — good or bad, or something in between — you do not only remember what the factual result is, but also what the emotional result is — and that tandem of fact and associated emotion is critical.” Still not convinced by the power of emotion-driven SEO? Harvard Business Review found that content that triggers an emotional response is far more likely to go viral. With this in mind, how we think and feel can shape our online search behavior. In 2022, a Google Search trends report found searches were driven by heightened emotions. For instance, search interest for terms around “meditation” spiked at 6 am as people were preparing for their day, suggesting people were looking to start their day mindfully. By understanding the emotions of your audience, you can learn how to create content that better satisfies their needs and, in turn, is seen as more relevant, helpful, and of higher quality in the eyes of Google, too. Seven ways to make your content more emotion-driven (so you can close more sales) There is an abundance of on-page SEO guides and checklists you can use to logically improve your content. While these are all well and good, they often overlook the more emotional, human-side of people’s search behavior. Remember, making your content more emotional is about satisfying the emotional processes that go into decision-making. While a search for “10-minute yoga flow” may look logical on the surface. It could be influenced by a myriad of emotionally-charged situations, such as: Someone who's just getting started on their yoga journey and wants to ease in with a 10-minute practiceSomeone whose muscles feel sore and tight after running 10K the day beforeSomeone who wants to squeeze a yoga flow into their day but only has 10 minutes to spare before rushing out the doorSomeone who feels stressed and wants to clear their mind…and the list goes on In fact, if you look at the first-page search results for “10-minute yoga flow,” you’ll find results filled with phrases like “morning yoga stretch for an energy boost,” “10-minute beginners yoga sequence,” or “stretch out stiff, tired and achy muscles.” While a search may appear simple on the surface, the emotions behind the search query can run far deeper. So, here are seven emotion-driven tactics you can use in your content marketing strategy: Map emotion to search intent Understanding search intent is a core component of creating optimized content. Search intent tells us what type of content the person is looking for. Because of that, it can also hint towards their emotional state and why they’re searching. You can now use Moz Pro to decipher the search intent of particular keywords you’re wanting to target, start a 30-day free trial to try it out. There are four primary search intents: Informational intent – People looking for informationNavigational intent – People who know where they want to go and are looking to navigate to a specific website or webpageCommercial intent – People researching options before making a decision or purchaseTransactional intent – People looking to make a purchase Let’s look at how these types of intent can be mapped to emotions. Informational intent As the name suggests, searchers with informational intent want information. They are trying to solve a problem or learn something. As such, we can assume these people will be in a curious or confused emotional state. To tap into their emotional state, use engaging headlines that pique their interest and imply you have the solution they’re looking for. Throughout your content, use clear and concise language that’s well organized, easy to follow, and paired with visual cues. This will make it easier for them to consume your content and get the answers they are looking for. For example, the current top search result for “how to make pancakes” is for an “easy pancake recipe.” The word “easy” is appealing for a baker looking to quickly whip up some pancakes, while the word “recipe” lets them know they can expect instructions when they click through to the landing page. Once on the landing page, the searcher will have a simple 5-step recipe laid out in a well-organized structure complete with nutritional information, photos, and ingredients. Navigational intent Searchers with navigational intent already know where they want to go, and quickly typing the specific details into a Google search bar can be far easier than trying to recall the exact URL. They likely want to get there as fast as possible, so their emotions center around efficiency, convenience, and familiarity. For these people, make sure your metadata clearly indicates what the page is so they can quickly determine if it matches what they’re looking for. SERP features like knowledge cards and sitelinks can make it even easier for people to get where they want to go. As for your content, focus on making it accessible and easy to navigate with smooth internal linking and a good user experience. Creating content for navigational intent is all about making things as easy for your audience as possible. The aim here is to minimize any feelings of frustration. For example, if someone searches for “shreddy fitness app” in Google, the top result is for the Shreddy website. This search result features sitelinks for specific pages that may better satisfy their navigational needs, such as “Join the SHREDDY App” and “SHREDDY70 Challenge.” This makes it easy for them to click through to the specific page they’re looking for. Source: https://shreddy.com/pages/join-now-app If they click the “Join the SHREDDY App” link, they’re taken to a specific app subscription landing page where all the content is geared towards helping them sign up. This eases the customer journey and minimizes frustration by giving them exactly what they were looking for — Conveniently helping them get where they want to go! Oh, and notice how the content itself focuses on customer feelings and desires with quotes like “...feel more confident” or “insane physical transformation.” Commercial intent Searchers with a commercial intent are likely to be comparing options, researching products, or weighing up their choices before making a decision. These people are in a state of consideration. They might be indecisive or cautious as they evaluate and compare their options. To satisfy the emotional needs of these searchers, aim to create helpful content that addresses their research needs, answers their questions and objections, and builds trust. This type of content can put customers' indecisiveness or worries at ease by sharing social proof and trust signals such as reviews, case studies, or comparison tables. Someone trying to find a good hiking trail in Sedona might search for “Best hikes in sedona.” The top search result will draw them in with its title of “Sedona Hiking: Your Ultimate Weekend Guide.” This article sets the scene by introducing Sedona as a picturesque hiking spot before answering common questions such as “When is the best time of year to visit Sedona?” or “How expensive is Sedona?” Source: https://atravelingfairy.com/a-weekend-hiking-guide-to-sedona/ After helping their searcher with these travel questions and suggesting places to stay based on budget, the article dives into a helpful 3-day itinerary of hiking locations. This article basically does all the research for the searcher. It preempts everything the searcher likely wants to know, providing the information in as much detail as possible to help them plan their trip and finalize their hiking plans. Transactional intent Transactional searchers are in buying mode. They’ve done their research, have a good idea of what they want, and are ready to buy. This searcher already has a specific action in mind, and they’re ready to move forward. As such, we can expect them to be feeling decisive, sure, and purposeful. To satisfy these ready-to-buy feelings, transactional content should reinforce that the searcher is making the right decision. Do this by reinforcing the benefits and value proposition of your products or services. Use clear calls-to-action (CTA) and prioritize an easy navigation and user flow to help them move forward. Don’t forget to keep up with those trust signals, either! For example, someone searching for a “lilac stanley tumbler” is likely set on their intention to buy. Once they click through to the product display page (PDP) from their Google search, they’ll be presented with a nicely formatted PDP. Source As well as making it easy for them to choose their desired color and size, this page also features: Professional, quality product photosKey benefitsValue proposition quoteProduct details and specifications, with easy-to-read bullet pointsKey features with eye-catching product photosStar ratings and customer reviews, including customer photosProduct upsells and other product recommendations All these small yet thoughtful touches help build confidence, encouraging the searcher to hit the “add to cart” button to complete their purchase. Writing tip: Focus on uncovering the “why” behind the search query. By doing this, you’ll be able to get closer to the emotions of your target audience and write content that resonates with their motivations, needs, and challenges. This is your chance to dig deeper with your content. Use power words to inspire action Up next, we have power words. There’s no denying that words have an impact. The words you use in your content can be the difference between closing a sale and, well, not closing it. As a conversion copywriter, I know all too well about the importance of choosing your words wisely. There’s a reason why people deeply study the work of copywriting greats like David Ogilvy and Eugene Schwartz to learn how they use words to write effective ad campaigns. Source These people were at the helm of direct response copywriting, using their words to inspire action. One way they did this was by using power words. Power words are persuasive words that trigger an emotional response. The print advert shown above by Eugene Schwartz uses power words like “overnight,” “one-time-only,” “instant,” and “now” to build feelings of urgency and desire in their reader. This advert by Schwartz may be an over-the-top example that verges on the cusp of being what we’d call clickbait today. But, it shows how words can be used to convey emotion and encourage action. The good news is you can take these learnings and apply it by strategically using power words throughout your content. When writing content, think about how you can use power words in: Your meta title and description to encourage people to click through to read your contentThe headline to encourage people to keep readingCTAs to encourage them to take action For their New York City coworking and shared office spaces landing page, Deskpass uses the meta title “The Best Coworking Spaces in NYC, NY - Deskpass.” Using the power word “best” will pique people’s interest, encouraging them to click their link over any other result shown in the SERPs. Source Kinspire, a company that offers virtual occupational therapy for families, uses power words throughout their website’s headings. The H1 on their homepage features power words like “champions” and “anytime, anywhere,” evoking an emotional reaction from their readers. Source On their homepage, the cereal brand Surreal uses the CTA “View our award-winning cereal” to encourage readers to click through to the PDP. The power word “award-winning” builds trust and hints that Surreal is a cut above the rest, positioning them as a leading brand in the world of cereal. Writing tip: St Louis Community College has a helpful “emotional word matrix” article in its student support writing center. It showcases a variety of power words that can be used to evoke certain emotions. Address customer pain-points It sounds basic, but creating content that addresses the challenges and pain points of your target customer goes hand in hand with creating emotion-driven content. When doing keyword research, look for long-tail keywords that hint towards a frequent frustration or challenge faced by your customer. For example, a running shoe company may come across the long-tail keyword “trail running shoes make my foot numb” when doing keyword research. A quick look at the SERP for this query suggests this is an issue many runners face. You’ve now got an emotional thread to pull with a pain point you can weave into your content. Dig deeper into this research by reading forum discussions for people’s firsthand experience with this issue. This search query features a series of Reddit forum results, giving you a chance to see exactly what troubles people regarding this issue. Use this to better understand your target audience’s pain points, ensuring you write content that resonates with their feelings and experiences. Take this research a step further by speaking with your customers directly through surveys and interviews. Use these interactions to ask your customers about their biggest frustrations, pain points, and challenges so you can genuinely understand their experiences. From here, create content that directly addresses their pain points. Make your content human emotion-driven by using the exact words they use to describe their pain points, writing empathically, and offering a genuine solution. Nike’s article on this topic does a great job of painting a picture of what runners experience when they get foot numbness while running with an introductory paragraph that states: “Imagine going for a run and feeling a tingling sensation in your feet. Then, all a sudden, your entire foot goes completely numb — from heel to toe. As a physical therapist who specializes in athletic performance, Carol Mack, D.P.T., C.S.C.S., said she hears about symptoms associated with numb feet fairly often — especially from runners.” Throughout the article, Nike offers genuine advice from professionals, tailoring this to experiences people have during foot numbness and what may be causing this. Be sure to adapt your content format to suit the complexity of their pain points, too. Small pain points may only need a short FAQ response, whereas more complex challenges might benefit from an in-depth guide or eBook. Writing tip: If you’re not sure what content format to create, look at the SERPs for your chosen keywords to see what performs well organically, or experiment with different content types to see what performs best with your audience. Focus on micro-moments We live in a world of instant gratification, largely thanks to technology making it easier than ever for us to get almost anything we want in just a few screen taps. Those moments where people pick up their phone to fulfill an immediate need in that exact moment are known as micro-moments. As such, micro-moment searches are likely to be fuelled by feelings of urgency, impulsiveness, and instant gratification. In short, we want answers, and we want them now. Research also shows that emotion can lead to impulsive purchases. Learning how to build emotion into content targeted towards micro-moments could be a great way to drive those in-the-moment purchases. Understand the micro-moments your target audience is likely to experience so you can create meaningful content that satisfies their immediate needs. There are four main types of micro-moments: “I-want-to-know” moments – When someone is in research mode and trying to find information“I-want-to-go” moments – When someone is looking for something in a particular location or place“I-want-to-do” moments – When someone is trying to complete a task or do something new“I-want-to-buy” moments – When someone is ready to make a purchase or needs help deciding how, where, or what to buy This featured snippet for Culture Trip’s article on the quickest and ultimate road trip across the US answers the question as accurately as possible, right down to the hour. It is a great example of content that satisfies this “I-want-to-know” moment. Throughout all these types of micro-moments, offering quick, succinct answers with easy-to-follow information is key. These people are likely to be searching either with their cell phone or via voice search, so it’s your job to make this content helpful and user-friendly. Writing tip: Remember, micro-moments are highly charged “I-want” moments. Satisfy emotions fuelled by urgency and instant gratification by prioritizing helpful content that delivers the information they want most, right now. Bullet points, supporting visuals, and easy-to-read content will all be appreciated by people during micro-moments. Be genuinely helpful As has been a common theme throughout this guide, your content should be genuinely helpful if you want it to be people-first. Rather than solely focusing on keywords, research your target audience and take time to understand their exact needs. By doing this, you can make your content as helpful as possible. You can identify common problems and questions your audience may have through long-tail keyword research, forums, and review platforms. It’s a simple way to be more human and emotional while still creating valuable content for your target audience. Source The time tracking app, Noko, puts their customers' problems front and center of their landing page copy. The headline on their home page is a customer quote that reads, “My team has gone through four-time tracking apps in the last two and a half years…” This voice of customer (VOC) data helps them create more emotion-driven content by referencing the exact challenges their customers experience with past solutions. From here, they use the rest of the landing page copy to help their target audience solve this problem — positioning Noko as the solution. As well as approaching helpful content from the perspective of your target audience, you can also glean emotion-driven insights from your competitors. Research your competitors to see how they perform. Then, create content that is more helpful than what is already out there. Don’t forget about the E-E-A-T guidelines for creating content rich in experience, expertise, authoritativeness, and trustworthiness. The Search Quality Rater Guidelines by Google can be a good starting point for understanding what Google is looking for when it comes to creating content that meets the needs of your target audience. Helpful content should be flexible to meet your audience’s ever-changing needs. Frequently review content and keep it fresh with the latest information, keeping it relevant to their current needs. Writing tip: Don’t just create content that answers your audience’s questions on a surface level. Think about creating content that genuinely adds value. Bring subject matter experts (SMEs) on board and speak directly with your audience to truly understand the topic and how to create helpful content. Share real stories Stories are emotional. They paint a visual picture for people, leading to a spark of brain activity as we engage with emotional narratives. A study by Motisa also found that emotionally connected customers have a 306% higher lifetime value than those who aren’t emotionally engaged. Research also shows that storytelling arouses customer emotions and can impact their purchasing behavior. Rather than writing informative, matter-of-fact content, weave storytelling techniques into your content to better convey the message to your readers. Appeal to your audience’s emotions by sharing authentic stories that they can relate to. You could do this by sharing customer stories that show you understand their current state before introducing how you or your service or product will help them reach their dream state. Case studies and testimonials can be a great storytelling tool for demonstrating the before-and-after state in a way that resonates with your target audience. Other storytelling techniques you can use throughout your content include the “P-A-S-O” formula, “hero’s journey,” or by using “open loops.” Play around with different storytelling methods and use them to add deeper layers of emotion to your content. Source A powerful example of storytelling can be seen in a 1981 advert by Lego. This advert could have just been focused on the benefits of Lego blocks. Instead, they focused on emotion. They pulled on their readers’ emotions by leaning into the reason why children build Lego and how it makes them feel. Research into Lego’s marketing strategy shows how they use storytelling to evoke emotions in their customers, motivating them to make a purchase and strengthen their brand loyalty. Always’ #LikeAGirl campaign was another emotional feat of storytelling that received an outstanding response. This marketing campaign garnered results, including a higher-than-average lift in brand preference, over 90 million views, and 4.4 billion media impressions — showing just how impactful storytelling can be. Writing tip: Speak to people and give them a chance to share their stories. Customer surveys, interviews, case studies, and testimonials can all be great sources of customer-led stories. Make calls-to-action more desirable You add emotion to even the smallest pieces of copy on your website. Your CTAs are a perfect example of small but mighty copy that can be emotionally powerful. CTAS tend to be action-oriented, making it easy for people to slip into boring, nondescript phrases like “learn more” or “book a call.” While CTAs like these can be found on millions of websites, they don’t exactly inspire action. Instead, you can tap into emotions to make your CTAs more desirable. Instead of saying, “Book a call,” you could say, “Let’s talk about how you can 10x your sales.” Sure, emotion-driven CTAs are longer. But they’re also going to be more impactful. The project management tool Basecamp, does a great job of this. Rather than using a short “Try it now” CTA, they add a layer of emotion by changing this to a longer CTA of “Try it for free, enjoy work more.” They pair this with a short, sticky CTA of “Try it for free” in the bottom-right corner of the screen. Source An emotion-driven CTA lets you add more detail, compelling people to take the action you want them to. Use emotion-driven CTAs to highlight benefits and outcomes, create urgency, and play on emotions of desire or fear. Not every CTA has to be emotion-driven. I appreciate that emotion-driven CTAs can be long, and won’t always be suitable. The best approach for impactful CTAs, in my opinion, is to use a blend of short, snappy CTAs with longer, more emotional ones spread throughout your content. Alternatively, you can pair a short CTA with a click trigger that adds that extra emotional detail. Keeping with a theme of project management tools, Teamwork uses click triggers nicely in their pop-up modal to encourage sign-ups. Source Having to hand over your card details can be a common objection to signing up for new tools. Teamwork overcomes this by pairing their “Get started for free” and “Book a Demo” CTAs with the click trigger “No credit card needed. No catches.” The “No catches” is a relaxed, human way to put those worries at ease. Writing tip: When writing CTA copy, ask yourself, “Will people know what they get when they click through? And does this copy make them want to click?” Make sure the copy makes it clear what happens next. And make it something people will actually want to engage with — using words that provoke emotion or minimize hesitations will help with this. Final thoughts – Win more customers with emotion-driven SEO SEO content doesn’t have to be matter-of-fact. It can be both helpful and compelling. You just need to sprinkle some emotion into your content. By prioritizing emotion-driven SEO, you’ll naturally create content that is more helpful and desirable to your audience. In turn, this content can better meet the people-first needs of Google’s algorithm and just might support your organic performance. And, as shown by lots of research mentioned throughout this article, leading with emotion can drive more sales. I encourage you to review your content and consider ways you can add more emotion. Think about: What is the intent behind your content? How might those searchers feel?Are you using power words in your headlines or page titles?Does your content empathize with your target audience’s pain points? Does it offer genuinely helpful solutions?What micro-moments might your audience experience? How can you create helpful content to satisfy their feelings of urgency?Does your content actually help your customers with real problems? Are you using their exact words to inform your content?Do you use any storytelling techniques?How emotional are your calls to action? Enjoy reviewing your content and leveling up your emotion-driven SEO! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "What has emotion got to do with SEO, anyway?"
    },
    {
      "level": "H2",
      "text": "Seven ways to make your content more emotion-driven (so you can close more sales)"
    },
    {
      "level": "H3",
      "text": "Map emotion to search intent"
    },
    {
      "level": "H4",
      "text": "Informational intent"
    },
    {
      "level": "H4",
      "text": "Navigational intent"
    },
    {
      "level": "H4",
      "text": "Commercial intent"
    },
    {
      "level": "H4",
      "text": "Transactional intent"
    },
    {
      "level": "H3",
      "text": "Use power words to inspire action"
    },
    {
      "level": "H3",
      "text": "Address customer pain-points"
    },
    {
      "level": "H3",
      "text": "Focus on micro-moments"
    },
    {
      "level": "H3",
      "text": "Be genuinely helpful"
    },
    {
      "level": "H3",
      "text": "Share real stories"
    },
    {
      "level": "H3",
      "text": "Make calls-to-action more desirable"
    },
    {
      "level": "H2",
      "text": "Final thoughts – Win more customers with emotion-driven SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Tasmin Lofthouse\n          \n            Tasmin Lofthouse\n          \n            Tasmin Lofthouse"
}