{
  "url": "https://moz.com/blog/engaging-industry-landing-pages-whiteboard-friday",
  "slug": "engaging-industry-landing-pages-whiteboard-friday",
  "title": "Making Industry Landing Pages Engaging for B2B Companies – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how to transform your industry landing pages into powerful sales enablement tools for B2B success. Discover the key strategies to bridge the gap between search relevance and customer expectations in this Whiteboard Friday.",
  "content": "Making Industry Landing Pages Engaging for B2B Companies – Whiteboard Friday Whiteboard Friday | Search Engines | Content Marketing By: Jason Dodge October 6, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jason Dodge October 6, 2023 Making Industry Landing Pages Engaging for B2B Companies – Whiteboard Friday Whiteboard Friday | Search Engines | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy Moz fans. On this edition of Whiteboard Friday, I'm gonna be talking to you about how we make industry landing pages more engaging for B2B audiences. See, there's this big misconception for most of us in digital marketing and certainly as SEOs, that if we create industry vertical landing pages, we automatically unlock, that's like the secret unlock to being able to attract those type of customers. So we want to do business in the aerospace industry, the automotive industry, healthcare, pharma. So we prop up different individual industry vertical landing pages to target those people. But unfortunately, the SERPs and search in general, is consumer driven. So for as much global commerce that is done in the B2B space for the companies that supply the products and manufacture the equipment that make all of the household brands that we know, there's a lot of other companies out there that we can work with. Relevancy vs reality And unfortunately, the relevancy, the relevancy that we create for those pages in search doesn't always match up with the reality or what Google thinks those pages are about or what the industry thinks that those pages are about. So I'm gonna work my way from the bottom up on this and really, there's some key points that we need to think about here. The root of your industry landing page The root of your industry landing page at the end of the day should be sales enablement. So from a marketing perspective, it shouldn't be going out to create an industry page that is just strictly purpose built to generate traffic from a search perspective, because you can't get hung up on the actual volume. Keyword volume and your typical keyword research process isn't really going to matter here. This isn't gonna be a determining factor for these pages because a lot of times, whatever database you're using to pull those keyword volumes from, it's gonna be really small, almost next to nothing. In addition to the SERPs are really not a kind place for those of us in the B2B marketing space. If you think about sales enablement for a moment and you look at the brands that show up in popularity for the SERPs, they're hardly ever really intricate B2B brands. So sales enablement is really our goal with these landing pages, and we wanna talk about the problem, but you have to ask yourself, is the problem that I'm talking about truly unique to that landing page or to that industry? And how I can highlight that on the landing page itself. Understand your customer So the thing you want to challenge yourself with is how do you understand your customer? How do you identify and understand their pain points and their expectations? What are their expected outcomes that they're gonna get from this? So researching those needs and expectations and having this realization that you are, you're speaking to humans about a lot of these types of products and equipment, there's a lot of human capital involved and research that goes into it. So we're not speaking into a database per se, we're using the language and the cultural terms that these different individuals are using. So if you take for instance, terms such as Industry 4.0 or industrial IoT, you know, industry 4.0 is just a fancy term that manufacturers and the auto industry coined for digital transformation. That's really what it means. Industrial IoT is the same thing as IoT or the internet of things in a consumer world. It's the connectivity of equipment and people to our devices and data feedback loops and things of that nature. So there really isn't a whole lot unique happening there. But what happens is is CMOs enter the room and we say, Hey, we need to sell more widgets to the aerospace industry. So we prop pages up in aerospace and automotive and healthcare, but rarely do those that we make relevant does it meet the reality of what the searcher intent is or what they're actually seeking. So again, I guess just in closing, I would remind you to really identify the pain points initially, research the needs and expectations. So get in the room with the subject matter experts, but take it a step further. And if you can, get with the sales team, go on consults, go to the manufacturing facilities and really do some active listening and some critical thought processes to help actually identify what those unique pain points are. Don’t get hung up on search volume Don't get hung up on the search volumes that you're gonna get out of any tool you're using, because odds are that shouldn't be a determining factor because the numbers are gonna be so small. The SERPs are not kind to B2B. So give yourself some grace. Develop some content for landing pages to make them better, make them more sales enablement focused. That can be inclusive of things such as case studies, projects that you've worked on, special certifications that that industry might actually care about. But again, that page isn't designed necessarily to rank first and foremost, that page should be designed to do the virtual handshake and bring people together and bring them in and make it more engaging for your brand so you can actually start to win the content that makes sense for the types of customers that you're trying to attract. And with that, I hope that was helpful and I wish you good luck. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Making Industry Landing Pages Engaging for B2B Companies – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Making Industry Landing Pages Engaging for B2B Companies – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Relevancy vs reality"
    },
    {
      "level": "H2",
      "text": "The root of your industry landing page"
    },
    {
      "level": "H2",
      "text": "Understand your customer"
    },
    {
      "level": "H2",
      "text": "Don’t get hung up on search volume"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Jason Dodge\n          \n            Jason Dodge\n          \n            Jason Dodge"
}