{
  "url": "https://moz.com/blog/ensuring-client-collaboration-through-agile-marketing",
  "slug": "ensuring-client-collaboration-through-agile-marketing",
  "title": "Ensuring Client Collaboration Through Agile Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm probably a little late for the agile marketing train. It's only in the past few weeks that I've been reading everything I can about the concept, and I've been wor...",
  "content": "Ensuring Client Collaboration Through Agile Marketing Marketing Industry By: Mackenzie Fogelson September 6, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson September 6, 2012 Ensuring Client Collaboration Through Agile Marketing Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I’m probably a little late for the agile marketing train. It’s only in the past few weeks that I’ve been reading everything I can about the concept, and I've been working to integrate some of the ideas I’ve discovered into our existing daily practices at my company, Mack Web Solutions; I can already see that it is going to be a very powerful approach for us. Agile has been such a huge part of my last few weeks that I'd like to share my newfound appreciation and takeaways, and hopefully you'll fall just as hard as I did for this wonderful practice. Agile marketing is not rocket science Maybe I’m missing some hidden depths, but I think the simplicity of agile is the point. It’s meant to be extremely practical, easy to grasp, and begging for you to take it for a spin. Who doesn’t want a company that can adapt quickly to change, provide amazing experiences for their team and their clients, measure the results of their efforts with actual data, and efficiently create remarkable products? When I first started reading about the concept, I realized that Mack Web was a natural fit for agile marketing. At our current size of four, we are inherently collaborative and can be extremely flexible with how we work. I can certainly see how it will play a significant role in shaping our company in the years and team members to come. What the heck is it? Simply put, agile marketing centers around the customer. It’s a small shift in focus and perspective, but it really does mean big changes for how you work with your team and your customers. Based off the methods of agile software development, agile marketing pulls together a variety of different elements to create a sleek, flexible, data-driven approach to any project. There are a lot of technical aspects to it: shorter production cycles, continual testing, lots of analysis and feedback. But the underlying philosophy of the thing is, in a word: people. Agile marketing forces you to break down the barriers that normally come with departments, systems, and processes. Instead of letting your processes drive (as I have now realized we are guilty of doing), the agile process is people-oriented, both internally and externally. It is the interaction among these people that contributes to success (which makes a lot more sense than asking that of a systematized process). Agility in marketing centers on the understanding that clients and employees are people with different skill sets, different outlooks, and different limitations. Agile encourages groups to find a way to make differences work in a complementary (as opposed to adversarial) way, and then ground the process in the indisputable facts of solid data. All you’re left with is pure win. Encouraging the individuals on your team to collaborate fosters creativity and communication, allowing them to deliver exceptional products, services, and valuable results each day. That collaboration, along with the transparency that true teamwork requires, is what makes agile successful. See...Agility. Teamwork. They go together (except that there's no Denzel). Being agile is using what you've got The beauty of agile marketing is that it is, by definition, very adaptable. The entire intent is to enable you to run things smoothly and efficiently with the pieces you have in place. That means that even adopting agile as a new method can be done with agility. Our company has long been process-driven because we got both results and peace of mind that way. But as we’ve grown more self-aware, we’ve realized that part of the reason our processes work is that we were subconsciously enacting some agile principles almost by default. Now that we’ve come to this realization, we’re slowly transitioning our conscious process to match. This approach is working because, honestly, throwing all of our current systems out the window at once was very much a baby-bathwater situation. It’s also a great way to make sure that business tanks, that our clients feel insecure and unsatisfied, and that our office descends into chaos. Not good. And definitely not agile. So, slowly but surely, we’re using the principles of agile marketing as a filter for our internal processes: does this method actually work for all clients? For the individuals on our team? Does it allow us to easily change course mid-stream or does it put us between a rock and a hard place? So far, so good. Agile and your 'team' With agile marketing, even the concept of your ‘team’ takes on a new meaning. For example, instead of maintaining the walls of separate departments like SEO, design, link building, social media, and content generation, everyone works together as a unified whole. And, not just your team, but with your client’s team as well. For us, this was extremely important. My discovery of agile marketing came at a perfect time. As we transition our clients away from their traditional understanding of SEO, we’ve also started looking for new clients who understand that the work we do is demanding and goes beyond just keyword research and link building. To actually deliver real company stuff, help them build relationships in their online community, and work towards their business objectives, we rely on their involvement in the process. Internally, we’ve established a highly collaborative environment; we thrive as a team. Our ideal clients embrace the spirit of participation and are willing to engage with us, to be active and responsive, and to grasp the magnitude of what it will take to succeed. What we have found (and there’s no surprise here) is that in order to achieve results, the client has to be on board. We truly integrate ourselves into the client’s world. We learn everything there is to know about their company. We become familiar with their customers’ pain points and challenges. We solve issues that save them time and money. We can’t do this without complete participation from the client. For us, client collaboration is imperative for customer satisfaction and success. It’s also a fundamental principle of agile marketing. How agile is helping to solve client collaboration challenges Agile has helped us to solve a common problem that we were having when it came to things like ongoing implementation of our content and social media marketing efforts. At the outset, we explained that it was an inherently collaborative process and our clients would smile and nod and say they understood. Then we would all sign a nice, simple agreement stating that we would, jointly, undertake their ongoing implementation and they would pay us for it. A few months later when we had no results to show because we could never get the client to hold up their side of the deal, or because they were expecting more than we were able to provide within the confines of the agreed-upon budget, no one was happy. So, we decided to really take to heart the agile ideas of transparency, flexibility, communication, individual abilities, and collaboration right from the outset. And that’s why we’ve been trying this Before we even go under contract (we’re talking acquisition phase), we have found that this has really helped: Why we think it works This approach is purely transparent. It helps the client to understand exactly what is expected of them, what they are committing to, and what they can expect from us. This also provides a perfect opportunity to discuss budget (remember, we’re not even under contract yet). The level that we’re showing here requires the client to contribute approximately 10 hours of work to achieve desired results. If the client cannot dedicate the internal resources necessary to handle this volume (and they have the luxury of a larger budget), we can take on more and reduce the workload on their internal team. Transparency is necessary for successful collaboration To us, this approach is very agile not only because it’s transparent, but it satisfies the human element and client-centered approach. We understand that every company is made up of people with different skill sets, schedules, and personalities. We have found that people respond well when they understand what is expected of them. When they agree up front to commit to the work, then we have the permission to push and hold them accountable. Remember that with agile, the client is a part of your internal team, not separate from it. This level of transparency has made an enormous difference in the type of clients that we are attracting. (By which we mean, we’re starting to pull in those we actually want to work with). It has been essential to the success of the projects we are working on and certainly with the relationships we’re building. By defining these tasks before the project gets started, everyone involved knows what they’re signing up for. And, even more importantly, they know that there is a lot more involved than \"SEO.\" Once we get under contract, what we do (and what the client does) on a daily basis is obviously a lot more involved than this (we reveal those details in their content and social media marketing strategy). Starting with an agile strategy is what ensures that expectations are clear. We’re setting everyone up for success. As for flexibility, we frequently have clients who start out with good intentions in terms of their participation and then realize how big the commitment (once they’re actually staring at it in-house). With all the tasks spelled out in advance, it becomes pretty easy to reallocate responsibility based on who is best prepared to take it on. No plan survives the first encounter, but a sufficiently fluid plan allows for rapid adaptability. Which is, really, just another way of saying agility. Agile is different for everyone There’s no right way to integrate agile marketing. The concepts are there for you to mold and shape into the right fit for your company and your customers. Agile marketing at Distilled is going to look different from what we do with it at Mack Web. That doesn’t mean either of us are doing it better. It’s just how it fits our specific companies. Agile marketing isn’t really agile unless it works for you, your relationships, your personality, and your culture. (And just as you and your stuff are different from us and our stuff, so too will your version of agile be.) Are you on the agile train? What’s your journey been like with agile? Have you integrated pieces into your company? How’s that working for you? Certainly there’s a lot more to agile than I’ve explained here, but this has been our journey so far. We’re also working on improving our weekly meetings and as the owner, I’m learning how to get out of the way. Call it agile, or call it whatever you’d like. It’s inspiring us to look at what we do in a whole new way so that we can do things better, provide more value for our clients, and enjoy the work that we do each day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ensuring Client Collaboration Through Agile Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ensuring Client Collaboration Through Agile Marketing"
    },
    {
      "level": "H3",
      "text": "Agile marketing is not rocket science"
    },
    {
      "level": "H3",
      "text": "What the heck is it?"
    },
    {
      "level": "H3",
      "text": "Being agile is using what you've got"
    },
    {
      "level": "H3",
      "text": "Agile and your 'team'"
    },
    {
      "level": "H3",
      "text": "How agile is helping to solve client collaboration challenges"
    },
    {
      "level": "H3",
      "text": "And that’s why we’ve been trying this"
    },
    {
      "level": "H3",
      "text": "Why we think it works"
    },
    {
      "level": "H3",
      "text": "Transparency is necessary for successful collaboration"
    },
    {
      "level": "H3",
      "text": "Agile is different for everyone"
    },
    {
      "level": "H3",
      "text": "Are you on the agile train?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}