{
  "url": "https://moz.com/blog/enterprise-seo-2017",
  "slug": "enterprise-seo-2017",
  "title": "State of Enterprise SEO 2017: Overworked SEOs Need Direction - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Enterprise SEO managers are overworked but really good at making do with what they’ve got, while demonstrating ROI continues to be an issue for agencies and in-house SEOs. Check out these findings and more from the State of Enterprise SEO survey.",
  "content": "State of Enterprise SEO 2017: Overworked SEOs Need Direction Advanced SEO | Marketing Industry By: Nicole DeLeon September 5, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Nicole DeLeon September 5, 2017 State of Enterprise SEO 2017: Overworked SEOs Need Direction Advanced SEO | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This survey and its analysis was co-authored with North Star Inbound's senior creative strategist, Andrea Pretorian.In the spring of 2017, North Star Inbound partnered up with seoClarity and BuzzStream to survey the state of enterprise SEO. We had a fair share of anecdotal evidence from our clients, but we wanted a more objective measurement of how SEO teams are assembled, what resources are allocated to them, what methods they use, and how they perform. We hadn’t seen such data collected, particularly for enterprise SEO. We found this surprising given its significance, evident even in the number of “enterprise SEO tools” and solutions being marketed. What is enterprise SEO?There is no single fixed-industry definition of “enterprise” beyond “large business.” For the purposes of this survey, we defined enterprise businesses as being comprised of 500 or more employees. “Small enterprise” means 500–1000 employees, while “large enterprise” means over 1000 employees. Industry discussion often points to the number of pages as being a potential defining factor for enterprise SEO, but even that is not necessarily a reliable measure. What was our survey methodology?We developed the widest enterprise SEO survey to date, made up of 29 questions that delved into every aspect of the enterprise SEO practice. From tools and tactics to content development, keyword strategy, and more, we left no stone unturned. We then picked the brains of 240 SEO specialists across the country. You can check out our complete survey, methodology, and results here. Team size matters — or does it?Let’s start by looking at enterprise team size and the resources allocated to them. We focused on companies with an in-house SEO team, and broke them down in terms of small (500–1000 employees) and large enterprise (>1000 employees). We found that 76% of small enterprise companies have in-house SEO teams of 5 people or less, but were surprised that 68% of large enterprise companies also had teams of this size. We expected a more pronounced shift into larger team sizes paralleling the larger size of their parent company; we did not expect to see roughly the same team size across small and large enterprise companies. Interestingly, in larger companies we also see less confidence in the team’s experience in SEO. Of the companies with in-house SEO, only 31.67% of large enterprise teams called themselves “leaders” in the SEO space, which was defined in this survey as part of a team engaged broadly and critically within the business. 40% of small enterprise teams called themselves “leaders.” In terms of viewing themselves more positively (leaders, visionaries) or less (SEO pioneers in their company or else new SEO teams), we did not notice a big difference between small or large enterprise in-house SEO teams. Large enterprise companies should have more resources at their disposal — HR teams to hire the best talent, reliable onboarding practices in place, access to more sophisticated project management tools, and more experience managing teams — which makes these results surprising. Why are large enterprise companies not more confident about their SEO skills and experience? Before going too far in making assumptions about their increased resources, we made sure to ask our survey-takers about this. Specifically, we asked for how much budget is allocated to SEO activity per month — not including the cost of employees’ salaries, or the overhead costs of keeping the lights on — since this would result in a figure easier to report consistently across all survey takers. It turns out that 57% of large enterprise companies had over $10K dedicated strictly to SEO activity each month, in contrast to just 24% of small enterprise companies allocating this much budget. 40% of large enterprise had over $20K dedicated to SEO activity each month, suggesting that SEO is a huge priority for them. And yet, as we saw earlier, they are not sold on their team having reached leader status. Enterprise SEO managers in large companies value being scalable and repeatableWe asked survey takers to rate the success of their current SEO strategy, per the scale mapped below, and here are the results: A smaller percentage of large enterprise SEOs had a clearly positive rating of the current success of their SEO strategy than did small enterprise SEOs. We even see more large enterprise SEOs “on the fence” about their strategy’s performance as opposed to small. This suggests that, from the enterprise SEOs we surveyed, the ones who work for smaller companies tend to be slightly more optimistic about their campaigns’ performance than the larger ones. What’s notable about the responses to this question is that 18.33% of managers at large enterprise companies would rate themselves as successful — calling themselves “scalable and repeatable.” No one at a small enterprise selected this to describe their strategy. We clearly tapped into an important value for these teams, who use it enough to measure their performance that it's a value they can report on to others as a benchmark of their success. Anyone seeking to work with large enterprise clients needs to make sure their processes are scalable and repeatable. This also suggests that one way for a growing company to step up its SEO team’s game as it grows is by achieving these results. This would be a good topic for us to address in greater detail in articles, webinars, and other industry communication. Agencies know best? (Agencies think they know best.)Regardless of the resources available to them, across the board we see that in-house SEOs do not show as much confidence as agencies. Agencies are far more likely to rate their SEO strategy as successful: 43% of survey takers who worked for agencies rated their strategy as outright successful, as opposed to only 13% of in-house SEOs. That’s huge! While nobody said their strategy was a total disaster — we clearly keep awesome company — 7% of in-house SEOs expressed frustration with their strategy, as opposed to only 1% of agencies. Putting our bias as a link building agency aside, we would expect in-house SEO enterprise teams to work like in-house agencies. With the ability to hire top talent and purchase enterprise software solutions to automate and track campaigns, we expect them to have the appropriate tools and resources at their disposal to generate the same results and confidence as any agency. So why the discrepancy? It’s hard to say for sure. One theory might be that those scalable, repeatable results we found earlier that serve as benchmarks for enterprise are difficult to attain, but the way agencies evolve might serve them better. Agencies tend to develop somewhat organically — expanding their processes over time and focusing on SEO from day one — as opposed to an in-house team in a company, which rarely was there from day one and, more often than not, sprouted up when the company’s growth made it such that marketing became a priority. One clue for answering this question might come from examining the differences between how agencies and in-house SEO teams responded to the question asking them what they find to be the top two most difficult SEO obstacles they are currently facing. Agencies have direction, need budget; in-house teams have budget, need directionIf we look at the top three obstacles faced by agencies and in-house teams, both of them place finding SEO talent up there. Both groups also say that demonstrating ROI is an issue, although it’s more of an obstacle for agencies rather than in-house SEO teams. When we look at the third obstacles, we find the biggest reveal. While agencies find themselves hindered by trying to secure enough budget, in-house SEO teams struggle to develop the right content; this seems in line with the point we made in the previous section comparing agency versus in-house success. Agencies have the processes down, but need to work hard to fit their clients’ budgets. In-house teams have the budget they need, but have trouble lining them up to the exact processes their company needs to grow as desired. The fact that almost half of the in-house SEOs would rank developing the right content as their biggest obstacle — as opposed to just over a quarter of agencies — further supports this, particularly given how important content is to any marketing campaign. Now, let’s take a step back and dig deeper into that second obstacle we noted: demonstrating ROI. Everyone seems to be measuring success differentlyOne question that we asked of survey takers was about the top two technical SEO issues they monitor: The spread across the different factors were roughly the same across the two different groups. The most notable difference between the two groups was that even more in-house SEO teams looked at page speed, although this was the top factor for both groups. Indexation was the second biggest factor for both groups, followed by duplicate content. There seems to be some general consensus about monitoring technical SEO issues. But when we asked everyone what their top two factors are when reviewing their rankings, we got these results: For both agencies and in-house SEO teams, national-level keywords were the top factor, although this was true for almost-three quarters of in-house SEOs and about half of agencies. Interestingly, agencies focused a bit more on geo/local keywords as well as mobile. From when we first opened this data we found this striking, because it suggests a narrative where in-house SEO teams focus on more conservative, “seasoned” methods, while agencies are more likely to stay on the cutting-edge. Looking at the “Other” responses (free response), we had several write-ins from both subgroups who answered that traffic and leads were important to them. One agency survey-taker brought up a good point: that what they monitor “differs by client.” We would be remiss if we did not mention the importance of vertical-specific and client-specific approaches — even if you are working in-house, and your only client is your company. From this angle, it makes sense that everyone is measuring rankings and SEO differently. However, we would like to see a bit more clarity within the community on setting these parameters, and we hope that these results will foster that sort of discussion. Please do feel free to reply in the comments: How do you measure ROI on your SEO efforts? How do you show your campaigns’ value? What would you change about how you’re currently measuring the success of your efforts? So what’s next?We’d love to hear about your experiences, in-house or agency, and how you’ve been able to demonstrate ROI on your campaigns. We’re going to repeat this survey again next year, so stay tuned. We hope to survey a larger audience so that we can break down the groups we examine further and analyze response trends among the resulting subgroups. We wanted to do this here in this round of analysis, but were hesitant because of how small the resulting sample size would be. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "State of Enterprise SEO 2017: Overworked SEOs Need Direction"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "State of Enterprise SEO 2017: Overworked SEOs Need Direction"
    },
    {
      "level": "H3",
      "text": "What is enterprise SEO?"
    },
    {
      "level": "H3",
      "text": "What was our survey methodology?"
    },
    {
      "level": "H2",
      "text": "Team size matters — or does it?"
    },
    {
      "level": "H2",
      "text": "Enterprise SEO managers in large companies value being scalable and repeatable"
    },
    {
      "level": "H2",
      "text": "Agencies know best? (Agencies think they know best.)"
    },
    {
      "level": "H2",
      "text": "Agencies have direction, need budget; in-house teams have budget, need direction"
    },
    {
      "level": "H2",
      "text": "Everyone seems to be measuring success differently"
    },
    {
      "level": "H2",
      "text": "So what’s next?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nicole DeLeon\n          \n            Nicole DeLeon\n          \n            Nicole DeLeon"
}