{
  "url": "https://moz.com/blog/enterprise-seo-efficacy",
  "slug": "enterprise-seo-efficacy",
  "title": "Overcoming Corporate Roadblocks for Enterprise SEO Efficacy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Enterprise SEO faces different challenges than SMB SEO. If you want to see success, you'll need to create visibility for your efforts, navigate the tricky company politics, and focus on return.",
  "content": "Overcoming Corporate Roadblocks for Enterprise SEO Efficacy Advanced SEO By: Jared Gardner August 7, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jared Gardner August 7, 2017 Overcoming Corporate Roadblocks for Enterprise SEO Efficacy Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"You don’t have an SEO strategy problem. You have an organizational efficacy problem.\" That is typically what I tell our new clients at Red Door Interactive (RDI). Poor organizational efficacy can be caused by several things, most commonly a lack of labor, a lack of knowledge, or a lack of senior executive buy-in and direction. Many people would say \"efficiency\" is a more accurate term than \"efficacy,\" but I like to remind people that you can do ineffective SEO in a very efficient manner. If the work doesn’t move the needle, then there's a fatal flaw in your SEO program. At RDI, we specialize in marketing services for mid to large enterprise clients with annual revenues of our ideal client ranging from $50M/year to $20B/year. The size of clients that we work with have 50+ person marketing departments, and some with more than 1,000. Implementing profitable and evolving SEO programs is much more difficult for non-agile companies and those with marketing that predates the internet. Despite having more resources and built-in topical authority, enterprise SEO can be much harder than SMB SEO — not only because the SEO challenges are greater, but because it introduces another layer of organizational challenges. What is enterprise SEO? This same question was on a slide at a recent SEO meetup lead by Ratish Naroor, Director of SEO at Overstock.com. Ratish’s opinion of what constitutes enterprise SEO differed from mine in a few areas. Ratish’s main qualification was that the site in question had one million organic landing pages. At RDI, we work with companies that drive hundreds of millions of dollars a year in revenue through organic search. Often these sites have less than 5,000 pages, yet their digital marketing departments are twice the size of many marketing teams at e-commerce-first companies. In my opinion, there's more to consider than just the number of pages. I like to focus on the organization itself and not the size of its site; organizations whose website is its product take SEO more seriously. E-commerce retailers like Overstock, real estate sites like Zillow, and travel sites like Trip Advisor or Expedia all invest heavily in SEO programs. Many times, “old companies” that have been around 40+ years will have “old management” stakeholders who are a little late to the digital marketing party and more resistant to change. Does this late adoption of SEO and digital marketing make the organization itself any less enterprise? I don’t believe so. If it’s not just page count that matters, where do you draw the line for “enterprise SEO”? Here’s how I classify it: Corporate team structure, budgeting, and approval process. There's no hard number here, but typically 20 or more people are involved in taking web pages from an idea to a 200 status code. Some companies are so lean it will blow you away, so think more than just the total head count. Organic search as a channel can drive realistic business. SEO isn’t for every company, so it’s crucial that the company can drive top-line revenue growth through organic search. Unique and difficult SEO challenges. This may include large page counts where scaling on-page changes and crawl control is important, competitive industries where search terms have high paid CPAs, or international SEO operating in multiple languages and countries. How do you succeed at enterprise SEO? When working with an enterprise organization, there are three major areas to address in order to minimize internal SEO challenges and to see real follow-through in implementing high-value SEO ideas, strategies, and tactics. 1. Create a culture of SEO through visibility SEO can’t succeed in a silo. To get your strategies implemented, you will need full participation and cooperation with content producers, developers, legal, and department heads. It’s important to remember that companies of this size will have an established culture. Sometimes this culture is dysfunctional, and overcoming it will be an uphill battle. Tom Critchlow recently described this culture as a “grain.” The direction and depth of this \"grain\" is going dictate how much time you spend on this step, and the best way to get people involved is to keep your work visible to the decision makers: Automated reporting: Focus on showing each team/person metrics they can control Dev teams: Technical crawl reports with issues such as internal redirects or 404 reports are relevant things that they can control. We like DeepCrawl for crawl reporting. VPs and directors: High-level performance reports like M/M and Y/Y traffic and conversions give them a bird’s eye view of the site and the effects of your SEO efforts. Tying this data to a dollar figure will help make your case. This can include simple analytics data from Google Analytics, or more advanced tools such as our favorite BI tool, DOMO, or its competitor Tableau. Product owners/business units: Keyword-level data and traffic to a specific site section that a team works on. An enterprise SEO tool like BrightEdge or Conductor can make these reports easy to manage. Pro tip: Include the email of the SEO lead on these reports and encourage questions. Trainings Many marketers still think SEO is something you sprinkle on at the end of a content project, or \"something our IT team handles.\" It’s up to you to break down those assumptions and educate their team on the idea that that SEO is symbiotic with every marketing channel and department. These trainings can vary quite a bit, so find what works for the company you are working in/with. We have seen success with the following formats: lunch and learns, video recordings for SEO suites mentioned above, team-specific trainings focused on the area the team controls such as development or content research. While I’d love to say that we turned all the marketers into great SEOs, that’s rarely the case. What we typically see — and are thrilled when it happens — is an email from a product manager that says, “Hey, we are launching a new product next quarter and you mentioned it’s good to do keyword research for new pages; can you help?” Open brainstorms Share your knowledge and promote contributions to the program. When I started at RDI 2.5 years ago, our SEO program was good, but it was siloed. We had 3 people working on their own projects for clients and not really collaborating with each other. To share ideas between the (much larger) SEO team and other teams, we started hosting weekly meetings called the \"SEO Brainshare.\" Each week, one team member picks a topic or challenge and we workshop it with whoever wants to participate. We typically see 5–10 people from other teams at RDI join the meeting, which increases SEO knowledge and keeps our department top of mind. After a year of hosting these meetings religiously, we have seen a large influx in SEO work being incorporated into new and existing client programs, as well as a more multi-channel approach to everything we do at RDI. 2. Teamwork and navigating a political environment As an agency, we have to be clear with our main point of contact: “You can’t change your SEO results without changing your site. We need you to be the driver of change at your organization. RDI will arm you with the ideas, rationale, and detailed instructions, but you have to get the people in your organization to act.” While my experience is very agency-focused, in-house SEOs will have to explain a similar scenario to their managers, and the managers of the content, creative, and development teams. The best way to enable yourself for success is make sure you have access to all the players needed for SEO greatness, and they each know what’s at stake and have a certain degree of ownership from their managers. If the product owner doesn’t have a KPI tied to organic traffic or conversions on their pages, it’s highly unlikely they will prioritize and take ownership of organic traffic to those pages. For a real-world example, I’ve presented challenges and opportunities to Senior VPs and CMOs at Fortune 100 companies where executives have said, “Wow this is a huge opportunity. Why haven’t we done this yet?\" and our main client contact responds, “Because XX department hasn't been tasked with supporting us from their management, so this isn't their problem.” That’s where the politics really start to come in. You typically need to go high enough up the marketing department ladder to convince someone with power to back your initiative and direct people outside of your department to support you, holding those other people accountable for the results of the team. 3. Don’t get lost in the noise — focus on return This is undoubtedly the hardest to nail. SEO results by nature are highly ambiguous. There is a constant flux of right vs wrong, causation vs correlation, and my least favorite, the best choice between two “good” options. I recently listened to a podcast where Bill Hunt (an OG of SEO, BTW) said, \"If you can't put a dollar number on it, you won't get a dollar for it.” The hardest thing for me to do as I grew my SEO strategies from local businesses to enterprises was to eliminate SEO busy work. I needed to move away from tasks like updating ALT tags because a crawl tool flagged them as “errors,” and start focusing on projects that would have a monetary impact — like creating new site sections, reworking high-ranking titles for CTR, and consolidating competing content. There are a few ways to estimate the impact of a fix. Most involve some form of search volume X expected CTR X conversion rate. Here’s the formula in theory: (Expected click-through rate at current position X search volume for that term) X (conversion rate of site section) = Current non-brand conversions for a keyword Now you need to see how many non-brand conversions you would get if you achieved the rank you feel is plausible (this is more of an art than science; I like to use the rank of the top competitor as “achievable”): (Expected click-through rate at target position X search volume for that term) X (conversion rate of site section) = Target non-brand conversions for a keyword Then run a percent change for delta for those two numbers and you have the amount of new conversions for your project. Ideally you want to do this at scale, since you want to look at more than a single search term for a site change. Here is the excel formula for that: =IFERROR(B3*(VLOOKUP(G3,'Rank CTR'!A:B,2,0)),0) For this you'll need to have a CTR curve table in a table labeled “Rank CTR.” We used the CTR table from AWR for unbranded search, but feel free to use any CTR curve you feel is most accurate for your industry. You can even build upon your own data in Google Search Console. You will need to do this once for current estimated traffic and again after you have set your target rank numbers, then run a delta to get percent change. (The above formula and CTR curve can be found in the Content Gap Analysis template on our site.) Working in the agency world, the pressure for our recommendations to have a return is extremely high because those recommendations are measured against the cost of the retainer, even when the project might be something that tends to have a negative impact, like a domain migration. At RDI, the closest thing we have to a secret sauce for this is our Content Gap Analysis. Here’s a sample of how we present findings to clients: You can grab the Excel template from our site linked above. They say imitation is the sincerest form of flattery. In the Content Gap Analysis we look at what competitors are doing, then measure the estimated traffic for a topic area. This kind of analysis looks for gaps on our client’s site where competitors have content and we do not. We can examine the likelihood of us being successful in our next content endeavor and to put a number on the estimated traffic a competitor’s site section or page is getting. Once you find opportunities with a forecastable impact, prioritize them in content or site projects and try not to juggle too many balls at once — at least until some content projects have shipped. Don’t forget to quickly communicate the success of a project to accelerate the two factors mentioned above, even if it’s just a quick email with a screenshot from Google/Adobe Analytics. Focus on the needle-movers and communicate the value of your ideas clearly Enterprise SEO is great because it allows you the opportunity to work on sites with serious impact and serious challenges. Sometimes you must take the good with the bad, and in enterprise SEO the bad is typically the bureaucracy that comes with large companies. Focus on what matters, don’t piss anyone off, and don’t relent on the need for progress. Happy optimizing! Please share how you have conquered organization challenges in your work in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overcoming Corporate Roadblocks for Enterprise SEO Efficacy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overcoming Corporate Roadblocks for Enterprise SEO Efficacy"
    },
    {
      "level": "H2",
      "text": "What is enterprise SEO?"
    },
    {
      "level": "H2",
      "text": "How do you succeed at enterprise SEO?"
    },
    {
      "level": "H3",
      "text": "1. Create a culture of SEO through visibility"
    },
    {
      "level": "H3",
      "text": "2. Teamwork and navigating a political environment"
    },
    {
      "level": "H3",
      "text": "3. Don’t get lost in the noise — focus on return"
    },
    {
      "level": "H2",
      "text": "Focus on the needle-movers and communicate the value of your ideas clearly"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jared Gardner\n          \n            Jared Gardner\n          \n            Jared Gardner"
}