{
  "url": "https://moz.com/blog/entry-2-put-on-your-asbestos-pants-trailfire-bookmark-service-reviewed",
  "slug": "entry-2-put-on-your-asbestos-pants-trailfire-bookmark-service-reviewed",
  "title": "Entry #2: Put on Your Asbestos Pants - Trailfire Bookmark Service Reviewed - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Seattle Internet startup Trailfire is attempting to blaze a path through the web bookmarking community and straight into your disorganized life. Besides a misleading appeal to pyromaniacs, the service offers some features that are unique, straightforward to use, and potentially very advantageous.…",
  "content": "Entry #2: Put on Your Asbestos Pants - Trailfire Bookmark Service Reviewed Moz News By: Rebecca Kelley September 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 11, 2006 Entry #2: Put on Your Asbestos Pants - Trailfire Bookmark Service Reviewed Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Seattle Internet startup Trailfire is attempting to blaze a path through the web bookmarking community and straight into your disorganized life. Besides a misleading appeal to pyromaniacs, the service offers some features that are unique, straightforward to use, and potentially very advantageous. Trailfire is essentially a bookmark plug-in for your browser that allows you to make annotated \"trails\" of the web sites you visit. Once created, you can send a trail to friends or colleagues, blog it, or just use it as a personal reference for web research. There is also the ability to browse other user's trails. The annotation element is modeled after the ubiquitous Post-It note which can be placed anywhere on a web page, allowing one to mark specific information. The linear nature of creating and following the trails, and the ability to insert audio or video into one's comments is what differentiates Trailfire from social web bookmarking sites such as del.icio.us or diigo. Creating mark using Trailfire I clued a writer friend of mine into the Trailfire website and she found it extremely useful for compiling research for a story she is planning on writing. She is excited about the tool and plans on using it extensively in future research. My favorite aspect of the Trailfire tool is how it allows me to share a narrative in the trails I create. In other words, it lets me tell a story through the web sites I mark and the comments I add. This works well whether the intention is to share information or to entertain.On the downside, I had problems getting the Trailfire plug-in to work with the newest version of IE7. The installation went fine, but when I tried to mark a web page, absolutely nothing would happen. I have a feeling it may work better with IE6 as the version of IE7 I am running is proving to be quite unstable (gasps of surprise). It should be noted that a representativefrom Trailfire got back to me right away when I reported the IE7 problem through their website. So far Trailfire has worked flawlessly with Firefox. I attribute this to both having \"fire\" in their names. (It's technical, don't ask questions.)The competitive nature of the bookmarking community is likely the biggest barrier to Trailfire's success. Trailfire needs to prove that they have a service that is superior in terms of functionality and usability. I think they are on the right track, but just need to get people on board with using the product. From the buzz I'm seeing online, it seems like a lot of theearly adopters are waiting on the sidelines affecting skeptical looks. I spoke briefly with someone from Trailfire, and they told me that they are getting a lot of traffic coming to their site, but when it comes to downloads of the tool - not so much. I think if they can find ways to get more people to try it they are going to have some serious success.Trailfire is a solid idea, so it will be interesting to see if it catches on and how people end up using the tool as the community grows. I always enjoy seeing what kinds of emergent behavior or uses this kind of web 2.0 tool can inspire. Personally, I'm hoping for a new kind of web based storytelling. (Gather round the Trailfire kids, it's time for a story.)In the end, I've found that Trailfire is a tool that grows on you. I honestly think that everyone should give it a go and see what they can do with it. As a demonstration I went ahead and made a short three page annotated trail called Wild Goose Chase. If the first page doesn't inspire some web based wanderlust, then nothing will. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Entry #2: Put on Your Asbestos Pants - Trailfire Bookmark Service Reviewed"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Entry #2: Put on Your Asbestos Pants - Trailfire Bookmark Service Reviewed"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}