{
  "url": "https://moz.com/blog/environmentally-friendly-seo",
  "slug": "environmentally-friendly-seo",
  "title": "Environmentally Friendly SEO!? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There have been reports in the press today about the environmental impacts of searching the internet... and the news doesn't look good. According to some research done by a physicist at Harvard University, performing a search on Google produces approximately 7 grams of carbon dioxide, the…",
  "content": "Environmentally Friendly SEO!? User Experience (UX) B By: boybacon January 19, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: boybacon January 19, 2009 Environmentally Friendly SEO!? User Experience (UX) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There have been reports in the press today about the environmental impacts of searching the internet... and the news doesn't look good. According to some research done by a physicist at Harvard University, performing a search on Google produces approximately 7 grams of carbon dioxide, the equivalent to boiling a kettle! Now, firstly, I always find it's best to take these 'scientific' articles with a pick of salt (or maybe even a couple of handfuls), but as a web geek who does a lot of internet searches and drinks a lot of tea, I've got to say, it's got me thinking. A big part of the SEO work we do involves constantly monitoring searches for our clients. Over the course of a year, that adds up to a lot of searching and a lot of CO2! SEO going green How can we in the SEO industry be more green? Here are a couple of quick suggestions off the top of my head. It would be great to get your ideas. Blackle -- Blackle is supposedly an energy saving version of Google. The background on Google is white, and white takes a lot more energy to render on a screen than Black does, so Blackle uses less energy to produce the same results (although Blackle doesn't appear to include local listings, base results, YouTube videos, etc. in its results). Although this isn't a realistic alternative for every search, its worth bearing in mind and using when you can. This may be specific to our office, but we use a robot to crawl Google results and pull back reports on how a site performs for a set of monitored search terms. Doing this across all of our clients is a long process, so we only run this monthly, but when we do we tend to leave a machine running overnight to do this. Our new plan is to set this up on an unused machine and run this in office hours so that we can keep an eye on it and turn off the machine as soon as the job is done. Turn out the lights - the fluorescent light given off by your white hat should allow you to see what you're doing! Any more suggestions? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Environmentally Friendly SEO!?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Environmentally Friendly SEO!?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "boybacon\n          \n            boybacon"
}