{
  "url": "https://moz.com/blog/estimate-total-volume-value-of-keywords-in-niche-whiteboard-friday",
  "slug": "estimate-total-volume-value-of-keywords-in-niche-whiteboard-friday",
  "title": "How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the right combination of data, we can get a great sense for the relative value of keywords within certain markets/niches. In today's Whiteboard Friday, Rand shows you how.",
  "content": "How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche Keyword Research | Whiteboard Friday By: Rand Fishkin June 19, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 19, 2015 How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche Keyword Research | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. To get a sense for the potential value of keywords in a certain niche, we need to do more than just look at the number of searches those keywords get each month. In today's Whiteboard Friday, Rand explains what else we should be looking at, and how we can use other data to prioritize some groups over others. For reference, here's a still of this week's whiteboard. Click on it to open a high resolution image in a new tab! Video transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week I want to chat about how you can estimate the total volume and value of a large set of keywords in a market or a niche. Look, we're going to try and simplify this and reduce it to something that is actually manageable, because you can go way, way deep down a well. You could spend a year trying to figure out whether Market A or Market B is better to enter or better to chase keywords in, better to create content in. But I want to try and make it a little simple without reducing it to something that is of no value whatsoever, which unfortunately can be how some marketers have looked at this in the past. Asian noodle keywords So let's try this thought exercise. Let's say I'm a recipe site or a food site and I'm thinking I want to get into the Asian noodles scene. There's a lot of awesome Asian noodles out there. I, in fact, had Chow fun for lunch from Trove on Capitol Hill. When you come to MozCon, you have to try them. It's awesome. So maybe I'm looking at Chow fun and sort of all the keyword sets around those, that Chinese noodle world. Maybe I'm looking at pad Thai, a very popular Thai noodle, particularly in the U.S., and maybe Vietnamese rice noodles or bun. I'm trying to figure out which of these is the one that I should target. Should I start creating a lot of pad Thai recipes, a lot of Chow fun recipes? Should I go research one or the other of these? Am I going to chase the mid and long tail keywords? I'm about to invest a large amount of effort and really build up a brand around this. Which one of these should I do? Side note, this is getting more and more important as Google is moving to these topic modeling and sight specific, topic authority models. So if Google starts to identify my site as being an authority on Chow fun, I can expect to rank for all sorts of awesome stuff around it, versus if I just kind of dive in and out and have one-offs of Chow fun and 50 different other kinds of noodles. So this gets really important. The wrong way to look at AdWords data A massively oversimplified version, that a lot of people have done in the past, is to look broadly at kind of AdWords groups, the ones that AdWords selects for you, or individual keywords and say, \"Oh, okay. Well, Chow fun gets 22,000 searches a month, Pad Thai gets 165,000, and rice noodles, which is the most popular version of that query -- it could also be called Vietnamese noodles or bun noodles or something like that -- gets 27,000. So there you go, one, two, three. This is dead wrong. It's totally oversimplified. It's not taking into account all the things we have to do to really understand the market. First off, this isn't going to include all the variations, the mid and long tail keywords. So potentially there might be a ton of variations of rice noodles that actually add up to as much or more than pad Thai. Same thing with Chow fun. In fact, when I looked, it looked like there's a ton of Chow fun modifications and different kinds of things that go in there. The Pad Thai list is a little short. It's like chicken, vegetable, shrimp, and beef. Pretty simplistic. There's also no analysis of the competition going on here. Pad Thai, yeah it's popular, but it also has 50 recipe sites all bidding for it, tons of online grocers bidding for it, tons of recipes books that are bidding on that. I don't know. Then it could be that Chow fun has almost no competition whatsoever. So you're really not considering that when you look in here. Finally, and this can be important too, these numbers can be off by up to 200% plus or minus this number. So if you were to actually bid on Chow fun, you might see that you get somewhere in the 22,000 impressions per month, assuming your ad consistently shows up on page one, but you could see as little as 11,000. I've seen as much as 44,000, like huge variations and swings in either direction and not always totally consistent between these. You want them to be, but they're not always. A better process So because of that, we have to go deeper. These problems mean that we have to expend a little more energy. Not a ton. It doesn't have to be massive, but probably a week or two of work at least to try and figure this out. But it's so important I think it's worth it every time. 1) Keyword research dive First off, we're going to conduct a broad keyword research dive into each one of these. Not as much as we would do if we knew, hey, Chow fun is the one we're going to target. We're going to go deep. We're going to find every possible keyword. We're going to do kind of what I call a broad dive, not a deep dive into each market. So I might want to go, hey, I'm going to look at the AdWords suggestions and tally those up. I'm going to look at search suggest and related searches for some of the queries that I get from AdWords, some of the top ones anyway, and I'm going to do a brief competitive analysis. Maybe I'll put the domains that I'm seeing most frequently around these specific topics into SEMrush or another tool like that -- SpyFu, Key Compete or whatever your preference might be -- and see what other terms and phrases they might be ranking on. So now I've got a reasonable set. It probably didn't take me more than a few hours to put that together, if that. If I've got an efficient process for this already, maybe even less. 2) Bid on sample keyword sets Now comes the tricky part. I want you to take a small sample set, and we've done this a few times. Random might be not the right word. It's a small considered set of keywords and bid on them through AdWords. When I say \"considered,\" what I mean is a few from the long tail, a few from the chunky middle, and a few from the head of the demand curve that are getting lots and lots of searches. Now I want to point each of those to some new, high-quality pages on your site as a test. So I might make maybe one, two, or three different landing pages for each of these different sets. One of them might be around noodles. One might be around recipes. One might be around history or uses in cuisine or whatever it is. Then I am going to know from that exercise three critically important things. I'm going to know accuracy of AdWords volume estimates, which is awesome. Now I know whether these numbers mean anything or not, how far off they were or not. I could probably run for between 10 and 15 days and get a really good sense for the accuracy of AdWords. If you're feeling like being very comprehensive, run for a full month, especially if you have the budget, because you can learn even more over time, and you'll rule out any inconsistencies due to a particular spike, like maybe The New York Times recipe section features Chow fun that week and suddenly there's a huge spike or whatever it is. You can also learn relative price competition in click-through rate. This is awesome. This means that I know it costs a lot more per visitor that I'm trying to get on pad Thai. There are two really good things to know there. When a click costs more money, that also usually means there are more advertisers willing to pay for that traffic. If you're primarily on the organic side and you believe you can compete with the folks in the organic ranking, a very high bid price and payment price that you have to pay to AdWords is a good thing. If you're on the other side of that, where you think, \"Hey, look, we're not going to compete organically right now. We just don't have the domain authority to do it. It's going to take us a while,\" then a high price is a bad thing. You want that cheaper traffic so you can start to build up that brand through paid as you're growing the organic side. So it really depends on who you are and what situation you're in. Then finally you can figure out some things around click-through rate as well, which is great to know. So you can build some true model estimates and then go into your board meeting or your client pitch or whatever it is and say, \"Hey, here are the numbers.\" Lastly, you're going to learn the difficulty of content creation, like how hard was it for you to create these kinds of things. Like, \"Wow, when we write about Chow fun, it's just easy. It just rolls off. Pad Thai we have a really hard time creating unique value because everything has been done in that world. We're just not as passionate about those noodles as we are about Chow fun.\" Cool. Great, you know that. Also, assuming your test includes this, which it doesn't always have to, you can guess from sort of engagement rate, browse rate, time on site, all those kinds of things, but you can look at search conversion as well. So let's say you have some action to complete on the page -- subscribe to our email newsletter, sign up to get updates when we send them out about this recipe, or create an account so you can sign in and save this recipe. All that kind of stuff or a direct ecommerce conversion, you can learn that through your bidding test. 3) Analyze groups based on relevant factors Awesome. That's great. Now we really, really know something. Based on that, we can do a true analysis, an accurate analysis of the different groups based on: Relative value Difficulty Opportunity Growth rate ROI Growth rate might be an interpreted thing, but you can look at the Google trends to kind of figure out over time whether a broad group of terms is getting more or less popular. You could use something like Mention.net or Fresh Web Explorer from Moz to look at mentions as well. Now, you can be happy here. I might have chosen chow fun because I looked and I said, \"Hey, you know what, it did not have the most volume overall, but it did have the lightest competition, the highest return on investment. We were great at creating the content. We were able to engage our visitors there, had lots of mid and long tail terms. We think it's poised for big growth with the growth of Chinese noodles overall and the fact that the American food scene hasn't really discovered Chow fun the way they have Vietnamese noodles and pad Thai. So that is where we're placing our bet.\" Great. Now you have a real analysis. You have numbers behind it. You have estimates you can make. This process, although a little heavy, is going to get you so much further than this kind of simplistic thinking. All right, everyone, I look forward to hearing from you about how you've done analyses like these in the past, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H3",
      "text": "Asian noodle keywords"
    },
    {
      "level": "H3",
      "text": "The wrong way to look at AdWords data"
    },
    {
      "level": "H3",
      "text": "A better process"
    },
    {
      "level": "H4",
      "text": "1) Keyword research dive"
    },
    {
      "level": "H4",
      "text": "2) Bid on sample keyword sets"
    },
    {
      "level": "H3",
      "text": "If you're primarily on the organic side and you believe you can compete with the folks in the organic ranking, a very high bid price and payment price that you have to pay to AdWords is a good thing."
    },
    {
      "level": "H4",
      "text": "3) Analyze groups based on relevant factors"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}