{
  "url": "https://moz.com/blog/estimated-brand-reach-marketing-metric",
  "slug": "estimated-brand-reach-marketing-metric",
  "title": "How to Use Estimated Brand Reach as a Meaningful Marketing Metric - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "How to Use Estimated Brand Reach as a Meaningful Marketing Metric SEO Analytics By: Dominick Sorrentino February 20, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dominick Sorrentino February 20, 2023 How to Use Estimated Brand Reach as a Meaningful Marketing Metric SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Estimated brand reach is the most important high-level metric that everyone seems to either interpret incorrectly, or ignore altogether. Why? Because it’s a tough nut to crack. By definition, brand reach is a headcount of unique “individuals” who encounter your brand, and you cannot de-anonymize all the people on every one of your web channels. Simply put, two “sessions” or “users” in your analytics could really be from one person, and there’s just no way you could know. Nevertheless, you can and most definitely should estimate your brand reach. And you should, and most definitely can, use that data in a meaningful way. For instance, it’s how we confirmed that: It was time to abandon an entire paid channel in favor of a different one.There’s a near-perfect correlation between our engaged reach and our lead generation. And that’s just the tip of the iceberg. Let’s dive in. What is reach? Reach counts the number of actual people who come in contact with a particular campaign. For example, if 1,500 people see a post on Instagram, your reach is 1,500. (Warning: Take any tool claiming to give you a “reach” number with a grain of salt. As we covered earlier, it’s really hard to count unique individuals on the web). Impressions, on the other hand, is a count of views. One person can see an Instagram post multiple times. A post with a reach of 1,500 can easily have as many as 3,000 impressions if every one of those people see it twice. Brand reach takes this a step further by tracking all the individual people who have encountered any and all of your company’s campaigns across all of your channels, in a given time period. If you’re tracking brand reach correctly, every single person only gets counted once, and as far we know, that’s impossible. Google Search Console, for instance, will show you exactly how many impressions your website has achieved on Google Search over a period of time. But it won’t count unique individuals over that period. Someone could easily search two different keywords that your site is ranking for and encounter your brand twice on Google. There is no way to tie those multiple sessions back to one individual user. It would be even harder to track that individual across all of your channels. How, for instance, would you make sure that someone who found you on social, and then again on search, isn’t counted twice? The short answer is that you can’t. However, you can estimate brand reach, and it’s work worth doing. It will a) help you tie meaningful metrics to your overall brand awareness efforts, and b) give you an immense amount of insight into how that high-level brand awareness affects your deeper-funnel outcomes — something that is sorely missing in most marketing programs. Using impressions as a stand-in for pure reach We’ve accepted that we can’t count the number of users who encounter our brand. But we are confident in our ability to count total impressions, and crucially, we’ve deduced that there’s a strong relationship between impressions and reach. Common sense tells us that, if you see changes in your brand’s total impressions, there are likely changes to your reach as well. We tested this premise using one of the only channels where we can actually count pure reach vs impressions: our email marketing program. In email marketing: Reach = the number of people who receive at least one email from us each month.Impressions = the total number of emails delivered to all the people in our database each month. And, as we suspected, there is a near perfect correlation between the two, of 0.94. Interestingly, there is also a near-perfect correlation between email impressions and email engagement (someone clicking on that email) of 0.87. Admittedly, email is a very controlled channel relative to, say, search or social media. So, I went one step further and looked at how our “impressions” in Google Search Console aligned with Google Analytics’ count of “New Users” over the course of one year (which we’ll use as a stand-in for pure reach, since it only counts users once in a given timeframe): The Pearson Correlation Coefficient for impressions’ relationship to GA’s New Users is 0.69, which is very strong! In other words, more impressions typically means more unique users, (AKA, reach). Meanwhile, the relationship between GA’s New Users and GSC clicks is an astonishing 0.992, which is just 0.008 off from a perfect correlation. People much smarter than I have pointed out time and time again that GA’s user data must be taken with a grain of salt, for reasons I won’t get into here. Still, the point is that there’s ample evidence to suggest an extremely tight relationship between reach and impressions. TL;DR: If impressions change negatively or positively, there is very likely to be a corresponding change in reach, and vice versa. What we ended up with Taking all of this knowledge into account, we started tracking impressions of every single channel (except email, where we can actually use pure reach) to help determine our estimated brand reach. The outcome? This graph of our brand reach as it changes over time: It’s extremely rewarding to have this type of number for your brand, even if it is an estimate. But the greatest value here is not in the actual number; it’s in how that number changes from month to month, and more importantly, why it changes (more on this later in this post). How to track estimated reach The chart above displays our brand’s estimated reach across all our known marketing channels. Acquiring the data is as simple as going into each of these channels' analytics properties once a month, and pulling out the impressions for the prior month. Let’s go through the steps. 1. Have a spreadsheet where you can log everything. Here’s a template you can use. Feel free to update the info in the leftmost columns according to your channels. Columns G through L will populate automatically based on the data you add to columns C through F. We recommend using this layout, and tracking the data monthly, as it will make it easier for you to create pivot tables to help with your analysis. 2. Access your impression data. Every marketing mix is different, but here’s how we would access impression data for the channels we rely on: Organic search: Pull impressions for the month from Google Search Console.Email marketing: Total number of unique contacts who have successfully received at least one email from you in the current month (this is one of the few channels where we use pure reach, as opposed to impressions).Social media: Impressions pulled from Sprout, or from the native social media analytics platforms. Do the same for paid impressions. Google Ads/Adroll/other ad platform: Impressions pulled from the ad-management platform of your choosing. Website referrals: The sum of estimated page traffic from our backlinks each month. We use Ahrefs for this. The idea is that any backlink is a potential opportunity for someone to engage with our brand. Ahrefs estimates the traffic of each referring page. We can export this, and add it all up in a sheet, to get an estimate of the impressions we’re making on other websites.YouTube: Impressions from Youtube Analytics. Most of the above is self-explanatory, with a few exceptions. First, there’s email. We use pure reach as opposed to impressions for two reasons: Because we can.Because using impressions for email would vastly inflate our estimated reach number. In any given month, we send 3 million or more email messages, but only reach around 400,000 people. Email, by its nature, entails regularly messaging the same group of people. Social media, while similar (your followers are your main audience), has a much smaller reach (we are under 30,000 each month).We deliver many more emails (impressions) every month than there are unique recipients (reach). Second, is Referral traffic. This is traffic that comes from other sites onto yours, but note that it excludes email, search-engine traffic and social media traffic. These are accounted for separately. The referral source, more than any other channel, is a rough estimate. It only looks at the estimated organic page traffic, so it leaves out a large potential source of traffic in the form of other distribution channels (social, email, etc.) that website publishers may be using to promote a page. But again, reach is most valuable as a relative metric — i.e., how it changes month to month — not as an absolute number. To get the desired timeframe of one full month on Ahrefs, select “All” (so you’re actually seeing all current live links) and then show history for “last 3 months” like so: This is because Ahrefs, sadly, doesn’t let you provide custom dates on its backlink tool. My way of doing this adds a few steps, but they’re fairly intuitive once you get the hang of them (plus I made a video to help you). Start by exporting the data into a spreadsheet. Next, filter out backlinks in your sheet that were first seen after the last day of the month you’re analyzing, or last seen before the first day of that month. Finally, add up all the Page Views, and that will be your total “impressions” from referral traffic. The video below how we would pull these numbers for November, using Ahrefs: Finally, you’ll notice “branded clicks” and “branded impressions” on the template: This data, which is easily pulled from GSC (filter for queries containing your brand name) can make for some interesting correlative data. It also helps us with engagement data, since we count branded search as a form of engagement. After all, if someone’s typing your brand name into Google Search, there’s likely some intent there. How to evaluate estimated reach Once you’ve filled in all your data, your sheet will look something like the image below: That’s enough to start creating very basic pivot tables (like adding up your total reach each month). But notice all the holes and zeros? You can fill those by pulling in your engagement metrics. Let’s run through them: Organic search: Pull clicks from Google Search Console. (Optional: I also recommend pulling branded search impressions, which we count as engagements in our spreadsheet, as well as branded clicks). New Users from GA is a viable alternative to clicks (remember that near-perfect relationship?), but you won’t be able to filter for your branded impressions and clicks this way.Email marketing: Total number of “clicks” from the emails you’ve sent. We do this over opens, because opens have become less reliable; some email clients now technically open your emails before you do. Clicks in emails can be pulled from your email automation platform.Social media: Engagements (link clicks, comments, likes and reposts) pulled from Sprout, or from each social platform’s native analytics. Do the same for paid engagements. Google Ads/AdRoll/other ad platform: Interactions, or clicks, pulled from the ad platform of your choosing. Website referrals: Referral traffic from Google Analytics (these are the people who encountered your brand on an external website and then engaged with it).YouTube: Views from Youtube Analytics. Once you’ve filled in this data, your spreadsheet will look more like this: Now you have some new insights that you can create pivot tables around. Let’s look at a few: 1. Engaged reach This is the portion of your total estimated reach that has engaged with your brand. You want to see this climb every month. 2. Engagement rate This is the percentage of your estimated reach that is engaging with your brand. This is arguably your most important metric — the one you should be working to increase every month. The higher that percent, the more efficient use you’re making of the reach you have. 3. Engagement rate by channel This shows you the channels with your highest engagement rate for the current month. You can use this to flag channels that are giving you what we might call “bad” or “inefficient” reach. It affirmed our decision, for instance, to drop an entire display channel (AdRoll) in favor of another (Google Display). Month after month, we saw low engagement rates on the former. Diverting our spend away from that display channel slightly increased our cost per thousand impressions, but the added cost was more than offset by a higher engagement rate. 4. Winners and losers month-over-month You can do this as a direct comparison for reach or for engagement. The chart below is a comparison of engagements between October (blue) and November (red). We always want the red (most recent color) to be bigger than the blue (unless, of course, you’ve pulled resources or spend from a particular channel, e.g., paid Instagram in the chart below): 5. Correlation data This is where we get a little deeper into the funnel, and find some fascinating insights. There are many ways to search for correlations, and some of them are just common sense. For example, we noticed that our YouTube reach skyrocketed in a particular month. After looking into it, we determined that this was a result of running video ads on Google. But reach and engagements’ most important relationships are to leads and, better yet, leads assigned to sales reps. Here’s an example using five months of our own data: While we still need more data (5 months isn’t enough to close the book on these relationships), our current dataset suggests a few things: More reach usually means more engagement. There’s a strong relationship between reach and engagement. More reach usually means more lead gen. There’s a moderate relationship between reach and lead gen. More engagement almost always means more lead gen. There is a very strong relationship between engagement and lead gen. More engagement almost always means more assigned leads. There’s a strong relationship between engagement and leads that actually get assigned to sales people. More lead gen almost always means more assigned leads. There’s a very strong relationship between lead gen and leads getting assigned to sales people. This is just one of the ways we’ve sliced and diced the data, and it barely skims the surface of how you can evaluate your own brand reach and brand engagement data. 6. Collaborating with other marketers on your team Some of the relationships and correlations are subtler, in the sense that they relate to specific levers pulled on specific channels. For example, we were able to figure out that we can increase branded search by running broad-match-keyword Google paid search campaigns, specifically. The only reason we know this is that we meet as a team regularly to look over this data, and we’re always debriefing one another on the types of actions we’re taking on different campaigns. This structured, frequent communication helps us pull insights from the data, and from each other, that we’d otherwise never uncover. Why this work is so worth doing If at some point while reading this article you’ve thought, “dang, this seems like a lot of work,” you wouldn’t necessarily be wrong. But you wouldn’t be right, either. Because most of the actual work happens upfront — figuring out exactly which channels you’ll track, and how you’ll track them, and building out the pivot tables that will help you visualize your data month after month. Pulling the data is a monthly activity, and once you have your methods documented (write down EVERYTHING, because a month is a long time to remember precisely how you’ve pulled data), it’s pretty easy. One person on our team spends about one hour per month pulling this data, and then I spend maybe another two hours analyzing it, plus 15 minutes or so presenting it at the start of each month. We’ve only been doing this for about half a year, but it’s already filled gaps in our reporting, and it’s provided us with clues on multiple occasions of where things might be going wrong, and where we should be doubling down on our efforts. Eventually, we even hope to help use this as a forecasting tool, by understanding the relationship between reach and sales meetings, but also reach and the most meaningful metric of all: revenue. How cool would that be? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Estimated Brand Reach as a Meaningful Marketing Metric"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Estimated Brand Reach as a Meaningful Marketing Metric"
    },
    {
      "level": "H2",
      "text": "What is reach?"
    },
    {
      "level": "H2",
      "text": "Using impressions as a stand-in for pure reach"
    },
    {
      "level": "H2",
      "text": "What we ended up with"
    },
    {
      "level": "H2",
      "text": "How to track estimated reach"
    },
    {
      "level": "H2",
      "text": "How to evaluate estimated reach"
    },
    {
      "level": "H3",
      "text": "1. Engaged reach"
    },
    {
      "level": "H3",
      "text": "2. Engagement rate"
    },
    {
      "level": "H3",
      "text": "3. Engagement rate by channel"
    },
    {
      "level": "H3",
      "text": "4. Winners and losers month-over-month"
    },
    {
      "level": "H3",
      "text": "5. Correlation data"
    },
    {
      "level": "H3",
      "text": "6. Collaborating with other marketers on your team"
    },
    {
      "level": "H2",
      "text": "Why this work is so worth doing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    }
  ],
  "author": "Dominick Sorrentino\n          \n            Dominick Sorrentino\n          \n            Dominick Sorrentino"
}