{
  "url": "https://moz.com/blog/evangelizing-a-datadriven-culture",
  "slug": "evangelizing-a-datadriven-culture",
  "title": "Evangelizing a Data-Driven Culture - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Imagine this scenario: It's Monday afternoon, you just spent the first half of your day wading through last week's stas, comparing metrics, data-mining for the greater good, and assembling it into an easy-to-digest summary that speaks to the stats of your company. You sit back, finish off your…",
  "content": "Evangelizing a Data-Driven Culture SEO Analytics By: Joanna Lord March 22, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord March 22, 2011 Evangelizing a Data-Driven Culture SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Imagine this scenario: It's Monday afternoon, you just spent the first half of your day wading through last week's stats, comparing metrics, data-mining for the greater good, and assembling it into an easy-to-digest summary that speaks to the state of your company. You sit back, finish off your second (or fifth) cup of coffee, and hit \"Send\" on the all staff email alias. Momentary satisfaction hits, data euphoria surrounds you. You are a Data Master. You start your next project, occasionally checking your email. You think, \"Surely someone will respond with a reaction.\" A few minutes go by...then a few hours...then the day rolls into 5 o'clock. No response. Uhm. Maybe your email client is down? Hmmm nope. So you check with a few coworkers to see if they received it, and they answer with a less than enthusiastic, \"yeah you mean the thing with all the attachments, right?\" Ugh. Your hours of data mining have fallen on blind eyes. All those insights, and those practical suggestions for cleanup, testing, and optimization are lost in a black hole (also known as your company's inbox).How may of you know what I'm talking about? Raise your hand if you feel me.Yeah I thought so. For some reason it is beyond challenging to get some companies to care about data, and even harder to get them to embrace a data-driven culture. It seems like a no brainer, and if you polled most marketers I think they would {falsely} proclaim that they believe in a data-driven culture. Well today I'm calling their bluff. Okay so I hear you asking, \"how do we get the data-driven ball rolling?\" We got you covered. I compiled a list (while stuck on a flight with no wi-fi last week) of over 1,000 things that drove me nuts at past companies who were far from data-driven. Rather than be a Negative Nancy, I then flipped that around to come up with the top ten things you can start doing right away to help get your company on the analytics fan bus. You ready?!#10. Share the resources & log-insIt seems so obvious, but you would be surprised how many of your coworkers don't even have the credentials to login to your beloved analytics. I find sending out the information, or a link to a secure page with the credentials, can be a great reminder that the data is there, waiting to be used for benefit.#9. Send around other companys' success storiesAs you come across case studies, blog posts, or other presentations on the web that showcase data-driven marketing, take the time to send around a link. People love to hear that one dollar turned into a hundred, and often these stories discuss just that. This SEOmoz landing page case study on Conversion Rate Experts about a test and the surrounding data was hugely popular for this exact reason.#8. Get a data hub/visual dashboard I'm borrowing this one from our resident SEO superhero, Tom Critchlow. He shared an epic post a few weeks ago that covered a company's personal journey into championing a data-driven culture to both employees and office visitors by implementing a visual dashboard of their companys' KPIs. I'm not even going to try and summarize this post in a few sentences, just go read it. You'll love it, I pinky promise.#7. Give people free stuff!Do you know how many free analytic tools are out there? Like a bazillion! Okay maybe not quite that many, but there are a lot. Here at SEOmoz we send around occasional emails with new tools we come across that really catch our eye. Keeping new analytic tools and apps front of mind reiterate the power of data in our everyday tasks. Lots of these tools have free trials you can take, so get on there for 30 days atleast and see what you can get from them!#6. Hold brown bags This is one of those things we all put on our calendar and then delete when the to-do list gets too long. I personally am guilty of this. I did a Google Analytics brown bag when I first arrived at SEOmoz, and had huge hopes for a full series of them. \"Had\" being the operative word there. With that said, these are worth doing if you can sneak them in. The sad truth is most people know data is valuable, but don't use analytics because they don't know where to start. That is simply a learning curve issue. Brown bags can help fix this issue in no time. Unlimited candy supply at brown bag meeting is optional but recommended.At SEOmoz we have found people tend to appear and hang out wherever we drop loads of candy. Good to know.#5. Put together an Analytics Advisory BoardWhether its an official thing or simple a bimonthly meeting of data lovers, colleagues should collaborate to make the data dives more effective. It's not a data-driven culture if you send around summary reports every week. Everyone needs to have their hand in the data and you need to be bouncing ideas off of each other. Here at SEOmoz, Casey and myself work in our numbers a great deal, but so does Crissy (from the help team), Sarah (our COO), Jamie (VP of Marketing) and Adam (VP of Product), so it's important we leverage all of that time and see what sort of data we can compare and use more effectively.#4. Make the data relevant and person/team dependentYou know how people say a cardinal rule for speakers is to \"know your audience?\" Well the same applies here. If you want people to pay attention when you report on company metrics, you have to customize it for them. Show insights specific to their team and roadmap, show recent wins or losses that directly affect them, and advocate ideas that would help with their specific goals. These micro-focused data reports can help get teams excited about current projects and their results, and make your future discussions about data much easier to sit through.#3. Tie the data to $$$This one piggybacks off of #4. While it's important to customize the data you are presenting to the audience at hand, it's equally as important to tie every data discovery to revenue. You'll be surprised how quickly people perk up when you start projecting revenue based on metrics. Want a practical example? Here you go: At SEOmoz, we know that our conversion rate from OSE visits are 7% higher than visits to SEOmoz.org. I could project for upper management what an increase to traffic on OSE could mean in bottom-line revenue from PRO membership numbers, and make a case for putting more time into OSE. #2. Report back on wins...and lossesI bet I get some slack for this one. I have heard a lot of analysts say you should really only report on the wins. Especially for those companies running a number of tests throughout a month, reporting on the ones that fail to return profitable insights can be disheartening. Well, hog wash! I think if your engineering team put time into getting a test up, and your creative team put together some great assets, and your marketing team put together the logic for a test, they all deserve to hear the results. So buck up, find the insights (or lack there of) and report back on them. Everyone starts looking forward to these test postmortems, and it can harness excitement! Impromptu SEOmoz celebration when we hit 10,000 members. Yay!#1. Give high fives all aroundI am actually more of a hug fan myself, but HR told me I can't go hugging people every time someone gets excited about the numbers. Bummer. So instead I suggest going with high fives! What I really mean here, is never forget to thank people publically after they have given time to your data-focused efforts. Spotlight their efforts whenever possible. Saying thank you is crucial to keeping the momentum up!Might seem like that's a lot to get moving on, but in reality, these are small changes that can have a huge impact on the way things are done at your company. When people start to get excited about using new tools to help them make decisions more efficiently, they begin to do that across the board. You will find they start to evangelize the data-driven strategy for you...in meetings you aren't even attending! It's beautiful. And if all the ideas above don't work, I suggest picking up a copy of Avinash's book (for irony sake), and beating your executive over the head with it until they give in. Both approaches are pretty effective in my experience. I would love to hear what has worked for you in the comments below! Let's hear them! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Evangelizing a Data-Driven Culture"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Evangelizing a Data-Driven Culture"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}