{
  "url": "https://moz.com/blog/everyone-can-linkbait",
  "slug": "everyone-can-linkbait",
  "title": "Everyone can Linkbait - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yes, even those folks who run overly spammy credit card offers sites (of which there are hundreds of thousands if not millions) can use the tactic of linkbait. Just look at what Maeda Studio's John Maeda put together - ...",
  "content": "Everyone can Linkbait Link Building By: Rand Fishkin February 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 17, 2006 Everyone can Linkbait Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yes, even those folks who run overly spammy credit card offers sites (of which there are hundreds of thousands if not millions) can use the tactic of linkbait. Just look at what Maeda Studio's John Maeda put together - simplifying credit card debt. It's made del.icio.us popular, it's on its way at Digg, it's already linked to by some bigger bloggers and I suspect, 3 weeks from now, it'll have lots of tasty anchor text links from high quality sites sending tons of debt-laden kids in their 20's and 30's swarming. If so, John should think about throwing some Adsense on there or just letting those spammy credit card sites buy links for $2500 a month - they'll pay, too (the ROI seems to be there). What's even more remarkable is that John's tool isn't all that great - it just has the right look and feel. a few dozen hours with a talented designer and an AJAX programmer and you could stomp it. Let's see if anyone tries. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Everyone can Linkbait"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Everyone can Linkbait"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}