{
  "url": "https://moz.com/blog/evolution-of-communication-on-the-web",
  "slug": "evolution-of-communication-on-the-web",
  "title": "Evolution of Communication on the Web - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was reading from John Suler's \"The Psychology of Cyberspace\" last night and came to the conclusion that the web's communication style has actually evolved much more rapidly than I would have ever imagined. John notes several big tendencies of online interaction:\n\n    Disassociative Anonymity - no…",
  "content": "Evolution of Communication on the Web Online Advertising By: Rand Fishkin March 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 14, 2006 Evolution of Communication on the Web Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was reading from John Suler's \"The Psychology of Cyberspace\" last night and came to the conclusion that the web's communication style has actually evolved much more rapidly than I would have ever imagined. John notes several big tendencies of online interaction: Disassociative Anonymity - no one knows who anyone is Invisibility - Your movements are not tracked or known Asynchronicity - Communication takes place at different times Solipsistic Introjection - the voices on the web become voices in our head Minimizing Authority - offline reputations have little bearing on the respect received If we consider just the SEO community and forums, I think we effectively rule out most of these. Many people know who you are, or at least can identify you by your website(s) or interests and previous comments around the community When you visit forums in particular, the admins and mods all know you've been there. Assuming you take cookies, even blogs or individual sites know you from previous visits, particularly if you log in to comment, etc. Communication may be asynchronus, but with RSS feeds, email notifications and the speed of community interaction, it feels very up-to-date The voices on the web become voices of real people, often folks we then talk to over email, phone or in person at industry events Authority has almost a superceding power - big names are recognized and respected wherever they go (assuming they're known). Think of Danny Sullivan or Matt Cutts or Mike Grehan making comments in forums or at blogs I don't think John's paper was wrong, I think it's just old. And, to me it's fascinating that the web has evolved so quickly - just imagine what ten more years will bring. What do you think? Is it just our insular world that operates in this manner, or are all professional and academic communities on the web moving in this direction? What about places like MySpace or Facebook? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Evolution of Communication on the Web"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Evolution of Communication on the Web"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}