{
  "url": "https://moz.com/blog/evolution-of-the-local-algorithm-whiteboard-friday",
  "slug": "evolution-of-the-local-algorithm-whiteboard-friday",
  "title": "Evolution of the Local Algorithm - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've come a long way since the early 2000's, and local SEO has changed tremendously since the beginning of online search. In today's post, David Mihm discusses what factors affect ranking of local businesses, and how local algorithms within Google have evolved throughout the years.",
  "content": "Evolution of the Local Algorithm Whiteboard Friday By: David Mihm April 5, 2013 Table of Contents Copied! By: David Mihm April 5, 2013 Evolution of the Local Algorithm Whiteboard Friday Remember the days when doing SEO for a local business was no different than doing SEO for any other business? We've come a long way since the early 2000's, and local SEO has evolved tremendously since the beginning of online search. There are still many questions to be answered when it comes to the ever-changing landscape of local SEO: what are the factors Google is using to rank local businesses? Where should owners focus their energy? What's the new hot thing for local rankings? Our local expert, David Mihm, is here to shed some light on all of your burning local SEO questions. In today's Whiteboard Friday, David discusses what factors affect ranking of local businesses, and how local algorithms within Google have evolved throughout the years. Video Transcription \"Hey everybody. David Mihm, the Director of Local Search Strategy for SEOmoz, here doing my very first Whiteboard Friday since joining the company, and for the very first one I thought I would start with one of the most common questions that I get asked about local search, which is: What are the factors Google is using to rank local businesses? Where should I be focusing my energy? And also kind of how has that changed over time? What's the new hot thing for local rankings? So I thought I'd take you guys through kind of a brief history, from my perspective, of how the local algorithm has evolved at Google. So with the help of my handy dandy graph that I've sort of started to kick things off. Back in the late 1990's, 2000-ish, when Google first came out, many of you who have been practicing SEO for that long kind of remember, hey back in those days doing SEO for a local business was no different than doing SEO for any other kind of business. Right? You needed title tags telling what you did, where you did it, where you were located, and you needed links pointing at your site with those keywords embedded in those links, preferably from locally relevant websites. But really at that time any link that had good anchor text with location or product and service information, that's how you ranked in those 10 blue link type search results. Fast forward a little bit to January of 2008, many of you guys remember at that point Google introduced these 10 packs of local businesses right there in the main search results. So if you did a search for something like Portland injury lawyer, you'd see a map with 10 injuries lawyers' business listings rather than website information. So that was really the first point at which we saw this concept of citation start to play a role in local rankings. So Google said, \"Okay, well we know that there are 22 million businesses out there in the U.S. Less than half of them even have a website at this stage, so we have no way to gauge what the title tags are on a non-existent website, and it's not possible to send a link to a business without a website.\" Right? So Google introduced this concept of citations where they sort of tracked mentions of a business across the web. So just someone mentioning the business name with its address, with its phone number, somewhere out there on the web would count essentially as a vote for that business, just like the way links count for votes on websites. So we started to see that play a pretty big role in these rankings for 10 packs soon after they were introduced. Again, fast forward a little bit to March 2009. We started to see these 10 packs being introduced for generic queries, queries without geo-modifiers. So instead of typing in \"Portland injury lawyer,\" if you typed in something like \"injury lawyer,\" Google associated that as being a phrase with local intent. You were looking to hire somebody in your particular market, and they showed this for a ton of different phrases, things like restaurants, pizza, bakeries, things where they knew you were looking for a business in your area. It was really about at this time that we started to see reviews play a little bit larger role. So what people were saying about you on some of these primary websites that businesses were getting cited on, places like Yelp, City Search, Urban Spoon, these types of sites the reviews that users were leaving really seemed to start to play more of a role in rankings. And keep in mind that it's not like all of a sudden the importance of title tags and links went away. It's not like the importance of citations went away. But Google sort of layered on this additional ranking factor of user reviews, and not only user reviews at third party websites, like Yelp, City Search, the ones I mentioned, but also reviews left directly at Google Places. I'll switch sides here for just a second. That really started to come in to importance in April 2011, when Google rolled its Hot Pot product right into Google Places. So Google launched this Hot Pot product, essentially a precursor of Google+, where Google would surface businesses that your friends had rated higher in the search results. They launched that in about November of 2010. Just about six months after that, they integrated it right into Google Places, and again this was when we started to see especially reviews left directly at Google Places really start to play a more important role. And then everybody remembers June 2012 or actually late May 2012, when Marissa Mayer announced Google+ Local prior to leaving to take the job at Yahoo. So right there in the search results we started to see Google+ information getting surface. So the number of circles that an author of a website was in and the number of circles that a local business had in its following, those types of things started to play a role. They still don't seem to be quite as important as some of these other more traditional factors – title tags and links, user reviews, and citation information. But we do think going forward here I've got this sort of . . . to represent current time and some time in the future. We do think, most of us in the local search community, that Google will start to incorporate a few more of these Google+ signals into the local rankings. And just to speculate a little bit, because I love to speculate, going forward I also think we're going to see Google potentially integrating some offline information into the local rankings. So what do I mean by that? As we get more and more comfortable, we as a society get more and more comfortable with things like Foursquare check-ins or Facebook check-ins, using our phones to make mobile payments, using Google Wallet, or companies like Square or LevelUp, these types of things, loyalty programs, Google has acquired a company several years ago that focused on digital loyalty cards, these types of offline signals about how we're actually engaging with businesses in the real world, I think there's no reason that they wouldn't try to incorporate those into their local rankings going forward. So keep in mind through all of this Google's goal has been to identify what the most popular businesses are in a given category, in a given community, and what better way to gauge popularity than the number of people actually buying something at a business or actually visiting a business and checking in. So that's why I kind of speculate that we will start to see offline signals maybe playing a role in the future, but for right now I kind of see title tags and links, reviews, citation information, all being about equal in importance, and going forward again I think we'll start to see Google+ play a little bit more of a role as well as potentially these offline signals. So that's it for me from this week, and I hope you enjoyed this brief tour of the evolution of the local algorithm at Google.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Evolution of the Local Algorithm"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Evolution of the Local Algorithm"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}