{
  "url": "https://moz.com/blog/evolution-long-tail-keywords-coming-soon-mobile-apps",
  "slug": "evolution-long-tail-keywords-coming-soon-mobile-apps",
  "title": "Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When Google announced last month that app-only content would now stream in the SERPs via the cloud, regardless of whether that app is installed on your phone, they introduced a real game-changer into the equation. Although this update is still in beta, we should begin to think about what it could…",
  "content": "Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps Mobile SEO By: Roy Hinkis December 21, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Roy Hinkis December 21, 2015 Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last month Google made a big announcement, potentially signaling a game changer for search. Google is quietly rolling out app-only content indexing, even if that content isn’t actually hosted on the indexed app. So, what does that actually mean? The game-changing implication is that when you search Google from your phone or tablet, app-only content will “stream” directly to your mobile device — even if you don’t have the app installed. Thus, if I search for the key phrase “hotel tonight in Chicago,” I’ll see results from mobile apps that aren’t installed on my device, sending me directly to app-only content “streamed” from a virtual app hosted on the Google cloud. (Image credit: TechCrunch) How is app content indexed differently? Before this announcement, direct deep links to app content were displayed only if the matching app was already installed on your mobile device, as in the example below: (Image credit: Google) With this change, web content no longer needs to match app content. According to Google’s Rajan Patel leading the new initiative: “We want users to be able to have access to this content, regardless of whether it’s available on the web or in an app.” How will this announcement change the way applications are discovered? Well, Google is effectively lowering the bar for app indexing, and app owners can score a quick win if they act in a timely manner — a few tips on this below. The new long tail landing page for mobile The new app content streams are essentially equivalent to landing pages for a desktop website. Both share the same principal: promoting select content from the website or app. That means focusing on long tail keywords. Simply changing the title and description of the home page of the app is no longer enough — targeting those long tail keywords is going to be essential. To find the keywords that send traffic to competitors, I’ll use the SimilarWeb app analysis feature as an example. In this case, you can see how the search engine keywords that sent traffic to Snapchat's competitors — keywords searched in the Google app — drove traffic to Snapchat after the search, and were basically all keywords from app indexing. What’s the key here? Say hello to the app indexing API! In order to make this whole process possible, app developers need to implement the app indexing API. It’s not new, but now that you don’t need to match app content to web content, it can be your secret weapon to torrents of mobile traffic. The indexing API doubles as a ranking signal to Google, so all the mobile apps that implement and complete the app indexing API will gain a ranking edge. Measure mobile engagement stats Once you implement the indexing API, you'll show Google how much time users spend inside your app, and what they do there. If you need a benchmark to go by, you can measure how your competitors' apps are doing in terms of time on the app and session per user. Here’s an example from SimilarWeb's app engagement function: Again, the first thing you need to do in order to get started is implement the app indexing API, as I said earlier — since Google factors it as one of the ranking signals, it will favor the app owners that complete the process. If you want some more instruction and technical walkthroughs for getting your app indexed, you can check out this piece by Bridget Randolph on the subject. Just keep in mind that this is still in beta. Google is testing the process on a few apps that agreed to participate in this experiment. It’s still unclear when the update will be released out of beta, but I’m sure several clear winners (and losers) will emerge when this fully rolls out. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get Ready for the Evolution of Long Tail Keywords, Coming Soon to Mobile Apps"
    },
    {
      "level": "H2",
      "text": "How is app content indexed differently?"
    },
    {
      "level": "H2",
      "text": "The new long tail landing page for mobile"
    },
    {
      "level": "H2",
      "text": "Say hello to the app indexing API!"
    },
    {
      "level": "H2",
      "text": "Measure mobile engagement stats"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Roy Hinkis\n          \n            Roy Hinkis\n          \n            Roy Hinkis"
}