{
  "url": "https://moz.com/blog/examining-the-top-150-inlinked-posts-at-seomoz",
  "slug": "examining-the-top-150-inlinked-posts-at-seomoz",
  "title": "Examining the Top 150 In-Linked Posts at SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Though it's certainly not the most hyped, an SEOmoz tool I took an immediate fascination with is the Top Pages tool (found in SEOmoz Labs - PRO only). What it does is very simple yet powerful: you give it a domain, and it returns a list of the pages at that domain that are linked to by the most…",
  "content": "Examining the Top 150 In-Linked Posts at SEOmoz Link Building By: Mike Tekula September 25, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mike Tekula September 25, 2009 Examining the Top 150 In-Linked Posts at SEOmoz Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Though it's certainly not the most hyped, an SEOmoz tool I took an immediate fascination with is the Top Pages tool (found in SEOmoz Labs - PRO only). What it does is very simple yet powerful: you give it a domain, and it returns a list of the pages at that domain that are linked to by the most root domains (sorted highest to lowest). I'm a firm believer that the second best way to learn is by example (the first is to try yourself and fail repeatedly - if you can afford it). Since it's no secret that the SEOmoz Daily SEO Blog is one of the most widely-read in the space (with ~50k subscribers) and Rand & Co. are quite successful at building links I thought I'd turn the Top Pages tool back on SEOmoz and examine the most linked-to posts at the blog here. The aim: to study a prime example of a link-attracting blog in our space and draw some insight from the style, content and topics of posts that have attracted the most links for SEOmoz - insight that we can (hopefully) all use to improve our own content creation methods. Note: This data represents a snapshot in time - so some of these numbers will have changed by the time you read this (if SEOmoz has updated Linkscape by then). I also experienced some odd results involving 301 redirects - old blog URLs with ID variables which were 301'd to new URLs weren't showing up properly in Linkscape (the data set that Top Pages is based on). In short, I had to manually add up some of the In-Linking Domain counts. Yes, it was tedious. The Data I decided to cap the sample at the top 150 posts. This was mainly to keep the list manageable and focus on the real \"home run\" successes. I gathered the following metrics: Post Title Post URL Post Category Number of in-linking domains Post is a list? (Ex: Top 10 Ways to X...) Post contains images/video? Post originated at YouMoz? On to the meat and potatoes... Does the list post format (\"X Ways to...\") attract more links? The value of the list format for posts and how this helps your content go viral is beaten to death - but we still accept that the format works. How well has it worked for SEOmoz? Of the top 150 posts, 38 of them were presented in the list format. The remaining 112 posts in the Top 150 were not presented in the list format. While list-oriented posts are commonly considered a powerful way to make your content more shareable (and attract links) the most successful link building posts at SEOmoz were writtein in a non-list format. However, list posts can still be quite successful in attracting links (see below). The Top 5 In-Linked List Posts at SEOmoz: 21 Tactics to Increase Blog Traffic (275 In-Linking Domains) 15 CSS Properties You Probably Never Use (but perhaps should) (139 In-Linking Domains) 11 Best Practices for URLs (90 In-Linking Domains) My Personal Opinion - 90% of the Rankings Equation Lies in These 4 Factors (89 In-Linking Domains) 10 Remarkably Effective Strategies for Driving Traffic (88 In-Linking Domains) The Top 5 In-Linked Non-List Posts at SEOmoz: The Web Developer's SEO Cheat Sheet (312 In-Linking Domains) Nice one, Danny! Canonical URL Tag - The Most Important Advancement in SEO Practices Since Sitemaps (139 In-Linking Domains) Matt Cutts on Nofollow, Links-Per-Page and the Value of Directories (139 In-Linking Domains) How to Ruin a Web Design - The Design Curve (117 In-Linking Domains) How Google's Rankings Algorithm Has Changed Over Time (94 In-Linking Domains) Do images/videos in posts help attract links? Most bloggers accept that a post with images tends to be more scannable and sharable. Rand has commented in the past about the boost including supporting graphics in posts provides. How has this translated into SEOmoz's own link profile? Of the 150 posts in this sample, nearly a 2/3 majority (90) of them contain either images or video content. The remaining 60 posts were text-only. SEOmoz has been more successful in attracting links with posts containing images/video than text-only posts. This might sound like common sense to a blogger, but it's nice to see it backed up with data. The takeaway here: it's worth taking the time to find or create supporting graphs/illustrations to include in your posts. What post topics(categories) attract the most links? The two categories with the most posts in the Top 150 were Link Building and Technical Issues. These two also attracted the most in-linking domains overall: The real stand-out in terms total number of in-linking domains is the Technical Issues category - followed by Link Building. This is great information when you're deciding what topic to focus on for your next blog post or article. It's also worth noting that the Blogging category, certainly not a focal topic for SEOmoz, was third in attracting the most in-linking domains overall. Think Linkerati - bloggers are a group with the means and motivation to link (and there are loads of bloggers out there). Not a bad segment to aim your next post at. :) Here are the most in-linked posts from each category (note: I'm not including categories with only one post): Analytics: The Beginner's Checklist for Learning SEO (63 ILDs) Blogging: 21 Tactics to Increase Blog Traffic (275 ILDs) Business Tactics: SEO Pricing & Costs - What Should You Charge / How Much Should You Pay? (59 ILDs) Content Creation: Every Site is Linkbait & Linkerati Worthy (37 ILDs) Events and Conferences: Mike Grehan on Those in the Sandbox (93 ILDs) Google: Matt Cutts on Nofollow, Links-Per-Page and the Value of Directories (139 ILDs) IR and Patents: How Google's Rankings Algorithm Has Changed Over Time (94 ILDs) Keyword Research: The Beginner's Checklist for Small Business SEO (65 ILDs) Link Building: 10 Remarkably Effective Strategies for Driving Traffic (88 ILDs) Misc.: A Complete Glossary of Essential SEO Jargon (83 ILDs) On-Page Issues: Best Practices for Title Tags (88 ILDs) Paid Search Ads: The Disconnect in PPC vs. SEO Spending (57 ILDs) Search and Legal Issues: Pulling a Fast One: A Clever Internet Marketer Is Trying to Trademark \"SEO\" (37 ILDs) Search Community: How to Price an SEO Campaign (51 ILDs) SEO Tools: A List of Every Website Statistic Publicly Available (62 ILDs) SEOmoz News: Ranking Factors Version 2 Released (42 ILDs) Social Media: Widgetbait Gone Wild (62 ILDs) Spamming and Black Hat: How to Handle a Google Penalty - And, an Example from the Field of Real Estate (78 ILDs) Technical Issues: The Web Developer's SEO Cheat Sheet (312 ILDs) Viral Marketing: Anatomy of a Super Digg (53 ILDs) Web Design and Usability: How to Ruin a Web Design - The Design Curve (117 ILDs) Web Development: 15 CSS Properties You Probably Never Use (but perhaps should) (139 ILDs) Websites: Five Reasons Why It's Better to be Big & Popular than Small & Niche (30 ILDs) Whiteboard Friday: Controlling the Flow of PageRank & Link Juice (33 ILDs) How about YOUmoz posts? Out of the Top 150 In-Linked posts at the SEOmoz main blog 9 originated at YOUmoz. Let's hear it for these mozzers: A Complete Glossary of Essential SEO Jargon (83 ILDs) - posted by David LaFerney Anatomy of a Super Digg (53 ILDs) - posted by DanielTynski Do Sitemaps Affect Crawlers? (39 ILDs) - posted by chenry 17 Most Common PPC Mistakes Web Marketers Make (33 ILDs) - posted by Igor Mordkovich Proof Google is Using Behavioral Data in Rankings (32 ILDs) - posted by WebGeek Divide and Conquer: Creating and Managing Your Link Campaign (30 ILDs) - posted by Crash 11 Tips for Appearing at Google Definitions (26 ILDs) - posted by Esteban_Panzera Diagrams That Can Help You Define the Proper Anchor Text of Internal Links (26 ILDs) - posted by MariaSEO SEO Since 1999 (23 ILDs) - posted by James Svoboda There are undoubtedly other ways to slice these metrics up - as well as metrics I didn't include in my research. I encourage anyone with the inclination to download the spreadsheet I compiled and chop it to bits. Just one request: keep me out of it, I'm tired of looking at this data. ;) About Mike Tekula Mike is a Web Developer and SEO Consultant working and residing in Long Island, NY. He founded Unstuck Digital, an Internet Marketing agency, in 2008 and blogs at UnstuckDigital.com. He also rambles at Twitter.com/MikeTek. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Examining the Top 150 In-Linked Posts at SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Examining the Top 150 In-Linked Posts at SEOmoz"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Tekula\n          \n            Mike Tekula\n          \n            Mike Tekula"
}