{
  "url": "https://moz.com/blog/exceptional-strides-in-the-automation-efficiency-of-seo-campaigns",
  "slug": "exceptional-strides-in-the-automation-efficiency-of-seo-campaigns",
  "title": "Epiar is Making Exceptional Strides in the Automation & Efficiency of SEO Campaigns - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Two weeks ago, I spent 90 minutes on the phone (a lifetime for me) with Epiar's Ken Jurina and Curtis Dueck (they're in a video with WebProNews here). They walked me through their propietary and incredibly advanced, internal SEO software, explaining how they're able to provide&...",
  "content": "Epiar is Making Exceptional Strides in the Automation & Efficiency of SEO Campaigns Public Relations By: Rand Fishkin May 7, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 7, 2007 Epiar is Making Exceptional Strides in the Automation & Efficiency of SEO Campaigns Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Two weeks ago, I spent 90 minutes on the phone (a lifetime for me) with Epiar's Ken Jurina and Curtis Dueck (they're in a video with WebProNews here). They walked me through their propietary and incredibly advanced, internal SEO software, explaining how they're able to provide an exceptional quality of results for their clients. I like to think that SEOmoz gives its clients excellent service, and from a strategic and consulting perspective, I believe that's true, but Ken's team at Epiar has set the bar so high, I've never seen its equal in any of the many companies I've worked with. To be quite honest, I struggled with writing this blog entry. During Ken's presentation (which felt like the unveiling of the Ark), I took almost 50 screenshots of their software, with examples of exactly how they conduct their processes for specific clients. After thinking long and hard, though, I emailed Ken. Here's the text of what I sent him: I've got a bunch of screen caps and had some ideas for a post, but I'm scrapping them. I think it would honestly hurt you more than it would help, and almost anything I write about what Epiar does on the backend will bring you competition and attention (the kind you don't want) more than positive press or clients. Let me sketch out a rough idea of what they're doing so you can understand why I was so impressed: Automated keyword research (but very, very deep) - it pulls thousands of related terms, synonyms, words frequently found on high ranking pages for the query, terms suggested by tons of keyword tools, etc. and refines and sorts these using an intelligence that shocked me, then pulls search frequency and competitiveness data (much like our KW Difficulty tool). What's left is a keyword list that looks like a human painstakingly edited and researched each variation and term individually, but was in fact created by machine. Automated search friendliness - determining where targeting is missing on a site, where it needs to go, search spidering issues, etc. Automated link discovery - finding hundreds of sites relevant to the KW research terms that have pages with forms or contact emails or ad opportunities or URL submission areas. I never thought link sourcing could be automated with this level of precision, and while it still isn't as good as a human's touch, the depth and breadth allowed for saves hundreds of man-hours per client. Competitive & industry-segment-specific research - how often is a keyword phrase targeted in a specific geography, to a specific group, in a country, etc. The answers to how much competition exists and how tough are those other sites, plus loads of other search query and industry data from a myriad of sources so vast, there were even a few I hadn't previously considered. All these systems and much, much more is available through the tools that Ken & Co. have built. To say that I was impressed would be an understatement. I was very frankly shocked. Obviously, I feel that SEOmoz can provide a very high level of service and value to our clients, but we've always been limited by scale, as have many other firms offering organic optimization companies. Epiar has broken new ground in my opinion, by using highly customized software (and bucket loads of API data grabbing + scraping) to refine the most time-consuming of SEO tasks. While they're not competing in social media marketing or linkbaiting and have even footing in terms of strategic consulting, I think it would be foolish of me, after seeing their processes, to assume that we could bring the same level of service (or detail) to a large scale keyword research or link discovery project. We're simply out-gunned. Perhaps this is the direction that all SEO work must eventually go down - high levels of data gathering, data refinement and intelligent processing combined with software architects with an exceptional grasp of SEO and the time to fine-tune their code to produce exceptional results on a consistent basis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Epiar is Making Exceptional Strides in the Automation & Efficiency of SEO Campaigns"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Epiar is Making Exceptional Strides in the Automation & Efficiency of SEO Campaigns"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}