{
  "url": "https://moz.com/blog/expert-writing-a-contrast-of-the-good-the-ugly",
  "slug": "expert-writing-a-contrast-of-the-good-the-ugly",
  "title": "Expert Writing - A Contrast of the Good & the Ugly - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I read two articles yesterday via Del.icio.us and couldn't help but be struck by the contrast between them, and the application of that reading experience to the practice of writing. Although better writing isn't the focus of this blog, it certainly does help with everything from link building to…",
  "content": "Expert Writing - A Contrast of the Good & the Ugly Moz News By: Rand Fishkin August 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 2, 2006 Expert Writing - A Contrast of the Good & the Ugly Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I read two articles yesterday via Del.icio.us and couldn't help but be struck by the contrast between them, and the application of that reading experience to the practice of writing. Although better writing isn't the focus of this blog, it certainly does help with everything from link building to public relations to branding, and thus is worthy of some attention. The first article comes from Psychology Today - A Nation of Wimps: Maybe it's the cyclist in the park, trim under his sleek metallic blue helmet, cruising along the dirt path... at three miles an hour. On his tricycle. Or perhaps it's today's playground, all-rubber-cushioned surface where kids used to skin their knees. And... wait a minute... those aren't little kids playing. Their mommies—and especially their daddies—are in there with them, coplaying or play-by-play coaching. Few take it half-easy on the perimeter benches, as parents used to do, letting the kids figure things out for themselves. Then there are the sanitizing gels, with which over a third of parents now send their kids to school, according to a recent survey. Presumably, parents now worry that school bathrooms are not good enough for their children... Let's examine some of the weaknesses that made this article hard for me to stomach and even harder to believe: Lack of concrete facts or studies to back up the suppositions Broad generalizations & stereotypes A title and subject matter based around FUD (Fear, Uncertainty, Distrust) The piece assumes that the hypothesis - today's children are overly protected - is true and seeks only those examples that back up the assumptions, rather than beginning from a unbiased perspective and seeking evidence on both sides. The second article is from Scientific American - The Expert Mind: A man walks along the inside of a circle of chess tables, glancing at each for two or three seconds before making his move. On the outer rim, dozens of amateurs sit pondering their replies until he completes the circuit. The year is 1909, the man is José Raúl Capablanca of Cuba, and the result is a whitewash: 28 wins in as many games. The exhibition was part of a tour in which Capablanca won 168 games in a row. How did he play so well, so quickly? And how far ahead could he calculate under such constraints? \"I see only one move ahead,\" Capablanca is said to have answered, \"but it is always the correct one.\" He thus put in a nutshell what a century of psychological research has subsequently established: much of the chess master's advantage over the novice derives from the first few seconds of thought. This rapid, knowledge-guided perception, sometimes called apperception, can be seen in experts in other fields as well. Just as a master can recall all the moves in a game he has played, so can an accomplished musician often reconstruct the score to a sonata heard just once. And just as the chess master often finds the best move in a flash, an expert physician can sometimes make an accurate diagnosis within moments of laying eyes on a patient. But how do the experts in these various subjects acquire their extraordinary skills? How much can be credited to innate talent and how much to intensive training? Psychologists have sought answers in studies of chess masters. The collected results of a century of such research have led to new theories explaining how the mind organizes and retrieves information. What is more, this research may have important implications for educators. Perhaps the same techniques used by chess players to hone their skills could be applied in the classroom to teach reading, writing and arithmetic. There's beauty in the approach the writer takes and the effect is an article so compelling, I've found it hard not to think about, share and discuss since my first reading. What are the features that make this content so compelling: The lead-in begins with a fascinating, truthful account of an event that illustrates the writer's conclusions Assumptions aren't made, but rather - theories that have been suggested over the past 100 years have produced research that appears to back them up Stereotypes & generalizations are made only when there is sufficient evidence to back them up - for example, \"Statistical formulas weigh a player's recent results over older ones and discount successes according to the strength of one's opponents. The results are ratings that predict the outcomes of games with remarkable reliability. If player A outrates player B by 200 points, then A will on average beat B 75 percent of the time. This prediction holds true whether the players are top-ranked or merely ordinary.\" The conclusions reached at the end of the piece aren't absolute, but instead suggest a course of action based on the discoveries discussed in the piece In much of the search industry, we present opinion as fact, and this blog is certainly no less guilty than any others. I'm hoping that the contrast above can help me (and all of us) to be better writers. p.s. With the Scientific American article, I think there's a lot more to digest and possibly, it's worthy of its own post. I've certainly seen SEOs who can look at a few searches and have a nearly instaneous gauge of the factors affecting the rankings. This piece might serve as good leverage for those who like to stay \"knee-deep in the SERPs.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Expert Writing - A Contrast of the Good & the Ugly"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Expert Writing - A Contrast of the Good & the Ugly"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}