{
  "url": "https://moz.com/blog/exploring-the-new-features-in-bing-webmaster-tools",
  "slug": "exploring-the-new-features-in-bing-webmaster-tools",
  "title": "Exploring the New Features in Bing Webmaster Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bing recently announced some pretty cool new features within their Webmaster Tools, so in this blog post we are going to delve a little deeper to see exactly what these tools are capable of.",
  "content": "Exploring the New Features in Bing Webmaster Tools SEO Tools By: Daniel Butler February 29, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daniel Butler February 29, 2012 Exploring the New Features in Bing Webmaster Tools SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Bing recently announced some pretty cool new features within their Webmaster Tools, so in this blog post we are going to delve a little deeper to see exactly what these tools are capable of. The Markup Validator (Beta) Found within the ‘Crawl’ tab of BWMT, the Beta Markup tool works in a similar way to the Google rich snippets testing tool extracting the following elements from a specified URL: Microdata Microformats RDFa Schema.org pen Graph The inclusion of the open graph is a nice touch, and I can see this coming in handy. Upon submitting a URL, we are presented with a neat extract of any featured markup. Let’s use imdb.org as an example: However other than extracting elements from a page, there seems to be little actual validation taking place. There are no references to missing elements for example, or whether the mark up could potentially generate a rich snippet. Let's take a closer look at a URL with incomplete mark up. In the following example an “fn” field is missing for the hproduct element of a page, causing a flag to be raised within Google’s testing tool: However pasting this same URL within the Bing markup validator just produces the below: The URL actually being tested here contains hreview-aggregate and extensive use of hreview but there are no references within the Bing Validator, so results are also incomplete. I really want to like this tool, but I need jam in my Victoria sponge - as this is still in a Beta format, fingers crossed for an update (or perhaps a rename). Bing Keyword Research Tool So Bing have finally released their own keyword tool: Overview of features: Broad/Exact (select ‘strict’ for exact) match keyword search volumes 6 month data history (you can select any date range within this period) Export data for a max of 100 keywords at a time Filter by country and language History feature to track previous research queries A very clean and simple to use interface but a shame that the data isn’t yet available via an API as there is going to be quite a bit of heavy lifting if you’re generating a substantial keyword research campaign, but none the less we now have some data to play with from Bing directly. There are a ton of awesome posts to check out on SEOmoz that go into detail about the keyword research process, so I’m not going to go into great detail here, but with the data available from Bing I would be looking to: Consolidate data into a single spreadsheet Obtain current rankings for each keyword in both Bing and Google Use the Google Adwords API to extract monthly search volume for each keyword Using Google analytics, marry up keywords and associated traffic Break down keywords into meaningful categories Use pivot tables/charts to compile this data for identifying key opportunities (low hanging fruit) in both search engines: Along one axis display separated search volumes for both Google and Bing, also traffic from analytics On the other axis display current ranking position in both Google and Bing Filter this chart by ranking between position 5 and 20. For illustration purposes here is a quick mock up of how this can be developed: The numbers along the bottom reflect specific keywords, but for demonstration purposes these have been labelled as numbers. Although the keyword data from Bing isn’t yet available within an API, Bing has released an API for the rest of the data within Webmaster Tools (looking forward to having a play around with this). Look forward to hearing about your experiences using Bing’s latest tools. Whew! That, my friends was my first ever SEOmoz post. Did I get round to introducing myself? I’m Dan, Senior SEO consultant at SEOgadget. I’d love to know what you think and how you’re using the new features in Bing’s toolset. Until the next time! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Exploring the New Features in Bing Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Exploring the New Features in Bing Webmaster Tools"
    },
    {
      "level": "H2",
      "text": "The Markup Validator (Beta)"
    },
    {
      "level": "H2",
      "text": "Bing Keyword Research Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Butler\n          \n            Daniel Butler\n          \n            Daniel Butler"
}