{
  "url": "https://moz.com/blog/facebook-funnel-that-converts-whiteboard-friday",
  "slug": "facebook-funnel-that-converts-whiteboard-friday",
  "title": "How to Build a Facebook Funnel That Converts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you getting the most out of your Facebook ads? In this guest-hosted Whiteboard Friday, Ryan Stewart outlines his process for using remarketing and targeted content creation to boost conversions.",
  "content": "How to Build a Facebook Funnel That Converts Social Media | Whiteboard Friday | Paid Search Marketing (PPC) By: Ryan Stewart October 14, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ryan Stewart October 14, 2016 How to Build a Facebook Funnel That Converts Social Media | Whiteboard Friday | Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. How are you using remarketing on Facebook? If you've ever felt frustrated about the ROI on FB ads, it just may be time to give them another chance. In today's guest-hosted Whiteboard Friday, Ryan Stewart outlines his process for using remarketing and targeted content creation to get more conversions out of your Facebook ad spend. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHello, Moz fans. My name is Ryan Stewart. I own digital consultancy agency WEBRIS, and I am ecstatic to be doing this week's version of Whiteboard Friday. Now, as a marketing consultant I get the pleasure of talking to fellow marketers and business owners all the time, and one of the first questions I ask them is what they're doing on Facebook, because I firmly believe there's no better way to spend your money online right now. Nine times out of ten, what they tell me is this. \"Hey, look Ryan, we spent some money, we got some fans, we got some video views, we got a lot of clicks, but ultimately that return on investment wasn't quite there, so we stopped.\" So I'm going to show you a framework today that's going to help you get more return on investment from your Facebook ad spend. Common key mistakes when it comes to Facebook ads Before we get into that framework, there are a couple of key things that I want to just check off right off the bat that might help you. These are key mistakes that I see people making all the time. The misuse of Facebook technology. What that means is not having the pixel installed, not using custom conversions, not using a tag management solution to help you out, and not really understanding and using custom audiences the right way, because those are ultimately what make remarketing and really what make this whole funnel thing really drive through. We need to understand and use custom audiences the right way, and I'm going to talk about that in here. We need between six to nine brand touchpoints. Another thing, and I kind of call this the SEO mentality, we think that just because somebody is interested or searching for red shoes that means they want to buy it. It's not the case. Especially on Facebook, there's a completely different mentality on Facebook, and we need to understand that. There's a lot of studies that show that we need between six to nine brand touchpoints before somebody is an interested sales prospect or lead, and... We need to build that value, that relationship and really build that purchase intent. We do that through content, which I'm going to talk about in depth over here as well. The lack of trust in Facebook. Again, the SEO mentality that we're constantly working against Google, Facebook is a complete opposite. They have done an amazing job optimizing their platform. All you have to do is tell it what you want it to do and it will go out and it will find the right audiences. Just have faith in the process. Trust that Facebook will get it done for you, and then you can focus on what really matters.The Facebook marketing funnel frameworkThis is the framework that I have drawn up over here. It looks like your traditional marketing funnel. It's got your awareness, interest, consideration, and purchase. But what's in it is specific to this process and Facebook ads in particular. Now I'm going to start actually not at the top. I'm going to run you through the whole thing, but I'm going to start here with interest, because this is where most people start. They build a landing page, a squeeze page that says, \"Hey, opt in for our free e-book,\" and they just start promoting it. They push it to fans. They push it to audiences that they think are interested in it. Unless you're a huge brand that has all of these touchpoints and awareness taken care of, it's very tough because people don't know who you are and they're not just going to start giving you their information and start buying just because you put up a nice landing page. 1. Build your content — whatever form works best for you.So what we need to do is build the content on top of that. That's what I have right here. So you can I've got different types of content that you can use — videos, blog posts, webinars, e-books. Whatever it is, it doesn't really matter. Create something that you're comfortable with. But what you need to focus on is really two things. Making sure that it's on your website, because then we can retarget people and get them down that funnel. Creating and building value for the people that you're targeting. So again, if you're Moz and you sell a bunch of different products — you've got your local solutions, you've got your keyword research, you've got link building solutions — we don't want to just create one piece of content. We want to create specific pieces of content that are engaging to those little sub-niches of the audience and relevant to the product, and that's key because it allows us to expand and scale this out. 2. Gather insights from people that are already aware to inform your lookalike audiences. Now once you've got that content built, what I like to start doing is promoting it to what I call warm audience. These are people that are already aware. These are your Facebook fans, your website retargeting list, your customer list, all of these people. You start by promoting the content to them, and you start analyzing the data and see what's performing best. Understand the audience segments that are driving the most engagement, driving the most purchases right off the bat, because what we can do is create lookalike audiences based on these and we can pivot into promoting this to cold audiences. Again, this is really where you can start to scale, because this is only going to take you so far. Unless you're a massive brand, it's not going to take you very far. This is really mostly for data analysis and getting some initial people into the funnel. This up here, the cold audiences, is where you really start to make your money. So again, lookalike audiences are a tremendous thing. You need to trust in Facebook that what you tell it to do, it's going to go out and find the right people. But there's other stuff you can do as well. Again, because we're not taking a landing page, we can actually go out and do some form of outreach to get more eyeballs on the page. We can go to Facebook groups. We can go to other Facebook Pages. We can say, \"Hey, I've got this really great guide, '19 Things To Do to Build Links for Local SEO.\" We can start to do some exchanges. All we need to do is start getting people to here, getting people to this content, because once they're on this content, they're in our funnel. So let me show you how this works, and this is where the Facebook ads really start to pick up and retargeting really starts to come into play.3. Remarket with an initial offer to move your audience from aware to interested. What we want to do is we want to set parameters that tell Facebook, \"Hey, anytime somebody's been to this blog post but hasn't been to our landing page, show them this ad.\" I love to use video in this case, again because video is a great way to build the brand, to hack those touchpoints, to get your face out there, and to start getting some recognition. So I like to use a video that says, \"Hey, thank you for checking out our blog posts, our webinar. We really appreciate it. But we left some things out, and those things are included on this page.\" That's how you can start to introduce your offer and get people to your landing page, your squeeze page, or your product page.4. Use another remarketing ad to move them from the interested stage to consideration. We're not done there, because there are some other things that we can do on Facebook to start really building this thing up and driving a lot more conversions. Once we get people to the landing page, not everyone is going to convert. So what we can do is we can set up another remarketing ad that's says, \"Hey Facebook, anytime that somebody has been to our landing page but hasn't been to the next page, which is our trial page, our thank you page, whatever that may be, we want to run this ad.\" Again, I like to use video again, and we can say, \"Hey, thank you for checking out our landing page, but you didn't opt in. Did you know that we have a free trial? Did you know that we offer a discount? Did you know we have a free e-book?\"Whatever it is that you're offering to get people to opt in, run that. What happens is then you get your people in your email sequence, your traditional marketing sequence. You run that on the side, but again we're not done. Because we found these people on Facebook, they're still on Facebook. There's still more that we can do. 5. Build trust with ads that share benefits, testimonials, etc.If you've got a free trial that you're giving away, a free consultation, whatever it is, a discount for your products, we want to tell people about it. We want to make sure that they're taking advantage of it, because again you know once you get somebody on email, you might have a 20% open rate, you're cutting off 80% of people. But we know they're on Facebook, so what we can do is run another remarketing ad that says, \"Hey Facebook, anytime that somebody has been to our free trial page but hasn't actually purchased, let's drive people to use it.\" You can start talking about the benefits of your product, start showing testimonials from people. Whatever it is that you can drive people to use your product and really build trust in your product, you want to take advantage of that. 6. Use your final remarketing ad to sweeten the pot and ask for the hard sell. Finally, we're still not done, because we still haven't asked for that hard sell. This is where we use our final ad that says, \"Hey Facebook, anytime that somebody has used our trial but hasn't been to our ultimate checkout page, we want to run this final ad.\" What I did, I have a course that I use that I sold using Facebook ads. What I did, I ran a very personalized video ad that said, \"Hey, thank you for checking out my content. Thank you for attending my webinar. Thank you for checking out the free trial. Look it, there's something that's holding you up from purchasing. I am willing to jump on a call with you and answer any questions that you may have.\" Obviously, that's not going to apply to every business. But figure out a final piece of value that you can add to those people to really drive them to purchase and ask for that hard sell. Again, this is kind of a quick overview of this process, but the key point here is that this part from down here's automated. All you have to focus on now is building more content and building more traffic to that content, because once you get traffic to this content — and you know tons of ways to do that, you can even rank it in organic search and get people in your funnel that way — all you have to do is focus on getting people in here. This whole funnel is automated, and it's a beautiful thing. When you do this, it takes patience. You're not going to get as many email conversions upfront, but it works. I'm telling you, if you just have faith in this process and use this to your advantage, use remarketing with everything that you can do, it will work. Again guys, my name is Ryan Stewart. Hopefully you enjoyed this presentation. For more information, again there's a ton of stuff on Moz. I have some stuff on my blog. I appreciate your time. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Build a Facebook Funnel That Converts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Build a Facebook Funnel That Converts"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Common key mistakes when it comes to Facebook ads"
    },
    {
      "level": "H2",
      "text": "The Facebook marketing funnel framework"
    },
    {
      "level": "H3",
      "text": "1. Build your content — whatever form works best for you."
    },
    {
      "level": "H3",
      "text": "2. Gather insights from people that are already aware to inform your lookalike audiences."
    },
    {
      "level": "H3",
      "text": "3. Remarket with an initial offer to move your audience from aware to interested."
    },
    {
      "level": "H3",
      "text": "4. Use another remarketing ad to move them from the interested stage to consideration."
    },
    {
      "level": "H3",
      "text": "5. Build trust with ads that share benefits, testimonials, etc."
    },
    {
      "level": "H3",
      "text": "6. Use your final remarketing ad to sweeten the pot and ask for the hard sell."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan Stewart\n          \n            Ryan Stewart\n          \n            Ryan Stewart"
}