{
  "url": "https://moz.com/blog/failed-experiment-in-ppc-arbitrage",
  "slug": "failed-experiment-in-ppc-arbitrage",
  "title": "Failed Experiment in PPC Arbitrage - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I wanted to learn about PPC arbitrage. I'm lazy though, and didn't want to bother with going to all the work Michael Gray suggested in his much more intelligent PPC arbitrage articles. My goal was to sit on my ass, set up a simply PPC campaign and make money off it. So I checked my parked domains…",
  "content": "Failed Experiment in PPC Arbitrage Paid Search Marketing (PPC) By: Gabriel Goldenberg October 29, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg October 29, 2007 Failed Experiment in PPC Arbitrage Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I wanted to learn about PPC arbitrage. However, I'm lazy and didn't want to bother with going to all the work Michael Gray suggested in his much more intelligent PPC arbitrage articles. My goal was to sit on my ass, set up a simply PPC campaign, and make money off it. I checked my parked domains for those getting traffic to see which of them might be credible when appearing in the SERPs. Then I used it to try my hand with a PPC arbitrage campaign. Here's a case study of a failed experiment in PPC arbitrage. Perhaps you can learn from my mistakes (without going to the trouble of setting up Adsense and some articles) and suggest how I can improve. Here's what I did and here's how it turned out. Step 1: KW Research I looked at my domains and found one that looked promising. Looking at what the parking keyword was, I did some Overture and AdWords suggestion research to find additional appropriate keywords to bid on. Step 2: Set Up Parking Page to Display Relevant Ads I picked my keywords (starting short tail, silly me), and typed them into the search box on my parking page. Then I grabbed the resulting URL. I shortened the URL to just include the keywords, dropping out some long generic-looking numerical parameters that I figured were irrelevant to my needs. I mean, I do it when linking to Google SERPs cuz the big G attaches plenty of strings to your search, like language and source garbage. (Lesson for those of you using Session IDs and long parameter strings: make it easy for people to shorten them if you want to get linked to.) Step 3: Write Some Ads and Set Up AdWords I tried two main ideas across three to five ads. The first idea was going with keywords and generic text, and the second was trying to guess at what benefit the searcher wanted and offering that in the ad. I punched in my bids lower than what natural parking traffic had earned me in the past and linked the ads up to the shortened keyword-only URLs. Save campaign and we're live! I checked back soon after and saw some traffic coming through. Sidenote regarding Andy Beal's opinion on Arbitrage 1.0 being junk: If you take someone searching on a broad term and funnel them to something more specific, you've helped them speed up the search process, just like \"Related searches : X, Y Z, \" results. This wasn't how I was originally doing this though, to be honest. I was going for the laziest easiest way of doing it... Buy keyword A for $X, sell Keyword A for $X +. Step 4: Track Results and Refine With the work I did in steps one to three, the results I got were pretty mediocre. The CTR on my ads was pretty low because the shortened URLs actually screwed things up and brought them to the same ads as on homepage. (Lesson learned: test your destination URLs before going live and wasting your dough! How embarrassing.) So, I lost a few dollars, corrected my mistake, and retried. Now the ads were right on and the CTR was 50% (did I mention parking CTRs can get pretty awesome?!!). The catch is that my payout according to the initial stats was Y cents/click - I was paying Y+1. That means I'm not just losing one cent a click, which would be an acceptable loss and show that the campaign just needed some minor refinement. Rather, it means I'm losing 2(Y+1) - (Y) cents every two clicks. Hmmm... Step 5: Rethink Keyword Selection Strategy My next attempt at getting this campaign working was to try out buying short tail traffic (2 or 3 word phrases) and sell it to the shortest-tail advertisers (1 word). I changed the landing pages, made sure I got the right URLs set up, and re-released the campaign to the Google searching public. Result: The CTR dropped terribly. I was seeing something like 13% - 20% CTR. In itself, this wouldn't be necessarily be a bad thing, but the shorter tail keywords weren't paying more per click either. Now I was paying Y+1 cents a click and making Y cents every 5th - 6th click . In simpler terms, it cost me 5(Y+1) cents to generate Y cents return. Ooops! Step 6: Go Loooooong Tail I'm a determined fellow - nothing if not persevering. The next thing I did was to try different keywords and go extremely deep down the longtail. The idea was still to sell the traffic further up the tail, but getting more targeted so the CTR wouldn't crash. In effect, this meant going for 4+ word phrases (6 or 7 in some cases) and pushing the traffic to 2 word phrases. Results: Still waiting on them, but it's mostly not looking great. I succeeded in buying a couple of clicks this way and they didn't convert. Part of the problem, I think, is that it's harder to write targeted ads the further down the tail you go. There's such a volume of work to do, and it's not necessarily as evident what will get a person to click your ad. Related Experiments and Notes Throughout this campaign, I was using TinyURL just for the sake of testing out an idea initially formulated by Mikkel deMib Svendsen in what I think is a brilliant article. Speaking of which, Mikkel, if you're reading this, I'd love to see your answers to my interview questions. Note: If you're going to use TinyURL or another URL shortening service (perhaps even your own), you'll need to remove AdWords' autotagging feature. This is what adds that \"?gclid\" parameter to the end of PPC ads. The problem is that the extra parameter gets you a 404 on TinyURL. Luckily, I caught this error in testing so it didn't cost me anything. Here are explanations on how to avoid gclid autotagging junk. Another thing I tried was seeing searches visitors had made of their own volition on my parking site. I used this to expand my keyword list and try out some other things but don't have enough data to share anything conclusive yet. One other idea was to write my ads in a similar fashion to those on my parking pages, so that the landing page and ad/offer would match closely. It's trickier than just relating ads to keywords or benefit ideas, since you don't control the landing page, but it can be done. Landing page control is definitely one of the challenges with domain name based arbitrage (I'm beginning to think Michael Gray's Adsense style arbitrage is easier!). Something else that was a real pain and added insult to injury was my parking provider revising my EPC downwards. Legally, they're allowed to estimate what my payout per click (earnings per click - EPC) is and then revise it down or up (up... yeah, right - never happened, even with non-arbitrage usage domains) within a day. But seeing that my EPC was in fact lower than what it had been initially estimated at... ouch! I have a hard time believing that I got smart priced, and I think this is just the parking provider seeing that there's something unusual going on and taking advantage of it to \"tax\" me. If some operator with a similar domain name opened up and made my domain a profitable typo domain (a la youtube.com making utube.com a hugely valuable typo), then I doubt this would have happened. And no, I'm not naming the parking company. My next idea is to try outbidding super short tail and funneling the traffic to longer tail keywords where advertisers might be bidding more for more targeted traffic. Also, I'm going to try out related keywords that are much cheaper, bringing the visitors to the more expensive (if not semantically related) page of ads and see how the CTR and EPC work out. Another interesting type of arbitrage I'm seeing is PPC to CPM arbitrage. If you've been using Gmail and seeing major news organizations turning up, my hunch is that's not just free distribution as part of Google News. That's buying a click for X cents when you know your advertisers are paying you a combined total of X+1 cents per page view. The strategy there is to get as much traffic as possible and make your site sticky, boosting page views (read: revenues). If any of you reading this have a site/network with a possibility to do this, let me know as I'd love to work with you - free! Just seems like a cool way to learn more and improve my PPC skills... Finally, you guys may be interested to know I'm working on another experiment: finding out why Sitelinks are attributed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Failed Experiment in PPC Arbitrage"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Failed Experiment in PPC Arbitrage"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}