{
  "url": "https://moz.com/blog/favicon-generator",
  "slug": "favicon-generator",
  "title": "Favicon Generator - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A great tool for those in webdev is Chami's favicon generator. If you're not familiar with favicons, they're the little images that are linked to a website in the browser and appear in the address bar in Firefox and the favorit...",
  "content": "Favicon Generator Design By: Rand Fishkin June 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 14, 2005 Favicon Generator Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A great tool for those in webdev is Chami's favicon generator. If you're not familiar with favicons, they're the little images that are linked to a website in the browser and appear in the address bar in Firefox and the favorites menu in IE. Favicons are useful for branding, marketing and dodging that annoying server error that Firefox issues everytime it requests a favicon.ico from your server when it doesn't exist. With the tool, all you need is a gif or jpg file that's relatively scalable and preferrably square in dimensions. The icons the tool spits out are basically ready for primetime, although those in design may wish to create their own image pixel by pixel (16 pixels X 16pixels for those who count). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Favicon Generator"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Favicon Generator"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}