{
  "url": "https://moz.com/blog/favorite-tidbits-from-pubcon-2009",
  "slug": "favorite-tidbits-from-pubcon-2009",
  "title": "Favorite Tidbits from PubCon 2009 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "PubCon does an amazing job of putting together a schedule that covers a multitude of tracks and topics. Unfortunately because of this I often end up with a case of \"session envy.\" You know, when you're sitting in a session and you start to see tweets about how great another session is. It doesn't…",
  "content": "Favorite Tidbits from PubCon 2009 SEO Events By: Jennifer Sable Lopez November 25, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez November 25, 2009 Favorite Tidbits from PubCon 2009 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Photo courtesy of Michael Dorausch It has been a couple weeks since PubCon and yes, it's taken me this long to recuperate! Bare with me here as I reminisce about my favorite tidbits over the 3 days of sessions. PubCon does an amazing job of putting together a schedule that covers a multitude of tracks and topics. Which usually means that I often end up with a case of \"session envy.\" You know, when you're sitting in a session and you start to see tweets about how great another session is. It doesn't even mean that the one you're in is bad, it's just that you want to be in two places at once. Many people were live blogging the event and obviously there have been quite a few recaps of PubCon as well. I realize I'm a little late to the game. :) But, let's get to the good stuff! While there were many great speakers and presentations there were a couple that stood out to me. What I was looking for were answers to questions that we often get either through comments on the blog or through Q & A. With that said, these are my favorite take-aways from PubCon 2009. Day 1 - How Do You Optimize For Universal and Personal Search? This was a great session, full of valuable information. The biggest takeaway for me, came from Bruce Clay. He took the road of sticking to a very specific topic, image and video content and explained how to get them indexed. Since these are topics that come up quite a bit in Q & A I was excited to get some specific information on interesting ways to index images and videos. Thanks to Virginia Nussey over at Bruce Clay sending me the actual presentation (woot!). Case Study - Indexing Images The first thing Bruce spoke about was a case study they did involving getting images with text indexed. Here are the steps they took: Take a newspaper article Scan it to create a jpg Include that image into a PDF Submit that PDF to Google Search for info in the article as a PDF and the article is found. So what happened? Well the PDF was indexed AND the text from the image was also indexed. Take a look at this SERP. The result above seems to only come up when using some data centers but not all. :) Also, the search query contains text directly from the article which is an image in the PDF. It shows up in the title and meta description. Pretty sweet eh? Obviously this isn't going to work for you in all cases, but it's an interesting way of getting images indexed and could be useful in a number of scenarios. Case Study - Indexing Video Next, Bruce went through another case study where they got a video indexed. Here are the steps they took. Take a Video Run it through our processor Edit the text transcript and save with the image When playing the video, search for words Jump into the Video You can see this most clearly at Google audio indexing in the Labs section. Do a search for \"economy\" then notice how it shows you where in the video the word \"economy\" is spoken. I can see this being the wave of the future. How awesome would it be to have your videos come up in a search for words that were spoken within the video. Yea, pretty cool. What I really liked about this presentation was that the information was displayed as a case study. If you read SEOmoz often you know how much we like to test theories out and put them to action. And although indexing images and video in this way may not be new to everyone, it's new to some people and could be a great way to enhance your sites. Day 2 - SEO/SEM Tools This was seriously one of my favorite sessions. The speakers (including Rand) had a ton of great information but the one that really stood out to me was Jim Boykin of We Build Pages. He gave away some really great tips but the one I liked the most had to do with how to find out what keywords your competitors are targeting. Here are the steps to take: Go to the Google Adwords Keyword Tool Enter in the URL of your competitor's sitemap check box for \" Include other pages on my site linked from this URL\" When you get results, Change \"Match Type\" to \"Exact Match\"to see actual searches and volume for specific phrases. Obviously not only does this help with checking out which keywords your competitors are focused on, but it can also help you make sure you're site is also focusing on the right keywords. Day 3 - The Search Engine Smackdown For me the third day was my favorite. I actually wanted to attend every session in the first slot. I ended up watching the first part of the Link Buying session and the second part of the site review with Matt Cutts. I have to admit also that I loved the fact that the PubCon team programmed Matt Cutts doing a site audit at the same time as the Link Buying session... pretty darn ingenious if you ask me! Rand posted information about the site review, so I wont go into detail but it was a great session. Although I think the best part came after the session when Matt took to shaving Evan Fishkin's head due to a bet they made while at the SEOmoz Werewolf party earlier in the week. And although that alone was pretty great, I loved the fact that while Matt was shaving Evan's head, people were asking him questions and he was answering as if it were a regular Q & A. Here's a short clip of the shaving! Ok, ok back to the Search Engine Smackdown. I should admit that I debated whether I should head back to the hotel after a long 3 days or go to the final session, and I'm glad I went! These are the topics I found most interesting... and yes they're all from Matt Cutts. Google Social Search Here's the information straight from the site: Sign in to Google and do a search. If there's relevant web content written by people in your social circle, it will automatically show up at the bottom of your search results under a section called \"Results from people in your social circle.\" To see even more social content you can click the \"Show options\" link at the top of the results page and then click on the \"Social\" link. What is your social circle? It's a combination of your Gmail chat buddies, your Gmail contacts friends, family and co-worker groups, and people you're publicly connected to on other social sites (such as Twitter and FriendFeed). Learn more about social search. I can see myself using this quite a bit. Most of my job is about \"social searches\" in general,so this one is right up my alley! It was a fun find for me. Testing for Speed As Rand mentioned in his post, Google representatives have mentioned several times that page load time is important and Matt himself said at this session that although they haven't used speed as a ranking factor in the past, that they're thinking about adding it in the future. He gave some resources on how to check the speed and ways to make it faster. http://code.google.com/speed/ - Ways to clean up your site's speed webpagetest.org - Let's you input a URL, select test location and other configuration options, then test! http://code.google.com/closure/ - a JavaScript compiler Wrap it up I'm sure if you follow me on Twitter you know quite well how I feel about Vegas. I really wish there was a good way to clone myself so I could attend multiple sessions at once. With up to 7 tracks going on at the same time, it's difficult to pick one. In the end PubCon was a hit, and it was great to meet many of our SEOmoz members and see some old friends. See you again next year! Kate Morris, Dana Lookadoo, Amanda Stewart, Jen Lopez, Kristy Bolsinger, Lyndsay Walker, Joanna Lord, Manda Otto Thanks to Dana Lookadoo for all the great photos! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Favorite Tidbits from PubCon 2009"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Favorite Tidbits from PubCon 2009"
    },
    {
      "level": "H2",
      "text": "Day 1 - How Do You Optimize For Universal and Personal Search?"
    },
    {
      "level": "H2",
      "text": "Day 2 - SEO/SEM Tools"
    },
    {
      "level": "H2",
      "text": "Day 3 - The Search Engine Smackdown"
    },
    {
      "level": "H2",
      "text": "Wrap it up"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}