{
  "url": "https://moz.com/blog/favorite-twitter-conversation-ever-search-and-the-princess-bride",
  "slug": "favorite-twitter-conversation-ever-search-and-the-princess-bride",
  "title": "Favorite Twitter Conversation Ever - Search and The Princess Bride - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Every now and then great conversations happen via Twitter -- by conversations I mean when multiple people Tweet and \"@\" each other regarding the same topic. During the day when so many people are online, there is a lot of \"noise\" which can make it pretty difficult to keep up. However, if you've…",
  "content": "Favorite Twitter Conversation Ever - Search and The Princess Bride Public Relations By: Jennifer Sable Lopez July 9, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez July 9, 2009 Favorite Twitter Conversation Ever - Search and The Princess Bride Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Every now and then great conversations happen via Twitter -- by conversations I mean when multiple people Tweet and \"@\" each other regarding the same topic. During the day when so many people are online, there is a lot of \"noise\" which can make it pretty difficult to keep up. However, if you've ever had the joy of being a part of one of the #nightcrew search marketing Twitter conversations, then you know some of the gems I'm talking about. This is actually a great way to get to know other people from the community! A couple weeks ago (yes I realize I'm late to the game here, but... well... I have work to do people!) my very favorite Twitter conversation occurred. The one and only Matt Cutts actually started the whole thing off by tweeting a great Princess Bride quote... what happened next was just sheer enjoyment. Really, who knew the search community was so into the Princess Bride? Rather than bore you to death by trying to explain it, instead I've put together a compilation of the conversation. I'm sure I've missed a number of great tweets as I may have missed them from people I'm not following (although I did do a Twitter search to gather as many as I could). But for the most part, this is how the evening went... As you all know, if Matt Cutts says to do something, most SEOs tend to jump right on it. Apparently I'm no exception. :) So, without further ado, I present to you the Princess Bride cast of characters as seen through the eyes of the SEO world. Buttercup: Vanessa Fox Buttercup: \"And to think, all that time it was your cup that was poisoned.\" Vanessa Fox: \"And to think, all that time it was your JavaScript that wasn't optimized.\" Vizzini: Jason Calacanis Vizzini: \"He didn't fall?! Inconceivable!\" Jason Calacanis: \"SEO can help?! Inconceivable!\" Inigo Montoya: Matt Cutts Inigo Montoya: \"My name is Inigo Montoya. You killed my father. Prepare to die.\" Matt Cutts: \"My name is Matt Cutts. You spammed my index. Prepare to be banned!\" Miracle Max: Michael Gray Miracle Max: \"Have fun storming the castle!\" Michael Gray: \"Good luck following the rules!\" And last, but definitely NOT least... Westley: Danny Sullivan Westley: \"You mean you wish to surrender to me? Very well, I accept.\" Danny Sullivan: \"You mean you wish to surrender to me? Very well, I accept.\" [hehe this one cracks me up] There are lots of other great characters, which ones do you think I've missed? Would you change any of these characters? PS thanks to Rand, Lindsay, Sam and Sarah for their help! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Favorite Twitter Conversation Ever - Search and The Princess Bride"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Favorite Twitter Conversation Ever - Search and The Princess Bride"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}