{
  "url": "https://moz.com/blog/fear-forgiveness",
  "slug": "fear-forgiveness",
  "title": "Fear and Forgiveness - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A bit of a personal development post tonight, and a short one.\nI recently read an introduction to a blog post from Todd Mintz that caught me off guard:\n\nI was checking into my hotel at SES San Jose last year when I noticed in the lobby a prominen...",
  "content": "Fear and Forgiveness Moz News By: Rand Fishkin April 15, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 15, 2009 Fear and Forgiveness Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A bit of a personal development post tonight, and a short one. I recently read an introduction to a blog post from Todd Mintz that caught me off guard: I was checking into my hotel at SES San Jose last year when I noticed in the lobby a prominent person in our industry…somebody who I’ve followed and read for quite some time. As he walked away from the check-in desk, I introduced myself to him and we briefly shook hands. Quickly, I determined that he was giving me a total “mobile hello” as it was quite clear that I was the only impediment between him and his evening beer / bud / bed. In my entire time in the search industry, this was the only time that I have been so thoroughly blown off by someone. I do continue to read his writings and still assume that his behavior was a consequence of my catching him at a bad moment rather him being a bad guy. However, because I’ve seen so little of him in my social media sphere, there hasn’t been any subsequent interaction that could wipe away this bad experience from how I view him. I'm pretty sure he's not talking about me personally, but it's a definitely a big fear of mine that, at one point or another during my travels, or even on the web, I've created this same impression about someone else. Perhaps I didn't reply to an email, ignored a LinkedIn request of someone I actually do know, didn't Tweet back at someone who was expecting it, or even missed recognizing a person I've met multiple times - and now they can't shake that same negative experience that Todd had. Maybe they can never read my work or hear my name without thinking of the bad taste left from that incident. You can probably tell those two paragraphs he wrote have been weighing heavily on my mind the last few days. That fear, however, has also made me think a lot about the judgments I've placed on others over the years. I think of the people who didn't recognize me, who brushed me off, who never replied to my emails. I think about the small amounts of time I've asked for that were never granted or the brief favor that was ignored. And perhaps... They're all due a bit more consideration. As I get older, I find myself with heavier workloads and more serious responsibilities. The paychecks of 20 people rely on me making the right decisions. The SEO efforts of thousands of organizations rely on me giving the right sorts of advice. The dollars of my investors and the income of my parents, grandparents and (possibly) future children are all strongly connected to these endeavors. So maybe it's time I forgave the Michael Arringtons and Greg Lindens who never replied to my emails. Time to get past the brushings off, cold shoulders or overlooked introductions. Time to let slide a few of the worse decisions made by executives I've worked with or heard about second hand. Time to have a bit more empathy for my Dad's long hours spent working when I was young, and the time and emotional energy he didn't always have. Perhaps fear is, after all, not entirely bad. Maybe it can make us a little more aware of ourselves, of our own judgments and of the human imperfection we all share. I remember specific, separate instances where friends like Danny & Rae have criticized me for always seeing too much of the good in everyone, and never seeing the whole picture. I know that I'm doing less of that now (and while it doesn't always feel good to be more judgmental, it's become an essential part of my job), but I'm also finding that I'm a bit more forgiving of certain flaws - particularly those I see in the mirror. It feels like the right thing to do. p.s. If you'd prefer not to see these types of posts on SEOmoz, feel free to use the thumbs - I know there are some folks who like to see both personal and professional posts here, and others who'd prefer it was stricly SEO/marketing value-added material. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fear and Forgiveness"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fear and Forgiveness"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}