{
  "url": "https://moz.com/blog/featured-snippets-qa",
  "slug": "featured-snippets-qa",
  "title": "The Featured Snippet Cheat Sheet and Q&A - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Dig into the SEO community's biggest questions when it comes to featured snippets. Plus, snag your free download of the Featured Snippets Cheat Sheet for strategic tips and reminders on how to win snippets of your own!",
  "content": "The Featured Snippets Cheat Sheet and Interactive Q&A Keyword Research | Content Marketing | Advanced SEO By: Britney Muller October 25, 2019 Table of Contents Copied! By: Britney Muller October 25, 2019 The Featured Snippets Cheat Sheet and Interactive Q&A Keyword Research | Content Marketing | Advanced SEO Earlier this week, I hosted a webinar all about featured snippets covering essential background info, brand-new research we've done, the results of all the tests I've performed, and key takeaways. Things didn't quite go as planned, though. We had technical difficulties that interfered with our ability to broadcast live, and lots of folks were left with questions after the recording that we weren't able to answer in a follow-up Q&A. The next best thing to a live webinar Q&A? A digital one that you can bookmark and come back to over and over again! We asked our incredibly patient, phenomenally smart attendees to submit their questions via email and promised to answer them in an upcoming blog post. We've pulled out the top recurring questions and themes from those submissions and addressed them below. If you had a question and missed the submission window, don't worry! Ask it down in the comments and we'll keep the conversation going. If you didn't get a chance to sign up for the original webinar, you can register for it on-demand here: Watch the webinar And if you're here to grab the free featured snippets cheat sheet we put together, look no further — download the PDF directly here. Print it off, tape it to your office wall, and keep featured snippets top-of-mind as you create and optimize your site content. Now, let's get to those juicy questions! 1. Can I win a featured snippet with a brand-new website? If you rank on page one for a keyword that triggers a featured snippet (in positions 1–10), you're a contender for stealing that featured snippet. It might be tougher with a new website, but you're in a position to be competitive if you're on page one — regardless of how established your site is. We've got some great Whiteboard Fridays that cover how to set a new site up for success: Launching a New Website: Your SEO Checklist10 Basic SEO Tips to Index + Rank New Content FasterHow to Rank: The SEO Checklist 2. Does Google provide a tag that identifies traffic sources from featured snippets? Is there a GTM tag for this? Unfortunately, Google does not provide a tag to help identify traffic from featured snippets. I'm not aware of a GTM tag that helps with this, either, but would love to hear any community suggestions or ideas in the comments! It's worth noting that it's currently impossible to determine what percentage of your traffic comes from the featured snippet versus the duplicate organic URL below the featured snippet. 3. Do you think it's worth targeting longer-tail question-based queries that have very low monthly searches to gain a featured snippet? Great question! My advice is this: don’t sleep on low-search-volume keywords. They often convert really well and in aggregate they can do wonders for a website. I suggest prioritizing long tail keywords that you foresee providing a high potential ROI. For example, there are millions of searches a month for the keyword “shoes.” Very competitive, but that query is pretty vague. In contrast, the keyword “size 6 red womens nike running shoes” is very specific. This searcher knows what they want and they're dialing in their search to find it. This is a great example of a long tail keyword phrase that could provide direct conversions. 4. What's the best keyword strategy for determining which queries are worth creating featured snippet-optimized content for? Dr. Pete wrote a great blog post outlining how to perform keyword research for featured snippets back in 2016. Once you've narrowed down your list of likely queries, you need to look at keywords that you rank on page one for, that trigger a snippet, and that you don't yet own. Next, narrow your list down further by what you envision will have the highest ROI for your goals. Are you trying to drive conversions? Attract top-of-funnel site visitors? Make sure the queries you target align with your business goals, and go from there. Both Moz Pro and STAT can be a big help with this process. A tactical pro tip: Use the featured snippet carousel queries as a starting point. For instance, if there's a snippet for the query \"car insurance\" with a carousel of \"in Florida,\" \"in Michigan,\" and so on, you might consider writing about state-specific topics to win those carousel snippets. For this technique, the bonus is that you don't really need to be on page one for the root term (or ranking at all) — often, carousel snippets are taken from off-SERP links. 5. Do featured snippets fluctuate according to language, i.e. if I have several versions of my site in different languages, will the snippet display for each version? This is a great question! Unfortunately, we haven’t been able to do international/multi-language featured snippet research just yet, but hope to in the future. I would suspect the featured snippet could change depending on language and search variation. The best way to explore this is to do a search in an incognito (and un-logged-in) browser window of Google Chrome.If you've performed research along these lines, let us know what you found out down in the comments! 6. Why do featured snippet opportunities fluctuate in number from day to day? Change really is the only constant in search. In the webinar, I discussed the various tests I did that caused Moz to lose a formerly won featured snippet (and what helped it reappear once again). Changes as simple as an extra period at the end of a sentence were enough to lose us the snippet. With content across the web constantly being created and edited and deprecated and in its own state of change, it's no wonder that it's tough to win and keep a featured snippet — sometimes even from one day to the next. The SERPs are incredibly volatile things, with Google making updates multiple times every day. But when it comes down to the facts, there are a few things that reliably cause volatility (is that an oxymoron?): If a snippet is pulling from a lower-ranking URL (not positions 1–3); this could mean Google is testing the best answer for the queryGoogle regularly changing which scraped content is used in each snippetFeatured snippet carousel topics changing The best way to change-proof yourself is to become an authority in your particular niche (E-A-T, remember?) and strive to rank higher to increase your chances of capturing and keeping a featured snippet. 7. How can I use Keyword Lists to find missed SERP feature opportunities? What's the best way to use them to identify keyword gaps? Keyword Lists are a wonderful area to uncover feature snippet (and other SERP feature) opportunity gaps. My favorite way to do this is to filter the Keyword List by your desired SERP feature. We’ll use featured snippets as an example. Next, sort by your website’s current rank (1–10) to determine your primary featured snippet gaps and opportunities. The filters are another great way to tease out additional gaps: Which keywords have high search volume and low competition? Which keywords have high organic CTR that you currently rank just off page one for? 8. What are best practices around reviewing the structure of content that's won a snippet, and how do I know whether it's worth replicating? Content that has won a featured snippet is definitely worth reviewing (even if it doesn’t hold the featured snippet over time). Consider why Google might have provided this as a featured snippet: Does it succinctly answer the query? Might it sound good as a voice answer? Is it comprehensive for someone looking for additional information? Does the page provide additional answers or information around the topic? Are there visual elements? It’s best to put on your detective hat and try to uncover why a piece of content might be ranking for a particular featured snippet: What part of the page is Google pulling that featured snippet content from? Is it marked up in a certain way? What other elements are on the page? Is there a common theme? What additional value can you glean from the ranking featured snippet? 9. Does Google identify and prioritize informational websites for featured snippets, or are they determined by a correlation between pages with useful information and frequency of snippets? In other words, would being an e-commerce site harm your chances of winning featured snippets, all other factors being the same? I’m not sure whether Google explicitly categorizes informational websites. They likely establish a trust metric of sorts for domains and then seek out information or content that most succinctly answers queries within their trust parameters, but this is just a hypothesis. While informational sites tend to do overwhelmingly better than other types of websites, it’s absolutely possible for an e-commerce website to find creative ways of snagging featured snippets. It’s fascinating how various e-commerce websites have found their way into current featured snippets in extremely savvy ways. Here's a super relevant example: after our webinar experienced issues and wasn't able to launch on time, I did a voice search for “how much do stamps cost” to determine how expensive it would be to send apology notes to all of our hopeful attendees. This was the voice answer: “According to stamps.com the cost of a one ounce first class mail stamp is $0.55 at the Post Office, or $.047 if you buy and print stamps online using stamps.com.” Pretty clever, right? I believe there are plenty of savvy ways like this to get your brand and offers into featured snippets. 10. When did the \"People Also Ask\" feature first appear? What changes to PAAs do you anticipate in the future? People Also Ask boxes first appeared in July 2015 as a small-scale test. Their presence in the SERPs grew over 1700% between July 2015 and March 2017, so they certainly exploded in popularity just a few years ago. Funny enough, I was one of the first SEOs to come across Google’s PAA testing — you can read about that stat and more in my original article on the subject: Infinite \"People Also Ask\" Boxes: Research and SEO Opportunities We recently published some great PAA research by Samuel Mangialavori on the Moz Blog, as well: 5 Things You Should Know About \"People Also Ask\" & How to Take Advantage And there are a couple of great articles cataloging the evolution of PAAs over the years here: What’s the deal with \"People also ask\" boxes? (2016)How the \"People also ask\" box is evolving (2017) When it comes to predicting the future of PAAs, well, we don't have a crystal ball yet, but featured snippets continue to look more and more like PAA boxes with their new-ish accordion format. Is it possible Google will merge them into a single feature someday? It's hard to say, but as SEOs, our best bet is to maintain flexibility and prepare to roll with the punches the search engines send our way. 11. Can you explain what you meant by \"15% of image URLs are not in organic\"? Sure thing! The majority of images that show up in featured snippet boxes (or to be more accurate, the webpage those images live on) do not rank organically within the first ten pages of organic search results for the featured snippet query. 12. How should content creators consider featured snippets when crafting written content? Are there any tools that can help? First and foremost, you'll want to consider the searcher. What is their intent? What desired information or content are they after? Are you providing the desired information in the medium in which they desire it most (video, images, copy, etc)? Look to the current SERPs to determine how you should be providing content to your users. Read all of the results on page one: What common themes do they have? What topics do they cover? How can you cover those better? Dr. Pete has a fantastic Whiteboard Friday that covers how to write content to win featured snippets. Check it out: How to Write Content for Answers Using the Inverted Pyramid You might also get some good advice from this classic Whiteboard Friday by Rand Fishkin: How to Appear in Google's Answer Boxes 13. \"Write quality content for people, not search engines\" seems like great advice. But should I also be using any APIs or tools to audit my content? The only really helpful tool that comes to mind is the Flesch-Kincaid readability test, but even that can be a bit disruptive to the creative process. The very best tool you might have for reviewing your content might be a real person. I would ensure that your content can be easily understood when read out loud to your targeted audience. It may help to consider whether your content, as a featured snippet, would make for an effective, helpful voice search result. 14. What's the best way to stay on top of trends when it comes to Google's featured snippets? Find publications and tools that resonate, and keep an eye on them. Some of my favorites include: MozCast to keep a pulse on the Google algorithmMonitoring tools like STAT (email alerts when you win/lose a snippet? Awesome.)Cultivating a healthy list of digital marketing heroes to follow on TwitterIndustry news publications like Search Engine Journal and, of course, the Moz Blog ;-)Subscribing to SEO newsletters like the Moz Top 10 One of the very best things you can do, though, is performing your own investigative featured snippet research within your space. Publishing the trends you observe helps our entire community grow and learn. Thank you so much to every attendee who submitted their questions. Digging into these follow-up thoughts and ideas is one of the best parts of putting on a presentation. If you've got any lingering questions after the webinar, I would love to hear them — leave me a note in the comments and I'll be on point to answer you. And if you missed the webinar sign-up, you can still access it on-demand whenever you want. We also promised you some bonus content, yeah? Here it is — I compiled all of my best tips and tricks for winning featured snippets into a downloadable cheat sheet that I hope is a helpful reference for you: Free download: The Featured Snippets Cheat Sheet There's no reason you shouldn't be able to win your own snippets when you're armed with data, drive, and a good, solid plan! Hopefully this is a great resource for you to have on hand, either to share around with colleagues or to print out and keep at your desk: Grab the cheat sheet Again, thank you so much for submitting your questions, and we'll see you in the comments for more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Featured Snippets Cheat Sheet and Interactive Q&A"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Featured Snippets Cheat Sheet and Interactive Q&A"
    },
    {
      "level": "H2",
      "text": "1. Can I win a featured snippet with a brand-new website?"
    },
    {
      "level": "H2",
      "text": "2. Does Google provide a tag that identifies traffic sources from featured snippets? Is there a GTM tag for this?"
    },
    {
      "level": "H2",
      "text": "3. Do you think it's worth targeting longer-tail question-based queries that have very low monthly searches to gain a featured snippet?"
    },
    {
      "level": "H2",
      "text": "4. What's the best keyword strategy for determining which queries are worth creating featured snippet-optimized content for?"
    },
    {
      "level": "H2",
      "text": "5. Do featured snippets fluctuate according to language, i.e. if I have several versions of my site in different languages, will the snippet display for each version?"
    },
    {
      "level": "H2",
      "text": "6. Why do featured snippet opportunities fluctuate in number from day to day?"
    },
    {
      "level": "H2",
      "text": "7. How can I use Keyword Lists to find missed SERP feature opportunities? What's the best way to use them to identify keyword gaps?"
    },
    {
      "level": "H2",
      "text": "8. What are best practices around reviewing the structure of content that's won a snippet, and how do I know whether it's worth replicating?"
    },
    {
      "level": "H2",
      "text": "9. Does Google identify and prioritize informational websites for featured snippets, or are they determined by a correlation between pages with useful information and frequency of snippets?"
    },
    {
      "level": "H3",
      "text": "In other words, would being an e-commerce site harm your chances of winning featured snippets, all other factors being the same?"
    },
    {
      "level": "H2",
      "text": "10. When did the \"People Also Ask\" feature first appear? What changes to PAAs do you anticipate in the future?"
    },
    {
      "level": "H2",
      "text": "11. Can you explain what you meant by \"15% of image URLs are not in organic\"?"
    },
    {
      "level": "H2",
      "text": "12. How should content creators consider featured snippets when crafting written content? Are there any tools that can help?"
    },
    {
      "level": "H2",
      "text": "13. \"Write quality content for people, not search engines\" seems like great advice. But should I also be using any APIs or tools to audit my content?"
    },
    {
      "level": "H2",
      "text": "14. What's the best way to stay on top of trends when it comes to Google's featured snippets?"
    },
    {
      "level": "H2",
      "text": "Free download: The Featured Snippets Cheat Sheet"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}